[
  {
    "id": "1183601882984349706",
    "author": "BatMeckley",
    "date": "2023-12-10",
    "content": "I mean, beating my dead horse from my soap box from the light at the end of the tunnel from… I think again again again the most important thing is to have the TASTE to know the difference. Any clown (not referring to you) can find out from Colt Copernicus on YouTube how to widen their mix… the thing to me that sets the pros apart is knowing if it should be done. \n\nRuairi talks a lot about mastering engineers giving the artist and label confidence that the record is DONE, cause it’s gone through his hands. It’s not just that Ruairi has great ears, he knows what those ears are supposed to be listening for. (I remember this idea crystallized a bit for me when Noah mentioned when we did a song together I was looking to achieve things in the vocal that he hadn’t even considered yet, rather than us just agreeing if it needs 5k). I send songs to Cian not because I want to make sure it still holds up on his garbage speakers, but because I want his input on whether we were right to have the vocals out front or the drums destroyed or whatever. And I feel like he has the confidence to (gently) suggest that maybe we missed the forest for the trees in 3 months of production and THIS keyboard line should be the thing that carries the chorus.\n\nIt’s all part of the wider conversation of what are we trying to bring to the table? Do we want to just do whatever we can to have our name on as many things as possible, or do we want to be the kind of artist/producer/mixer whose involvement actually matters, even if that j evolvement is “yeah, you got it mostly right, just bumped up 60hz a bit not because I’m lazy but because I genuinely think the rough works”",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156238222381293670",
    "author": "NoahNeedleman",
    "date": "2023-09-26",
    "content": "So there’s an old saying: if you wanna really know something, you gotta learn it, you gotta do it, then you gotta teach it. \n\nMy friend who mentioned wanting to learn how to mix yesterday was amazed at how fast I was able to make his track sound big and loud and open all at the same time. “My mix sounded so small and congested. Yours sounds huge.”\n\n\nBasically what I did, besides level & panning, was carve out a bunch of like 400 in all harmonic elements. All the tracks sounded good, but the density was all bunched up down in that range. \n\nAs I was explaining it to him, I had a moment of clarity about headroom. Doesn’t matter if all frequencies are present for a big and tall mix, if all the headroom is getting eaten up by everything hitting the same frequencies, the collective volume of that is gonna make everything else feel quieter. \n\nI usually think of headroom in regard to low end and transients, but it’s true for every part of a mix.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065164101371838465",
    "author": "Slow Hand",
    "date": "2023-01-17",
    "content": "A recent lesson that I've had to remind myself about was the importance of narrowing my long reverbs. Recently I've had a bad habit of keeping them full-width.\n\nI've found that it really helps my soundstage if I don't let the long verbs touch the far-left or far-right of my mix. The more I narrow my verbs the deeper it feels like my sound stage will go. Like a vanishing point on the horizon. It also opens up a lot more sonic real-estate because now elements that are panned don't have to compete with a wide reverb wash.\n\nKeeping those big verbs away from the extreme edges of my soundstage also creates contrast against my hard-panned elements and make them feel more forward.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081809069821669437",
    "author": "Slow Hand",
    "date": "2023-03-04",
    "content": "It's one of those paradoxical mix realizations: That the key to a wide mix is not by widening every instrument, but by using mostly mono elements and panning them dramatically in the stereo field so that they contrast one another.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1148656555651256320",
    "author": "chrissorem",
    "date": "2023-09-05",
    "content": "Panning for me is so dependent on the contrasting elements in the mix. For example piano and vocal only I would hard pan the piano why not use the whole stereo image. If there are guitars and synths  and piano then I’d pan the elements to where they feel the most out of the way of each other before I get into eq. Point being how can there be a go to anything when every song and arrangement is different?",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996646538178740304",
    "author": "NoahNeedleman",
    "date": "2022-07-12",
    "content": "Lotsa great thoughts here from everyone, of course. I have a feeling you know all this tho- and what you actually need is perspective… either time away or listening with someone else in the room to reveal where the issues are, and the solutions that come with. \n\nIf you don’t have time or people you trust to help get that perspective, try muting shit in the verses or interludes or choruses or posts, see what you can & can’t live without. If every part matters, than saving the very top & bottom for the choruses is a good move. \nI was always focused on stereo field, but going taller on the choruses is also on my Must list. \n\nAnd finally, detailing moments is truly where my heart is- so I love figuring out how to make every element that leads to the downbeat create the feeling of pregnant inevitably. Sometimes a super modded verb throw or a reverse that mutes right before the downbeat… somehow making things fall apart like a nude descending the staircase, then snap back together for the next downbeat… \nAssuming you’re mixing your own productions, the world’s your oyster. But even if your not, go Fucken nuts and see what the client says. IME, 9/10 they’re looking for your creativity too…. \nTl;dr, you got this, you just need a nap.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095394870589403187",
    "author": "cian riordan",
    "date": "2023-04-11",
    "content": "Things get even wider if you hard pan the mono verb to the same side as the send source. Then have another element with its own reverb panned opposite.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189728049923637368",
    "author": "chrissorem",
    "date": "2023-12-27",
    "content": "You know what the worst thing about mixing a live record is ??…….\n Panning  the drums audience perspective",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "929886184820334612",
    "author": "cian riordan",
    "date": "2022-01-09",
    "content": "They're a useful tool, but certainly not the key to having a wide sounding mix. For that, LCR hard-panning is the real move. As for wideners, I use them all the time to get things out of the middle. In mixing, I'll often use S1 or the neutron widener to spread out synth pads, reverbs, background vocals... etc. It keeps the sound in the mix, but gets it out of the way of the important stuff like Ld Vocal, drums, bass, etc. Will it collapse in mono? Sure, but who honestly gives a fuck.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017264818887081995",
    "author": "cian riordan",
    "date": "2022-09-07",
    "content": "This approach is solid. But sometimes you have so many BGVs that you can use panning as a way to create a little separation. My rule of thumb is lower voicing tend to occupy center-mid, and the higher voicings out wide to create a wider spread. Like if I was making a Queen record, I'd probably stick to your approach because the arrangement would be airtight -- and LCR would work great. But if I was fucking with some indie pop producer that has a boner for a million tracks in his session, then it's warfare and I'm just trying to place things where they work.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138986709036585050",
    "author": "cian riordan",
    "date": "2023-08-09",
    "content": "L-C-R panning + Heavy Filtering would be the name of my intermediate mixing class at Full Sale.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1226016469251526748",
    "author": "BatMeckley",
    "date": "2024-04-05",
    "content": "Make a new duplicate snare track. Gate the hell out of it. Also band pass it to roughly the frequency that’s bumming you out. Use that as your side chain key. You can bring the gain up or down to affect the threshold. On soothe use the high and low pass filter to further narrow down the offending frequency, and then use a bell eq and raise or lower it at 10k to affect the threshold. (That’s essentially soothes threshold setting). You got this.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1259622526871539906",
    "author": "chrissorem",
    "date": "2024-07-07",
    "content": "Technically yes, but often I find panning allows it to be heard more. This is why I never take mixing notes literally.  Do they want it louder or to be heard more ?",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352836837495930971",
    "author": "Slow Hand",
    "date": "2025-03-21",
    "content": "As my mixing abilities mature, one of the real pleasures has been achieving so much more with less and less.\n\nMy sessions get simpler and simpler, and 85% of the work gets done in the balances, the panning, and some well placed EQ.\n\nWho'd have guessed?",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029850405653450763",
    "author": "BatMeckley",
    "date": "2022-10-12",
    "content": "There’s also a Forrest for the trees thing going on, and also just sheer prioritization of time. I’ve read too many people argue about a compressor or microphone or which amp modeler to use or whatever and then you listen to their discography and it’s like “that is NOT the issue here”. Yes our job is to get the little things right, but also our main job is to get the big thing right too lol. You only have so much time and so much mental bandwidth, make the best decision you can and move the fack on. (Admittedly, hopefully that “best decision is informed by years of research and experience etc). \n\nI think people can confuse the fun in bickering about ATC vs PMC, with it actually being the defining aspect of what makes that particular producer or mixer.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081808656057761882",
    "author": "Slow Hand",
    "date": "2023-03-04",
    "content": "Yeah. Soft synth patches are often programmed to take up a massive amount of space and sound as impressive as possible. It's a pet-peeve of mine when presets are dripping in verb and echo. I wish more synths had a master-echo bypass option across all patches.\n\nI also immediately turn off any stereo-widening or spatial effects, and/or reduce it to mono by dropping a channel or narrowing it with a utility plugin.\n\nFunnily it took me a while to internalize the lesson that most mix elements sound best closer to mono.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202123579559514233",
    "author": "Slow Hand",
    "date": "2024-01-30",
    "content": "Also, I've been going big on making most instruments mono and getting the stereo width in my mix by panning those mono sounds in the stereo field.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1279627068069384242",
    "author": "Matt Huber",
    "date": "2024-08-31",
    "content": "I think this is an area where Soothe excels for me. \n\nMy general method: \n\n1. LISTEN and identify before opening Soothe. Make a mental note of where the problem lies in the frequency spectrum. Get very specific. \n\n2. Open up soothe and use the filters to target that narrow area. Play around with the attack & sharpness and dial in the depth until the problem starts diminishing. \n\n3. Often, that general area will feel a tad bit dull. If so, boost the area with a wide bell to bring back all the good stuff now that the weird spiky resonances are dealt with.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1373323707367559178",
    "author": "Tristan",
    "date": "2025-05-17",
    "content": "Great compressor on the right thing, usually vocals, not much else IMO. The sweet spot feels a bit narrow for my liking and the knobs are so easy to knock out of position by accident in a session. I think they’re overpriced nowadays, and the with the long wait time there are plenty of other great boxes that are also more versatile. I always liked the ballistics of the Softube Mk1 over the MKII",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996602550004486257",
    "author": "cian riordan",
    "date": "2022-07-12",
    "content": "Saving some width and sub information for the chorus helps as well.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001573640762040330",
    "author": "Slow Hand",
    "date": "2022-07-26",
    "content": "Using a delay plugin for your pre-delays is nice for a couple of reasons:\nA) Tempo-synced pre-delay values\nB) You can do things like ping-pong or spread the imaging of your pre-delays for additional effect\nC) If the delay has tone-shaping features with different personalities (like on Echo Boy Jr.) you can quickly apply different sonic character to the signal going into your reverb.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091035145844310229",
    "author": "JakeTB",
    "date": "2023-03-30",
    "content": "All of @popaganda. 's info is great here. To go one step further on the controls for a beginner- If you are using eq, that implies that you have already diagnosed a problem, which you'll be solving with eq. When you think of that problem, what words do you use? (i.e., this is way too dark, this needs a little more highs, that frequency hurts, etc.). \nIf you find yourself talking about broader things like \"highs\" or \"lows\", that probably indicates a wide Q is appropriate. If you find yourself talking about \"that ringing\" or \"the fundamental\", that probably indicates a narrow Q is appropriate. \n\nFrequency, Bandwidth (Q), and Gain are all balance elements, as eq is a tool for balancing frequencies with one another. I'd avoid using the key of the song or phase when considering eq choices as a beginner. Just train and trust your ears.\n\nA tool that can be helpful in training your ears for EQ usage is \"Blindfold EQ\" by Audiothing (https://www.audiothing.net/effects/blindfold-eq/), which is a free EQ plugin with no numbers or indicators for the controls.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207378679156580472",
    "author": "cian riordan",
    "date": "2024-02-14",
    "content": "I would imagine. Even with great hearing, your ears will have slightly different responses from eachother. Combine that with panning habits (mine are drummers perspective panning, always starting to pan things left for some reason, etc) – and things start to sound slightly foreign when you flip L-R",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240681883298300035",
    "author": "conor // wbotm",
    "date": "2024-05-16",
    "content": "tired: arguing about drum panning perspective\nwired: arguing about stereo acoustic guitar panning perspective",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1274546097510940744",
    "author": "Matt Huber",
    "date": "2024-08-17",
    "content": "To add on to what others have said \n\nValhalla delay has some definite strengths and sounds VERY good - a bit “deeper” and more detailed to my ears than Echoboy (which I still love). \n\nA few things I love: \n- the negative width control. Very handy for when you want to throw a delay to the opposite side of a dry source. \n- the diffusion knob!!! Allows you to easily slur the delay into a verb \n- LoFi mode…it’s just…so sick",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359338926242005222",
    "author": "Slow Hand",
    "date": "2025-04-08",
    "content": "This reminds me of an important point: Most sounds in the mix don't actually need to be stereo. And a snare drum is probably not one of them. You can create a lot of space in your mix by reducing all but a few key elements to mono. Keyboards and synths are a huge offender here.\n\nA lot of mixers/producers assume that the instruments need to be stereo, when in fact it's the *mix* that should be stereo. And the most \"stereo\" mix is often created by panning mono instruments in the stereo field. Getting those pan balances right is going to remove a lot of conflict between instruments sharing similar frequency ranges.\n\nYou can still have stereo reverbs and echoes, but they can often be far more narrow than the default setting of 100% width. So don't overlook narrowing your stereo elements too.\n\nIt's amazing how much you can do with nothing but faders, pan knobs, and EQ.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062146047612297276",
    "author": "NoahNeedleman",
    "date": "2023-01-09",
    "content": "Yessssss. \nFilter\nDistort\nWetness\nPanning\nProfit",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093242044685750362",
    "author": "cian riordan",
    "date": "2023-04-05",
    "content": "If you're mixing it in the context of a drumset, I tend to keep the close tom mics muted until the very end of drum sound shaping. Usually, most of the tonality is coming from the overheads/rooms and I'm just using the close mics to focus panning and add a little punch. If you're hard gating them (like I usually am), it's usually a pretty unnatural sound to really lean on them.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1096887941659377786",
    "author": "Nomograph Mastering",
    "date": "2023-04-15",
    "content": "No correlation meter!! Heavens above",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168975091590250669",
    "author": "Adam Thein",
    "date": "2023-10-31",
    "content": "translation:\n\nturn up the snare, piano, and bass a bit please, maybe a touch wider on the OHs if possible, killer mix dude",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1371129269962670172",
    "author": "JustinLeu",
    "date": "2025-05-11",
    "content": "A few more thoughts/ideas that I really like to do.\n\nIf using verb as an insert on an instrument:\n- on insert 1–put Mondomod (or any panning plugin that will change the track from mono to stereo)  then use this as the pan before the reverb. This lets you place the instrument in the stereo field of the reverb. Doing it with mondo mod allows you to keep it static but also automate movement (small or large) within the verb 🙂\n\nAnother idea:\nUse Waves StudioVerse (or similar plugin that allows this routing)\n-parallel split the dry/wet \n-wet gets what ever verb you want\n-Leave the wet panned out-wide\n-pan the dry in towards the middle \n\nDoing it with StudioVerse allows you to avoid making aux-sends and keep it all on the track level. (Very useful on bgvs)\n\nLast idea:\nUse a pan control plugin (S1, TrackControl, etc) after the verb so you can make it more mono if you want. \n\nI love verb/dly haha thanks for letting me talk  about it here…my wife is tired of hearing about it 🥲",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983933036779405322",
    "author": "samvalentine",
    "date": "2022-06-07",
    "content": "I like microshift for that kinda schmeared widening sound. I know a lotta folks here like the H3000 for stereo modulation.\nUnless your doubles are hard tuned or super vocaligned I'm surprised they'd be very mono sounding. You could try is slightly different EQ curves for each side, compressing each side independently, even a subtle flanger on each side can be cool, or maybe different styles of saturation. The options are pretty endless. I believe @oaklandmatt has mentioned in an episode that he'll pitch one double up a few cents and the other down a few cents to give a wider image.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1011996335886577714",
    "author": "Will Melones",
    "date": "2022-08-24",
    "content": "I had a teacher who suggested listening to the “edges” of the reference track. How much bass extension, air, width…and not getting caught up in the detail of the snare sound or the exact balance. Although when I’ve spent too long getting microscopic with a lead vocal or something like that, l’ll switch to the ref to reset my perspective on that element. \n\nYou know about my SoundFlow trick now, and that convenience has increased my likelihood of flipping to the ref significantly. It’s just a press of a button on my S3.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041223883103154196",
    "author": "Nomograph Mastering",
    "date": "2022-11-12",
    "content": "The number one myth that prevails about EQ is that we want to do the narrowest cut (high Q) possible. In reality it’s the opposite, we want to go as wide (low Q) as we can without breaking things",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076733469406806096",
    "author": "peterlabberton",
    "date": "2023-02-18",
    "content": "@thejadenmejia great tips and tools above, but also sometimes one or a couple targeted narrow cuts gets the job done. Sometimes it seems like it’s just chaos and horrible all around that range but it ends up just being one or two little spots ringing super loud and painfully.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153788191682347059",
    "author": "cian riordan",
    "date": "2023-09-19",
    "content": "I like panning them out a bit wider and having a distortion aux down the middle to send both to and fill in the center (blend to taste). Sans amp is often my go to for this.You get the directness of the center with a nice, big spread… if that’s what you’re going for.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355595944980385994",
    "author": "Slow Hand",
    "date": "2025-03-29",
    "content": "Funnily, I find *Panpot* most useful when I'm mixing in Pro Tools, because I dislike it's separate L/R fader paradigm that they use in the mixer. I just want a single fader to move a sound. Also, I like being to able to specify *where* in the signal path the panning gets applied. *Also,* it's really nice to be able to disable panning automation with minimal fuss.\n\nI'm sure PT has a workaround that everyone else knows that conjoins the two pan faders, but I use it so infrequently that I must be forgetting it.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "940980334961496105",
    "author": "NoahNeedleman",
    "date": "2022-02-09",
    "content": "Cian’s note on pokey frequencies is great. I mix banjo a lot (country music,) and I’ve got a couple thoughts that might be helpful if you’re not already finished. \n1) choose the top carefully. Where the “brightness” of the track is changes so much of how it’s perceived in the track. Chances are the top end is actually much lower than you’d expect. \n2) try compressing the shit out of it. Squash it allll to hell, kill the dynamics, RUIN the performance. There’s a good chance if it’s performed well it’ll turn into a punchy percussive element that adds size and excitement. \n3) make sure it’s balanced with another instrument on the other side of the the stereo field. If you don’t have one that’s playing something similar or has a similar top end, give it the old mono-verb/delay and see if that helps balance and keep it from being too distracting.\nHope that helps!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "972496717767405579",
    "author": "Josh Bowman",
    "date": "2022-05-07",
    "content": "If im panning the mono track and I have follow main pan on for the sends sometimes I want the verb to also track the same as the source panning so I use full stereo buss/stereo verb. Sometimes I want the verb to be non panned or different from the source track so I don’t hit fmp or I’ll use a mono to stereo verb….  I just woke up hope this makes sense haha",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017267193408401418",
    "author": "cian riordan",
    "date": "2022-09-07",
    "content": "The higher the part, the wider the pan, and the higher they get filtered. Not always the way, but has done me solid in dense mixes.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035418011345113111",
    "author": "Nomograph Mastering",
    "date": "2022-10-27",
    "content": "Choosing what to highlight (brighter, louder, dryer) vs what to set as a backdrop (wider, darker, wetter)",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065127081991737374",
    "author": "Eric Martin",
    "date": "2023-01-17",
    "content": "pull the faders down and reset the panning, start with drums and vocals and start filling everything else in.\n\nStrings can take a lot of verb before feeling far away but will also get you a ton of space for the other elements",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068658764686823484",
    "author": "kidcutler",
    "date": "2023-01-27",
    "content": "The h3000 plugin does the trick on acoustic, like spinal tap, how much wider can we get",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085116478354898984",
    "author": "Ross Fortune",
    "date": "2023-03-14",
    "content": "Also, if you’ve already mixed the track, I’d be thinking to make sped up versions of both the source material (played back through your existing chains) AND committed versions of your original BPM tracks. Not to mention your return FX - verb times and predelay might need to be tweaked, possibly delay feedbacks etc. Everything’s going to change, and keeping convincing/good feeling stereo image in things like verbs is one of the challenges.\n\nIt’s hard to predict what’s going to happen in any case, so for me it’s about doing the science with your science hat on, taking a break, then fucking around with options until the voodoo clicks. \n\nIt’s not the same mix or even really the same production at the new tempo - groove will change, relationship between rhythmic parts (the satisfying low end you fought for in the kick is suddenly slowing everything down) and consequently vocal parts and their associated time based effects all shifts.\n\nAnd with all that said: sometimes just blasting your printed mix with soundshifter sync mode beats everything I just described 🤷🏻‍♂️",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091063240412364910",
    "author": "NoahNeedleman",
    "date": "2023-03-30",
    "content": "Honestly it’s not as hard or scary as it sounds, and the more pro they are the more they’re likely to understand or know already what you’ll be wanting to do. \n\nSomething as simple as “when the bass is playing in the upper ranges it sounds dope but I lose some of the sub info that makes the chorus feel tall. Cool if I layer in a sub bass?” Or “I want the to get a little wider, you up for me tossing some guitars at it for more more info on the sides?” \n\nClear communication about the “why” of it usually makes it easy. \n\nCc @CK",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106968176689959003",
    "author": "Maxim",
    "date": "2023-05-13",
    "content": "To the last point, I had this moment yesterday being at what is essentially the German NAMM for the first time listening and testing so much gear. It dawned upon me how much of our mental bandwidth gets wasted on things that don’t matter. Truly majoring in minor things. \n\nAll these reps trying to get me excited about their products and then I listen to them and my first reaction is just “where’s the music in all this?” \n\nEspecially with headphones, amps, dacs, outboard, etc. None of this would move *me* forward if I spent money on it. But producing a new song will, collaborating with someone will, heck even just re-mixing a song might. You can’t buy skill (even though good monitoring can help get rid of doubt).\n\nNot trying to sound like I’m ‘over gear’ as a whole but seeing the industry behind it in full effect left me feeling uneasy. Like chasing a dream that wasn’t worth pursuing in the first place. And I’m feeling a deeper focus on creation.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154115196290338946",
    "author": "Jeremy Klein",
    "date": "2023-09-20",
    "content": "LMAO dude i put this mix on just now without seeing your comment, and no joke started checking my computers output panning section because i thought something was wrong",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179907517921378385",
    "author": "Adam Thein",
    "date": "2023-11-30",
    "content": "Make sure a lot of other things are narrow and small",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179940739350794271",
    "author": "cian riordan",
    "date": "2023-11-30",
    "content": "Hmm. It's not the norm, but if I sniff out that stem delivery is gonna be a nightmare, I'll offer them a consolidated session -- basically commit all the tracks w/ processing, volume, panning and send them that. It can be more useful for when MDs are trying to sort out arrangements for liveshows, etc.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1272317294273363999",
    "author": "Ross Fortune",
    "date": "2024-08-11",
    "content": "These are great ideas for sure, and will likely dig me out of a hole someday. On this recording though, we were going super dead/tight/dry, although there was a cool sounding adjacent tiled bathroom/chamber that I took for possible fun stuff at points in the mix. I didn’t have any mic pairs for stereo in there, so I tried a mid-side thing with a 451 and U87 in fig8. It made me feel like either a genius or a YouTuber.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342225390453653564",
    "author": "cian riordan",
    "date": "2025-02-20",
    "content": "Try to take it 95% of the way there with balance and panning. Less processing will work in your favor. It shouldn’t sound like pop mix!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355576612401451141",
    "author": "Adam Thein",
    "date": "2025-03-29",
    "content": "You can also right click the width knob on Utility and turn it into straight up mid/side levels if you want to compare.  I wouldn’t overthink it, Ableton utility does what you need.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356660150902984785",
    "author": "Brian Reynolds",
    "date": "2025-04-01",
    "content": "Those drum width and distortion parallels that Castelli and Forbes have cooked up, do SO MUCH. For how simple they are. They're going be permeant arrows in the quiver. Also, David Byrne's stylist has Castelli looking super dapper.",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "879734116428415016",
    "author": "Eric Martin",
    "date": "2021-08-24",
    "content": "I think, again, it’s knowing the reason you’re using the tool, it’s mostly used when you want to accomplish something on the sides or in the mono signal when you can’t get to the track that needs the help, if your mixing, you should go to the track that needs the work first, not a M/S tool, M/S tools are designed for working on stereo tracks and shaping things because you CANT shape the original thing you want.\n\nExample, the vocal is a little quiet in the mix, using a M/S tool to help bring the 1-2k of the vocal out in the mid without bringing out too much 1-2k of the cymbals and guitars on the sides because that balance was already where you wanted it. In this situation you can’t get to the vocal because you don’t have the track, BUT if you’re mixing, you can reach for the vocal and boost a narrow Q at 1500hz to accomplish the same task but in a cleaner way.\n\nThis is the type of reason I might reach for M/S, I don’t reach for M/S if guitars need to be brighter on the sides, I find the guitars on the sides in my mix, and make them brighter.\n\nThis is also the same reason to argue against multiple bus processing, because if the ability to use such a processor is there, we will use it, take away a bus and we have to work harder to get the mix done, but the end result can be much more effective, impactful, dynamic, and inspiring, but it takes longer and requires a lot more finesse.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "956773492106358796",
    "author": "B3Mac",
    "date": "2022-03-24",
    "content": "Agreed - correlation is not causation but 48k has hurt this man and we need to send him a card",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "972532485126770708",
    "author": "NoahNeedleman",
    "date": "2022-05-07",
    "content": "Hard and fast rules: always Stereo sends to stereo verbs and check FMP on or off depending how you want the wash to fall in the stereo field. UNLESS you’re using a  single mono verb to balance the field, in which case mono -> mono, or if you’re like me you duplicate the audio and just put the verb at 100% on the dup. Easier to conceptualize for me that way. \nRules are meant to be fucked, but that’s an easy start!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054906646435995728",
    "author": "peterlabberton",
    "date": "2022-12-20",
    "content": "Re: bass gtr mixing—yes to much of the above, AND in mix/production mode, don’t be afraid of targeted narrow EQ moves with potentially quite aggressive cuts. Fuck phase. Shit can get resonant down there just like it can in the midrange, especially with real instruments and inexperienced players.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065263632113479750",
    "author": "NoahNeedleman",
    "date": "2023-01-18",
    "content": "Why is listening to you two talk about panning so delightful?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066856885208236072",
    "author": "ALXCPH",
    "date": "2023-01-22",
    "content": "also width in bass, is not a complete no, no, even if youtube thinks it is. its just about finding a good balance with it, that isnt overbearing. a little width down there can still bring a lot of energy",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081129668570251346",
    "author": "Slow Hand",
    "date": "2023-03-03",
    "content": "They really nailed it. Sure you don't get any options to modulate the carrier signal, but it's already been tuned to perfection, so why would you mess with it? It's the best plug and play vocoder out there. Vocoders are finicky as hell and this thing just *works* with amazing intelligibility.\n\nEvery component on that plugin is exceptionally well realized. Even the stereo spreader goes wider than anything else and somehow manages to hold up *very* well in mono. I actually don't know how they've managed it.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084253194495987805",
    "author": "Slow Hand",
    "date": "2023-03-11",
    "content": "I love Panpot. It's my go-to for any kind of automated panning in Pro Tools because it is far too tedious to automate the L/R pan sliders on a PT mixer channel.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089384033705803816",
    "author": "jantrit",
    "date": "2023-03-25",
    "content": "Never having tried eq match I can’t talk on that but I’ve had good luck doing an ‘eq match’ myself on a number of occasions. Pick the one mic you want to replicate and slap an eq on the other. Listen between both and just use your ears to get as close as you can until it’s not an issue anymore.  More often than not you can get them close enough that no one will be able to tell. Start with broad strokes “this one has more low end” boom add some low to the other. Then slowly starting to narrow in making smaller and smaller adjustments until it feels right.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1098272072096034876",
    "author": "kidcutler",
    "date": "2023-04-19",
    "content": "Feel this but will add that giving the mix back the same but better is not easy and is often the magic trick modern clients are expecting. Mixing is less than a hundred years old, saying the older way is better discredits the efforts of modern creation in a way people definitely did when people started panning and adding reverb.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109573988193144842",
    "author": "Nomograph Mastering",
    "date": "2023-05-20",
    "content": "There seems to be a huge correlation between mixers who nail fades and great mixes",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138986567206187018",
    "author": "cian riordan",
    "date": "2023-08-09",
    "content": "I'm not mixing stems from A-level producers generally, so this may go against some of the LWMR content proposed on air... but if you're at the mixing stage and don't have a say in arrangement, try heavily filtering and  hard panning things. Make sure to do your filter moves when you're not in solo, that'll really tell you where the meat of the sound is. Amazing how much headroom you can free up this way.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140362594427863111",
    "author": "NoahNeedleman",
    "date": "2023-08-13",
    "content": "I record my acoustics in x/y almost all the time, even when I’m double tracking & hard panning. Just dropped down mixer on a track with the 3db down settings per @cian riordan and it works like a charm. Gonna open up a whole world of subtleties, not to mention making Logic files easier to manage. Discord Rules",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1198823425729384519",
    "author": "Slow Hand",
    "date": "2024-01-21",
    "content": "I rarely do multi-band spreading unless something really needs it. It's almost always full band.\n\nNow that I think of it, I'm not that big on spreaders aside from vocals and 808s. Instruments are usually too wide already. Quite often I'm reducing them to mono and getting my mix wide by panning those elements in the stereo field.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202184369457078323",
    "author": "Iwan Morgan",
    "date": "2024-01-31",
    "content": "A recent thing for me was combing a mono plate reverb tucked under the lead vocal with another stereo room for the width, in this isntace it was vintage verb on the mono and SP2016 on the stereo room but I'm sure it would work with others.  Sort of like mid side reverb.  It's not for everything but if the arrangement is not too dense it's been working really well .",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225458092343562351",
    "author": "Bryan DiMaio",
    "date": "2024-04-04",
    "content": "panning and levels are gonna be your best first pass at glue if you want those things all to be closer",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242075615826546688",
    "author": "NoahNeedleman",
    "date": "2024-05-20",
    "content": "Great note from @Matt Huber. \n\nIn addition to that:\nThinking of my mixes in mid-side helps me a lot of the time. \n\nSometimes a gently panned guitar jumps out of the mix the second you push it a little wider. \n\nStarting with an LCR mindset also really helps me understand what instruments are living in the same world and which ones are offering contrast.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245800760416014376",
    "author": "h3x",
    "date": "2024-05-30",
    "content": "Damn. Just did a mix and tried leaning on panning instead of eq for unmasking purposes and i have been literally asleep on this method. Made me realize i have NOT been panning enough. Literally opeend up the entire song for the vocals and minimized the eq death spiral by a million",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248039830525575179",
    "author": "cian riordan",
    "date": "2024-06-05",
    "content": "Not sure how it relates to masking, but opposite panning two sources occupying similar frequency ranges is the best way to get definition on each without aggressive eq. Not to mention the added benefit of width and keeping the center free",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1251521264363901070",
    "author": "river",
    "date": "2024-06-15",
    "content": "Is mono compatible too",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1257108818022629416",
    "author": "cian riordan",
    "date": "2024-06-30",
    "content": "This is one of my issues with phase “aligning” multi-miced drums. They can often be deeper in the fundamental frequencies, but they end up getting more narrow in stereo image… not always ideal.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300895481391611977",
    "author": "Matt Huber",
    "date": "2024-10-29",
    "content": "Also, creative panning goes a long way. Something that comes to mind is Valentine’s work on Death from Above’s “Outrage is Now.”  Drums are dead freaking mono, guitars are wide wide. Ain’t nothin competing for space 🙂",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1322283619422568520",
    "author": "NoahNeedleman",
    "date": "2024-12-27",
    "content": "If you’re in ProTools, you can use multi-mono instead of stereo on a lot of plugs. That helps the channels behave independently and create extra width",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1322374797023514697",
    "author": "Brian Reynolds",
    "date": "2024-12-27",
    "content": "I made it up. Take a synth for example. Set up a parallel send bus. Put the panner on the send. I usually compress it to smithereens. Blend it in underneath the main signal. You can get a lot of cool subtle movement. That can fill in the audio spectrum nicely. As example above could use subtle movement to fill out a pad. Or there are more adventurous circular 3D panning options that I find work well top end arps or vox chops. It was an idea born out of how people use 1/8 ping pong delays to fill out behind Bass guitar. Basically a different way to have the audio swim around subtly behind the main source. Try it. It's fun",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355570734759673977",
    "author": "Jonathan Jetter",
    "date": "2025-03-29",
    "content": "DMG TrackControl is free + easy. The \"width\" slider is just straight S-channel gain. It can also pan L and R independently, on separate sliders.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357589649731616779",
    "author": "spectrummasters",
    "date": "2025-04-03",
    "content": "@Nomograph Mastering  Thank you ruairi . I appreciate it . Starting with the vocal is actually a very pertinent point for me . \nFor this body of work I’m going  through currently the vocals are all tracked to a 2track instrumental but  with most of the songs  I’m importing all the instrumental multitracks  into a new alternative of the mix and ditching the stereo instrumental , much for the reason you’ve pointed to there . \nThe balance of the instrumental sounds excellent to itself but once you start mixing the vocals , they really need a re balance of the instrumental mix elements to allow space . So this has had me listening to the vocal alone first at length and then bringing back the instrumental elements very much around it. I was thinking yesterday how remarkably different a balance was needed to give the vocal its place.  It feels like trying to matchmake two friends who are going to be great together if you can just find the right setup , \nMain weapons (of love ) have been faders , panning and gentle eq . All of which I learnt how to harness their true power here . I’m back at it again this morning and feel great about the challenge again and do love these songs . The artists are telling true stories and speaking their truth in them and that’s what drives me to excel with a project \n\n\nThere’s also an addictive joy and fear dynamic here atm as I continue my ever deepening realisation that there is no perfect mix to find and attach myself to ! \n\nI have to remain open for the “feeling “ right ? Ha ha . This is Some mystical stuff we engage ourselves in I swear \n\nThanks Ruari , best wishes",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359328602113704008",
    "author": "JustinLeu",
    "date": "2025-04-08",
    "content": "if level/EQ are not getting you where you want with the snare try a verb (insert) and take the panning closer to mono...you can quickly decide how far back it lives in the mix. Also for soundstage in general, snare width is crucial to defining \"space\" in the mix. Something that can make samples stand out in a bad way is if they are too wide compared to the rest of the kit.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382013260177473709",
    "author": "Berlin",
    "date": "2025-06-10",
    "content": "plot twist it was a mid side file and they didn’t know",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397210573170806988",
    "author": "Nomograph Mastering",
    "date": "2025-07-22",
    "content": "Left field suggestion but I would try the azimuth module in RX - it will automatically adjust delay for maximum correlation between left and right. Hit the suggest button and turn off adaptive (your players and mics are fairly static)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1449113051323174982",
    "author": "Rob Domos",
    "date": "2025-12-12",
    "content": "Sure! RX is using FFT based processing.  (Worth googling and doing a deep dive if anyone is unfamiliar)\n\nAs a general rule with FFTs (and with EQ!!), the more narrow a selection is in the frequency domain, the wider it is time domain. This is an inviolable math law we can’t get around. \n\nHow many bands the FFT is using has big implications for this, because the more bands there are, the more narrow the frequency impact can be, which means the wider the time impact has to be. \n\nYou can make what looks like a very short selection in the time domain in RX, but if the FFT selection is set to the maximum amount of bands, you’re going to be effecting a ton of information to the left and right of your selection. Similarly, you can select just one narrow frequency but if you have the minimum amount of bands selected you’ll be turning down a whole bell the size of a half an octave",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "929906421032697917",
    "author": "Rollmottle",
    "date": "2022-01-09",
    "content": "in mastering, i'll use a hair of widening via the RND MBP. or, my other move is ProQ3 in M/S and EQ the mids/tops in the side to poke stuff out that way without fucking up everything else. LCR panning is the way in mixing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "942011134943318036",
    "author": "Maxim",
    "date": "2022-02-12",
    "content": "It depends on the song but a lot of times you don’t actually want to “hear” the reverb. It should be woven into the performance in a smart way and that’s where choosing the right verb and EQ is essential. \n\nSo I’m not sure if there’s really any “secret” other than developing your ears to hear what’s right and knowing how to get there. \n\nIf a client is asking for “more reverb” I wouldn’t take that literally. Maybe they want to hear more reverb between phrases (automate or use ducking), maybe they want a verb that has more high-end information (plates tend to sound a bit dull unless EQed), maybe use multiple reverbs at different lengths with various characters to compliment each other, etc. etc.\n\nThere’s really too many options to give a general response.\n\nBut as far as getting the vocal upfront use pre-delay and slap delays to get that width. Dial in the MS amount by ear.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "964167219317731348",
    "author": "Deleted User",
    "date": "2022-04-14",
    "content": "That’s what Saturn 2 is for. I put Saturn 2 and true iron on every track, get levels and panning then commit the two plugs along with the faders so that when I “start” mixing, all the faders are at zero and have gone through some saturation.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983941449655677018",
    "author": "Jeremy Klein",
    "date": "2022-06-07",
    "content": "^^ +1 that. i also like to think of stereo image in terms of contrast. hard panned vocals will sound way wider if there aren’t a million other things panned left right. same goes for contrast with time. you can make your chorus really wide by making your pre chorus narrow.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983941976896438332",
    "author": "Jeremy Klein",
    "date": "2022-06-07",
    "content": "as far as plugins, i love the free plugin called Wider to just get some mono thing as wide as possible. but if i’m looking for more of a _vibe_, i’ll use a really short room reverb, a slapback, or our blessed microshift.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984097331274194964",
    "author": "Will Melones",
    "date": "2022-06-08",
    "content": "I’d second the opinion that you should use different guitars. The small variation in intonation will give you more width than amp tone. Same with background vocals—I like to leave them a little less tuned than the leads (but not distractingly out), unless they’re sung by different people.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984858606941913158",
    "author": "Zack Hames",
    "date": "2022-06-10",
    "content": "I almost never use multiband comp tbh. I use multiband saturation all the time with Saturn.\n\nThe general reason i use it is to brighten something without simply adding a high shelf, or to create a broader wider transient on a drum track. The distortion with splay out the sharp transient. So I’ll saturate high end on vocals or bass to get more openness without harsh high end boosts, I’ll use the same sort of settings on close mics on acoustic drums to get more attack and punch. \n\nThis is an Oversimplification but Nothing is bad in excess if it sounds good.  There are no rules.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998736827764707349",
    "author": "Eric Martin",
    "date": "2022-07-18",
    "content": "NGL that width knob at 110-115% can  be magic, and so is the gain scaling feature",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1006243448749309992",
    "author": "IanDobyns",
    "date": "2022-08-08",
    "content": "that's how I've felt so far, only recently started putting mixes onto an audio file but have enjoyed how fast the export is and the process of monitoring the stereo image get printed. I did it both ways and didn't notice a difference, but maybe my ears were just used to the mix and I didn't care. That in/of itself probably explains enough though?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1046900612194893824",
    "author": "Ross Fortune",
    "date": "2022-11-28",
    "content": "Towards @peterlabberton's point re objectivity and consistency... I recently wrapped up a slightly unusual 3 year \"experiment\" on myself.\n\nFor various reasons, I decided to narrow down variability in my life and rely heavily on routines. It wasn't scientific at all - the journals wouldn't touch it - but I set up a structured life with the same waking and bedtimes each weekday, similar exercise routines, identical breakfast every weekday at 8am (quantities measured), the same salad (Greek, since you asked) every weekday at 1pm for 18 months (then I switched to a tuna salad I liked and stuck with that for 20 consecutive months), and one of four batch cooked dinners at 6:30pm that I would rotate roughly weekly.\n\n[I've started typing this and I'm realising I'd need to spend far more time than I have right now to demonstrate the depth of my findings and their Nobel prize eligibility, so I'm just going to wrap it up semi-flippantly]\n\nSome takeaways:\n- When stuff started sounding bad to me like clockwork at 3:50pm every day, I knew it that it was not the mix turning sour - it was just time to eat my 4pm apple. The sugar would kick in, and hey presto, we're back in vibe town. Removing variables can be helpful in diagnosing issues - the diagnostic problem solving approach one develops as a studio assistant can, to an extent, be applied to ones self.\n\n- Limiting variety mitigates decision fatigue and frees up quite a lot of brain power. I like to think of myself as a less dead Steve Jobs - he wore polo necks, I ate greek salads. We both got a lot done.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054639966380101683",
    "author": "NoahNeedleman",
    "date": "2022-12-19",
    "content": "Anyone suggested panning some shit yet?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062887857255092305",
    "author": "jonmatteson",
    "date": "2023-01-11",
    "content": "Really like the wider plugin by polyverse",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065720429119017011",
    "author": "Ross Fortune",
    "date": "2023-01-19",
    "content": "If it’s just writing, playing speakers and having zoom pick it up tends to work fine.\n\nIf it’s for a mix, you might be better with Audiomovers or the LANDR version. I’m not sure how zoom etc throttle bandwidth for audio, so you wouldn’t really know whether they’re hearing things as they should be. You have control over the fidelity with Audiomovers et al.\n\nBut in short, get Blackhole (the Mac OS utility, not the rad Eventide verb)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081816107863781457",
    "author": "mixedbywong_my",
    "date": "2023-03-04",
    "content": "Clients sending in super wide individual synths tracks …\n“Bro , make the mix wider … come on.” 😪",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095392205268582520",
    "author": "Jodonny",
    "date": "2023-04-11",
    "content": "Outside of vocals, I love placing mono verbs on one side and panning the track to the opposite side. Something I picked up from Jacquire King a long time ago (he'd do this with guitars and delay). Creates width but still having some of the clarity of mono.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099195254080557176",
    "author": "stefanmacc",
    "date": "2023-04-21",
    "content": "Gullfoss is actually cool if you narrow the bandwidth to only the mids. Can do some interesting trickery on a vocal with it. Also spiff does a weird cool over compressed sounding pumpy thing if you turn the decay all the way up. Not intended use but hey … i … don’t … care 💅",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105167374048567336",
    "author": "chrissorem",
    "date": "2023-05-08",
    "content": "@louisvie  ideally sum to mono. Depending on the arrangement and stereo placement sometimes that’s not critical. I have a mono aura tone that can be great for this too!  But removing the stereo field can be helpful for broad stroke balancing",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114694955638730844",
    "author": "Slow Hand",
    "date": "2023-06-03",
    "content": "Haha oh man. I don't mean to suggest that I've experienced anything else that Andre went through, but I can totally relate to crushing it on stage and having that out of body experience. You can be hyper aware of the setting, executing everything well, and still be thinking about your next meal at the same time. It's wild.\n\nMy bandmate and I always used to joke about how she'd be up on stage simultaneously playing a synth with each hand, singing, dancing, and *still* have the mental bandwidth to be thinking about the laundry that she's gonna do when we get home. 😆 Flow states are wild.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1124154416577130606",
    "author": "Adam Thein",
    "date": "2023-06-29",
    "content": "I like to reach for brighter verbs in this kind of scenario - something with some texture like a spring or a plate or a digital verb with some texture.  Start there, mess with the width of it first.  Generally think if it more as a synth pad layer.  Emphasizing 2-5k if it really needs to cut with spectre or Saturn or a brighter saturation.  Using a delay in combination so that the decay envelope has some movement so my ear latches onto it more.  Panning, modulation, tremolo, etc, subtle ways to grab attention even at low level.  And good old volume automation.  Printing the verb can help give you some visual feedback for how it’s decaying.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126235547380220036",
    "author": "BatMeckley",
    "date": "2023-07-05",
    "content": "I just had this issue on a live Matt Maeson record. The bleed… not ideal. We were in tiny rooms. It can be jarring to the whole mix if you’re gating the vocal, because the whole band jumps in level when the vocals start.\n\nEvery situation like this is different, and requires different solutions. In my case there was a lot of multing out vocals. Treating and eq’ing different parts of the songs differently. Had a lot of luck using a very narrowly focused Soothe on the vocals sidechained to the overheads, but it takes a bit of work to figure where, how wide, and how much. When it works, it’s awesome, when it doesn’t, it’s really not.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140266061179129877",
    "author": "Jonathan Jetter",
    "date": "2023-08-13",
    "content": "I mean taking the returns and panning them all around, either with their source track or opposite, or anywhere else that sounds cool. I might generalize by saying there's often a difference between optimizing the individual width/depth of a single track (where of course a stereo verb will feel bigger) vs. the collective width/depth of the entire mix (This is where several different mono verbs + delays can really shine IMO).",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1148454701969457222",
    "author": "hyanrarvey",
    "date": "2023-09-04",
    "content": "Like I pan them to a spot it usually never moves and it’s more about what the person is playing that determines the stereo width",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154161249660194896",
    "author": "LAPhill",
    "date": "2023-09-20",
    "content": "I'm surprised the BGs come in right on top of the lead, instead of being panned wider. Probably to distract from the HH being on the wrong side",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1160961477314891887",
    "author": "Jonathan Jetter",
    "date": "2023-10-09",
    "content": "There's also a certain point at which more widening can sometimes make things feel narrower.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1165107019456467075",
    "author": "Jonathan Jetter",
    "date": "2023-10-20",
    "content": "Agree w/ Ozone Imager. One quirk w/ the MBP though- the center frequency on the Low Mid is actually higher than the High Mid, and the difference is re: bandwidth moreso than frequency there. If you really want to emulate the MBP behavior, play around with the bandwidth of each band, in addition to the plus / minus on the width.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1170870184660185219",
    "author": "Jonathan Jetter",
    "date": "2023-11-05",
    "content": "Me personally, lately I'm into this M/S thing in Saturn that I made. I think just 'cause of the rest of my workflow I end up in a situation where centered elements are heavily driven but things in the stereo field not always as much. So I let Saturn drive the side for me.And it ends up in the same place as what you said w/ the inflator: loudness + push become easy. I have mix prints ending up at -6 LUFS with only a few dB of limiter, and I have to remind myself to turn it all down and back it all off.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178393043842384065",
    "author": "sethearnest",
    "date": "2023-11-26",
    "content": "Agree w/ @JustinLeu on all, and another is just flipping the L-R. There are various plugs that can easily do this, or just reverse the panning on your 2bus.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187186605136547941",
    "author": "ehutton21",
    "date": "2023-12-20",
    "content": "To follow up on yesterday, he removed the multiband chain. It wasn’t the OTT setting, but we confirmed that his multiband setting was boosting the high mids a fair bit, which wasn’t playing nice with the natural response of the microphone. \n\nI found a good solution between serious clip FX therapy, a really narrow de-esser, and some spectral shaper on the 3.5-4.5k range.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200672976727707729",
    "author": "! Andy !",
    "date": "2024-01-26",
    "content": "nevermind - I was trying to do it because there was something weird going on w/ the elements not panning properly... I didn't even realise I had a mono plugin switched on 🤦‍♀️ time to take a break I think lol",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1224844271513894932",
    "author": "Nomograph Mastering",
    "date": "2024-04-02",
    "content": "Narrow for me is Q of 1.4, 2 is rare",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242141882574704681",
    "author": "shaunobi",
    "date": "2024-05-20",
    "content": "SP2016 I believe has mono mode. UAD verbs (I use their plate mostly) have mono versions. I mostly just try it with my favorite verb on a bus and see if narrowing to mono (if it doesn’t have mono mode) makes it phase. Plates seem to work well for this. I’ve heard good things about some algos in Valhalla Room but don’t use it. I like EA verbs in mono.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1250813016266510447",
    "author": "Edward Rivera",
    "date": "2024-06-13",
    "content": "I love reverbs you don’t hear. Not to say they are quiet, but they have short decays and act almost as ambience. Really great for adding character and width",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1257067922355126404",
    "author": "NoahNeedleman",
    "date": "2024-06-30",
    "content": "One of my fav phase tricks is using Primal Tap in multimono and hitting the phase flip button for the sides. Doesn’t sound different but feels wider most of the time.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1272765707804868660",
    "author": "cian riordan",
    "date": "2024-08-12",
    "content": "Key elements of the mix getting uplifted through different sections is a great trick to have up your sleeve. Its always satisfying when you get to a chorus and an already full-spectrum mix somehow gets deeper, brighter, and wider. I live for that shit.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277392716996677723",
    "author": "oaklandmatt",
    "date": "2024-08-25",
    "content": "Yeah definitely. The \"golden rule\" is just a way to get clicks. I think at this point we're all on the same page about clickbait. From news media to music influencers, the need to get clicks makes people constantly sensationalize. Def worth pointing it out in the context of what she might be saying that is interesting.\n\n\"Obviously there is no golden rule to mixing, but this person who makes sync music is talking about panning. Is there something different about sync world to mixing artist records for spotify?\"\n\nThis is actually making me think about the song I'm mixing rn and I'm enjoying it 😂",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290749404495483094",
    "author": "chrissorem",
    "date": "2024-10-01",
    "content": "I was thinking about texture in mixing and it seems like there is a lot of talk about low end, high end, midrange, depth, width, contrast ect. But I don’t hear a lot of talk about texture. What is it that you think about or maybe reach for when looking for interesting texture and are there any records that you love that have great texture?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301169681121673366",
    "author": "Jonathan Jetter",
    "date": "2024-10-30",
    "content": "Waves De-Esser (the old boring one) post EQ + compression. If needed, Pro-DS in \"Single Vocal\" mode at the start of the chain (pay attention to how the specifics of how threshold + the bandwidth controls work...). Anything whistling/resonant gets spot treatment via audiosuite.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1306686570119565342",
    "author": "James Cronier",
    "date": "2024-11-14",
    "content": "the fun thing here is the artist and I were both bothered by the audience panning when we were doing the comping and editing, so we switched it, and never reverted back.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1322392069809111163",
    "author": "chris_donlin",
    "date": "2024-12-27",
    "content": "I’ve never thought about it as parallel panning but I’ve done it quite a bit. It’s rad when you want a sense of movement back and forth behind the more focused source. VERY interested in smashing the parallel before panning, specifically to get it flutter in a unique way. Shape shifter would be sick for this. I imagine it could be similar to parallel dropouts with sketch cassette",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341855714263564369",
    "author": "Adam Thein",
    "date": "2025-02-19",
    "content": "I should add this is for mono tracks, I believe if you commit the panning as a stereo file it will behave the same.  There should be a bunch of my posts in the Pro Tools channel about this from Nov/Dec when I was rebuilding mixes out of Ableton in Pro Tools and pulling my hair out getting bus processing to sound 1:1",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1351573628348796998",
    "author": "JustinLeu",
    "date": "2025-03-18",
    "content": "So, depending on the timing relationships to the drums….and what the part is, you might be able to find a perfect sample for the vibe and just replace the kick? \n\n If you want the tight and natural sound of the kit but much more narrow you could bring in the pan width on the OHs or even pick one and go for the mono vibe. \n\nDepending on how far the rooms are/how they sound you could lean heavily on them but you really have to listen to see if it sounds too flammy because of the distance. \n\nOnce you find a rough sound that fits the song you can then fix any issues with that sound. (Do the mic distances cause flamming?? You might have to move the rooms forward and then check polarity…things like that.\n\nOne last thought that I have had a lot of success with, you can START with nothing but samples (kick/sn) and find/make the perfect fit samples and then blend them in. It takes some experimenting based on what blend of mics and picture you want to create but it can work great! Especially if the close mics are not great.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352872016172028024",
    "author": "Slow Hand",
    "date": "2025-03-21",
    "content": "I like the concept, but I wouldn't ever do it on the master buss because it constricts absolutely everything - not to mention potentially introducing phase-y distortions across the entire mix.\n\nIf I'm going to narrow that frequency range I'd do it only on the elements that are calling out to be narrowed in that range. Usually with EQ to darken the panned elements. My master buss ends up being *very* minimal and open to keep me from tying my hands at the end stage.\n\nThen again, I'm also not Luca or Frank. If it works for *them*, cool!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355582334853710004",
    "author": "wcalebparker",
    "date": "2025-03-29",
    "content": "If I’m not using the pan knobs, I use goodhertz midside (not midside matrix) a ton for this kind of stuff.  I’m honestly not sure what’s going on under the hood, but the natural setting seems pretty phase coherent.\n\nWhat I really like is that in the advanced settings you’ve got midside panning options. Useful for when you get a mono guitar up the middle with a stereo verb and just want to pan the middle a bit.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366642918273847348",
    "author": "masteredbyjack",
    "date": "2025-04-28",
    "content": "I would argue that there is not such a thing as objective in what we do!\n\nNot sure why I feel compelled to dive into this tonight, but there is a type of record maker I run across every so often, one who is caught up on the quality of a recording and cannot accept that it will never “sound good”, in the way us engineers would describe it. It is something akin to missing the forest for the trees.\n\nNot saying you are this — but I’ve yet to find that this type of record maker makes anything I find compelling or that connects on a wide scale (which are two different things)\n\nThe ones who focus on how it feels, what makes it unique (which could even be the fact that it sounds bad) — they are doing just fine, not by my metric but by any you’d use to define success\n\nIt’s true, some things just sound bad.  But it’s also true there are people making very compelling records out of things that sound bad. \n\nThe panning is something the mixers should weigh in on",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376773005300203570",
    "author": "masteredbyjack",
    "date": "2025-05-26",
    "content": "Long game! Happy to hear it all went well in the end. When you figure it out let me know, I’ve given up any thought that there is an end point.\n\nEasy to forget that this is a CAREER, spanning decades and life, not a sprint sometimes",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378011978680762418",
    "author": "JustinLeu",
    "date": "2025-05-30",
    "content": "I would consider narrow EQ cuts the same as \"notch\" filters....this is what I was referencing. Sometimes there is a dissonant resonance that is better tamed with EQ than soothe",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1382162723210661989",
    "author": "Brodie Stewart",
    "date": "2025-06-10",
    "content": "I mean, all tools are basically a form of:\n- EQ\n- dynamics\n- saturation\n- time based effects\n\nNot to mention the importance of fader balance, phase, and panning!\n\nBut all the fancy tools end up just being some combination of the above. And maybe certain specialised tools solve problems a little faster, but it’s still using a combination of the above.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1419106732424298617",
    "author": "Nomograph Mastering",
    "date": "2025-09-20",
    "content": "If that were true, what would make it *feel* pop given the production you have? - more finish on the vocal? Tighter drums? More width? What are cues that could give a pop feel while being true to the source material?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "878834547574312960",
    "author": "Eric Martin",
    "date": "2021-08-21",
    "content": "M/S is [M=L+R] {S=L-R} EQing anything on an M/S encoder is gonna mess with phase and relationship of location of sounds. I rarely use M/S EQ unless I really need to affect the width of a track or something is poking out in either space that I need to change.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "925514523111194694",
    "author": "peterlabberton",
    "date": "2021-12-28",
    "content": "Clip gain, as @1ggy said, OR a narrow EQ band to reduce the problem notes. Just be careful your room isn’t leading you astray! It’s not perfect, but I’ve found just having shot my room (and old rooms in the past) with room eq wizard/fuzzmeasure that it’s helpful to know where the problem areas are so you can check yourself when really zoomed in on that range.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937856672087543818",
    "author": "Adam Thein",
    "date": "2022-01-31",
    "content": "The place I've used the crosstalk in the past is on a drum bus where the OHs were a super wide spaced pair and I wanted to anchor the middle image a little more without just narrowing the overall width.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "944794258626478090",
    "author": "Shadowherb",
    "date": "2022-02-19",
    "content": "i think the unfortunate truth is that asymmetrical mixes translate way better through speakers than through headphones, and most ppl these days listen to music through headphones. still, i love asymmetrical mixes. for hardpanned drums, look no further than Beatles' \"Taxman\". also, if you want a masterclass on tasteful assymetrical mixing, check out any stereo mixes Rudy Van Gelder made for Blue Note. what he'll often do is hardpan all the drum mics to the right channel and hardpan the room mic to the left channel. that way, even though the mix is heavily weighted to one side, there's a sense of a united stereo field that ties it all together",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "958711256171282432",
    "author": "Adam Thein",
    "date": "2022-03-30",
    "content": "Thanks for this, tried this on a mix yesterday on a flat printed mono drum kit that I felt needed a little more dimension - used an extremely short delay with diffusion up and then bam you've got your stereo width tools there (in the non ducking modes) and some gentle filters - definitely going to be a new alternative for me thanks!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "968093205696499732",
    "author": "Maxim",
    "date": "2022-04-25",
    "content": "“The sound quality was as good as anything available, but benchmark analog still had an edge. So, we added a radical new tech to thEQblue. It’s called FiDef and it adds that indescribable beauty lent by the best of analog.\n\nFiDef by FideliQuest is a very low amplitude, psychoacoustic stimulus designed specifically for audio engineers. FiDef can be thought of as dither for your brain. It makes a receptive brain relax and pay closer attention to an incoming audio stimulus. In brain physiology laboratory tests using functional neuroimaging techniques, FiDef has proven to excite brain activity related to perception and attention, and to enhance the subjective processes of listening and engagement.”\n\nSounds interesting but it seems only to affect the listening experience. Sounds processed equally still null regardless.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "979352916911595600",
    "author": "alex_epton",
    "date": "2022-05-26",
    "content": "Saturation might not be the right move for sample heavy stuff. Generally sampled material will be plenty compressed and saturated by the time it gets to you. if it’s not stereo already You could try spreading the bed/ background sample with wider or mps or something . If it’s already stereo try just taking out a tiny bit in the mid channel on a m/s EQ around the frequency of the other instrument you want to highlight. Make the highlighted instrument narrower if it’s stereo",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982953245460807700",
    "author": "pixlpxl®",
    "date": "2022-06-05",
    "content": "this right here! coupled with subtle binaural panning, those throws can really spice things up",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983983461612273665",
    "author": "Deleted User",
    "date": "2022-06-07",
    "content": "On top of everything else was said here, I think stereo width also comes from arrangement too. Thinking about which instrument will be on which side and how far, and if it something that would feel weird to pan on sides- you could utilize voice spreading to achieve width (panning each voices in the voice differently- played by slightly different instruments, you could also utilize variations of autopan and modulation effect on one note to add dimensions to things like synth pad or B3 style organ.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984090448832368680",
    "author": "jantrit",
    "date": "2022-06-08",
    "content": "A lot of the time I will mess with hard panning diff mono sources in a mix to create the sense of width whilst maintaining balance. Also if it is double tracks like others have said I like to sit them in diff places tonally or treat them differently (diff verbs or pushing diff eq points) it’s the differences in the hard panned sources that create width. When tonally different information reaches each ear at the same time your brain tells you it’s wide! When it’s only subtlety different like in the case of doubles it can end up sounding mono again. A lot of the time I like to pick two elements that are holding it down throughout the track (maybe guitar and Rhodes) and then hard pan those in opposite directions. This maintains the balance left to right.  So I guess try hard panning a mono element and then balancing it out with a totally different mono element the other side.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "995476511664640040",
    "author": "peterlabberton",
    "date": "2022-07-09",
    "content": "I’d try just picking one side of the stereo audio. Mute the right side and see if just having the sound be mono that way works. If you’re missing some width then, you could try recreating it from the mono track.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000752841738158080",
    "author": "jantrit",
    "date": "2022-07-24",
    "content": "It would be dry without processing, panning or any effects just the raw multitrack",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1013676170245591051",
    "author": "Zack Hames",
    "date": "2022-08-28",
    "content": "How are your vocals sitting?\nI found my mixes were way less smashed sounding all around when I started doing vocal and music bus compression separately. The only thing I combine are stereo width and my final limiter. I know this doesn’t directly address low end but it might help.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014661421440704532",
    "author": "Adam Thein",
    "date": "2022-08-31",
    "content": "I know this doesn't help the summing question but I've used Goodhertz midside to encode my stereo sources into M/S to avoid weird image shifts while transferring onto my shitty uncalibrated Fostex tape machine.  In your case though maybe just best to keep the summing ITB if you are looking for super defined stereo imaging?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1027393518886457415",
    "author": "ehutton21",
    "date": "2022-10-05",
    "content": "Especially when you play with stereo image and feedback, I did something I thought was cool to a snare then we realized it disappeared in mono",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1063950570366443520",
    "author": "hyanrarvey",
    "date": "2023-01-14",
    "content": "I always tracked a wet and dry as a stereo signal and just used a plugin with internal panning (like logics gain plugin) to either go between wet or dry and then just make a really fun chain with the ua stuff",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065178780307562596",
    "author": "Slow Hand",
    "date": "2023-01-18",
    "content": "Nothing fancy here. I strongly dislike the PT dual pan sliders, so I do my narrowing with a simple utility plugin so that I can quickly A/B it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075677305113956403",
    "author": "Josh",
    "date": "2023-02-15",
    "content": "You know how on API EQs the Q narrows as you add or subtract gain?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080983417107251300",
    "author": "Ross Fortune",
    "date": "2023-03-02",
    "content": "Only kind of related but I dig the panning in this drum mix https://open.spotify.com/track/6cWjeUN9zJvcl1Ir6Kc366?si=JWiDOll6ThemveVp74S0Yg",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084842058600153230",
    "author": "NoahNeedleman",
    "date": "2023-03-13",
    "content": "If I’m understanding your query, dual-mono will be wider, the and/or approach is more for overall glue. I see usefulness is both approaches depending on what you’re trying to achieve…",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087865382586560513",
    "author": "tomtom",
    "date": "2023-03-21",
    "content": "I just double tracked some drums a couple of weeks ago.. not as fun as live, but it came out great. Mono overhead, blumlein (R88) room. I would just treat it as one giant drum kit..get your contrast with the drums themselves (Esp bass drums) and hopefully the players will do the rest.  I think I wound up panning @ 50/50 and didn’t lean to far in w the kicks in the mix, but @Josh Bowman’s advice to favor one of the kicks is def the move.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089553412997267466",
    "author": "Adam Thein",
    "date": "2023-03-26",
    "content": "Ooo yeah - starts and ends of notes are a little weird for “replace” in spectral repair, but I’d try zapping first with “mouth declick” or play with the width setting in the declick module.  You might still hear some warbly artifact in the mids and low end but at least the very long stark high end click should be gone",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091133269921243186",
    "author": "cian riordan",
    "date": "2023-03-30",
    "content": "Used to be Waves Q10 for super narrow Q notching. Now Pro-Q3 does everything. Also I don't think I've ever heard a difference in sound between any EQ plugin doing this particular task.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093568351596449832",
    "author": "JustinLeu",
    "date": "2023-04-06",
    "content": "Also would like to throw this out there in-case it is useful to someone...Soundtoys Tremolator is great for auto-pan type effects and is way more versatile than the \"auto-pan\" plugin haha...find the parameter under Tweak>Width",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117128331998003253",
    "author": "Deleted User",
    "date": "2023-06-10",
    "content": "I find panning things closer to center in quieter level works pretty well. Shaving transient off and rolling off highs a bit helps a bit too. I like mono spring directly on the instrument as an insert and panned together or separate mono spring send all in center. they have different feel.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123417417457086505",
    "author": "noahc",
    "date": "2023-06-27",
    "content": "There was a few times where I felt it changed the tone of a snare higher pitched. Maybe I never heard it before cuz of phase. 90% of the time this makes kick drums and stereo image way better",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138544616967249971",
    "author": "jantrit",
    "date": "2023-08-08",
    "content": "Stereo for density and glue and dual mono for width",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138544861314826333",
    "author": "peterlabberton",
    "date": "2023-08-08",
    "content": "I forget which song, but there’s some Radiohead song where there’s one side getting pulled around wildly by some compression, but it took me years to notice it cuz the song and production is just so damn good. Prompted me to stop caring about perfect preservation of the stereo image.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138546052023205949",
    "author": "Rollmottle",
    "date": "2023-08-08",
    "content": "some wild panning in that tune",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140498119419756574",
    "author": "NoahNeedleman",
    "date": "2023-08-13",
    "content": "Yeah so x/y isn’t great for info on the sides for a solo performance. It’s more about capturing more of the guitar, the string chime and the body. It’s a little wider than a mono mic so it works well as a single instrument with a vocal, but it’s not gonna do a “stereo” thing. \n\nMy best advice out the gate is keep it about 6-8” off the 10th feet and move around until the balance feels right. If you’re missing brilliance, try raising the guitar or leaning left or right a little… it’s really about your instrument and your room and which mics you’ve got. \n\nHonestly x/y should be an easy way of getting the full guitar captured.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140667551756587028",
    "author": "Eric Martin",
    "date": "2023-08-14",
    "content": "If you balance X/Y on a guitar right I feel like the guitar can just be placed in the stereo field very intentionally close far left right or “big mono”\n\nIf I’m doing a mostly acoustic track with acoustic I like it because it just isn’t so “mono”",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140743387507609660",
    "author": "Eric Martin",
    "date": "2023-08-14",
    "content": "I think the mic technique can decide that, like, I can place them further or closer to the instrument and it will change the space in the stereo field and I can tilt the mics so that I’m “mixing” while tracking if I want a left leaning stereo set I can get that by using the mic technique to do it especially with XY",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141755511092563978",
    "author": "Jonathan Jetter",
    "date": "2023-08-17",
    "content": "If you match the output level, boosts are cuts and cuts are boosts, and it becomes a question of workflow. If there's dynamic or harmonic processing downstream, then it's about pushing harder into the processing vs. pushing less hard, and that's of course a choice to make. Some EQs (e.g. API) perhaps lend themselves to additive work because the proportional Q is super wide at +-2dB and sometimes people think of subtractive EQ as a tool for more narrow resonance notching, and it's a bit unfamiliar to have -2dB with a Q of 0.5 or whatever.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151452569114255400",
    "author": "Iwan Morgan",
    "date": "2023-09-13",
    "content": "Seconding @peterlabberton i find most use for this when i’ve got the mix going and then get to the point where I wonder how it compares to the wider world. Ruairi is right in that the curve is only part of the story. I have made many objectively good looking mixes only to find they don’t stack up to A/Bing with commercial refs. I find it really useful on album projects which have a similar tracking style. I’ll mix the first couple and then make a curve which I can then reference.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151623205308604487",
    "author": "Eric Martin",
    "date": "2023-09-13",
    "content": "I feel like that’s where mono actually helps me make decisions that translate to wider in stereo, if I mix two guitars to sit right with volume and EQ, and then hard pan them opposite it comes out sounding huge if I spent the time in mono, and it’s not a trick, it’s just basics",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151959173299441754",
    "author": "cian riordan",
    "date": "2023-09-14",
    "content": "This is usually my speed. Ill have something on the alt input of my monitor controller, roughly level matched and will just quick balance checks. Things like kick/sub placement, vocal level, width, etc. usually just need a quick second or two to get perspective… then back to work.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1160931005914419302",
    "author": "Jonathan Jetter",
    "date": "2023-10-09",
    "content": "There are certainly tons of modern records, including some huge ones, that absolutely make use of significant width in the lows. And there are others that don't.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1160960850501304320",
    "author": "Jonathan Jetter",
    "date": "2023-10-09",
    "content": "And while we're less sensitive to directionality in a low frequency signal I do think the phase interaction between differences in L + R LF content is clearly audible, and sometimes crucially important to certain sounds. I really do find the LF Side high-pass / mono-making thing is often quite a compromise. And, both widening + narrowing via M/S will often have unintended effects on the overall image. Things that were hard panned now won't be, etc.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161067787192643614",
    "author": "chrissorem",
    "date": "2023-10-09",
    "content": "I don’t use mid side really that often and I tend not to think to use that tool but when I do,  it’s generally in dense arrangements where In looking for any give in the frequencies spectrum. I also use it lightly on the mix bus from time to time when I feel there might be a build up in the arrangement  and I’m looking for some slight relief. I don’t think I’ve ever used more than a db. In any situation.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1163916937416413224",
    "author": "river",
    "date": "2023-10-17",
    "content": "Oooo then you turn the width into the - and it sits in the mix  so well almost every time. I really like doing this delay diffusion thing with my hats, adds so much groove",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177985388493668503",
    "author": "Jonathan Jetter",
    "date": "2023-11-25",
    "content": "Or just a wider understanding of a wider range of music and art. Like, spend a day listening to Stravinsky + reading Eco while watching blades of grass blow in the wind.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191916025197887649",
    "author": "Rob Domos",
    "date": "2024-01-02",
    "content": "Some other things you can to create space for them each to sit:\n\n- Move one of them to the sides with something like the stereoize function in the ozone imager. Even just one band wider on one of them could solve the problem. \n\n- Try something like ST4B to get a different relationship between the transients and sustains of the sounds \n\n- If all else fails, I sometimes try out a *very* slight tremolo on sustained sounds and it surprisingly consistently cleans up cloudy masking issues. The way I do it the tremolo isn’t noticeable but it still creates a hair more space for the other sounds to pop through. I usually only do this on reverbs and pads, but it *might* work on one of the basses.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194719429389451334",
    "author": "Adam Thein",
    "date": "2024-01-10",
    "content": "I've been here before a few times where the producer had a Soundshifter tuning up everything a weird amount (like 28 cents or something not even a semitone).  Generally I prefer the sound of shifting things separately - and at least on my system Soundshifter almost always has unpredictable and inconsistent stereo imaging artifacts so I usually prefer using other tools for as many tracks as I can do.  Most of the time since I'm working in Ableton I'll use the pitch shifting modes there (Beat warp on drums for example, tones or complex on individual harmonic instruments).\n\nPlay around with different shifting algorithms to get the results you want.  Be warned though that Soundshifter definitely has its own character/tone so if the producer/artist are really used to that sound they may wonder what happened if it goes away.  At the very least I'd try and warp your drums and vocals separately from the main instrumental if it were me!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1201022072671981620",
    "author": "Jonathan Jetter",
    "date": "2024-01-27",
    "content": "EQ + Limiter + volume automation most of the time. Sometimes saturation or imaging. Occasionally compression but less and less often these days.\n\nPlus anything un-removable the producer had on their rough mix.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205230954663116821",
    "author": "cian riordan",
    "date": "2024-02-08",
    "content": "I would say that no width is worth added distortion. I've found Pro-L2 very amenable to getting more transparent results than Ozone. Have you tried pulling your ceiling down a bit? How much gain reduction are you typically getting?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1208912463781957702",
    "author": "Nomograph Mastering",
    "date": "2024-02-18",
    "content": "I’m a fan of lower Q EQ (wider/gentler) whenever possible",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209307251077025873",
    "author": "James Redfern",
    "date": "2024-02-19",
    "content": "Automating width, and subtle eq before a downbeat can sometimes be more effective than the volume spike approach",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230726498533511239",
    "author": "sethmanchester",
    "date": "2024-04-18",
    "content": "The little intel I have is that Apple folds down the sides of their spatial playback by a percentage, after a lot of listening I’ve yet to find one binaural mix on Apple Music that feels as wide as stereo. Deeper, more headroom, and recently louder with normalization on… yes… wider, no.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242115095358607371",
    "author": "Jonathan Jetter",
    "date": "2024-05-20",
    "content": "I think it helps to redefine width as \"The difference betweeen L and R.\" So if it's the main guitar doubled, probably keeping the spread doubles yes. But if there are two supporting synth sounds, or two electric guitar overdubs, and they're both in stereo (or both centered mono), maybe they don't need to be. And maybe cutting them down to mono, panning them opposite each other, and turning the levels up to compensate, will feel a good bit wider.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1259873042176409713",
    "author": "chrissorem",
    "date": "2024-07-08",
    "content": "The panning note is  a made up scenario  but the note did say turn up the guitar 3db or 30% in which I turned it up and went home",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1260754083866742855",
    "author": "cian riordan",
    "date": "2024-07-10",
    "content": "Width, vibe, sounding fucking awesome. Whatever you wanna call it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1263606924130259147",
    "author": "Robin.Z.V",
    "date": "2024-07-18",
    "content": "Panning, filtering, and front to back positioning. Waves TrueVerb with the Jaycen trick is great with moving elements back and forth 👌if you could post a reference, that’d def help with suggestions.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1263627591525597284",
    "author": "Zach Hughes",
    "date": "2024-07-18",
    "content": "All the other suggestions are dope / could be the ticket. I dig gang vocals with different distances from source. If all the tracks are an sm7 equal distance from the mic could place some of them further back with short ambience verbs. The depth slider on valhalla room is pretty handy for this. I've had good results w/o individual track compression and just handling it at the bus level. Similar to what Rob said the greater the variation in timing and pitch the more width you can get. Tradeoffs there. Could also play around with formant shifting some with melodyne or alterboy. Could also experiment with high passing some of the layers up a decent bit to create more height / contrast",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270389407199002664",
    "author": "Adam Thein",
    "date": "2024-08-06",
    "content": "if that's the case maybe take the verb from the BGV, shorten the decay, play with the width being a little more narrow, and add pre-delay to taste to keep it drier.  If cohesion/glue is what you're after maybe limiting the number of different ambience characters is a way forward",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300896240321433635",
    "author": "itaylerner",
    "date": "2024-10-29",
    "content": "ime this happens to me when i'm overcooking it... could you just turn the guitars quiet enough that they don't mask the drum and bass? Maybe the guitars just don't need to be so loud on this one. I feel like rhythm guitars  serve their purpose as long as they're felt anyway. My strategy would probably be focused on adjusting levels, gentle hpf/lpf and some panning, and then probably some transient shaping.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300905877179469834",
    "author": "cian riordan",
    "date": "2024-10-29",
    "content": "Yeah this was gonna be my first ask. Most people try to have a full spectrum stereo image of the kit when really the meat of it should be mono.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301875846058868737",
    "author": "Matt Huber",
    "date": "2024-11-01",
    "content": "Anyone know why Soothe is so “leaky?” For instance, it helps to narrow its range of reduction, but if you do a null, there is activity all across the spectrum. \n\nIs this an unavoidable weakness of FFT plugins like this?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1302674606913753250",
    "author": "JustinLeu",
    "date": "2024-11-03",
    "content": "Did a mix last week where the mixbus had 3 cascading limiters INTO ozone with a ton of mid side eq and mid-side mb comp THEN 6db of Pro L 🤠🤠 \n\nThe rough sounded like a really good 7/10 but to improve it and “fix” any of the issues I wanted to would mess something else up. \n\nI had to replace/choose what to use from the mixbus. It just makes the mix take longer to figure out how to achieve the things you like about the rough without the negative artificers the heavvvvy mixbus creates.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1316476629014286367",
    "author": "bobby k",
    "date": "2024-12-11",
    "content": "Whenever you get the note to glue the BGVs to the main vocal more, what's your first instinct? To me, this might entail levels, EQ or group compression, but really the main detail that pops in my brain is panning. I was really inspired by the clairo album and how almost all the vocals are like right down the center or maybe 20-30% wide at max. unless i'm working on a track that's got a bright electronic poppy sound, i've been leaning a lot towards a more narrow vocal buss than ever before, and it's feels really satisfying.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1322457404813738024",
    "author": "spectrummasters",
    "date": "2024-12-27",
    "content": "Have a look into the physics of sound and psychoacoustics and it will inform you with regards to the utility of  things being said in that post and how to go forwards and create depth , width and height",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1325937363943292979",
    "author": "Colin Althaus",
    "date": "2025-01-06",
    "content": "I’ve found this often has to do with phase artifacts in M-S processing causing the image to sum together in odd ways (sometimes even ending up on the opposite side!)\n\nThink of M-S processing like algebra. When converting left-right to mid-side (which is really sum-difference):\n\nM = L + R\nS = L - R\n\nTo reconstruct L and R,\nL = 0.5(M + S)\nR = 0.5(M - S)\n\nSo whether something appears on L or R is determined by its phase relationship on the S channel (+S or -S) relative to the M channel.\n\nFlip the polarity of the whole S channel (+S to -S) and the whole image reverses: L becomes R, and R becomes L.\n\nNow imagine a steep filter like a 24dB/oct HPF… here is a screenshot of the measured phase response. At the corner frequency of 100Hz we see the signal is 180 degrees out of phase.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1325946879980212225",
    "author": "Colin Althaus",
    "date": "2025-01-06",
    "content": "Great example of why MS is not really “mid-side” at all but probably better thought of as “sum-difference”",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334949002025635913",
    "author": "Sam Segarra",
    "date": "2025-01-31",
    "content": "Been also trying to trick myself into boosting more. I'll sometimes use the \"bright\" eq preset in the Korneff El Juan on vocal doubles. That has a big 5k high shelf that I would not be comfortable with seeing.\n\nI also find I like proportional Q bell boosts a little bit more since they narrow in on what I'm trying to accentuate' as opposed to constant Q. Like MBSI or an SSL eq would be anyway",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337100163386314772",
    "author": "NoahNeedleman",
    "date": "2025-02-06",
    "content": "We def do this periodically, so it is worth a search for some good ideas. Currently \n\nEQP1a with a brought smile at either 30 or 60 and 12k\nTDR Kotelnikov or SSL G\nGem Dopamine gain matched on default \nPro Q 3 with some gentle basic shit to clean things up\nVarious creative plugs go here:\nPrecision K if I need width, ATR 102 if I need tape, Clarity for sheen, etc. usually not more than one. \nOzone Maximizer, usually IRC IV modern\nThen my metering plugs: LEVELS for LUFS reading and Tonal Balance Control for gut check",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340732641833648159",
    "author": "Brian Reynolds",
    "date": "2025-02-16",
    "content": "Was a discussion we had here a bit ago about creating width in a sound source. Basically putting a panner and modulation on a send and blending in. In video Andrew Scheps describes the same process but how he stole it from Tchad Blake",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340794694627491840",
    "author": "chrissorem",
    "date": "2025-02-16",
    "content": "I think with Tchad he was trying to recreate the h3000 patch “Beunos Notches”. Which is basically a moving panner  mixed with a moving phaser. I’m not sure I’d classify that as parallel  panning.    But Hay is for horses",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341857309269299315",
    "author": "Adam Thein",
    "date": "2025-02-19",
    "content": "I haven’t tested this with Logic but with Ableton this was 1:1 for me.  The real mess came with mono tracks and panning and bussing those as they weren’t hitting plugins with the same gain structure as in Ableton.  Hope this helps!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342273654574284821",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-02-20",
    "content": "Did they even have panning in elvis‘ day? Thought it was all mono until the beatles",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355594686189932715",
    "author": "Slow Hand",
    "date": "2025-03-29",
    "content": "Yeah. I never use the advanced features unless I'm out of options *and* it's critical to get it right. My default preset for the plugin has all of the fancy options disabled and I use it 99% of the time for simple volume-based panning.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1358485463760896210",
    "author": "chrissorem",
    "date": "2025-04-06",
    "content": "Word that makes sense. I  suppose it doesn’t matter if they are raw tracks, but  bet you are getting rough levels panning, filters some  eq here and there. But I’m more curious of why and the thought process would be for those who are referring  to “starting with the vocal or starting with drums.”  I very much understand muting things as you are working on things or soloing. I’m more curious of this other approach",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362789338097914058",
    "author": "thegreatcarsoni",
    "date": "2025-04-18",
    "content": "This has been coming up a lot recently for me. I’m trying to become more comfortable with the idea that what I think sounds good is often not as important or not even accurate in the context of what the song is trying to accomplish. So if it needs to be pretty bitey I should get that cookin but maybe don’t spend as much time mixing at a high volume where my ears will be upset. And also do that thing discussed here the other day where the perceived problems get narrowly tamed and then broadly boosted. Sometimes it just should be gnarly though and I wanna get better at being okay with that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1371174666944905327",
    "author": "chrissorem",
    "date": "2025-05-11",
    "content": "I’ve tried this with soothe but I almost always feel like it fucks with the width and depth to much. Although I did it yesterday and she passed",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378099193981173992",
    "author": "Brian Reynolds",
    "date": "2025-05-30",
    "content": "Panning sounds into their own space. Gives things breathing room as well.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1379968005290721390",
    "author": "Juliette",
    "date": "2025-06-04",
    "content": "Here's it in action, on versus off. This is the little song I put together using it and it had an instant change in warmth and width. Pretty cool to mess with for the first time.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1382114912406339625",
    "author": "cian riordan",
    "date": "2025-06-10",
    "content": "Stereo wideners can often get things to sound “wider” than you can go with straight hard panning. Lots of tradeoffs though… it can take things to shitsville very quickly if overused. Little goes a long way, especially on the master bus.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396208039966806037",
    "author": "NoahNeedleman",
    "date": "2025-07-19",
    "content": "With Jonathan on this. Was in a duo for a long time and a little panning goes a long way, and isn’t always necessary, but useful tool to have in the bag",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397044468758085969",
    "author": "Ingmar Carlson",
    "date": "2025-07-21",
    "content": "Had some great luck recently with the Stereo Width control on Ghz Panpot (in the advanced pane). Saved some really weirdly spread drums",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1401924982942072942",
    "author": "James Cronier",
    "date": "2025-08-04",
    "content": "I often find taking references literally is not the way to go. the client will often knows this too, consciously or not. They *likely* want a relatively some change if they’re happy with everything else. \n\nHave you tried everything you know how to do to make the BGVs feel a bit more grand and epic? \n\nA dB or two of level, some EQ, verb, or some creative panning might be all they actually want, and pointing to a different recording is the best way they have to communicate that to you.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1439085453126008915",
    "author": "Jonathan Jetter",
    "date": "2025-11-14",
    "content": "Could be harmonics, could be dynamic control, could be EQ, could be panning certain elements a bit more into the center. Could be stripping down productions where everything is stereo-ized and getting more definition and less blur.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1455016881458249921",
    "author": "junothemix",
    "date": "2025-12-28",
    "content": "honestly, i have been doing less plugins and more fader and panning, i think that's it. we add saturation, limiting, compression, so many when back then they had little. it kinda makes sense!!! just something to try if u haven't yet",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "878842550750969896",
    "author": "Eric Martin",
    "date": "2021-08-21",
    "content": "Mastering, but if used in mixing, makes mastering a nightmare IMO, I’ve had to master tracks that needed M/S work and the work I started doing caused insane panning issues, that made me apprehensive of using it until I REALLY need to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "879544593710989413",
    "author": "Eric Martin",
    "date": "2021-08-23",
    "content": "it’s not problematic if you don’t use any other M/S Processing after the one M/S plug, it stacks weird, but can be super useful, it’s the Spider-Man thing, with great power comes great responsibility. \n\nTry this, process something with M/S, then pull up another thing and try to process with that M/S after it and you’ll know what I mean",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "879740872894337086",
    "author": "Eric Martin",
    "date": "2021-08-24",
    "content": "you can check the phase relationship with a correlation meter like lissajous meter, I use the Plug-in Alliance meter for that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "884661410292969512",
    "author": "Zack Hames",
    "date": "2021-09-06",
    "content": "Broad topic here: how do you approach giving each element its own space in a mix? I tend to leave so many sounds with full frequency bandwidth and it works okay but I feel like really getting things focused in their spot would  help but it always sounds more lofi or small to me when I do that. Low passing is also something I almost never seem to like unless it’s for an exaggerated effect.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "901927686501445713",
    "author": "peterlabberton",
    "date": "2021-10-24",
    "content": "@hendrick I think loudness certainly has a bit to do with it, but I think there are a few other things at play as well. I could have my recording history wrong here, but my impression is that it wasn’t until the GML 8200 EQs came around that we really had super narrow surgical EQs. If you’re gonna go for the modern sound but still record acoustic instruments, tweezing out nasty resonances with EQ plays a big role—no way they could do that with 1073s. Also I think moving to (good sounding) digital made a big difference: you could get loads more bottom end, which was really taken advantage of in the best way with hip hop setting the bar for what we expect in that regard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "923667209681793075",
    "author": "Lifelurker",
    "date": "2021-12-23",
    "content": "Does anyone know the correlation between RMS and integrated LUFS of a song? It can’t just be 1:1, but is there, like, a formula?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "925895697218273291",
    "author": "cian riordan",
    "date": "2021-12-29",
    "content": "Hah! I have slight imaging already on my mix buss, I wouldn't want to push that any further... not to mention this is about as much additive EQ as I'd want to do with software (especially across the whole mix). Still, pretty damn close, and doesn't require $15k of hardware.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "926254906124402718",
    "author": "bobby k",
    "date": "2021-12-30",
    "content": "no it’s subtle so maybe i am exaggerating, tbh i have never used ozone’s imaging guy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "929882793125752842",
    "author": "Zack Hames",
    "date": "2022-01-09",
    "content": "Could anyone demystify stereo widening? Does anyone really use actual “wideners” or is it in the approach of the mix that you achieve width?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "933130431925207040",
    "author": "Deleted User",
    "date": "2022-01-18",
    "content": "Panning Stereo Source always felt weird, so I tried out balancing it by turning down the volume of the side closer to center. It feels wider and creates more space in the center for the bass, drums, and vocals.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "942257710005633035",
    "author": "KushKadett",
    "date": "2022-02-12",
    "content": "i'm trying to find an easy way to shave off transient from elements i like wide. In a lot of great productions there's this wall of stereo sound with gaps in the middle for transients to pop through. Is this just compression keeping things in the stereo field from poking through or how do they achieve this big but smooth sound?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "942269319423881287",
    "author": "peterlabberton",
    "date": "2022-02-12",
    "content": "Not sure what exactly others do, but I find that if things are too transient and pokey on the sides, it really bugs me—I like hard panning elements and then using transient shapers/upper mid cuts/fast attack compression to keep things on the sides loud but not distracting. I personally never try to achieve this on busses with mid side moves and instead do these moves on individual elements.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "943703095962140692",
    "author": "peterlabberton",
    "date": "2022-02-16",
    "content": "(FWIW, this question is partly rooted in a project I am mixing right now where the artist has gotten used to a rough that is very dark—think nothing but warm Junos—and mono, and I'm trying to inject some life/excitement buy tastefully brightening and panning stuff, without rocking the boat too much as I know the rest of the team is pretty attached to how things are in the rough.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "945892240193110027",
    "author": "cian riordan",
    "date": "2022-02-22",
    "content": "I think there's surely a technical benefit to having balance in the stereo field (across frequencies) in a mix. I often strive for that in most of my mixes. But creatively, this is music, and there's no rules... and with 'Daddy's Home', there was a lot of intention in the production & mixing process to have things sound woozy and a little drunk... so we really went for it with the wonky panning. The first song we mixed was 'The Laughing Man' and that really set the tone for the rest of the record, even the more up-tempo jams. Working with someone like Annie is honestly the best because there's no attention paid to what we 'should' do and all the intention put into what we 'want' to do.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "947268091996418078",
    "author": "Zakhiggins",
    "date": "2022-02-26",
    "content": "One day I recorded a rapper who wasn't a very good singer (good rapper tho) but he sang the hook which was a tricky melody for him, did 2 doubles each side of the main one and intonation was terrible on each, so I decided I'd tune them, as well as the main line- when I did this it immediately sounded so much worse and had way less width, so yeah what matt said",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "962423097254875137",
    "author": "cy (sigh)",
    "date": "2022-04-09",
    "content": "you can send all the drums to an aux post fader so it follows the levels you already have. make sure to follow your panning on the sends \n\n-then send that aux as a sidechain signal (key in PT) to the compressors on each channel you want affected. adjust the sidechain  level to hit the compressors accordingly and it'll affect each element with all the dynamic interaction.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "966157270893346826",
    "author": "sethearnest",
    "date": "2022-04-19",
    "content": "Have any of you noticed any specific pattern of speaker width and how it relates to something like vocal placement in a mix? What I mean is is there any rule of thumb anyone’s noticed along the lines of “if you tend to tuck vocals, try widening/narrowing your speakers” or vice versa sort of thing? Just curious.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "966180424252538890",
    "author": "absflores",
    "date": "2022-04-19",
    "content": "It’s funny because I’ve be dabbling with this concept, and although I’m not entirely sure, maybe @David Fuller might be the one with the knowledge, I feel like anything that might be out of equal triangle distances, could mess with phase. At some point I have the speakers too far apart and the stereo image was smeared and the vocal in the center was something I couldn’t define or treat accurately 🤷‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "966191880503164928",
    "author": "NoahNeedleman",
    "date": "2022-04-19",
    "content": "Speaker placement absolutely effects stereo field, but I think it’s pretty specific to the speaker, and def specific to the room. If your stereo field isn’t clear and you’re on good monitors, placement probably has a lot to do with it! Getting that phantom center to speak clearly is alchemy, but when it’s right it’s fucking magic.\n\nI’ve had NS10s suuuuper wide and they were still effective, my ATCs are basically equilateral with listening position and they’re perfect for me, and still useful for clients on the couch of my small space.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "973657347551539210",
    "author": "spectrummasters",
    "date": "2022-05-10",
    "content": "Just gotta thank you for posting this , this fellows description of the relationship between a sound’s density characteristics relative to its frequency.....in regards to spatial imaging is 💎. I’m watching his mixing essentials series and it’s just non stop gems.  He’s a bright guy. Thanks for putting me on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "980982430766866482",
    "author": "cy (sigh)",
    "date": "2022-05-30",
    "content": "same process just sending the channels to an aux pre-fader at the same  levels /panning and having that aux be the sidecían to the subgroup.  Solo the channel you need  \n\n(and mute it's send while you exp that channel - otherwise the channel would be send twice) \n\nfor that Disclosure song, think I remember him mentioning  he recreated that processing but more to his taste/liking",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983895251133558784",
    "author": "ehutton21",
    "date": "2022-06-07",
    "content": "just the way drawing in volume automation is flexible, and automating FX is much less painful for me in PT. it’s easier to be precise. not to mention, the wider range of shortcuts means i can clip gain automate, comp, and fade clips real fast.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983930049084424233",
    "author": "chloe corley",
    "date": "2022-06-07",
    "content": "got some feedback from a fellow discord member abt stereo space, and figured id bring it to the general group, tho im sure we’ve talked abt it before. its something ive struggled with a lot, i think mostly cause i shy away from like Stereoizing things, but is there any go to for ppl? haas effect stuff, microshift?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983930085612585010",
    "author": "chloe corley",
    "date": "2022-06-07",
    "content": "ive found double tracking+hard panning things ends up giving me a mono feeling thing since its the same sound on both sides",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983980193632907264",
    "author": "NoahNeedleman",
    "date": "2022-06-07",
    "content": "I love this topic. Great question @chloe corley! \nAll the ideas here are things that have worked for me, esp on the tracking side.\nBut I do you wideners too. Ozone Imager works really well for me on sources that are already stereo. \nAlso, something that really helps me, is using fx to widen. Taking a stereo delay and using it in Multi-Mono (this also works with eq,) and plugs like Primal Tap and Crystalizer. \nLast year I went deep into the stereo field, and the biggest thing i learned is that the only things in the middle should be kik snr bass & vocals, then everything else on the sides!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984937304017756170",
    "author": "NoahNeedleman",
    "date": "2022-06-10",
    "content": "Jon & Matt talked a little about mixing with darker vocals in the May 20th episode… really good insight there. But also:\nStereo field is your friend! I was recording vocals over a 2track today and totally forgot I could side chain a dynamic dip to the vocal on the track to make the vox speak better, instead I compressed the shit out of the vocal and it also worked… sooooo ¯\\_(ツ)_/¯ and by compress I mean I had one on the way in, 2 in parallel, 2 more in series after that, all-in about 30-40db of gain reduction. Works like a charm.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986358095980679228",
    "author": "Iwan Morgan",
    "date": "2022-06-14",
    "content": "I’ll share. It was actually really interesting to see that the Fat Bustard doesn’t seem to add a load of saturation. I tend to leave it at Attitude setting 3 or maybe 4 but even higher up at 6 the saturation is way less than you would expect. I’m doing this all by ear. I need to test it on an actual paid mix before signing off on it fully. The main message is the interaction between the wide EQ shapes and the subtle additional width and nice sounding minimal saturation.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "988998066348638268",
    "author": "ehutton21",
    "date": "2022-06-21",
    "content": "Can we bring back LCR hard panning plz",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "989002049872080906",
    "author": "Zack Hames",
    "date": "2022-06-21",
    "content": "(Except for Tom panning)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "995457942742642738",
    "author": "ehutton21",
    "date": "2022-07-09",
    "content": "Question regarding mid/side imaging tools/techniques & mono compatibility help:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "995458194308616282",
    "author": "ehutton21",
    "date": "2022-07-09",
    "content": "I’ve got sent a snare drum with mono compatibility issues, but not  in terms of its recorded nature (it was a sample, not mic’d off a drum kit). It’s clear that in the low mids, some kind of synthesis is going on with a distortion/feedback effect to add this ‘diving’ sine wave effect right before the transient of the snare connects (so it’s like if you had an open hat hitting right before the snare).\n \nIn mono, that low mid resonance effect disappears though, but the actual transient sound remains in tact.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "995458522718425139",
    "author": "ehutton21",
    "date": "2022-07-09",
    "content": "Is there anything I can do on my end to make the low mid effect more compatible in mono? It only occurs during a bridge but the artist and producer would like that sound to be mono compatible.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996894754602233937",
    "author": "ehutton21",
    "date": "2022-07-13",
    "content": "This one is not necessarily sexy but I also think that good white noise can be massively helpful here. I swear by the Octoverb preset in valhalla delay—put it on an aux and send the lead vocals out to it, (autotune it a bit to be really clean) and level it to taste but it’ll add a really satisfying, violin-synth like shimmer during a chorus. Get really crazy and distort it, warp it, automate panning for it. You won’t think “oh wow chorus is golden” but if you have that 90% there already, a nice harmonic addition like that being tucked in nicely is just great on the ears man.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998687418762932416",
    "author": "Jeremy Klein",
    "date": "2022-07-18",
    "content": "Haha this mixbus thread is fun. Mine:\n\n1) Ableton macro i made that allows me to automate narrowing the stereo image and bring down high and low shelfs with one knob.\n3) Slate CS-EQ For High Shelf\n4) Slate CS-Lift for Low Boost\n2) Ableton Saturator set to soft sine with clipper engaged\n5) Ozone 9 Imager -> Spectral Shaper -> Vintage Limiter In Modern Mode",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998795339425382410",
    "author": "NoahNeedleman",
    "date": "2022-07-18",
    "content": "Oooh all the way down at 20?! That’s ballsy. I generally go wider Q start higher, but imma try that low low and see what’s what.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998964231602982982",
    "author": "RUDI",
    "date": "2022-07-19",
    "content": "Good advice! Definitely gna play w the shadow hills more, the FG-X i’ve started to really enjoy & when i finally get paid for my last prod i might invest in the acustica fearn. Alsoo…Idk if it’s just me but it feels like the waves ssl bus subtly narrows the stereo image 🤔",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999163353396158535",
    "author": "NoahNeedleman",
    "date": "2022-07-19",
    "content": "I like L2 as well, but I do feel like it narrows my stereo image a little. Could be psychosomatic?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001545168857616534",
    "author": "ehutton21",
    "date": "2022-07-26",
    "content": "1000%. I think my best way of narrowing that down has been soloing the aux verb and adjust to taste with the metronome. If im off, I’ll hear it then",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001573974351822948",
    "author": "Will Melones",
    "date": "2022-07-26",
    "content": "Yeahhhhh I was just about to say, slightly offset predelays can make for lovely width!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1004490730053578832",
    "author": "ehutton21",
    "date": "2022-08-03",
    "content": "In the spirit of sharing what we’ve been doing lately: just started duplicating lead vocal tracks, pitching shifting them up for a layer with heavy stereo imaging, gaining down so it’s barely noticeable, and then actually turning the send of that layer way up as an alternate to the main reverbs I’m using. Put the high verb through heavy modulation and it can be a beautiful trip.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017264011273846894",
    "author": "ehutton21",
    "date": "2022-09-07",
    "content": "Can you &/or @cian riordan elaborate on bgv panning. I wa taught the classic “take two different takes of the line, line them up & do all the vocal editing, then pan hard left and hard right, level to taste” approach but that’s all I’ve known. Would be curious to understand other ways of panning bgv & harmonies",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017266917930717205",
    "author": "ehutton21",
    "date": "2022-09-07",
    "content": "Ohhh! That makes sense! Okay, Yeah I’ve heard of that. If you get more than a lead, a high, and low (say like a pair of lines similar that are mid range) are you panning them less dramatically to the sides or are you panning them hard left and hard right and just using eq to make a difference",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017434398737584178",
    "author": "Brodie Stewart",
    "date": "2022-09-08",
    "content": "Also sending the guitar to some early reflections or a short room just tucked in can add a hair of width and realism. Same for vocals. Less is more! Song-dependent of course",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030309129530638418",
    "author": "BatMeckley",
    "date": "2022-10-13",
    "content": "Eh, most of the bigger producers I’ve worked with have always been delay over verb. I know this is VASTLY over simplified by always considered reverb to be almost like front to back panning, rather than left right.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030310414581514250",
    "author": "Jeremy Klein",
    "date": "2022-10-13",
    "content": "i recently mixed a track in person for a super talented producer. The track was like 90s rock with super washy 80s vocals. Pretty much the only thing I did was replace all his super loud vocal reverbs with super loud delays. When a/bing with the rough we were _both_ pretty shocked at how the whole track just sounded so much punchier, wider, clearer, all the mixing buzz words, but the vocals still had that washy sound we wanted",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031766082266087514",
    "author": "Eric Martin",
    "date": "2022-10-17",
    "content": "I worked on a record where I was the guitar player only, and the mixes kept coming back odd in a way I couldn’t really articulate at the time, years later I needed to send files to our publisher and found out the mixer was panning the bass amp hard L and DI hard right and mixing them to be SOMEWHAT similar so they were super wide and out of the way of the kick and snare and vocal, ultimately it was fine, but also, really fucking messed me up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041224331511996447",
    "author": "Will Melones",
    "date": "2022-11-12",
    "content": "What if it’s a specific problematic resonance though? Won’t a wider Q have a more noticeable effect on surrounding frequencies that may be contributing desirably to the sound, while not as directly targeting the nastiness?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041224391016591501",
    "author": "Nomograph Mastering",
    "date": "2022-11-12",
    "content": "There’s a narrow range between maybe 2k and 6k where our ears really do have excellent resolving capability. And there the difference between 2.8k and 3.5 with say a Q of 2 can be real",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047627651998826526",
    "author": "Adam Thein",
    "date": "2022-11-30",
    "content": "Got my mix of the day ready to print, now can't get it to print because a plugin is crashing during render\n\nEdit: narrowed it down, UVI Drum Replacer, got it sorted",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053398732885999826",
    "author": "Chris Doms",
    "date": "2022-12-16",
    "content": "Did two albums recently, on one the longer it took to hear back usually meant more notes, plus it was a band. The other was for an artist but it had no correlation, and I know they’re busy apart from their music at the moment.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1056251735947096244",
    "author": "Nomograph Mastering",
    "date": "2022-12-24",
    "content": "“But we love the width and clarity on the digital”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1060935042358050839",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-01-06",
    "content": "The Thing is My Ears are Not that much Trained to catch the Setting of reverb.\nThe only thing I can Genuinely tell is if my instrument is too wet or too Dry and Differentiating between Different Reverbs i.e. Plate,Chamber,Spring,Hall etc but I get confused when i have to setup a room reverb for a perticular mix project.\nLike, what predelay and decay length should be which is suitable for that perticular track and What exactly happening in theory when I decrease or increase the room size?\nTill now i have benn using The BPM Method but i'm now satisfied with it.\n\nWhy I'm asking this because I'm Trying to setup 3 AUX/RETURN Reverbs for Panning My Instruments Back To Front\nSince, TrueVerb has a Distance Feature, I can Asign 3 Perticular Distances in those AUX/RETURN channels and then send my instruments to these channels to mimic the distance/Depth between then Instruments.\n\nAlso, If there's a Loop Hole In my thought process or a better way to execute what I'm trying to achieve then feel free to correct me.\n\nand the answers of the question that I'm Looking for is\n1. Things to Ques Yourself before Setting up a Room Reverb.\n2. On what Variables the Settings( Pre Delay, Decay Time, Room Size) Depends.\n\nAnswers with Examples of Some Pre Released Tracks will be Extremely Helpful!\nSpecially for Hip Hop Records",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1060947037870379149",
    "author": "NoahNeedleman",
    "date": "2023-01-06",
    "content": "Ok so you’re looking for how to use a Room Reverb for Front to Back panning?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062150973646196806",
    "author": "ehutton21",
    "date": "2023-01-09",
    "content": "I feel like automated panning delays of adlibs that are panned to the left or right is where I carve my little niche with adlibs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1063599471553941554",
    "author": "LAPhill",
    "date": "2023-01-13",
    "content": "This! When the chess board is that tiny, it's easy to think you're being a disrupter or innovator when your output is just barely left of center. There's so much more room for new ideas than we're giving the landscape credit for. (I think? Maybe everyone likes living in their narrowly defined genre conventions, but it's so boring).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1063920691298172969",
    "author": "Nomograph Mastering",
    "date": "2023-01-14",
    "content": "But likely just correlation, beginners etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065123947307343972",
    "author": "Deleted User",
    "date": "2023-01-17",
    "content": "Stereo image on dense arrangements:\n\nHow do you make them actually feel wide and also have enough upfront-ness in the middle to achieve the perceived loudness? I tried extreme panning, and mix of both- it’s still not satisfying and everything feels far away.\n\nThe particular song I’m working on needs grand-ness, it is orchestral with electronic drums. One of them needs to sit further back, but if I prioritize the drums it doesn’t feel grand- and the other way around drums don’t hard enough right in the middle",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065126455417262121",
    "author": "Deleted User",
    "date": "2023-01-17",
    "content": "I produced this while I didn’t have monitoring environment set up, so the stereo image is all sorts of mess. I think I might have to start from scratch on the mix",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065178190257066047",
    "author": "Ross Fortune",
    "date": "2023-01-17",
    "content": "This is wild. Not once has it ever occurred to me - in fact, my whole FX return bus goes out via my “wide” bus (~20% ozone multiband widening on 400Hz-5k).\n\nApart from mono verbs (which I love placing), the instinct has always been to push the time and mod FX far out wide so the drums and lead vox live unimpeded.\n\nYou made some great stereo image notes on that mix I sent. Will def be trying this “narrowing” you speak of.\n\nAre you just going pan pots in, or something more sophisticated to narrow?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066803207503892540",
    "author": "ehutton21",
    "date": "2023-01-22",
    "content": "What effect, the width? The gain?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066855041950040064",
    "author": "ehutton21",
    "date": "2023-01-22",
    "content": "Any advice for layering synth basses with regards to phase and panning/image? We want this really specific moog/saw hybrid that I feel best about blending. I’m filter the higher of the two bases with a 12 db lp filter and the “subbier” bass with a 12 hp filter, and I don’t lose anything in mono, but there’s a bit of a disorienting movement to the low end from left to right even at like 100 and below",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068220702890676324",
    "author": "stefanmacc",
    "date": "2023-01-26",
    "content": "Darker for sure in most cases .. Diff tone mic or distance from mic or both helps too… So there’s actually a sense of width/space when panned",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068660739746828299",
    "author": "peterlabberton",
    "date": "2023-01-27",
    "content": "The Neutron width thingy in the lower right ain't bad if you don't want effected (chorused/dly'd) stuff, just added width",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068661968057139230",
    "author": "Skyler Young",
    "date": "2023-01-27",
    "content": "So far neutron width thingy is my favorite",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068669523852541963",
    "author": "Ross Fortune",
    "date": "2023-01-27",
    "content": "And the answer is… none… more wider",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068875535054274560",
    "author": "ALXCPH",
    "date": "2023-01-28",
    "content": "Does anyone else think the wider plug-in does a really good job at making things wide and mono compatible but just doesn’t sound very nice on its own?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068904081587982396",
    "author": "Ross Fortune",
    "date": "2023-01-28",
    "content": "I do this quite a bit. I think it’s partially what muddies things re the way forward - for instance on a thing I’m working on rn that’s been difficult, I can hear with utter clarity the rhythm gtr part on verse 2 that I know will solve a bunch of issues. But the artist, producer, other band members etc have all worked this far and I’m not hired to produce. So I’m editing, delaying, panning… breaking my back to make a part work when the problem in this instance is definitely the part and how it’s played, not the sonics.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068945488121966743",
    "author": "Adam Thein",
    "date": "2023-01-28",
    "content": "On the topic of drum overheads - I sometimes get stereo overheads where the kick and snare image is really weird - snare pulling left and kick pulling right.  Anyone have tips for trying to get your super wide overheads making sense together especially when you don't have a mono OH to ground things back to the center?  I often end up pulling in the stereo image pretty drastically to try and keep kick/snare focused in the center but it never usually turns out as well for me as drums engineered with a mono OH or a tighter stereo OH pattern",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075806482433589368",
    "author": "Adam Thein",
    "date": "2023-02-16",
    "content": "A bit of a tangent but somewhat tied in - there's a feature in pro Q3 to do adaptive-Q (the more you boost/cut the narrower the Q) if you are looking for that behavior/like that sound.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1075840782784802846",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "The thing that has changed is how many more people have the tools to make records. That has both sped up the process and reduced the quality control. These are related ideas but not the same.\n\nBecause people can create and put out music quickly, there is a lot more competition for making everything happen quickly, even for major labels. They are trying to compete with the overall speed of content output. This means that the length of time people have to live with mixes and masters is much shorter. So people miss things more easily.\n\nThis speed affects quality control as described, but there is another aspect. Because the number of people who can produce mix and master records has increased dramatically, that narrow funnel of sonic gate keepers no longer exists. There are probably 100x or 1000x as many capable mixers than there were 20 years. Same with producers, songwriters, artists, whatever.\n\nPhilosophically, I love this. But of course, the quality of recordings now varies much more than it used to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080987545535516702",
    "author": "Rollmottle",
    "date": "2023-03-02",
    "content": "panning in it is gold",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081016306238750821",
    "author": "Adam Thein",
    "date": "2023-03-02",
    "content": "Ableton, had one of those freaky freak things where it recovered things like fader positions and panning but none of the plugin changes 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084256836770873405",
    "author": "ehutton21",
    "date": "2023-03-11",
    "content": "No more weird panning automation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084855556285673573",
    "author": "cuba1956",
    "date": "2023-03-13",
    "content": "For tighter image I personally  would probably use some sort of M/S processing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085627477390524496",
    "author": "Jeremy Klein",
    "date": "2023-03-15",
    "content": "ill give trackspacer a try! I think im narrowing in on what i struggle with these auto-ducking delays. They are like i can hear someone just riding a volume fader on the delay in an imprecise and non transparent way. Trackspacer can be very transparent and its only part, not all of the singnal, so maybe ill like this approach better!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085930012009578496",
    "author": "spectrummasters",
    "date": "2023-03-16",
    "content": "My main thing going OTB is I think I lose a little transient detail just from A/D to D/a but boyyyt the stereo image is v different also when you mix hybrid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087792262790000801",
    "author": "EliHeathMusic",
    "date": "2023-03-21",
    "content": "Just started mixing an album for a fusion instrumental group with two drummers. I was wondering if anyone has experience working on projects with two full drum sets and thoughts on approaching it (especially with regard to space and panning)? The drummers are both good players and recorded fully isolated but they are often playing the same parts and there's a ton of flams between the kick drums etc. Not really something I can fix with mixing but definitely taking it into consideration. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091352466278322196",
    "author": "austenballard",
    "date": "2023-03-31",
    "content": "But also IIRC @oaklandmatt discussed it with Jon on one episode, specifically with regard to Ableton, and how something it does is analogous to a streaming service reducing the bitrate or video resolution when there's limited bandwidth. Maybe he knows more",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1096855695879581807",
    "author": "Edward Rivera",
    "date": "2023-04-15",
    "content": "I had to buy a pair of M50x's out of necessity during an emergency, and I couldn't tell what from what. Panning sounded weird, couldn't hear crossover points of instruments, it was like sitting in a car",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1096869212493983817",
    "author": "Adam Thein",
    "date": "2023-04-15",
    "content": "Tried this for a while - I'd spent several years mixing without Canopener before adding it to the toolchest - for me it messed with my translation more than it was worth.  Would probably be infinitely more helpful to someone like you who is working on speakers most of the time for imaging/low end.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1096884490560880660",
    "author": "yaldaram",
    "date": "2023-04-15",
    "content": "MetricAB provides much more comprehensive analyzing solutions also. Listenhub doesn't even have correlation meter. But with an iPad, it quickly became a key part of my workflow.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100776447318175806",
    "author": "esquinalee",
    "date": "2023-04-26",
    "content": "My stereo field and I thank you 🙏🏼",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103756643956699247",
    "author": "Josh Bowman",
    "date": "2023-05-04",
    "content": "Hey anyone messed around with Fabfilter ProQ3 Bell shape/slopes? I usually just stick to the default 12db/oct but a few times i went up to 24 to try and scoop out a \"bigger\" or less narrow chunk and it seemed to do what it looks like its doing. I was curious so i checked it out in plugin doctor to see if it does what it says and seems to... I did notice the phase shift changed when you go steeper on the Bell shape. Any real world negatives i should know about to going past the default 12db/oct setting?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112240365852967032",
    "author": "jantrit",
    "date": "2023-05-27",
    "content": "It’s hard to say without hearing the mix in question. It’s always fun to play with the stereo field, sometimes some bold hard pan choices can really open up a mix without changing to much of the bones. Also slap and tape delay can do similar things. Again very mix dependant but playing with the delay time as you print the effect can add some cool shit without actually doing to much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117040460964315176",
    "author": "owengineered",
    "date": "2023-06-10",
    "content": "What reverbs are you guys and girls using on harmonic instruments in your mixes to push things further away? I've mostly been using volume, EQ and narrowing to make elements sound less present mixes but feel like some elements need a touch of reverb/delay as well to really add distance and haven't really found anything that really clicks yet.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117129926643023883",
    "author": "Deleted User",
    "date": "2023-06-10",
    "content": "yeah, @Slow Hand did a test and tried mid side balance as well but it still ended up sounding weird",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123980694117425314",
    "author": "Deleted User",
    "date": "2023-06-29",
    "content": "My guess is it isolates a frequency band and calculates what would give the best phase correlation. Takes the number of samples it needs to be nudged for best coherence in that frequency band and moves the whole thing by that much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1133116309098483844",
    "author": "Edward Rivera",
    "date": "2023-07-24",
    "content": "The picture feels less splayed out and more focused, while not folding things too much to miss subtleties of the stereo image (which I did using presets) so it's at a point where it sounds better on than off \n\nInsane little box",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1133164225481683038",
    "author": "Josh",
    "date": "2023-07-24",
    "content": "It took me months to understand the imaging",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138540232216686634",
    "author": "jantrit",
    "date": "2023-08-08",
    "content": "Sometimes one sometimes the other sometimes one into the other (both ways) lol that’s not super helpful I realise. I have a ssl g buss that I like to use if I stick it on and it feels good it stays. Sometimes I’ll use the shadow hills comp in the box for dual mono purposes, I like to do a lot of weird panning and this let’s me accomplish that without things getting weird",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138544012530298952",
    "author": "chrissorem",
    "date": "2023-08-08",
    "content": "Nice that’s what I hear as well. My buss compressor is more of pain to setup in dual but everything feels bigger and wider and the center feels more powerful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140203506544951398",
    "author": "rawssx",
    "date": "2023-08-13",
    "content": "Or wait, Do u mean hard panning the reverb bus?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140256784129478716",
    "author": "Joshua Riley",
    "date": "2023-08-13",
    "content": "I do this with guitars but with delay. Pan the delay to the other side and you get some nice width",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140359364130128013",
    "author": "cian riordan",
    "date": "2023-08-13",
    "content": "It's the panning that bothers me the most with a mono source in a stereo track.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140376597304713297",
    "author": "cian riordan",
    "date": "2023-08-13",
    "content": "It's a rough IR, so make sure to check phase with things you send to it... chambers always do weird things. I would start by sending mono sources to it -- kick, snare, mono OH. The chamber also sounds really wonderful in mono for old-tymey reverb or if you're doing creative panning.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140496411566297239",
    "author": "Deleted User",
    "date": "2023-08-13",
    "content": "it sounded kind of dull, and wasn't wide enough nor tight enough (as in it kind of sounded like I used Haas effect but not really). \n\nit did end up lopsided, so I had to fix it with level adjustments - but I ended up just using the mono mic that I set up as a backup",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140498620358070373",
    "author": "NoahNeedleman",
    "date": "2023-08-13",
    "content": "I did Cian’s trick of the wide top to bottom and instead of left to right, and honestly it was wide but the way it hit the stereo field was disorienting for me. It’s all about what you’re looking for. If it doesn’t work don’t worry too much about it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143624926151065610",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-08-22",
    "content": "https://open.spotify.com/album/59YYObx9wFEFG5zVdlfwvf?si=QM_GcKaFQQSrrY5tnSubRg&context=spotify%3Aalbum%3A59YYObx9wFEFG5zVdlfwvf\nHow does one get such clear mixes!?\nYou can head each and every element in their place?\nIs it in production?\nOne thing that I surely understood is panning but man! These songs are a party in themselves with each elements dancing in its own place",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1148448894192209970",
    "author": "NoahNeedleman",
    "date": "2023-09-04",
    "content": "Convo started in Monitoring. \n\nShould we not be using Piano for width? I find myself spreading pianos a lot to make room for vocal frequencies… am I doing it wrong?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1148500391865106513",
    "author": "Edward Rivera",
    "date": "2023-09-04",
    "content": "Should we not be panning drums either ?\n\nIf the arrangement calls for it, yeah I'll spread the piano out because when one sits at the piano, the lows are on the left and the highs are on the right and I always like to at least *start* from a musicians perspective because they're going to play, in part, as a response to what they hear \n\nI've heard audience perspective piano and it's even more atrocious than the drums version\n\nMono is fine if you're Iggy Pop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151537854481170543",
    "author": "NoahNeedleman",
    "date": "2023-09-13",
    "content": "A producer buddy of mine asked me yesterday how often I listen in mono while mixing. I said “When I find myself using too many stereo imagers to make things fit, sometimes I’ll check to see what kind of fuckery I’m causing. But honestly who listens in mono anymore?”\n\nHe reminded me a lot of small Bluetooth speakers are in mono, so I decided this morning to take a fresh look at a tune I’m producing/mixing, starting in mono. \n\nThe leveling choices totally broke down when I switched to stereo, but I think the mix is much better and it happened faster cause I was forced to look at the eq in relation to the center elements, so even when I spread them back out there was more room for the vocal kik snare bass to speak. \n\nY’all ever start a mix in mono? Or work with mono as a tool for extended periods?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151622993911496904",
    "author": "Edward Rivera",
    "date": "2023-09-13",
    "content": "Agreed. I'm not in the mix for the lowest common denominator camp. But my brain doesn't make decisions well when too much is coming at it. And apparently a stereo image is too much for me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154103788098035712",
    "author": "Nomograph Mastering",
    "date": "2023-09-20",
    "content": "It’s been established that I am deaf to drum panning, I have never once noticed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1160931430759665675",
    "author": "Jonathan Jetter",
    "date": "2023-10-09",
    "content": "Over here in the mix, I do a fair amount of widening on certain single elements, synth pads + atmosphere tracks, + backing vocal stacks. Usually just straight M/S gain adjustments. And I'll sometimes narrow certain drum overheads or room mics. And I'll sometimes have a bit of M/S EQ on the mix bus (especially if it was on the producer's rough mix).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1160938838475149455",
    "author": "NoahNeedleman",
    "date": "2023-10-09",
    "content": "So think of mid vs side in terms of panning left right & center, and think of EQ as volume. \n\nIf you’ve got a lot of low end information on the sides, and say it’s fighting with a mono bass track that’s supposed to be holding down the majority of the low end, you can eq the lows out of those panned tracks, or you can blanket turn all the lows down on the sides with a m/s eq on a buss, so that the L and R info is quieter. It’s basically a group volume ride for frequencies instead of tracks. You can also do this on individual stereo tracks if just panning isn’t granular enough. \n\nThe why & when is mostly about taste. I tend to mix into a proQ3 setting that has the sides hi passed around 100 for the same reason I have a pultec boosting highs & lows on the master- it just ends up doing a lot of work for me.\n\nIt can become problematic if I’ve got big toms in a song and, after I’ve got a mix starting to cook I’ll toggle it on & off to see if I’m doing more harm than good. For the kind of music I mostly do, it works more often than not, but the one song I sent to Cian for mixing he basically blasted me for doing that. (In his own kind and gentle way.)\n\nBut m/s eq isn’t just for the master buss. You can think about it for any stereo track. Sometimes, I have an acoustic that’s carrying the whole song, but the fundamentals are fighting with the vocal, so I’ll turn the mid down at that frequency (or side chain that to the vocal if it feels anemic when the vocal is out.) that leaves the sides as big as you like cause it’s not fighting with my mono vocal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1162578942876712980",
    "author": "Garth Tim",
    "date": "2023-10-13",
    "content": "in my experience, best results are done manually with spectral editing. a general boost in the 4k+ range, then a more narrow boost by about the same amount after that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164296545055801384",
    "author": "river",
    "date": "2023-10-18",
    "content": "like my mid side de-emphasis distortion chain",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169457968178286603",
    "author": "cian riordan",
    "date": "2023-11-01",
    "content": "Drums:\n* Drums are currently too loud relative to everything else; could also increase width: You say it's too loud, I say it's the perfect wake-up call for your neighbors every morning.\n* Address low-end resonance in toms: Those toms are just trying to find their inner peace. They've got a lot on their minds.\n* Snare during chorus needs to have less clap in the mix, sounds too boxy: The snare wants to be less boxy? Does that mean it wants to be more triangular or maybe even octagonal?\n* Investigate the source of block hits at 1:06: It's a mystery – who's secretly playing with wooden blocks in the studio? The plot thickens!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171829358244151378",
    "author": "river",
    "date": "2023-11-08",
    "content": "i think it sounds awesome, and is mono compatible as well !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171829477412712498",
    "author": "NoahNeedleman",
    "date": "2023-11-08",
    "content": "Simplest- Duplicate the track, insert mono delay at 13ms or so, adjust level & panning to taste.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179853585434034227",
    "author": "Rob Domos",
    "date": "2023-11-30",
    "content": "Brigade chorus is really fantastic for spatial spread and getting synths to sit back and make room. I use it all the time. Studio D chorus is great for that 2010 parallel pop width / gloss",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183572307902468106",
    "author": "Ingmar Carlson",
    "date": "2023-12-10",
    "content": "Also, in my own experience as a mixer, this all feels a bit out of my control sometimes? I’m not sure we’re really the final arbiter of what constitutes bringing real value to a project anyhow. Made me think of one project in particular (though this has happened several times), where two primary producers on an album had pretty divergent expectations as to what the mixes ought to achieve. One of them said he was a fan of my work and to just “do my thing and go crazy” on his half of the album. The other responded to my first passes on his tunes with something like, “I’ve actually worked with some really great (read: bigger) mixers who just made things a *little* deeper and wider” (read: so I’m not sure why *you’re* doing more than that…). My initial thought was that maybe his tunes should go straight to mastering? But both of these producers, and the artist and team, felt confident that someone should mix the entire project – and that there needn’t be, say, a sliding scale in the rate for different songs. In those sorts of scenarios, I do think mixers can bring a good deal of value just by making everyone on the project happy and being agreeable about it. But I dunno maybe mixing ought to be “skipped” sometimes!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186351156692271104",
    "author": "Jonathan Jetter",
    "date": "2023-12-18",
    "content": "I've always been doing it with EQ. Another instance of Pro-Q with 6 bands, all automated. Then Audiosuite for little narrow notch-y stuff. Thinking about making the switch to an RX-based workflow.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187859866610581514",
    "author": "Bryan DiMaio",
    "date": "2023-12-22",
    "content": "Is your DAW using a different pan law than theirs and some of the stems are mono so you’re then panning them in your DAW?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187862322245533706",
    "author": "Jonathan Jetter",
    "date": "2023-12-22",
    "content": "Not just a straight gain difference unfortunately- definitely impacts frequency balance + imaging. Almost like it's an input trim difference into the mix bus chain.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188102137205497876",
    "author": "Adam Thein",
    "date": "2023-12-23",
    "content": "Are you recalling the panning or is it baked into stereo tracks? @Jonathan Jetter",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189753037594566796",
    "author": "Will Melones",
    "date": "2023-12-27",
    "content": "There’s no way I was panning both guitarists stage right where they were huddled together",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191432924764053504",
    "author": "NoahNeedleman",
    "date": "2024-01-01",
    "content": "Also the absolutely unhinged drum panning on this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197213263071551538",
    "author": "NoahNeedleman",
    "date": "2024-01-17",
    "content": "Panning is your friend.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1198669470894395472",
    "author": "popaganda.",
    "date": "2024-01-21",
    "content": "It entirely depends on the song and where it will be heard. If it’s indie I think you’re aiming for headphones, Bluetooth, laptop speakers, tvs, theaters. You can get away with wide, cool panning, etc. but anything made for the dance floor has to slap when summed, and also needs the important information coming through both sides.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200687198115217459",
    "author": "NoahNeedleman",
    "date": "2024-01-26",
    "content": "Panning is such an overlooked tool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205228652661575811",
    "author": "Soundswithsammy",
    "date": "2024-02-08",
    "content": "Hey All! My Mixbus chain has been a combination of the god particle limiter, and Ozone 11 and sometimes a Fabfilter L2 after, but usually just the God Particle to an Ozone. I've noticed lately, that when I go God Particle to Fabfilter L2, the sides of the music push out significantly more. I've been getting more clarity in the instrumentation of my mixes. The compromise is less saturation, but I think I like the separation (the fabfilter or Ozone limiter was only ever doing 1-2dB of work, but still completely changing that final spectrum. I'm having trouble telling how soon my mixes overload with the Pro L-2 unfortunately. Do you think wider is better? or is a trick and it's too wide, and all that width is overload? I have trouble detecting overload in my Insight2 Plugin, I only notice it on phone speakers after the fact. any advice to help decide?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205229782997008535",
    "author": "Soundswithsammy",
    "date": "2024-02-08",
    "content": "i feel like it hides in mixes that I finish with Fabfilter more than mixes in Ozone, but i get this width. I'm wondering if the width is even better to have",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1206729641914535936",
    "author": "NoahNeedleman",
    "date": "2024-02-12",
    "content": "Love this. It’s amazing what a little panning and eq can do",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207366016196419626",
    "author": "NoahNeedleman",
    "date": "2024-02-14",
    "content": "I just found the “swap sides” button on Ozone, tried it and I swear the mix sounds wider. \n\nThat’s gotta be psychosomatic right? Like it’s not actually wider, I’m just hearing things I’m used to in the opposite ears and so it feels wider?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209532526301806613",
    "author": "Jonathan Jetter",
    "date": "2024-02-20",
    "content": "There are a couple quirks to get more mileage out of the FabFilter too. The bandpass selection is proportional Q to a certain extent- i.e. a narrower frequency selection can sometimes cause *more* reduction.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209991748017983569",
    "author": "Nomograph Mastering",
    "date": "2024-02-21",
    "content": "Great, we’ve all kind of known that. Back to FFT, which works in a LINEAR  way. If we run a 16 “band” FFT on a 48 kHz signal it will divide the audio spectrum (0 Hz to 24 kHz) into 16 evenly spaced bins or bands. Each bin is 1500 Hz wide. Think about that for a second. That means we have a a single bin that contains everything from 16500 to 18000 Hz, a very “narrow” slice as it pertains to musical interest. On the flip side we are left with only a single bin that represents everything from 0 Hz to 1500 Hz, a huge chunk of the music. If the whole point was to slice up this signal so we could do something interesting to it then that is often not the resolution we hoped for. \n\nI see the hands going up!! “Let’s just increase the number of bands to get more frequency resolution”. And herein lies one of the confounding things about FFT. We are caught in a frequency domain/time domain tradeoff. The finer the bands or slices the more things blur in the time domain when we reconstitute via the iFFT (of the bands we have processed any or all bands). If no processing then you can run any length FFT and then the iFFT and perfectly reconstruct the original signal. (This is what you’ll often see 16 to 48k FFT on signal meters).\n\nSo some practical examples to help you guys get a handle on this. Open a file in RX and get the spectral repair module in attenuate mode set to a strength of 1. Set bands to the lowest possible (128?), figure out how wide your bins are. Now try to do a detailed edit in the low end, you’ll notice that you don’t have much “resolution”, but up high say above 10k it’s razor sharp. Now bump up your bands to the max 4096. Do the same LF edit and you’ll suddenly have nice narrow frequency slices but you’ll see things getting very blurry in the time domain, tight kicks become smeary whooshes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222980346358927481",
    "author": "spectrummasters",
    "date": "2024-03-28",
    "content": "i defo got my mind opened bigtime by that aes lecture on masking you shared ruairi.....especially with regards to the utility of making the effort to not leave mix elements \"unmoving/static...with respect to use of panning, faders and filtering.....should you wish to reduce masking in mixes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1224841861055643739",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-02",
    "content": "makes sense - but to be clear, I assume you're not talking about narrow q cuts for out-of-scale semitones? That's what the Scaler EQ automates apparently",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1224852931342237777",
    "author": "Jonathan Jetter",
    "date": "2024-04-02",
    "content": "(In addition to all the usual worries about super-narrow EQ)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225457831160053760",
    "author": "Nick DeMichele",
    "date": "2024-04-04",
    "content": "Yeah things are a little too separated stereo field-wise",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225531423406952508",
    "author": "jonmatteson",
    "date": "2024-04-04",
    "content": "Have you tried making some stuff more mono? Also try linking your limiter/compressor to narrow the stereo field",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1226014887822622821",
    "author": "BatMeckley",
    "date": "2024-04-05",
    "content": "Side chain soothe, narrow range.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230702832030842962",
    "author": "Matt Huber",
    "date": "2024-04-18",
    "content": "Ohhhh…\n\nOne of the biggest thing for me is how the idea of width changes. A front loaded Atmos mix will almost always sound narrower than stereo in headphones because LR is in front of you in an a little bit in Atmos. So you kind of have to find ways to be creative to achieve a similar width",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230709269914189875",
    "author": "Ingmar Carlson",
    "date": "2024-04-18",
    "content": "The width issue that @Matt Huber is describing is maddening. Kinda hilarious that the “spatial” mix often ends up feeling less wide in headphones. That sensation at least is translating to our various HRTFs haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230732918012383286",
    "author": "Ingmar Carlson",
    "date": "2024-04-18",
    "content": "It actually makes perfect sense that a 3D soundstage would necessarily be less wide in headphones. Just funny when the selling point is that it's a more \"impressive\" audio experience. Also a slog when you're trying to match stereo pop mixes that are leaning into maximum width as if their life depended on it (probably because it does)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237621355541954641",
    "author": "NoahNeedleman",
    "date": "2024-05-07",
    "content": "Are you referring to that whippy panning thing that’s happening down around 3-400?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242085745985065002",
    "author": "h3x",
    "date": "2024-05-20",
    "content": "I love this and have found all this to be true, my only gripe (which is totally a mental thing) is that i feel like if something is placed in the center, then it can only be there or spread out to the L and R. Im a baby when it comes to panning things slightly out of the way because i get worried it will take away from the width of the L and R spread elements (like a double tracked L and R main guitar or spread BGVs). Any tips or reassurance therein that regard? Curious how people think about panning and their workflow when it comes to panning for separation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242120151294279852",
    "author": "Jonathan Jetter",
    "date": "2024-05-20",
    "content": "Also, the width of an individual track or tracks is not the same as the collective width of the overall mix.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242143402175365253",
    "author": "Josh",
    "date": "2024-05-20",
    "content": "The ambience and early reflections in abletons convolution verb will have different panning situations in them if you haven’t explored that yet",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243618558802661497",
    "author": "Jonathan Jetter",
    "date": "2024-05-24",
    "content": "In all seriousness- is there a way to keep Masterdesk from automatically throwing mono LF content into the stereo field? Can’t seem to narrow it down to any one parameter.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245140842130444409",
    "author": "peterlabberton",
    "date": "2024-05-28",
    "content": "And what’s up with the mid side one?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248037251829600286",
    "author": "Nick DeMichele",
    "date": "2024-06-05",
    "content": "This is probably a noob question but I’ve been trying to be really thoughtful about where frequencies are overlapping/causing masking and what not and I’m wondering how the stereo field comes into play with that kind of thing. Like if two mix elements that live in the same frequency range are hard panned opposite each other does masking still happen or does that only concern things that are stacked in the same part of the stereo field? Hopefully that makes sense, if anyone wants to riff on that or masking in general I’d love to hear any input since that’s a spot I’m not too strong in",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1259622131604520971",
    "author": "hyanrarvey",
    "date": "2024-07-07",
    "content": "Or don’t turn it down cause panning will turn it down",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1259710725178261535",
    "author": "NoahNeedleman",
    "date": "2024-07-07",
    "content": "Gah. That’s tough. Panning is likely gonna make it more apparent- did they give the down 3db note cause they know that? Or do they think panning will help bury it and it’s two parts of the same note “bury that shit” ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1260751439269990402",
    "author": "chris_donlin",
    "date": "2024-07-10",
    "content": "H3000 for width? Micropitch shift?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265026525250584637",
    "author": "spectrummasters",
    "date": "2024-07-22",
    "content": "The space and wide impact you create with your panning has been a revelation for me this year . It’s like a whole dynamic is available",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267569108527087687",
    "author": "spectrummasters",
    "date": "2024-07-29",
    "content": "There’s so much to take away from your work . As I said before , the width and impact of your mixes is actually killer ! 👍",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270828903375700150",
    "author": "PKirk",
    "date": "2024-08-07",
    "content": "Anyone know exactly what the stereoize algorithm #2 in Ozone Imager does? \"Velvet\" noise de-correlation... Anyone use this on the stereo bus?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270836922104680559",
    "author": "Slow Hand",
    "date": "2024-08-07",
    "content": "And it has much better mono compatibility. Which is part of what’s so extraordinary to me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270837495340204104",
    "author": "PKirk",
    "date": "2024-08-07",
    "content": "According to ChatGPT: \n\nVelvet noise decorrelation is a technique used in audio processing to create a sense of spatiality or wideness in a sound. It involves using a sequence of sparse, randomly placed pulses (velvet noise) to introduce small delays to the audio signal. This process helps to break the coherence of the original signal, reducing correlation between channels and enhancing the perception of space and depth in the audio.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1271791163891912744",
    "author": "Sam Segarra",
    "date": "2024-08-10",
    "content": "Try the Echoboy - Bass - ChorusWideRoom preset",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1274546608649801740",
    "author": "Felix Byrne",
    "date": "2024-08-17",
    "content": "even just at like 1% makes the repeats way wider",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275902811418136670",
    "author": "jantrit",
    "date": "2024-08-21",
    "content": "Awesome, I had a similar feeling. Found it was initially nicer in a density kinda way but proL just had some width on it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277374291867996181",
    "author": "Iwan Morgan",
    "date": "2024-08-25",
    "content": "I absolutely LOVE weird super wide panning which doesn’t sound natural. That’s my golden rule.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277386735814443101",
    "author": "oaklandmatt",
    "date": "2024-08-25",
    "content": "If she's working primarily in sync, it sounds like she could be right about hard panning.\n\nWhen we worked on X Factor, there were different needs for broadcast television mixes. The main mixer for the show gave us a nice rundown of mixing differently for the show (less hard panning, sub won't translate so focus on mid range, vocals and drums should be a little louder than our \"pop\" mixes). It was enlightening.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277390528094142515",
    "author": "oaklandmatt",
    "date": "2024-08-25",
    "content": "While you guys are looking for faults in what she wrote on an Instagram post, I'm looking to learn.\n\nI know that keeping panning to a minimum for broadcast television is part of that world. People listen on small devices, in mono, with one speaker, etc. if you want your music to translate on television, iPhones, people listening with one ear bud, etc., it makes sense to adjust how you mix a record. It sounds like sync people have similar needs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300838085738627122",
    "author": "Ross Fortune",
    "date": "2024-10-29",
    "content": "No, I’m nearly always just doing stereo overheads, rarely wider than over hi hat and edge of snare on one side and floor tom/ride on the other. Mono overhead wildcard maybe if I’m after a special effect. \n\nI’m keen to want to try this wide cymbal image business though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1303107418053541949",
    "author": "James Cronier",
    "date": "2024-11-04",
    "content": "I’ve encountered some rattling noise in a drum recording that came my way. EQ doesn’t grab it, RX spectral attenuate can’t do much. It’s a very narrow spectrum noise compared to the cymbals in the overheads etc. \n\nAny other tools I should be trying here?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1303150563004911677",
    "author": "Nomograph Mastering",
    "date": "2024-11-04",
    "content": "Essential too for narrow band issues",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310071256984326274",
    "author": "James Cronier",
    "date": "2024-11-23",
    "content": "Levels, panning, and touch mode automation are all there, distraction free.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312052801928433714",
    "author": "Deleted User",
    "date": "2024-11-29",
    "content": "Yeah analog audio is full bandwidth, no sampling rates there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312117987125362698",
    "author": "onanisland",
    "date": "2024-11-29",
    "content": "For real idk if it is but I had been using it on split bass on the low mids to get width and amped it with abletons softube amp, fast forward a few years later, its the same sound",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313979116701093940",
    "author": "Ross Fortune",
    "date": "2024-12-04",
    "content": "Maybe a way to describe it is that when I send something to it, my ear is interested - like “what’s that sound?” Rather than “there’s some reverb”, if that makes any sense.\n\nThe width control is useful for focusing the image. Going a bit narrower (or mono) is often cool.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1322234571789566073",
    "author": "vostral",
    "date": "2024-12-27",
    "content": "Any idea on the 3D sound of hardwares?? Have you guys ever tried to replicate that 3D/ depth ?? I think widener plugins tend to make the sound wider not deeper right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1322237970333306890",
    "author": "Jonathan Jetter",
    "date": "2024-12-27",
    "content": "I don’t know about that, at least not the way those posts are describing it. It’s worth thinking on a good starting point re: what *is* width and what *is* depth, and how do you know when you have enough of each.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1322270024064303135",
    "author": "Jonathan Jetter",
    "date": "2024-12-27",
    "content": "Yep, but I think what makes it tricky is, width also relies on contrast, and often the things that give you more width give you less depth, and vice versa.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1322284873976909935",
    "author": "Brian Reynolds",
    "date": "2024-12-27",
    "content": "I'm a fan of parallel panning. For \"width\" I'll use something like UAD Dytrontrics Cycosonic Panner with a preset subtle wide. Compress it to holy hell and blend it into taste.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1322367398761992272",
    "author": "NoahNeedleman",
    "date": "2024-12-27",
    "content": "wtf is parallel panning?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1323097030737924247",
    "author": "bobby k",
    "date": "2024-12-29",
    "content": "Ah gotcha I see what you’re saying now. A video demo would be wildly kind. I’m usually just static EQ boosting the clip where the tom hits in the overheads. Similar sort of automation getting drawn in for panning if wide fills are a good fit. But yea in an ideal world I would imagine the envelope of the toms would get tinkered with mostly in the recording stage so I bet this is useful for refining it if you needed to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1323271802646040688",
    "author": "Jonathan Arnold",
    "date": "2024-12-30",
    "content": "It does something to the imaging and I am not sure if I like it. I like the eq and weight for sure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1325908713818554488",
    "author": "Jonathan Jetter",
    "date": "2025-01-06",
    "content": "Think about the M/S distribution of a mono sound hard panned to one side. Then think about what it means for a sound to go \"wider\" than that, or what a sound that's 100% in the S would mean.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1325943810051801220",
    "author": "Jonathan Jetter",
    "date": "2025-01-06",
    "content": "Same way we all take it on faith that there's a difference between measured vs. perceived loudness, I think there's a difference between measured vs. perceived width. Hard for me to think of something that feels wider than two different sounds + parts panned hard opposite each other, and yet that'll still have a hefty amount of \"M\" content.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1326205485413830738",
    "author": "Jonathan Jetter",
    "date": "2025-01-07",
    "content": "It's different to the extent that it's no longer frequency-dependent. With a single mono sound panned somewhere, if the S is quieter than the M, raising the side = panning harder. Once the S is louder than the M, you're putting antiphase content into the opposing channel.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340702054041128960",
    "author": "Brian Reynolds",
    "date": "2025-02-16",
    "content": "Despite feeling I was one the Oregon Trail of parallel panning. Seems like Tchad Blake got there much earlier than I did haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340729050783551488",
    "author": "chrissorem",
    "date": "2025-02-16",
    "content": "What is parallel panning ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340839025765781596",
    "author": "Brian Reynolds",
    "date": "2025-02-16",
    "content": "It's just semantics. If you put a compressor on a send. It refered to as parallel compression. So when putting a panner on a send in. Calling it parallel panning made sense to my brain. With the fun alliteration to boot.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1345005662425317437",
    "author": "Jonathan Arnold",
    "date": "2025-02-28",
    "content": "LOWEND WIDTH: What's your favorite technique to give an electric bass (DI, only one source) width to not be so in the center, yet not loose mono compatibility?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1347250254659059773",
    "author": "James Cronier",
    "date": "2025-03-06",
    "content": "Yeah it's interesting how often its received well. usually if it does come up in the first round of notes it's a resounding \"no\". sometimes the increased width, low end, and transient impact aren't worth the 2dB of volume to people and that's for them to decide,",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1348732425383051378",
    "author": "spectrummasters",
    "date": "2025-03-10",
    "content": "And my goal this year is looking to articulate the song more deftly (I liked Jon Castellis description of creating vignettes in his mixes ) ….\n\nComing from club music / heavy bass music it’s kind of easy to have tough drums big subs and nice top end , and that’s about it but now I’m much more drawn to the low mid area I’d sort of just previously hidden from . I think it’s cians mixes that have really demonstrated to me the importance of really grasping the relationship between elements , transient , dynamic, depth panning  and harmonic  . Tying it all together in a beautiful (or ugly ) bow is the intent",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1349492828555710545",
    "author": "Nomograph Mastering",
    "date": "2025-03-12",
    "content": "Ground yourself in your commitment to serving the artist, *not* in whether the thing you made meets some narrow idea you may have about what it should be",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1351943793376755724",
    "author": "JustinLeu",
    "date": "2025-03-19",
    "content": "As others have said Valhalla room is fantastic…I feel like once you master Valhalla room you will fully understand what parameters do what on just about any verb plugin, it gives you just about all the parameters that are possible to edit. \n\nOne thing I have not seen mentioned that I get a LOT of mileage out of:\n\nTry putting a panning plugin BEFORE the stereo reverb (if using as an insert on a track) you can then “place” the instrument “in” the room. You can use a static pan position or if you feel inspired…give slight movement to it. I do this more frequently than an aux send to make stem printing more flexible.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352867726456262799",
    "author": "spectrummasters",
    "date": "2025-03-21",
    "content": "…obvs there’s a lot of options for stereo widening in mixing , but recently I’ve stumbled across a couple of engineers ( pretolesi, felipeti) mentioning that they narrow the mix above c. 12k to as narrow as 30% of the mid range . The principle being the shorter wavelengths at high frequencies become less than the distance between our ears , essentially creating a less accurate phantom stereo image ( ref: Blumlein) . I don’t do much stereo widening and prefer panning but hadn’t thought about narrowing the top end in this way before . It’s not something that I’ve heard much of previously . I’m gonna dive in this weekend and see what I can hear",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353006573672206376",
    "author": "Jonathan Jetter",
    "date": "2025-03-22",
    "content": "So, if it works it works, but I’m not sure the physics explanation holds up, at least not as mentioned. Because anything above ~2kHz will have a wavelength shorter than the distance between our ears, and we’re surely not narrowing there to that same extent for that same reason.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353039710309716058",
    "author": "spectrummasters",
    "date": "2025-03-22",
    "content": "Re the physics . Yes . 2khz will be the hz in theory this phenomena begins Effectively I expect they’re describing a trapezoid where by the time you’re at 12 kHz and above your top end info is only within the central third of your entire stereo image . \nIt’s been an interesting rabbit hole as I’m now reading about interaural crosstalk and precedence effects , It would now seem the odds of really perceiving this in real world situations will have so many variables as to be potentially banal anyway .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353208564520325203",
    "author": "getyoursnackon",
    "date": "2025-03-22",
    "content": "feels like you'd want artificially wider highs in headphones to emphasize space, and then the opposite on monitors",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353434210018529361",
    "author": "Abel Koshy",
    "date": "2025-03-23",
    "content": "This is probably a check with your ears question (I’m out of town and can’t try it but it’s keeping me up at night), but are all the bottom controls on brainworx plugins with the mono maker, stereo width, etc.. the same on all plugins that have them? Like the TOMO, amek, maag M/S.\n\nI know the top section is different and all!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355558856637288480",
    "author": "louisvie",
    "date": "2025-03-29",
    "content": "Hi all. I was wondering what are you guys' favorite tools to reduce a sound's width ? As in making a sound that has stereo baked in sound more mono, but not fully mono. Right now I'm looking to do it on an 808. Trying Live's Utility Width parameter, Bass Mono parameter and Ozone Imager. All souding ok, just curious what people use. Have a good weekend !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355560324140630128",
    "author": "JustinLeu",
    "date": "2025-03-29",
    "content": "Sometimes if I want quick creative use I use S1 and automate the width slider",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355561477440016556",
    "author": "Matt Huber",
    "date": "2025-03-29",
    "content": "Do you know- if you turn width down all the way on S1, is it “panning” the sides in, or turning the sides all the way down (muting the sides)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355562366938644580",
    "author": "Matt Huber",
    "date": "2025-03-29",
    "content": "Also wondering the same about Izotope imager & the various “width” knobs on BX plugins. I’m on a flight…may just whip out the old laptop and see what’s up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355563896575889638",
    "author": "louisvie",
    "date": "2025-03-29",
    "content": "Not sure if I'm over-thinking this. Different \"Width\" parameters on *stereoizer/width control* plugins mean different things. Wanna make sure there's a phase-proof way of doing this and that this Width Knob in Ableton's utility is actually doing the cleanest job possible. Since it can go from 0% to 400%, I wonder if the knob's *inner workings* change as you switch from the <100 range to >101 and above values. As in, clean panner knobs going inwards in the <100 range, and then switching to whatever's going on at 400%.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359323546366513153",
    "author": "Sei046",
    "date": "2025-04-08",
    "content": "It did wonders for my translation and imaging I have to say 🤷🤷",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359325566741905519",
    "author": "NoahNeedleman",
    "date": "2025-04-08",
    "content": "Depth in a mix is fairly simple, if you can hear it. You have a few basic tools and a few more complex ones, but overall it looks like this. \n\nBrighter+louder=closer\nDarker+quieter=further\n\nThis is also true for bottom end *mostly.*\n\nPanning also pushes things out of the center and allows you to play with a lot more area in which to push things back. \n\nIf you don’t have the luxury of panning, as with a snare drum, then you have volume & eq as your main tools. \n\nThen you have reverb. Shorter predelay, fewer short reflections & louder tails. Choosing a larger algo like a hall, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361997672411693156",
    "author": "vostral",
    "date": "2025-04-16",
    "content": "I cant boost, tried both narrow and wide Q for cutting. I even boost the lowmid up to even out the sound but it is just too muddy",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1363855986590355537",
    "author": "Josh Bowman",
    "date": "2025-04-21",
    "content": "Can u narrow it down to what’s causing the harshness and address it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1365399318584098957",
    "author": "Slow Hand",
    "date": "2025-04-25",
    "content": "Same goes for pan automation. I do a lot of verbs/delays right on the channel and using a plugin for my pan moves allows me to put my panning exactly where I want in the signal path (usually before the verb) and to easily disable it when needed.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1365399889575411926",
    "author": "connorboyle",
    "date": "2025-04-25",
    "content": "@Slow Hand that’s really smart! What plugin do you use for panning? Just the stock Ableton one?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366516997604638831",
    "author": "onanisland",
    "date": "2025-04-28",
    "content": "Generalizing here without context but usually a \"ballad piano\" to me is in the softer spectrum, so sometimes desicion making is > check stereo image to lock in perspective > use an eq or something that doesnt overally emphasise the 3-4khz range > sometimes a Vari-Mu can ride the piano really well and give the warmth - and don't overdo it, Cinematic Rooms or VSS4 reverb for a realistic-ish space placement.\n\nFor cutting more though the mix I second spectre for brightness, but I also like the harrison EQ, it has really musical curves to get it to cut through without sounding \"too much\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366637784634232983",
    "author": "Juliette",
    "date": "2025-04-28",
    "content": "I guess the thing that's been really bothering me lately is width? My early mixes/demos are very reflective of my inability to capture stereo width (a.k.a., just panning wherever and however I wanted to because it sounded cool). But now that I'm aware of it, it seems really convoluted. I'm not a fan of using stereo wideners because they end up splitting the signal and making everything sound weird. But I also don't know how to like, not make it sound like it's all been captured mono lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369263531593175072",
    "author": "Sei046",
    "date": "2025-05-06",
    "content": "Guys! Some advice please. Im mixing an album at the minute, acoustic middle of the road folky/country stuff. Recordings were done online by guys so the quality varies. I'm really struggling to get through the mixes, nothing seems to be sitting, it all seems flat, lifeless, both dark and bright and sizzly and dull all at once. Nothing is sitting down for me, I can't get depth, width, anything and all it's got to the stage i think where I have given myself a complex about. I start chasing references, cant see the wood for the trees and getting lost in detalis etc. Ive switched from focusing on getting a tone happening to just working really quickly, working on headphones, working on headphones with room sims, working in mono, band limiting myself to just the mids. Starting with the kick, starting with the vocal, starting all faders up, but I think I've just spooked myself now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1371120219472531526",
    "author": "Jonathan Jetter",
    "date": "2025-05-11",
    "content": "I don't do much of sending everything to the same couple verbs. It blurs the stereo field more than I like, and often there's a lot of specific reverb throughout the production already.\n\nMore like if a specific element feels too dry, I'll set it back a couple steps. If a certain track is panned pretty hard I've been enjoying mono verbs lately.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1375151384080416798",
    "author": "Iwan Morgan",
    "date": "2025-05-22",
    "content": "Could i ask the Gods here for some insight on how you would tackle an annoying issue?  I've been mixing a live recording recently with which I thought was causing clocking glitches due to the audio being 2496.  I've been trying to narrow down the cause and tried different drives, bypassing all plugins and until today when I dug further I discovered momentary glitches on the raw audio files recorded by the FOH.  They become a lot louder when bringing the mix up to commercial level.  There is no other recording so I'm wondering how you would approach this in RX.  It's across every track on the gig which is not ideal.  Some screenshots from RX.",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1377365680193802291",
    "author": "Sei046",
    "date": "2025-05-28",
    "content": "I pretty much never use notch filters. Any advantage over narrow q cuts?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377446264655839375",
    "author": "tim adamson 🇦🇺",
    "date": "2025-05-28",
    "content": "Check the notches out on sonic eq in MIO, I don't think a better/narrower bitches exists",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378106234435272734",
    "author": "Juliette",
    "date": "2025-05-30",
    "content": "I'm also trying to just make this vocal stack a bit wider-- it's panned nicely but there's too much coming in the 5k range that I can't seem to get rid of. I'm going to take a break though before I wind up going insane, haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1379301230962278441",
    "author": "Juliette",
    "date": "2025-06-02",
    "content": "When you guys are using FX on vocals (such as delay and reverb) how do you create space for that reverb to be heard in the mix? I've found that when I apply it, the reverb itself can get lost within everything else, even after panning and whatnot. Is it a matter of shifting the EQ on the vocals or shifting the EQ on the instrumentals? (Or it's nothing having to do with EQ at all, haha)\n\nA really swell example I like to use is Sabrina Carpenter's vocals on \"Don't Smile\". There's very huge, wide reverb going on within the vocal chain and it creates such a warm, dreamy soundscape. It almost sounds like the instrumentals were all pulled back, but the vocals were still glued in there very nicely.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382103534580924517",
    "author": "Bryan DiMaio",
    "date": "2025-06-10",
    "content": "maybe the dynamic squooshing (technical term) of the density knob is bringing the stereo width into more prominence?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382110457200115953",
    "author": "NoahNeedleman",
    "date": "2025-06-10",
    "content": "I’ve been known to use some mid side eq shenanigans in the middle between compression & limiting, but if I’m using Ozone or Precision-K to spread it’ll be right before the limiter.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382112497074573457",
    "author": "Jasper Boogaard",
    "date": "2025-06-10",
    "content": "What does it do for y’all versus panning? Is the selling point that you just widen higher frequencies?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382135231934632049",
    "author": "thegreatcarsoni",
    "date": "2025-06-10",
    "content": "I've used the widener on The Oven, which i think is the same \"wideness\" algorithm that's slapped onto all the bx plugins. But now I'm trying to build the width into the mix so i can choose what gets wide and what doesn't. Also shout out to the StageOne 2 plugin!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382150826503704627",
    "author": "onanisland",
    "date": "2025-06-10",
    "content": "I don't like using stereo imager tools on mixbus but if i have to stageone2 is my go to",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382155428053651496",
    "author": "joshbonanno",
    "date": "2025-06-10",
    "content": "i always try and widen early in the mix if possible where i know/feel i want something wider... but i'm also going to break the mold here and say a little width from an widener on the mixbus just sounds good to me and is a bit of the sound of modern records to me... not sure i'm smart enough to know or care about different algorithms or use cases, but sometimes i will use ozone imager to widen just certain bands (i widen just the low mids often, yikes, terrifying) or the bx3 width knob which is just always on my mixbus anyway... sometimes waves center to just turn down the center (eric valentine vibes) ... or honestly sometimes just a combo of a few. send me strigaht to jail.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382157350906888205",
    "author": "Jonathan Jetter",
    "date": "2025-06-10",
    "content": "same as @cian riordan , toward the end of the chain, but with a caveat: I generally only do it on productions where most/all of the tracks are already stereoized \"big mono.\" I don't love the effect of widening on productions where there's a constructed stereo image of mono tracks panned around to various places.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382521792400199782",
    "author": "chris_donlin",
    "date": "2025-06-11",
    "content": "Tbh I feel this every time I open a mix and am baffled. Like bounce a mix, import it into the session and it’s slightly wider/darker/fill in the blank. Like ever so slightly different. But I could be trippin",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385274346502881322",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-06-19",
    "content": "Also hearing whisper tracks swirling around the stereo field. Miley's voice is generally high in vocal chord closure/low on air in mid-high range from what I've heard (but she can sing airy too, especially lower in range). \n\n2:24 \"Close your eyes can't you see it\" has whisper dub, then on \"now\" it goes away and you can hear the non-layered vocal \"now\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385379922972901537",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "Well everybody - THANK YOU - Hella excited to go try a bunch of stuff now. Feel like I’m taking off training weights and allowing myself to see a wider range of what my setup is capable of",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396189891238563922",
    "author": "andrew_yv",
    "date": "2025-07-19",
    "content": "Panning for duet vocals that don’t have vocal BG’s… Yes? No? anything that you find works especially well?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397039892474757323",
    "author": "JustinLeu",
    "date": "2025-07-21",
    "content": "Have you tried ozone imager to narrow it back? Or S1?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397046745934074037",
    "author": "cian riordan",
    "date": "2025-07-21",
    "content": "hard to tell. I tried de-widening with S1 and some others, its helping on the phase correlation meter but still falls apart in mono. Turns out the stereo time adjuster in samples is helping the most.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399475355118604348",
    "author": "sarawls",
    "date": "2025-07-28",
    "content": "It's heavily bandpassed and has plosives like crazy and distorted - it gets lost in the mix as-is because the guitars are big and loud.  I'm panning them hard left and right to try and make room for the tiny frequency range of the vocal.  That Oh Sees vocal Edward posted sounds very hi-fi compared to this!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1401925528285478953",
    "author": "Chase H",
    "date": "2025-08-04",
    "content": "We had to tone back from big and epic haha. I’m going to take a step back from it till later today and approach again with a fresh set of ears. May just send 2 versions.\nOne without touching the instruments and another with lowered instruments to more closely match the exact references just to try and let him know it’s just to narrow down what he’s wanting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1403480767233003582",
    "author": "Ross Fortune",
    "date": "2025-08-08",
    "content": "I love TAL Reverb 2 for this as well, free and dirty but a total vibe - has a stereo width control built in",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1408225942677225603",
    "author": "Rob Domos",
    "date": "2025-08-21",
    "content": "I’d assumed it was the imaging cuz wider is wider",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1409218589923217470",
    "author": "hyanrarvey",
    "date": "2025-08-24",
    "content": "The correlation between records that I love and recordings that weren’t fun to make is wild lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410740776622751808",
    "author": "NoahNeedleman",
    "date": "2025-08-28",
    "content": "Why VOG in parallel? This smells like your parallel panning scheme which is just volume & phase.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417228972672024589",
    "author": "Sei046",
    "date": "2025-09-15",
    "content": "What are you guys doing, narrow selection and gaining down on the whistles?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417783061512458290",
    "author": "baccwardshead",
    "date": "2025-09-17",
    "content": "Little White Dove is so cool! I also searched and found Matt recommend Beyonce's Partition and that was a gem of a find for me (especially on low end and imaging)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1419756942057799680",
    "author": "baccwardshead",
    "date": "2025-09-22",
    "content": "Hey guys! I have a question, how do I reduce the overall width of a track? While mixing somehow the song became too wide and we printed the stems so there's no going back plus we don't even remember what we did that made it so wide 🙁 Any tips?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1419764624462450748",
    "author": "masteredbyjack",
    "date": "2025-09-22",
    "content": "Could try Ozone Imager with the width down too, see if it feels better or grabs the frequency ranges you'd like better",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1433863151887188120",
    "author": "kalpipal",
    "date": "2025-10-31",
    "content": "Definitely appreciate this take. Narrowing in on the tuning point, since it has irked me since my first listen, as I suspect it might any sane person lol. I had to wonder if that was a) production slop b) rush mix timeline slop or c) the Charli-xcx-ification of female pop vocalists? D) all of the above? Lily always sounds tuned but I think she’s a strong vocalist, and with the sincerity of this album the aggressive autotune felt misplaced to me. It’s the biggest thing to give me pause about the record. Would love to pin it all on the messy hasty nature of the album but it does feel like taking a trend way too far as well.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1449094166737850499",
    "author": "Rob Domos",
    "date": "2025-12-12",
    "content": "Generally speaking, if you did want to use spectral repair for short broadband things, decreasing the amount of bands to the minimum would help. The inverse is true for narrow resonance that play long. Maxing out the amount of bands would help then.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1455017311944839261",
    "author": "David Fuller",
    "date": "2025-12-28",
    "content": "Honestly one of the best courses I had in college had us start with just faders and panning",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456695665852940380",
    "author": "Will Trotman",
    "date": "2026-01-02",
    "content": "To what extent do yall stress mono compatibility? For example I’ve got a pretty mangled stereo guitar tone and if I collapse to mono, it definitely loses some weight. But if I check on my iPhone speakers it sounds fine. iPhone isn’t true mono but I feel like it’s about as mono as I ever listen?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457047307156459520",
    "author": "SawyerM",
    "date": "2026-01-03",
    "content": "I see it more as having a basis of reality for everything else to live in. My close mic snares and kick will often sound objectively nothing like they did in the room so I will ground those sounds with the overheads. Also +1 for LCR overheads, I find you get a larger than life sound from a wider capture",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1468308884371411135",
    "author": "Matt Huber",
    "date": "2026-02-03",
    "content": "I set up narrow filters to address a 1.5 K resonance issue… I popped them both into Delta mode\n\nHere is what Soothe was removing:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]