[
  {
    "id": "960423063843921940",
    "author": "cian riordan",
    "date": "2022-04-03",
    "content": "What a night! Thank you to the LWMR discord fam!... I so appreciate this community. This award really vindicates all my shit talking and dickheadery -- so excited to turn it up to eleven going forward. Love you guys ❤️",
    "reactions": 79,
    "categories": []
  },
  {
    "id": "1326654452534481028",
    "author": "Zach Hughes",
    "date": "2025-01-08",
    "content": "Update: I won the blind listen spec mix comparison and got the gig. I found out who the other mixer was today. They’ve been in the game a long time, have racked up a Grammy win and multiple noms, and I’ve been a fan of their work since college. Feels pretty good. Huge thanks to this discord. Really can’t say it enough. I have made greater strides in my engineering chops since joining here than at any other point in my career. 🙏🏼\n\nProducer told me that everyone wanted to go with the other person before blind listen because no one knew who I was and that my mix alleviated the insecurities about the production and felt like what the song wanted to be which might have been the sweetest.\n\nOn to mix two! 🫡",
    "reactions": 77,
    "categories": [
      "automation"
    ]
  },
  {
    "id": "1320684710975766559",
    "author": "Nomograph Mastering",
    "date": "2024-12-23",
    "content": "Ok, so that's a quick summary of the four main types of comp. My suggestion is to pick one model from each category. One and only one. Forget the rest for a while. Start trying it in various places to get a feel for what it does well and how you can use it to shape sounds, to serve the song. The actual plug you choose matters much less than the intrinsic characteristic of the category\n\nLast thought, 99% percent of what I see online in the form or tutorials etc re compression is nonsense, even from some very good friends of mine. Parallel compression for example can be wonderful, but using it as the only workflow on everything for *religious* reasons is just plain silly\n\nTake your time and spend a week with your chosen plug in from each category. Maybe ask here for examples of different styles in real records, Jimmy Pages' acoustic guitars for example. You'll get a sense for it over a little while\n\nOK, QC time over\n\nGood luck!\n\n\n@Slow Hand please feel free to edit this to tighten it up",
    "reactions": 62,
    "categories": [
      "compression_techniques",
      "mix_workflow"
    ]
  },
  {
    "id": "1455402972375679038",
    "author": "cian riordan",
    "date": "2025-12-29",
    "content": "Just finished mixing my 200th song this year... just... wild! I've had great years before, but this one felt like the true intersection of hard work, strategy, and full on luck. \n\nTen years ago I would have looked at this metric and scoffed — somebody 'phoning it in'... but I really did my best to give everything I had on each and every mix... maybe even to my own detriment. There are dear friends in my circle lapping me (Jon, Lars, etc) with their numbers but still,  this is a big milestone as a mixer. \n\nI’d be remised to not acknowledge the community here and the part it played in having filling the sails with information and inspiration. We all know it can turn for the worst next year, but for now… it’s good. And you guys and the conversations we had here all had a hand in it.\n\nCheers!",
    "reactions": 61,
    "categories": [
      "compression_techniques"
    ]
  },
  {
    "id": "1279483165852831876",
    "author": "youngteam",
    "date": "2024-08-31",
    "content": "hey gang, the first record I \"professionally\" mixed just got a song on new music friday. I'm not naive enough to think this is because of my work but it's nice to see the artist getting some recognition I think she deserves. this community is rad and I've learned a lot here through lurking, sending demos in collabtalk and being around great spirits.\n\ntldr; thanks!",
    "reactions": 57,
    "categories": []
  },
  {
    "id": "928462019835854879",
    "author": "oaklandmatt",
    "date": "2022-01-05",
    "content": "@everyone I also just want to make it clear that it's AWESOME you guys are helping each other out. Part of what makes this community so unique is that people are sharing and participating and not just asking for things. We're here to give and help first, receive second. I definitely don't want to discourage people from seeking help, but I think the best way to do that is to OFFER help, and then sort it out in the DMs. We're doing a great job of keeping it helpful without spamming, so let's keep it that way. I trust all of you to helpfully self-regulate. I love y'all ❤️",
    "reactions": 55,
    "categories": [
      "eq_techniques"
    ]
  },
  {
    "id": "1286815359772528682",
    "author": "cian riordan",
    "date": "2024-09-20",
    "content": "* First of all, I’d say don’t panic. Everyone in our line of work experiences this at one point or another. I’m lucky to have a great network of successful record makers here in LA and everyone has stressed about this at one time or another. It’s just part of the game.\n* People can disagree with me here, but I would personally avoid the urge to tell your clients/IG followers/the general public that your schedule is free. Like Ryan said, it’s not a good look and devalues your brand. Not to mention if you’re not one of the people constantly spamming your warez on social media, and all of sudden you are, it might come off strange.\n* Realize that that tides can turn any minute. The phone *will* ring. And when it does, it’s sometimes a plus to have a free schedule and to say something like “just had a project get pushed out so I can actually start on this sooner rather than later”, etc.\n* It’s also a great opportunity to dive into busywork/maintenance around the studio. Patchbay reworking, gear repair, workflow improvements, computer upgrades. Not to mention keeping up your online appearances… new website, updating discography, etc.\n* Start hanging out with people. Don’t stay home and bite your nails. You know people making records in your area — ask em out for coffee/dinner/drinks. Being social eases the anxiety and also reminds people you’re out there in the world, excited to make records.\n\nHang tough, it’ll pass.",
    "reactions": 53,
    "categories": [
      "mix_workflow"
    ]
  },
  {
    "id": "906628154234392658",
    "author": "oaklandmatt",
    "date": "2021-11-06",
    "content": "Just to be extra clear about this point, because i think it's really important: almost everyone on the internet who is giving advice about making records is trying to build their brand. That means they have to produce content. The more content the better, because you need to feed the algorithm and compete with everyone else producing content.\n\nThe problem for people learning how to make records is that no one tells you that 90%+ of learning is simply doing. All the tips and tricks are nice and interesting and sometimes inspiring, but until you're at a high level, you should just be making a shit ton of records.\n\nIt's not a good way to build your brand to just say: get off your phone and go make records.\n\nBut that is how all of the best people become the best.",
    "reactions": 49,
    "categories": []
  },
  {
    "id": "1223410458195918939",
    "author": "cian riordan",
    "date": "2024-03-29",
    "content": "When the album comes out, if people care, I can do a little bit more of a detailed breakdown on some stuff.",
    "reactions": 46,
    "categories": []
  },
  {
    "id": "1235628818366988320",
    "author": "nachomaquieira",
    "date": "2024-05-02",
    "content": "Hey everyone! I'll try to keep it short, but I just wanted to share something that happened to me yesterday. I crafted one of the best mixes of my life  in just a couple of hours. After finishing it and sending it off, I took a moment to reflect on why it turned out so well. (Regardless of the fact that it's a great song, excellently recorded and produced, with a very talented artist).\n\nA big part of it, I realized, is because I'm in such a great place personally right now. I recently moved to a small mountain town with my girlfriend for an indefinite stay, and just last week, we found out we're expecting our first child. The sheer joy and connection to my surroundings are absolutely crucial obviously.\n\nBut this message is to give a huge shoutout to this LWMR Discord. Everything I'm learning here about mixing, mastering, different approaches to work, active listening, where to focus, etc— it's all contributed immensely. I want to thank each and every one of you who's shared even the tiniest piece of advice or insight. This place is a treasure of great info, and it's genuinely helping me grow, not just professionally but personally too. I truly feel it's making a profoundly positive impact on my work!",
    "reactions": 44,
    "categories": [
      "mix_workflow"
    ]
  },
  {
    "id": "1235601590388527125",
    "author": "chrissorem",
    "date": "2024-05-02",
    "content": "Shawn likes to paint himself into corners that most people would jump ship. I’ve seen him work himself out of them and come up with the great and unusual results. He’s extremely clever and has a natural punk rock approach to things. I’ve watched him mix numerous times and left thinking I could never make anything sound good in that room or with that approach but he’s managed to figure it out. It’s not always fast or easy but it’s always unique whether you like it or not. He’s been a huge inspiration to me and a constant reminder that we are making art not products.  I’d like to see more engineers following their own instincts and spending less time looking at what everyone else is doing.",
    "reactions": 43,
    "categories": [
      "compression_techniques",
      "reverb_delay",
      "monitoring_listening",
      "mix_workflow"
    ]
  },
  {
    "id": "1209991823897002074",
    "author": "Nomograph Mastering",
    "date": "2024-02-21",
    "content": "Anyone who has experience with something like Plug in Alliance Paul Frindle’s DSM will know that it’s excellent at high mid and high frequency manipulation but at 16 bands has almost no low end resolution\n\nSoothe has (according to a post from the developer) 4096 bins in Normal Resolution Mode. This accounts for it’s (to me) generally very blurry sound, but that can be very useful in certain contexts and if used with care in the higher octaves can be a very worthwhile tradeoff\n\nK, won’t be around for follow up questions today but tag me and I’ll reply tomorrow",
    "reactions": 42,
    "categories": [
      "eq_techniques",
      "bass_mixing",
      "low_end_management"
    ]
  },
  {
    "id": "1174170296723460156",
    "author": "philbarnes",
    "date": "2023-11-14",
    "content": "Whenever I recommend this discord to someone, it's followed up with the comment that you're interacting with people who are actually making records. Not YouTube producers. Not \"download my e-book\" guys. This space is a rare resource and a gift in the world we work in, and it's not always going to confirm your opinion. I don't post every day because I don't always have something to say or to add value, but I do gain a beautiful new perspective on a subject from reading through here at least a few times a week that I wouldn't have had the thought of without this space.\n\nIf you're gonna go after this job for real, you're gonna have the craziest shit thrown at you from clients, collaborators, peers and heroes that you've ever heard. \n\nYour feelings will not be protected when you operate in this industry at a professional level. \n\nSo, learning to take it on the chin and ask \"what is there to learn here?\" in a moment you're challenged is what will make you grow and be resilient. \n\nI just re-printed a stem an hour ago for a background vocal I fucked up \"fixing\" the timing of in the chorus. The client was incredibly direct and insensitive of my feelings about it, and if I hit them back to argue what was \"technically correct\" based on the grid and subdivisions I was looking at, and why I was right, they wouldn't care. They wanted it different, so I saw it through their lens of how they wrote the part and corrected it to deliver for the artist. And you know what? That result was better than my feeling of what was \"technically correct.\" They were right. A beautiful reminder to serve the song rather than to check the box. \n\nThe older I get the more I equally trust my taste and remain open to learning something based on new information. Adopting that mindset will only serve you in the process of experimentation of self and collaboration with others.",
    "reactions": 40,
    "categories": [
      "compression_techniques",
      "vocal_mixing",
      "low_end_management"
    ]
  },
  {
    "id": "1306399828137476189",
    "author": "cian riordan",
    "date": "2024-11-13",
    "content": "Australians really give the best mix notes:",
    "reactions": 39,
    "categories": []
  },
  {
    "id": "1344737541911347332",
    "author": "Iwan Morgan",
    "date": "2025-02-27",
    "content": "All it took was changing my Pro Tools metering",
    "reactions": 36,
    "categories": [
      "gain_staging_levels"
    ]
  },
  {
    "id": "1174188978509987971",
    "author": "cian riordan",
    "date": "2023-11-14",
    "content": "I appreciate these sentiments. Some of us here have spent a good deal of time and invested a lot of knowledge into this community; it's a good feeling to know that the majority opinion is one that aligns with the spirit of @oaklandmatt's original foray into live-streaming with Jon. A lot of our work happens in the shadows and often goes unappreciated, but I sleep better at night knowing you guys are also out there -- in the weeds -- trying to set higher standards for both the creation and the consumption of music across the genres. Not everyone will get it and I think that's OK. We should do our best to be kind and welcoming to people walking into a now, 2+ year-old water-cooler chat, but we shouldn't also lower the bar that we've set for ourselves as record-makers (and thinkers). This place really is special, here's to many more years of community.",
    "reactions": 35,
    "categories": [
      "genre_specific"
    ]
  },
  {
    "id": "1339361161463726162",
    "author": "laurasays_",
    "date": "2025-02-12",
    "content": "Santi also has some of the best ears in the biz.. so the two of them together was wild. But yeah he will mix in whatever DAW the artist worked in no matter how difficult that is. He said to force them into a different DAW during the mixing process would be like taking away their instrument. Absolute legend/icon/forever inspired and inspiring",
    "reactions": 35,
    "categories": []
  },
  {
    "id": "1420953511981486090",
    "author": "cian riordan",
    "date": "2025-09-25",
    "content": "Just a PSA that IM ANNOUNCING TARIFFS ON SESSIONS DELIVERED TO MIX WITH SUPPLEMENTAL DRUM SAMPLES THAT DONT LINE UP WITH THE SOURCE DRUMS THAT IS ALL THANK YOU FOR YOUR ATTENTION TO THIS MATTER.",
    "reactions": 35,
    "categories": []
  },
  {
    "id": "1006723829277675681",
    "author": "Slow Hand",
    "date": "2022-08-09",
    "content": "Man. I am loving the De-emphasis section on Tupe. It lets you squeeze so much saturation out of a signal without driving things too hard. \n\nFirst, you drive your signal to the point where the loudest part starts to break up, then you use the de-emphasis to subtract that frequency from the saturation circuit and then you push the gain up even harder until you're on the edge of breakup again. Wash, rinse, repeat. \n\nWhat you end up with is a signal that's evenly saturated across the entire frequency range instead of only having the loudest parts treated, because they're all hitting the saturation at roughly the same level. This thing is amazing. It's the sound that I've been searching for for soooo long.",
    "reactions": 34,
    "categories": [
      "compression_techniques",
      "eq_techniques",
      "saturation_distortion",
      "low_end_management"
    ]
  },
  {
    "id": "1320771460440260739",
    "author": "oaklandmatt",
    "date": "2024-12-23",
    "content": "@Slow Hand might need a \"Ruairí's guide to compression\" article on the site. Holy moly that was great @Nomograph Mastering",
    "reactions": 34,
    "categories": [
      "compression_techniques"
    ]
  },
  {
    "id": "1344736346006224936",
    "author": "Iwan Morgan",
    "date": "2025-02-27",
    "content": "Feeling pretty good today, I spent yesterday morning pulling a part a mix for an artist who said last week they \"really didn't like the mix, not sure we're on the same page - feels very far from what I asked for\" .  At the time I felt the initial dejection, slight anger and was taken aback by the bluntness but I then stepped back, internalised the great lessons of the discord and tried to listen and understand their vision even more.  Anyway, turns out they love the new mix and this has made the relationship so much better. I never share this kind of thing, but I feel like it's time to adjust habits a bit.",
    "reactions": 34,
    "categories": []
  },
  {
    "id": "989003886956265492",
    "author": "Rollmottle",
    "date": "2022-06-21",
    "content": "I exclusively mix in LCR. Makes you really work for it.",
    "reactions": 33,
    "categories": []
  },
  {
    "id": "1320789661987373097",
    "author": "chrissorem",
    "date": "2024-12-23",
    "content": "I’ll add one thing to this conversation. Some of my favorite mixers and producers are not the most technically knowledgeable people. They don’t necessarily understand what’s going on under the hood. They do certainly know when something is working or not. I’m not knocking understanding how all the tools we use work but rather  I’m saying it not essential to making great art.  There is an interesting trend here and in audio education in general of what are the do’s and don’t’s are. Example: only process groups and less mix  buss. Multi bands are a no go. Soothe 2 sucks.  Yes everything has a trade off and might not be the right tool but some of my favorite mixes have used these tools and some haven’t.  My two cents are to try things out and find out for yourself what works for you, what’s working for that particular song. If you are really Struggling to make something work it might be worth asking around why, and you might find a technical explanation of why, but It also might be more educational to experiment then dialoging about why you should or shouldn’t do something. Sincerely the contrarian.",
    "reactions": 33,
    "categories": []
  },
  {
    "id": "1394475926695313430",
    "author": "cian riordan",
    "date": "2025-07-14",
    "content": "Winning mix note from a client that gets it. Great way to end the day.\n\n“Be more bold with how this swells like a heart ready to burst. Imbalance is ok sometimes.”",
    "reactions": 32,
    "categories": []
  },
  {
    "id": "1455576788095864906",
    "author": "Val ᶠʳ",
    "date": "2025-12-30",
    "content": "Just finished version 200 of the only song I've mixed this year.  I've had great years before, but this one felt like the true intersection of hard work, strategy, and full on luck.",
    "reactions": 32,
    "categories": []
  },
  {
    "id": "1124732370352885791",
    "author": "Deleted User",
    "date": "2023-07-01",
    "content": "Got no notes and tears of joy from the artist at V1 today 🤙🤙🍷",
    "reactions": 31,
    "categories": []
  },
  {
    "id": "1186344927907545238",
    "author": "masteredbyjack",
    "date": "2023-12-18",
    "content": "Okay crew! Little vid on how I’ve been using RX, mostly in regards to vocals in masters:\n\nA bit long winded but it covers all the main points for what I’ve had it be useful for:\n\nHopefully the vid isn’t too grainy — looks great on my phone but dropbox can be pretty bad sometimes. I think if you download the video it will play in full quality (if you want to see the screen clearer)\n\nHopefully others @Rob Domos @Nomograph Mastering @Adam Thein etc who use it can chime in if they do differently\n\nhttps://www.dropbox.com/scl/fi/qc26x919iqtmqhz72i1dc/JACK-RX-WORKFLOW.mov?rlkey=o67bhvpa23jet8qwa56pyeisr&dl=0",
    "reactions": 31,
    "categories": [
      "vocal_mixing",
      "mix_workflow"
    ]
  },
  {
    "id": "1399585902581387364",
    "author": "cian riordan",
    "date": "2025-07-28",
    "content": "Always here for a strong, non-subtle nudge.",
    "reactions": 31,
    "categories": [
      "low_end_management"
    ]
  },
  {
    "id": "1290502747832975461",
    "author": "NoahNeedleman",
    "date": "2024-09-30",
    "content": "I feel like EV is the grandfather of this discord. Like Matt is the mother of course, Castelli the absentee father whose approval we all crave and will never get, Cian & Beckley & Rauirí the favorite (weird) uncles… but it really seems like this place isn’t this place without EV being EV.",
    "reactions": 30,
    "categories": []
  },
  {
    "id": "1174773365899276419",
    "author": "Rollmottle",
    "date": "2023-11-16",
    "content": "I went to art school and its entire foundation was built on the process of critique. You learn to tear the work down as a means to burnish and gird the ideas. I learned very early to not get so emotionally attached to my work because there was very often ample headroom to keep pushing the ideas further and ultimately get the work to a more realized and better state. It has been my experience having worked in a creative field beyond music and painting for over 25 years, that the people who are most successful, welcome and embrace critique and don’t get sent down an unproductive path when their ideas are challenged. It can be very difficult to hear that what you thought was a good idea, might not actually be. As creative folk, we have to find ways to separate how our sensitive nature absolutely helps us and at times, gets in our way. We needn’t be so precious about things, especially if holding on holds us back. \n\nI’ve found being very direct without beating around the bush is a way more effective means of communicating and leads to better places more quickly. It is a skill to learn to operate alongside people who won ’t sugarcoat their feedback in pursuit of better outcomes. The earlier one can learn how to thrive within that framework, I think the better off you will be.",
    "reactions": 29,
    "categories": [
      "gain_staging_levels"
    ]
  },
  {
    "id": "1223410644129157170",
    "author": "Nomograph Mastering",
    "date": "2024-03-29",
    "content": "Can we do a full Micks with the Masters episode where we breakdown mastering too?",
    "reactions": 29,
    "categories": []
  },
  {
    "id": "1320848076075962440",
    "author": "BatMeckley",
    "date": "2024-12-23",
    "content": "I’ve heard your stuff, It’s not the bottleneck. We all struggle with every part of the process constantly. \n\nYou have the capability to do the thing that will take your life in music about ten steps forward but you’re stuck reading about different types of compression. Your work is good. Let it be good. I PROMISE YOU you will learn FAR more by releasing your first track, and get so much better, than you will handling it like you are now.",
    "reactions": 29,
    "categories": [
      "compression_techniques"
    ]
  },
  {
    "id": "1334338690448752774",
    "author": "cian riordan",
    "date": "2025-01-29",
    "content": "hold on, lemme figure out which one we used. back soon.",
    "reactions": 29,
    "categories": []
  },
  {
    "id": "1230257231388475473",
    "author": "Matt Huber",
    "date": "2024-04-17",
    "content": "My internal dialog:\n\nHere’s your mix. So sorry. It probably sucks. I wonder if I should quit, also maybe my speakers are broken and I might need to add some more bass traps and if you don’t like it that’s okay, you don’t have to pay me. Sorry for existing!",
    "reactions": 28,
    "categories": [
      "low_end_management"
    ]
  },
  {
    "id": "1369093107546849331",
    "author": "Will Melones",
    "date": "2025-05-05",
    "content": "Yup, I agree with the 0-100% rate range. Wouldn't go much higher or lower than that",
    "reactions": 28,
    "categories": []
  },
  {
    "id": "1038555618828636160",
    "author": "Nomograph Mastering",
    "date": "2022-11-05",
    "content": "In old mix world the concept was build the perfect mix, then push one fader up by 6dB. The A&R would come in and be like “sounds amazing but I think we could use less tambourine”, fader returns to original position, A&R’s need to give input is satisfied with no blood spilled",
    "reactions": 27,
    "categories": []
  },
  {
    "id": "1146206710063702176",
    "author": "cian riordan",
    "date": "2023-08-29",
    "content": "Prefacing this unsolicited tip with 'always use your ears, not your eyes, yadda yadda' -- but a few months ago I set my Pro-Q3 default to have the Lead Vocal bus in my template as the external spectrum on the display and BOY does help with mixing dense arrangements. Wish I would have done this years ago.",
    "reactions": 27,
    "categories": [
      "eq_techniques",
      "vocal_mixing",
      "mix_workflow"
    ]
  },
  {
    "id": "1185956301197557800",
    "author": "oaklandmatt",
    "date": "2023-12-17",
    "content": "imho, a lot of the vocals I'm hearing from younger record makers are sounding heavily  processed in the same way. \"Lack of dynamics\" doesn't really explain it because people think of dynamics as dynamic range compression. It's more that everyone is chopping, clip gaining, and RXing to an evenness that softens and linearizes performances. \n\nThese tools work beautifully when shitty mic technique makes things boomy, or there's a few weird ss's on the pre-hyped TLM mic through the focusrite pre.\n\nBut it sounds like most people who learn the tools are overusing them like crazy. \n\nI'm trying these days to get off the details and try as much macro-mixing as possible. When I let performances breathe in their imperfections, I find that I'm drawn in more as a listener.\n\n\"Music is the space between the notes\". \n-Claude Debussy\n\n\"Music is the space between RX moves.\" \n-Ruairí (probably)",
    "reactions": 27,
    "categories": [
      "compression_techniques",
      "vocal_mixing",
      "gain_staging_levels",
      "automation",
      "low_end_management"
    ]
  },
  {
    "id": "1220133403001618574",
    "author": "cian riordan",
    "date": "2024-03-20",
    "content": "They want the mix session with plugins. Then another file with a list of all the plugins used. Then a folder with all the consolidated multitracks. Then a folder with the stems. Then a folder with all the mixes and alts. Then they pay someone to comb through everything and find errors so they don't have to pay you.",
    "reactions": 27,
    "categories": [
      "plugin_discussion"
    ]
  },
  {
    "id": "1236698435584000040",
    "author": "Iwan Morgan",
    "date": "2024-05-05",
    "content": "Just had a humbling moment this morning. A client was on BBC 6 Music and the host started talking about the mixing I did, saying that I always manage to find the emotional resonance of a song. It’s out of my comfort zone flexing about this in social media but this really got to me.",
    "reactions": 27,
    "categories": [
      "eq_techniques"
    ]
  },
  {
    "id": "1275492475292618843",
    "author": "chrissorem",
    "date": "2024-08-20",
    "content": "Since we are on the topic. I got email from michael brauer last week asking about what plugin setting I’m using for verb.  I had to drop the sad news that it’s a special real plate. I do love vahalla but give me a space echo a chamber and a plate reverb and that’s all I need",
    "reactions": 27,
    "categories": [
      "reverb_delay",
      "plugin_discussion"
    ]
  },
  {
    "id": "1275496678417498213",
    "author": "cian riordan",
    "date": "2024-08-20",
    "content": "\"its actually an elaborate setup of 4 multitrack reverb busses with cascading effects that I send to from the auxes on my SSL. I call it the Sorem-ize method of adding dimension to mixes...\"",
    "reactions": 27,
    "categories": [
      "reverb_delay"
    ]
  },
  {
    "id": "1294076317100412948",
    "author": "Spencer Broschard",
    "date": "2024-10-10",
    "content": "Just got a call from the producer on a project I’m mixing to tell me that the band is happier with my work than they’ve ever been with any other mixers. And to think just earlier today I was telling myself how shit I was at this lol. I needed that 🤘🤘",
    "reactions": 27,
    "categories": []
  },
  {
    "id": "1382376554642018325",
    "author": "BatMeckley",
    "date": "2025-06-11",
    "content": "Please finish a song.",
    "reactions": 27,
    "categories": []
  },
  {
    "id": "1418103053923647499",
    "author": "montrose recording",
    "date": "2025-09-17",
    "content": "had a novel win a couple weeks ago.  the rare entire album v1 approval lol.  yay",
    "reactions": 27,
    "categories": []
  },
  {
    "id": "1470927659310649475",
    "author": "Felix Byrne",
    "date": "2026-02-10",
    "content": "‘mixing’ is not a process of precision and repetition and technical perfection\n\nit’s an act of servitude and love",
    "reactions": 27,
    "categories": []
  },
  {
    "id": "960321370779156500",
    "author": "frankieharper",
    "date": "2022-04-03",
    "content": "YES @cian riordan  alternative music album!! 🎉 Congratulations bro! My fave sounding album in ages as I’ve mentioned before 🙏",
    "reactions": 26,
    "categories": []
  },
  {
    "id": "960323228667084811",
    "author": "Zack Hames",
    "date": "2022-04-03",
    "content": "@cian riordan too bad you have to change your website. Congrats dude!",
    "reactions": 26,
    "categories": []
  },
  {
    "id": "1183119776399233105",
    "author": "aidanthillmann",
    "date": "2023-12-09",
    "content": "Coming up now as a mix assistant to a few mixers of different approaches/styles, I think above all else these days you have to be versatile. I think all mixers inherently have a taste and vibe that they employ in their mixes even if they don’t realize it, and they get hired because of it, but you have to be able to combine your taste with being being that “finisher” when the song calls for it. Learn when to just push a great rough mix to the finish line and leave the good things alone, but when you’re given dryer tracks be able to mix with a heavier hand and not overdo it (or underdo it)\n\nBut I’ve also learned that the mixers these days who can “finish” really really well, who can take a 95% awesome rough mix and push it the extra 5% are the great mixers of the modern day, to me at least. That 5% is so much harder than people realize it is, and that’s what I’m trying to learn and study how to do more than anything as a mixer. It can seem like mixers who are given great productions have it easy and just do a couple things and call it good, but it can be so tough to know how to improve an already great mix.",
    "reactions": 26,
    "categories": [
      "mix_workflow"
    ]
  },
  {
    "id": "1349558969760223322",
    "author": "NoahNeedleman",
    "date": "2025-03-12",
    "content": "My hot take is we shouldn’t be letting the Mastering Engineers come in here and boss us around like they own the joint. This is *our* thread, and we don’t have to take it anymore. 🫣",
    "reactions": 26,
    "categories": []
  },
  {
    "id": "953442486171361290",
    "author": "cian riordan",
    "date": "2022-03-15",
    "content": "Damn, have any of you guys tried this? Huge if true",
    "reactions": 25,
    "categories": []
  },
  {
    "id": "956774126104748032",
    "author": "cian riordan",
    "date": "2022-03-24",
    "content": "Have you ever sent a client a response like this?",
    "reactions": 25,
    "categories": []
  },
  {
    "id": "994805980917407764",
    "author": "Jeremy Klein",
    "date": "2022-07-07",
    "content": "This will record them into melodyne without having to wait around for playback",
    "reactions": 25,
    "categories": [
      "vocal_mixing"
    ]
  },
  {
    "id": "1208971298831597608",
    "author": "Nomograph Mastering",
    "date": "2024-02-18",
    "content": "Last thought for today. RX is powerful and in the hands of someone fearful it can be an endless rabbit hole\n\nYou can’t “remove problems” your way to greatness. I RX things that distract me, and that inhibit connection. What I don’t do is make everything shiny and perfect. I hit the undo shortcut *a lot*",
    "reactions": 25,
    "categories": []
  },
  {
    "id": "1277730419508252713",
    "author": "chrissorem",
    "date": "2024-08-26",
    "content": "After a good nights rest, I realized if I’m going to talk a bit of shit I better add something positive.  So I had something interesting happen on a new record I’m mixing. The artist and I met and listened to some of the tunes and we chatted about sonic direction. Upon my first listen I had some specific ideas of where to go with the mixes, in particular with the vocal sounds.  On the first day of mixing I still felt the same way about notes I had made. After about a couple hours of mixing I found myself taking a left turn from the original direction I had in mind and I stopped and chatted with the artist and I felt the music was taking me elsewhere and was surprised where we ended up.  Luckily the artist was chill and also felt the same way and we were psyched where we ended up.  This was a reminder to myself that the music usually tells you what works and what doesn’t and just because you have an idea doesn’t mean that’s what the track wants. This is what I do love about in person mixing, we all have ideas and you don’t know if they are any good until you try them.",
    "reactions": 25,
    "categories": [
      "vocal_mixing"
    ]
  },
  {
    "id": "1014473138580500490",
    "author": "BatMeckley",
    "date": "2022-08-31",
    "content": "The only thing better than DRT is any mix that Matt Beckley does. I worry that even with my Grammy I’ll never be able to escape the shadow cast by his sheer brilliance and artistic wizardry.",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1050509042386206760",
    "author": "Nomograph Mastering",
    "date": "2022-12-08",
    "content": "Also, I’m new in town but technically a mod. So I suggest chilling with the sales pitch. I get that everything is fire all the time forever. But if that hyperbole about  posters own products becomes the norm here then we are in trouble.",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1206685932296732762",
    "author": "Adam Thein",
    "date": "2024-02-12",
    "content": "pain - 2.8k\nsuffering - 3.4k\nagony 4k\nmisery 7k\nglass in my third eye 13k",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1292938134073639044",
    "author": "cian riordan",
    "date": "2024-10-07",
    "content": "I love when people call with a crazy rush turnaround time for a mix, you make it happen, and then it takes days and days for them to get back to you with any feedback.",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1314482478261735444",
    "author": "Oli J",
    "date": "2024-12-05",
    "content": "I’d say it’s a combination of things. Arrangement, balance and eq are two most obvious. I’m often looking for bright but not harsh. Other tools worth checking out are soothe, pro-mb (multi band compression to tame those highs) and I sometimes find tape simulation or drive can help. Saturn 2 is a great tool for this too. Feel free to send me a mix where you’re at and I can try and shed some light on a couple of things that might help.",
    "reactions": 24,
    "categories": [
      "compression_techniques",
      "eq_techniques",
      "saturation_distortion"
    ]
  },
  {
    "id": "1332084982289535066",
    "author": "cian riordan",
    "date": "2025-01-23",
    "content": "Houston in Texas, the great state. \n\nIf I wanted to be stupid and irresponsible with my money, I’d be a recording engineer.",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1405343292215787520",
    "author": "cian riordan",
    "date": "2025-08-13",
    "content": "Toms are like the kids in the back of the station wagon, they're going where everyone else is going.",
    "reactions": 24,
    "categories": [
      "drum_mixing"
    ]
  },
  {
    "id": "1444821008170094652",
    "author": "chrissorem",
    "date": "2025-11-30",
    "content": "Mix notes of the week.  I only did the ones I could read",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1076664962900050002",
    "author": "philbarnes",
    "date": "2023-02-18",
    "content": "If you get too into the weeds with a shit-ton of plugins, don't be afraid to start it over with just a single EQ and compressor. I surprise myself with how often a break and reset gets me to a better vocal mix in a fraction of the moves.",
    "reactions": 23,
    "categories": [
      "compression_techniques",
      "eq_techniques",
      "vocal_mixing",
      "plugin_discussion"
    ]
  },
  {
    "id": "1077401812241485954",
    "author": "thejadenmejia",
    "date": "2023-02-20",
    "content": "Just wanted to say thank you to everyone who gave their input on fixing the harshness of the record i was working on. I gave it my best shot. Unfortunately, I ended up losing the mix, but i learned a lot from it. I Love this community and im glad to be apart of it. Now I’m gonna go eat some ice cream and binge a show. 🕺",
    "reactions": 23,
    "categories": []
  },
  {
    "id": "1173662103547150377",
    "author": "NoahNeedleman",
    "date": "2023-11-13",
    "content": "I know you asked a simple question, “would this work?” And you’ve got a gang of people NOT answering that question. It can be annoying but it’s a little bit of the ethos of this discord- we’re usually more interested in root causes and philosophical solutions than specific processes. It may feel like you’re being attacked by these questions, but it’s just our collective way of approaching shit. Always with the goal of being helpful.",
    "reactions": 23,
    "categories": [
      "eq_techniques",
      "mix_workflow"
    ]
  },
  {
    "id": "1184397405278445618",
    "author": "Nomograph Mastering",
    "date": "2023-12-12",
    "content": "**\" Don’t get so caught up in minimizing imperfections that you forget to maximize the magic bits\"**",
    "reactions": 23,
    "categories": []
  },
  {
    "id": "1398497308093448273",
    "author": "cian riordan",
    "date": "2025-07-25",
    "content": "Something to chew on: bass instruments, kick drums, et all — they’re not defined by the low end, they’re defined by the midrange and high end. They’re just supported by the low end.",
    "reactions": 23,
    "categories": [
      "drum_mixing",
      "bass_mixing",
      "low_end_management"
    ]
  },
  {
    "id": "978347282518917120",
    "author": "cian riordan",
    "date": "2022-05-23",
    "content": "The pretentiousness of this product and its marketing make me want to go crawl into a hole and die. *The God Particle*... really?",
    "reactions": 22,
    "categories": []
  },
  {
    "id": "1043423467036479508",
    "author": "cian riordan",
    "date": "2022-11-18",
    "content": "I like getting something lofi to reproduce the guitar tone in a hi fi space. So send your guitar track out to a tiny, band passed amp (like the cigarette box amps) and mic with something that equally captures the lofi-ness of the source but the dimension of the space. It makes the meat of the guitar sound very contained but gives you some nice high end air to make it sound expensive.",
    "reactions": 22,
    "categories": []
  },
  {
    "id": "1080119137935839274",
    "author": "philbarnes",
    "date": "2023-02-28",
    "content": "The happier I've been with my career are the moments I let go of the things I can't control. We can all give our best advice to an artist, but if they don't take it and have a poor result because of it, hopefully we've handled our suggestions with enough grace that the next time, they'll feel like they can ask: \"who was that guy/gal you recommended again? I'd love to try them this time.\" \n\nIf you're responsible for choosing the producer, ME, distro, etc. then it's on you to get that right. If it's not, then it's not. \n\nYou're allowed to be proud of your work (the thing you can control) and disappointed with the outcome (the thing you cannot control), but don't let that discourage you from trying your best on the next thing in front of you. It does matter, and in a long-term relationship, the level of trust you are given from clients will grow exponentially. \n\nBuild your corner of earth with dope-ass homies that do great work, sing their praises to your clients, and when they choose to hire them, be stoked.",
    "reactions": 22,
    "categories": []
  },
  {
    "id": "1174040042537230356",
    "author": "spectrummasters",
    "date": "2023-11-14",
    "content": "Yeah bro bro the peeps here giving you pointers are the real deal",
    "reactions": 22,
    "categories": []
  },
  {
    "id": "1174256834064953476",
    "author": "BatMeckley",
    "date": "2023-11-14",
    "content": "This is easily the nicest and most knowledgeable forum for audio discussion I’ve ever seen. I’m taken aback daily on Gearspace and theGearPage how people with absolutely no real world experience wax poetic about the quality of this piece of gear over that piece, and how quickly every thread devolves into nothing useful. On this discord experts and beginners alike are constantly giving and receiving real knowledge that actually helps make records, rather than “which plugin gives the LUFS”. I’ve been at this music thing a long time and nearly every single day I learn something new and useful to apply to my next session. \n\nIf someone really came onto this forum and found the heat of this particular kitchen too hot for them, I imagine life might continue to be hard for them. This is about as good as it gets, and if there’s a place giving out better info from better people I’d love to hear about it. What @oaklandmatt has curated is pretty special. It’s not a daycare, it’s a place to get better.",
    "reactions": 22,
    "categories": [
      "saturation_distortion",
      "gain_staging_levels",
      "plugin_discussion"
    ]
  },
  {
    "id": "1461396459365859483",
    "author": "chrissorem",
    "date": "2026-01-15",
    "content": "There is something special about seeing a record all the way through.  Over time the different processes have been segregated but I personally really love making a record from beginning to end.  Anyone else ?",
    "reactions": 22,
    "categories": []
  },
  {
    "id": "963143440076537959",
    "author": "BatMeckley",
    "date": "2022-04-11",
    "content": "It’s so funny, literally yesterday was talking to one of my fav mixers yesterday and was like “what verb you been using on the vocals these days” and he’s says “Valhalla” and I asked how he sets it and he’s says “eh however it opens up” 😂",
    "reactions": 21,
    "categories": [
      "reverb_delay",
      "vocal_mixing"
    ]
  },
  {
    "id": "1017986823156404284",
    "author": "peterlabberton",
    "date": "2022-09-09",
    "content": "I’m mixing an album right now, and whoever tracked the vocals must have had some crazy ass suuuper slow attack compression going on and a crappy mic or exaggerated high shelf—*every single* hard consonant has the most insane attack, and despite my best efforts setting compressors/transient designers/spectral shaper/whatever, I’m having to go in and clip gain every single k or p or b or whatever down like, 5-10 dB. 😡\n\n…\n\nThat’s all, just complaining! As you were.",
    "reactions": 21,
    "categories": [
      "compression_techniques",
      "eq_techniques",
      "vocal_mixing",
      "automation"
    ]
  },
  {
    "id": "1047028614505451521",
    "author": "CK",
    "date": "2022-11-28",
    "content": "just to throw something into the thread y'all just had....when I did a MWTM in France with Tchad Blake many many years ago now, I asked him.....\"Tchad, when do you find your mix really feels like a \"record?\".......he said....\"about 2-5 years later.\"",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "1069747015967313962",
    "author": "BatMeckley",
    "date": "2023-01-30",
    "content": "Working on a mix today, we’ve been grinding on it a lot, a song recorded in lets say a “less than ideal way”. First half of the first verse just wasn’t right on the vocal. Threw everything I had it. Compressor after compressor, soothes, spectres, automations, eq before and after, still not quite right. Took off all the compressors. 1 eq. Readjusted the levels. Perfect. \n\nSometimes the best thing you can do is get perspective and be willing to undo everything you’ve done.",
    "reactions": 21,
    "categories": [
      "compression_techniques",
      "eq_techniques",
      "vocal_mixing",
      "automation"
    ]
  },
  {
    "id": "1105007285727678544",
    "author": "BatMeckley",
    "date": "2023-05-07",
    "content": "(I’m kidding kids don’t do drugs I haven’t done cocaine since middle school)\n\nOn a more serious note, and in the nicest possible way, I hope people know (outside of me) how seriously the mods take trying to make this a space where people can actually get good information, be supported without being coddled, and hopefully come away being in a better position to make the music that’s inside you… whether it’s radio hits or experimental jazz brick-against-the-wall symphony stuff. \n\nThey (we) don’t always get it right but man is everyone really trying their darndest with their heart in the right place.\n\n\n(Except for the fucking Irish contingency…)",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "1150169458107764757",
    "author": "NoahNeedleman",
    "date": "2023-09-09",
    "content": "Alright sound off: Team Parallel hit the ✌🏻 and Team Slap The Buss hit 🤘🏻",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "1163539707427299460",
    "author": "cian riordan",
    "date": "2023-10-16",
    "content": "Sliding into Monday, open a new mix, import session data from another song on the record, sounds 90% there already. Such a great feeling.",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "1174203474808938516",
    "author": "Slow Hand",
    "date": "2023-11-14",
    "content": "I was here on Day One. I remember. Back when the server was a lawless primordial wasteland rife with wanton violence and cruelty. When the strong shit-posted with impunity and the weak cowered and hid from the stinging tentacle of fate. Back when Amphions and Barefoots bleated and moaned their crooked song beneath a blood-soaked server icon. I remember.",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "1228653351223165049",
    "author": "sinaigimenez",
    "date": "2024-04-13",
    "content": "@cian riordan my bad man!! 🤦🤦 I'm new to Dischord and I must say I hate the interface! I was trying to use the search function looking for your opinion on the Ampex 351 preamp and for some fucking reason I tagged your name here several times 🤦 Sorry man. I'm wondering if I repeat your name 3 times in front of a mirror you'll appear to solve mixing troubles! 😂😂😂",
    "reactions": 21,
    "categories": [
      "saturation_distortion"
    ]
  },
  {
    "id": "1245170250962440262",
    "author": "chrissorem",
    "date": "2024-05-28",
    "content": "One cool trick I like to do in the studio is turn the Grammys on their sides and fill them with complimentary nugs",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "1265709054987210927",
    "author": "montrose recording",
    "date": "2024-07-24",
    "content": "been thinking alot recently about sonic preference and our 'lanes'.  recently saw a great Q+A with a filmmakers crew post screening and their biggest advice to young filmmakers was to stick to what drives you individually and pursue that to the highest level you can.  since joining this discord, i've felt more internal pull to 'clean things up' and 'not over do shit' - but im feeling (enough of it to want to share) that perhaps my lane is the opposite.  im drawn to smeary, crazy sounding productions. over and over again i'll hear some clean record people rave about and totally feel bored and disinterested - and the opposite is true, i'll hear the most distorted, or digitally mangled productions and love it.  so - all that being said - i'm not trying to be the devil on the shoulder here - but perhaps a reminder to myself and anyone whos on the quest to stick to your gut and try and make the thing as good as it can possibly be to you.",
    "reactions": 21,
    "categories": [
      "saturation_distortion"
    ]
  },
  {
    "id": "1267564754302668943",
    "author": "cian riordan",
    "date": "2024-07-29",
    "content": "Amazing what you can get away with when your click track lines up in your DAW.",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "1306010381835042918",
    "author": "Nomograph Mastering",
    "date": "2024-11-12",
    "content": "We’re still recovering from NoCompressionGate",
    "reactions": 21,
    "categories": [
      "compression_techniques"
    ]
  },
  {
    "id": "1318933689840697441",
    "author": "conor // wbotm",
    "date": "2024-12-18",
    "content": "is pre-ringing what happens after one of the mods smacks you round the head for obsessing about linear phase?",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "1321174459700215939",
    "author": "bobby k",
    "date": "2024-12-24",
    "content": "Anybody got the boozle leaks??",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "986054896283430992",
    "author": "BatMeckley",
    "date": "2022-06-13",
    "content": "Have you guys considered just slapping CLA Vocals on the master?",
    "reactions": 20,
    "categories": [
      "vocal_mixing"
    ]
  },
  {
    "id": "1011732672365723679",
    "author": "cian riordan",
    "date": "2022-08-23",
    "content": "Position it in front of a different singer",
    "reactions": 20,
    "categories": [
      "vocal_mixing"
    ]
  },
  {
    "id": "1031765038828101692",
    "author": "cian riordan",
    "date": "2022-10-17",
    "content": "Had a fun moment today where I'm mixing this retro-ey sounding tune for a band and I was really struggling to get the rhythm section to lock in and feel really warm and pillowy. I did a number on the drums but just couldn't get the low end to sync between the two. I ended up sending the mono bass to two mis-matched outboard compressors. They're totally un-linked and I just matched them by ear and wow... sounds so fucking good. Each one is grabbing and doing it's thing and it's *mostly* adding up to mono but gives real life when things momentarily lean left or right. Reminds me of a drum setup photo today where some of the mics were mis-matched and that's just honest-to-god so OK most of the time.",
    "reactions": 20,
    "categories": [
      "compression_techniques",
      "bass_mixing",
      "low_end_management"
    ]
  },
  {
    "id": "1099105836401442888",
    "author": "BatMeckley",
    "date": "2023-04-21",
    "content": "||Cian just sent me a first pass mix so good I’m considering PMCs again||",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1101176764476182578",
    "author": "cian riordan",
    "date": "2023-04-27",
    "content": "Sharing this to help people make sense of my bussing.",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1133216079024504842",
    "author": "cian riordan",
    "date": "2023-07-24",
    "content": "That phase of the album you recorded and mixed where you want to re-record everything, and then remix it.",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1161324830243684433",
    "author": "Dove",
    "date": "2023-10-10",
    "content": "Hello fellas, here is a reminder.",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1183601882984349706",
    "author": "BatMeckley",
    "date": "2023-12-10",
    "content": "I mean, beating my dead horse from my soap box from the light at the end of the tunnel from… I think again again again the most important thing is to have the TASTE to know the difference. Any clown (not referring to you) can find out from Colt Copernicus on YouTube how to widen their mix… the thing to me that sets the pros apart is knowing if it should be done. \n\nRuairi talks a lot about mastering engineers giving the artist and label confidence that the record is DONE, cause it’s gone through his hands. It’s not just that Ruairi has great ears, he knows what those ears are supposed to be listening for. (I remember this idea crystallized a bit for me when Noah mentioned when we did a song together I was looking to achieve things in the vocal that he hadn’t even considered yet, rather than us just agreeing if it needs 5k). I send songs to Cian not because I want to make sure it still holds up on his garbage speakers, but because I want his input on whether we were right to have the vocals out front or the drums destroyed or whatever. And I feel like he has the confidence to (gently) suggest that maybe we missed the forest for the trees in 3 months of production and THIS keyboard line should be the thing that carries the chorus.\n\nIt’s all part of the wider conversation of what are we trying to bring to the table? Do we want to just do whatever we can to have our name on as many things as possible, or do we want to be the kind of artist/producer/mixer whose involvement actually matters, even if that j evolvement is “yeah, you got it mostly right, just bumped up 60hz a bit not because I’m lazy but because I genuinely think the rough works”",
    "reactions": 20,
    "categories": [
      "vocal_mixing",
      "stereo_width"
    ]
  },
  {
    "id": "1195452717833912360",
    "author": "BatMeckley",
    "date": "2024-01-12",
    "content": "And that my friends is your lesson on how to lose a Grammy. Twice.",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1196219089362882663",
    "author": "chrissorem",
    "date": "2024-01-14",
    "content": "I wish I was more fuckwithable….. print me",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1208873180136214589",
    "author": "BatMeckley",
    "date": "2024-02-18",
    "content": "Sunday reminder: don’t apply global eq on a track to fix one thing on the track.\n\nI’ve been kicking around this mix and there was a resonance in some of the vocal bits, so I had an eq or 2 on the track to even them out. Maybe some multiband. And after an hour of frustration I bypassed everything and it sounded better (also your reminder to bypass). I went in and just printed some specific eq in the two or three words that were bothering me, and a little ess editing, and it was all much better. (Also, don’t be afraid to start from zero again,, especially if you find yourself editing an edit).",
    "reactions": 20,
    "categories": [
      "compression_techniques",
      "eq_techniques",
      "vocal_mixing"
    ]
  }
]