[
  {
    "id": "1059283855841968160",
    "author": "Slow Hand",
    "date": "2023-01-01",
    "content": "Hey @everyone. After some discussion we've instituted a new forum #song-a-week for what will be the first of a weekly songwriting exercise that we now invite you to participate in.\n\nThis is an opportunity to flex your songwriting muscles and share your work with your peers. Every Sunday evening we'll pick a songwriting prompt for the coming week. It may be a theme, or perhaps a popular song that we'll all use as a jumping-off point for inspiration. Participants will have between Monday and Fri of the following week to write and share their song demo. Then we do it all over again the following week.\n\nThe forum is located right beneath #✍songwriting-talk on the channel sidebar. Everyone is welcome to participate starting tomorrow (Monday).",
    "reactions": 45,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876057469837799454",
    "author": "oaklandmatt",
    "date": "2021-08-14",
    "content": "@everyone watch this. whether you're a songwriter or not, it's by far the best insight into the modern process of making records that ever seen.  yes there are plenty of masterclasses and song breakdowns and people going on IG live talking about not using compressors, but this gives a unique insight into how the process actually FEELS behind closed doors",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075789852584444075",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "Some songwriting-related morning routine thoughts:\n\nI've been starting my day with doing piano scales and vocal warm ups to a metronome and then singing/ learning a song and recording a voice note of it. (recently it's been Tom Petty Wildflowers at the piano). Then I look at my phone and start my day.\n\nHard to know for sure if it's causal, but my songwriting abilities have sped up. I'm quicker in sessions, both with topline and tracks. \n\nI think it's related to several aspects of the morning routine, and they all compound. \n\n*I'm playing music before I'm on my phone, so I'm outputting music before my brain starts reacting.\n\n*doing scales w piano and voice opens up my vocabulary on both instruments and makes me much more comfortable to sing/play ideas when writing\n*doing these to a metronome has improved my timing on all instruments (not just piano and vocal)\n*learning a great song and singing it every morning has massively improved my lyrical writing/ improvisation (probably the hardest part of songwriting) by just reinforcing good *sounding* words.\n*singing and recording the same song every morning for a few days or a week makes me really THINK about vocals and vocal production. How I'm singing the words, how to push certain vowels in a certain part of my voice, etc \n\n@Slow Hand  @Ross Fortune @Will Melones @OJ",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1076849791700574228",
    "author": "oaklandmatt",
    "date": "2023-02-19",
    "content": "Yes exactly! I've found that the best songs are never calculated, they're always just felt as they're being created. They are magical/ incalculable moments. As soon as people start analyzing – \"is this too generic?\" \"maybe we should have a part like **insert artist**\" – the songs loses its magic.\n\nBut the paradox is that you can't  just sit around and wait for them to happen. You have to be in motion. So often times building habits and processes (which are calculated) is a great way to keep oneself in the motion of creating things. Piano scales, learning songs, writing a song a day, etc., are just some of the many ways to do this.\n\nAnd the other aspect is also correct. These are skill building exercises that help the quick translation of creative ideas. It's the emotional and psychological side of workflow. Just like technical workflow – where you want the shortest time between idea an execution – same goes for writing. If you are constantly writing lyrics and singing melodies and playing instruments, when that emotional magical idea arrives, you can translate it more quickly into lyrics, melody, and music.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990465284051709992",
    "author": "oaklandmatt",
    "date": "2022-06-25",
    "content": "have her learn classic songs and write a song a day for the next month or two. repetition in the process with a great musical diet. it is rarely more complicated than these two things",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990776963394326528",
    "author": "Slow Hand",
    "date": "2022-06-26",
    "content": "Depending on the kind of wall that you’re hitting with her, there are a few simple approaches that you can suggest that will get her thinking about the different dimensions of melody and how to play with it:\n\nA) Expansion - How long is the melody? It is a small fragment, or a full sentence? Stretch it out over a longer period of time. Sing it half as fast. Hold certain notes for emphasis.\n\nB) Diminution - Compress parts of the melody into faster runs. Make it shorter. Remove notes. Simplify the melody to its melodic essence.\n\nC) Repetition - Take a fragment of the melody and play it again. And again. And again.\n\nD) Modulation - Take a melodic idea and transpose it to different keys. The first movement of Beethoven’s 5th Symphony is built entirely off of a simple four-note motif. He got a lot of mileage from such a small element.\n\nE) Dynamics - Play with volume or intensity. Encourage her to go from soft to loud, or loud to soft. Accent certain notes for emphasis. This one is really powerful. For inspiration suggest that she try voicing her dynamics like a great horn player might. Get her to clip her notes very short or to make them “bloom” or be soft and round. Make them bark or be breathy.\n\nF) Be Another Instrument - Encourage her to try writing as another instrument with her voice. Sing a bass line. Sing a horn part. Sing percussively like Michael Jackson or James Brown would.\n\nG) Role Playing - Give her a character and a persona to inhabit. Make her sing the same thing as different personalities or people. Pick a melody and then make her sing it in the style of three singers that she’d know.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472297813420544222",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Given that this is #✍songwriting-talk , I would strongly advise people who want to learn how to be great songwriters to avoid any production at all when doing the practice we're talking about.\n\nIt's so much easier (and time consuming) to play with snare drum sounds and production transitions than to stay focused on lyrics and melody. Almost everyone I know, and seemingly everyone that asks questions here, just needs to write lyrics and melody over and over and over.\n\nIf you want to get reps to become a producer, that's awesome. Go to #🎹production-talk and talk about those reps.\n\nTrying to also do production while doing the exercises that we're talking about will only slow you down.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153456123576332388",
    "author": "oaklandmatt",
    "date": "2023-09-18",
    "content": "Yes, all the time. But my perspective is sort of tough love: nothing you or I do matters. Even if I make a culturally transcendent song, in 100 years we'll all likely be forgotten.\n\nOk, so then what? Well, you still have a subjective experience of the world. So what is meaning for you? \n\nDo you like making things? Do you enjoy the process? Do you feel fulfilled and connected to the experience of life by playing piano or singing or mixing or making weird keyboard sounds? \n\nI love all that shit so much. When I get stressed out and uninspired, I try to find the ways to get me back into making things. When I do, I always feel better. Piano scales or learning songs or playing guitar for my girlfriend or whatever it is that makes me feel joy.\n\nIt's very important for me to have significant parts of my life that are creative and not for any purpose.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304992419074412576",
    "author": "Pio",
    "date": "2024-11-09",
    "content": "Something I find really fun and which often gets me out of a rut is picking an artist and imagining you’re in their shoes/writing for them and go. Limit yourself, set a timer, write a song - what words do they use? Listen to a few songs of theirs first and notice what stories they’re interested in telling. I find even if I don’t end up writing a song in their style at all by the end (usually the case) the exercise gets me thinking about the stories I have rolling around my head. Ideas I wouldn’t have thought of as being good for a song. Gets me out of writing the same song too many times, and always makes me realise we have way more songs in us than we thought. Make a weapon out of your empathy and have fun - you can step into anyone’s shoes and try thinking what song you might write if you were there. (The fun challenge is to STLL keep it genuine and authentic to you - kind of paradoxical but I believe heavily in amazing stuff being able to come this way)",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328022413983879199",
    "author": "Zakhiggins",
    "date": "2025-01-12",
    "content": "1. I do it first thing in the morning when I wake up before things like my phone ruin my brain for the day. \n\n2. Make it a routine. I make some time before i have to go anywhere every morning to try and create something. When your brain gets used to the idea that you're going to that place at the same time every day, once you go there then the ideas flow better with time.\n\n3. Understand it's ok to write something bad, with time good ones come. \n\n4. Understand that a song is never actually finished, it can only be abandoned wherever you chose to abandon it.\n\n4.5. Understand that it's ok to figure out what a song means after you write it.\n\n5. Understand that we're trying to make trees, not tables. (As in sometimes it's not healthy to keep refining something till it's too straight edge and the vitality is gone from it)\n\n6. Said it already but saying it again, don't check your phone before you write\n\n7. I don't always write lyrics. Sometimes i write a melody, sometimes a chord progression, sometimes lyrics. Every now and then i do a session of what i call Lego writing, where i try to see what lyrics i wrote before fit with what melody/chord progression etc. \n\n8. Oh and did i mention, it ruins my creativity to check my phone before i make anything? \n\nThis is what works for me, hope it helps you!",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "906129280021463080",
    "author": "Keyron",
    "date": "2021-11-05",
    "content": "i used to write everything on my phone as it’s faster but i got suggested to use the old pen n paper as you CAN SEE WHAT YOU ERASED and this has been game changing for me\n\nso this is my “writing setup” now:\n1. i take a stack of A5 sheets of paper (i just love how small they are)\n2. a sharpie without the cap \n3. my phone to record myself in case i lose ideas\n\ni’ve developed something i call “The Dry Sharpie Technique” with which you challenge yourself to not let the sharpie dry up (duh) and the only way to do that is to keep writing words… eventually you’ll find yourself with\n1. a stack of scribbles and cancelled verses\n2. an incredible song\n3. a “backup” of your process",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "983960359440384020",
    "author": "Slow Hand",
    "date": "2022-06-07",
    "content": "In this case spaced repetition is your friend. Choose an interval of time that you want to spend practicing a song (10 min, 15 min, 20 min) and practice Song #1 for that amount of time. Then - even if you're not proficient or haven't yet committed the song to memory - move on to practicing Song #2 and let the first song process and consolidate in your memory while you work on Song #2. \n\nWash, rinse, repeat until you go through the entire rotation of songs.  If some songs are significantly more difficult to learn or memorize then come back to them more often. The point is to constantly be checking back in on the songs that you're trying to learn just as you're on the threshold of forgetting them.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009885679062364191",
    "author": "Will Melones",
    "date": "2022-08-18",
    "content": "I’m sure we all share this struggle to some degree. I’ve got some projects that I’ve put many hours into, just to let them sit on a hard drive for years.\n\nCo-writing has helped a lot, and has taken some ideas to places I never would have thought to go. The feeling that you have some moral obligation to your collaborators to finish is motivating. When you’re making art for yourself, it doesn’t benefit from those positive forces of peer pressure, and there’s a lack of constraints and no sense of urgency. \n\nI think making creative decisions is metabolically expensive. It’s easier to defer all decisions, which is why you see DAW-age producers committing to so little until the mix. In the same way you can defer the entire songwriting process, especially if you have someone else’s project or deadline to prioritize over your own.\n\nTo be both the creative mind and the executive finisher is a lot of exhausting context switching. Some options might be to split these responsibilities with someone else, or to dedicate separate time to each task. If someone hires me to print stems or solder a patchbay, the last thing I want to do is engage in creativity. But when I get inspired to write, I don’t want to stop and troubleshoot the plug-in that’s crashing the session.\n\nMaybe like the divergence/convergence approach would be to set aside an hour or three at the end of your day to finish ideas you’ve already got brewing—set a timer and finish a song, or a verse. Or, even better yet, dedicate the *end* of your day to play and experimentation. Then the next morning, hopefully with fresh perspective, get in the mood to tie up loose ends and prepare your next steps. You’ve demonstrated that you’re good at wearing that hat for other artists, so you can do it for your songs, too. Just maybe not while you’re in the creative flow.\n\nI’m not practicing what I preach, just brain-dumping. I definitely don’t have this figured out.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058037149146038312",
    "author": "NoahNeedleman",
    "date": "2022-12-29",
    "content": "I used to do a thing like that with a bunch of buddies in LA every September. \n\nIt started cause I wanted to practice using key changes or modal shifts as a songwriting technique, and so I had rules for myself:\n\n1) first idea that fits, wins. No agonizing over lyrics or Melodies or whatever, if it rhymes and makes some kind of sense, move on with it. \n2) first year: ever song needed a key change or modal shift. Second year: shifting or alt time signatures. Third year: some other esoteric tool I wanted to learn etc…\n3) the moment you’re done, record a voice memo and send it to someone. Mistakes and all. \n\nThe key for these rules was the make the quality of the songs less important than the act of writing. But damn if I didn’t get two or three real winners every year.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075791534328393790",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "The other overall point to make is that I find nearly all the great songwriters I know are just comfortable in a session. \"Good vibes\" in a sense, but also just comfortable generating ideas. They don't really get stuck anywhere. If something isn't working (even if they suggested it), they're comfortable moving forward. Just forward momentum, very little negative energy.\n\nAnd so much of that is *simply doing it a lot*. It's great to talk about tips and tricks (and yes, morning routines), but mostly it's just putting in time where you're enjoying doing it. \n\nThat's why I think learning songs is so important. It's actually not really about intellectualizing or analyzing what great songs are doing. It's much more just practicing being in the feeling of singing and playing great music. It's the same feeling you're after when you write. By learning great songs and singing them, you get comfortable in that feeling and you're better able to connect to it when writing.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076571860617134141",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "This and one or two more parts\nWith chords and melody\nDo it daily for a year\nA great songwriter you'll be",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472308753662611680",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Outside of just getting daily reps, the main goal of this particular practice (the 30 minute write) is that you're setting parameters where you don't have time to decide if something is good. The point is to relieve yourself of any editing and force yourself to quickly write lyrics and melodies. \n\nIt's doing two separate and important things: building muscle memory and teaching to work on instinct.\n\nBuilding songwriting muscle memory is just like learning a language. You're practicing over and over until you learn how to express yourself emotionally. This is the basics component. You'll learn what notes you can hit and what words rhyme and how rhythms bounce. You'll build a foundation that will become second nature.\n\nRelated but distinct, you will learn how to move quickly. It turns out most great songs come in an unthinking way. Until you learn how to write without editing and thinking about what you're doing, you are less likely to write those great songs.\n\nI'm speaking from a lot of personal experience, but also whether it's Hemmingway's \"write drunk edit sober,\" or the Rick Rubin, Pharrell, etc. belief that great songs come from some power outside of ourselves (\"Source\" or God or whatever), learning to create without being analytical is super super important.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033201990035050597",
    "author": "masteredbyjack",
    "date": "2022-10-21",
    "content": "Something my group of friends (most of whom are entrepreneurs/creative types) do when we get together and discuss business is what we call an “edge storm” (yes I know slightly cringe)…but it’s a brainstorm where you aren’t allowed to say no to anything, you are only allowed to offer another idea. It’s actually incredibly helpful for getting ideas flowing, similar to what Matt was talking about.\n\nThen later we edit and pick apart things that are potentially good from that flow",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075805533589745694",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "Often I think that the greatest benefits of routine are when you do them during times when they're most difficult to stick with.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153457350129225728",
    "author": "oaklandmatt",
    "date": "2023-09-18",
    "content": "Those are two of a million other examples because that oscillation is everything in my creative process",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153469462905897082",
    "author": "LAPhill",
    "date": "2023-09-18",
    "content": "In a very pragmatic sense, there is no wasted rep. If you're writing music, you're refining, honing, growing, working out the bad ideas. If you get in the HABIT of writing, whether or not you feel like it, whether or not there's a purpose, there is virtually no chance that you don't improve. Then, you'll be better prepared when opportunities do present themselves.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472011685643554826",
    "author": "oaklandmatt",
    "date": "2026-02-13",
    "content": "You're way overthinking it and trying to find some \"solutions.\"\n\nThe only thing that important is writing A LOT of songs. The only thing. Only. Yes. Only.\n\nWhy? Because forced reps is the only way to learn the language of songwriting. You need to practice over and over to get the muscle memory of writing. It's like the language of an instrument or a literal spoken language.\n\nAny books, tips, videos, classes, spiritual paths, etc etc are only useful right now if they get you to write MORE. But really, you do not need them. I strongly disagree with anyone who says otherwise.\n\nFWIW, my 25 years, billions of streams, platinum hit songs, blah blah has taught me that reps are the ONLY foundation. The best songwriters write all the time and didn't really get good until they'd written hundreds to thousands of songs.\n\n@Zack Hames is on the right track. But don't \"attempt\" to write a song a day. Force yourself to do it. Immerse like you would learning a language. Don't wait to express yourself perfectly, start writing songs like a five-year-old and work your way up. \n\nUnlike mixing where you need to learn how things like compression work, or like playing guitar where it's important to have someone show you proper technique, you cannot learn how to be a great songwriter by anything other than doing it over and over*.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827616829853270036",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "learn your favorite songs in depth. there's always a lot more going on that you think. many of the best songwriters i know just know a ton of songs. not only does it teach your conscious brain, but it builds muscle memory for a TON of good habits. lyrics, rhymes, the sound of words, melodies, harmonies, cadences, vocal performance, etc. Study the greats like @joebegalla said!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831876926436016219",
    "author": "Josh",
    "date": "2021-04-14",
    "content": "One of the few things I actually learned from a course early on is that writing/production/mixing is just a ton of small choices, and the more your practice, the easier it is to make 1000 right choices",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075805675508215899",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "(And I sometimes break my habits during busy times too)",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156983296148910230",
    "author": "Chris Doms",
    "date": "2023-09-28",
    "content": "Here’s the prompt, for the record I didn’t make this. Michael Morgan sent it to me\n\nI want you to become my Prompt Creator. Your goal is to help me craft the best possible prompt for my needs. The prompt will be used by you, ChatGPT. You will follow the following process: 1. Your first response will be to ask me what the prompt should be about. I will provide my answer, but we will need to improve it through continual iterations by going through the next steps. 2. Based on my input, you will generate 3 sections. a) Revised prompt (provide your rewritten prompt. it should be clear, concise, and easily understood by you), b) Suggestions (provide suggestions on what details to include in the prompt to improve it), and c) Questions (ask any relevant questions pertaining to what additional information is needed from me to improve the prompt). 3. We will continue this iterative process with me providing additional information to you and you updating the prompt in the Revised prompt section until it's complete.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860534987588370442",
    "author": "Yago Ibars",
    "date": "2021-07-02",
    "content": "I completely agree on what @oaklandmatt has said! If you think you'd use some theory, I would suggest looking into Top40 theory's instagram. He goes into great depth analyzing hit songs. I find that theory is very helpful when you've got a nice idea but you get stuck building a song around it!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860535201440202792",
    "author": "Alessandra Morris",
    "date": "2021-07-02",
    "content": "it’s like an  intuitive thing i think. But like @oaklandmatt said, it kinda comes with time, practice and also messing up. I’ve found great hooks by making mistakes. Sometimes i just grab the idea for a hook from a portion of the top line that I already did, I just change it a bit, make loads of variants of that motive. Or just move around the key of the song and get a lot of options. You know what i mean? Its hard to explain by writing😂But its just trial and error tbh. Don’t think there is like a formula 🤷🏻‍♀️",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983957775946231858",
    "author": "chloe corley",
    "date": "2022-06-07",
    "content": "all i know is that sleep (maybe relaxation/meditation too?) after practice helps put things from short term memory into long term memory",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033165253577547816",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "I also think most of my worst writing sessions happen when we don’t clear the air about what someone is looking for. If I’m writing with someone who doesn’t trust themselves as much or doesn’t feel comfortable leading a session because they’re pretty new to writing, I’ll try to be more of an active guide rather than a sounding board. I’ve also had people who get embarassed to write in front of others so I’ll just chill on my phone on the porch for them lmao. \n\nI think people who are writers and producers struggle to collaborator with that middle ground between seasoned pro/artist with very clear vision, and very “green” artist. They won’t feel comfortable having someone write a whole song for them but they don’t quite trust their own judgement yet either. I think the solution is to practice the idea of commitment.  Sometimes the best writing contribution is letting them do a lot of the lifting, and if the artist gets insecure or flustered, just ask them “well, how do you feel about the idea/line?” or “what about the line feels awkward?” That way you’re helping them to actually make decisions—now they’ll be able to write with you or anyone else, or completely solo.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058039044115808307",
    "author": "NoahNeedleman",
    "date": "2022-12-29",
    "content": "My only gripe here is that knowing when a song is done, or what it feels like to call a song done, is really important. Learning what the process feels like from beginning to end is a huge part of the exercise IME",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157017856253362247",
    "author": "austenballard",
    "date": "2023-09-28",
    "content": "You are now my Vignette Creator. \n\nYour goal is to help me craft the best possible Vignette for my needs. \n\nYou will follow this process: \n1. Your first response will be to ask me what the Vignette will be about.\n\n2. I will respond with a Topic.\n\n3. Based on my Topic, you will generate 3 outputs:\n\na. Vignette - A Vignette exactly one sentence long based on my Topic.\n\nb. Suggestions - Make suggestions on how to improve the Vignette with additional input that I can provide.\n\nc. Questions - ask me relevant questions pertaining to what additional information is needed from me to improve the Vignette.\n        \n4. I will respond with additional information to you and you will return to step 3, updating the Vignette and providing further Suggestions and Questions.\n\n5. We will repeat steps 3 and 4 to iteratively generate a Vignette suitable for my needs. I may instruct you to expand the length of the Vignette as we progress.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357039395701784867",
    "author": "spectrummasters",
    "date": "2025-04-02",
    "content": "Came across this , Charlie Handsome , describing Louie Bells process for Posr Malones F1 writing \n““Louis [Bell] was involved in the writing and production, and he recorded Post’s vocals. I think he’s done that for nine years now, and they have their routine. And Louis is good at creating libraries. At the beginning of the project he AI‑ripped the drum beats of tons of classic country songs. He had hundreds of them. So while I was doing the music, he would go, ‘What tempo are we at?’ I’d say ‘135’, and he’d have 50 drum grooves that work at 135 bpm. There was this huge catalogue of ideas we could aim for,”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831485138235949066",
    "author": "Keegan",
    "date": "2021-04-13",
    "content": "I'm sure dialing in the details is a different story, but it was really motivating watching how relaxed the process of writing songs can be",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "846934713507381289",
    "author": "Josh",
    "date": "2021-05-25",
    "content": "Are you really going to question our lord and savior Travis Scott and his creative process? My children will be born to sicko mode. Their children will be born to sicko mode and so forth. It’s very obvious that those writers are his disciples spreading the good news of the mode (sicko) and what not.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860618335967641601",
    "author": "chadwahlbrink",
    "date": "2021-07-02",
    "content": "Quote time \n\n“Instead of saying, “I’m stuck, I can’t come up with anything good,” it’s far more effective to say, “I’ve finished this, and now I need to make it better.” Or possibly, “I finished this, and it can’t be made better, but now I’m ready to do the new thing, because look at all I’ve learned.” \n\nThis is the story of every human innovation. \nThis is the story of every good idea, every new project, every pop song, every novel. There was a bad idea. And then there was a better one. \n\nIf you want to complain that you don’t have any good ideas, please show me all your bad ideas first. \n\nBefriending your bad ideas is a useful way forward. They’re not your enemy. They are essential steps on the path to better.”\n\nChap 167 of “The Practice” by Seth Godin.\n\nI feel like this is very in line with getting better at all of the creative crafts out there! \n\nSub in “Show me all your bad hooks” or “show me all your bad mixes” and you are headed in the right direction.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983962235309285478",
    "author": "ehutton21",
    "date": "2022-06-07",
    "content": "video your practice too if you can! it’ll help you to catch weak spots or maybe lacking areas/tendencies or weak spots in technique",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009590779330695288",
    "author": "youngteam",
    "date": "2022-08-17",
    "content": "kind of rambling here but last thought is that not everything needs to be finished. if i make trash, that's okay and it can just be production practice. the next idea might be the one to get finished",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009601823855874119",
    "author": "Jeremiah M.",
    "date": "2022-08-17",
    "content": "Not sure this is the answer you’re looking for but try linking up with other writers to help you with unfinished demos. Don’t be afraid of collaboration writing sessions are so fun",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129836148206862476",
    "author": "Ross Fortune",
    "date": "2023-07-15",
    "content": "It’s followed by this, but I’m so in awe of my hero heroes that it’s almost a crippling thought. Like, what am I going to do, make *Kind of Blue 2: Back In The Habit*?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138142292847374468",
    "author": "chrissorem",
    "date": "2023-08-07",
    "content": "I’d experiment with different rhythms. Drums machines/rhythm boxes  are Great for this. We already have our go to habits, so it good to figure out ways out of them. Another trick for me is to not play and imagine a part before i touch an instrument. My Brain  is better than my muscles",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153467268546711573",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I think the focus should be on “how can I make something I find exciting”. Earlier when I was talking to Austen about how I’m really bad at just sitting down and churning out beats or instrumentals, it’s because I just don’t find it exciting very often. I rarely want to chase anything. But when I’m writing and I hear something great it gives me the same feeling as when I got my black belt in tae kwon do in 2nd (don’t ask). That shit is sick. The beauty in art isn’t about who consumes it in my opinion. Or how many people. It’s about the process of creating it. So if you aren’t loving the process then maybe it’s time to explore other things? Do the opposite of what you normally do and see if it feels like Christmas Day again.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223697761128677608",
    "author": "oaklandmatt",
    "date": "2024-03-30",
    "content": "Well, it's impossible for them all (or even mostly) to be good. Which is part of what you learn through the process. \n\nYou learn SO much through consistent repetition. You'll learn way more than through any analytical means. Watching YouTube videos, reading books about it, thinking about it, etc are all VASTLY inferior ways to learn to write songs/ lyrics. The best way BY FAR is to do it consistently and for a long period.\n\nWhat you want to do is become a person who writes all the time. If you're not doing that, no other method will get you there. @Marshall",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276580607148691633",
    "author": "LAPhill",
    "date": "2024-08-23",
    "content": "Biggest tip is to listen to other genres for inspiration. You can also try swapping one note in a chord so that it becomes less expected (i.e. G major becomes B minor with a halfstep move). Swap a couple of notes and step outside the key for a second (instead of E minor to C major, go E minor to C minor, or E minor to A major, or E minor to G# major, just by a couple of small adjustments).",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1329523518609555456",
    "author": "Pio",
    "date": "2025-01-16",
    "content": "Clear organised daily schedule goes a long way to help everyone be happy and have fun",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472303932561952828",
    "author": "Jack",
    "date": "2026-02-14",
    "content": "I feel like it has to happen away from the computer. I can only speak for myself but there’s this wild temptation when I’ve written 3/4 of a verse or something that has potential to commit it somehow and it just leads to rumination. I don’t think anything unfinished ‘deserves’ permanence. It’s like mise en place or something. I don’t want to get my pan ripping hot while I’m still dicing vegetables.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831237515364794428",
    "author": "Josh",
    "date": "2021-04-12",
    "content": "Definitely relate to all of these. I sorta feel like I don’t have writers block anymore, I just have creative days and desperately creative days hahah",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885013283072008222",
    "author": "alecdibell2",
    "date": "2021-09-07",
    "content": "@Zack Hames finding a teacher for what you’re looking to improve on could take some shopping around. I think it would be helpful to move away from practice only being playing along to your productions.\n\nYou’re going to develop better groove if all you’re listing to is your own playing. So I’d start practicing some grooves solo, no click for now, no music. Listen closely to drummers that you love that have that feel throughout songs. Learn their grooves, play along to their songs for a bit.\n\nI think after you take time to play only listening to yourself, and playing along to other songs with a great feel, it’ll be easier to integrate those philosphies into your own productions.\n\nMy drum lessons when I was younger made me stiff and less creative, so finding the right teacher is soooo important. It wasn’t until I played solo to make the drums impactful by themselves, and played along to a ton of hiatus kaiyote and esperanza spalding that i was able to have a musical feel",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "889949871602282549",
    "author": "Zack Hames",
    "date": "2021-09-21",
    "content": "I think communicating that through text is *incredibly* difficult. What i usually do is try to confirm by describing what they're talking about BACK to them while also using the correct terminology.\n\nI have a good friend / amazing writer who calls \"measures\" how many times a progression repeats.  So he will say something like \"just add another measure\" or \"have that layer fade halfway through that measure\" or something, and I just go \"wait, so you want it to repeat through the whole progression again or am I missing something?\" Just an example. Then later I may take an opportunity to explain that a measure is much smaller than the entire progression and try to explain the difference. He's incredible, amazing writer and has amazing ears but does not have any training or speaks with any technicality with almost anything in his life. It would be almost impossible to actually break those habits for him, he just doesn't care.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983981143336575026",
    "author": "Deleted User",
    "date": "2022-06-07",
    "content": "Personally, I latch onto vocal parts (if there is any) or other instrument parts to associate memories of what happens in the arrangement. It kind of takes me out of the charts too- if in some rare cases of “no charts” gig. But I find writing charts always helps in the process of learning parts even when it’s a no chart type of situation",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009599087257059400",
    "author": "youngteam",
    "date": "2022-08-17",
    "content": "war of art is a fantastic book. lemme say that you are clearly on the path if you are thinking about your process this intentionally. \n\nwe all deal with resistance, imposter syndrome, etc. it's *hard* bearing your soul, being authentic, the list goes on.\n\nwhat i will say that's had a big impact on me lately is creating for the sake of creating. aka writing music *not* to place a sample, make a million dollars, or reinvent the wheel but simply because i wanted to!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069694991976366110",
    "author": "Zack Hames",
    "date": "2023-01-30",
    "content": "What is the lifestyle / daily life like for people who write *a lot * of songs (whether it’s the music, production, beat, lyrics, etc)? Are you writing 8+ hours a day? Like really sitting with your instrument/paper+pen/DAW. taking frequent breaks? Going hard for a couple hours? combination of everything? How scheduled is it?\n\nI have been writing songs since....forever. I've gone through various phases of writing a song every day to not writing for months on end. I do a lot of different things but am trying to get a lot of writing done in a relatively short amount of time and would love to just hear people's anecdotes on what your life is like when you are writing a LOT.\n\nI find I can go very hard for an amount of time, then I *NEED* a break. I cannot just write every day for hours on end as much as I'd like to.  If someone has tips to get more productivity in writing, I'd love to hear it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153749573240639568",
    "author": "austenballard",
    "date": "2023-09-19",
    "content": "Interesting. I kinda feel the same, especially when I'm working on modern stuff and then go and listen to modern stuff. It feels more like reference than inspiration. So I decided I was gonna watch Weather Report's 1976 Montreux performance and some Allman Brothers instead. That felt very mentally nutritious",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157017804369825883",
    "author": "austenballard",
    "date": "2023-09-28",
    "content": "alright so as of right now chatgpt remains mostly useless for writing anything even remotely resembling a good lyric or line of poetry\n\nHOWEVER it is quite good at generating vignettes which, provided you have any human imagination whatsoever can provide very solid inspiration for songwriting.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182406639370916062",
    "author": "Deleted User",
    "date": "2023-12-07",
    "content": "Sounds like a skill I need to practice. I do make sound from scratch, but it takes a while to make them good - and to make sound that fits with the song is another ballgame",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187115804391645224",
    "author": "ehutton21",
    "date": "2023-12-20",
    "content": "Yeah I don’t disagree. Just trying to document what the process should look like and what the method is for people who aren’t record label-supported acts. Someone may do something with that knowledge someday 🙂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188047183694532650",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "moving conversation with @rae here\n\nI've been doing more of \"study the greats\" with production, when it comes to arrangement and production, I feel that things are a lot more clear cut than songwriting. For example, I can try break down the drums of a song into a  drum pattern, dynamics, feel, and the drum sound (type of drum kit, machine, and processing on it). \n\nBut with lyrics (or language) - it feels more gray to pinpoint how to take a concept and apply it into my own writing. How do you usually break it down?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188126231389024296",
    "author": "cy (sigh)",
    "date": "2023-12-23",
    "content": "Questlove was actively trying to imitate the feel of J Dilla's drums in those sessions and he said he STRUGGLED  because he was so used to trying to be perfectly on time in those days - there's a couple interviews (red bull is ones I think w d'angelo there ). also I forget the engineer's name but he also has a seperate interview (if you haven't already seen it)\n\nbut on the topic I think in my case my fiction (creative writing) background helps a lot. Theresa few exercises we used to get m, some for eveyone and another was based on each person's writing styles. \nfora general excercise teach would have us write down a phrase or two we overheard during the week ina public setting (train. bus, in class etc) and create a short story that Stems from it.  this is good for being able to create things out if nothing - world creation using a set core, \n\nmy natural writing style is v descriptive so one of my peesonal excercises was to write explicit sex scenes every week. it's extremely hard to find the correct balance between keeping it enticing and going over the top and losing either making the readers cringe  or unintentionally laugh. (and we laughed so often 😂)\nall these would be read and workshopped in the class itself. \n\nI think one of my main skillsets now is based in those skills. I'm very good at re-writing / editing and most of all reframing sentences. when other ppl give mea direction to follow, whether  it's just the idea or maybe they already have words and need to readjust to whatever music we now have on hand. \n\njust recently wrote a whole song I thought was too generic and open ended but loved the ideas. pitched to an artist and they loved it. we're working on editing the lyrics to insert a ciuole personal scenarios of hers but most of the vocal melodies and words are actually the same as what I had.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220668347700744222",
    "author": "Deleted User",
    "date": "2024-03-22",
    "content": "There may be two ways of approaching this\n\n1: Trying to make the better versions of ‘same type of songs‘.  I do this myself, using same moves that have worked before I can make a better version of the same type of song. \n\n2: Copy from style you are unfamiliar with. This can get you out of making ‘same type of songs’\n\nI think there are main four elements of musical habits: rhythm chords cadence/resolution tempo \n\nyou may find there are a few key things that you gravitate towards like your “home” in all four of those. You can explore outside of the patterns that you lean on in those four elements if you want to prioritize breaking out of some of the habitual choices.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261811565917765683",
    "author": "youngteam",
    "date": "2024-07-13",
    "content": "Again, love your thoughts on this. The element of reimagining past and present is especially interesting and clearly we owe a lot to the practice of sampling and the culture surrounding it.\n\nOn an ironic note, I think when we as creatives are being honest with ourselves we end up making the most original music we possibly can. No one has lived our life experience, and we are an amalgamation of all our influences from childhood to now.\n\nI could see someone setting out and succeeding in making the most original movie of all time and it being complete shit.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356414365825237164",
    "author": "Brian Reynolds",
    "date": "2025-03-31",
    "content": "But beyond that. You can comp the gibberish together to make the most compelling melody for the part your writing to. Then just loop that part. And start to sing with your comp. Ask yourself what's the mood of the song, what mood am I in. And just kinda flow with it. Like improvising on an instrument. Its a muscle so it will take time and effort. The more often you sit down and improvise melody the easy this will be. Doesn't always have to be a voice exercise. 15 mins of mindless melody exploration on a guitar or piano will stretch the same brain muscles.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385030307278749817",
    "author": "Brian Reynolds",
    "date": "2025-06-18",
    "content": "I'm always in the daw. Always recording.\n\nSometimes melody first. But mostly drums first.\n\nBuild an instrumental just chasing intuition, quickly. 2-3 melody parts and a bass line on top of drums. And youve got a chorus loop. \n\nThen take that improvisational melody muscle and apply it to the vocal melody. \n\nIm not a big humming guy, I get to words pretty quickly. But will start with common phrases to me like,  \"runnin runnin runnin round runnin runnin runnin down\" I have a few others.\n\nI start to land on a melody, with a feeling and story. That I haven't told. Sometimes it takes 90 seconds, sometimes 5-10 mins. \n\nRecord and comp till I have what I like. Than do all the background vocals. \n\nThen start muting a couple of the melody parts. Find my verses.\n\nRinse repeat the process above. But now I know the story and I just have to find the melody and the thru line narrative.\n\nDepending on how the verses feel running into the chorus. Or short length of track. I'll write a bridge \n\nMelodyne the vocals.\n\nStructure the song.\n\nMix the song.\n\nUpload the song.\n\nMake another.\n\nThis usually takes 2-4 days, intermittent with regular life.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385031101629595728",
    "author": "Gabriel Tyranny",
    "date": "2025-06-18",
    "content": "Damn. This is some ‘can’t stop won’t stop’ energy my guy - Great discipline",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385097239596109866",
    "author": "andrew_yv",
    "date": "2025-06-18",
    "content": "I still write songs and fragments every which way, but the ones that tend to do best are—walk into the studio with no ego, make the first sound I think of, record, sing, nonsense and stream of consciousness, layer, follow intuition, hour or two later come out of the flow and there’s most of a song. Then go for a walk. Lyrics and story crystallize on the walk. Come back and refine. Any more conscious process has a way lower hit rate for me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385273564210532505",
    "author": "Josh",
    "date": "2025-06-19",
    "content": "So I’ve been trying to write more and I was getting frustrated because telling myself “it’s time to write” doesn’t yield the best results. I’m also trying to get better at guitar and just started playing more. Turns out playing more makes me find cool tones which gives me cool ideas that I end up finding melodies to while I’m practicing whatever it is that sounds fun that day. Then to double down on the practice I come up with lead lines over the track until my fingies get tired and then lay down the vocal.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399138675979321426",
    "author": "Slow Hand",
    "date": "2025-07-27",
    "content": "This is a very attractive concept that's been on my mind for the last year. I've been kicking around a personal project to map out some guidelines for clarity. If you or anyone here ever want to sit down and brainstorm on the subject I'd be very open to it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441835223322202152",
    "author": "Josh",
    "date": "2025-11-22",
    "content": "Made the mistake of eating Taco Bell at 1am and caught “you fucked with my head like a bleach blonde Bible verse I read while bleeding out on a Sunday afternoon” the next morning and what’s wild is that actually happened to the artist so here I am refining traumatic stories while fighting for my life",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447973646810353745",
    "author": "BananErMat42",
    "date": "2025-12-09",
    "content": "At the lowest point in my life this line by Young on At The Beach just got stuck in my head: Though my problems are meaningless\nThat don't make them go away\n\nIt’s such a succinctly deep lyric on so many levels. It somehow both points out a deep seated feeling of hopelessness, isolation, alienation, loneliness, frustration and dark humor, all in just 11 words.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471897274560024743",
    "author": "Will Melones",
    "date": "2026-02-13",
    "content": "Sounds like you might be into Pat Pattison’s book Writing Better Lyrics. It’s pretty hands-on, and if you do the exercises I’m sure you’ll get a lot out of it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472012041878241341",
    "author": "oaklandmatt",
    "date": "2026-02-13",
    "content": "And on that note, because I don't have a session today, I'm going to write a 30 minute song. I know it will be a bad or silly song. That liberates me to joyfully practice.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472776139452977224",
    "author": "oaklandmatt",
    "date": "2026-02-15",
    "content": "As I'm sure you already know , there is no such thing as enough. It's like how perfection doesn't exist. \n\nIt may be easier to think of being a writer on a spectrum from hobbyist to full-time artist. The one end is the hobbyist who does it whenever they want and have time (other priorities take precedent). The other end is the artist who is compelled to do it and it has to turn it off in order to live a normal life.\n\nMost people here are somewhere in between. For most of us, the key is to do a combination of two things:\n\n1. Find every way possible at all times to joyfully write. Direct yourself toward it with how live. Write silly things for fun, have a guitar you like to play next to the place you always like to sit, write emotional things for catharsis, write with other people for the collaborative joy, sing in the shower, write on different instruments that feel inspiring, etc etc \n\n2. The harder part is developing habits and practices that keep you consistent. It's easy to write when it's fun. It's harder to write when it's not fun, and that's the time to make sure you're doing it. Daily practices, schedules, deadlines (self imposed or otherwise) are the best way to do this.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827617449565487104",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "it's full of wisdom, fully of inspiration",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827627245124059176",
    "author": "Tony Chetta",
    "date": "2021-04-02",
    "content": "What are y’all’s thoughts on the producer in a write contributing to the lyric and melody?? And just how to know if your lyric ideas are any good? My write this morning was kind of a bust and as the producer in the room I feel like I probably should’ve tried to spark some concept and lyric ideas but I’m so unfamiliar with that side of things...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827638754876325968",
    "author": "Zack Hames",
    "date": "2021-04-02",
    "content": "My best way of learning theory was just by actually having a reason to use it. Just trying to learn broadly/abstractly is very difficult IMO. A project in school, I had to transcribe a 70s funk tune by ear, get musicians to come and play the charts, then record it authentically and recreate and match the mix. This has organ, horn section, guitar, bass, drum kit, background and lead vocals. I learned so much from that process.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831218401837711428",
    "author": "TALLL",
    "date": "2021-04-12",
    "content": "thats why if im stuck I will just sit down and try and make the cheesiest song I can make or try some genre I have never done before",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831484411613544478",
    "author": "Keegan",
    "date": "2021-04-13",
    "content": "I watched that Ed Sheeran documentary the other day and was really surprised/relieved at how casual the process of writing songs was in the film. I've never written with other people before, and from interviews (a Ryan Tedder one and a Rami Yacoub one come to mind) I got the impression that for people at that level the process of starting songs was more planned out and analytical than it seemed in that documentary",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831555145804152873",
    "author": "Josh",
    "date": "2021-04-13",
    "content": "One of the biggest let downs is realizing once you hit a certain level of skill/experience/whatever that the process is almost identical for everyone, they’re just a hell of a lot better than you hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831555506375753729",
    "author": "Josh",
    "date": "2021-04-13",
    "content": "When I was into metal I was super stoked to watch Will Putney breakdown a mix since he apparently never used samples, had this sacred ritual to his process, etc. \n\nThis man immediately says “here’s my three snare samples I’m layering and I’m stacking 3 limiters” and I immediately closed chrome and took a depression nap. We’re doing the same shit, he’s just better hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831625230827913226",
    "author": "Keegan",
    "date": "2021-04-13",
    "content": "It's that enjoyment aspect that was so surprising to me! I pictured professional songwriters approaching the process a bit like Jon does with individual moves while mixing: 'What do I want to accomplish? What tools will allow me to accomplish that?' There's a way that might come off as a bit formal and like you don't actually need any kind of enjoyment to go about doing that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851495917428277258",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I deal with (unintentional) inconsistent tempo and some time even time signature/pulse pretty often when working with songwriters and artists. It seems to solve the problem when you tap your feet to the melody. Then you would realize that the tempo has changed. And count 1-2-3-4 or whatever the meter is. So you don’t end up unintentionally having an extra beat because of words and disrupt everything else. A lot of writers ask people for beats first for this reason, but if the melody doesn’t stand on it’s own- relying on the beats will do more harm than good in my opinion. They often end up being mediocre melodies from my experience because there’s already tons of subdivisions and grooves in the beat and the topliner is relying on that to drive the rhythmic feel. But also beats need to come in with pocket so there are space for the vocal melody to fit in. It would be good for writers to start without a beat or instrumentals and it would be good for beatmakers to practice leaving vocal pockets when starting with a beat first",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860161400152653864",
    "author": "antoniohannamusic",
    "date": "2021-07-01",
    "content": "I totally get where you're coming from and obviously it benefits no one if there's 1000 links per day with no follow up.\n\nDon't know if this is a solution but could have set rules around it?\n\n*Limited posts per person (1 x a week?) \n*Must state intention in the post.\n*State genre in the post\n*No spamming, only DM people if you genuienly want to work with them\n*No posting work that isn't yours/ you don't have the right to open up to collab\n*Must delete your post once you find a collaborator - keep the forum clean \n\nSelfishly I want something like this so I could be like: \n\n\"Hey, got a new song I'm co-writing (Think Lauv meets PATD)  hung up on lyrics/melody/stuck on bridge (etc etc), DM to work on it (soundcloud link).\"\n\nInterested to hear your thoughts on how something like this could be implemented!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880520730582868048",
    "author": "oaklandmatt",
    "date": "2021-08-26",
    "content": "yeah if this is where your best songs come from, you should rearrange your creative process to only write this way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880520859339608074",
    "author": "Josh",
    "date": "2021-08-26",
    "content": "I can’t believe I’ve never thought about the outcome of different processes haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885000198726754384",
    "author": "alecdibell2",
    "date": "2021-09-07",
    "content": "@Zack Hames what is your current practice routine?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885004433040220180",
    "author": "Zack Hames",
    "date": "2021-09-07",
    "content": "No real routine other than Playing to productions I’m working on to a click. I play drums on projects a lot, and it just feels STIFF and not musical. Definitely a disconnect from like the kick and snare and the right hand keeping time on hihat/ride/whatever. \n\nI think Drum lessons would be the right call overall.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885202341257674782",
    "author": "Josh",
    "date": "2021-09-08",
    "content": "I’d focus on linear grooves, rudiments, and dynamics above all. Simple shit like 8-8-16 exercises with various dynamic changes will help you out a ton. Rudiments will help you understand how things like flams across a hi-hat and snare will have their place, and linear grooves will help you feel across the kit while also being hella selective and very minimal to your approach as far as writing drums go. The best drummers can overplay the fuck out of a song but choose not to because often times the simple things played extremely thoughtfully so much better. 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "899715708798259212",
    "author": "swarga",
    "date": "2021-10-18",
    "content": "That’s such a great idea. I always get stuck with vocals on produced tracks. Trying to put words on an existing theme is hard it turns out. I’ll give this a try! Do you record straight into a daw or voice memos and then import ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "977290432499314759",
    "author": "Zack Hames",
    "date": "2022-05-20",
    "content": "Broad question: how do you all push through a production that just isn't coming together? I am dealing with a client's track we produced a while ago and have done a ton of micro revisions and they want these big dramatic changes, leaving it up to me to figure out, which is fine, but I am just at a loss about moving forward. The inspiration, direction, just isn't there for me right now. Any tips?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983947024082804746",
    "author": "Zack Hames",
    "date": "2022-06-07",
    "content": "This is slightly off topic but I think the closest i can find:\n\nDoes anyone have tips for learning a lot of songs in a short amount of time? Not like 20 in one day, but like 6 in a couple days. It's not impossible but i want to try to maximize my strategy so i can walk into rehearsal and not forget parts.\n\nFor example - is it good to only learn a little bit at a time and nail it, take a break then come back? Learn something new then play everything again? Are there routines that are more effective for our brains memory? (hopefully this makes sense)\n\ncontext: learning bass for a live set for a band, I started learning yesterday, first of two rehearsals is tomorrow",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983960471428300870",
    "author": "Slow Hand",
    "date": "2022-06-07",
    "content": "As with a lot of a practice, it's not how *long* you practice, but how *often* you practice and challenge yourself.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990458763788038184",
    "author": "ehutton21",
    "date": "2022-06-25",
    "content": "So I’ve got a songwriting question, and I’ll tag @Slow Hand cause I’ve got a feeling with his teaching experience, maybe he knows (big love if you do have advice here man!) but I’ll see if I get any others with good advice here. \n\nDoes anyone have good resources or exercises to help educate a new artist on how to write a vocal melody? I can explain the specific details if necessary but I’ve found myself a little stumped to develop this technique in one of my newer artists. She’s an incredible lyricist with a great instinct and vision, and having her in sessions has really sparked the song creation process, but she’s really struggling to learn the “theory”/musical side of vocal melody and I feel like my attempts to coach by example aren’t strengthening her knowledge or confidence.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990551214108323900",
    "author": "ALXCPH",
    "date": "2022-06-26",
    "content": "This! 👆 learn a bunch of vocal melodies and apply what you’ve learned by making your own. Repeat 😇 \n\n\nSame process for pretty much anything, study, practice, apply, repeat.   😎✌️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1005916137583820852",
    "author": "Ross Fortune",
    "date": "2022-08-07",
    "content": "> have her learn classic songs and write a song a day for the next month or two. repetition in the process with a great musical diet. it is rarely more complicated than these two things\n\nDecided to give myself a challenge based on this - learning and writing a song a day for two months. Works out around 60 songs, so I'm building a playlist now. When I think of classic songs, my brains immediately goes to 60s/70s, so I'd love to get y'all's input on what you consider classic songs from any era.\n\nMade a collaborative version of the playlist here with some of the tracks I've chosen. Go nuts, please add your suggestions to the list!\n\nhttps://open.spotify.com/playlist/4n87RNhtFqFH6jubhNjG0h?si=e830e26efad7446b&pt=687952fa747c650079044e10be93b1fb",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1005933903493730314",
    "author": "Ross Fortune",
    "date": "2022-08-07",
    "content": "*follow up. I've just been having an amazing time flipping through existing spotify playlists with names like \"Classic Songs Everyone Knows\", and the Rolling Stone 500 Greatest yadda yadda. Whatever you think about Rolling Stone or these kinds of lists, it is a great jumping off point for going down all sorts of classic song alleys.\n\nI've filled my own playlist with far more than I need (though it's still a little thin on more recent songs, so please add to the collab list above), and the joy of this exercise has been finding song after song that I love with all of my being, and now I get to learn and sing them over the course of the rest of this summer!\n\nFor anyone interested, this is where I got to: https://open.spotify.com/playlist/1pLCs1BIIQGxHu5v2btVpw?si=982f99218b9543f7",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009589948443279633",
    "author": "youngteam",
    "date": "2022-08-17",
    "content": "i asked a producer friend lately what he thought he was best at and he replied \"finishing songs\" \n\nthis was pretty mind blowing to me and got me thinking that the same way we practice our instruments or production techniques, we can practice *finishing ideas*",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009812287722364958",
    "author": "Zack Hames",
    "date": "2022-08-18",
    "content": "I’ve finished a ton of songs for other people, producing, engineering, mixing, mastering. In fact it’s way easier for me to finish someone else’s music.\n\nIm talking specifically writing making music for myself - which I’ve done a ton of, written a bazillion songs, but I go hard and get to this unfinished point and have a hard time returning to the idea and instead start something new. The drive to finish out a half finished song is hard for me to come by. \n\nI’ve put out like 3 releases in a decade, but written hundreds and hundreds of ideas/songs. Im starting to get frustrated at the lack of finished work I can reflect on, so I’m trying to break that habit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058037703872098364",
    "author": "Zack Hames",
    "date": "2022-12-29",
    "content": "Also, writing / creativity is 100% a muscle that can be exercised. The more you do it, even if you’re not feeling inspired, the more you’ll feel it / the easier it’ll be continuing on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058038387468144850",
    "author": "Zack Hames",
    "date": "2022-12-29",
    "content": "Point is - it’s HARD to write a complete song every single day. REALLY hard. So even if you just practice making *something* Every day, you’ll get something out of it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058040743815553054",
    "author": "Deleted User",
    "date": "2022-12-29",
    "content": "Someone I know said he never gets writers blocks anymore because he started finishing every single thing he starts writing no matter what happens. What a G.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058146500615622817",
    "author": "Will Melones",
    "date": "2022-12-29",
    "content": "I had a text thread with a group of friends, and we would take turns giving each other a daily prompt and then share the results. Not always songwriting exactly, but stuff like “put yourself in the shoes of an inanimate object and free write for 7 minutes”.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061295853626720308",
    "author": "cy (sigh)",
    "date": "2023-01-07",
    "content": "in my exp you have to be v secure in what you personally like and also secure knowing when something works or not in context. \n\nit's definitely a muscle. writing with artists in the room and being good with constructive criticism are skills that help. \n\ni will argue that its mostly  based on trust though. if theyre asking that means they trust you (to an extent). book editors v often have a relationship with the author, sometimes solely professional but in most cases they develop into more longterm friendship. \nsame with poets. they often work in community and so a lot of exchanges happen. and the trust is built through that. \n\nif it's something you want to practice maybe ask some of the folks  you work with if they'd be open for you be in the room w them writing or try to suggest things to those you're  comfy with - making it clear that the choice is alwaya theirs. \n\nalso remember that most people are actually butt at taking criticism. especially with work that twnds to be personal, how you deliver the message os often more important than the message itself.  a bad critique closes more doora than a good one can open ime\n\nit may not be your thing but sometimes \"i think it sounds great\" is all they really need. \n\ni find that most edits have more to do with flow than anything. thwyre usually pretty settled on what theyre trying to say, juat not sure if it's translating outaide their heads. \n\nive changed 1 single word at times. and moat of the time its because theyre struggling to perform it properly.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069771530172629122",
    "author": "Deleted User",
    "date": "2023-01-30",
    "content": "I don’t write a lot (not including making tracks on a daw), which is why I started trying to write for only 15 minutes a day. I don’t do it every day and still I have more days I don’t than I do, but I was surprised how much I can write in 15 minutes. I try not to question how good it is at all. I just wanted to start a stress free habit. \n\n“Show up” is definitely a thing, but I can’t imagine songwriters sitting in an office alone for 8 hours a day and writing emotionally compelling songs. \n\nMaybe cowriting 8 hours a day or more is doable, because it’s more social and interactive.m",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075379392429178950",
    "author": "cy (sigh)",
    "date": "2023-02-15",
    "content": "there's no issue of you want to write it yourself but if it's not your bag you may just need practice. we all start somewhere \n but also no shame in leaning on friends or other folks you may know.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075379628950167582",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "honestly i think im really not good at writing the lyrics but maybe i just need practice eh",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075386842586828800",
    "author": "rae",
    "date": "2023-02-15",
    "content": "@OJ I agree with everyone else in that collaboration could be an awesome avenue! I tend to write songs lyrics first, then everything else and have only once or twice come up with chords/gibberish in place of words first and then worked out the lyrics later - when I was stuck i found walking around my house  for an hour just singing random lines to that pre existing melody I created and recording everything on voice memos to go through later helped a lot!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075398224623444008",
    "author": "rae",
    "date": "2023-02-15",
    "content": "Probably a dumb question but what would be the process of getting into a position where you are in these rooms?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075804056418799696",
    "author": "Ross Fortune",
    "date": "2023-02-16",
    "content": "That’s deeply awesome. I instated a routine of piano and singing in the mornings (keyboard lives in the studio, so I can’t do it before phone, but someday…) at the start of the year. I did it for a week and learned Hey Jude (I’m not a piano player, so it took me a few days to get it in the brain and the hands).\n\nIt was great, and I need to get back in the habit (sister act 2) for all the reasons you’ve described above. Thank you for the reminder!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075804241450516642",
    "author": "Ross Fortune",
    "date": "2023-02-16",
    "content": "(The habit, btw, got broken during an intense tracking and mixing period - this is just how my life is at the moment, so I have to roll with the punches)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076026728125841448",
    "author": "Nomograph Mastering",
    "date": "2023-02-16",
    "content": "I think positive incentives here around writing songs are really useful - learning, community, inspiration etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076491364251992154",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "As I've started something new its at 50 followers right now, my thought process isn't to have many followers/famous but its to have an online portfolio which people can view and hopefully the right things get attention enough where I can find people to collaborate with through this way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076509595914207272",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "Haha agreed. They are hard. I feel like I really just fly out quite generic lyrics. Do any of you do practices or something in the past to improve all that?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076712527037218816",
    "author": "masteredbyjack",
    "date": "2023-02-18",
    "content": "Hey Matt! Had a question…regarding all this songwriting. I don’t do it anymore, I just master but I am playing with a lot of these ideas applied to my own workflow…i.e. finishing things, focusing on my intuitive flow state…letting things just “come” to me.\n\nI saw you mentioned you’re applying the practice of scales/learning songs first thing in the morning, etc. I’m assuming that these things just “find” their way into your workflow when the time is right and you have grasped them.\n\nWhen you’re creating, how often are you actively trying to fit the song into some predetermined mold that you’ve set out? Or are you mostly just accepting what comes?\n\nI saw a great Bill Evans documentary where he said something along the lines of “just play what you can, and what you are, do not worry about if it’s complicated/advanced/etc…it’s more authentic to play something simple that you feel than something complicated just for the sake of it”…he was talking about jazz improv but I’ve tied it with much success into my work…when it’s time to go I’m only using things I know intuitively and not trying to force myself to be “better” than what I really am in that moment. I set aside other time to raise my skill set/potential with specific things (like scales, but for mastering haha)\n\nJust curious if this kind of stuff is on your mind and something you’re actively pursuing. \n\nI think it ties really deeply into the notion of “just write”…the skills and good music will come. \n\nBut your perspective is so valuable because you’re working on records with deadlines/commercial implications/expectations/etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121252536859492423",
    "author": "Deleted User",
    "date": "2023-06-21",
    "content": "Also like Ruairi said, “what to say” could come up as you have casual conversations with your writers. That’s how it goes sometimes. \n\nBut also as Ross mentioned, there’s a whole lot of other things you can prep that is more abstract or not directly related to what you want to say. Could be just chords, riffs, groove, song titles, or a visual prompt. \n\nI also found that the more I work and less life I have the less there is to say… Not saying that this is the case for you but if it is, might be a time to go watch a movie/documentary or read books to spark some inspiration",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121272882136371291",
    "author": "Deleted User",
    "date": "2023-06-21",
    "content": "Also imagine how many songs or compositions were given meanings after they were done or in the process of making",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139623951002239168",
    "author": "TrashDoggo",
    "date": "2023-08-11",
    "content": "I have just started my journey half a year ago, and I am aware that finding your own sound is a long process, but I'm hoping that one day I can step aside, look at my crafts and be satisfied with what I created and how I managed to create my own sound",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140190484246057022",
    "author": "rawssx",
    "date": "2023-08-13",
    "content": "Wow, that’s actually a beautiful practice to be honest, like keeping it real, Definitely have to try it out. Thank you soo much for sharing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153372407319502878",
    "author": "austenballard",
    "date": "2023-09-18",
    "content": "I meant like what was the process that led to that realization",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153380062058532905",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-18",
    "content": "I was gonna ask what your use case was, but if you’re sending out a lot of beats it make sense! \n\nWhenever you collect an idea/beat to go through later, conceptualize it as sending a package to your future self. If there’s too much noise, or if you’re banking on your future self to do too much heavy lifting or filtering, the packages will not be useful to you and it will be a waste of time. But if you have a strong use case and a system for processing it in the future, as it sounds like you have, it makes a lot of sense!\n\nPersonally I like to only save the things that inspire me in the moment - mainly because I know I will lose inspiration if I go through too many things that don’t resonate later.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153385754463064124",
    "author": "cy (sigh)",
    "date": "2023-09-18",
    "content": "recent switch for me but I used  to just have dozens (sometimes hundreds) of things just sitting.  now i work on building kits and presets and in the process end up making stuff with them or at least getting one or two melodies out of it. \n\nmy main issue is that I get to a point where I start getting different ideas that I wouldn't want together in the same song /beat /inst \n\nwhen I get to that point I'll try a bunch of those ideas and keep the ones I like. after anything sits on my drive for too long without me changing it I open sessions up and export them as multi tracks, Stems or a 2 track (any combination I like really) and keep  them in specific folders. \n\nI'll flip through some of those in sessions (on top of anything I mightve made for the specific session). after a while of those being there. I move them toa diff folder which is linked to to my cloud service and let's anyone I share the link with download (w general guidekines for use) that way friends and ppl I work with can use them in their sessions or for fun. \n\nstart a new batch of stuff and repeat this process. some things I'm more attached to (for one reason or another) I might keep  longer to try to work on or pitch but that's it. \n\nup until maybe 5 months ago my process stopped after exportingthe tracks /Stems and using them in sessions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153392977423642775",
    "author": "cy (sigh)",
    "date": "2023-09-18",
    "content": "yeah. I have time blocked into my weekly schedule for that. it's been great and even when I do have to make sounds from scratch or find one, I'm much faster at it so it's good practice overall for me. helps me not get into my head about the end result",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153472209495539785",
    "author": "Deleted User",
    "date": "2023-09-18",
    "content": "someone said something similar to me too, he never lets idea left unfinished because it developed him a mental muscles of never having writers’ block nor having trouble finishing an idea",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153750398520275074",
    "author": "austenballard",
    "date": "2023-09-19",
    "content": "wonder how that squares with how @Josh feels and what I just said. I love discovering something new to me but that's been around for a while; I think time-tested records are much better for inspiration than chasing whatever's on the charts",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156019239010967683",
    "author": "Nomograph Mastering",
    "date": "2023-09-25",
    "content": "You’re not short on the ability to write songs, you’re just asking more of the inspiration well than is normal. So juice inspiration",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156022687882285076",
    "author": "austenballard",
    "date": "2023-09-25",
    "content": "this is more or less what I've been able to get out of it. Inspiration. A good line here, a good idea there. It's not gonna write a whole song for me but I don't need or want it to. I want it to give me something that will give a little more \"juice\", a little spark for my synapses to run with",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156026613910229082",
    "author": "Nomograph Mastering",
    "date": "2023-09-25",
    "content": "You’re trying to find a years worth of inspiration in a week",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156029624883609690",
    "author": "Slow Hand",
    "date": "2023-09-25",
    "content": "Asking for Chat GPT to replicate someone's style in any convincing way is a massive lift to ask of it. Joni's style is emotionally insightful, nuanced, and witty. Her choices are informed by a lifetime of experience and point of view. It's almost ineffable at times. It feels like magic. Poetry is elusive. Most humans can barely do it themselves at that level. Asking these programs to perform at that level is... a lot.\n\nThere's a meme that I came across recently. It was the jazz saxophonist Chris Potter describing how in order to do what he does he has to be practicing at a level that is 10x beyond what he might actually play in a session. In a sense he needs creative and technical headroom to arrive at what the result that the rest of us witness.\n\nSome poetry follows this same principle. It's deeply, deeply ingrained and considered. The best poetry resonates and hints at things that aren't even explicitly mentioned. There's an iceberg of practice and experience beneath the surface of what we see. All Chat GPT sees is the surface. The final results that we're feeding it. It has no conception of the experiences that it's trying to replicate so it's approximations of something so complex and nuanced are likely to fall flat.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180865750626480278",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-12-03",
    "content": "Do you guys start a song with a title or do you wait for the title to be „discovered“ as you write a song? Like do you just start writing and then let the title just be a part of the process or even pick it out of everything you wrote after the fact?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182381027642064926",
    "author": "jonmatteson",
    "date": "2023-12-07",
    "content": "i’ve actually gotten rid of most of my template recently and it’s been a much more open way of creating. practice finding sounds you like and building sounds from stock synths/samplers and you can work in any daw or session!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182407580996337845",
    "author": "austenballard",
    "date": "2023-12-07",
    "content": "same for logic although as you know it’s a little more of a process",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188051412253417523",
    "author": "rae",
    "date": "2023-12-23",
    "content": "There’s def no right or wrong on how to song-write but I love hearing others perspectives and processes on writing 🥰",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188054994327457822",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "I think that is what I am after; How do you say the same idea or concept/story but deliver it tastefully. Just like the same E major chord could be delivered in different voicings and different style of playing or instruments even. \n\nMaybe it’s just about paying attention to it more. I generally pay more attention to music than words by default, so that might be a factor that plays into it. \n\nTechnically- with drums for example, you can use the same tools, try to play it or sequence it with the feel as close to it as possible, and break down what’s on it in terms of processing. If I go further, I can look at how the drums are interacting with the rest of the ensemble. If I just want to rip off the drums from a song, the first three will pretty much get me there. \n\nD’Angelo’s Voodoo is an album I constantly go back to study for the band interaction. Questlove is usually playing straight eighth notes, and very simple pattern. but how open the hihat is, and where he’s hitting, and when he makes the choices to pop the hihat out or kind of let it hide behind the instrumentation is very interesting. Perhaps subtle spontaneous decisions like that isn’t really replicable but I just take it in physically and try to see why he made this by looking at what other instruments are doing. You can just pay attention to how he plays hi hat and go wild playing just the hat along",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188283800589979649",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "those are great tips for exercises @cy (sigh) I’ll try them!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199445712681828525",
    "author": "jonmatteson",
    "date": "2024-01-23",
    "content": "Wanted to ask producers who also write with artist what their writing sessions look like? \nAre you preparing tracks before hand? Making stuff on the spot?\nSitting at the computer or sitting together with acoustic guitars beforehand?\nHow long are you hanging before you start writing?\nI find my hangs going pretty long especially on the first write with someone but that usually leads to better lyrical content. However I want to be more intentional with our time without it feeling rushed. \n\nI’m working on my flow and would love some insight into what other people’s process looks like.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199476568586715226",
    "author": "Deleted User",
    "date": "2024-01-23",
    "content": "I’ve tried different ways with hangs- I’m still figuring out. And I typically don’t touch lyrics anymore because I’ve found that I’m not that great at lyrics yet and if I don’t have a line (which I usually don’t….), it’s better to leave it be for the longevity of relationship because lyrics can be one of the most personal things in music making because… it is literal. If you are more lyrics person, I think you can get a lot of value out of hanging out. \n\nFirst thing is creating safe space- and it really depends on person to person. Some people never open up, some people can open up immediately. In my experience, the more experienced they are - the more they tend to be the latter. I think how much time you spend on it can be dependent on this. You mentioned wanting to be more intentional, one idea that came to my mind is communicating this from the get go. Obviously there are going to be times where bring this up can be weird in the beginning of the session, but it should get them to think about opening up as part of work at the very least. It needs to be done carefully of course\n\nThe other part of it is understanding the person themselves. Their general vibe and energy. It’s easier to tell with some folks, and it’s harder to know what kind of person it is with some other folks. regarding this, I find diving into work right away helps feel it out. my job is often to constantly create ideas and inspirations. I can often gather some information from how they respond to different ideas. \n\nLastly, I used to spend a lot of time hanging up until very recently and I found it’s so much more productive to just work and bond through that experience. Nature of work calls for connecting on a personal level, but it doesn’t require it. I’ve been trying to take it easy on getting closer with people, and focusing on the overall experience of collaboration and it has been making sessions more productive. So I plan on sticking with this way for a bit and see how it goes!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204959649741144074",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "I‘m not super experienced with writing to a pitch either so it was just a weird situation where the session just hit a brick wall numerous times bc we were so stuck by the confinements of the pitch the creativity just couldn’t flow \nI guess what you said aligns with what @youngteam said that writing a great song will always be better than writing something that sounds exactly like something else that came before",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204960687692976128",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "In this case it was a pitch for an established artist with specific references but yeah that makes sense. The problem wasnt even „we have to write an super amazing song“ it was more like the session and the inspiration coming to a halt because we were so unsure of the direction",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204962956165652500",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "I feel you. What you said a few days ago about the duties as a producer really resonated with me. Being a producer is so much more than just making fire beats. It‘s a about a responsibility to ensure the track lives up to its potential. Which can be very inspirational but also put a lot of pressure on you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222128718562988042",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "Doesn’t seem any less automated than using a DAW to compose midi -> a vst imo. Just another tool to speed up the process",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1226228370640081006",
    "author": "esquinalee",
    "date": "2024-04-06",
    "content": "Nothing to say other than to drop this little tidbit Toro y Moi posted. Seems like a useful method, anyone else have something similar that helps their process?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1238673677948551271",
    "author": "Slow Hand",
    "date": "2024-05-10",
    "content": "Here's a friendly reminder to write your song intros with intention and as early in the process as possible. I am once again writing the intro last and driving myself up a wall trying to make it all work.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275962457659015271",
    "author": "AJ",
    "date": "2024-08-21",
    "content": "I think @gatewoodsensei  gave a great answer. It mirrors my exact thought process. I'm very used to writing a bridge though. Trying to give myself permission to not write them too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280399563416403989",
    "author": "cy (sigh)",
    "date": "2024-09-02",
    "content": "I don't have a specific moment. I just make sure I practice writing regularly . muscle memory so to speak. \n\nand things will just come at any time into my head.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280399819973595218",
    "author": "cy (sigh)",
    "date": "2024-09-02",
    "content": "a good excercise if you don't have any constant practice is to write based on one sentence you overhear in the day. doesn't matter if it's from TV, on the bus or train just take one sentence and build your own world /context around it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287548759689134251",
    "author": "thegreatcarsoni",
    "date": "2024-09-22",
    "content": "I want to find a more constructive way to allow for the genesis of real song ideas, because we keep ending up with 4 to 8 bar loops of.......something, usually involving a flashy guitar riff. But i'm just not excited about that kind of stuff and I'd like to able to translate my feelings about music and what I want to make into a fun way to lead the session, rather than just telling him \"idk what to do with that riff\". i feel like we're on the verge of figuring out a formula but the whole process is an emotional drag and really tiring.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287560382415638549",
    "author": "thegreatcarsoni",
    "date": "2024-09-22",
    "content": "Love this, thanks so much. This has really been an exercise in getting me out of mixing brain as much as it is getting him out of guitar brain and start trying to orbit a song. Trying to make it less about us haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298254355111346226",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-10-22",
    "content": "i was wondering though if there are any acitivites/exercises one could do to light the creative spark again",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304786129358164058",
    "author": "whaleintown",
    "date": "2024-11-09",
    "content": "any suggestion on how would you hold an online writing session with an artist ? would love to learn the process of how it can be done and still getting a relatively good result.( sending files, email notes, facetime ?) Also could be nice to hear if the same can be done during production stage ? let me know your experiences !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354660204406636564",
    "author": "peterlabberton",
    "date": "2025-03-26",
    "content": "@oaklandmatt you and this place are both gems, thanks! I actually got hit up by an artist this morning to schedule something for this exact co-writing thing—that and this response are good motivation to keep after this avenue of work!\n\nYes, role so far has been sounding board/musicianship/engineering and mixing/producing/providing studio. I can’t remember the split but on the Suki song he did get a bigger cut. I got a production fee when it made the album and it all felt fair to me. It’s registered with a PRO.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356413580974751845",
    "author": "Brian Reynolds",
    "date": "2025-03-31",
    "content": "First most of what I'll have to say for this is built on the foundation of this course by Louis Bell of Post Malone, Halsey, and Justin Bieber #1 fame. In this course he spends hours going over exactly how he writes lyrics to his gibberish melodies. Then how he goes about pitching these ideas to artists. After he has 24k Goldn there for a few hours and they write another song to gibberish melody. And you can see how the process are alike and contrast. https://studio.com/classes/louis-bell/hitmaking-for-producers?utm_medium=paid&utm_source=google&utm_campaign=ws_studio_brand_louis-bell_us_phrase&utm_content=studio&utm_term=louis%20bell%20studio&ref=m&gad_source=1&gclid=CjwKCAjw-qi_BhBxEiwAkxvbkH_XdBqN7jbkwQK-0pisWV_MsC4-VSGH_iGfcL85MML5SoRwB01Q9xoCFl0QAvD_BwE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356430048395132999",
    "author": "OJ",
    "date": "2025-03-31",
    "content": "Basicallly as you said just practice like anything",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357591878664585217",
    "author": "spectrummasters",
    "date": "2025-04-03",
    "content": "….hey man , yeah what Brian said . A stem ripper . \nI didn’t want to say in my OG post much more so as to not bias a potential interpretation of Louie bells process , but what I was struck by was the simple brutal idea of just taking the proven best elements of others work as a foundation to begin building your own frameworks . \nWe ve spoken about it before in other channels with regard to using a  sample to write to and ditching it later , or reconstructing a track and letting it become something new …..I’d not thought of or heard of simply ripping hundreds of classic drums and taking them into a writing session before though . \nThere’s something so abrupt and utilitarian about that approach that I felt it might be helpful to anyone who is struggling with their own process , should they be trying to write all from scratch",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378679290429837452",
    "author": "Pio",
    "date": "2025-06-01",
    "content": "Late to this one, hope your songwriting journey is going great this past while! \n\nIf you’re still looking for more on this, and don’t mind a little reading, I was recommended Pat Pattinson’s Write Better Lyrics years ago and I found it a super helpful tool - I loved the recommendation of a 10 min a day exercise of ‘object writing’, and also the idea of thinking about your verses as a way of ‘loading’ story and fuel for your choruses. \n\nJeff Tweedy also has an even shorter but really uplifting book on writing called ‘How to Write One Song’, which is excellent. It’s more geared towards the personal, less towards industry, but I’m so convicted that writing personal songs IS the way to reach others that I would definitely recommend it too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378682999717236797",
    "author": "Pio",
    "date": "2025-06-01",
    "content": "And if you don’t wanna go buying books, I’d recommend possibly trying out the daily practice of object writing; you could even try it for a week or so, and you’ll end up getting interesting imagery, some of which you may be able to use in your songs - but if you stick at it a bit (I find if I do it solidly in the mornings for a week or two it just warms my brain right up for writing throughout the day) it can help get your brain into that mode, so that when you go into your writing sessions later, your brain is already making those connections. Just an option of course - everyone’s got their own way with lyric, it really is so personal. Whatever tools help, use em, whatever tools don’t, chuck em. \n\nI just mention these things bc you talk about making the songs ‘real’, and I feel that - I love trying to get a song to feel properly grounded, with a sense of place and reality. Best solution I’ve found is to just leave a bit of me in there - somehow it’s like people can feel when songwriting is ‘real’, so I just try to make sure my heart is in/behind each line, keep them smooth, rinse repeat \n\nWould love to crack open this topic again too, curious on more peoples thoughts on this stuff, thanks for opening this up  @OJ,",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1379857599436030142",
    "author": "Pio",
    "date": "2025-06-04",
    "content": "It is wild how freeing an exercise this is, I love this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1384999147958042826",
    "author": "Gabriel Tyranny",
    "date": "2025-06-18",
    "content": "Prompt for a fun question for the group: Is there a workflow that you’ve found to be a common denominator between your songs for how you write them?\n\nI’ve been writing songs for my current project by using a compilation of many notes, voice memos, journal entries, letters I’ve written then later converted to lyrics, etc. From there I used my current craft to sculpt them into each track that captures a theme, emotion, or something else that stood out to me.\n\nI often wonder how other active song writers put their finished pieces together. Is it as scattered as my process? Do they usually sit with an idea and write it linearly, line by line? A combination of things?\n\n\nI’d love to read other people’s processes and mindsets, if anyone would like to share.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385322000888758273",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "Very different from my process and yet makes complete sense. Priming yourself to create without overthinking or getting in your own way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385325146084212920",
    "author": "Josh",
    "date": "2025-06-19",
    "content": "I think the reason why the mixed practice/writing/track sesh is working for me is because it unlocks the childlike wonder",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1398735859381043343",
    "author": "Zach Hughes",
    "date": "2025-07-26",
    "content": "I think if this advice had been more ubiquitous in practice I would never have gotten into music",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399099641236033627",
    "author": "Nomograph Mastering",
    "date": "2025-07-27",
    "content": "Ideas I would strongly disagree with now got me out of various holes I was stuck in along the way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429126975053631568",
    "author": "Josh",
    "date": "2025-10-18",
    "content": "Recently tried to only use pen and paper after hearing lots of people say that phones are evil. Gonna start suggesting this to everyone that comes through because we didn’t get stuck once",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471653649741643906",
    "author": "revolution",
    "date": "2026-02-12",
    "content": "do you guys have recommendations on books or resources/practices that helped you develop yourself as a song writer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471655056104489033",
    "author": "revolution",
    "date": "2026-02-12",
    "content": "would love to hear the thoughts or philosophy of more experienced writers.. and full disclosure, the primary thing i need is to keep doing it and repeating the process; but some sound boarding and perspective never hurts!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472304065454149654",
    "author": "Will Trotman",
    "date": "2026-02-14",
    "content": "I assume the 30 minute song thing is just to keep the writing flowing daily and force yourself to not be precious and get *something* down? Curious what your perspective is on hitting an idea that does feel precious. \n\nI go in phases of enforcing a daily write like this (and need to do a better job of staying in it). But doing that sort of thing, I often wonder where the line is between \"you should try to beat this line or melody or come up with something you actually like\" vs \"don't be precious at any cost.\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472304124103229490",
    "author": "Jack",
    "date": "2026-02-14",
    "content": "And if I do commit it I start layering and it starts becoming an exercise in arrangement rather than songwriting. I try work horizontally, not vertically.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472553835649040439",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "thank you again, this community is invaluable and has helped me a lot in cutting through noise, over think, and taking simple and direct approaches to a lot of questioning i experience in the process of making. ❤️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]