[
  {
    "id": "1200603495351464108",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "I always tailor it to the artist in some way. It's a combination of making fresh ideas specifically for them and taking existing ideas that could work (sometimes reworking existing ideas). I never go into a session like an actual blind date where I don't know anything about them.\n\nThe challenge is always do I make something that sounds like what they've done, or do I make something that sounds like where they're going? That's impossible to answer. I've had success in major label POP artist sessions by having a 100 year old piano and specifically not playing tracks. Meaning, you never know if an artist is tired of doing the same shit. Because I have confidence in my skill as a producer, I'm happy to get an A+ ballad because I know I can turn it into whatever production I want. \"In The Name Of Love\" is my most successful example of this. It's an emotional 3 chord piano ballad that was produced into a festival EDM anthem. \n\nI've had the most success being prepared for all options. Mostly because that makes me flexible for what an artist is feeling that day, but also because the more stuff I make, the more music I'm making. If I prep for a session, I'm not working cold. The prep is also like a psychological and creative warm up for me. Prep makes me a better improviser.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "975885922614771782",
    "author": "oaklandmatt",
    "date": "2022-05-16",
    "content": "the answer largely depends on how A&R driven the project is. sometimes the A&R is really running the show (like with a young pop boy band or something) and sometimes the A&R doesn't really matter and the artist is the whole identity. \n\na VERY loose way i often think about it is like this: if you're going to lean toward the A&R, do it on the production, not the songwriting. every great song i've been a part of writing (and i mean literally 100% of them) have been about capturing an emotional moment or excitement that is happening in the room with the people in the room. if you start thinking about \"what does the A&R want the lyrics to be like?\" you're gonna lose that.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221433011405328465",
    "author": "oaklandmatt",
    "date": "2024-03-24",
    "content": "Ok this is one of my favorite topics ever.\n\nHappy to go deeper, but the gist is this: I believe people connect to the underlying emotion, even if their analytical brain isn't reading or understand the lyrics. If the emotion is authentic, the song has a MUCH better chance of connecting. Without that emotion, it is almost impossible. \n\nThe more I write songs, the older I get, the more I work with the greatest songwriters, the more I think that writing an authentic emotion is everything. \n\nA favorite example (I have 100 more, just ask): \n\nParty In The USA. Silly pop song? Or deep truth about the power of music being able to transcend loneliness? Go into the lyric and you realize it's Jessie J writing about her first time coming to Los Angeles: \n\nStepped off the plane at LAX with a dream and a cardigan... am I gonna fit in... everybody looks so famous... I'm feeling homesick, too much pressure and I'm nervous... but then my favorite song comes on the radio... I know I'm gonna be ok... it's a party in the USA\"\n\nTbh I tear up every time I think about this song. Yeah people might not analyze the lyric, but the reason this song will play for the next 50 years (and not the 1mil other simple songs about having a party) is the deep, authentic, universal emotion underlying the record.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "836022881028145192",
    "author": "joebegalla",
    "date": "2021-04-25",
    "content": "All of the Oliver splice packs have the best drum sounds for pop/electronic. They barely need any mixing. For hip hop/r&b I love Jimmy Edgar or Sophie’s splice packs. If you won’t more of a Frank Ocean style R&B drum sound, there’s a splice pack called “alternative r&b” that has killer stuff. Basically, splice is the best hahahah",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983961841573183508",
    "author": "samvalentine",
    "date": "2022-06-07",
    "content": "In addition to actually practicing and learning the parts I think it's helpful to really get to know the songs. Hopefully you have recordings to listen to. Pop those puppies in a playlist and listen when you're driving, cooking, exercising, etc.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261803179989798933",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "You're absolutely right that trying to copy existing hits rarely makes great songs. He's 100% correct on that point.\n\nI'm saying that songwriters often fall into the trap of trying to be \"original.\" They mistakenly think this means they should try to invent new phrases or not use \"generic\" words or try to do something \"interesting\" with the chords. Instead of doing the only original thing that is possible which is tell your story and express your taste. This is actually much more difficult to do because it's incredibly vulnerable.\n\nYou can compose fully original compositions this way. But it's also interesting how much groundbreaking music comes from direct appropriation of existing popular music. \n\nFrom folk music (\"Blowin In The Wind\" is a melody from another song) to hip hop (all of sampling) to producers and DJs making careers from remixes, playing around with current or past hits can also yield incredible new music.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "829067268910481409",
    "author": "antoniohannamusic",
    "date": "2021-04-06",
    "content": "Hey Matt,\nThank you for taking the time to come back to me and with such a detailed breakdown.\n\nI think of in terms of where I’m currently at, the \n\n#1 for me - released work is almost all band focussed; I probably spent the better part of the last 10 years recording rock, alt, pop punk, metal etc etc and only super recently even considered the idea that I could be a songwriter.\n\n#2 Makes loads of sense and is definitely something I will focus on in the immediate future - work with people I know and I like working with already, like even some of the artists outside their bands / solo stuff, I didn’t even really consider hitting up my favourite clients for this as I assumed (and have been met with hesitation) most bands don’t like the idea of having someone come in and “write their songs” but this approach seems way more achievable I.e just hang out and write something!\n\n#3 the struggle haha! Unfortunately being in London almost 100% of my work has been remote, I’ve found myself tracking drums, bass, vocals, trumpet etc all using AudioMovers and while it’s great to finish projects I agree with you that it’s way better to do any or all of the above in person.\n\nThat said maybe the cold call/ intro is more like a “hey, here is some of my stuff, let’s jump on a zoom call, if you don’t hate me in the first 30 mins come hang at the studio for a day” \n\nThat all said, if anyone on here wants to jump on and do a session hit me up 🤣\n\nThanks again Matt, even more keen to push forward now!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842440412672032779",
    "author": "oaklandmatt",
    "date": "2021-05-13",
    "content": "well that's the magic formula for a certain kind of pop song: every section is good enough to be a chorus",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178408050089009334",
    "author": "chrissorem",
    "date": "2023-11-26",
    "content": "Good point! Pop culture has changed drastically and is moving at record speeds. And there seems to be two categories. musicians/bands and entertainers whose specialty is music.  I often think the world of speed dating song writing is not a great catalyst for writing  a great song.  Not that it can’t happen but the structure generally leads to mediocre songs that are written in forms we can predict.  I do miss the arch of a well written song with melodies give me chills and a bridge of that breaks my brain.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1329520066705756180",
    "author": "Chad Rodgers",
    "date": "2025-01-16",
    "content": "Hey homies. Has anyone run / been to a songwriting camp before? And if so what worked particularly well and what would you avoid? Thinking of hosting something here in the north east of England just to get a bunch of talent in the room making cool stuff in the pop realm for 4-5 days or so. In talks with a funder now who’s keen to sponsor it, so just need to hatch a plan.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357039395701784867",
    "author": "spectrummasters",
    "date": "2025-04-02",
    "content": "Came across this , Charlie Handsome , describing Louie Bells process for Posr Malones F1 writing \n““Louis [Bell] was involved in the writing and production, and he recorded Post’s vocals. I think he’s done that for nine years now, and they have their routine. And Louis is good at creating libraries. At the beginning of the project he AI‑ripped the drum beats of tons of classic country songs. He had hundreds of them. So while I was doing the music, he would go, ‘What tempo are we at?’ I’d say ‘135’, and he’d have 50 drum grooves that work at 135 bpm. There was this huge catalogue of ideas we could aim for,”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860618335967641601",
    "author": "chadwahlbrink",
    "date": "2021-07-02",
    "content": "Quote time \n\n“Instead of saying, “I’m stuck, I can’t come up with anything good,” it’s far more effective to say, “I’ve finished this, and now I need to make it better.” Or possibly, “I finished this, and it can’t be made better, but now I’m ready to do the new thing, because look at all I’ve learned.” \n\nThis is the story of every human innovation. \nThis is the story of every good idea, every new project, every pop song, every novel. There was a bad idea. And then there was a better one. \n\nIf you want to complain that you don’t have any good ideas, please show me all your bad ideas first. \n\nBefriending your bad ideas is a useful way forward. They’re not your enemy. They are essential steps on the path to better.”\n\nChap 167 of “The Practice” by Seth Godin.\n\nI feel like this is very in line with getting better at all of the creative crafts out there! \n\nSub in “Show me all your bad hooks” or “show me all your bad mixes” and you are headed in the right direction.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876215060844916746",
    "author": "Rob Domos",
    "date": "2021-08-14",
    "content": "I’ve been trying to solve this puzzle and I have a working theory that the goal is to meet people’s expectations in a way that they don’t expect to have them met. Like for example: If I hear a melody in my head, rather than singing the next note I hear in my head, I’m trying to sing a related note, like a a 5th below or a third above or pop the octave on that one note or something so it still goes where they expect it too harmonically and tension / release wise, but it surprises them melodically",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222133588691255366",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-26",
    "content": "I think the idea of this dichotomy „manufacturing“ a song and writing from the heart is a very interesting topic to talk about\nPeople have been painstakingly constructing pop songs before melodic math was a thing (think any ABBA/ Hall & Oates hit) while others are purely intuitive",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1413261882495733781",
    "author": "Juliette",
    "date": "2025-09-04",
    "content": "I finally reached out to an artist (who’s also a friend but more so a great soul in the scene) that I’ve wanted to collab with forever— I was pretty scared at thought of her saying no and so I never took that chance — but she was honored and she said yes. We’re going over tracks this week and I’m so stoked to see what we’re going to put together. \n\nIt makes me wonder how many collabs are just a matter of asking rather than being afraid to take the chance. I know it might get a little more nuanced depending on if a label is involved, but it feels great either way to write something great with someone you admire. \n\n(lol, edited bc i accidentally didn't finish typing)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417225387825561791",
    "author": "Brian Reynolds",
    "date": "2025-09-15",
    "content": "\"The truth is you could slit my throat\nAnd with my one last gasping breath\nI'd apologize for bleeding on your shirt\"\nTaking Back Sunday\n\nI still remember walking into Hot Topic and doing what I always did. Walked directly to the headphones, that had 6 CDs loaded up to choose from listening. Drawn immediately to the NJ Parkway signage and a sticker that said, \"If you like Thursday and New Found Glory\". Hit play and I was all in from second one. \n\nThe lyrics and especially the one above I couldn't get enough of on this record. They are so visceral and clever. \n\nThe imagery of having you neck slit is like horror and action movie territory. But here it is in an angsty punk rock song about lost love. \n\nStarting the line with \"the truth is\" somehow enhances the line slit my throat. Its great storytelling.\n\nThen to top all the clever with the killer line of all killer lines. \"I'd apologize for bleeding on your shirt.\" The painful self awareness that somehow thru it all, your devotion remains. Youre still deferential to your tormentor.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876209743818006599",
    "author": "Rob Domos",
    "date": "2021-08-14",
    "content": "Yeah I think there’s a lot of validity to everything you’re saying. For context, to other people here Josh and I were in Atlanta two weeks ago writing on a record together and found out we have opposite things that we value. I like my shit hyper predictable like “we will rock you” from queen so it’s easy to listen to and easy to remember. Josh really likes things with loads and loads of expressive variance. \n\nTbh I get negative feedback all the time about my stuff being too predictable and kind of have the same self-questioning that you’re experiencing in the opposite direction. I really feel like I need to be able to write more with allowing room for human expression even if it breaks pattern  and especially if it breaks expectation in an impactful way.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069761248310345899",
    "author": "ehutton21",
    "date": "2023-01-30",
    "content": "Like honestly, it’ll sound crazy to some (or maybe it won’t), but the way high level melodic hip hop artists write has always been the most consistent and accessible method I’ve found when applied elsewhere. The other strategies may work pretty well, but I have more ability when I focus on the flow.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153936486169845761",
    "author": "rae",
    "date": "2023-09-19",
    "content": "i feel like im in a huge input phase atm, i havent created as much lately as id like to but ive been listening to heapsssss of new music from artists that aren't on the worldwide stage yet - i'm super influenced by uk rock music so i tend to listen to whoever is on the lineup for other artists i like in that scene and oh man some of the stuff coming up atm is amazing. also, on consuming as much as you put out: i have a spotify playlist which i add any reccomendations that friends give me or stuff that i stumble across so when im working out, on the way to work, cooking etc. i just have it going in the background and if something sticks out then i'll make note to listen deeper to it another time",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221436691387125770",
    "author": "oaklandmatt",
    "date": "2024-03-24",
    "content": "Uplifting music as an escape from depression & loneliness & oppression is a HUGE theme of humanity. From Avicii to disco in the 70s to early black American slave/ gospel music.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242449455815458917",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-21",
    "content": "https://music.apple.com/at/album/open-country-joy/298144082?i=298144259 the long silence after the intro jam makes what comes after 1000x more effective",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304263718883819591",
    "author": "oaklandmatt",
    "date": "2024-11-07",
    "content": "Yes x1000\n\nStudy the best things, even if they don't always seem to apply directly to what you're doing. \n\nMax Martin is maybe the best at making vocals sound A+. He is well known as a detail oriented, vocal-focused pop savant. He is often a part of every choice from writing lyrics and melody all the way to adjusting sibilance in the mix. His instincts for great melody and rhythm, paired with lyrics that sound good, is unmatched. And I say \"sound good,\" because though I think many of the lyrics of his songs are meaningful (especially with the best lyric co-writers), the choice of words and how they are emphasized and enunciated is what separates him from everyone else. It's like Michael Jackson. \n\nDo some YouTube searching on artists talking about working with Max Martin. You can learn a LOT about writing vocal from him.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399480740173058048",
    "author": "Will Melones",
    "date": "2025-07-28",
    "content": "I haven't watched, but I attended a similar sounding Ralph Murphy lecture around that time and bought the book shortly thereafter. I think we should recognize that Ralph was doing a statistical analysis. He studied the apex of then-current Billboard charts, set aside everything else, filtered songs by specific characteristics, and drew connections. There's something to learn about the pop music audience. Not sure I choose to look at his \"laws\" as a set of rules.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827633230777024513",
    "author": "Rob Domos",
    "date": "2021-04-02",
    "content": "1000000000000% this. You make what you listen to. Full stop. To help with this, I made a playlist that only has the biggest songs of all time. The songs can’t just be number ones, they have to be top 20 of their decade OR be the most iconic of songs from the most iconic of artists (we will rock you, Billie Jean, etc) \n\nI stacked that playlist up to about 7 hours worth of songs that were that massive, and only let myself listen to that for a long time and it super transformed my writing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831213090683093072",
    "author": "Josh",
    "date": "2021-04-12",
    "content": "I used to get really frustrated and give up but now I’ll just try off the wall shit and see what works. Rock song with a dnb beat in the pre? Let’s try it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835983628328239203",
    "author": "Zack Hames",
    "date": "2021-04-25",
    "content": "Production question, hopefully fits close enough to songwriting:\n\nDo y’all have recommendations for electronic drum samples?\n\nI’m wanting to expand my drum sounds for pop / rnb / hip hop / electronic anything. Last few years I’ve mostly used a korg electribe drum machine which has been awesome, but I feel like expanding a bit, maybe getting away from hardware. \n\nI don’t love the default sounds on battery, but I love battery as a sampler. The thing I like about the korg is the sounds are plain, and then I adjust with FX and pitching and attack/release, whereas battery is “finished” sounds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842444273378000906",
    "author": "Josh",
    "date": "2021-05-13",
    "content": "I’ve been thinking a lot about how pop music is supposed to be easy to sing along to. So I def have the advantage here considering I play auto tune like an instrument with my flat ass voice. Now I just gotta do it all way better hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855592558620180540",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Look at all the edm and hip hop hits",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855594964968276000",
    "author": "David Fuller",
    "date": "2021-06-18",
    "content": "it's straight up a blues",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "858192358013534209",
    "author": "Deleted User",
    "date": "2021-06-25",
    "content": "@whereisstarrah looking for singer songwriters.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "874668818235011133",
    "author": "oaklandmatt",
    "date": "2021-08-10",
    "content": "depends what we're talking about. if i'm writing with an indie band, we cross the business bridge when we come to it because i'm a co-owner of the songs we make. if they want to use the songs, we have to come to an agreement at some point and it always sucks talking business while trying to be creative.\n\nif an unsigned band wants me to produce existing songs, there's an agreement before we start.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876216271027454032",
    "author": "Josh",
    "date": "2021-08-14",
    "content": "That makes a lot of sense. Like I’m a freak about keeping 80% of what I write predictable just so those little moments really pop out more. And like the arc of the song and how the dynamics fluctuate to give into the theme are like everything to me. I guess I sorta look at every little piece as an extension of what I’m trying to say.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035071416963432552",
    "author": "ehutton21",
    "date": "2022-10-26",
    "content": "Bridge is the most important part of a good pop song, IMO",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058038205544419328",
    "author": "Zack Hames",
    "date": "2022-12-29",
    "content": "Things I do:\n-Try to write all the music for a song in a day (full structure, verse, chorus, bridge, etc)\n\n-write all the lyrics for a song in a day\n\n-write a chorus or a verse with music and lyrics together\n\n-make a beat or something electronic or pop based\n\n-write completely removed from a computer\n\n-make a drum beat first and jam over that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064649135774507068",
    "author": "Deleted User",
    "date": "2023-01-16",
    "content": "haha making kids trap  and having “weed queen” and “I’m having too much sex blues” as top 5 track on spotify on artist profile. That’s pretty wild 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075426773531119748",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "Hmm, probably the likes of @BatMeckley and co could speak to this too, but the social skills ain't always the thing.\n\nI've been in rooms with shy/quieter people who are just incredible at what they do. In one case, on a very high profile session, one of the beatmakers literally didn't speak to anyone, ever. He was 19 at the time, literally only opened his mouth to very politely ask me for my email address so he could fly the beat into Pro Tools to cut vocals. But he was making absolute fire, and even though he didn't speak, you could feel a good vibe off him.\n\nI've also been in rooms with *unbelievably* obnoxious characters (the occasional particularly unpleasant example of that LA type we were discussing recently). Utterly repugnant as people, but their work is undeniable.\n\nI know who I prefer to be in a room with (and that really does count for a lot, in my experience), but in the speed dating world of pop music writing that a lot of people go through, you get all sorts. \n\nNot everyone is super charismatic of course, but that's just the world. Either way, 90% of the people I've met at the highest level are really delightful.\n\nAlso, my experience has been that the more accomplished the artist/writer/producer, the more lovely they've been. They've got nothing to prove, and perhaps at a certain level, anyone who's not truly undeniable has already been filtered out of those rooms by being a jerk on the way there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075458072006369341",
    "author": "BatMeckley",
    "date": "2023-02-15",
    "content": "This is very much a thing.\nDo you think “I want it that way” makes any actual sense?\n\nA significant chunk of chart topping pop music of the last 20 years is written by someone who English is not their first language. They’ll rough out the right sounds and syllables and hope that a topliner down the line will meld that into something that makes sense. Sometimes that doesn’t happen and the nonsense lyrics inadvertently stay in the song and some random artist sues them claiming that their stream of conscious nonsense was actually stolen from the carefully crafted lyrics of their garage band that no one’s ever heard of (true story). \n\nAlso, you can be eccentric in a songwriting session… (I’m wondering if that 19yo quiet genius was a Canadian phenom cause I’ve had that EXACT same experience) but don’t be a dick in a session. Those guys never last.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076509267160485908",
    "author": "austenballard",
    "date": "2023-02-18",
    "content": "+1 for video call sessions, they're totally doable. It's worth figuring out how to route your DAW and microphone both into Zoom/FaceTime/Google Meet.\n\nOr just write old-school with a piano/guitar and your voice. Obv not practical for all genres but perfectly fine for pop, country, rock, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121198024543182918",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": ".... I'm not anticipating this being a country project at all, but I do like him",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153371651535294625",
    "author": "austenballard",
    "date": "2023-09-18",
    "content": "in my case I'm talking pop and hip hop, 2-3 minute songs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156018615380873246",
    "author": "Nomograph Mastering",
    "date": "2023-09-25",
    "content": "Legends, folk tales, classics, Shakespeare, mythology etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156025927017447444",
    "author": "austenballard",
    "date": "2023-09-25",
    "content": "@Nomograph Mastering shakespeare + I'm a teenager + I like country music = that one for midsummer is my next demo",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1157452976839983224",
    "author": "Deleted User",
    "date": "2023-09-29",
    "content": "Anything that has to do with 4chan, I try my best to avoid. But sometimes when I go on mystery rabbit hole, they inevitably pop up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180941203915681863",
    "author": "Josh",
    "date": "2023-12-03",
    "content": "My one country friend keeps a list of clever song titles since the genre is all about double entendres. I really don’t bother with titles personally.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188054994327457822",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "I think that is what I am after; How do you say the same idea or concept/story but deliver it tastefully. Just like the same E major chord could be delivered in different voicings and different style of playing or instruments even. \n\nMaybe it’s just about paying attention to it more. I generally pay more attention to music than words by default, so that might be a factor that plays into it. \n\nTechnically- with drums for example, you can use the same tools, try to play it or sequence it with the feel as close to it as possible, and break down what’s on it in terms of processing. If I go further, I can look at how the drums are interacting with the rest of the ensemble. If I just want to rip off the drums from a song, the first three will pretty much get me there. \n\nD’Angelo’s Voodoo is an album I constantly go back to study for the band interaction. Questlove is usually playing straight eighth notes, and very simple pattern. but how open the hihat is, and where he’s hitting, and when he makes the choices to pop the hihat out or kind of let it hide behind the instrumentation is very interesting. Perhaps subtle spontaneous decisions like that isn’t really replicable but I just take it in physically and try to see why he made this by looking at what other instruments are doing. You can just pay attention to how he plays hi hat and go wild playing just the hat along",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217999183466991708",
    "author": "Slow Hand",
    "date": "2024-03-14",
    "content": "Yup. Big jazzer. He picked up guitar around that time and was writing a lot of country/beach boys-esque stuff with the rest of our roommates as well as a lot of technical Deerhoof-y stuff in a band called Celestial Shore (good album, btw!).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221180463314632766",
    "author": "Jonathan Arnold",
    "date": "2024-03-23",
    "content": "(I am mainly doing pop, rock, singer songwriter)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242485472958091264",
    "author": "AJ",
    "date": "2024-05-21",
    "content": "Really appreciate the examples here! Definitely makes me feel better about contemplating this choice. \n\nThe links do provide a follow up question though. Would y'all say genre makes a difference in the answer? This song is more in the pop direction compared to the links/other examples I found. In case the implementation provides a better answer, it's two small moments that last 1 second each. \n\nThe answer could easily be that I'm overthinking it, it doesn't matter that much, and that I should trust my instinct here. I've gotten a lot better at trusting my artistic vision, but I'm definitely not immune to overanalyzing things.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242669325576310784",
    "author": "rae",
    "date": "2024-05-21",
    "content": "Def go with your gut!! I love silences in songs and when I’ve heard this technique in recorded tunes it’s predominantly been in indie rock tunes from bands like The Strokes and Catfish & The Bottlemen & they have a pause for like a bar (i can find the songs where they do this if you’d like, can’t remember them off the top of my head haha). \n\nAlso, it’s becoming a thing in live performances too!! There’s a whole heap of vids on tiktok of Olivia Rodrigo, Maddison Beer & I think Taylor Swift too where they are doing a ‘mute challenge’",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261769772903956550",
    "author": "jonmatteson",
    "date": "2024-07-13",
    "content": "I’ve been listening to that podcast “the history of rock and roll in 500 songs” that you posted a few weeks back and it was so interesting to hear that in the 40’s and 50’s it was completely normal to record the same song over and over again. Some bands only used one chord progression and would occasionally change the words or melody and they would consistently get #1’s off the same formula. Many bands would also cover other people’s songs and they would be hits as well.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291877326019104811",
    "author": "oaklandmatt",
    "date": "2024-10-04",
    "content": "Chilly is great. Love his work on Daft Punk too. Not putting him down. I think the clip is not saying what it appears to be saying about lyrics",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324815186938429471",
    "author": "SoundsLikeJoe",
    "date": "2025-01-03",
    "content": "Do the songwriters get paid to create those demos?  No...  but they often PAY OTHERS to help them make the demo possible.  Nashville folk will often have \"Demo Days\" where a group of Ace players charge a flat fee to perform and record the rhythm section (for instance, could be anything the song needs). They might record 5-10 tracks in a day. I'm sure some have done more. These \"demo day tracks\" are used by songwriters to then pitch their track to recording artists, labels, anyone.  There's also a whole army of producers ready to help songwriters demo-up...  where the songwriter pays a producer to turnkey the track.  Sometimes it's one guy playing everything or a few remote players all chipping in under the producers direction.  \n\nAnd...  these are viewed as a \"very basic demo\" in the eyes of industry vets. A really good \"one take\" by great players with high quality equipment recording the basic tracks is a strong demo but not fully produced. Happens all the time, but the producer (and their team) gets paid by the songwriter (or their team) to produce the track.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324835054970601565",
    "author": "SoundsLikeJoe",
    "date": "2025-01-03",
    "content": "American Hip Hop and Pop are much more \"single producer\" centric too.  Even then...  there's often a team of people behind the curtain.  I know a gospel keyboard player that does A LOT of top-line ghost writing for big names in Hip Hop.  On the surface it LOOKS like a single producer, but there's a group of people helping behind the scenes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356429030399938752",
    "author": "OJ",
    "date": "2025-03-31",
    "content": "Oh sick yes I've seen this pop up and the Ryan Tedder one before always meant to check them out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357495132324233258",
    "author": "Brian Reynolds",
    "date": "2025-04-03",
    "content": "No, I read it as. He sifted thru hit country songs for a few days. Used an \"AI\" stem splitter. And then complied just the drums into folders based on tempo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1398608990325182566",
    "author": "Ross Fortune",
    "date": "2025-07-26",
    "content": "This lecture by country writer Ralph Murphy has been giving me food for thought. He had hits in the late 70s / early 80s, and this lecture is from 2012. I’ve been thinking on how relevant his claims are today.\n\nhttps://youtu.be/8wBOUJ5Mbrk?si=eCKE3cJ9dC302gnd\n\nWould love to hear thoughts from the crew on the central statements he makes, all in the first 45 mins or so. He’s referring specifically to hit songs - we’re not talking about Nick Drake here.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1398744128162107495",
    "author": "Slow Hand",
    "date": "2025-07-26",
    "content": "Taken to the extreme you can end up with the kind of bland late mid-2010's pop music in which everyone is emotionally aloof, \"haters aren't gonna break my stride\", and the narrator is emotionally bulletproof. It rarely engages in any sincere vulnerability or deep self-reflection. Sia, Taylor Swift, or a few Demi Lovato songs come to mind.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405934537938174033",
    "author": "Johnny I",
    "date": "2025-08-15",
    "content": "Working with a singer songwriter on a 4 song EP. The songs they want to record are all in G (with G as the home chord) and work well with their voice/thematically together as a whole.  \n\nIn a situation like this, would you suggest trying a capo to shift some of the songs into a different key (if it fits their range)? Or just treat every song individually and if they work best in G, roll with it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412533166605865030",
    "author": "Josh",
    "date": "2025-09-02",
    "content": "I’ve been attempting to enjoy country music. Gave a listen to Quit!! by Hardy and I think I finally get him. He really is just talking at me, telling me his stories, and now I need to embark on a new side quest.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412533308868268093",
    "author": "Josh",
    "date": "2025-09-02",
    "content": "Being mostly rock based has led me to lots of sessions about nothing. Texture writing if you will.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472629486615789760",
    "author": "austenballard",
    "date": "2026-02-15",
    "content": "anyone ever written a mass? i used to have this dream when i was little of writing a mass with electronica like a brian eno mass or something, and i just remembered it today\n\ni want to do the full tradcath format too, not like a modern protestant rock mass",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]