[
  {
    "id": "1200522135244914768",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "If you're trying to be a highly successful professional, you should do all of these things and be prepared to adjust on the fly.\n\nI pretty much always have full songs, tracks, hooks, and concepts prepared. Much of the time, you won't use any of them on any given day. But good news: they're useful for future days.\n\nI've had all of that prepared and then the artist and I just chat for five hours, then write a song on a piano.\n\nI've had all that prepared and then cut song after song because the artist goes \"what else do you have???\"\n\nAnecdote that might be helpful: I've been in with an artist all week. Me, another producer/writer, and her. The other producer/writer has his rig set up and he also writes topline. We usually bounce back and forth depending on what the song requires. We've all worked together before and we had the whole week blocked out so there's no pressure to perform on day one. But we did three songs on the first day because she just came in firing. The first song she came in with a title and we worked from scratch and knocked it out in an hour. The other producer made the track quick with some existing drum loops he had prepped for her, adding keys and horns as we wrote. Then she asked \"do you have anything to play?\" I played her a track hook I had prepared. She liked it and we powered through that one in another hour. Then we broke for lunch. We caught up. As we were finishing she mentioned this one kinda stupid and sassy idea she tried to bring into another session but the producers didn't like it. So we wrote that one and it was fire. I tapped out a tempo as she rapped the hook idea and just make a skeleton beat on the fly.\n\nBeing way over prepared is rarely going to hurt you.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075789852584444075",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "Some songwriting-related morning routine thoughts:\n\nI've been starting my day with doing piano scales and vocal warm ups to a metronome and then singing/ learning a song and recording a voice note of it. (recently it's been Tom Petty Wildflowers at the piano). Then I look at my phone and start my day.\n\nHard to know for sure if it's causal, but my songwriting abilities have sped up. I'm quicker in sessions, both with topline and tracks. \n\nI think it's related to several aspects of the morning routine, and they all compound. \n\n*I'm playing music before I'm on my phone, so I'm outputting music before my brain starts reacting.\n\n*doing scales w piano and voice opens up my vocabulary on both instruments and makes me much more comfortable to sing/play ideas when writing\n*doing these to a metronome has improved my timing on all instruments (not just piano and vocal)\n*learning a great song and singing it every morning has massively improved my lyrical writing/ improvisation (probably the hardest part of songwriting) by just reinforcing good *sounding* words.\n*singing and recording the same song every morning for a few days or a week makes me really THINK about vocals and vocal production. How I'm singing the words, how to push certain vowels in a certain part of my voice, etc \n\n@Slow Hand  @Ross Fortune @Will Melones @OJ",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1076849791700574228",
    "author": "oaklandmatt",
    "date": "2023-02-19",
    "content": "Yes exactly! I've found that the best songs are never calculated, they're always just felt as they're being created. They are magical/ incalculable moments. As soon as people start analyzing – \"is this too generic?\" \"maybe we should have a part like **insert artist**\" – the songs loses its magic.\n\nBut the paradox is that you can't  just sit around and wait for them to happen. You have to be in motion. So often times building habits and processes (which are calculated) is a great way to keep oneself in the motion of creating things. Piano scales, learning songs, writing a song a day, etc., are just some of the many ways to do this.\n\nAnd the other aspect is also correct. These are skill building exercises that help the quick translation of creative ideas. It's the emotional and psychological side of workflow. Just like technical workflow – where you want the shortest time between idea an execution – same goes for writing. If you are constantly writing lyrics and singing melodies and playing instruments, when that emotional magical idea arrives, you can translate it more quickly into lyrics, melody, and music.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200603495351464108",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "I always tailor it to the artist in some way. It's a combination of making fresh ideas specifically for them and taking existing ideas that could work (sometimes reworking existing ideas). I never go into a session like an actual blind date where I don't know anything about them.\n\nThe challenge is always do I make something that sounds like what they've done, or do I make something that sounds like where they're going? That's impossible to answer. I've had success in major label POP artist sessions by having a 100 year old piano and specifically not playing tracks. Meaning, you never know if an artist is tired of doing the same shit. Because I have confidence in my skill as a producer, I'm happy to get an A+ ballad because I know I can turn it into whatever production I want. \"In The Name Of Love\" is my most successful example of this. It's an emotional 3 chord piano ballad that was produced into a festival EDM anthem. \n\nI've had the most success being prepared for all options. Mostly because that makes me flexible for what an artist is feeling that day, but also because the more stuff I make, the more music I'm making. If I prep for a session, I'm not working cold. The prep is also like a psychological and creative warm up for me. Prep makes me a better improviser.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990776963394326528",
    "author": "Slow Hand",
    "date": "2022-06-26",
    "content": "Depending on the kind of wall that you’re hitting with her, there are a few simple approaches that you can suggest that will get her thinking about the different dimensions of melody and how to play with it:\n\nA) Expansion - How long is the melody? It is a small fragment, or a full sentence? Stretch it out over a longer period of time. Sing it half as fast. Hold certain notes for emphasis.\n\nB) Diminution - Compress parts of the melody into faster runs. Make it shorter. Remove notes. Simplify the melody to its melodic essence.\n\nC) Repetition - Take a fragment of the melody and play it again. And again. And again.\n\nD) Modulation - Take a melodic idea and transpose it to different keys. The first movement of Beethoven’s 5th Symphony is built entirely off of a simple four-note motif. He got a lot of mileage from such a small element.\n\nE) Dynamics - Play with volume or intensity. Encourage her to go from soft to loud, or loud to soft. Accent certain notes for emphasis. This one is really powerful. For inspiration suggest that she try voicing her dynamics like a great horn player might. Get her to clip her notes very short or to make them “bloom” or be soft and round. Make them bark or be breathy.\n\nF) Be Another Instrument - Encourage her to try writing as another instrument with her voice. Sing a bass line. Sing a horn part. Sing percussively like Michael Jackson or James Brown would.\n\nG) Role Playing - Give her a character and a persona to inhabit. Make her sing the same thing as different personalities or people. Pick a melody and then make her sing it in the style of three singers that she’d know.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328101073243607061",
    "author": "Slow Hand",
    "date": "2025-01-12",
    "content": "Apropos of nothing, this is still one of the best $20 I’ve ever spent. \n\nJust lyrics and chords. I can crack it open at any time and start playing the songs that I know deep in my bones.\n\nSo much condensed songwriting goodness. I wish that this existed for more artists.",
    "reactions": 11,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1472297813420544222",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Given that this is #✍songwriting-talk , I would strongly advise people who want to learn how to be great songwriters to avoid any production at all when doing the practice we're talking about.\n\nIt's so much easier (and time consuming) to play with snare drum sounds and production transitions than to stay focused on lyrics and melody. Almost everyone I know, and seemingly everyone that asks questions here, just needs to write lyrics and melody over and over and over.\n\nIf you want to get reps to become a producer, that's awesome. Go to #🎹production-talk and talk about those reps.\n\nTrying to also do production while doing the exercises that we're talking about will only slow you down.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153456123576332388",
    "author": "oaklandmatt",
    "date": "2023-09-18",
    "content": "Yes, all the time. But my perspective is sort of tough love: nothing you or I do matters. Even if I make a culturally transcendent song, in 100 years we'll all likely be forgotten.\n\nOk, so then what? Well, you still have a subjective experience of the world. So what is meaning for you? \n\nDo you like making things? Do you enjoy the process? Do you feel fulfilled and connected to the experience of life by playing piano or singing or mixing or making weird keyboard sounds? \n\nI love all that shit so much. When I get stressed out and uninspired, I try to find the ways to get me back into making things. When I do, I always feel better. Piano scales or learning songs or playing guitar for my girlfriend or whatever it is that makes me feel joy.\n\nIt's very important for me to have significant parts of my life that are creative and not for any purpose.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221433011405328465",
    "author": "oaklandmatt",
    "date": "2024-03-24",
    "content": "Ok this is one of my favorite topics ever.\n\nHappy to go deeper, but the gist is this: I believe people connect to the underlying emotion, even if their analytical brain isn't reading or understand the lyrics. If the emotion is authentic, the song has a MUCH better chance of connecting. Without that emotion, it is almost impossible. \n\nThe more I write songs, the older I get, the more I work with the greatest songwriters, the more I think that writing an authentic emotion is everything. \n\nA favorite example (I have 100 more, just ask): \n\nParty In The USA. Silly pop song? Or deep truth about the power of music being able to transcend loneliness? Go into the lyric and you realize it's Jessie J writing about her first time coming to Los Angeles: \n\nStepped off the plane at LAX with a dream and a cardigan... am I gonna fit in... everybody looks so famous... I'm feeling homesick, too much pressure and I'm nervous... but then my favorite song comes on the radio... I know I'm gonna be ok... it's a party in the USA\"\n\nTbh I tear up every time I think about this song. Yeah people might not analyze the lyric, but the reason this song will play for the next 50 years (and not the 1mil other simple songs about having a party) is the deep, authentic, universal emotion underlying the record.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "846662569799450655",
    "author": "Slow Hand",
    "date": "2021-05-25",
    "content": "Now that everyone is incentivized to play *their* song the current iteration becomes the most-requested song of all time. DJ's revolt. Publishing companies and PRO's buckle under the logistical strain of addressing everyone's financial claim to authorship. 'Sicko Mode' derivatives can be heard echoing from every car, bodega, and grocery store intercom. TV has become unwatchable now that every comedy, drama, and reality show is saturated with these songs. The mob can't get enough of *their* song! Society breaks down. After a dark period and reconstruction civilization reforms as feuding warlord states where the only currency are promissory notes for royalties on the song that once brought humanity to the brink.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009885679062364191",
    "author": "Will Melones",
    "date": "2022-08-18",
    "content": "I’m sure we all share this struggle to some degree. I’ve got some projects that I’ve put many hours into, just to let them sit on a hard drive for years.\n\nCo-writing has helped a lot, and has taken some ideas to places I never would have thought to go. The feeling that you have some moral obligation to your collaborators to finish is motivating. When you’re making art for yourself, it doesn’t benefit from those positive forces of peer pressure, and there’s a lack of constraints and no sense of urgency. \n\nI think making creative decisions is metabolically expensive. It’s easier to defer all decisions, which is why you see DAW-age producers committing to so little until the mix. In the same way you can defer the entire songwriting process, especially if you have someone else’s project or deadline to prioritize over your own.\n\nTo be both the creative mind and the executive finisher is a lot of exhausting context switching. Some options might be to split these responsibilities with someone else, or to dedicate separate time to each task. If someone hires me to print stems or solder a patchbay, the last thing I want to do is engage in creativity. But when I get inspired to write, I don’t want to stop and troubleshoot the plug-in that’s crashing the session.\n\nMaybe like the divergence/convergence approach would be to set aside an hour or three at the end of your day to finish ideas you’ve already got brewing—set a timer and finish a song, or a verse. Or, even better yet, dedicate the *end* of your day to play and experimentation. Then the next morning, hopefully with fresh perspective, get in the mood to tie up loose ends and prepare your next steps. You’ve demonstrated that you’re good at wearing that hat for other artists, so you can do it for your songs, too. Just maybe not while you’re in the creative flow.\n\nI’m not practicing what I preach, just brain-dumping. I definitely don’t have this figured out.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075791534328393790",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "The other overall point to make is that I find nearly all the great songwriters I know are just comfortable in a session. \"Good vibes\" in a sense, but also just comfortable generating ideas. They don't really get stuck anywhere. If something isn't working (even if they suggested it), they're comfortable moving forward. Just forward momentum, very little negative energy.\n\nAnd so much of that is *simply doing it a lot*. It's great to talk about tips and tricks (and yes, morning routines), but mostly it's just putting in time where you're enjoying doing it. \n\nThat's why I think learning songs is so important. It's actually not really about intellectualizing or analyzing what great songs are doing. It's much more just practicing being in the feeling of singing and playing great music. It's the same feeling you're after when you write. By learning great songs and singing them, you get comfortable in that feeling and you're better able to connect to it when writing.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1464322819470131359",
    "author": "Josh",
    "date": "2026-01-23",
    "content": "Could always just have a giant guitar solo",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "858205648285073439",
    "author": "oaklandmatt",
    "date": "2021-06-25",
    "content": "@David Fuller with rare exception, a hit song can be sung and clapped along to. Occasional instrumental hooks (though most of them can be sung) are the only exception I can think of. \n\nThis is where the \"a great song can be sung and played on piano\" gets it wrong. Singing/ clapping is the fundamental. Rap songs to ballads to dance songs.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155628456181252139",
    "author": "Slow Hand",
    "date": "2023-09-24",
    "content": "I assume you mean for GPT4 to help with lyric writing? \n\nIf so, I think you may be asking too much of GPT. It's not really capable of new or novel ideas. The answers are trite because it's built on repackaging past inputs (most of which are unremarkable), and creating novel ideas (that are also coherent) is hard.\n\nWhat if instead of asking it for lyrics you asked it for situational prompts that you then dramatize and write about? Ask it to role play a point of view:\n\n\"Pretend that you are two quarreling lovers\"\n\"Pretend you are a human and you are currently on fire.\"\n\"Pretend that you are a statue watching people pass by. What would you see?\"\n\"Generate a list of nonsense words that sound plausible.\"\n\"Summarize the plot of the movie *Airplane* like you are visiting Earth for the first time.\"\n\"Summarize *King Lear* in the dumbest way possible.\"",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204962498525274143",
    "author": "oaklandmatt",
    "date": "2024-02-07",
    "content": "As is always the answer: it works every way you could imagine. Back to what I said a few days ago, you gotta learn a lot of skills and get a lot of reps using them. \n\nThen you learn the meta skill of making strong decisions based on your taste. Sometimes that's \"hit this note instead of that note,\" and sometimes it's \"let's stop trying to write to this track and go outside with acoustic guitars.\"",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385595768664096778",
    "author": "Ross Fortune",
    "date": "2025-06-20",
    "content": "I’ve been pushing myself to write more 100 percenters, and lyrics are a challenge for me. \n\nMy studio neighbour sings in a band but writes alone. His tack is to bounce his instrumental along with whatever gibberish vocal guides he’s laid down, then take a walk and have it on loop on headphones. Whenever he gets to a point where his mind is wandering he’s forgotten he’s supposed to be writing, that’s when the lyrics usually come.\n\nHaven’t had a chance to try it yet but it sounds like a good approach",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385770568506146816",
    "author": "Slow Hand",
    "date": "2025-06-20",
    "content": "I've always been inspired by the working relationship between Elton John and Bernie Taupin. \n\nBernie (who strictly writes lyrics) would mail completed lyrics to Elton, who would sit at the piano and write to them. I can see several advantages  here:\n\nA) You have a complete subject, theme, and narrative arc.\n\nB) The dramatic arc of the lyric informs the shape of the music, which can give the lyric additional support and also shake the writer out of their usual approach.\n\nC) The lyric can be stretched or compressed until it finds it's proper cadence and allow the singer (Elton) to find the best melodic fit to support the lyrics.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261803179989798933",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "You're absolutely right that trying to copy existing hits rarely makes great songs. He's 100% correct on that point.\n\nI'm saying that songwriters often fall into the trap of trying to be \"original.\" They mistakenly think this means they should try to invent new phrases or not use \"generic\" words or try to do something \"interesting\" with the chords. Instead of doing the only original thing that is possible which is tell your story and express your taste. This is actually much more difficult to do because it's incredibly vulnerable.\n\nYou can compose fully original compositions this way. But it's also interesting how much groundbreaking music comes from direct appropriation of existing popular music. \n\nFrom folk music (\"Blowin In The Wind\" is a melody from another song) to hip hop (all of sampling) to producers and DJs making careers from remixes, playing around with current or past hits can also yield incredible new music.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472011685643554826",
    "author": "oaklandmatt",
    "date": "2026-02-13",
    "content": "You're way overthinking it and trying to find some \"solutions.\"\n\nThe only thing that important is writing A LOT of songs. The only thing. Only. Yes. Only.\n\nWhy? Because forced reps is the only way to learn the language of songwriting. You need to practice over and over to get the muscle memory of writing. It's like the language of an instrument or a literal spoken language.\n\nAny books, tips, videos, classes, spiritual paths, etc etc are only useful right now if they get you to write MORE. But really, you do not need them. I strongly disagree with anyone who says otherwise.\n\nFWIW, my 25 years, billions of streams, platinum hit songs, blah blah has taught me that reps are the ONLY foundation. The best songwriters write all the time and didn't really get good until they'd written hundreds to thousands of songs.\n\n@Zack Hames is on the right track. But don't \"attempt\" to write a song a day. Force yourself to do it. Immerse like you would learning a language. Don't wait to express yourself perfectly, start writing songs like a five-year-old and work your way up. \n\nUnlike mixing where you need to learn how things like compression work, or like playing guitar where it's important to have someone show you proper technique, you cannot learn how to be a great songwriter by anything other than doing it over and over*.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "879505235264012308",
    "author": "Josh",
    "date": "2021-08-23",
    "content": "Yeah. When I’m playing guitar I feel like a caveman and when I’m playing piano I feel like a Neanderthal.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138335134509191190",
    "author": "popaganda.",
    "date": "2023-08-07",
    "content": "What everyone said about copy drum patterns and experiment, but keep your hand moving: on-beats strum down, off-beats up. If there’s a gap in the rhythm still move your hand. Keep the groove in your body. That may or may not be obvious to you but not everyone gets it",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287561324687134760",
    "author": "Slow Hand",
    "date": "2024-09-22",
    "content": "I think this is a good approach. Start by suggesting that you both do the writing with \"stripped down\" instruments like a piano or an acoustic guitar. Or at least an electric with no pedal board. Leave that at home. Something that will force you both to focus on the core song and not be diverted by sonic considerations. Those can all come later.\n\nThink of it like writing a lead sheet: Chords, melody, and lyrics. This is the heart of the song. Focus on getting that right and you'll unlock so much potential.",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "834679444387004456",
    "author": "Deleted User",
    "date": "2021-04-21",
    "content": "This is a real struggle... When I was starting out with writing songs, I would only write stuff that I feel like people would like or that I feel like would be a cool thing. It never worked out and ended up fake and awkward. And once in a blue moon I would really feel the necessity to write about my own experience it was scary. Scared of exposing myself and what i'm feeling even to the cowriters or people that I'm sharing music with. Fuck, and I'm even shy about sharing it with my girlfriend and my family. Slowly growing out of it by training myself to be emotionally honest and vulnerable. And I also recognized that this issue is not only in songwriting but also in playing music and just expressing myself in general. ** If anyone is also struggling with this, you are not alone. I'd be happy to chat with you **",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "858206009221578782",
    "author": "oaklandmatt",
    "date": "2021-06-25",
    "content": "Not to get all anthropological on it, but it makes sense as humans have been singing and dancing and playing drums together for WAY longer than any of the instruments we use have been around.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885062929018392606",
    "author": "jonmatteson",
    "date": "2021-09-08",
    "content": "Play along to voodoo, continuum, and golden hour. Don’t just “jam” really listen to note placements and try to copy those as precisely as you can. Also play as quite as you can and crank your pre’s and record yourself playing along to dissect what you to need to work on.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153382157348241569",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I mean I also do primarily “alt” genres so it’s like “I love how that guitar sounds like it was recorded in your kitchen through a 57 while the dishwasher is running. What a fuckin vibe”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276626928433889333",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-08-23",
    "content": "Ah cool! I had a list I copied from somewhere I while back for this purpose, not all will be helpful but maybe some:\n\nBreaking out of patterns\n1. Modal Interchange  \n2. Limitations & Constraints  \n3. Change Time Signature  \n4. Explore Unconventional Tunings  \n5. Incorporate Non-Western Scales  \n6. Randomization/Generative Techniques  \n7. Reharmonization  \n8. Switch Instruments  \n9. Use Polytonality or Bitonality  \n10. Collaborate",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827639354092421190",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Yeah. Just get in there and start playing songs. That's gonna glue together anything you may be learning at the moment. Theory is more of a framework for being able to describe and communicate what you're hearing. I wouldn't consider it a pre-req to writing. Just writing and getting in those reps is gonna do it. From there you can look into theory for ways to expand your vocabulary. Plenty of writers get by with nothing more than a rudimentary understanding.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885162061569613824",
    "author": "alecdibell2",
    "date": "2021-09-08",
    "content": "@sethearnest yup i left out the recording bit. Being able to analyze yourself after playing is key. I brought a gopro on my first tour and would watch one particular song every night that was tricky for me. Watching the video each day made me improve significanyly every night. Once I finished the tour, I felt so confident in a song that was a but daunting to me months prior",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984002886323281971",
    "author": "peterlabberton",
    "date": "2022-06-08",
    "content": "I don’t think I’ve ever encountered a no charts gig—but that said, I keep them small and concise. It’s just a detailed set list; if someone has a problem with that they can go take a deep breath and get over themselves. Obviously it’s great to have things memorized but developing a comfortable chart system that works can be invaluable. I remember in 2019 doing rehearsals for a tour where I was playing in two bands on the bill, and hopping on a friend’s quick run of shows last minute right before leaving. No fucking way was I gonna remember 30-40 songs I’d learned over a week or two!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138142292847374468",
    "author": "chrissorem",
    "date": "2023-08-07",
    "content": "I’d experiment with different rhythms. Drums machines/rhythm boxes  are Great for this. We already have our go to habits, so it good to figure out ways out of them. Another trick for me is to not play and imagine a part before i touch an instrument. My Brain  is better than my muscles",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138146336093507736",
    "author": "chrissorem",
    "date": "2023-08-07",
    "content": "Another thing to try is to listen to other instruments and replicate their rhythms and phrasing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138297362423488682",
    "author": "esquinalee",
    "date": "2023-08-07",
    "content": "Listen to drummers and try to learn how to play different drum beats, just as a strumming or rhythmic pattern. Infinite possibility here",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153467268546711573",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I think the focus should be on “how can I make something I find exciting”. Earlier when I was talking to Austen about how I’m really bad at just sitting down and churning out beats or instrumentals, it’s because I just don’t find it exciting very often. I rarely want to chase anything. But when I’m writing and I hear something great it gives me the same feeling as when I got my black belt in tae kwon do in 2nd (don’t ask). That shit is sick. The beauty in art isn’t about who consumes it in my opinion. Or how many people. It’s about the process of creating it. So if you aren’t loving the process then maybe it’s time to explore other things? Do the opposite of what you normally do and see if it feels like Christmas Day again.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153774719716315176",
    "author": "Josh",
    "date": "2023-09-19",
    "content": "I started drawing recently and while I’m terrible at it, it feels like I’m filling a void I can’t replicate with music and it just pushes me to chase that even harder every time I pickup a guitar.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205822535078256690",
    "author": "Deleted User",
    "date": "2024-02-10",
    "content": "One of the guitar teachers I had in college was a big Joni Mitchell fan. She told me that Joni Mitchell suffered from polio when she was a child, and after polio- chord shapes became difficult to play. So she started changing the guitar tuning to be able to play those chords. It’s really cool how she turned limitations into more creative possibilities. It’s a good reminder for “there’s always something to be explored”",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1208061627245793301",
    "author": "Zakhiggins",
    "date": "2024-02-16",
    "content": "I think my favourite thing about alternate tunings is actually not learning them. You can come up with some pretty unique stuff that you may not have otherwise thought of just by fooling around and not knowing what you’re doing. I get a similar effect off playing left hand guitars, or other string instruments that have different tuning to guitars. It’s like transporting myself back to when I was 14 and knew no music theory at all, trying to figure out how to play the chords and melodies that were in my head.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1235158283397107712",
    "author": "Marshall",
    "date": "2024-05-01",
    "content": "Anyone else obsessed with Mk.gee rn? His music is so sick, so raw too. Saw him play with Dijon last year and have been following him since, but seems like he’s on the verge of blowing up",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298339227267895297",
    "author": "Jack",
    "date": "2024-10-22",
    "content": "I guess a more musically relevant suggestion would be to instrument swap. I usually dive over to the piano from guitar and try figure out what I’ve been doing and something about the pre-amble of warming into the chords and voicings or whatever can often lead me to new harmonic ideas; especially nice having the left hand to add colour and movement to chord patterns.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417225387825561791",
    "author": "Brian Reynolds",
    "date": "2025-09-15",
    "content": "\"The truth is you could slit my throat\nAnd with my one last gasping breath\nI'd apologize for bleeding on your shirt\"\nTaking Back Sunday\n\nI still remember walking into Hot Topic and doing what I always did. Walked directly to the headphones, that had 6 CDs loaded up to choose from listening. Drawn immediately to the NJ Parkway signage and a sticker that said, \"If you like Thursday and New Found Glory\". Hit play and I was all in from second one. \n\nThe lyrics and especially the one above I couldn't get enough of on this record. They are so visceral and clever. \n\nThe imagery of having you neck slit is like horror and action movie territory. But here it is in an angsty punk rock song about lost love. \n\nStarting the line with \"the truth is\" somehow enhances the line slit my throat. Its great storytelling.\n\nThen to top all the clever with the killer line of all killer lines. \"I'd apologize for bleeding on your shirt.\" The painful self awareness that somehow thru it all, your devotion remains. Youre still deferential to your tormentor.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472572222370480322",
    "author": "Brian Reynolds",
    "date": "2026-02-15",
    "content": "Then back to Matt's advice. Think less, do more. Write, write and then write some more. I used to sit on the train and listen to things like Gym Class Heroes, John Mayer, Say Anything, etc. and write lyrics to their melodies and songs. This is in 2006 before you could just download instrumentals. And by osmosis you'll learn and pick up on their lyrical structures and how they create a \"consumable product\"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835984570671300609",
    "author": "Slow Hand",
    "date": "2021-04-25",
    "content": "I like Native Instrument’s Maschine expansions. They’re usually very well crafted and with a very specific genre in mind. I don’t even use Maschine. I simply download/install them and then strip the samples and patches and put them in my own sample library.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835986675271204925",
    "author": "Slow Hand",
    "date": "2021-04-25",
    "content": "Actually, if you can get it, the *Maschine 2 Factory Library* that comes with the software has a very comprehensive selection of percussion samples. From one-shot synthesized samples to multi-velocity samples of acoustic drums and percussion. It's a well rounded collection, if you just need a little bit of everything.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "862331119890333726",
    "author": "kidcutler",
    "date": "2021-07-07",
    "content": "Absolutely gonna need that book, best show I ever saw was Jeff solo acoustic set benefiting his kids montesorri school 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "879501146694230057",
    "author": "1ggy",
    "date": "2021-08-23",
    "content": "Definitely! Piano vs guitar is totally different for me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880104159771254855",
    "author": "isaac joel",
    "date": "2021-08-25",
    "content": "Yeah I find this to be a really powerful tool for creativity and writing...to intentionally put yourself behind the wheel of an instrument you have no idea what's going on but resolving to create something with it regardless. You do things you'd never think of doing normally 🙂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880280148497276928",
    "author": "rae",
    "date": "2021-08-25",
    "content": "Oooo second this! I write about 99% of songs acapella because I struggle to start with an instrument. Writing acapella first really helps you build the story imo 😊",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880511134027890699",
    "author": "Alessandra Morris",
    "date": "2021-08-26",
    "content": "Exactly! Im not great at playing piano, but I think it does help to switch things up when writing. Like you said, because its not confortable it’s like your brain starts to resolve what you are doing. Like for example, for ballads I can get more in the vibe with piano than with guitar, and for upbeat stuff probably will use guitar, etc.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885013283072008222",
    "author": "alecdibell2",
    "date": "2021-09-07",
    "content": "@Zack Hames finding a teacher for what you’re looking to improve on could take some shopping around. I think it would be helpful to move away from practice only being playing along to your productions.\n\nYou’re going to develop better groove if all you’re listing to is your own playing. So I’d start practicing some grooves solo, no click for now, no music. Listen closely to drummers that you love that have that feel throughout songs. Learn their grooves, play along to their songs for a bit.\n\nI think after you take time to play only listening to yourself, and playing along to other songs with a great feel, it’ll be easier to integrate those philosphies into your own productions.\n\nMy drum lessons when I was younger made me stiff and less creative, so finding the right teacher is soooo important. It wasn’t until I played solo to make the drums impactful by themselves, and played along to a ton of hiatus kaiyote and esperanza spalding that i was able to have a musical feel",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983981143336575026",
    "author": "Deleted User",
    "date": "2022-06-07",
    "content": "Personally, I latch onto vocal parts (if there is any) or other instrument parts to associate memories of what happens in the arrangement. It kind of takes me out of the charts too- if in some rare cases of “no charts” gig. But I find writing charts always helps in the process of learning parts even when it’s a no chart type of situation",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009599356481044500",
    "author": "youngteam",
    "date": "2022-08-17",
    "content": "make the thing, be honest with yourself musically and create so you're happy. then you can figure out what to do with it, whether its good or bad, etc. its good to take the pressure off and remember that we are *playing* music - sandbox mentality works best!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069694991976366110",
    "author": "Zack Hames",
    "date": "2023-01-30",
    "content": "What is the lifestyle / daily life like for people who write *a lot * of songs (whether it’s the music, production, beat, lyrics, etc)? Are you writing 8+ hours a day? Like really sitting with your instrument/paper+pen/DAW. taking frequent breaks? Going hard for a couple hours? combination of everything? How scheduled is it?\n\nI have been writing songs since....forever. I've gone through various phases of writing a song every day to not writing for months on end. I do a lot of different things but am trying to get a lot of writing done in a relatively short amount of time and would love to just hear people's anecdotes on what your life is like when you are writing a LOT.\n\nI find I can go very hard for an amount of time, then I *NEED* a break. I cannot just write every day for hours on end as much as I'd like to.  If someone has tips to get more productivity in writing, I'd love to hear it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069776901368987659",
    "author": "ehutton21",
    "date": "2023-01-30",
    "content": "I try to think about some of the things I make in smaller terms. Like yeah maybe overall it didn’t come together but what skill or new sound or concept am I playing with",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121196912872263702",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": "Yep! I am as we speak sitting here with my guitar trying to get a few hook ideas at least",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121200138996699186",
    "author": "LAPhill",
    "date": "2023-06-21",
    "content": "Don't feel like you need to bring a finished idea to the session. Don't feel like you have to have ANY ideas, unless that's what was discussed. When you're in a room with other people, instruments in hand, things start to happen. Be receptive to the energy in the room, to exploring ideas. Things will come out that feel foreign, which is the best part. If you weren't looking to push outside of your limitations, boundaries, and comfort zone, you wouldn't need other people. It's going to feel different than when you write on your own, and that's the whole point.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137961808964108309",
    "author": "Zakhiggins",
    "date": "2023-08-06",
    "content": "Making the guitar parts before you make the lyrics is a good start for getting your head thinking that way",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153461840983097375",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I might start doing this. The two things I care about deeply right now are figuring out crazy sound design shit to compete with skrillex and figuring out how to make a song that shakes someone with just a voice and a guitar. So I’m on two very very different kicks right now.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153465831292932188",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "Anytime I’m feeling uninspired it’s like “okay we’re gonna pickup the guitar and have fun”. Or “how can I make a drum track like this *insert Jeff Hazin song*” \n\nI literally was planning on not lifting a finger today bc my brain is exhausted and accidentally wrote a whole song because I wanted to find cool guitar tones to save as ableton racks lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153936454062452767",
    "author": "rae",
    "date": "2023-09-19",
    "content": "i think it was joe strummer who said 'no input, no output' and if ya look at what he wrote about (politics, state of the uk in the 70s and 80s etc.) he was inspired by everything around him & what he was going through as @LAPhill said - art doesnt exist in a vaccuum",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156028080788357160",
    "author": "austenballard",
    "date": "2023-09-25",
    "content": "We're playing inside genre lines right now\nIf I were trying to get more creative I think I'd probably take the approach you're advocating",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156983970425208883",
    "author": "austenballard",
    "date": "2023-09-28",
    "content": "this is great. I'm gonna play around, modify it for songwriting specifically and drop whatever ends up working for me back in here",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200532244155072533",
    "author": "ehutton21",
    "date": "2024-01-26",
    "content": "And it’s unironically some of my best writing, arranging, and playing in a long time. And it’s really hilarious because of *how* it came about.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217999390510157824",
    "author": "Slow Hand",
    "date": "2024-03-14",
    "content": "So many loud-ass rehearsals in our spot. We had a 3000 sq ft loft to play in. That was a very fun time.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218007743416500304",
    "author": "Slow Hand",
    "date": "2024-03-14",
    "content": "Great song. Lorelei was a homie too. She was one of my favorite songwriters to observe. She used to have a little battery powered Casio keyboard that she would carry around on the street and just write songs about whatever was on her mind. There was another band pre-Celestial Shore that all of us played in together.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221350895535788132",
    "author": "Deleted User",
    "date": "2024-03-23",
    "content": "And hitting random objects with a pen, stick, or fork as a percussion instrument",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287557823152259266",
    "author": "Calvin Lauber",
    "date": "2024-09-22",
    "content": "Try handing him a bass and asking if he wants to write a song focusing on the root notes, vocal Melodies first, if you come up with something throw a drum loop on it and hand him the guitar and I bet he’d play some cool stuff to it. I get when that’s your primary instrument starting too guitar-brain to focus on the songwriting part",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1296281760073519167",
    "author": "Josh",
    "date": "2024-10-16",
    "content": "Somehow 2/2 on sessions where one of the ten things I can play on guitar at this period in time got the “what’s that? Let’s write to that?”",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1296281790352195585",
    "author": "Josh",
    "date": "2024-10-16",
    "content": "And now I’m never getting better at guitar",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324843425610334279",
    "author": "lystell",
    "date": "2025-01-03",
    "content": "Interesting!\nFrom my experience it’s super rare that you get paid to to demos. From a label and such anyways. It’s up to songwriters to create and finance the demo. Hence many of us becoming multi instrumentalists and recording  everything. \nI would taking it that far saying it even had a big impact on why a lot of swede music have been electronic/programmed etc. \nIt’s also very common one musician helping another out and vice versa. \nThe Nashville way seems very special in that way.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356414365825237164",
    "author": "Brian Reynolds",
    "date": "2025-03-31",
    "content": "But beyond that. You can comp the gibberish together to make the most compelling melody for the part your writing to. Then just loop that part. And start to sing with your comp. Ask yourself what's the mood of the song, what mood am I in. And just kinda flow with it. Like improvising on an instrument. Its a muscle so it will take time and effort. The more often you sit down and improvise melody the easy this will be. Doesn't always have to be a voice exercise. 15 mins of mindless melody exploration on a guitar or piano will stretch the same brain muscles.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385025632873746451",
    "author": "Brendan Trinkle",
    "date": "2025-06-18",
    "content": "I love this question, thanks for asking us. \n\nI either write with a guitar & a notebook/phone or I go production first in a DAW. I use a lot of guitar pedals & programmed drum loops to create a vibe & then I’ll write a song to that. \n\nI use Notes to organize things. The parent folder in the screenshot is also kind of an inbox & contains in-progress songs that don’t yet have a folder home. \n\nI use Voice Memos often & have a little naming convention system: \n\n“Working Title proto” for first recording of an idea\n“Working Title YYYYMMDD” for each iteration after\n“SFX title description” for field recordings\n\nI use voice memos as long as I’m developing an idea outside of a DAW. Sometimes I have to let songs brew for a long time, play them out loud a lot, and listen back as an editor with fresh ears before they feel like themselves. Love using these tools to fit that work in while I’m at the grocery store or in the car.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385030307278749817",
    "author": "Brian Reynolds",
    "date": "2025-06-18",
    "content": "I'm always in the daw. Always recording.\n\nSometimes melody first. But mostly drums first.\n\nBuild an instrumental just chasing intuition, quickly. 2-3 melody parts and a bass line on top of drums. And youve got a chorus loop. \n\nThen take that improvisational melody muscle and apply it to the vocal melody. \n\nIm not a big humming guy, I get to words pretty quickly. But will start with common phrases to me like,  \"runnin runnin runnin round runnin runnin runnin down\" I have a few others.\n\nI start to land on a melody, with a feeling and story. That I haven't told. Sometimes it takes 90 seconds, sometimes 5-10 mins. \n\nRecord and comp till I have what I like. Than do all the background vocals. \n\nThen start muting a couple of the melody parts. Find my verses.\n\nRinse repeat the process above. But now I know the story and I just have to find the melody and the thru line narrative.\n\nDepending on how the verses feel running into the chorus. Or short length of track. I'll write a bridge \n\nMelodyne the vocals.\n\nStructure the song.\n\nMix the song.\n\nUpload the song.\n\nMake another.\n\nThis usually takes 2-4 days, intermittent with regular life.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385273564210532505",
    "author": "Josh",
    "date": "2025-06-19",
    "content": "So I’ve been trying to write more and I was getting frustrated because telling myself “it’s time to write” doesn’t yield the best results. I’m also trying to get better at guitar and just started playing more. Turns out playing more makes me find cool tones which gives me cool ideas that I end up finding melodies to while I’m practicing whatever it is that sounds fun that day. Then to double down on the practice I come up with lead lines over the track until my fingies get tired and then lay down the vocal.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385304173247205488",
    "author": "Brian Reynolds",
    "date": "2025-06-19",
    "content": "Also, if i go melody first, with say acoustic. I'll play till I really got it. Record no click. Find bpm. Then go find drums that work with melody and bpm. Rerecord the acoustic to drums. Start building from there",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1388085292560551987",
    "author": "Chad Rodgers",
    "date": "2025-06-27",
    "content": "An artist I work with is so groove and feel-focused, that she hates writing without a beat. She *can* write to a piano / keyboard / guitar part on its own if she has to, but she comes up with insane stuff when she's locked into the vibe of a track via a drum beat or loop first. It's fascinating how our musical brains are activated in such different ways.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1395784705911160995",
    "author": "Circul & Eas",
    "date": "2025-07-18",
    "content": "This pic makes it look like you have a “Jupiter x keyboard”, which I was ready to also fall irrationally in love with.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397690971017314345",
    "author": "Ross Fortune",
    "date": "2025-07-23",
    "content": "I really tried to force myself to write in PT - committed to it for 4 whole years, but it is just ball ache. There are producers who make it work, but being restricted on actions when in loop / record is just not the one for me.\n\nI find it also forces me to think like an engineer, which is great when I’m properly engineering, but not what I want when I’m throwing paint at the wall. \n\nThese days with comping in Ableton, I’m happy to get most of the work done in there. When it comes to mix I’ll usually fly the vocals out to PT with an instrumental so I can do my clip gain and RX workflows there, but otherwise I’m saving more time and frustration by just staying put.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1406208393181663242",
    "author": "Ciweeeee🐢",
    "date": "2025-08-16",
    "content": "There's a wonderful album called Siftorde by Tidiane Thiam. Now it's all instrumental guitar but I'm pretty sure it's all in the same key and follows similar themes between tracks and it's beautiful!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471659259895746641",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "1. Write a song every day (or attempt) certainly you’ve heard of and likely tried this, but nothing beats reps.\n\n2. More technically, write out the structure (intro, verse, chorus, etc) of some of your favorite songs and mimic it exactly. Even as far as how many measures, or even dynamics (or tempo changes!)\n\n3. If you play an instrument, Learn “great” songs. And ideally sing with them. Playing the best songs in the world will seep into your writing and show you new ideas on chord movements, melodies, and the physicality of a great song.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472776139452977224",
    "author": "oaklandmatt",
    "date": "2026-02-15",
    "content": "As I'm sure you already know , there is no such thing as enough. It's like how perfection doesn't exist. \n\nIt may be easier to think of being a writer on a spectrum from hobbyist to full-time artist. The one end is the hobbyist who does it whenever they want and have time (other priorities take precedent). The other end is the artist who is compelled to do it and it has to turn it off in order to live a normal life.\n\nMost people here are somewhere in between. For most of us, the key is to do a combination of two things:\n\n1. Find every way possible at all times to joyfully write. Direct yourself toward it with how live. Write silly things for fun, have a guitar you like to play next to the place you always like to sit, write emotional things for catharsis, write with other people for the collaborative joy, sing in the shower, write on different instruments that feel inspiring, etc etc \n\n2. The harder part is developing habits and practices that keep you consistent. It's easy to write when it's fun. It's harder to write when it's not fun, and that's the time to make sure you're doing it. Daily practices, schedules, deadlines (self imposed or otherwise) are the best way to do this.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827588599955587142",
    "author": "Josh",
    "date": "2021-04-02",
    "content": "I’ve actually been eying that up. Same with something more complex for guitar.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827592434095489034",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Yeah. This is a big part of how I came up and got some nuts and bolts songwriting chops. I wanna recommend this book right here: It's their entire song catalog as just lyrics, chord changes, and some chord diagrams for the guitar voicings. This is pound-for-pound some of the most information dense, yet simple, description of good songwriting that I would recommend. https://www.amazon.com/Beatles-Complete-Chord-Songbook/dp/0634022296",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827592933011619858",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "It's such a good way to just pick up your instrument and immediately start exploring some solid songs. It's best if you play guitar, but don't let that stop you. Anyone can use this once they know how to spell chords.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827617787639365642",
    "author": "Josh",
    "date": "2021-04-02",
    "content": "I did decide to start learning a bunch of popular songs right now. Mainly guitar oriented ones because I don’t really have a knack for guitar parts like that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827632871279820881",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Ok. This is far from a comprehensive resource, but this Youtuber *Music With Miles* has some of the *best* harmonic theory tutorials/explanations I've ever seen. He's only got a handful of videos, but his pedagogy is outstanding. Just watch this video on modal interchange and tell me it doesn't make you want to immediately start playing with chords: https://www.youtube.com/watch?v=1dRA28cdt5c",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827635658511482910",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Let me ask a more direct question: What are you interested in learning? Do you just want to learn some diatonic cowboy chords that you can play on guitar and sing over? Do you want to learn jazz harmony? Does classical counterpoint interest you? Music theory is really broad and takes time to absorb before you can comfortably move on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827637734603489320",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Those are your basic building blocks. Once you can spell chords and know your major and minor triads without having to concentrate too hard it's gonna give you a lot of facility. As you're doing this, I'd reiterate what Matt and others are saying: start playing whatever songs you're interested in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827638754876325968",
    "author": "Zack Hames",
    "date": "2021-04-02",
    "content": "My best way of learning theory was just by actually having a reason to use it. Just trying to learn broadly/abstractly is very difficult IMO. A project in school, I had to transcribe a 70s funk tune by ear, get musicians to come and play the charts, then record it authentically and recreate and match the mix. This has organ, horn section, guitar, bass, drum kit, background and lead vocals. I learned so much from that process.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827830288155279380",
    "author": "rae",
    "date": "2021-04-03",
    "content": "One of my favourite music education YouTube channels is: David Bennett Piano. This dude breaks down popular songs and focuses on elements such as the scale/mode used, key or time signature it is in etc.\nSupppppper interesting stuff \n\nhttps://youtube.com/c/DavidBennettPiano",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "830332601482477568",
    "author": "antoniohannamusic",
    "date": "2021-04-09",
    "content": "Tried to listen to this with an open mind but couldn't hear past the \"my first logic session\" feel of the whole thing. \n\nI don't know that X-Billion dollar AI tech was required to write the song but it might have had some credibility if say they got Dave Grohl to play on it instead of using midi instruments? \n\nIt just feels very sterile and not Nirvana, also, why were there so many sections in the song structure? The bolted on outro.\n\nWould love to know if anyone else here has heard this and immediately got annoyed hahaha!?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831595748747247616",
    "author": "Slow Hand",
    "date": "2021-04-13",
    "content": "I thought it was a unique documentary in that you also get to watch a song go through all the stages of production. From hashing it out on guitar and voice with other writers, to arranging for band, to tracking, to mixing, to release. I thought that was nice.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842444273378000906",
    "author": "Josh",
    "date": "2021-05-13",
    "content": "I’ve been thinking a lot about how pop music is supposed to be easy to sing along to. So I def have the advantage here considering I play auto tune like an instrument with my flat ass voice. Now I just gotta do it all way better hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851462412610961458",
    "author": "Yago Ibars",
    "date": "2021-06-07",
    "content": "I've been having a thought on my songwriting I wanted to share here. As a songwriter I have this toolbox of melodic and harmonic approaches  that I can use to solve any problem when making a song, or to have direction to create another section. But recently I've been noticing that something that makes a huge impact on songs is how the different sections relate to the tempo of the track. I think this might not happen to people who write to a beat, but I think that when you are playing an instrument, tempo is so fluid that some parts of a song might \"feel\" good and others won't (at a same tempo). When all the sections flow well into another in terms of tempo (and probably how that affects to vocal delivery) it sucks you in as a listener and it is way more singable/enjoyable. And now I'm starting to see this as a priority more than which notes of the scale have more weight on the chorus and stuff like that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851495917428277258",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I deal with (unintentional) inconsistent tempo and some time even time signature/pulse pretty often when working with songwriters and artists. It seems to solve the problem when you tap your feet to the melody. Then you would realize that the tempo has changed. And count 1-2-3-4 or whatever the meter is. So you don’t end up unintentionally having an extra beat because of words and disrupt everything else. A lot of writers ask people for beats first for this reason, but if the melody doesn’t stand on it’s own- relying on the beats will do more harm than good in my opinion. They often end up being mediocre melodies from my experience because there’s already tons of subdivisions and grooves in the beat and the topliner is relying on that to drive the rhythmic feel. But also beats need to come in with pocket so there are space for the vocal melody to fit in. It would be good for writers to start without a beat or instrumentals and it would be good for beatmakers to practice leaving vocal pockets when starting with a beat first",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591456035438592",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Look at a song like “The Weeknd - Can’t Feel My Face”, that chorus top line wouldn’t be possible without a rhythmic and detailed instrumental",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591691099570176",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Those melodies can’t stand on their own, but work very well over very busy instrumentals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591865867829258",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "You can actually write simpler and catchier melodies over really unique/detailed instrumentals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855592297282011197",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "If you write the entire song to nothing but a chord progression, you usually have to simplify the instrumental quite a lot to make room for the melody",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855592500512292874",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "But not every song has to “still be amazing when stripped back and only played on piano”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855594579189170187",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Meanwhile, “Cardi B - Up” was a number one hit and would probably sound like shit on piano lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855594853030821909",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Or imagine how boring “Billie Eilish - Bad Guy” is without the instrumental",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855595360926564372",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "And the instrumental is mostly just straight quarter notes and 8th notes following a chord progression",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874367727295418440",
    "author": "peterlabberton",
    "date": "2021-08-09",
    "content": "Alright, I’ve got a semi-songwriting, semi-biz question:\n\nI have never written a song entirely from scratch in my life; musically I’m a drummer first and foremost but play most things guitar-related and can plunk something out on keyboards as well with a lil editing. 🙂 I can’t say I have a great ear for melody, but building a rhythm section and producing a track I feel very confident in.\n\nI frankly don’t have an interest in writing songs per se, BUT a friend of mine who does a fair amount of songwriting sessions says he tries to do one a week, partly just to get in the room with new people and start the ball rolling on potential tracks to produce.\n\nWould it be crazy to try and do a few songwriting sessions, which I understand basically have no pay up front, with the hopes to then have the artist back and finish producing/mixing the track if it goes well? Is this a version of how that works?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874482190417817610",
    "author": "peterlabberton",
    "date": "2021-08-09",
    "content": "Ha, yes, when you explain it like that it seems so obvious. One further question: when you work with unsigned/indie artists, do you have some kind of agreement where if they self-release they pay a fee for the right to release/own the master? (Unless you wanted to co-release under your name or make a new band or whatever.)\n\nKind of funny I’ve been doing this for as long as I have and this is all completely foreign to me, but I’ve always just seen myself as providing a distinct service (engineering/producing, mixing, playing drums, whatever). I still don’t see myself diving too far into this side of the business but I’m curious to give it a shot and see how it feels.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "879500963218587756",
    "author": "Alessandra Morris",
    "date": "2021-08-23",
    "content": "Do you guys feel that when you change instruments to write a song it’s like a different you writing? 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880509757297930240",
    "author": "Alessandra Morris",
    "date": "2021-08-26",
    "content": "This is so true! This made think about when you are a kid and create songs out of nowhere. Maybe this happened to you guys too, before I learned any instrument I used to do that for fun. \nI think humans are naturally musical, for example accents or using different lenguages, there is melody in there, even the tone of the voice changes. When I write in spanish is a different vibe than when I write in english.     Its crazy how we forget to keep it simple as we grow 😂. Im gonna try to start to write  with acapella more often.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880511866395295765",
    "author": "Alessandra Morris",
    "date": "2021-08-26",
    "content": "I think it might change the decision making, maybe you have even more liberty in a way, cause sometimes when you are the instrument its like you enter into one pallet of color and automatically stay within that “color range”. But without that, maybe there is more freedom. Something like that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880513078855335936",
    "author": "isaac joel",
    "date": "2021-08-26",
    "content": "I'm pretty sure Timabland writes songs like this? Like he beatboxes/hums EVERYTHING before hand and then recreates it with instruments/samples later....can anyone confirm?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "884998226200100944",
    "author": "Zack Hames",
    "date": "2021-09-07",
    "content": "To all drummers out there: how can I work on better feel/groove for recording as a drummer? I’m confident in how I hit the drums, prepare the drums, and physically set them up for recording, and I can play well enough to edit the f*ck out of myself to the grid. But I’d love to be able to actually groove, not always edit myself. Any tips for a long time fake drummer to make some advancements?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885004433040220180",
    "author": "Zack Hames",
    "date": "2021-09-07",
    "content": "No real routine other than Playing to productions I’m working on to a click. I play drums on projects a lot, and it just feels STIFF and not musical. Definitely a disconnect from like the kick and snare and the right hand keeping time on hihat/ride/whatever. \n\nI think Drum lessons would be the right call overall.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885014295363072040",
    "author": "Zack Hames",
    "date": "2021-09-07",
    "content": "Love all of this. Thanks for the thoughtful response, I’ll definitely try just playing solo and then compare to some faves.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885160087805644800",
    "author": "sethearnest",
    "date": "2021-09-08",
    "content": "@jonmatteson 's list and advice is spot on -- playing along with the great groove drummers on various albums and recording yourself doing it then comparing to them is a great way to start learning what you're doing/not doing and adjust from there. Great drummers seem to listen to what they're doing as they're playing and learn how \"when I feel [x] as I'm playing, it's translating to [y] in reality\".\n\nThose drummers on those albums (Questlove, Steve Jordan) are phenomenal to listen to for groove and pocket on any of their albums. Others are Jeff Porcaro, Jim Keltner, some newer guys like Nate Smith and Aaron Sterling.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885206471112024085",
    "author": "oaklandmatt",
    "date": "2021-09-08",
    "content": "+1 for dave elitch. he's an old friend and a fucking genius drummer. teaches a level guys in addition to playing on A level records. everyone i know seems to have a great experience with him",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "899710723029086248",
    "author": "eliotpeace",
    "date": "2021-10-18",
    "content": "A common theme with lyrics deemed to be great is that they correlate and feel one with the (also great) feeling of the music. Part of my workflow recently has been recording a one mic jam of myself singing (scratch ideas) while playing acoustic guitar, which I then chop up and rearrange into what I want to hear/think sounds best, then I listen closely to the emotion of the song and overdub the rearranged sample with vocal ideas that FEEL correlated to the emotion of the song. I've found I've made some really emotionally vibrant music this way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937450176606527519",
    "author": "delwin",
    "date": "2022-01-30",
    "content": "Now that I think about it, although I play around with this tool a lot,  it's rare that a line from GPT-3 makes it into a song. Probably because I have no emotional connection to the lyrics!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983947024082804746",
    "author": "Zack Hames",
    "date": "2022-06-07",
    "content": "This is slightly off topic but I think the closest i can find:\n\nDoes anyone have tips for learning a lot of songs in a short amount of time? Not like 20 in one day, but like 6 in a couple days. It's not impossible but i want to try to maximize my strategy so i can walk into rehearsal and not forget parts.\n\nFor example - is it good to only learn a little bit at a time and nail it, take a break then come back? Learn something new then play everything again? Are there routines that are more effective for our brains memory? (hopefully this makes sense)\n\ncontext: learning bass for a live set for a band, I started learning yesterday, first of two rehearsals is tomorrow",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983960273092214814",
    "author": "ehutton21",
    "date": "2022-06-07",
    "content": "hmmm, it’s been a while but i do have experience memorizing like big works (albeit on piano). bass may be different than my experience but maybe this helps. i definitely say break it down in bits. always smaller bits when possible\n\ni think a big thing for me to make a song less daunting is analyzing the theory and structure of the song, and then break it down into bits and write down “chorus 1 motif”/keep a list of what you need to know for the track, and it’ll make you feel less in over your head when you feel the volume of work increase.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1006295149522993204",
    "author": "ALXCPH",
    "date": "2022-08-08",
    "content": "That and open guitar chords with close intervals rubbing making it all über EMOtional 🥲",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009589948443279633",
    "author": "youngteam",
    "date": "2022-08-17",
    "content": "i asked a producer friend lately what he thought he was best at and he replied \"finishing songs\" \n\nthis was pretty mind blowing to me and got me thinking that the same way we practice our instruments or production techniques, we can practice *finishing ideas*",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014972922080809055",
    "author": "Slow Hand",
    "date": "2022-09-01",
    "content": "It's full of great instrumental hooks too to support the main melody. It doesn't let go.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1019111458749042700",
    "author": "TheBlur",
    "date": "2022-09-12",
    "content": "Another thing I’m sure a lot of us do; play the vocal melody on piano. See how it sounds. It’s easier to see flaws in a cadence or melody this way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034355966004707348",
    "author": "antoniohannamusic",
    "date": "2022-10-24",
    "content": "Hey all! Loved reading all the responses to @Slow Hand ‘s question.\n\nThe sheer volume of replies really reinforces the “there’s no one way” when it comes to working with artists.\n\nTwo quick examples of that recently - \n\nOne artist I have, loves being challenged constantly and we often play the “that’s cool, but what’s that emotion on 11” or “what would be the life and death version of that feeling?”\n\nI explained that concept to a new collaborator who was like “yeah love that” 2 hours later on a lyric suggestion literally said, “yeah I see what you mean but I think this one is good enough, let’s not bother changing it”\n\nQuestion for you though, how quickly do you change tact in a session and is it something you’re consciously doing or do you pick up on the cue and just naturally address the situation with a softer/harder touch instinctively?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1060291565328805909",
    "author": "austenballard",
    "date": "2023-01-04",
    "content": "@NoahNeedleman moved from monitoring\n\nwhat did you mean by demos getting upgraded to masters btw, like when you start something as a 'demo' and before you know it you're tracking it out for mixing without swapping out drum samples or re-playing the parts you thought you were going to? \n\nI definitely see the distinction between demo and arrangement getting blurrier and blurrier.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061012551678312508",
    "author": "NoahNeedleman",
    "date": "2023-01-06",
    "content": "Basically when demos are turned in they’re expecting it to sound like a master, and most of the time they live with these demos so it either gets mixed or mastered as is, or they call in a producer to finish the track but keep most of the elements. Basically a demo should sound like a master, even if it’s just a guitar/vocal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064645028108050552",
    "author": "delwin",
    "date": "2023-01-16",
    "content": "@kidcutler @Slow Hand I remember playing with this dude too several years back! Highly doubted his release-an-album-every-two-weeks strategy at the time but it looks like it paid off!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069760210165567599",
    "author": "ehutton21",
    "date": "2023-01-30",
    "content": "“Flowing” being that idea where you’re not thinking about getting to the zone, but you’re just in the zone. It can include anything from just concepts and lyric ideas to even just finding top lines over random instrumentals I have laying around or chords I’m feeling. I’m pretty much just a bedroom guy, so sometimes all I need is an instrumental or even just my midi and my favorite sound. Sometimes I just write down images—it helps with that feeling of articulation if you try to just describe that which is around you or in front of you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075393464751116443",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "Get in there! 5+ people sounds like a lot though, maybe a little more intimidating with that many cooks, and I think hard to feel intimate with. My ideal sessions are 3 people (computer person, one proper musician on guitar or keys, topliner) +1 if it’s for an artist separate to that team",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075804056418799696",
    "author": "Ross Fortune",
    "date": "2023-02-16",
    "content": "That’s deeply awesome. I instated a routine of piano and singing in the mornings (keyboard lives in the studio, so I can’t do it before phone, but someday…) at the start of the year. I did it for a week and learned Hey Jude (I’m not a piano player, so it took me a few days to get it in the brain and the hands).\n\nIt was great, and I need to get back in the habit (sister act 2) for all the reasons you’ve described above. Thank you for the reminder!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076509267160485908",
    "author": "austenballard",
    "date": "2023-02-18",
    "content": "+1 for video call sessions, they're totally doable. It's worth figuring out how to route your DAW and microphone both into Zoom/FaceTime/Google Meet.\n\nOr just write old-school with a piano/guitar and your voice. Obv not practical for all genres but perfectly fine for pop, country, rock, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076712527037218816",
    "author": "masteredbyjack",
    "date": "2023-02-18",
    "content": "Hey Matt! Had a question…regarding all this songwriting. I don’t do it anymore, I just master but I am playing with a lot of these ideas applied to my own workflow…i.e. finishing things, focusing on my intuitive flow state…letting things just “come” to me.\n\nI saw you mentioned you’re applying the practice of scales/learning songs first thing in the morning, etc. I’m assuming that these things just “find” their way into your workflow when the time is right and you have grasped them.\n\nWhen you’re creating, how often are you actively trying to fit the song into some predetermined mold that you’ve set out? Or are you mostly just accepting what comes?\n\nI saw a great Bill Evans documentary where he said something along the lines of “just play what you can, and what you are, do not worry about if it’s complicated/advanced/etc…it’s more authentic to play something simple that you feel than something complicated just for the sake of it”…he was talking about jazz improv but I’ve tied it with much success into my work…when it’s time to go I’m only using things I know intuitively and not trying to force myself to be “better” than what I really am in that moment. I set aside other time to raise my skill set/potential with specific things (like scales, but for mastering haha)\n\nJust curious if this kind of stuff is on your mind and something you’re actively pursuing. \n\nI think it ties really deeply into the notion of “just write”…the skills and good music will come. \n\nBut your perspective is so valuable because you’re working on records with deadlines/commercial implications/expectations/etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135792226333630626",
    "author": "Deleted User",
    "date": "2023-07-31",
    "content": "https://www.instagram.com/reel/CvYEE3KLalV/?igshid=MzRlODBiNWFlZA==\n\nI love this point- “If I can’t play a melody with two fingers, I’m doing too much” (in context of simplicity)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137960189421703188",
    "author": "rae",
    "date": "2023-08-06",
    "content": "how do people go about learning different strumming patterns on guitar when songwriting? i feel like every song ive written lately is the same pattern over and over,  just different chords...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138335509467369603",
    "author": "popaganda.",
    "date": "2023-08-07",
    "content": "And play with palm muting and ghost notes too. And slapping the strings on the backbeat",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138335619131646014",
    "author": "popaganda.",
    "date": "2023-08-07",
    "content": "But just experiment and make your own little catalog of strumming grooves",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153371532324782141",
    "author": "austenballard",
    "date": "2023-09-18",
    "content": "writers/composers: how many pieces of music can you get done in a day? I find I can do about 30 loops, 5-10 instrumentals, or 3-5 demos with vocals. I feel like I'm slacking though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153372318496731226",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I used to make a fair amount of instrumentals and beats but none of them ever really got used",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153374364507586651",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "So on one hand I’m being less precious with beats and instrumentals but being way more precious about the songs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156029624883609690",
    "author": "Slow Hand",
    "date": "2023-09-25",
    "content": "Asking for Chat GPT to replicate someone's style in any convincing way is a massive lift to ask of it. Joni's style is emotionally insightful, nuanced, and witty. Her choices are informed by a lifetime of experience and point of view. It's almost ineffable at times. It feels like magic. Poetry is elusive. Most humans can barely do it themselves at that level. Asking these programs to perform at that level is... a lot.\n\nThere's a meme that I came across recently. It was the jazz saxophonist Chris Potter describing how in order to do what he does he has to be practicing at a level that is 10x beyond what he might actually play in a session. In a sense he needs creative and technical headroom to arrive at what the result that the rest of us witness.\n\nSome poetry follows this same principle. It's deeply, deeply ingrained and considered. The best poetry resonates and hints at things that aren't even explicitly mentioned. There's an iceberg of practice and experience beneath the surface of what we see. All Chat GPT sees is the surface. The final results that we're feeding it. It has no conception of the experiences that it's trying to replicate so it's approximations of something so complex and nuanced are likely to fall flat.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156086058581246023",
    "author": "Josh",
    "date": "2023-09-25",
    "content": "What I think really makes GPT cool is how conversational it is. You can just keep asking it tweak the initial response over and over again until you get what you want. I’m gonna have to play around with this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156578471754092565",
    "author": "austenballard",
    "date": "2023-09-27",
    "content": "this looks sick brb playing around with it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188054994327457822",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "I think that is what I am after; How do you say the same idea or concept/story but deliver it tastefully. Just like the same E major chord could be delivered in different voicings and different style of playing or instruments even. \n\nMaybe it’s just about paying attention to it more. I generally pay more attention to music than words by default, so that might be a factor that plays into it. \n\nTechnically- with drums for example, you can use the same tools, try to play it or sequence it with the feel as close to it as possible, and break down what’s on it in terms of processing. If I go further, I can look at how the drums are interacting with the rest of the ensemble. If I just want to rip off the drums from a song, the first three will pretty much get me there. \n\nD’Angelo’s Voodoo is an album I constantly go back to study for the band interaction. Questlove is usually playing straight eighth notes, and very simple pattern. but how open the hihat is, and where he’s hitting, and when he makes the choices to pop the hihat out or kind of let it hide behind the instrumentation is very interesting. Perhaps subtle spontaneous decisions like that isn’t really replicable but I just take it in physically and try to see why he made this by looking at what other instruments are doing. You can just pay attention to how he plays hi hat and go wild playing just the hat along",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188060464068960266",
    "author": "rae",
    "date": "2023-12-23",
    "content": "I didn’t even think about D’Angelo till you mentioned that example - I haven’t listened to him in like a year so my memory is def hazy of that record (it’s brilliant tho). D’Angelo is def an artist I didn’t focus on the lyrics of when I was delving into his work - similarly with artists like Tate McRae where they are the type of artist you listen to to hype you up. I’ll have to give Voodoo another listen for the drums!! Whenever I’ve studied instrumentation I’ve always focused on how the music has served the lyrics so if you were to take the lyrics out would the instrumentation tell the original story or would it tell a different story?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199445712681828525",
    "author": "jonmatteson",
    "date": "2024-01-23",
    "content": "Wanted to ask producers who also write with artist what their writing sessions look like? \nAre you preparing tracks before hand? Making stuff on the spot?\nSitting at the computer or sitting together with acoustic guitars beforehand?\nHow long are you hanging before you start writing?\nI find my hangs going pretty long especially on the first write with someone but that usually leads to better lyrical content. However I want to be more intentional with our time without it feeling rushed. \n\nI’m working on my flow and would love some insight into what other people’s process looks like.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199473948597956669",
    "author": "Deleted User",
    "date": "2024-01-23",
    "content": "A couple of things I always do before and during sessions\n\nHave some things ready to play so collaborators can understand my background, and same with collaborators. I would ask them to play some things they did and grew up listening to so I can understand where they are coming from with decisions or comments they make. \n\nAlways set up so it’s ready to record. have a phone running on record whenever music is played and the computer isn’t recording\n\nHave a few small incomplete ideas at disposal before walking into the sessions. Could be a simple guitar chord progression with a little something on top, could be riff or banging drum patterns. Important thing here for me is to continue moving on to next ideas if I don’t get an immediate response (which is usually singing on top) and continue to work my way into it. \n\nI like to have full drums ready to go somewhere on my computer. So I can just import it in, and it will get people moving. Splice drum loops are fine too. Some sort of instant vibe is needed in my experience. Splice really helps with that, because then you don’t have people looking at the back of your head trying to dial in drums or synth patch for more than 5 minutes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199780906785845258",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-01-24",
    "content": "I try to get away with as little preparing as possible these day simply bc I don‘t want to presume what the artist wants to do. It‘s easier rn for me though bc I‘m still at uni so I work with people I know well and tjey dont have to pay me for studio time. \nBut usually we‘d start an idea and once we agree on a vibe I‘d start laying down some drums or instrument\nFor me the most important thing is always to be super aware of what the artist is doing and really be attentive towards any good ideas they come up with while they‘re in the flow \nLike picking up on a small lyric idea they might be mumbling stream of conciousness style but might be a great overall concept",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205710220161065010",
    "author": "austenballard",
    "date": "2024-02-09",
    "content": "I've had a few sync placements, not songs though - entirely instrumental pieces. Every successful placement has been through direct contact with a supervisor - I don't really send much to libraries.\n\nMost of my song placements with artists have been with people who are essentially friends of mine who ended up co-writing the final songs that went out.\n\nI've never successfully placed a song with an artist through an A&R with the exception of the situation I described above",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205824997445079051",
    "author": "Deleted User",
    "date": "2024-02-10",
    "content": "https://www.sweetwater.com/insync/the-magic-of-joni-mitchells-open-tunings/\n\nsweetwater’s shameless plug “here’s a link if you need an acoustic guitar to try this on” in the article though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205907756733833276",
    "author": "popaganda.",
    "date": "2024-02-10",
    "content": "The whole point is that it’s easier than playing in standard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212436517159436368",
    "author": "Will Melones",
    "date": "2024-02-28",
    "content": "In college I got the opportunity to go listen to a bunch of Nashville songwriters play songs they'd gotten cut, and some of their performances were so much more compelling than the hit records. Gary Burr singing \"That's My Job\" about the death of his dad is a thousand times more moving than Conway Twitty singing it, but I guess it went gold and made somebody a bunch of money anyway.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217999183466991708",
    "author": "Slow Hand",
    "date": "2024-03-14",
    "content": "Yup. Big jazzer. He picked up guitar around that time and was writing a lot of country/beach boys-esque stuff with the rest of our roommates as well as a lot of technical Deerhoof-y stuff in a band called Celestial Shore (good album, btw!).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221435603791646822",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-24",
    "content": "I was privileged enough to be a teenager during the 2010 club banger era. Back then I hated it but looking back it‘s fascinating that at every club I went to people who might not have been musically inclined at all could sing along every word of the songs of that era, think Hangover, DJ got us falling in love, all the avicii stuff even levels which is mostly instrumental. There seemed to have been something magical about those lyrics and that particular kind of songwriting that really resonated with people and created an unbeblievable sense of unity. If you‘ve ever been in a club with hundreds of people singing along to Hangover on the top of their lungs you know what I mean. Raw power. It‘s easy to dismiss those songs as stupid but there seems to be something primal about them that really connects with people",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232647019361730621",
    "author": "Marshall",
    "date": "2024-04-24",
    "content": "Insane lyric writing mixed with great harmony between the melodies and the instrumental",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242449834611445922",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-21",
    "content": "https://music.apple.com/at/album/raider-ii/674008092?i=674008202 the silences inbetween the piano chords in the intro are so long it almost seems like he‘s taking the piss but they add sooo much tension",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287548237129056317",
    "author": "thegreatcarsoni",
    "date": "2024-09-22",
    "content": "Hey guys! sorry for the essay, got somethin on the brain i'm interested in your thoughts on...So i'm not much of a songwriter, and writing sessions tend to give me a lot of anxiety. it's something I'd like to get stronger at but don't totally have the bandwidth to dedicate resources to right now. Regardless, one of my good friends and I have committed to a sort of \"exposure therapy\" in getting together once a week or so to make stuff. My friend is an excellent guitar player and we've worked together in various capacities for a long time, but every time we get together the stuff he brings to the table is just balls out riffs and fanciful effects/tone that don't really translate to a seedling of a song. I have a hard time hearing where to take things or having a clear feeling about the sounds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287548759689134251",
    "author": "thegreatcarsoni",
    "date": "2024-09-22",
    "content": "I want to find a more constructive way to allow for the genesis of real song ideas, because we keep ending up with 4 to 8 bar loops of.......something, usually involving a flashy guitar riff. But i'm just not excited about that kind of stuff and I'd like to able to translate my feelings about music and what I want to make into a fun way to lead the session, rather than just telling him \"idk what to do with that riff\". i feel like we're on the verge of figuring out a formula but the whole process is an emotional drag and really tiring.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287560382415638549",
    "author": "thegreatcarsoni",
    "date": "2024-09-22",
    "content": "Love this, thanks so much. This has really been an exercise in getting me out of mixing brain as much as it is getting him out of guitar brain and start trying to orbit a song. Trying to make it less about us haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324815186938429471",
    "author": "SoundsLikeJoe",
    "date": "2025-01-03",
    "content": "Do the songwriters get paid to create those demos?  No...  but they often PAY OTHERS to help them make the demo possible.  Nashville folk will often have \"Demo Days\" where a group of Ace players charge a flat fee to perform and record the rhythm section (for instance, could be anything the song needs). They might record 5-10 tracks in a day. I'm sure some have done more. These \"demo day tracks\" are used by songwriters to then pitch their track to recording artists, labels, anyone.  There's also a whole army of producers ready to help songwriters demo-up...  where the songwriter pays a producer to turnkey the track.  Sometimes it's one guy playing everything or a few remote players all chipping in under the producers direction.  \n\nAnd...  these are viewed as a \"very basic demo\" in the eyes of industry vets. A really good \"one take\" by great players with high quality equipment recording the basic tracks is a strong demo but not fully produced. Happens all the time, but the producer (and their team) gets paid by the songwriter (or their team) to produce the track.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324831355971964979",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-01-03",
    "content": "That's so interesting! \n\nTangent, it's crazy to hear about Nashville songwriting ways being from Sweden, which is so much more single producer centric. I was just watching some BTS of Nathan Chapman & team talking about how they recorded the Taylor Swift album Fearless in like, a few takes per song at Blackbird Studios right after she just brought in songs she wrote and played them for Nathan with her guitar. So cool, and fast. Great records",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324835054970601565",
    "author": "SoundsLikeJoe",
    "date": "2025-01-03",
    "content": "American Hip Hop and Pop are much more \"single producer\" centric too.  Even then...  there's often a team of people behind the curtain.  I know a gospel keyboard player that does A LOT of top-line ghost writing for big names in Hip Hop.  On the surface it LOOKS like a single producer, but there's a group of people helping behind the scenes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328124163029860553",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-01-12",
    "content": "A friend of mine has it. We used to play from it all the time. So good",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339731298289451149",
    "author": "peterlabberton",
    "date": "2025-02-13",
    "content": "I circled around some of these ideas a few years ago here, but now I’m more seriously thinking/asking for advice…\n\nI’ve never written a song in my life, and don’t have any real desire to do so (more than happy to be mixer/producer/drummer/multi-instrumentalist guy). But, I have a friend who is a super prolific writer. He has his own artist project which I’ve produced/mixed, and a few years ago had a publishing deal and has a good deal of writing credits. We’re a really good yin/yang pair: he’s focused on melody/lyrics/chords, I’m focused on rhythm/sounds/texture/mix. We have a co-credit for a Suki Waterhouse song for the one and only explicitly “writing session” we’ve done together.\n\nI just reconnected with him and mentioned that I’m about to be in a position where I could do more open-ended writing (/spec production?) sessions and would love to work with him again—specifically on some projects that have approached me more in the writing stages, and most especially on reaching for bigger artists. And he’s down!\n\nHere are my questions (and this is a *total* explain it to me like I’m five situation—I’ve really struggled to make sense of things business/session flow-wise outside of getting paid for a discrete deliverable or a day rate):\n\nI don’t feel a need to be too formal about things right now, but is this sort of partnership where we could pursue a joint publishing deal?\n\nMy main motivation is two-fold: keep a foot in production/engineering while I’ve leaned more and more into mixing recently, and use our credits to get in a room with bigger artists. Am I way off here?\n\nAnything I’m missing/obviously oblivious to?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385323837729800394",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "Sounds like somebody needs fingy bootcamp\n\nAlso totally true about learning an instrument / practicing almost always results in organically finding something that makes your ears perk up like ‘oh hold upp’",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385326283692576889",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "Which involves a mix of knowing how to get out of your own way, and getting back to the mental space where you subconsciously remember that it’s called “playing music” not “working music”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392901535360483460",
    "author": "kidcutler",
    "date": "2025-07-10",
    "content": "Into it, piano demo, it found the bpm of me clapping & of the piano & sorted out they were two different things",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1399098493771055196",
    "author": "Nomograph Mastering",
    "date": "2025-07-27",
    "content": "If I distilled everything I’ve learned about making music into suggestions or guidelines or rules I could spend the rest of time playing you records I love that were made in exactly the opposite way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471654730995466455",
    "author": "revolution",
    "date": "2026-02-12",
    "content": "im not a professional, pretty new to music in the sense of trying to create a product/song. Ive been an instrumentalist, engineer, writer, etc etc as a hobby or interest from time to time... and i notice that writing is one of the areas that I have the least doubts about myself. i fully believe i can write interesting bars/emotions/etc from time to time... but it's very much an abstract 'writing' skill that could be applied to poetry or essays or anything... rather than a reflection of my actual song writing ability.\n\ni want to learn how to hone my strengths and bridge the gap between having or putting out decent ideas (wether lyrical or melodic) and actually distilling a song structure and 'product' if you will. A good analogy is the gap between someone with good cinematography instincts/eye vs a director/writer/editor level of structure or authorship",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472284607972901107",
    "author": "Jack",
    "date": "2026-02-14",
    "content": "Yeah, agreed. If all the repeated components are there (with different lyrics I guess. Verse, pre, chorus) then it’s a rep for sure. I think we get passes on bridges, especially if they’re instrumental. I have no justification for this but bridges have always been latent for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472560839809826901",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "@Brian Reynolds if it gives context, im speaking from a place of doing zero production. i fully agree with @oaklandmatt about not trying to produce or really do any editing while writing. i primarily work off premade instrumentals, and am frankly only interested in the idea/feeling in front of me. in essence its usually a barely consious continuous freestyle. the best ones at least, come up on their own, i am there to maintain the moment and my presence in it. (and to turn on the recorder lol).\n\nso i was speaking almost entirely from an exclusively songwriting pov, and especially taking idea/demo with appeal/feeling to an actual song structure and consumable product/commodity frankly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]