[
  {
    "id": "1187776390855131198",
    "author": "1ggy",
    "date": "2023-12-22",
    "content": "My 9yo working out some lyrics. Better than his old man already. 🏎️",
    "reactions": 23,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1200522135244914768",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "If you're trying to be a highly successful professional, you should do all of these things and be prepared to adjust on the fly.\n\nI pretty much always have full songs, tracks, hooks, and concepts prepared. Much of the time, you won't use any of them on any given day. But good news: they're useful for future days.\n\nI've had all of that prepared and then the artist and I just chat for five hours, then write a song on a piano.\n\nI've had all that prepared and then cut song after song because the artist goes \"what else do you have???\"\n\nAnecdote that might be helpful: I've been in with an artist all week. Me, another producer/writer, and her. The other producer/writer has his rig set up and he also writes topline. We usually bounce back and forth depending on what the song requires. We've all worked together before and we had the whole week blocked out so there's no pressure to perform on day one. But we did three songs on the first day because she just came in firing. The first song she came in with a title and we worked from scratch and knocked it out in an hour. The other producer made the track quick with some existing drum loops he had prepped for her, adding keys and horns as we wrote. Then she asked \"do you have anything to play?\" I played her a track hook I had prepared. She liked it and we powered through that one in another hour. Then we broke for lunch. We caught up. As we were finishing she mentioned this one kinda stupid and sassy idea she tried to bring into another session but the producers didn't like it. So we wrote that one and it was fire. I tapped out a tempo as she rapped the hook idea and just make a skeleton beat on the fly.\n\nBeing way over prepared is rarely going to hurt you.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221123573503230003",
    "author": "oaklandmatt",
    "date": "2024-03-23",
    "content": "I have a different angle you could try. I would focus almost all your energy on becoming a better, more truthful, richer lyricist. That's the only place you'll be original because there's only one you. Paradoxically, it's also the way you'll write songs that have a universal appeal because the more personal you get, the more the underlying universal emotions will resonate with people.\n\nTrying to be analytical about melodies and structure and style when writing has never yielded good songs for me or literally anyone I know. All the best songwriters I've met write all their best songs lyrics first.\n\nAlso, when you have something to say, it's surprising how little you pay attention to the melody. The melodies and structural components seem to just come when your heart is already in the story.\n\nThe only other thing I'd say is learn A+ songs. Learn the lyrics completely and learn the story behind them as much as possible. Then learn to sing them the way the original version is sung. That will expand your vocabulary as a vocalist and reinforce great lyrics.\n\nLastly, technology is going to continue to increasingly replace stylistic innovation. Yeah AI blah blah blah, but already drum machines and synth presets and splice and DAWs. The last thing to be replaced will be you personally writing things from your experience. Songs about your deepest insecurities and songs about your pet gerbil both fall into this category. Explore all of it.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "836143867022934026",
    "author": "Rob Domos",
    "date": "2021-04-26",
    "content": "I once got in a lonnnnnnnnng philosophical conversation with this mastering engineer who was mentoring me back when I was still an artist and he gave me the best assignment ever. He said “I want you to incriminate yourself. Write whatever you least want people to hear from you.” I did and it was the best response I’d ever gotten on something I’d made at that point. It completely changed the way I write",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "900188589231587340",
    "author": "oaklandmatt",
    "date": "2021-10-19",
    "content": "write embarrassingly honest songs about your life. what's exciting you stressing you making you sad making you uncomfortable etc. \n\nps, all the A level songwriters i've worked with are super lyric forward. most people think it's finding a melody then writing lyrics to it, but 90% of the great writers i know are putting their feelings into words well before they're getting on the mic",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075789852584444075",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "Some songwriting-related morning routine thoughts:\n\nI've been starting my day with doing piano scales and vocal warm ups to a metronome and then singing/ learning a song and recording a voice note of it. (recently it's been Tom Petty Wildflowers at the piano). Then I look at my phone and start my day.\n\nHard to know for sure if it's causal, but my songwriting abilities have sped up. I'm quicker in sessions, both with topline and tracks. \n\nI think it's related to several aspects of the morning routine, and they all compound. \n\n*I'm playing music before I'm on my phone, so I'm outputting music before my brain starts reacting.\n\n*doing scales w piano and voice opens up my vocabulary on both instruments and makes me much more comfortable to sing/play ideas when writing\n*doing these to a metronome has improved my timing on all instruments (not just piano and vocal)\n*learning a great song and singing it every morning has massively improved my lyrical writing/ improvisation (probably the hardest part of songwriting) by just reinforcing good *sounding* words.\n*singing and recording the same song every morning for a few days or a week makes me really THINK about vocals and vocal production. How I'm singing the words, how to push certain vowels in a certain part of my voice, etc \n\n@Slow Hand  @Ross Fortune @Will Melones @OJ",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1076849791700574228",
    "author": "oaklandmatt",
    "date": "2023-02-19",
    "content": "Yes exactly! I've found that the best songs are never calculated, they're always just felt as they're being created. They are magical/ incalculable moments. As soon as people start analyzing – \"is this too generic?\" \"maybe we should have a part like **insert artist**\" – the songs loses its magic.\n\nBut the paradox is that you can't  just sit around and wait for them to happen. You have to be in motion. So often times building habits and processes (which are calculated) is a great way to keep oneself in the motion of creating things. Piano scales, learning songs, writing a song a day, etc., are just some of the many ways to do this.\n\nAnd the other aspect is also correct. These are skill building exercises that help the quick translation of creative ideas. It's the emotional and psychological side of workflow. Just like technical workflow – where you want the shortest time between idea an execution – same goes for writing. If you are constantly writing lyrics and singing melodies and playing instruments, when that emotional magical idea arrives, you can translate it more quickly into lyrics, melody, and music.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990465284051709992",
    "author": "oaklandmatt",
    "date": "2022-06-25",
    "content": "have her learn classic songs and write a song a day for the next month or two. repetition in the process with a great musical diet. it is rarely more complicated than these two things",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200603495351464108",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "I always tailor it to the artist in some way. It's a combination of making fresh ideas specifically for them and taking existing ideas that could work (sometimes reworking existing ideas). I never go into a session like an actual blind date where I don't know anything about them.\n\nThe challenge is always do I make something that sounds like what they've done, or do I make something that sounds like where they're going? That's impossible to answer. I've had success in major label POP artist sessions by having a 100 year old piano and specifically not playing tracks. Meaning, you never know if an artist is tired of doing the same shit. Because I have confidence in my skill as a producer, I'm happy to get an A+ ballad because I know I can turn it into whatever production I want. \"In The Name Of Love\" is my most successful example of this. It's an emotional 3 chord piano ballad that was produced into a festival EDM anthem. \n\nI've had the most success being prepared for all options. Mostly because that makes me flexible for what an artist is feeling that day, but also because the more stuff I make, the more music I'm making. If I prep for a session, I'm not working cold. The prep is also like a psychological and creative warm up for me. Prep makes me a better improviser.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "975885922614771782",
    "author": "oaklandmatt",
    "date": "2022-05-16",
    "content": "the answer largely depends on how A&R driven the project is. sometimes the A&R is really running the show (like with a young pop boy band or something) and sometimes the A&R doesn't really matter and the artist is the whole identity. \n\na VERY loose way i often think about it is like this: if you're going to lean toward the A&R, do it on the production, not the songwriting. every great song i've been a part of writing (and i mean literally 100% of them) have been about capturing an emotional moment or excitement that is happening in the room with the people in the room. if you start thinking about \"what does the A&R want the lyrics to be like?\" you're gonna lose that.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200555574601986131",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "There are many stories of people marinating on a song a lyrics evolving over time, but that's mostly an artist who writes by themselves (Leonard Cohen, Tom Petty, Frank Ocean). I have rarely had that experience co-writing",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177707325725884447",
    "author": "Rob Domos",
    "date": "2023-11-24",
    "content": "Just had thanksgiving dinner at Alan Burgman’s house and we talked a good amount about songwriting. If you’re not familiar with his work, he’s 98 years old and has written lyrics for everyone from Frank Sinatra to Aretha Franklin to Quincey Jones to half of the artists your grandma listened to. \n\nAnyways, some good takeaways from last night’s convo:\n\n“Writers these days are more interested in immediate appeal than they are in a great song. They aren’t the same thing. A great song is only a great song if people will want to cover it in 30 years” \n\nHe cares immensely that whatever is being said in a song is worth saying. Does the message have strong intrinsic value?  \n\nHe’s verrrry quick to say he doesn’t like a song.\n\nHe has a strong preference for melody being written before the lyrics, which is particularly interesting consider his career is as a lyric guy. \n\nHe has a strong dislike for slant rhymes. (I disagreed and it turned into a whole family convo about phonetic tension and release)\n\nHe’s still writing every single day without fail. Today he’s writing on an upcoming Pat Metheny record. \n\nHe’s never heard of Drake or Olivia Rodrigo. Mind you his wife was the president of ASCAP for 15 years so this is particularly mind blowing. It shows me how siloed different worlds can be even when they are so similar and near to one another. What wisdom does one silo have on lock that the other is missing? What rules have been taught to us by people in one silo that don’t apply in the silos we ourselves are working in? A lot to chew on here.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328101073243607061",
    "author": "Slow Hand",
    "date": "2025-01-12",
    "content": "Apropos of nothing, this is still one of the best $20 I’ve ever spent. \n\nJust lyrics and chords. I can crack it open at any time and start playing the songs that I know deep in my bones.\n\nSo much condensed songwriting goodness. I wish that this existed for more artists.",
    "reactions": 11,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "829370154273079346",
    "author": "Josh",
    "date": "2021-04-07",
    "content": "AYE WERE DOING THE SAME THING. Finally got a decent income stream in metal and said fuck thaaaattt and moved to pop. I’ve just been writing with friends, using those tracks to get with smaller artists, and pushing from there.\n\nAlso, to add to the cold call grind. There’s a really solid formula I’ve learned in marketing to get higher open rates, and my brother who’s launching a clothing brand just found out a really silly formula to get that even better. He’s getting clothes sent out to major label artists right now for free (aside from the cost of shipping and production) because he’s speaking the right language and sending clothes that people actually want. Same thing can be applied to songs. Might make a little outline and post it in here for everyone because it’s not only super important for the entry level grind, but it helps in day to day communication as well!!",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035057327809773609",
    "author": "Slow Hand",
    "date": "2022-10-26",
    "content": "Does anyone else love the bridge section of songs as much as I do? I feel as if bridges don't get enough love. \n\nWhether listening or writing, I think a good bridge can be extremely satisfying because you tend to get a really interesting emotional counterpoint to the rest of the song, and I love the tension that can come out of that contrast.\n\nMaybe I just love tension in general.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472297813420544222",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Given that this is #✍songwriting-talk , I would strongly advise people who want to learn how to be great songwriters to avoid any production at all when doing the practice we're talking about.\n\nIt's so much easier (and time consuming) to play with snare drum sounds and production transitions than to stay focused on lyrics and melody. Almost everyone I know, and seemingly everyone that asks questions here, just needs to write lyrics and melody over and over and over.\n\nIf you want to get reps to become a producer, that's awesome. Go to #🎹production-talk and talk about those reps.\n\nTrying to also do production while doing the exercises that we're talking about will only slow you down.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "834662921963044875",
    "author": "oaklandmatt",
    "date": "2021-04-21",
    "content": "i would only write about real experiences. if you're feeling scared or vulnerable or nervous to show the world how personal the songs are, you're doing the right thing. it should be uncomfortable. the hard part of songwriting isn't the craft, the hard part is the risk",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032479007997952060",
    "author": "masteredbyjack",
    "date": "2022-10-19",
    "content": "This is such a deep and cool topic. I’m in mastering now, so while I do a lot of collaboration it’s not quite what you’re getting at here but I’ve got a decent amount of experience in the room/tracking/producing. \n\nTo me it is a matter of developing trust and belief with another person. My approach is to be brutally honest with people and let the chips fall where they may. When things are amazing, meh, or bad. As @BatMeckley said…you want the $10k mic. Don’t waste the time with anything in the middle.\n\nSo in short — I’d just tell them exactly what you wrote above. But I tend to be more on the extremes — I’d like to think that people come away from working with me with a deep-seated belief in themselves and their potential but also honest feedback about very specific things we can do better. I actively seek to challenge my collaborators (which I’m sure you do as well). I’ve found people really respond to this if it’s done with the clear intention to help both of us improve and with the curiosity of the potential in the art!\n\nIn short, I’m an extreme encourager but also a harsh critic (in a kind way). I never let someone give up on themselves if I can help it and show love for them by very specifically calling out how I recognize their potential but see areas for improvement!\n\nI feel that I’ve always been able to tell when people do things like “lead with a compliment” or whatever. So that’s my POV on this whole topic…I just like people to be straight with me. When I have dealt with artists who clearly need the validation you’re speaking about….I’ll specifically call it out with something like “stop looking for validation you have the talent to do this now start believing in yourself”…etc. Seems sort of harsh but it really can cut to the chase and open up a deeper level of trust and communication.\n\nSometimes people don’t like this…and that’s all good too. Always lead with kindness and things work out. Depth > quantity",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1221433011405328465",
    "author": "oaklandmatt",
    "date": "2024-03-24",
    "content": "Ok this is one of my favorite topics ever.\n\nHappy to go deeper, but the gist is this: I believe people connect to the underlying emotion, even if their analytical brain isn't reading or understand the lyrics. If the emotion is authentic, the song has a MUCH better chance of connecting. Without that emotion, it is almost impossible. \n\nThe more I write songs, the older I get, the more I work with the greatest songwriters, the more I think that writing an authentic emotion is everything. \n\nA favorite example (I have 100 more, just ask): \n\nParty In The USA. Silly pop song? Or deep truth about the power of music being able to transcend loneliness? Go into the lyric and you realize it's Jessie J writing about her first time coming to Los Angeles: \n\nStepped off the plane at LAX with a dream and a cardigan... am I gonna fit in... everybody looks so famous... I'm feeling homesick, too much pressure and I'm nervous... but then my favorite song comes on the radio... I know I'm gonna be ok... it's a party in the USA\"\n\nTbh I tear up every time I think about this song. Yeah people might not analyze the lyric, but the reason this song will play for the next 50 years (and not the 1mil other simple songs about having a party) is the deep, authentic, universal emotion underlying the record.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261743620416081920",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "I'll give a point by point analysis, cuz why not?\n\nFirst off, I love Irving Berlin. One of the greatest ever. White Christmas, God Bless America, Always, Cheek to Cheek. A master of the craft. \n\nThat being said, adhering to portions of this list could lead a songwriter in 2024 exactly in the wrong direction. Keep in mind two things: one, great artists are rarely great explainers of what makes them great. And two, his career ended in the late 1950s. This means his golden era was pre-Motown, pre-Beates, pre-television, etc.\n\nOk, my thoughts:\n\n1. This doesn't apply any more. He's speaking in relation to a time when music was more complicated. Music is MUCH simpler now. For example, White Christmas has a much larger vocal range than every Selena Gomez song. Also, 99% of songs today are recorded by someone writing it. It's much more important for the singer/songwriter to sing the song in their vocal range than to worry about some future audience. People rarely write songs and then hire a demo singer any more.\n\n2. (and 7 and 8) The best advice on here. Simplify. \"Kill your children.\" Remove things you love in order to make the song more concise.\n\n3. No. The culture changed, there are a million counter examples since Motown/Beatles. Sure, you can write a song without gender (\"you\"), but saying songs SHOULD be genderless is just wrong.\n\n4. Don't write frivolous songs? I'm all about authenticity and connecting emotionally to a song, but this is strangely phrased and doesn't seem very instructive. \n\n5. Every time I've seen people try and follow this, they write bad songs. As the great David Foster said \"There are only 12 notes and 26 letters, and Beethoven and Shakespeare already did it better than you.\" You're unlikely to find original chords, melodies, or words. The only original thing is your own life experience. Don't be \"original,\" be honest.\n\n6. Kinda. I guess I mostly stick to this. But also, there are thousands of great counterexamples after 1960.\n\n7, 8, 9. All great",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "834682721695432724",
    "author": "Slow Hand",
    "date": "2021-04-21",
    "content": "@Deleted User Oh lord, *this*. You've hit it on the nose. We can waste a lot of time in life trying to give people what we think they want from us when it doesn't line up with our own thoughts or desires. Being honest with ourselves and open with others in this way can help to remove a lot of internal struggles that cause us distress. Of course I'm simplifying a nuanced point and everyone's personal context will vary. Nonetheless I do want to give a little positive feedback because while I'm far from a people-pleaser I do, from time to time, have to catch myself shying away from expressing how I really feel on a subject. Again it's nuanced and seems very plain and simple to say so, but being honest in your emotions with yourself and others to the best of your current abilities is going to serve everyone better at the end of the day. Whether you're writing a song or when you're dealing with interpersonal issues.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "865641879492100096",
    "author": "oaklandmatt",
    "date": "2021-07-16",
    "content": "the words \"talent\" and \"genius\" are mostly used to justify laziness \n\nnearly all of the best writers of our time have just done it way more than you",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304992419074412576",
    "author": "Pio",
    "date": "2024-11-09",
    "content": "Something I find really fun and which often gets me out of a rut is picking an artist and imagining you’re in their shoes/writing for them and go. Limit yourself, set a timer, write a song - what words do they use? Listen to a few songs of theirs first and notice what stories they’re interested in telling. I find even if I don’t end up writing a song in their style at all by the end (usually the case) the exercise gets me thinking about the stories I have rolling around my head. Ideas I wouldn’t have thought of as being good for a song. Gets me out of writing the same song too many times, and always makes me realise we have way more songs in us than we thought. Make a weapon out of your empathy and have fun - you can step into anyone’s shoes and try thinking what song you might write if you were there. (The fun challenge is to STLL keep it genuine and authentic to you - kind of paradoxical but I believe heavily in amazing stuff being able to come this way)",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328022413983879199",
    "author": "Zakhiggins",
    "date": "2025-01-12",
    "content": "1. I do it first thing in the morning when I wake up before things like my phone ruin my brain for the day. \n\n2. Make it a routine. I make some time before i have to go anywhere every morning to try and create something. When your brain gets used to the idea that you're going to that place at the same time every day, once you go there then the ideas flow better with time.\n\n3. Understand it's ok to write something bad, with time good ones come. \n\n4. Understand that a song is never actually finished, it can only be abandoned wherever you chose to abandon it.\n\n4.5. Understand that it's ok to figure out what a song means after you write it.\n\n5. Understand that we're trying to make trees, not tables. (As in sometimes it's not healthy to keep refining something till it's too straight edge and the vitality is gone from it)\n\n6. Said it already but saying it again, don't check your phone before you write\n\n7. I don't always write lyrics. Sometimes i write a melody, sometimes a chord progression, sometimes lyrics. Every now and then i do a session of what i call Lego writing, where i try to see what lyrics i wrote before fit with what melody/chord progression etc. \n\n8. Oh and did i mention, it ruins my creativity to check my phone before i make anything? \n\nThis is what works for me, hope it helps you!",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "906129280021463080",
    "author": "Keyron",
    "date": "2021-11-05",
    "content": "i used to write everything on my phone as it’s faster but i got suggested to use the old pen n paper as you CAN SEE WHAT YOU ERASED and this has been game changing for me\n\nso this is my “writing setup” now:\n1. i take a stack of A5 sheets of paper (i just love how small they are)\n2. a sharpie without the cap \n3. my phone to record myself in case i lose ideas\n\ni’ve developed something i call “The Dry Sharpie Technique” with which you challenge yourself to not let the sharpie dry up (duh) and the only way to do that is to keep writing words… eventually you’ll find yourself with\n1. a stack of scribbles and cancelled verses\n2. an incredible song\n3. a “backup” of your process",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1058037149146038312",
    "author": "NoahNeedleman",
    "date": "2022-12-29",
    "content": "I used to do a thing like that with a bunch of buddies in LA every September. \n\nIt started cause I wanted to practice using key changes or modal shifts as a songwriting technique, and so I had rules for myself:\n\n1) first idea that fits, wins. No agonizing over lyrics or Melodies or whatever, if it rhymes and makes some kind of sense, move on with it. \n2) first year: ever song needed a key change or modal shift. Second year: shifting or alt time signatures. Third year: some other esoteric tool I wanted to learn etc…\n3) the moment you’re done, record a voice memo and send it to someone. Mistakes and all. \n\nThe key for these rules was the make the quality of the songs less important than the act of writing. But damn if I didn’t get two or three real winners every year.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058082483704443010",
    "author": "BatMeckley",
    "date": "2022-12-29",
    "content": "Absolutely this. Some of my favorite songwriters did this, it’s a muscle like any other. Katy Perry used to write a song a day. Jon Foreman of Switchfoot would write 3. You rarely get worse at something by doing it more often.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140174853429801000",
    "author": "Rob Domos",
    "date": "2023-08-12",
    "content": "I remember someone onetime saying that Gwen Stafani would never put a line in her song if it wasn’t exactly true. Someone would have a line they thought was banger and she’d reject it on the basis that it’s cap. I’ve been employing this rule the last few months and I think the results have turned out far more emotionally resonant. The songs with untrue statements feel like cardboard cutouts of people where the songs where only true statements are made feel like humans with flesh on their bones",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472308753662611680",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Outside of just getting daily reps, the main goal of this particular practice (the 30 minute write) is that you're setting parameters where you don't have time to decide if something is good. The point is to relieve yourself of any editing and force yourself to quickly write lyrics and melodies. \n\nIt's doing two separate and important things: building muscle memory and teaching to work on instinct.\n\nBuilding songwriting muscle memory is just like learning a language. You're practicing over and over until you learn how to express yourself emotionally. This is the basics component. You'll learn what notes you can hit and what words rhyme and how rhythms bounce. You'll build a foundation that will become second nature.\n\nRelated but distinct, you will learn how to move quickly. It turns out most great songs come in an unthinking way. Until you learn how to write without editing and thinking about what you're doing, you are less likely to write those great songs.\n\nI'm speaking from a lot of personal experience, but also whether it's Hemmingway's \"write drunk edit sober,\" or the Rick Rubin, Pharrell, etc. belief that great songs come from some power outside of ourselves (\"Source\" or God or whatever), learning to create without being analytical is super super important.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155628456181252139",
    "author": "Slow Hand",
    "date": "2023-09-24",
    "content": "I assume you mean for GPT4 to help with lyric writing? \n\nIf so, I think you may be asking too much of GPT. It's not really capable of new or novel ideas. The answers are trite because it's built on repackaging past inputs (most of which are unremarkable), and creating novel ideas (that are also coherent) is hard.\n\nWhat if instead of asking it for lyrics you asked it for situational prompts that you then dramatize and write about? Ask it to role play a point of view:\n\n\"Pretend that you are two quarreling lovers\"\n\"Pretend you are a human and you are currently on fire.\"\n\"Pretend that you are a statue watching people pass by. What would you see?\"\n\"Generate a list of nonsense words that sound plausible.\"\n\"Summarize the plot of the movie *Airplane* like you are visiting Earth for the first time.\"\n\"Summarize *King Lear* in the dumbest way possible.\"",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385595768664096778",
    "author": "Ross Fortune",
    "date": "2025-06-20",
    "content": "I’ve been pushing myself to write more 100 percenters, and lyrics are a challenge for me. \n\nMy studio neighbour sings in a band but writes alone. His tack is to bounce his instrumental along with whatever gibberish vocal guides he’s laid down, then take a walk and have it on loop on headphones. Whenever he gets to a point where his mind is wandering he’s forgotten he’s supposed to be writing, that’s when the lyrics usually come.\n\nHaven’t had a chance to try it yet but it sounds like a good approach",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385770568506146816",
    "author": "Slow Hand",
    "date": "2025-06-20",
    "content": "I've always been inspired by the working relationship between Elton John and Bernie Taupin. \n\nBernie (who strictly writes lyrics) would mail completed lyrics to Elton, who would sit at the piano and write to them. I can see several advantages  here:\n\nA) You have a complete subject, theme, and narrative arc.\n\nB) The dramatic arc of the lyric informs the shape of the music, which can give the lyric additional support and also shake the writer out of their usual approach.\n\nC) The lyric can be stretched or compressed until it finds it's proper cadence and allow the singer (Elton) to find the best melodic fit to support the lyrics.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463942883466805425",
    "author": "Nomograph Mastering",
    "date": "2026-01-22",
    "content": "Repeat verse but with one word changed, love that effect of the full repeat but with a twist",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831233459213172777",
    "author": "oaklandmatt",
    "date": "2021-04-12",
    "content": "i don't know anyone who can truly be writer and editor at the same time. certainly you know if you're enjoying it or not when you're creating. but the best writers i know work off excitement and emotion, then worry about if it's great another day. sometimes you listen the next day and decide it's terrible. but if you try to decide how great it is when you're doing it, you'll usually lose the emotional spark that allows the creativity.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880155087626981396",
    "author": "oaklandmatt",
    "date": "2021-08-25",
    "content": "yes and do it all the time. And write more acapella. Thats the most underrated shit. Truthfully, a lot of the best songs I've been a part of have been started as a lyric/melody combo before any chords were played.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076506185051676672",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "I was moreso a producer and added being a songwriter to it. \n\nFirst off, DO IT. It massively improves your production and usefulness to the music industry. And it's fun as fuck to be good at another thing.\n\nSecond thing. Another way to think about it, especially as a producer, is to start thinking of yourself as a songwriter first. What does that mean? Write lyrics all the time. Keep notes of song title ideas. Make voice notes. And write a bunch of songs.\n\nLast point: tracks and melodies are easy. Everyone can do that. Lyrics are hard. Write lyrics all the time. Lyrics lyrics lyrics. @OJ",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222179366575013939",
    "author": "oaklandmatt",
    "date": "2024-03-26",
    "content": "Definitely doesn't hurt! It's also the easiest part to learn and can be learned through doing. The \"doing\" being pushing oneself to be more honest and vulnerable and authentic about putting yourself into the song.\n\nWhen you focus on analysis of structure and melody, you don't learn how to be authentic emotionally. When you continually write songs where you try to improve emotional authenticity and clarity, you learn structure and melody.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261803179989798933",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "You're absolutely right that trying to copy existing hits rarely makes great songs. He's 100% correct on that point.\n\nI'm saying that songwriters often fall into the trap of trying to be \"original.\" They mistakenly think this means they should try to invent new phrases or not use \"generic\" words or try to do something \"interesting\" with the chords. Instead of doing the only original thing that is possible which is tell your story and express your taste. This is actually much more difficult to do because it's incredibly vulnerable.\n\nYou can compose fully original compositions this way. But it's also interesting how much groundbreaking music comes from direct appropriation of existing popular music. \n\nFrom folk music (\"Blowin In The Wind\" is a melody from another song) to hip hop (all of sampling) to producers and DJs making careers from remixes, playing around with current or past hits can also yield incredible new music.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298684535956963328",
    "author": "Josh",
    "date": "2024-10-23",
    "content": "I like to pace around the room to make everyone anxiously await the genius lyrics I’m about to not say",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463943698365677588",
    "author": "Nomograph Mastering",
    "date": "2026-01-22",
    "content": "Or repeat verse verbatim lyrically but with a melodic variation towards the end, also love anticipating that as a listener",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472011685643554826",
    "author": "oaklandmatt",
    "date": "2026-02-13",
    "content": "You're way overthinking it and trying to find some \"solutions.\"\n\nThe only thing that important is writing A LOT of songs. The only thing. Only. Yes. Only.\n\nWhy? Because forced reps is the only way to learn the language of songwriting. You need to practice over and over to get the muscle memory of writing. It's like the language of an instrument or a literal spoken language.\n\nAny books, tips, videos, classes, spiritual paths, etc etc are only useful right now if they get you to write MORE. But really, you do not need them. I strongly disagree with anyone who says otherwise.\n\nFWIW, my 25 years, billions of streams, platinum hit songs, blah blah has taught me that reps are the ONLY foundation. The best songwriters write all the time and didn't really get good until they'd written hundreds to thousands of songs.\n\n@Zack Hames is on the right track. But don't \"attempt\" to write a song a day. Force yourself to do it. Immerse like you would learning a language. Don't wait to express yourself perfectly, start writing songs like a five-year-old and work your way up. \n\nUnlike mixing where you need to learn how things like compression work, or like playing guitar where it's important to have someone show you proper technique, you cannot learn how to be a great songwriter by anything other than doing it over and over*.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827616829853270036",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "learn your favorite songs in depth. there's always a lot more going on that you think. many of the best songwriters i know just know a ton of songs. not only does it teach your conscious brain, but it builds muscle memory for a TON of good habits. lyrics, rhymes, the sound of words, melodies, harmonies, cadences, vocal performance, etc. Study the greats like @joebegalla said!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "829061668281384985",
    "author": "oaklandmatt",
    "date": "2021-04-06",
    "content": "This is a little of the top of my head, but I'll try and break it down like this. You're mostly going to get work/ collaborators for three reasons. \n\nThe #1 is your work (great songs, in this case). If you make great shit, people will either hear it and reach out, or when you meet someone, you'll send each other things and they'll love your work and want to be a part of what you can do. no matter where you are in your career, this is #1 always always always. When I was starting out, I produced some of the best sounding records for local bands, so other local bands wanted to work with me. Now, I (or my manager, or my publisher) can send a spotify playlist with songs people know, and that helps get me gigs.\n\n#2 is making shit with people you know personally. This is the best way to do it starting out since you don't have lots of great work out in the world. You need a little community of friends that you make shit with. I guess a lot of that will start moving online, but still the vast majority of great work gets done in person. Even during the pandemic, despite all the zoom writing session and remote work, most great stuff was still getting done in person. You gotta find your people and make things. Then you have the advantage of multiple people promoting your work.\n\n#3 is the pure cold call hustle. It's TOUGH. It's a low percentage game no matter what you're trying to do (be it mixing or writing or producing or being an artist). You have to understand that you may get 1% response rate from people. It's not to say it doesn't have value, but if you want responses, you have to have a good pitch and sending out thousands of messages. But the other thing about this is that writing songs remotely frankly fucking sucks compared to doing it in person. Songwriting is such an in the moment emotional thing. Producing and mixing remotely is very very different that doing real time creative vulnerability. This #3 applies more to non-songwriting collaborations than anything else.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "880520432665645127",
    "author": "Josh",
    "date": "2021-08-26",
    "content": "Now that I think of it, the best songs I’ve written are when the melody and lyrics hit me while I’m still fucking with chords, and there’s nothing even in the DAW yet. Gonna spend the next few weeks hopping on voice notes now. Will update my findings.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983982942827212860",
    "author": "jonmatteson",
    "date": "2022-06-07",
    "content": "Chart the songs! This is something that changed the way I learn songs and I encourage every live player to do the same. Writing down everything you’re hearing in your own way seems to internalize it somehow and you will be reminded by your visual cues of what is supposed to happen musically. Also if you change anything in rehearsals you can make a note and not miss it on the next go around!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121200438163800236",
    "author": "LAPhill",
    "date": "2023-06-21",
    "content": "Maybe you come out of the session with one good lyric, one good topline, one good groove. Keep your expectations low for what the end product \"has\" to be and be open to where the session leads you.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178394854213034135",
    "author": "Rob Domos",
    "date": "2023-11-26",
    "content": "His stance against slant rhymes seems to be more about being in favor of things fitting very tightly together and having intentionality and form and structure. He and another friend of mine viewed slant rhymes as mostly a product of laziness, as if the writer couldn’t be bothered to find something that truly fit.  \n\nI countered referencing the hook to an Olivia Rodrigo song where every single rhyme is a slant rhyme, which IMO adds to the value of it because she’s trying to express how things don’t quite fit and how the thoughts in her mind are unresolved, and the rhyme scheme should reflect that to create a unified feeling. \n\nThe lyrics are:\n\nYou’ve got me thinking\nThat two plus two equals five \nAnd I’m the love of your life \nCause if rain don’t fall and sun don’t shine \nThen changing you is possible \nNo, Love is never logical \n\nHere she’s searching and grasping. She’s unresolved. She literally uses a metaphor of the math not adding up. Why would we then make the math add up phonetically? It would weaken the effect. \n\nAlan was meh on it. \n\nI also argued that hard rhymes can be like the phonetic equivalent of a classical Haydn V-I movement that has very little color or tension, and that slight rhymes can be like jazz chords and that adding a 7 and a sharp 11 on top of the tonic chord doesn’t mean you “failed to resolve”. Someone else at the table was like “well show me a truly great song built on slant rhymes and we’ll see. I’m open to it” and in my head I was like “I thought I just did” but they didn’t love it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178399983679049759",
    "author": "Rollmottle",
    "date": "2023-11-26",
    "content": "Thanks for following up. Seems oddly dogmatic or arbitrary of a rule. Seems like a successful slant rhyme is the exact opposite of lazy if it's done with with thought and care, just the same as no rhyme or the most basic rhyme on the planet. Why not use all the tools in the tool bag? \n\nBut...hard to argue with the results...",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204970728886239302",
    "author": "oaklandmatt",
    "date": "2024-02-07",
    "content": "Anywhere from 0-100%, depending on the situation. Some pretty much don't write any lyrics (Benny Blanco, Metro Boomin), other producers have the ability to write all the lyrics (Pharrell, Ryan Tedder)",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205202866952871996",
    "author": "austenballard",
    "date": "2024-02-08",
    "content": "Back in the fall I was writing like 10 songs a day for pitch. Y'all probably saw me experimenting with chatgpt to try to get inspo (it worked, a little bit, for lyrics)\n\nBut what worked best for me was just lying down in bed, listening to the ref playlists, going for a walk, coming back and then just letting whatever flow out\n\nA few of those songs are getting recorded soon by the artists I was pitching to so I guess it worked",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287561324687134760",
    "author": "Slow Hand",
    "date": "2024-09-22",
    "content": "I think this is a good approach. Start by suggesting that you both do the writing with \"stripped down\" instruments like a piano or an acoustic guitar. Or at least an electric with no pedal board. Leave that at home. Something that will force you both to focus on the core song and not be diverted by sonic considerations. Those can all come later.\n\nThink of it like writing a lead sheet: Chords, melody, and lyrics. This is the heart of the song. Focus on getting that right and you'll unlock so much potential.",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1328101522726322340",
    "author": "Slow Hand",
    "date": "2025-01-12",
    "content": "Pro tip: Take it to an office supply store and get the spine chopped and replaced with a spiral bind so that it can lay open.\n\nIt’s criminal that songbooks can still be bound in a way where they won’t stay open by themselves.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463933495637311815",
    "author": "Jack",
    "date": "2026-01-22",
    "content": "I usually majorly struggle with writing second/third verse lyrics when I’ve sat with a V1 + Chorus only demo for too long.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831217917604397087",
    "author": "Zack Hames",
    "date": "2021-04-12",
    "content": "Sometimes, for me it’s more when I let go of caring so much, get less emotional about it and try anything, i feel free and work super fast and go with my gut.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "834679444387004456",
    "author": "Deleted User",
    "date": "2021-04-21",
    "content": "This is a real struggle... When I was starting out with writing songs, I would only write stuff that I feel like people would like or that I feel like would be a cool thing. It never worked out and ended up fake and awkward. And once in a blue moon I would really feel the necessity to write about my own experience it was scary. Scared of exposing myself and what i'm feeling even to the cowriters or people that I'm sharing music with. Fuck, and I'm even shy about sharing it with my girlfriend and my family. Slowly growing out of it by training myself to be emotionally honest and vulnerable. And I also recognized that this issue is not only in songwriting but also in playing music and just expressing myself in general. ** If anyone is also struggling with this, you are not alone. I'd be happy to chat with you **",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842438318423670856",
    "author": "oaklandmatt",
    "date": "2021-05-13",
    "content": "yep. I'd say the #1 thing that ruins songs in songwriting sessions is overthinking and overwriting. Trying to make things too complicated melodically or lyrically, trying to add too much information in a record.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "846514384822206464",
    "author": "Zakhiggins",
    "date": "2021-05-24",
    "content": "Can anyone explain to me how there can be this many people writing lyrics for a song??",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "865594924694110209",
    "author": "chadwahlbrink",
    "date": "2021-07-16",
    "content": "> I - \" I heard a rumor, I'm going to go straight into it, that you wrote 200 songs\"\n> \n> C - \"It seems like a lot, and I honestly… it could be up to that number… I landed on 'reaper', which was the first song I wrote for \"sling,\" and I wrote that July of 2020. And then there was probably around 30 or 35 demos for Sling after that moment.\"\n> \n> I - \"What happens to the other 138?\"\n> \n> C - \"Some are being used for Shelly, my other band, I've sent probably 5 or 6 for Shelly, and then everything else is going in the trash\"\n> \n> I - \"I don't believe you\"\n> \n> C - \"You don't believe me?\"\n> \n> I - \"No\"\n> \n> C - \"I believe myself\"\n> \n> \\- Clairo talking with Apple Music",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032485351819857980",
    "author": "masteredbyjack",
    "date": "2022-10-19",
    "content": "EXACTLY this. There is huge value in finding creative relationships where people are totally open and comfortable. Sometimes it takes challenging people, but sometimes it takes knowing when to go easy as well! But never, at least to me, just telling people something to validate an insecurity",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033165253577547816",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "I also think most of my worst writing sessions happen when we don’t clear the air about what someone is looking for. If I’m writing with someone who doesn’t trust themselves as much or doesn’t feel comfortable leading a session because they’re pretty new to writing, I’ll try to be more of an active guide rather than a sounding board. I’ve also had people who get embarassed to write in front of others so I’ll just chill on my phone on the porch for them lmao. \n\nI think people who are writers and producers struggle to collaborator with that middle ground between seasoned pro/artist with very clear vision, and very “green” artist. They won’t feel comfortable having someone write a whole song for them but they don’t quite trust their own judgement yet either. I think the solution is to practice the idea of commitment.  Sometimes the best writing contribution is letting them do a lot of the lifting, and if the artist gets insecure or flustered, just ask them “well, how do you feel about the idea/line?” or “what about the line feels awkward?” That way you’re helping them to actually make decisions—now they’ll be able to write with you or anyone else, or completely solo.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058037377202921524",
    "author": "Zack Hames",
    "date": "2022-12-29",
    "content": "I’ve done This several times. \n\nHere’s my philosophy on it: try to write a song a day. Even if you don’t “succeed” you’ll spend more time writing than you probably would have otherwise so it’s a win. Don’t beat yourself up about it, that’s the worst thing.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070188693073170492",
    "author": "Slow Hand",
    "date": "2023-01-31",
    "content": "Hmmm. Fun challenge. So both of these songs seem to be pretty heavy on evocative or surrealistic imagery without an obvious central subject (if there is one at all).\n\nHow about this idea: For each section of your song pull up a movie scene that you know or enjoy. Then write down everything you see without explicitly giving away what movie scene it is. Describe everything. Pick out details. Whether their actually represented in the scene or you're just speculating on something that *could* be. Or make up descriptions of the scenario beyond what's actually spelled out:\n\n*Two people casting glances across the room. One doesn't notice*\n*Hard shadows stretched across the floor*\n*Does he have enough cash in his wallet?*\n*Somebody's running late*\n*The room is thick with tension*\n*Someone did the crime*\n\nI dunno. I'm just spitballing, here.\n\nOR start mashing concepts together. Things that don't normally co-exist. You're bound to get some evocative results. Cedric from *The Mars Volta* fits into this mode pretty well. His lyrics are extremely evocative but after all these years I still can't say for sure what they're actually saying. If there's a coherent thought in his songs it's so far obfuscated that you'd never know anyways.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081124074140479571",
    "author": "ALXCPH",
    "date": "2023-03-03",
    "content": "This should be the lyrics to the discord 2023 collab track 🔥🍫",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153456659016982570",
    "author": "oaklandmatt",
    "date": "2023-09-18",
    "content": "It's always different and that back and forth is the most important part of what I do. \n\nI try and create and listen emotionally, then refine analytically. Going back and forth between those modes is always something I'm doing, trying different methods, being flexible.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178408050089009334",
    "author": "chrissorem",
    "date": "2023-11-26",
    "content": "Good point! Pop culture has changed drastically and is moving at record speeds. And there seems to be two categories. musicians/bands and entertainers whose specialty is music.  I often think the world of speed dating song writing is not a great catalyst for writing  a great song.  Not that it can’t happen but the structure generally leads to mediocre songs that are written in forms we can predict.  I do miss the arch of a well written song with melodies give me chills and a bridge of that breaks my brain.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178501866796097567",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-26",
    "content": "Sounds like an interesting conversation!\n\nI always seemed to me like the one thing many of the best writers have in common is not a specific ideal, but an incredibly strong belief in their own taste. Perhaps a learning to take away from that convo isn't that slant rhymes suck, but that great writers are incredibly good at identifying what they like and don't like",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412163602835701973",
    "author": "oaklandmatt",
    "date": "2025-09-01",
    "content": "Here's one of my favorites from bob dylan:\n\n\"it frightens me, the awful truth, of how sweet life can be\"\n\nI like it for a lot of reasons. It's got so many emotions in it at once. So many things in life are emotionally complex and hard to put into worlds. This line sums up beautifully the realization of what his life could've been like with someone he knows now he will never be with. Hits me hard every time.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463933343249727519",
    "author": "Jack",
    "date": "2026-01-22",
    "content": "I think there are two schools of thought here:\n\n1. Fuck it, do it. Path of least resistance. You’ve tried other lyrics, they’re not hitting. Cut V1 again with a different vocal, do some arrangement modification and send it. \n\n2. Nobodies heard this song before, whatever icky stimulus you’re receiving from attempting V2’s can probably be attributed to your personal saturation of V1; something nobody else will struggle with. So get a decent V2, accept it won’t hit the same for you because you’re cursed and send it. \n\nBoth work!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827668863486263306",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "If you're a producer and not a songwriter, and you want to be a songwriter in sessions, start writing songs on your own. Write 100% songs yourself, where you write all the lyrics and melodies and record your own vocal. The first 50 will probably be trash. That's ok. You don't have to show anyone. Just finish the songs and then write more. Put in the time and then you won't have any hesitation in a session because you'll be a songwriter.\n\nWatch the Ed Sheeran doc for more inspo. He wrote 2-3 songs a day for ten years. That's why he's so good. There's no shortcut. Just start writing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827669650590138398",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "that's how he got good. that's how most great writers I've worked with get good. write write write and challenge yourself to be more honest and vulnerable as you go",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "844384828454862889",
    "author": "oaklandmatt",
    "date": "2021-05-18",
    "content": "@Alan McKee I love this topic. People connect to the emotion of lyrics way more than the literal story. yes, the lyrics are important in that catchy memorable things are important. But more than that, lyrics are the way to express a feeling. \n\ngreat songwriting, like great poetry, allows people to connect their own lives to words that aren't about them.\n\nI didn't grow up in the hood in atlanta but I love Young Thug because I hear his joy and his pain and his bravado in his songs and my heart connects. I've never worked on a farm but when I hear \"I ain't gonna work on Maggie's farm no more\" by Bob Dylan I feel that rebellion and connect it to my life. When the chainsmokers sing \"baby hold me closer in the backseat of your rover that you can't afford and your roommate back in boulder and the mattress that you stole\" I know that feeling because I've been 20 and in love and in a crazy time in life.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012775975416762388",
    "author": "TheBlur",
    "date": "2022-08-26",
    "content": "Awesome! I’m down to set up a Google chat / cal \n\nI am writing a song a day, actively producing singles. If anyone is interested in what I’m currently working on check out \n\nSorry by The Blur or I Don’t Need A Reason by The Blur",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032655868887584778",
    "author": "masteredbyjack",
    "date": "2022-10-20",
    "content": "Absolutely. It's important to be straight with zero ego involved too! And remember we are here to serve the music and artist. Oftentimes honesty is the best way to do that!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036208089847828491",
    "author": "rae",
    "date": "2022-10-30",
    "content": "Hi peeps, does anyone have any advice on writing chords for songs? I’ve always written lyrics with a melody and then given that to someone else so they can fill in the right chords but I really want to be able to do this myself but I struggle a lot with it so I was wondering how other people find the right chords for songs to match a pre existing melody? Thanks in advance! 🥰",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061300275605938176",
    "author": "Will Melones",
    "date": "2023-01-07",
    "content": "I’m still not sure I’m very good at this, but I didn’t know what to even offer as a co-writer until I’d had someone critique me, if that makes any sense. I mean really pull apart one of my songs word for word. Have you ever offered up one of your songs for that experience?\n\nPerhaps the most value you can add is by looking at the song out of context, with fresh ears and no bias, and just determine whether or not the writer’s intention is clear and cohesive.\n\nIt’s a thing close to the heart, so you have to approach it with care (kinda like vocal producing). I can’t think of a time that I’ve ever offered lyrical input if a song I’m producing. It would have to be really detracting from the message.\n\nIt’s another thing altogether when you’re *invited* to offer a critique or help finish an idea…although sometimes I find that the invitation isn’t always an indication of open mindedness.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069759921303867443",
    "author": "ehutton21",
    "date": "2023-01-30",
    "content": "When I was on a song by song basis, I needed to be ensconced and fixated or feel “drawn” hard to work on an idea, and once I started I need to see it though to the end. I also never slept well, needed to adjust tons of deadlines, and so I started to change things up. In some ways, feeling the urge to make moments happen is still part of how I work but I view my writing sessions as flexing the muscles rather than ideas until I know I have that feeling or moment where I am drawn to create, on top of whatever sessions I have. \n\nSo nowadays, my strategy lately has been to change my goal orientation. Rather than thinking about my output in songs or ideas, I think about just trying to get myself into a creative rhythm and a flow state. If I ride my time out further than that, that’s awesome, but I try to make sure I have 3-4 hours a week of quality “flowing” writing time.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075380035998978128",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "i once sent beats out to a songwriter who was working with a new upcoming artist, i included this beat with a hook I made on it that consisted of like 10 words, ended up selling this idea to Sony which was my beat and the idea of the hook as they sung the same hook but included a bunch of their own lyrics",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076491352889634936",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "Honestly, just write 1000 songs.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223697761128677608",
    "author": "oaklandmatt",
    "date": "2024-03-30",
    "content": "Well, it's impossible for them all (or even mostly) to be good. Which is part of what you learn through the process. \n\nYou learn SO much through consistent repetition. You'll learn way more than through any analytical means. Watching YouTube videos, reading books about it, thinking about it, etc are all VASTLY inferior ways to learn to write songs/ lyrics. The best way BY FAR is to do it consistently and for a long period.\n\nWhat you want to do is become a person who writes all the time. If you're not doing that, no other method will get you there. @Marshall",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242672144370897056",
    "author": "AJ",
    "date": "2024-05-21",
    "content": "Really good observation about the live sound trend! Honestly, I didn't even know that was a thing. \n\nI think I'm going to wind up with the silence after all. Thank you! 🙏",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417225387825561791",
    "author": "Brian Reynolds",
    "date": "2025-09-15",
    "content": "\"The truth is you could slit my throat\nAnd with my one last gasping breath\nI'd apologize for bleeding on your shirt\"\nTaking Back Sunday\n\nI still remember walking into Hot Topic and doing what I always did. Walked directly to the headphones, that had 6 CDs loaded up to choose from listening. Drawn immediately to the NJ Parkway signage and a sticker that said, \"If you like Thursday and New Found Glory\". Hit play and I was all in from second one. \n\nThe lyrics and especially the one above I couldn't get enough of on this record. They are so visceral and clever. \n\nThe imagery of having you neck slit is like horror and action movie territory. But here it is in an angsty punk rock song about lost love. \n\nStarting the line with \"the truth is\" somehow enhances the line slit my throat. Its great storytelling.\n\nThen to top all the clever with the killer line of all killer lines. \"I'd apologize for bleeding on your shirt.\" The painful self awareness that somehow thru it all, your devotion remains. Youre still deferential to your tormentor.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472303932561952828",
    "author": "Jack",
    "date": "2026-02-14",
    "content": "I feel like it has to happen away from the computer. I can only speak for myself but there’s this wild temptation when I’ve written 3/4 of a verse or something that has potential to commit it somehow and it just leads to rumination. I don’t think anything unfinished ‘deserves’ permanence. It’s like mise en place or something. I don’t want to get my pan ripping hot while I’m still dicing vegetables.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472572222370480322",
    "author": "Brian Reynolds",
    "date": "2026-02-15",
    "content": "Then back to Matt's advice. Think less, do more. Write, write and then write some more. I used to sit on the train and listen to things like Gym Class Heroes, John Mayer, Say Anything, etc. and write lyrics to their melodies and songs. This is in 2006 before you could just download instrumentals. And by osmosis you'll learn and pick up on their lyrical structures and how they create a \"consumable product\"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472618867023937801",
    "author": "Zack Hames",
    "date": "2026-02-15",
    "content": "Thanks for all the info, it’s good to know where you’re coming from in more detail. That’s cool. \n\nSo you’re focused more on writing lyrics it seems then; I’d say write way more verses for a song than are needed, and pick the best ones to keep. Not only do you get reps but you end up with more to choose from than needed and potentially a better song.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983960610561740812",
    "author": "peterlabberton",
    "date": "2022-06-07",
    "content": "I’m shamelessly on charts for most gigs. I write them in my own little shorthand (either some notation and simple word cues if I’m on drums or basically Nashville numbers if I’m on bass). No way for me to learn loads of music otherwise. I’ll get it ingrained in my head during rehearsal or the first few shows but… I’d say find a way of taking efficient and easy to read notes that works for you and embrace it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009599356481044500",
    "author": "youngteam",
    "date": "2022-08-17",
    "content": "make the thing, be honest with yourself musically and create so you're happy. then you can figure out what to do with it, whether its good or bad, etc. its good to take the pressure off and remember that we are *playing* music - sandbox mentality works best!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012741431594582086",
    "author": "ehutton21",
    "date": "2022-08-26",
    "content": "I would actually be open to this and I’m sure a few others would too! I need to get back to writing more music, and it’d probably be good to have a weekly/bi-weekly little gathering of people to help me self-enforce some accountability in that department",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017293085622947901",
    "author": "itaylerner",
    "date": "2022-09-07",
    "content": "Man, I have so many thoughts on this! I relate on so many levels. 100% agree with everything @NoahNeedleman said.\n\nOn the more zoomed in side of things, I have found a couple things to work extremely well. \n\n1.) specific positive feedback. “Great take” is fine. “Wow, the way you said this specific word really resonated with me, I remember feeling that way as a kid blah blah blah blah blah.” That specific positive feedback makes people feel safe, heard, and valued. “Cool idea, let’s keep exploring” feels really dismissive and tends to make people feel like they’re in boot camp which is not fun for anyone \n\n2.) mirroring emotions for validation. This might be a hot take but it’s what works for me: If they’re totally stoked about it you need to be stoked too. Just as stoked. Just fake it if you need to, ~especially~ in the early writing stages. You can always go back and revisit ideas, but once someone feels like their enthusiasm and creativity and taste is being questioned, it takes forever to rebuild that trust. Mirror their emotions, get excited, be specific. THEN, once you have established the kinship and spent your own time living with the idea and better understanding what would improve it, you can bring up “hey I was thinking and I have some ideas that might be able to make what you created hit even more!”",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032656456715096114",
    "author": "masteredbyjack",
    "date": "2022-10-20",
    "content": "It's all a journey and we change and evolve as we go through. Also, it's incredibly easy to take the \"give it to them straight\" approach on a discord. In real time it's much more delicate and difficult. We are all just finding our way. I think the most important part is to just find ways to be honest and open with people in a style that is natural to who you are as a person. Best of luck friend!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033178733558906940",
    "author": "BatMeckley",
    "date": "2022-10-21",
    "content": "Yeah I’ll be like “this lyric sucks, to fix it what if we had you make it suck less”. 60% of the time it works everytime.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057995968127180911",
    "author": "rae",
    "date": "2022-12-29",
    "content": "Hey all!! Has anyone has done a songwriting challenge with themselves ie. writing a song a day or a song a week? Is it something that you’d recommend doing to get back into writing consistently again? I’ve written a lot less this month than previous due to work and holiday festivities so I’m wanting to get back into the swing of it and thought it would be fun to do something like this. Lmk 🥰",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069694991976366110",
    "author": "Zack Hames",
    "date": "2023-01-30",
    "content": "What is the lifestyle / daily life like for people who write *a lot * of songs (whether it’s the music, production, beat, lyrics, etc)? Are you writing 8+ hours a day? Like really sitting with your instrument/paper+pen/DAW. taking frequent breaks? Going hard for a couple hours? combination of everything? How scheduled is it?\n\nI have been writing songs since....forever. I've gone through various phases of writing a song every day to not writing for months on end. I do a lot of different things but am trying to get a lot of writing done in a relatively short amount of time and would love to just hear people's anecdotes on what your life is like when you are writing a LOT.\n\nI find I can go very hard for an amount of time, then I *NEED* a break. I cannot just write every day for hours on end as much as I'd like to.  If someone has tips to get more productivity in writing, I'd love to hear it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069761248310345899",
    "author": "ehutton21",
    "date": "2023-01-30",
    "content": "Like honestly, it’ll sound crazy to some (or maybe it won’t), but the way high level melodic hip hop artists write has always been the most consistent and accessible method I’ve found when applied elsewhere. The other strategies may work pretty well, but I have more ability when I focus on the flow.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069776572724301874",
    "author": "Zack Hames",
    "date": "2023-01-30",
    "content": "Im slow at lyric writing that’s for sure, but I can bang out a production in a day, if I’m happy with it or not by the end is a different story",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076562788811538623",
    "author": "austenballard",
    "date": "2023-02-18",
    "content": "*I feel tired\nUninspired\nTryna get myself all fired up to write a song\nIt doesn't have to be too long*\n\nNext stanza is yours, go",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101554794658807868",
    "author": "josephmossbridge",
    "date": "2023-04-28",
    "content": "Highly recommend searching this discord for the word “sync” or “sync library” some cool people and knowledge will come up",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121191984980303964",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": "I've always written in group settings, whether in a band or for an artist or for pretty much any other purpose. Even things I've written solo usually end up with one other person on them changing a word or a melody before they go out",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137961808964108309",
    "author": "Zakhiggins",
    "date": "2023-08-06",
    "content": "Making the guitar parts before you make the lyrics is a good start for getting your head thinking that way",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139623628107948133",
    "author": "popaganda.",
    "date": "2023-08-11",
    "content": "Honestly, the best way to find your own voice is to copy people you like until what you love is integrated into your own unique style.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139625068956229723",
    "author": "TrashDoggo",
    "date": "2023-08-11",
    "content": "really thank you for those words of wisdom, sometimes some reassurance and simple words can help a lot, especially with this struggle of mine",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139697317868470343",
    "author": "TrashDoggo",
    "date": "2023-08-11",
    "content": "well if its good then you should use it, and I will, you just got me as I'm editing a track, and those words help me, especially the part about putting your love into it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157017804369825883",
    "author": "austenballard",
    "date": "2023-09-28",
    "content": "alright so as of right now chatgpt remains mostly useless for writing anything even remotely resembling a good lyric or line of poetry\n\nHOWEVER it is quite good at generating vignettes which, provided you have any human imagination whatsoever can provide very solid inspiration for songwriting.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180876120040677376",
    "author": "Chad Rodgers",
    "date": "2023-12-03",
    "content": "Title afterwards generally. Whether it means picking through the lyrics and finding something cool or apt, or just using the main refrain/hook to inform whatever it’s called (90% of the time it’s the latter as I think overly clever or smarty pants titles tend to be lost on the audience).",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188047183694532650",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "moving conversation with @rae here\n\nI've been doing more of \"study the greats\" with production, when it comes to arrangement and production, I feel that things are a lot more clear cut than songwriting. For example, I can try break down the drums of a song into a  drum pattern, dynamics, feel, and the drum sound (type of drum kit, machine, and processing on it). \n\nBut with lyrics (or language) - it feels more gray to pinpoint how to take a concept and apply it into my own writing. How do you usually break it down?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188061512896630845",
    "author": "rae",
    "date": "2023-12-23",
    "content": "In terms of writing lyrics that take a widely used concept/story (like love) and delivering it tastefully comes down to individual experience imo. There’s probably playlists created of greatest songs about love or a specific topic and sifting through those could be cool to see how people interpret concepts and write about them differently - I am def gonna try and do this now that I’ve thought of it 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188126231389024296",
    "author": "cy (sigh)",
    "date": "2023-12-23",
    "content": "Questlove was actively trying to imitate the feel of J Dilla's drums in those sessions and he said he STRUGGLED  because he was so used to trying to be perfectly on time in those days - there's a couple interviews (red bull is ones I think w d'angelo there ). also I forget the engineer's name but he also has a seperate interview (if you haven't already seen it)\n\nbut on the topic I think in my case my fiction (creative writing) background helps a lot. Theresa few exercises we used to get m, some for eveyone and another was based on each person's writing styles. \nfora general excercise teach would have us write down a phrase or two we overheard during the week ina public setting (train. bus, in class etc) and create a short story that Stems from it.  this is good for being able to create things out if nothing - world creation using a set core, \n\nmy natural writing style is v descriptive so one of my peesonal excercises was to write explicit sex scenes every week. it's extremely hard to find the correct balance between keeping it enticing and going over the top and losing either making the readers cringe  or unintentionally laugh. (and we laughed so often 😂)\nall these would be read and workshopped in the class itself. \n\nI think one of my main skillsets now is based in those skills. I'm very good at re-writing / editing and most of all reframing sentences. when other ppl give mea direction to follow, whether  it's just the idea or maybe they already have words and need to readjust to whatever music we now have on hand. \n\njust recently wrote a whole song I thought was too generic and open ended but loved the ideas. pitched to an artist and they loved it. we're working on editing the lyrics to insert a ciuole personal scenarios of hers but most of the vocal melodies and words are actually the same as what I had.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188127214164787200",
    "author": "cy (sigh)",
    "date": "2023-12-23",
    "content": "making things believable to me has a lot to do with creating the proper setting for the listener,  with the music but also guiding them to the right emotion - even if they can't fully relate to the story being told yet. if it feels sad, they'll likely project a part of their own exp on it and connect there.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188283213030899792",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "I think it would in most cases. May not be as specific as having the words in there but it still would serve the same emotions most of the cases",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221397512938852402",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-24",
    "content": "That‘s a very intersting and thought provoking perspective. On the other hand, don‘t you think that a lot of people, especially those who don‘t have as deep of a connection with music as we do, don‘t really care about lyrics that much as long as they have a simple, easy to remember hook they can sing along to? Or at least a memorable melody they might not even remember the lyrics of?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1224082344517046272",
    "author": "AJ",
    "date": "2024-03-31",
    "content": "Somewhat related question:  is there an official server playlist of songs with A+ lyricism?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261811565917765683",
    "author": "youngteam",
    "date": "2024-07-13",
    "content": "Again, love your thoughts on this. The element of reimagining past and present is especially interesting and clearly we owe a lot to the practice of sampling and the culture surrounding it.\n\nOn an ironic note, I think when we as creatives are being honest with ourselves we end up making the most original music we possibly can. No one has lived our life experience, and we are an amalgamation of all our influences from childhood to now.\n\nI could see someone setting out and succeeding in making the most original movie of all time and it being complete shit.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287557823152259266",
    "author": "Calvin Lauber",
    "date": "2024-09-22",
    "content": "Try handing him a bass and asking if he wants to write a song focusing on the root notes, vocal Melodies first, if you come up with something throw a drum loop on it and hand him the guitar and I bet he’d play some cool stuff to it. I get when that’s your primary instrument starting too guitar-brain to focus on the songwriting part",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291876364516982956",
    "author": "oaklandmatt",
    "date": "2024-10-04",
    "content": "My general philosophy on lyrics is that the more personally resonant a songwriter makes a lyric (which is very often making it the MOST specific), the more acute and sticky the universal emotion will be to the audience.\n\nThis is the second song \"From Time\" that he mentions. Just about the most specific lyric imaginable. And hugely emotionally resonant",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304263718883819591",
    "author": "oaklandmatt",
    "date": "2024-11-07",
    "content": "Yes x1000\n\nStudy the best things, even if they don't always seem to apply directly to what you're doing. \n\nMax Martin is maybe the best at making vocals sound A+. He is well known as a detail oriented, vocal-focused pop savant. He is often a part of every choice from writing lyrics and melody all the way to adjusting sibilance in the mix. His instincts for great melody and rhythm, paired with lyrics that sound good, is unmatched. And I say \"sound good,\" because though I think many of the lyrics of his songs are meaningful (especially with the best lyric co-writers), the choice of words and how they are emphasized and enunciated is what separates him from everyone else. It's like Michael Jackson. \n\nDo some YouTube searching on artists talking about working with Max Martin. You can learn a LOT about writing vocal from him.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385025632873746451",
    "author": "Brendan Trinkle",
    "date": "2025-06-18",
    "content": "I love this question, thanks for asking us. \n\nI either write with a guitar & a notebook/phone or I go production first in a DAW. I use a lot of guitar pedals & programmed drum loops to create a vibe & then I’ll write a song to that. \n\nI use Notes to organize things. The parent folder in the screenshot is also kind of an inbox & contains in-progress songs that don’t yet have a folder home. \n\nI use Voice Memos often & have a little naming convention system: \n\n“Working Title proto” for first recording of an idea\n“Working Title YYYYMMDD” for each iteration after\n“SFX title description” for field recordings\n\nI use voice memos as long as I’m developing an idea outside of a DAW. Sometimes I have to let songs brew for a long time, play them out loud a lot, and listen back as an editor with fresh ears before they feel like themselves. Love using these tools to fit that work in while I’m at the grocery store or in the car.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385030307278749817",
    "author": "Brian Reynolds",
    "date": "2025-06-18",
    "content": "I'm always in the daw. Always recording.\n\nSometimes melody first. But mostly drums first.\n\nBuild an instrumental just chasing intuition, quickly. 2-3 melody parts and a bass line on top of drums. And youve got a chorus loop. \n\nThen take that improvisational melody muscle and apply it to the vocal melody. \n\nIm not a big humming guy, I get to words pretty quickly. But will start with common phrases to me like,  \"runnin runnin runnin round runnin runnin runnin down\" I have a few others.\n\nI start to land on a melody, with a feeling and story. That I haven't told. Sometimes it takes 90 seconds, sometimes 5-10 mins. \n\nRecord and comp till I have what I like. Than do all the background vocals. \n\nThen start muting a couple of the melody parts. Find my verses.\n\nRinse repeat the process above. But now I know the story and I just have to find the melody and the thru line narrative.\n\nDepending on how the verses feel running into the chorus. Or short length of track. I'll write a bridge \n\nMelodyne the vocals.\n\nStructure the song.\n\nMix the song.\n\nUpload the song.\n\nMake another.\n\nThis usually takes 2-4 days, intermittent with regular life.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385097239596109866",
    "author": "andrew_yv",
    "date": "2025-06-18",
    "content": "I still write songs and fragments every which way, but the ones that tend to do best are—walk into the studio with no ego, make the first sound I think of, record, sing, nonsense and stream of consciousness, layer, follow intuition, hour or two later come out of the flow and there’s most of a song. Then go for a walk. Lyrics and story crystallize on the walk. Come back and refine. Any more conscious process has a way lower hit rate for me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385324320942854259",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "Anyone else have times where they go lyrics first? It’s not as common, but I’ve definitely built songs around vocal lines that I knew hit enough to have a song built around it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385325965890027581",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "I feel like the truest common denominator I’m seeing across all of these is something like:\n\nDo whatever it takes to get back in touch with your inner child and authentic emotions to create something with a resonating impact - Not just sounds with maths",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385766847168909353",
    "author": "Ross Fortune",
    "date": "2025-06-20",
    "content": "Ah, gotcha. I think. Yeah the way it typically comes together for me is good chords (even better if those chords have a good rhythm), then gibberish melody that might have some real words and phrases mixed in, then lyrics to those melodies. \n\nI know @oaklandmatt is a proponent of lyric first writing. I’d love to get better at that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399088798025126080",
    "author": "Rob Domos",
    "date": "2025-07-27",
    "content": "Ralph Murphy could have never written “Creep” by Radiohead with those rules. Honestly he couldn’t have written a solid chunk of what I grew up listening to",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399130324319076512",
    "author": "Ross Fortune",
    "date": "2025-07-27",
    "content": "What I’ve enjoyed about considering Ralph’s rules is that they’re making me think through a different lens about both the lyrics in songs I know and love, and the lyrics I’m writing and how they work in different contexts.\n\nThe character in Adele’s “Someone Like You” is a loser by Ralph’s definition. But if they weren’t, how would it change how I identify with them? How would I relate differently to their experiences? What emotions would I feel? How relevant would those chords and that melody be, if the sentiment changed? Would the song have legs at all?\n\nI can be a little more cognisant of how much salt I might add next time, and how much sugar I’ll need to  balance it out.\n\nLike when confronted with Jon’s no compression thing a few years back - a lot of us tried it, discovered it’s not an always/never dichotomy, but in doing so gained a deeper understanding of why and when and how hard we can use that flavour and to what effect.\n\nIt all sharpens the axe.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399138675979321426",
    "author": "Slow Hand",
    "date": "2025-07-27",
    "content": "This is a very attractive concept that's been on my mind for the last year. I've been kicking around a personal project to map out some guidelines for clarity. If you or anyone here ever want to sit down and brainstorm on the subject I'd be very open to it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1439348333826015313",
    "author": "Brian Reynolds",
    "date": "2025-11-15",
    "content": "I rhymed \"Hammurabi's time\" with \"victimless crime\" in a verse. Today I'm the winner 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447973646810353745",
    "author": "BananErMat42",
    "date": "2025-12-09",
    "content": "At the lowest point in my life this line by Young on At The Beach just got stuck in my head: Though my problems are meaningless\nThat don't make them go away\n\nIt’s such a succinctly deep lyric on so many levels. It somehow both points out a deep seated feeling of hopelessness, isolation, alienation, loneliness, frustration and dark humor, all in just 11 words.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471659259895746641",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "1. Write a song every day (or attempt) certainly you’ve heard of and likely tried this, but nothing beats reps.\n\n2. More technically, write out the structure (intro, verse, chorus, etc) of some of your favorite songs and mimic it exactly. Even as far as how many measures, or even dynamics (or tempo changes!)\n\n3. If you play an instrument, Learn “great” songs. And ideally sing with them. Playing the best songs in the world will seep into your writing and show you new ideas on chord movements, melodies, and the physicality of a great song.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471897274560024743",
    "author": "Will Melones",
    "date": "2026-02-13",
    "content": "Sounds like you might be into Pat Pattison’s book Writing Better Lyrics. It’s pretty hands-on, and if you do the exercises I’m sure you’ll get a lot out of it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472776139452977224",
    "author": "oaklandmatt",
    "date": "2026-02-15",
    "content": "As I'm sure you already know , there is no such thing as enough. It's like how perfection doesn't exist. \n\nIt may be easier to think of being a writer on a spectrum from hobbyist to full-time artist. The one end is the hobbyist who does it whenever they want and have time (other priorities take precedent). The other end is the artist who is compelled to do it and it has to turn it off in order to live a normal life.\n\nMost people here are somewhere in between. For most of us, the key is to do a combination of two things:\n\n1. Find every way possible at all times to joyfully write. Direct yourself toward it with how live. Write silly things for fun, have a guitar you like to play next to the place you always like to sit, write emotional things for catharsis, write with other people for the collaborative joy, sing in the shower, write on different instruments that feel inspiring, etc etc \n\n2. The harder part is developing habits and practices that keep you consistent. It's easy to write when it's fun. It's harder to write when it's not fun, and that's the time to make sure you're doing it. Daily practices, schedules, deadlines (self imposed or otherwise) are the best way to do this.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827592434095489034",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Yeah. This is a big part of how I came up and got some nuts and bolts songwriting chops. I wanna recommend this book right here: It's their entire song catalog as just lyrics, chord changes, and some chord diagrams for the guitar voicings. This is pound-for-pound some of the most information dense, yet simple, description of good songwriting that I would recommend. https://www.amazon.com/Beatles-Complete-Chord-Songbook/dp/0634022296",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827592666665058324",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Make sure that you get the spiral-bound version so you can lay the book open in front of you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827627245124059176",
    "author": "Tony Chetta",
    "date": "2021-04-02",
    "content": "What are y’all’s thoughts on the producer in a write contributing to the lyric and melody?? And just how to know if your lyric ideas are any good? My write this morning was kind of a bust and as the producer in the room I feel like I probably should’ve tried to spark some concept and lyric ideas but I’m so unfamiliar with that side of things...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "830332601482477568",
    "author": "antoniohannamusic",
    "date": "2021-04-09",
    "content": "Tried to listen to this with an open mind but couldn't hear past the \"my first logic session\" feel of the whole thing. \n\nI don't know that X-Billion dollar AI tech was required to write the song but it might have had some credibility if say they got Dave Grohl to play on it instead of using midi instruments? \n\nIt just feels very sterile and not Nirvana, also, why were there so many sections in the song structure? The bolted on outro.\n\nWould love to know if anyone else here has heard this and immediately got annoyed hahaha!?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "830333759273828413",
    "author": "antoniohannamusic",
    "date": "2021-04-09",
    "content": "Ok, this one is kind of cool. Still feel like they really doubled down on the AI having full control of the song, like, surely any of the humans involved could have been like, okay, let's make the lyrics cohesive.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831263107376349195",
    "author": "Deleted User",
    "date": "2021-04-12",
    "content": "I dig that, I’ve read about this “bad composition” summer school where they discuss bad composition and the final assignment is to compose a bad one. It is an interesting prompt that can lead to weird creativity and open up to letting things go",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "834423140175970354",
    "author": "josephmossbridge",
    "date": "2021-04-21",
    "content": "Any thoughts on writing songs about real people? I’m an artist/songwriter/producer and for the first time I am writing about people who are in my life and it’s scary. I’m consciously keeping everything anonymous in the songs, but it’s still scary thinking about what would happen if the person the song is about hears it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "846531461343608852",
    "author": "Rollmottle",
    "date": "2021-05-24",
    "content": "love to end up with $.03 for writing lyrics on a hit record",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "846766399871516713",
    "author": "Alessandra Morris",
    "date": "2021-05-25",
    "content": "Im gonna start giving my cats and dogs credit for giving emotional support and being the room while Im writing songs 😂 I wonder if you actually can?🤔",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851462412610961458",
    "author": "Yago Ibars",
    "date": "2021-06-07",
    "content": "I've been having a thought on my songwriting I wanted to share here. As a songwriter I have this toolbox of melodic and harmonic approaches  that I can use to solve any problem when making a song, or to have direction to create another section. But recently I've been noticing that something that makes a huge impact on songs is how the different sections relate to the tempo of the track. I think this might not happen to people who write to a beat, but I think that when you are playing an instrument, tempo is so fluid that some parts of a song might \"feel\" good and others won't (at a same tempo). When all the sections flow well into another in terms of tempo (and probably how that affects to vocal delivery) it sucks you in as a listener and it is way more singable/enjoyable. And now I'm starting to see this as a priority more than which notes of the scale have more weight on the chorus and stuff like that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851469831248412744",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I think a lot of it has to do with the melodic rhythm. In terms of how the sections flow, if the melody can drive it on its own- the accompaniment or production will follow. And as you mentioned, high notes can move the energy and accent the rhythm. Lyrical stress patterns could contribute to the accenting and note selections. Weight sometimes means notes that are held longer than the other sometimes the opposite. Contrasts can do a lot though. Range of movement or the range of the pitches themselves, pacing of the rhythm and rests, breaking the patterns/repetition can help with contrast",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851495917428277258",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I deal with (unintentional) inconsistent tempo and some time even time signature/pulse pretty often when working with songwriters and artists. It seems to solve the problem when you tap your feet to the melody. Then you would realize that the tempo has changed. And count 1-2-3-4 or whatever the meter is. So you don’t end up unintentionally having an extra beat because of words and disrupt everything else. A lot of writers ask people for beats first for this reason, but if the melody doesn’t stand on it’s own- relying on the beats will do more harm than good in my opinion. They often end up being mediocre melodies from my experience because there’s already tons of subdivisions and grooves in the beat and the topliner is relying on that to drive the rhythmic feel. But also beats need to come in with pocket so there are space for the vocal melody to fit in. It would be good for writers to start without a beat or instrumentals and it would be good for beatmakers to practice leaving vocal pockets when starting with a beat first",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860161400152653864",
    "author": "antoniohannamusic",
    "date": "2021-07-01",
    "content": "I totally get where you're coming from and obviously it benefits no one if there's 1000 links per day with no follow up.\n\nDon't know if this is a solution but could have set rules around it?\n\n*Limited posts per person (1 x a week?) \n*Must state intention in the post.\n*State genre in the post\n*No spamming, only DM people if you genuienly want to work with them\n*No posting work that isn't yours/ you don't have the right to open up to collab\n*Must delete your post once you find a collaborator - keep the forum clean \n\nSelfishly I want something like this so I could be like: \n\n\"Hey, got a new song I'm co-writing (Think Lauv meets PATD)  hung up on lyrics/melody/stuck on bridge (etc etc), DM to work on it (soundcloud link).\"\n\nInterested to hear your thoughts on how something like this could be implemented!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "867324410527875102",
    "author": "Marshall",
    "date": "2021-07-21",
    "content": "The writers who coincidentally improvise melodies and lyrics that are “in” at the moment ALWAYS fall off once the era they thrive in dies down (which is usually 2-3 years). Those who are calculated know how to evolve.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876189678439657482",
    "author": "Josh",
    "date": "2021-08-14",
    "content": "Doesn anyone else feel like the cadence of a top line says more than the lyrics? I feel like I’ve been doing this for awhile and just started noticing recently when @Rob Domos  told me my run on sentence of a chorus was terrible (I still love you) because it wasn’t perfectly symmetrical with the first half of the chorus. But to me, having that manic performance really struck home the idea that you’re experiencing a blur of the night just to lead up to an extremely quiet post chorus to make it feel like you woke up alone. Both of those themes also reference the lyrics of course. Idk this doesn’t make that much sense without context, but that’s really been on my mind. I feel like I’m broken for not making everything extremely simple but I like to think that even average listeners feel more from the performance and energy of things changing than just having something that’s super predictable. I don’t think people particularly like simple songs over songs that make them feel something.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876190173929545788",
    "author": "Josh",
    "date": "2021-08-14",
    "content": "For reference “I’d love it if we made it” by The 1975 is fucking exhausting to listen to. But that’s the entire point Matty was trying to make. In “Me” he says “I been thinking about killing myself” so matter of fact that I burst out into tears the first time I heard it. I’m “Grief” by Earl Sweatshirt he sounds like he was locked inside for weeks and absolutely does not like shit and does not go outside like the title of his album suggests. I think I’m really intrigued by the deeper connection we can make outside of lyrics and the rhythms in which we sing them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876219864585490433",
    "author": "Yago Ibars",
    "date": "2021-08-14",
    "content": "In my experience the sweet spot is somewhere in between both, as you guys have said. Melodically I tend to be like @Rob Domos and make everything as simple and predictable as possible, but sometimes it feels too easy and there is nothing that stands out. Lately my approach has been to use lyrics and chords to spice things up. For example, If I've got an idea for a lyric that I like, most times the metrics of it won't be incredibly predictable, and when I come up with a melody for it will be a bit more interesting than if I started out with the melody. Maybe then, for another section of the song I'll start with the melody and it'll be simpler. I think contrast is key. It really is an interesting topic!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "879500963218587756",
    "author": "Alessandra Morris",
    "date": "2021-08-23",
    "content": "Do you guys feel that when you change instruments to write a song it’s like a different you writing? 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "899657424347209759",
    "author": "swarga",
    "date": "2021-10-18",
    "content": "Curious…What are people writing about now ? Im struggling to find a theme or story to write about. I listen back to old music Beatles, Eric Clapton, Hendrix… They seem to have unique stories and themes. Do you feel the same ? Any recommendations for artists with great lyrics? Or tips would be appreciated!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "899710723029086248",
    "author": "eliotpeace",
    "date": "2021-10-18",
    "content": "A common theme with lyrics deemed to be great is that they correlate and feel one with the (also great) feeling of the music. Part of my workflow recently has been recording a one mic jam of myself singing (scratch ideas) while playing acoustic guitar, which I then chop up and rearrange into what I want to hear/think sounds best, then I listen closely to the emotion of the song and overdub the rearranged sample with vocal ideas that FEEL correlated to the emotion of the song. I've found I've made some really emotionally vibrant music this way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "899715708798259212",
    "author": "swarga",
    "date": "2021-10-18",
    "content": "That’s such a great idea. I always get stuck with vocals on produced tracks. Trying to put words on an existing theme is hard it turns out. I’ll give this a try! Do you record straight into a daw or voice memos and then import ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "902846518606835722",
    "author": "Sanj Pali (The Pali Gap)",
    "date": "2021-10-27",
    "content": "@swarga Totally agree with the above @oaklandmatt. My advice is just to write write write. Read a lot and be receptive to things around you. With my song Venom (by The Pali Gap on Spotify) my lyrics are really streamlined and I crafted it carefully to cover everything I need to say (down to the syllables and eventual delivery) , but at the early stages it was just rough lines on a few scraps of paper, then did the tidy up later.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937445395993358456",
    "author": "delwin",
    "date": "2022-01-30",
    "content": "I don’t do that but I do use Open AI GPT-3 to generate lyrics when I’m stuck!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937450176606527519",
    "author": "delwin",
    "date": "2022-01-30",
    "content": "Now that I think about it, although I play around with this tool a lot,  it's rare that a line from GPT-3 makes it into a song. Probably because I have no emotional connection to the lyrics!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990458763788038184",
    "author": "ehutton21",
    "date": "2022-06-25",
    "content": "So I’ve got a songwriting question, and I’ll tag @Slow Hand cause I’ve got a feeling with his teaching experience, maybe he knows (big love if you do have advice here man!) but I’ll see if I get any others with good advice here. \n\nDoes anyone have good resources or exercises to help educate a new artist on how to write a vocal melody? I can explain the specific details if necessary but I’ve found myself a little stumped to develop this technique in one of my newer artists. She’s an incredible lyricist with a great instinct and vision, and having her in sessions has really sparked the song creation process, but she’s really struggling to learn the “theory”/musical side of vocal melody and I feel like my attempts to coach by example aren’t strengthening her knowledge or confidence.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990776830195826698",
    "author": "Slow Hand",
    "date": "2022-06-26",
    "content": "First off, I’ll second @oaklandmatt’s recommendation that she start exposing herself to a lot of different songs, learning them, and working her writing muscles. A lot of this melodic intuition will come with time, familiarity and having a feel for what’s possible.\n\nHow is her ear? I’ve worked with plenty of great singers with little-to-no comprehension for theory. While it can help, I find that for some personality types being too technical and trying to get them to learn theory is a turnoff and is never going to happen. Where does she fit on this spectrum?\n\nDo your best to assure her that she can open up and not be perfect right away. It sounds like she might be clamming up a little bit because she feels uncertain or unconfident. I always try to give my singers a place where they will feel comfortable throwing out any idea. Even horrible ones. It’s okay to fail or fall on your face.  Maybe she needs some reassurance in order to open up. Let her know that she doesn’t have to be perfect. Many singers do better when they have a safe space to open up and attempt new things. Even Prince would tell his engineer to leave the room every time when it became time to track his vocals. Hendrix would hide himself behind a wall of gobos where nobody could see him.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "991103829347156049",
    "author": "Deleted User",
    "date": "2022-06-27",
    "content": "honestly, there is nothing wrong with writing a melody for an artist who has more strength in lyrics. of course- all the comments here are great for learning, but it takes time to build skills and if you gotta put something out soon, you may need to write melodies for her while sitting together in a session or bring a songwriter that can help with melody writing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1005916137583820852",
    "author": "Ross Fortune",
    "date": "2022-08-07",
    "content": "> have her learn classic songs and write a song a day for the next month or two. repetition in the process with a great musical diet. it is rarely more complicated than these two things\n\nDecided to give myself a challenge based on this - learning and writing a song a day for two months. Works out around 60 songs, so I'm building a playlist now. When I think of classic songs, my brains immediately goes to 60s/70s, so I'd love to get y'all's input on what you consider classic songs from any era.\n\nMade a collaborative version of the playlist here with some of the tracks I've chosen. Go nuts, please add your suggestions to the list!\n\nhttps://open.spotify.com/playlist/4n87RNhtFqFH6jubhNjG0h?si=e830e26efad7446b&pt=687952fa747c650079044e10be93b1fb",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1006266317243949097",
    "author": "Ross Fortune",
    "date": "2022-08-08",
    "content": "Yeah for sure. I guess the word \"classic\" for me here just means they have stood or will stand the test of time. But that's not the only criteria - I have to love them too!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1006295149522993204",
    "author": "ALXCPH",
    "date": "2022-08-08",
    "content": "That and open guitar chords with close intervals rubbing making it all über EMOtional 🥲",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017287230399721492",
    "author": "Slow Hand",
    "date": "2022-09-07",
    "content": "Perhaps the answer is that we can't always nail it, and we should just write another song in the hopes that you'll land on a truly great idea. Maybe the answer is not a tactical one (what to do/say in the moment), but a broader coaching mindset between me and my artists. Actions I can demonstrate that show that I trust them, or that there's a bigger goal to strive for. Maybe I have to be more vulnerable about my own creative struggles and show them how hard I work to uncover the best approach.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032631395396370462",
    "author": "Chris Doms",
    "date": "2022-10-20",
    "content": "Love this, I’m always gonna be straight with people because that’s just how I am and how I want people to be with me. I find it helps having a conversation at the start of a session too, i let the artist know I can be as involved or detached as they want me to be in terms of feedback/ideas. Usually people like working with me because I’m involved though. I also found having some years of serving experience has helped me with finding the line between being soft but honest.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033164205030907904",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "To go off that ending point: \n\nI’ve dealt with writing situations with complicated people who are more than just collaborators, they’re also friends and the likes etc. Nothing more than my own incredibly limited experience here, but if you can tell them what you’re feeling about an idea, why you’re feeling, and where you think there’s room for enhancement—they should trust you enough to be like “that’s a fair point” or “ I understand why it comes across that way”. But if you’re not the artist, all you can do is be honest and accept when you’re not calling the shots.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033180050960433212",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "I had an English teacher junior year, and he was a hardass and kind of a wisecrack, but he actually wound up being the most epic teacher i had in high school. \n\nHe talked about writing for publications when he graduated and earning his doctorate, and he was telling us the story of how he went to the editor of his journal one day for a meeting about a piece he submitted, and my teacher talked about how he  pulled out his hard copy and very seriously began to explain his piece to the editor. Then editor cut him off and said “Dan, I love everything about what you’re saying. And as for what you’ve written, I like everything about it”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033180111610056744",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "“I just think we should take all the words you’ve written and replace them with new ones”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033180514485534780",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "His point was never that it’s a good way to give feedback, but sometimes there’s something to be said for blunt honesty when it’s been asked for or you know it’s expected. I digress. Funny shit though. Made me feel better when I bombed that first essay lmao. I still email with him when I can.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033198212133167134",
    "author": "Slow Hand",
    "date": "2022-10-21",
    "content": "Is there a word for when someone *Ship of Theseus*'s a promised item? When it's more of a deception?\n\n**Person A:** \"And here we have Abraham Lincoln's famous axe.\"\n**Person B:** \"Wow. So that's Abe Lincoln's axe, huh?\n**Person A:** \"Yeah, except for the head of the axe. That had to be replaced.\"\n**Person B:** \"Ok. So that's his axe?\"\n**Person A: ** \"Yeah, except for the handle. That had to be replaced too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034355966004707348",
    "author": "antoniohannamusic",
    "date": "2022-10-24",
    "content": "Hey all! Loved reading all the responses to @Slow Hand ‘s question.\n\nThe sheer volume of replies really reinforces the “there’s no one way” when it comes to working with artists.\n\nTwo quick examples of that recently - \n\nOne artist I have, loves being challenged constantly and we often play the “that’s cool, but what’s that emotion on 11” or “what would be the life and death version of that feeling?”\n\nI explained that concept to a new collaborator who was like “yeah love that” 2 hours later on a lyric suggestion literally said, “yeah I see what you mean but I think this one is good enough, let’s not bother changing it”\n\nQuestion for you though, how quickly do you change tact in a session and is it something you’re consciously doing or do you pick up on the cue and just naturally address the situation with a softer/harder touch instinctively?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034368091167150111",
    "author": "ehutton21",
    "date": "2022-10-25",
    "content": "Like honestly even just being a halfway decent friend and asking someone how they’re really doing, because you know they’ve got X situation going on and they’re normally in a much different mood, can be a pivot. Once the progressions are arranged and the key song ideas are fleshed out to everyone’s liking enough to lay down Vox, you’re pretty much just swapping visions for a mood and aesthetic and thinking about what you want people to hear from you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1046457190984192020",
    "author": "Eric Martin",
    "date": "2022-11-27",
    "content": "That song rips, it’s almost hilarious how many keys changes happen but it still flows",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1046486405464985660",
    "author": "Ross Fortune",
    "date": "2022-11-27",
    "content": "Yeah they just feel like slight gear shifts, rather than hard lefts like the Man In The Mirror “make a CHAAANGE” one (which obvs I love for the fact it changes on the explosion of that word)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058038205544419328",
    "author": "Zack Hames",
    "date": "2022-12-29",
    "content": "Things I do:\n-Try to write all the music for a song in a day (full structure, verse, chorus, bridge, etc)\n\n-write all the lyrics for a song in a day\n\n-write a chorus or a verse with music and lyrics together\n\n-make a beat or something electronic or pop based\n\n-write completely removed from a computer\n\n-make a drum beat first and jam over that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061019723564843118",
    "author": "austenballard",
    "date": "2023-01-06",
    "content": "Ok word that's what I thought you were referring to",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061272993969475644",
    "author": "Deleted User",
    "date": "2023-01-07",
    "content": "Tips on being an editor of lyrics that another person started? I find it much easier to edit mine, and when someone else asks for help with editing or finishing the lyrics- I have a hard time completing it in a coherent style of language and pov. I just know how to write things my way and not necessarily familiar with writing any other way so it’s hard to imagine what it’d be like to write from a different perspective (eg. of the original writer)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061295853626720308",
    "author": "cy (sigh)",
    "date": "2023-01-07",
    "content": "in my exp you have to be v secure in what you personally like and also secure knowing when something works or not in context. \n\nit's definitely a muscle. writing with artists in the room and being good with constructive criticism are skills that help. \n\ni will argue that its mostly  based on trust though. if theyre asking that means they trust you (to an extent). book editors v often have a relationship with the author, sometimes solely professional but in most cases they develop into more longterm friendship. \nsame with poets. they often work in community and so a lot of exchanges happen. and the trust is built through that. \n\nif it's something you want to practice maybe ask some of the folks  you work with if they'd be open for you be in the room w them writing or try to suggest things to those you're  comfy with - making it clear that the choice is alwaya theirs. \n\nalso remember that most people are actually butt at taking criticism. especially with work that twnds to be personal, how you deliver the message os often more important than the message itself.  a bad critique closes more doora than a good one can open ime\n\nit may not be your thing but sometimes \"i think it sounds great\" is all they really need. \n\ni find that most edits have more to do with flow than anything. thwyre usually pretty settled on what theyre trying to say, juat not sure if it's translating outaide their heads. \n\nive changed 1 single word at times. and moat of the time its because theyre struggling to perform it properly.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061787113672155246",
    "author": "ehutton21",
    "date": "2023-01-08",
    "content": "I agree with everything said here. Editing lyrics for someone or leading a writing session, in my experience, is where people really start to come to you for your taste and their trust in you (and by extension, your taste).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069760210165567599",
    "author": "ehutton21",
    "date": "2023-01-30",
    "content": "“Flowing” being that idea where you’re not thinking about getting to the zone, but you’re just in the zone. It can include anything from just concepts and lyric ideas to even just finding top lines over random instrumentals I have laying around or chords I’m feeling. I’m pretty much just a bedroom guy, so sometimes all I need is an instrumental or even just my midi and my favorite sound. Sometimes I just write down images—it helps with that feeling of articulation if you try to just describe that which is around you or in front of you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069771530172629122",
    "author": "Deleted User",
    "date": "2023-01-30",
    "content": "I don’t write a lot (not including making tracks on a daw), which is why I started trying to write for only 15 minutes a day. I don’t do it every day and still I have more days I don’t than I do, but I was surprised how much I can write in 15 minutes. I try not to question how good it is at all. I just wanted to start a stress free habit. \n\n“Show up” is definitely a thing, but I can’t imagine songwriters sitting in an office alone for 8 hours a day and writing emotionally compelling songs. \n\nMaybe cowriting 8 hours a day or more is doable, because it’s more social and interactive.m",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069771805461590086",
    "author": "Zack Hames",
    "date": "2023-01-30",
    "content": "Or do you mean lyrics etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069773268275441664",
    "author": "Deleted User",
    "date": "2023-01-30",
    "content": "I meant lyrics, I’m not doing much on melody because that doesn’t necessarily feel as much of a separate craft. \n\nBut in terms of all music creation, I try to put hours in as much as I can but doing it alone is taking a toll on me. I’m an introvert, I love being alone but not having any interaction with another person for a long time is really difficult for me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070190349416407040",
    "author": "Slow Hand",
    "date": "2023-01-31",
    "content": "This Timber Timbre song 'Grifting' has an interesting twist on this. The whole song is just riffing on phrases that are all related to the theme of grifting. It's a little more impressionistic and doesn't have an actual narrative of any sort, but it manages to paint a picture of some truly despicable people through free-association. I love it.\n\nhttps://open.spotify.com/track/2rsswxxShjBqoEj7dbr4Sb?si=82ac2066345c4a88",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075377168374308945",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "Has anyone heard of people recording songwriting ideas of just flow/cadence and a melody but no real lyrics?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075377286045503569",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "I can create a nice little beat and flow over it with a nice melody but I can't for the life of me write the lyrics that would then change the gibberish i just sung out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075378729410367498",
    "author": "cy (sigh)",
    "date": "2023-02-15",
    "content": "thats pretty common method for scratch idea /sketches. \n\ndeveloping it from there (ime), is about  finding the right words for the concept of the song (assuming you have one)\n\nI know some top liners (folk who write main melodies in songs) that will sendnit to /work with  someone who may be better at writing actual lyrics (could be the artist themselves at times). \n\nim sure more people can pitch in w more examples or use ideas.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075379628950167582",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "honestly i think im really not good at writing the lyrics but maybe i just need practice eh",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075380255981842463",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "this was years ago and i never really tried to go that avenue but im just thinking about it now as i made a beat, starting making pure gibberish over the top in melody/flow but couldnt write the lyrics, it made me think if i could just do that alone and that would work",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075386842586828800",
    "author": "rae",
    "date": "2023-02-15",
    "content": "@OJ I agree with everyone else in that collaboration could be an awesome avenue! I tend to write songs lyrics first, then everything else and have only once or twice come up with chords/gibberish in place of words first and then worked out the lyrics later - when I was stuck i found walking around my house  for an hour just singing random lines to that pre existing melody I created and recording everything on voice memos to go through later helped a lot!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075389585867149352",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "I wish I could write great lyrics haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075389625746604143",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "Honestly that was a fucking astounding bit of synchronicity. Like, out of this world unlikely. I think it’s a sign",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075402997447798816",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "That's such a good point honestly, to develop the skills to not F the whole opportunity up lol!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075428938001699016",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "But sorry, to answer your question in a nutshell - I think you're right. General good vibes and positivity go a long way, and if you're bringing the goods as well, that's the double threat combo.\n\nI've had writing sessions with people a few rungs up from me, where those people may not have necessarily contributed many (or any) exceptional parts/lyrics/ideas (on that particularly day), but the positivity and excitement with which they responded to what I was coming up with validated me and encouraged me to make parts that I don't think I would've arrived at by myself. There's so much value to having a Vibe Monster / hype person in the room.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075458072006369341",
    "author": "BatMeckley",
    "date": "2023-02-15",
    "content": "This is very much a thing.\nDo you think “I want it that way” makes any actual sense?\n\nA significant chunk of chart topping pop music of the last 20 years is written by someone who English is not their first language. They’ll rough out the right sounds and syllables and hope that a topliner down the line will meld that into something that makes sense. Sometimes that doesn’t happen and the nonsense lyrics inadvertently stay in the song and some random artist sues them claiming that their stream of conscious nonsense was actually stolen from the carefully crafted lyrics of their garage band that no one’s ever heard of (true story). \n\nAlso, you can be eccentric in a songwriting session… (I’m wondering if that 19yo quiet genius was a Canadian phenom cause I’ve had that EXACT same experience) but don’t be a dick in a session. Those guys never last.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075473495049384048",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "Mos def. There are some golden combos that just work (I gather that some writers are lucky to find those groups, and can step off the speed date conveyor belt somewhat). But chameleons also have their place.\n\nIn the case of that beatmaker of few words, he came as a package deal with another beatmaker (neither loud nor quiet) + a third beatmaker who was also exec producing that project, who had a large and gregarious personality. In a couple of sessions he introduced his guys “this is Name A, and Name B. Name B don’t talk”. And that was chill 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076491148262121542",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "I think I need to work on just building up my social medias honestly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076505462515712063",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "think as someone said (or maybe yourself haha) the other day just write and record when ur making the beat, as right now i sometimes make a beat and just sing gibberish ontop but love the flow/melody of the gibberish but going to work on putting lyrics down at the same time to get those reps in🙏",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076509595914207272",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "Haha agreed. They are hard. I feel like I really just fly out quite generic lyrics. Do any of you do practices or something in the past to improve all that?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095960082942013450",
    "author": "ALXCPH",
    "date": "2023-04-12",
    "content": "Fun Word association game!",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1121272827685904404",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": "I agree! I usually start a writing session by doing silly joke lyrics just to get them out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140190484246057022",
    "author": "rawssx",
    "date": "2023-08-13",
    "content": "Wow, that’s actually a beautiful practice to be honest, like keeping it real, Definitely have to try it out. Thank you soo much for sharing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141148609019121805",
    "author": "JakeTB",
    "date": "2023-08-15",
    "content": "HxH would like a word with you 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1145742665770602517",
    "author": "lystell",
    "date": "2023-08-28",
    "content": "I hope it's OK, asking. We're writing a song in which we're singing \"black water\". English is not my native tongue and we're afraid that it doesn't mean what we have in mind. What connotations do you get from that?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1145749102525681695",
    "author": "Slow Hand",
    "date": "2023-08-28",
    "content": "As a native english speaker, I don’t think you have anything to be worried about.  \n\n\nThe image that comes to mind is deep or opaque water where you can’t see through it. Dark water would convey the same meaning in this context if you want an alternative.\n\nTo my knowledge there are no other common interpretations to consider.\n\nNext time you have concerns you can also search the website *Urban Dictionary*. It’s full of idiomatic American slang. Stuff that you won’t find in an official dictionary. \n\nKeep in mind that anyone can contribute to UD so you’re going to get some *very* niche words and even if a word is listed in UD it doesn’t indicate widespread usage. So take it with a grain of salt.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153373537302753360",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I basically do the same thing but I get annoyed at my shitty work half way through and then just open a blank session and start again",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153374958643326996",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I also think I’m on this kick because my music taste was trap all day every day straight into Noah Kahan type shit. So I’m trying to be as much of a nerd about lyrics and melodies as I was about 808 and kick patterns 8 months ago",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153385754463064124",
    "author": "cy (sigh)",
    "date": "2023-09-18",
    "content": "recent switch for me but I used  to just have dozens (sometimes hundreds) of things just sitting.  now i work on building kits and presets and in the process end up making stuff with them or at least getting one or two melodies out of it. \n\nmy main issue is that I get to a point where I start getting different ideas that I wouldn't want together in the same song /beat /inst \n\nwhen I get to that point I'll try a bunch of those ideas and keep the ones I like. after anything sits on my drive for too long without me changing it I open sessions up and export them as multi tracks, Stems or a 2 track (any combination I like really) and keep  them in specific folders. \n\nI'll flip through some of those in sessions (on top of anything I mightve made for the specific session). after a while of those being there. I move them toa diff folder which is linked to to my cloud service and let's anyone I share the link with download (w general guidekines for use) that way friends and ppl I work with can use them in their sessions or for fun. \n\nstart a new batch of stuff and repeat this process. some things I'm more attached to (for one reason or another) I might keep  longer to try to work on or pitch but that's it. \n\nup until maybe 5 months ago my process stopped after exportingthe tracks /Stems and using them in sessions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153445573916110938",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-09-18",
    "content": "Does anybody else struggle with their productivity sometimes bc of the feeling that nothing you do matters? Like sometimes I feel like sitting down and writing a song but then these thoughts creep in ala „for what?“ and „that’s just a waste of time anyways“ \nAnd then I just end up making nothing lol \nIf anyone managed to overcome this advice would be greatly appreciated lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153457186228416553",
    "author": "oaklandmatt",
    "date": "2023-09-18",
    "content": "Like, I have to get detailed and make sure the snare drum cracks with the right high mid attack against the vocals, but I also have to listen to the song and just be like \"do I like this?\"\n\nOn the flip side, I have to create emotionally. Making beats and writing lyrics and melodies quickly and instinctually, then go back a week later and listen to all my ideas on headphones away from the studio. That's how I know which of them are still good.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153748476291731516",
    "author": "Josh",
    "date": "2023-09-19",
    "content": "I honestly don’t find loads of music inspiring. I’ll listen to older records in the car and what not lately. But I find other forms of art to be more inspiring and centering.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156029624883609690",
    "author": "Slow Hand",
    "date": "2023-09-25",
    "content": "Asking for Chat GPT to replicate someone's style in any convincing way is a massive lift to ask of it. Joni's style is emotionally insightful, nuanced, and witty. Her choices are informed by a lifetime of experience and point of view. It's almost ineffable at times. It feels like magic. Poetry is elusive. Most humans can barely do it themselves at that level. Asking these programs to perform at that level is... a lot.\n\nThere's a meme that I came across recently. It was the jazz saxophonist Chris Potter describing how in order to do what he does he has to be practicing at a level that is 10x beyond what he might actually play in a session. In a sense he needs creative and technical headroom to arrive at what the result that the rest of us witness.\n\nSome poetry follows this same principle. It's deeply, deeply ingrained and considered. The best poetry resonates and hints at things that aren't even explicitly mentioned. There's an iceberg of practice and experience beneath the surface of what we see. All Chat GPT sees is the surface. The final results that we're feeding it. It has no conception of the experiences that it's trying to replicate so it's approximations of something so complex and nuanced are likely to fall flat.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156030250040426536",
    "author": "Slow Hand",
    "date": "2023-09-25",
    "content": "I guess what I'm trying to say is that the poetry has to come from you. At least for now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156030556186873917",
    "author": "Nomograph Mastering",
    "date": "2023-09-25",
    "content": "Fun prompt might be to feed it the lyrics to the Wallen album you like and ask it wrote lyrics with only those words rearranged",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156086843088056392",
    "author": "Josh",
    "date": "2023-09-25",
    "content": "I said I wanna write a song like Noah Kahan tonight and asked what chords I should use and it actually threw chord progressions at me.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1156472208948990054",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-26",
    "content": "Just tried it out, really cool for expanding on existing ideas! Feels a lot more useful than other methods I've tried, higher % of useful stuff. The only other purpose built one I've used is https://lyricstudio.net/ - perhaps more straightforward, but when I used it, they were pushing too hard for sales so I could barely trial before it got locked",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157426716810158120",
    "author": "austenballard",
    "date": "2023-09-29",
    "content": "bump in the road: ChatGPT's content policies prevent it from helping me with the kind of lyrics I need for trap songs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157440054306816020",
    "author": "Nomograph Mastering",
    "date": "2023-09-29",
    "content": "(But good rap lyrics)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1173867633670619136",
    "author": "Deleted User",
    "date": "2023-11-13",
    "content": "I’ve been watching Donald Glover’s Atlanta and I love how little details are open to interpretation. Those “open to interpretation” is the next stage of creativity after the work is done once it leaves the hands of the original creators. \n\nSampling is just like that\n\nJust as much as vague lyrics that open up to interpretation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177714892820713572",
    "author": "Rollmottle",
    "date": "2023-11-24",
    "content": "curious about the anti-slant rhyme thing...is it not elegant enough?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177735379458203789",
    "author": "Rob Domos",
    "date": "2023-11-24",
    "content": "IMO for every piece of wisdom the contrapositive is also true. He told me an opposite story last night where he had 1 hour to finish writing a song before it was about to be recorded by Bing Crosby and Louis Armstrong and he was sweating bullets and had to just crank it out. Whatever he wrote down in that hour was ending up on the radio. Frankly I think the moral you’re getting out of this is not only not his point, but maybe not even a good virtue to hold if it leads to you releasing far less of what you love. (I myself am quite guilty of this and don’t mean to come down on you in anyway, it’s just the thoughts I’m having)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178402026200248442",
    "author": "Rob Domos",
    "date": "2023-11-26",
    "content": "It’s hard to say what is a step backwards vs forwards overall when speaking of all popular music. Often you have to sacrifice one virtue to gain another, but there are certainly valuable aspects of music that have been lost over time with popular music. Our melodies and harmonies no longer have long arcs where different points in the journey express different points on an emotional rollercoaster, which was a staple aspect of most classics from 80 years ago. Hell even 30 years ago Disney songs had beautiful arcs. Sing “part of your world” from the little mermaid to yourself and feel the rollercoaster of the arc in that hook. It’s magical. I think that’s a lot of what makes a song like Bohemian Rhapsody so impactful and we have close to none of it these days.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178505214379180113",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-26",
    "content": "Sounds right! Like the \"ideal\" is ever fixed, always in motion. I really appreciate how Max Martin has been so open about how sure they were of themselves at Cheiron regarding their signature sound/style of writing, and how that was what led him to his dry spell years.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178595135920025640",
    "author": "Rob Domos",
    "date": "2023-11-26",
    "content": "This was actually one of the arguments in favor of exact rhymes that I forgot until you mentioned it. A friend of mine talked about the value of constraints",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180865750626480278",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-12-03",
    "content": "Do you guys start a song with a title or do you wait for the title to be „discovered“ as you write a song? Like do you just start writing and then let the title just be a part of the process or even pick it out of everything you wrote after the fact?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180891282286071860",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-12-03",
    "content": "I do the same, though sometimes I would finish writing a song snd then discover that my lyrics can‘t yield a strong enough title weirdly enough \nSo I figured maybe starting with a title makes things easier also in terms of finding the right direction \nI‘ve heard Diane Warren and Bonnie McKee say the same thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182381027642064926",
    "author": "jonmatteson",
    "date": "2023-12-07",
    "content": "i’ve actually gotten rid of most of my template recently and it’s been a much more open way of creating. practice finding sounds you like and building sounds from stock synths/samplers and you can work in any daw or session!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185774432430604288",
    "author": "Slow Hand",
    "date": "2023-12-16",
    "content": "I’m not a lawyer, so don’t take my word, but these days it’s common for the original songwriters to receive a co-writing credit if their song is interpolated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186830627081814076",
    "author": "ehutton21",
    "date": "2023-12-19",
    "content": "Seconding @oaklandmatt. You will need to have some level of legal involvement from one side, depending on who and the size it all varies. \n\n@samvalentine This entity does a lot of work in helping clear samples to my knowledge, I know it’s been a resource to the record label I do work for. I have no idea what they’ll cost for this case or charge if you want to utilize them to clear an interpolation, but they do seem to offer general knowledge consultation. It’s not exactly cheap to clear though—better wording: I make no guarantees about the price it would cost, I see some hefty costs and then some not so hefty costs, but that’s for a business. I could see that varying based on your circumstances. \n\nhttps://www.dmgclearances.com",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188050612550635582",
    "author": "rae",
    "date": "2023-12-23",
    "content": "Ooo this is interesting! I’m the complete opposite 😅 always found production breakdowns harder cause everyone can have the same drum kit/machine but then produce completely different sounds so how do we know it was the drum part that sparked the song yknow idk if that makes sense? I guess you could say the same re lyrics too tho as everyone has access to the same words but we all write differently 🤷🏻‍♀️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188051132321374228",
    "author": "rae",
    "date": "2023-12-23",
    "content": "Lyrics and language I’ve always found easier and I always try to write from the heart which then makes it easier to figure out if it’s ’good or bad’ cause if I believe in what I’m writing then I can deem it ‘good’. I remember asking people for advice on here like a year ago on how to write a song like ‘majik marker’ by mini mansions or ‘everything you’ve come to expect’ by last shadow puppets and found it incredibly hard to write my own version of those songs where you are pulling random words/things and putting them into a song that still has a story to it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188054994327457822",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "I think that is what I am after; How do you say the same idea or concept/story but deliver it tastefully. Just like the same E major chord could be delivered in different voicings and different style of playing or instruments even. \n\nMaybe it’s just about paying attention to it more. I generally pay more attention to music than words by default, so that might be a factor that plays into it. \n\nTechnically- with drums for example, you can use the same tools, try to play it or sequence it with the feel as close to it as possible, and break down what’s on it in terms of processing. If I go further, I can look at how the drums are interacting with the rest of the ensemble. If I just want to rip off the drums from a song, the first three will pretty much get me there. \n\nD’Angelo’s Voodoo is an album I constantly go back to study for the band interaction. Questlove is usually playing straight eighth notes, and very simple pattern. but how open the hihat is, and where he’s hitting, and when he makes the choices to pop the hihat out or kind of let it hide behind the instrumentation is very interesting. Perhaps subtle spontaneous decisions like that isn’t really replicable but I just take it in physically and try to see why he made this by looking at what other instruments are doing. You can just pay attention to how he plays hi hat and go wild playing just the hat along",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188060464068960266",
    "author": "rae",
    "date": "2023-12-23",
    "content": "I didn’t even think about D’Angelo till you mentioned that example - I haven’t listened to him in like a year so my memory is def hazy of that record (it’s brilliant tho). D’Angelo is def an artist I didn’t focus on the lyrics of when I was delving into his work - similarly with artists like Tate McRae where they are the type of artist you listen to to hype you up. I’ll have to give Voodoo another listen for the drums!! Whenever I’ve studied instrumentation I’ve always focused on how the music has served the lyrics so if you were to take the lyrics out would the instrumentation tell the original story or would it tell a different story?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188126548063166514",
    "author": "cy (sigh)",
    "date": "2023-12-23",
    "content": "I think part of it is KNOWING what feeling we're trying to pull from the listener. at least for me, I can push forward much more easily like that. otherwise it can feellike I have too options I can take. often those open ended songs tend to allow other's to out their touch on it more easily but the flipside is things often don't feel \"finished\" to me until those details get cleared up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199445712681828525",
    "author": "jonmatteson",
    "date": "2024-01-23",
    "content": "Wanted to ask producers who also write with artist what their writing sessions look like? \nAre you preparing tracks before hand? Making stuff on the spot?\nSitting at the computer or sitting together with acoustic guitars beforehand?\nHow long are you hanging before you start writing?\nI find my hangs going pretty long especially on the first write with someone but that usually leads to better lyrical content. However I want to be more intentional with our time without it feeling rushed. \n\nI’m working on my flow and would love some insight into what other people’s process looks like.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199476568586715226",
    "author": "Deleted User",
    "date": "2024-01-23",
    "content": "I’ve tried different ways with hangs- I’m still figuring out. And I typically don’t touch lyrics anymore because I’ve found that I’m not that great at lyrics yet and if I don’t have a line (which I usually don’t….), it’s better to leave it be for the longevity of relationship because lyrics can be one of the most personal things in music making because… it is literal. If you are more lyrics person, I think you can get a lot of value out of hanging out. \n\nFirst thing is creating safe space- and it really depends on person to person. Some people never open up, some people can open up immediately. In my experience, the more experienced they are - the more they tend to be the latter. I think how much time you spend on it can be dependent on this. You mentioned wanting to be more intentional, one idea that came to my mind is communicating this from the get go. Obviously there are going to be times where bring this up can be weird in the beginning of the session, but it should get them to think about opening up as part of work at the very least. It needs to be done carefully of course\n\nThe other part of it is understanding the person themselves. Their general vibe and energy. It’s easier to tell with some folks, and it’s harder to know what kind of person it is with some other folks. regarding this, I find diving into work right away helps feel it out. my job is often to constantly create ideas and inspirations. I can often gather some information from how they respond to different ideas. \n\nLastly, I used to spend a lot of time hanging up until very recently and I found it’s so much more productive to just work and bond through that experience. Nature of work calls for connecting on a personal level, but it doesn’t require it. I’ve been trying to take it easy on getting closer with people, and focusing on the overall experience of collaboration and it has been making sessions more productive. So I plan on sticking with this way for a bit and see how it goes!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199780906785845258",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-01-24",
    "content": "I try to get away with as little preparing as possible these day simply bc I don‘t want to presume what the artist wants to do. It‘s easier rn for me though bc I‘m still at uni so I work with people I know well and tjey dont have to pay me for studio time. \nBut usually we‘d start an idea and once we agree on a vibe I‘d start laying down some drums or instrument\nFor me the most important thing is always to be super aware of what the artist is doing and really be attentive towards any good ideas they come up with while they‘re in the flow \nLike picking up on a small lyric idea they might be mumbling stream of conciousness style but might be a great overall concept",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199781214966525973",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-01-24",
    "content": "I almost never jump in straight to work without having a decent conversation first though. For me that‘s so important \nA lot of lyric/song idea came during those early bonding moments",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200555098598821999",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "I go off the assumption that this is the only time I'll have this artist focused on this idea, so my priority is always getting a finished lead vocal and some ad libs. Those are the only things that can't be done without the artist there. I'll get the production together as much as it needs to be to get the artist excited about the song. \n\nThe challenge is doing this quickly, without spending unnecessary time going through snares and patches and shit. I find that nearly all of the best songs I've written happen in about an hour long window of excitement. Sometimes you can stretch and get harmonies or punch in some vocals beyond that hour, but the excitement of a great idea is exhausting and it's hard to keep everyone 100% engaged for a long period of time. If I'm on hour 2 of a song and we're still trying to decide if we like a chorus, 100% of the time it's not a good song (in my experience).\n\nA BIG mistake I make (still) is \"oh we have tomorrow we can take a break and come back.\" It's not about being able to get the artist physically back, but getting everyone back into the emotional space. So much of what I need from an artist is the emotional focused to commit 100% to a vocal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204961324648628294",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "Another difficulty I was facing was being producer and writer at the same time. It‘s really hard to be creative writing a song when at the same you need to handle all the technical stuff, work in the DAW etc \nI feel like my brain is so bad at multitasking in these scenarios lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204969129325625415",
    "author": "Deleted User",
    "date": "2024-02-07",
    "content": "how much of lyrics do producer/writers usually deal with?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205209710920339466",
    "author": "austenballard",
    "date": "2024-02-08",
    "content": "these were almost entirely by myself. some were starters so the artists in most of the cases where things are actually getting recorded, they added/redid lyrics as they saw fit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212435399620821022",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-28",
    "content": "Could I briefly DM u about this? Think it makes more sense if you know which artist it is but I don‘t necessarily wanna post that out into the open too much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221179779189837844",
    "author": "Jonathan Arnold",
    "date": "2024-03-23",
    "content": "What do you use when writing a song and want to add a beat? Splice loops? Superior drummer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221250679964958880",
    "author": "Deleted User",
    "date": "2024-03-23",
    "content": "I’ve never thought of it from the angle of learning the story behind the lyrics. \n\nIt’s something I’ve only done as a listener trying to figure out where the song came from or what the words mean. But I’ve never approached from a perspective of studying those songs - I’m gonna try this out 🤙",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221262626747580478",
    "author": "Marshall",
    "date": "2024-03-23",
    "content": "I definitely need to try this out, lyrics are my weakest point in songwriting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221398080750878750",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-24",
    "content": "For the longest time I thought „De do do do“ by The Police was a silly song until I took the time to really listen to it. But I think a lot of people still think of it as a novelty song bc they don‘t pay attention to the lyrics that much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221426047698997289",
    "author": "Herb🇮🇪",
    "date": "2024-03-24",
    "content": "I think it depends on the person, between people that don't really have a deep connection with music there are those who naturally hear every word and lyric, and those who naturally hear everything else, from my experience with my own friends",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221426176447348747",
    "author": "Herb🇮🇪",
    "date": "2024-03-24",
    "content": "I'm the latter, although with some (few) artists I do naturally listen to the lyrics, but very few",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221435603791646822",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-24",
    "content": "I was privileged enough to be a teenager during the 2010 club banger era. Back then I hated it but looking back it‘s fascinating that at every club I went to people who might not have been musically inclined at all could sing along every word of the songs of that era, think Hangover, DJ got us falling in love, all the avicii stuff even levels which is mostly instrumental. There seemed to have been something magical about those lyrics and that particular kind of songwriting that really resonated with people and created an unbeblievable sense of unity. If you‘ve ever been in a club with hundreds of people singing along to Hangover on the top of their lungs you know what I mean. Raw power. It‘s easy to dismiss those songs as stupid but there seems to be something primal about them that really connects with people",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221467386079875133",
    "author": "Josh",
    "date": "2024-03-24",
    "content": "I’m one of the worst people when it comes to hearing and understanding lyrics and I can’t tell if it’s helped me or held me back as a writer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221480854128431218",
    "author": "Herb🇮🇪",
    "date": "2024-03-24",
    "content": "James Blake and Bon Iver, my ears naturally tune to their lyrics and singing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221480902828359832",
    "author": "Herb🇮🇪",
    "date": "2024-03-24",
    "content": "As hard as Bon Iver’s lyrics can be to make out haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221481079681056809",
    "author": "Herb🇮🇪",
    "date": "2024-03-24",
    "content": "I find a lot of older music too, I naturally hear the lyrics better, could be down to the mixing but also probably down to better quality of writing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222125436583149649",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "I feel like the people who go into writing a song with the heart first are extremely valuable too. It’s like ying and yang. If you are improvising a chorus with a great song concept over a great beat, the melody falls into place……but if it doesn’t, why not use some theory/etc to understand why the topline isn’t just falling into place naturally? Could be a quick fix like switching up the rhythmic phrasing or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222135108299915264",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "Maybe using a different method to write a song every single time you write is the best method, then comparing the outcomes after the fact",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223566756925149284",
    "author": "Marshall",
    "date": "2024-03-30",
    "content": "Why are your tips on learning to become a better lyricist?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223922252106563654",
    "author": "Marshall",
    "date": "2024-03-31",
    "content": "Maybe that’s another example of the structure just coming together instinctually because the story and lyrics were so powerful? Would love to hear about it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225021236891877417",
    "author": "Ross Fortune",
    "date": "2024-04-03",
    "content": "It wasn’t necessarily lyric focused. It was a collab playlist called “classic songs”, however you want to interpret that, but maybe morphed a bit into “songs people like at the moment” 😂\n\nInterested to look back into it over a year later tho https://open.spotify.com/playlist/4n87RNhtFqFH6jubhNjG0h?si=a2pTs0-9Ty-B14pGJNNdEQ",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232647019361730621",
    "author": "Marshall",
    "date": "2024-04-24",
    "content": "Insane lyric writing mixed with great harmony between the melodies and the instrumental",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239018418322276383",
    "author": "Will Melones",
    "date": "2024-05-11",
    "content": "I remember a clip where Dave talks about making the chorus lyric something you’d read on a bumper sticker. Genius.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242288956561817632",
    "author": "AJ",
    "date": "2024-05-20",
    "content": "Kind of a weird question for y'all. What do you think about using moments of silence in a song? The song I'm working on right now has it as a placeholder in a small spot. However, within the specific context it's in, I honestly like the choice and am tempted to keep it. That said, since I've never had any of my songs do that, it's harder to trust my gut instinct on this one.  Thus, I wanted to get some other perspectives on the tactic. I've also rarely heard songs that implement it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261749725456236675",
    "author": "youngteam",
    "date": "2024-07-13",
    "content": "really appreciate you taking the time to share your thoughts on this matt. I agree with you mostly, especially that culture has changed and some of the methods are out of date. \n\nthe only thing I would push back on is 5. I've seen too many sessions centered around imitating other songs based on prompts or trying to copy another hit. I agree that honesty is paramount and trying to be original for the sake of saying you're original is a bad mentality for creating",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261769772903956550",
    "author": "jonmatteson",
    "date": "2024-07-13",
    "content": "I’ve been listening to that podcast “the history of rock and roll in 500 songs” that you posted a few weeks back and it was so interesting to hear that in the 40’s and 50’s it was completely normal to record the same song over and over again. Some bands only used one chord progression and would occasionally change the words or melody and they would consistently get #1’s off the same formula. Many bands would also cover other people’s songs and they would be hits as well.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287548759689134251",
    "author": "thegreatcarsoni",
    "date": "2024-09-22",
    "content": "I want to find a more constructive way to allow for the genesis of real song ideas, because we keep ending up with 4 to 8 bar loops of.......something, usually involving a flashy guitar riff. But i'm just not excited about that kind of stuff and I'd like to able to translate my feelings about music and what I want to make into a fun way to lead the session, rather than just telling him \"idk what to do with that riff\". i feel like we're on the verge of figuring out a formula but the whole process is an emotional drag and really tiring.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291480063430361108",
    "author": "Slow Hand",
    "date": "2024-10-03",
    "content": "Here's a thought provoking clip. \n\nChilly Gonzales describes being in the writing room with Drake and watching Drake continually refine a lyrical idea to be less specific and more universal, and then refining it again in that way, and again...\nhttps://www.ddinstagram.com/reel/C_vU0qysZvQ/?utm_source=ig_web_copy_link",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291874449322151958",
    "author": "oaklandmatt",
    "date": "2024-10-04",
    "content": "This is a strange clip and I have a very different read than you.\n\nSome thoughts:\n\nThe clip is heavily edited. Chilly doesn't mention lyrics (\"he's just looking for a melody\"). Chilly is not a lyricist himself. The two songs he mentions are incredibly specific – not universal – storytelling songs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291876851714883685",
    "author": "oaklandmatt",
    "date": "2024-10-04",
    "content": "I think Chilly must have been speaking about melodies, because the two songs he mentioned are pretty much the opposite of universal lyrics.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291876949463142501",
    "author": "Iwan Morgan",
    "date": "2024-10-04",
    "content": "Chilly released lots of songs under the alias Gonzales and wrote all the lyrics. Far more niche than Drake obvs but he does have the perspective of writing his own songs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291877185912569869",
    "author": "oaklandmatt",
    "date": "2024-10-04",
    "content": "Sorry I meant lyricist on Drake's songs. Also isn't listed as a writer on \"Marvin's Room\" at all.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291877326019104811",
    "author": "oaklandmatt",
    "date": "2024-10-04",
    "content": "Chilly is great. Love his work on Daft Punk too. Not putting him down. I think the clip is not saying what it appears to be saying about lyrics",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298246657313603628",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-10-22",
    "content": "Does anyone have advice on how to battle brain fog during a songwriting session? I have this happen often when it‘s just me and an artist where I have to two do jobs at once (producing/writing) and only having limited capacity for the artist to bounce ideas off me when I‘m working in the track \n\nTalking about this feeling when your head gets heavy/almost like a pressure behind your eyes where nothing will come out \n\nUsually I just take a break but I‘m curious if there are methods that are more efficient and wont make us lose time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298253631908216853",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-10-22",
    "content": "yeah that makes a lot of sense. the room we were in had no AC and you couldn't open a window so that probably wasn't beneficiary for creativity lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304116730381205585",
    "author": "whaleintown",
    "date": "2024-11-07",
    "content": "Hi guys, I was wondering that if you write a song in a different langauge, would it still be helpful to study lyrics from like Max Martin or Top 50 songs ? I thought it's gonna be difficult to communicate in other langauge the same way English does. So is it better to study lyrics in the langauge you wanna write ? Thank you !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304264636681682954",
    "author": "oaklandmatt",
    "date": "2024-11-07",
    "content": "IMPORTANT CAVEAT: while I believe everything I said above, I always have to mention that this is not nearly as important as you just writing 500 more songs. \n\nStudying the greats is inspiring and motivating and exciting and feels good, but doesn't mean much without you writing a song a day for the next year.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328028492562038938",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-01-12",
    "content": "Great stuff above, my experience is a bit different, as I’m sure everyone’s is :)\n\nI find that lyrics is where I get stuck, especially if I’m trying to write to a set melody. The biggest unlock for me was to write an entire song’s lyrics first, sometimes preceded with some journaling and/or research on the topic so I have real, meaningful things to draw from. I keep track of syllables etc so it lines up.\n\nOnce the lyrics are done and I’m working on the song, I always end up having to change a lot, usually simplify and take out, but it’s an easy problem when you have excess good lyrical content. As opposed to trying to summon something meaningful to fit a certain melody.\n\nSimple stuff like starting with getting the chorus right has also been super helpful, and keeping production to a minimum before the topline is finished.\n\nExcited to read more people’s hacks here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331343799829663754",
    "author": "stewart_hidalgo",
    "date": "2025-01-21",
    "content": "Man I wish I had this instead of the book version. I'm always struggling to keep the pages open on the music stand. lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339731298289451149",
    "author": "peterlabberton",
    "date": "2025-02-13",
    "content": "I circled around some of these ideas a few years ago here, but now I’m more seriously thinking/asking for advice…\n\nI’ve never written a song in my life, and don’t have any real desire to do so (more than happy to be mixer/producer/drummer/multi-instrumentalist guy). But, I have a friend who is a super prolific writer. He has his own artist project which I’ve produced/mixed, and a few years ago had a publishing deal and has a good deal of writing credits. We’re a really good yin/yang pair: he’s focused on melody/lyrics/chords, I’m focused on rhythm/sounds/texture/mix. We have a co-credit for a Suki Waterhouse song for the one and only explicitly “writing session” we’ve done together.\n\nI just reconnected with him and mentioned that I’m about to be in a position where I could do more open-ended writing (/spec production?) sessions and would love to work with him again—specifically on some projects that have approached me more in the writing stages, and most especially on reaching for bigger artists. And he’s down!\n\nHere are my questions (and this is a *total* explain it to me like I’m five situation—I’ve really struggled to make sense of things business/session flow-wise outside of getting paid for a discrete deliverable or a day rate):\n\nI don’t feel a need to be too formal about things right now, but is this sort of partnership where we could pursue a joint publishing deal?\n\nMy main motivation is two-fold: keep a foot in production/engineering while I’ve leaned more and more into mixing recently, and use our credits to get in a room with bigger artists. Am I way off here?\n\nAnything I’m missing/obviously oblivious to?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354657767440388278",
    "author": "oaklandmatt",
    "date": "2025-03-26",
    "content": "@peterlabberton  I've not seen a joint publishing deal as you describe it, though I suppose it's possible. Generally it makes sense for everyone to have separate publishing deals as many songs get written with different people and different splits. You could certainly sign to the same publisher at the same time, just with separate deals. Or this person could sign you to their publisher with some finders fee type thing.\n\nWhat it sounds like you're doing is providing a great sounding board and musicianship for someone who is more primarily a songwriter? If so, you would just participate in any songs that are written in the room. If it's the sort of thing where he is really doing the bulk of the songwriting (like all the lyrics and melody, and you're helping with some of the music) you could certainly work out a deal where you get a smaller piece.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356405098821189753",
    "author": "OJ",
    "date": "2025-03-31",
    "content": "I lay down some chords, maybe add a little beat.\n\nGet my vocal chain on. And sing sweet gibberish away for a while. I really enjoy this bit and I'll listen back to the gibberish like this sounds nice.\n\nNow - how on earth do you go creating good lyrics to this melody to make it real?\n\nI realise I'm not really thinking of anything when singing the gibberish, no story line but I tend to automatically say things like \"she\" so almost talking about relationship/love kind of stuff but not necessarily what I want to go for actually.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356413580974751845",
    "author": "Brian Reynolds",
    "date": "2025-03-31",
    "content": "First most of what I'll have to say for this is built on the foundation of this course by Louis Bell of Post Malone, Halsey, and Justin Bieber #1 fame. In this course he spends hours going over exactly how he writes lyrics to his gibberish melodies. Then how he goes about pitching these ideas to artists. After he has 24k Goldn there for a few hours and they write another song to gibberish melody. And you can see how the process are alike and contrast. https://studio.com/classes/louis-bell/hitmaking-for-producers?utm_medium=paid&utm_source=google&utm_campaign=ws_studio_brand_louis-bell_us_phrase&utm_content=studio&utm_term=louis%20bell%20studio&ref=m&gad_source=1&gclid=CjwKCAjw-qi_BhBxEiwAkxvbkH_XdBqN7jbkwQK-0pisWV_MsC4-VSGH_iGfcL85MML5SoRwB01Q9xoCFl0QAvD_BwE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378679290429837452",
    "author": "Pio",
    "date": "2025-06-01",
    "content": "Late to this one, hope your songwriting journey is going great this past while! \n\nIf you’re still looking for more on this, and don’t mind a little reading, I was recommended Pat Pattinson’s Write Better Lyrics years ago and I found it a super helpful tool - I loved the recommendation of a 10 min a day exercise of ‘object writing’, and also the idea of thinking about your verses as a way of ‘loading’ story and fuel for your choruses. \n\nJeff Tweedy also has an even shorter but really uplifting book on writing called ‘How to Write One Song’, which is excellent. It’s more geared towards the personal, less towards industry, but I’m so convicted that writing personal songs IS the way to reach others that I would definitely recommend it too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378682999717236797",
    "author": "Pio",
    "date": "2025-06-01",
    "content": "And if you don’t wanna go buying books, I’d recommend possibly trying out the daily practice of object writing; you could even try it for a week or so, and you’ll end up getting interesting imagery, some of which you may be able to use in your songs - but if you stick at it a bit (I find if I do it solidly in the mornings for a week or two it just warms my brain right up for writing throughout the day) it can help get your brain into that mode, so that when you go into your writing sessions later, your brain is already making those connections. Just an option of course - everyone’s got their own way with lyric, it really is so personal. Whatever tools help, use em, whatever tools don’t, chuck em. \n\nI just mention these things bc you talk about making the songs ‘real’, and I feel that - I love trying to get a song to feel properly grounded, with a sense of place and reality. Best solution I’ve found is to just leave a bit of me in there - somehow it’s like people can feel when songwriting is ‘real’, so I just try to make sure my heart is in/behind each line, keep them smooth, rinse repeat \n\nWould love to crack open this topic again too, curious on more peoples thoughts on this stuff, thanks for opening this up  @OJ,",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1384999147958042826",
    "author": "Gabriel Tyranny",
    "date": "2025-06-18",
    "content": "Prompt for a fun question for the group: Is there a workflow that you’ve found to be a common denominator between your songs for how you write them?\n\nI’ve been writing songs for my current project by using a compilation of many notes, voice memos, journal entries, letters I’ve written then later converted to lyrics, etc. From there I used my current craft to sculpt them into each track that captures a theme, emotion, or something else that stood out to me.\n\nI often wonder how other active song writers put their finished pieces together. Is it as scattered as my process? Do they usually sit with an idea and write it linearly, line by line? A combination of things?\n\n\nI’d love to read other people’s processes and mindsets, if anyone would like to share.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385030761320550403",
    "author": "Gabriel Tyranny",
    "date": "2025-06-18",
    "content": "All makes complete sense - I have naming conventions too, where I then go back and search keywords depending on what is needed. As basic as ‘lyric note’ to search when I’m ready to compile ideas. That way when I’m out and about I can title a note ‘lyric note (date)’ then later when sitting to write a song I search those and bring it all together in a document to take them into account.\n\nA big similarity I’m seeing between us is that time apart to separate yourself from the lyric before going into writing mode to have a better gauge of what’s real and what was just hype… Cus boi do I write a lot of stuff that hypes me but later makes me go ‘that’s… luke warm and forgettable, honestly’ 😂😭 \n-\n\n@onanisland i’ve never used obsidian, what makes it stand out to you?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385032881029775572",
    "author": "onanisland",
    "date": "2025-06-18",
    "content": "Its mostly about personal preference as I like to work with markdown files & have everything local (even though you can connect with third-party apps) and I'm not tied to just apple (even though I'm aware you can export apple notes).\n\nI like that you can link anything with anything, notes to notes, or people to notes, or certain words, to some others and create visual maps, so u can navigate around ideas and everything tied to one person as opposed to hunting stuff down. So I guess its about flexibility + extensiability + md for me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385323238024024227",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "That is so interesting to head - I’ve never started with drums but can totally see this. I focus on the soundscape of the chords and melody, add a drum skeleton for lyric writing, write lyrics with song sections and overall composition in mind, then go back and change the production and drums to interact with the combination of the composition I envisioned and the cadence of the lyrics and how the drums interact with both at the same time.\n\nHuh - I’d like to be a fly on the wall for the drum first sessions to see how it all unfolds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385324751853191338",
    "author": "Josh",
    "date": "2025-06-19",
    "content": "I do sometimes. Most of my better lyrics come when I’m doing random stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385638686997086412",
    "author": "Brian Reynolds",
    "date": "2025-06-20",
    "content": "I'm a big proponent of all forms of creative writing helps hone the skill of melodic lyric writing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1388954494783459348",
    "author": "Peter the Cat",
    "date": "2025-06-29",
    "content": "I struggle with lyrics. Back when I was actually writing songs I would bounce the demo and import it into loopy on my phone and go on long walks with it, with the ability to capture different ideas on additional tracks/loops. something about walking and chain smoking ciggs helped lol but that's when I was heartbroken sad boi and especially inspired 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397679017900904569",
    "author": "bobby k",
    "date": "2025-07-23",
    "content": "Anybody running writing sessions in pro tools? Any tips or workflow things you can recommend? \n\nAbleton has usually been home base for this, I see it as a flexible scratch pad to throw down parts while the artist and 3rd are going in on lyrics. I’ll go over to pro tools once we have something concrete and start vocals, but it’s annoying doing stems in the middle of a write lol. I’m wondering if pro tools sketch is at all useful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1398744128162107495",
    "author": "Slow Hand",
    "date": "2025-07-26",
    "content": "Taken to the extreme you can end up with the kind of bland late mid-2010's pop music in which everyone is emotionally aloof, \"haters aren't gonna break my stride\", and the narrator is emotionally bulletproof. It rarely engages in any sincere vulnerability or deep self-reflection. Sia, Taylor Swift, or a few Demi Lovato songs come to mind.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399092229619843103",
    "author": "Ross Fortune",
    "date": "2025-07-27",
    "content": "For sure. “Yo Ralph, Beck wants a word!”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399508954282852513",
    "author": "Will Melones",
    "date": "2025-07-28",
    "content": "Thats at least how I recall it over a decade later. Not to discount his advice, but maybe it's a useful reframing for someone reading.\n\nSomething I think about any time I write lyrics is his point that words like \"I\" and \"you\" will quickly draw the listener into the song by creating a conversation that involves them. To not write in the third person (unless the subject is a loser).\n\nAnd that almost all hits got to the title line within 60 seconds!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412160650666573905",
    "author": "oaklandmatt",
    "date": "2025-09-01",
    "content": "@Brian Reynolds maybe you can add some context to this? Maybe tell us what you like about them? Or open a discussion? Better than just spamming lyrics",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412162583678550177",
    "author": "Brian Reynolds",
    "date": "2025-09-01",
    "content": "Fair. I didn't know the best way to go about it. I just wanted to try and get people to share their ideas of favorite lyrics. As I'm always thinking about them but maybe someone else is but in a different way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412163882616623104",
    "author": "oaklandmatt",
    "date": "2025-09-01",
    "content": "I love this. The part that makes it an amazing lyric is that it's so heavy, but then he refers to his life as \"my shift,\" which is so humble and simple and dutiful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412165636624486440",
    "author": "Brian Reynolds",
    "date": "2025-09-01",
    "content": "I love the contradiction of how it structured. Frightens and Awful are adjectives you think are leading somewhere and that somewhere isn't to Sweet. But life, like the lyric is full of suprises.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412523037307441225",
    "author": "Brian Reynolds",
    "date": "2025-09-02",
    "content": "\"There's a you-shaped space in my bed\nAlways you-shaped thoughts inside my head\"\nMark Ronson and Camila Cabello\n\nI love these types of lines in verses. Where you have multiple similar words and rhyming spots across a two line phrase. To me it creates this very delectiable ear worm quality. That starts to tickle at chorus quality. And as soon as you tickle that sensation, It disappears as the song moves forward. Makes want to replay just to experience that feeling again. Also love how its about a collective experience about missing a former lover in the physical world and thinking about them.\n\nAnd in classic fashion I've been signing the second line as, \"All these you shaped thoughts\" as opposed to apparently she is singing \"Always\". It should have \"always\" been \"all these\". Only realized my error when Googling the lyrics for this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429126975053631568",
    "author": "Josh",
    "date": "2025-10-18",
    "content": "Recently tried to only use pen and paper after hearing lots of people say that phones are evil. Gonna start suggesting this to everyone that comes through because we didn’t get stuck once",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441834750682726582",
    "author": "Josh",
    "date": "2025-11-22",
    "content": "Anyone else writing their best lyrics while on the toilet?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447975354235883560",
    "author": "BananErMat42",
    "date": "2025-12-09",
    "content": "Have you listened to Iris Dement’s Infamous Angel? \nIt’s a really good album, and it’s ridiculously simple lyrically. Let The Mystery Be was used as the opening song for season 2 of The Leftovers, which is a great show btw.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463905037884457092",
    "author": "herbie",
    "date": "2026-01-22",
    "content": "what are people’s thoughts about copying and pasting a first verse to the second verse? we’ve tried a bunch of new lyrics and nothing seems to stick as well as just copying the first verse over. i know its prob sacrilegious to do so but just curious to hear people’s thoughts. \n\nwe also probably have horrible demoitis but it just feels right :kekcry:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463917316147515544",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2026-01-22",
    "content": "Maybe try and keep the lyrics but a different performance? Like the killers did",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471654730995466455",
    "author": "revolution",
    "date": "2026-02-12",
    "content": "im not a professional, pretty new to music in the sense of trying to create a product/song. Ive been an instrumentalist, engineer, writer, etc etc as a hobby or interest from time to time... and i notice that writing is one of the areas that I have the least doubts about myself. i fully believe i can write interesting bars/emotions/etc from time to time... but it's very much an abstract 'writing' skill that could be applied to poetry or essays or anything... rather than a reflection of my actual song writing ability.\n\ni want to learn how to hone my strengths and bridge the gap between having or putting out decent ideas (wether lyrical or melodic) and actually distilling a song structure and 'product' if you will. A good analogy is the gap between someone with good cinematography instincts/eye vs a director/writer/editor level of structure or authorship",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472284607972901107",
    "author": "Jack",
    "date": "2026-02-14",
    "content": "Yeah, agreed. If all the repeated components are there (with different lyrics I guess. Verse, pre, chorus) then it’s a rep for sure. I think we get passes on bridges, especially if they’re instrumental. I have no justification for this but bridges have always been latent for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472293494910484572",
    "author": "Brian Reynolds",
    "date": "2026-02-14",
    "content": "I think if your also trying to up your production game in conjuction with lyrical top line melody. Then a rep should be a whole song. You gotta learn the nuances of subtle or drastic changes from verse 1 to 2. And deploying multiple transition techniques to keep the narrative moving and compelling",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472555769869369490",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "idk what qualifies as a song or not.. but to this end, by chance before i got time to read everyone's response, i happened to turn a small poem and a few lyrics into a valentine voice note for a friend. by nature of simply singing it and imbuing it with melody it sort of became a song. in some sense, its that easy, and i am failing myself by not carving out the time and commitment to that every single day.\n\nperhaps what im asking is really a reflection of a lack of courage and patience/grit. where i'd like technical and direct feedback, i search for 'knowledge' and 'technique' instead of collaborators and mentors. where i am afraid to fail, i avoid the daunting task of putting ink on a blank canvas every day. \n\ni honestly fully agree and expected your answer to be the primary one!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472575431516360715",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "recording a demo right now, gonna write a song after this 🫡",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]