[
  {
    "id": "1200522135244914768",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "If you're trying to be a highly successful professional, you should do all of these things and be prepared to adjust on the fly.\n\nI pretty much always have full songs, tracks, hooks, and concepts prepared. Much of the time, you won't use any of them on any given day. But good news: they're useful for future days.\n\nI've had all of that prepared and then the artist and I just chat for five hours, then write a song on a piano.\n\nI've had all that prepared and then cut song after song because the artist goes \"what else do you have???\"\n\nAnecdote that might be helpful: I've been in with an artist all week. Me, another producer/writer, and her. The other producer/writer has his rig set up and he also writes topline. We usually bounce back and forth depending on what the song requires. We've all worked together before and we had the whole week blocked out so there's no pressure to perform on day one. But we did three songs on the first day because she just came in firing. The first song she came in with a title and we worked from scratch and knocked it out in an hour. The other producer made the track quick with some existing drum loops he had prepped for her, adding keys and horns as we wrote. Then she asked \"do you have anything to play?\" I played her a track hook I had prepared. She liked it and we powered through that one in another hour. Then we broke for lunch. We caught up. As we were finishing she mentioned this one kinda stupid and sassy idea she tried to bring into another session but the producers didn't like it. So we wrote that one and it was fire. I tapped out a tempo as she rapped the hook idea and just make a skeleton beat on the fly.\n\nBeing way over prepared is rarely going to hurt you.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177707325725884447",
    "author": "Rob Domos",
    "date": "2023-11-24",
    "content": "Just had thanksgiving dinner at Alan Burgman’s house and we talked a good amount about songwriting. If you’re not familiar with his work, he’s 98 years old and has written lyrics for everyone from Frank Sinatra to Aretha Franklin to Quincey Jones to half of the artists your grandma listened to. \n\nAnyways, some good takeaways from last night’s convo:\n\n“Writers these days are more interested in immediate appeal than they are in a great song. They aren’t the same thing. A great song is only a great song if people will want to cover it in 30 years” \n\nHe cares immensely that whatever is being said in a song is worth saying. Does the message have strong intrinsic value?  \n\nHe’s verrrry quick to say he doesn’t like a song.\n\nHe has a strong preference for melody being written before the lyrics, which is particularly interesting consider his career is as a lyric guy. \n\nHe has a strong dislike for slant rhymes. (I disagreed and it turned into a whole family convo about phonetic tension and release)\n\nHe’s still writing every single day without fail. Today he’s writing on an upcoming Pat Metheny record. \n\nHe’s never heard of Drake or Olivia Rodrigo. Mind you his wife was the president of ASCAP for 15 years so this is particularly mind blowing. It shows me how siloed different worlds can be even when they are so similar and near to one another. What wisdom does one silo have on lock that the other is missing? What rules have been taught to us by people in one silo that don’t apply in the silos we ourselves are working in? A lot to chew on here.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032479007997952060",
    "author": "masteredbyjack",
    "date": "2022-10-19",
    "content": "This is such a deep and cool topic. I’m in mastering now, so while I do a lot of collaboration it’s not quite what you’re getting at here but I’ve got a decent amount of experience in the room/tracking/producing. \n\nTo me it is a matter of developing trust and belief with another person. My approach is to be brutally honest with people and let the chips fall where they may. When things are amazing, meh, or bad. As @BatMeckley said…you want the $10k mic. Don’t waste the time with anything in the middle.\n\nSo in short — I’d just tell them exactly what you wrote above. But I tend to be more on the extremes — I’d like to think that people come away from working with me with a deep-seated belief in themselves and their potential but also honest feedback about very specific things we can do better. I actively seek to challenge my collaborators (which I’m sure you do as well). I’ve found people really respond to this if it’s done with the clear intention to help both of us improve and with the curiosity of the potential in the art!\n\nIn short, I’m an extreme encourager but also a harsh critic (in a kind way). I never let someone give up on themselves if I can help it and show love for them by very specifically calling out how I recognize their potential but see areas for improvement!\n\nI feel that I’ve always been able to tell when people do things like “lead with a compliment” or whatever. So that’s my POV on this whole topic…I just like people to be straight with me. When I have dealt with artists who clearly need the validation you’re speaking about….I’ll specifically call it out with something like “stop looking for validation you have the talent to do this now start believing in yourself”…etc. Seems sort of harsh but it really can cut to the chase and open up a deeper level of trust and communication.\n\nSometimes people don’t like this…and that’s all good too. Always lead with kindness and things work out. Depth > quantity",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "846662569799450655",
    "author": "Slow Hand",
    "date": "2021-05-25",
    "content": "Now that everyone is incentivized to play *their* song the current iteration becomes the most-requested song of all time. DJ's revolt. Publishing companies and PRO's buckle under the logistical strain of addressing everyone's financial claim to authorship. 'Sicko Mode' derivatives can be heard echoing from every car, bodega, and grocery store intercom. TV has become unwatchable now that every comedy, drama, and reality show is saturated with these songs. The mob can't get enough of *their* song! Society breaks down. After a dark period and reconstruction civilization reforms as feuding warlord states where the only currency are promissory notes for royalties on the song that once brought humanity to the brink.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "972176771262844968",
    "author": "Slow Hand",
    "date": "2022-05-06",
    "content": "Speaking of taking a lion's share of the publishing: Son Lux's manager wrote a fun blog post years ago explaining the time that Fall Out Boy sampled a Son Lux song and Son Lux denied the sample clearance because they really, *really* didn't like the song.\n\nUnfortunately, it was also the planned lead-single for FOB's new record and so Universal kept offering them more and more money for the clearance, with Son Lux denying them continually, until they finally relented and agreed to it, with the vow that they would use the money to invest in new artists and \"Robin Hood this shit\".",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009885679062364191",
    "author": "Will Melones",
    "date": "2022-08-18",
    "content": "I’m sure we all share this struggle to some degree. I’ve got some projects that I’ve put many hours into, just to let them sit on a hard drive for years.\n\nCo-writing has helped a lot, and has taken some ideas to places I never would have thought to go. The feeling that you have some moral obligation to your collaborators to finish is motivating. When you’re making art for yourself, it doesn’t benefit from those positive forces of peer pressure, and there’s a lack of constraints and no sense of urgency. \n\nI think making creative decisions is metabolically expensive. It’s easier to defer all decisions, which is why you see DAW-age producers committing to so little until the mix. In the same way you can defer the entire songwriting process, especially if you have someone else’s project or deadline to prioritize over your own.\n\nTo be both the creative mind and the executive finisher is a lot of exhausting context switching. Some options might be to split these responsibilities with someone else, or to dedicate separate time to each task. If someone hires me to print stems or solder a patchbay, the last thing I want to do is engage in creativity. But when I get inspired to write, I don’t want to stop and troubleshoot the plug-in that’s crashing the session.\n\nMaybe like the divergence/convergence approach would be to set aside an hour or three at the end of your day to finish ideas you’ve already got brewing—set a timer and finish a song, or a verse. Or, even better yet, dedicate the *end* of your day to play and experimentation. Then the next morning, hopefully with fresh perspective, get in the mood to tie up loose ends and prepare your next steps. You’ve demonstrated that you’re good at wearing that hat for other artists, so you can do it for your songs, too. Just maybe not while you’re in the creative flow.\n\nI’m not practicing what I preach, just brain-dumping. I definitely don’t have this figured out.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1294764501865857098",
    "author": "BatMeckley",
    "date": "2024-10-12",
    "content": "It’s the difference between writing about an event and conveying how the event made you FEEL. \n\nI call it “Hotel Cafe Songwriting” 5 writers a night sit down and sing a song about how Trevor broke their heart and left them at the coffee shop. But no one outside their friends and family knows the story, knows Trevor, knows the coffee shop, and so no one cares. BUT, when the writer conveys the specifics in a way that conveys how something made them FEEL, then it becomes universal. We’ve all (except for me) have been dumped, we’ve all been hurt, we’ve all had coffee. Now we relate and care. \n\nI’ll always remember the showcase that got Switchfoot their deal for the record that blew up for them, and telling one of the people there how funny it was they had these songs licensed in all the teen dramas, because “these people don’t even realize they’re singing about God, not a girl, how dumb”. The A&R looked at me and said “no, they’re singing about LOVE, and that resonates with everyone.” Really changed how I looked at songs.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "829061668281384985",
    "author": "oaklandmatt",
    "date": "2021-04-06",
    "content": "This is a little of the top of my head, but I'll try and break it down like this. You're mostly going to get work/ collaborators for three reasons. \n\nThe #1 is your work (great songs, in this case). If you make great shit, people will either hear it and reach out, or when you meet someone, you'll send each other things and they'll love your work and want to be a part of what you can do. no matter where you are in your career, this is #1 always always always. When I was starting out, I produced some of the best sounding records for local bands, so other local bands wanted to work with me. Now, I (or my manager, or my publisher) can send a spotify playlist with songs people know, and that helps get me gigs.\n\n#2 is making shit with people you know personally. This is the best way to do it starting out since you don't have lots of great work out in the world. You need a little community of friends that you make shit with. I guess a lot of that will start moving online, but still the vast majority of great work gets done in person. Even during the pandemic, despite all the zoom writing session and remote work, most great stuff was still getting done in person. You gotta find your people and make things. Then you have the advantage of multiple people promoting your work.\n\n#3 is the pure cold call hustle. It's TOUGH. It's a low percentage game no matter what you're trying to do (be it mixing or writing or producing or being an artist). You have to understand that you may get 1% response rate from people. It's not to say it doesn't have value, but if you want responses, you have to have a good pitch and sending out thousands of messages. But the other thing about this is that writing songs remotely frankly fucking sucks compared to doing it in person. Songwriting is such an in the moment emotional thing. Producing and mixing remotely is very very different that doing real time creative vulnerability. This #3 applies more to non-songwriting collaborations than anything else.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "846659167410192385",
    "author": "Slow Hand",
    "date": "2021-05-25",
    "content": "You could really push that idea into absurdity. Start getting more and more credited songwriters on board with each successively published song that interpolates the previous iteration that also credits everyone else. Get your friends, family, and your co-workers credited. Give everyone a (microscopic) slice. It's *everybody's* song now!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874398269361516614",
    "author": "oaklandmatt",
    "date": "2021-08-09",
    "content": "when you write songs, you're creating intellectual property together. generally no one is hiring anyone, so there's usually no fees. as a producer, if you have a studio, that's just part of what you do and it's unusual when starting out to charge anyone for its use.\n\nif an artist wants to release a song, and they want to use your recording (or any elements of it), you will negotiate a fee and royalty in exchange for the label owning your recording. an artist instead may want to engage another producer to produce your song. assuming you consent, you don't get any fee or royalty for the master recording. but you are still a co-writer on the song and thus a co-owner of the copyright (the intellectual property). you would retain all the royalties and rights from being a songwriter",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204769060097753088",
    "author": "youngteam",
    "date": "2024-02-07",
    "content": "I personally believe some of the most mediocre music gets made this way. \n\nThink about it like this - if you just nailed a pitch by checking all the boxes against what a reference has, 10 other teams probably just did the exact same thing. \n\nI think the goal of a session should be to create the best song possible. Limitations and direction are good but tailor making things to the whim of prompts sent out by a&r’s is a good way to make the same material as everyone else. Stick out. Just my .02",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205202866952871996",
    "author": "austenballard",
    "date": "2024-02-08",
    "content": "Back in the fall I was writing like 10 songs a day for pitch. Y'all probably saw me experimenting with chatgpt to try to get inspo (it worked, a little bit, for lyrics)\n\nBut what worked best for me was just lying down in bed, listening to the ref playlists, going for a walk, coming back and then just letting whatever flow out\n\nA few of those songs are getting recorded soon by the artists I was pitching to so I guess it worked",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885062929018392606",
    "author": "jonmatteson",
    "date": "2021-09-08",
    "content": "Play along to voodoo, continuum, and golden hour. Don’t just “jam” really listen to note placements and try to copy those as precisely as you can. Also play as quite as you can and crank your pre’s and record yourself playing along to dissect what you to need to work on.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032532135640318002",
    "author": "Slow Hand",
    "date": "2022-10-19",
    "content": "Now I believe the work that I have to do is to split the difference between the two styles. I think your suggested approach is right on. \n\nThanks, man.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033164711572807802",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "The worst feedback I’ve offered is just snap judgement stuff, which feels so intuitive to us most of the time (if I hate a reverb sound, just flip to the next one), but with collaborative song writing, I think it adds a great deal of credence if you breakdown why you like/dislike an idea and you can explain it in an educated sense.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076489276885311488",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "Yes that's the way some people do it, but that's an old school method that is going away. \n\nThere are SO many people who make songs that this method isn't super useful any more. Also, many more artists are co-writing their songs and not taking \"outside\" songs with the same frequency. \n\nThe best way to get your songs recorded is to get in with the artists themselves. Then when you're in the studio working with the artist, you can pitch existing ideas you're working on. \n\nThat's why we're always harping on the idea of making records with the people around you. You'll get used to the collaborative environment, you'll make a lot more work (because multiple people will be working on it), and you'll have more chances things get heard (because again, multiple people will be working on it). \n\nIf the things you make with the people around you are truly great, they will get heard. That will be your gateway into more collaborations.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121254677477072947",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": "Am I a loser with nothing to say?\nI sit around doing nothing all day\nAm I a loser, am I a loser\nAm I a loser with nothing to say?\n\nBOOM hook done thanks bro send me your publishing info, 25% sound fair?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153463619590291537",
    "author": "austenballard",
    "date": "2023-09-18",
    "content": "I just kind of say \"so what\"\n\njust finished my 12th song today\n\nmost of them suck and won't matter and I won't send them out, and most of the ones I send out won't get cut or (in one specific case) added to someone's live set\n\nand even if they do, most of the work I do is for people who get one or two songs out, get their (increasingly literal) 15 minutes and then everyone forgets and moves on, including the artists themselves\n\nultimately I just remind myself that this is, for better or for worse, what god/the universe/who or whatever put me into existence to do and my responsibilty is to respect that and become as good at it as I can, and find as much meaning in it as I can, even if that's the kind of stuff @oaklandmatt said that won't necessarily move your career but brings you joy and makes the time you spend here worth something",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240733755400912927",
    "author": "Slow Hand",
    "date": "2024-05-16",
    "content": "Chilly Gonzales (the musical genius) with some good insights on melodic writing, using the ABBA catalog as an example: \nhttps://www.youtube.com/watch?v=BM0MO8y72t8",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357039395701784867",
    "author": "spectrummasters",
    "date": "2025-04-02",
    "content": "Came across this , Charlie Handsome , describing Louie Bells process for Posr Malones F1 writing \n““Louis [Bell] was involved in the writing and production, and he recorded Post’s vocals. I think he’s done that for nine years now, and they have their routine. And Louis is good at creating libraries. At the beginning of the project he AI‑ripped the drum beats of tons of classic country songs. He had hundreds of them. So while I was doing the music, he would go, ‘What tempo are we at?’ I’d say ‘135’, and he’d have 50 drum grooves that work at 135 bpm. There was this huge catalogue of ideas we could aim for,”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463933343249727519",
    "author": "Jack",
    "date": "2026-01-22",
    "content": "I think there are two schools of thought here:\n\n1. Fuck it, do it. Path of least resistance. You’ve tried other lyrics, they’re not hitting. Cut V1 again with a different vocal, do some arrangement modification and send it. \n\n2. Nobodies heard this song before, whatever icky stimulus you’re receiving from attempting V2’s can probably be attributed to your personal saturation of V1; something nobody else will struggle with. So get a decent V2, accept it won’t hit the same for you because you’re cursed and send it. \n\nBoth work!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "846663090840797195",
    "author": "Slow Hand",
    "date": "2021-05-25",
    "content": "So yeah. Don't forget to do your split sheets at the end of each session. They're important.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204953880262082631",
    "author": "oaklandmatt",
    "date": "2024-02-07",
    "content": "FWIW I've never written a great song to a brief and all my pitch songs were written specifically NOT for pitch (they were later pitched because people loved them). My career configuration is different than yours (we're all different), so I'm not sure how useful this is.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212438539506028594",
    "author": "Zack Hames",
    "date": "2024-02-28",
    "content": "You’ll write more songs - take that how you will.\n\nEither write another for the pitch, or you and the artist will write another amazing song for her catalog. Its not the end of the world either way, which should be freeing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354661558550003794",
    "author": "oaklandmatt",
    "date": "2025-03-26",
    "content": "I would just go all in on writing sessions. Build the experience and the comfort. If you want to go deeper into songwriting, I have lots and lots of thoughts (many of which I've shared here). But it essentially boils down to: write as many songs by yourself as you can as quickly as you can.\n\nAs far as publishing deals, you won't find a good deal until there's some real revenue to be had, so until you have a song that is generating some serious money (or coming out and will), just keep writing and registering your songs",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827602301274554378",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Real Books are great! It’s the same deal as the Beatles songbook I mentioned above. The only reason it may not be a good fit is you’re not into jazz. The songs might be hard to connect with, if you don’t already know them, so you’ll want to consider that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009591662646927370",
    "author": "Zack Hames",
    "date": "2022-08-17",
    "content": "@youngteam this is all great advice. thank you for the in depth answer.\n\nA bit thing I deal with is that typical fear-of-failure, is this going to suck, why even bother kind of shit. Like I can be happy with the potential of an idea, the experimentation, but to get to the finish line and say \"yeah this is done\" is something I struggle with on a deep, internal level - \"the war of art\" addresses this a lot with reference to Resistance. Just been really struggling with it lately.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009599087257059400",
    "author": "youngteam",
    "date": "2022-08-17",
    "content": "war of art is a fantastic book. lemme say that you are clearly on the path if you are thinking about your process this intentionally. \n\nwe all deal with resistance, imposter syndrome, etc. it's *hard* bearing your soul, being authentic, the list goes on.\n\nwhat i will say that's had a big impact on me lately is creating for the sake of creating. aka writing music *not* to place a sample, make a million dollars, or reinvent the wheel but simply because i wanted to!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187033435504660562",
    "author": "Iwan Morgan",
    "date": "2023-12-20",
    "content": "Good luck getting permission to use some of the Beatles’ catalogue. Sorry, I don’t mean to be negative, just realistically their catalogue is the holy grail of recorded music. If you have a way to get the demo under Paul McCartney’s door so he can listen to it the personal angle would probably be most effective.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188047183694532650",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "moving conversation with @rae here\n\nI've been doing more of \"study the greats\" with production, when it comes to arrangement and production, I feel that things are a lot more clear cut than songwriting. For example, I can try break down the drums of a song into a  drum pattern, dynamics, feel, and the drum sound (type of drum kit, machine, and processing on it). \n\nBut with lyrics (or language) - it feels more gray to pinpoint how to take a concept and apply it into my own writing. How do you usually break it down?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194437356233703497",
    "author": "Zach Hughes",
    "date": "2024-01-09",
    "content": "I'm a member with BMI. Fine experience over the years. Nothing to write home about. Was free to signup when I did. I believe SESAC is invite only or was last I heard. ASCAP used to have a signup fee, but not sure about the deal now. There are a few comparisons / debates online about which collects more royalties or does a more effective job collecting royalties. BMI did just get acquired by a private equity firm and they've started making some mildly concerning changes. But my impression is they all kinda do the thang.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212433620283818074",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-28",
    "content": "That‘s the thing. I wrote it together with an artist but it shaped into something that‘s imo much more fitting to her than the artist we want it to pitch to",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212488963764518922",
    "author": "devon lougheed",
    "date": "2024-02-28",
    "content": "You could always pitch it to the artist, and if they don't want to use it, you get a hot track back for yourself. Making the best art is always the best thing! But if the artist you're pitching to has a much larger potential audience than you do, and it might make a big difference for you financially/career-wise, it might be a good move. Then you can challenge yourself to write an even better one for yourself in lieu.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261803809064091679",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "Back when there was a publishing industry and a records industry, and they were connected by A&Rs. \"A&R\" of course being short for \"artist and repertoire,\" meaning their job was finding great songs and marrying them with their artists. That used to be nearly 100% of the record industry. Now it's essentially single digit percentage.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827588585673850891",
    "author": "greghvnseb",
    "date": "2021-04-02",
    "content": "Best song writing material for beginners IMO is the Beatles catalog. Great progressions and great voicings, harmony, melody. Great resource",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827592434095489034",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Yeah. This is a big part of how I came up and got some nuts and bolts songwriting chops. I wanna recommend this book right here: It's their entire song catalog as just lyrics, chord changes, and some chord diagrams for the guitar voicings. This is pound-for-pound some of the most information dense, yet simple, description of good songwriting that I would recommend. https://www.amazon.com/Beatles-Complete-Chord-Songbook/dp/0634022296",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835983628328239203",
    "author": "Zack Hames",
    "date": "2021-04-25",
    "content": "Production question, hopefully fits close enough to songwriting:\n\nDo y’all have recommendations for electronic drum samples?\n\nI’m wanting to expand my drum sounds for pop / rnb / hip hop / electronic anything. Last few years I’ve mostly used a korg electribe drum machine which has been awesome, but I feel like expanding a bit, maybe getting away from hardware. \n\nI don’t love the default sounds on battery, but I love battery as a sampler. The thing I like about the korg is the sounds are plain, and then I adjust with FX and pitching and attack/release, whereas battery is “finished” sounds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851495917428277258",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I deal with (unintentional) inconsistent tempo and some time even time signature/pulse pretty often when working with songwriters and artists. It seems to solve the problem when you tap your feet to the melody. Then you would realize that the tempo has changed. And count 1-2-3-4 or whatever the meter is. So you don’t end up unintentionally having an extra beat because of words and disrupt everything else. A lot of writers ask people for beats first for this reason, but if the melody doesn’t stand on it’s own- relying on the beats will do more harm than good in my opinion. They often end up being mediocre melodies from my experience because there’s already tons of subdivisions and grooves in the beat and the topliner is relying on that to drive the rhythmic feel. But also beats need to come in with pocket so there are space for the vocal melody to fit in. It would be good for writers to start without a beat or instrumentals and it would be good for beatmakers to practice leaving vocal pockets when starting with a beat first",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860895735678631936",
    "author": "Josh",
    "date": "2021-07-03",
    "content": "Oh ya. I have a “catalog” folder for that too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "972163805746454628",
    "author": "delwin",
    "date": "2022-05-06",
    "content": "the other 10% is split by 8 people 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033180050960433212",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "I had an English teacher junior year, and he was a hardass and kind of a wisecrack, but he actually wound up being the most epic teacher i had in high school. \n\nHe talked about writing for publications when he graduated and earning his doctorate, and he was telling us the story of how he went to the editor of his journal one day for a meeting about a piece he submitted, and my teacher talked about how he  pulled out his hard copy and very seriously began to explain his piece to the editor. Then editor cut him off and said “Dan, I love everything about what you’re saying. And as for what you’ve written, I like everything about it”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075378729410367498",
    "author": "cy (sigh)",
    "date": "2023-02-15",
    "content": "thats pretty common method for scratch idea /sketches. \n\ndeveloping it from there (ime), is about  finding the right words for the concept of the song (assuming you have one)\n\nI know some top liners (folk who write main melodies in songs) that will sendnit to /work with  someone who may be better at writing actual lyrics (could be the artist themselves at times). \n\nim sure more people can pitch in w more examples or use ideas.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075426773531119748",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "Hmm, probably the likes of @BatMeckley and co could speak to this too, but the social skills ain't always the thing.\n\nI've been in rooms with shy/quieter people who are just incredible at what they do. In one case, on a very high profile session, one of the beatmakers literally didn't speak to anyone, ever. He was 19 at the time, literally only opened his mouth to very politely ask me for my email address so he could fly the beat into Pro Tools to cut vocals. But he was making absolute fire, and even though he didn't speak, you could feel a good vibe off him.\n\nI've also been in rooms with *unbelievably* obnoxious characters (the occasional particularly unpleasant example of that LA type we were discussing recently). Utterly repugnant as people, but their work is undeniable.\n\nI know who I prefer to be in a room with (and that really does count for a lot, in my experience), but in the speed dating world of pop music writing that a lot of people go through, you get all sorts. \n\nNot everyone is super charismatic of course, but that's just the world. Either way, 90% of the people I've met at the highest level are really delightful.\n\nAlso, my experience has been that the more accomplished the artist/writer/producer, the more lovely they've been. They've got nothing to prove, and perhaps at a certain level, anyone who's not truly undeniable has already been filtered out of those rooms by being a jerk on the way there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075473495049384048",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "Mos def. There are some golden combos that just work (I gather that some writers are lucky to find those groups, and can step off the speed date conveyor belt somewhat). But chameleons also have their place.\n\nIn the case of that beatmaker of few words, he came as a package deal with another beatmaker (neither loud nor quiet) + a third beatmaker who was also exec producing that project, who had a large and gregarious personality. In a couple of sessions he introduced his guys “this is Name A, and Name B. Name B don’t talk”. And that was chill 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101364139869356053",
    "author": "toohighprod",
    "date": "2023-04-27",
    "content": "Looking to take my production into the sync world. Any suggestions on trusted companies to submit to?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138335619131646014",
    "author": "popaganda.",
    "date": "2023-08-07",
    "content": "But just experiment and make your own little catalog of strumming grooves",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153373148406886500",
    "author": "austenballard",
    "date": "2023-09-18",
    "content": "especially with pitching beats and such",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153385754463064124",
    "author": "cy (sigh)",
    "date": "2023-09-18",
    "content": "recent switch for me but I used  to just have dozens (sometimes hundreds) of things just sitting.  now i work on building kits and presets and in the process end up making stuff with them or at least getting one or two melodies out of it. \n\nmy main issue is that I get to a point where I start getting different ideas that I wouldn't want together in the same song /beat /inst \n\nwhen I get to that point I'll try a bunch of those ideas and keep the ones I like. after anything sits on my drive for too long without me changing it I open sessions up and export them as multi tracks, Stems or a 2 track (any combination I like really) and keep  them in specific folders. \n\nI'll flip through some of those in sessions (on top of anything I mightve made for the specific session). after a while of those being there. I move them toa diff folder which is linked to to my cloud service and let's anyone I share the link with download (w general guidekines for use) that way friends and ppl I work with can use them in their sessions or for fun. \n\nstart a new batch of stuff and repeat this process. some things I'm more attached to (for one reason or another) I might keep  longer to try to work on or pitch but that's it. \n\nup until maybe 5 months ago my process stopped after exportingthe tracks /Stems and using them in sessions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185936610563461150",
    "author": "oaklandmatt",
    "date": "2023-12-17",
    "content": "Yes. \n\nCovers (which have a definition of how much you can change and in what ways) don't require permission. You just give 100% of the publishing to the copyright owners. \n\nInterpolation (aka derivative works), require permission from the copyright owners. Along with permission, you negotiate their copyright ownership percentage (aka their co-writing share) of your new derivative work.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186032423184642138",
    "author": "samvalentine",
    "date": "2023-12-17",
    "content": "Interesting. We’re basically taking the refrain of a Beatles song and repeating it over and over… almost like a mantra. Can’t imagine that’s a cover exactly. It’s the same melody but I think because the structure is so different it’s more of an interpolation. Is there an easy way to get permission or do I have to call Paul?\nAlso would be down to just submit it as a cover and relinquish publishing, but if it’s truly not a cover I could see that resulting in a headache… or is cover just a safer bet overall?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186713896334139502",
    "author": "oaklandmatt",
    "date": "2023-12-19",
    "content": "Not sure tbh. Publishers and lawyers are usually the liaisons",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186856565605666916",
    "author": "ehutton21",
    "date": "2023-12-19",
    "content": "For whatever it is worth:\n\n-Sony/ATV publishing owns the pub on The Beatles catalog\n\nthe Sony webpage has a basic info contact email, but labels are slow moving on these things, even for the business side of things. Contacting DMG and even just seeing about general knowledge/consultation would be a good move. I’d ask if contacting Sony/ATV is the proper first step, if that’s feasible, or if there’s something else worth doing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194001086428758118",
    "author": "Chad Rodgers",
    "date": "2024-01-08",
    "content": "Hey guys. What's the better US Performing Rights Organisation? ASCAP? BMI? SESAC?\n\nMaybe this is more of a #📟biz-talk thing... Apologies if so!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204742223946846288",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "When writing to pitch, how do you avoid letting the pitch get in the way of creativity? I was in a session writing to a brief recently and a numerous times I was like „I really wanna use this bass but it‘s not on pitch“ „I feel like the song could go here but it‘s not true the brief“ etc.\nSo the vibe suffered a lot bc my decision making was so influenced and hindered by the fear of not staying true enough to the pitch",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204959649741144074",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "I‘m not super experienced with writing to a pitch either so it was just a weird situation where the session just hit a brick wall numerous times bc we were so stuck by the confinements of the pitch the creativity just couldn’t flow \nI guess what you said aligns with what @youngteam said that writing a great song will always be better than writing something that sounds exactly like something else that came before",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204960225271222284",
    "author": "Deleted User",
    "date": "2024-02-07",
    "content": "but it’s not for everyone either. some people hate doing the sync stuff for the reasons you and everyone else listed above and that’s okay too. music supervisors want more music authentic to the artists nowadays so writing whatever you want can also lead to sync opportunities",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204960687692976128",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "In this case it was a pitch for an established artist with specific references but yeah that makes sense. The problem wasnt even „we have to write an super amazing song“ it was more like the session and the inspiration coming to a halt because we were so unsure of the direction",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204969129325625415",
    "author": "Deleted User",
    "date": "2024-02-07",
    "content": "how much of lyrics do producer/writers usually deal with?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205212375427579904",
    "author": "austenballard",
    "date": "2024-02-08",
    "content": "I know it's not very representative of the kind of \"okay, the publisher booked us into the studio for the day and we need to crank out some demos in whatever style\" way of working but I don't really like doing those unless there's a good demo fee lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205630725911740476",
    "author": "IKZ",
    "date": "2024-02-09",
    "content": "@austenballard @Matthew The Cooke🎄🎅🏻 no pressure to answer but have you guys had much success with placements? I’ve had one offer for a sync library but have struggled to make way otherwise",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205710220161065010",
    "author": "austenballard",
    "date": "2024-02-09",
    "content": "I've had a few sync placements, not songs though - entirely instrumental pieces. Every successful placement has been through direct contact with a supervisor - I don't really send much to libraries.\n\nMost of my song placements with artists have been with people who are essentially friends of mine who ended up co-writing the final songs that went out.\n\nI've never successfully placed a song with an artist through an A&R with the exception of the situation I described above",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205712773430902814",
    "author": "Garth Tim",
    "date": "2024-02-09",
    "content": "placements in terms of writing/points on a collaboration? or placements in terms of completed material being pitched for sync",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212411089296425010",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-28",
    "content": "Have you guys ever written to a pitch and then thought „damn this is song is way too special to just give it away“ and then released it yourself? Currently in this situation rn and trying to decide what‘s the right thing to do \nThere are no contracts/labels/management involved so it would be no biggie if we don‘t send anything in",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212432383995940914",
    "author": "Will Melones",
    "date": "2024-02-28",
    "content": "What's the path that puts the song in front of the most ears? Or is that a priority? It's quite possible that the song is especially personal to you and another artist won't express it the way you can. Otherwise, if the artist you're pitching to has a greater following (as an artist), it seems like a way to get your great song out there. Then write more special songs! And if it doesn't land, put it out yourself and you still win.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212434763005034569",
    "author": "Zakhiggins",
    "date": "2024-02-28",
    "content": "My 2 cents would be to pursue whatever you think would end up with the best piece of art at the end of it all. I mean that’s what we’re all in it for at the end of the day.\n(Unless there’s an opportunity to make a shit tonne of money or get a lot of exposure off the artist your pitching it to)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242614904515596407",
    "author": "oaklandmatt",
    "date": "2024-05-21",
    "content": "\"The answer could easily be that I'm overthinking it, it doesn't matter that much, and that I should trust my instinct here.\"\n\nYes, no, and yes.\n\nIt matters a tremendous amount that you do the thing that you like. \n\nDo the thing you think sounds cool. Then if you need to compromise with your collaborators or benefactors, deal with it after.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291874884640571475",
    "author": "Slow Hand",
    "date": "2024-10-04",
    "content": "That’s good context, because I don’t know his catalog at all.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324815186938429471",
    "author": "SoundsLikeJoe",
    "date": "2025-01-03",
    "content": "Do the songwriters get paid to create those demos?  No...  but they often PAY OTHERS to help them make the demo possible.  Nashville folk will often have \"Demo Days\" where a group of Ace players charge a flat fee to perform and record the rhythm section (for instance, could be anything the song needs). They might record 5-10 tracks in a day. I'm sure some have done more. These \"demo day tracks\" are used by songwriters to then pitch their track to recording artists, labels, anyone.  There's also a whole army of producers ready to help songwriters demo-up...  where the songwriter pays a producer to turnkey the track.  Sometimes it's one guy playing everything or a few remote players all chipping in under the producers direction.  \n\nAnd...  these are viewed as a \"very basic demo\" in the eyes of industry vets. A really good \"one take\" by great players with high quality equipment recording the basic tracks is a strong demo but not fully produced. Happens all the time, but the producer (and their team) gets paid by the songwriter (or their team) to produce the track.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339731298289451149",
    "author": "peterlabberton",
    "date": "2025-02-13",
    "content": "I circled around some of these ideas a few years ago here, but now I’m more seriously thinking/asking for advice…\n\nI’ve never written a song in my life, and don’t have any real desire to do so (more than happy to be mixer/producer/drummer/multi-instrumentalist guy). But, I have a friend who is a super prolific writer. He has his own artist project which I’ve produced/mixed, and a few years ago had a publishing deal and has a good deal of writing credits. We’re a really good yin/yang pair: he’s focused on melody/lyrics/chords, I’m focused on rhythm/sounds/texture/mix. We have a co-credit for a Suki Waterhouse song for the one and only explicitly “writing session” we’ve done together.\n\nI just reconnected with him and mentioned that I’m about to be in a position where I could do more open-ended writing (/spec production?) sessions and would love to work with him again—specifically on some projects that have approached me more in the writing stages, and most especially on reaching for bigger artists. And he’s down!\n\nHere are my questions (and this is a *total* explain it to me like I’m five situation—I’ve really struggled to make sense of things business/session flow-wise outside of getting paid for a discrete deliverable or a day rate):\n\nI don’t feel a need to be too formal about things right now, but is this sort of partnership where we could pursue a joint publishing deal?\n\nMy main motivation is two-fold: keep a foot in production/engineering while I’ve leaned more and more into mixing recently, and use our credits to get in a room with bigger artists. Am I way off here?\n\nAnything I’m missing/obviously oblivious to?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353347929443930113",
    "author": "Beck Nebel",
    "date": "2025-03-23",
    "content": "I have a similar situation - I share a studio with a friend who has some cool writing credits, has had publishing deals in the past. We just got done doing a big portion of an album for a legacy artist together and I’m wondering how to keep it going. We’re in Minneapolis and not moving any time soon but will travel too. We’ve also done some pitch work for k-pop. I know a lot of music gets written today with the artist in the room, but there are still some places for pitch. Wondering if there’s other folks with these experiences and how they found success in it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354656891736821782",
    "author": "oaklandmatt",
    "date": "2025-03-26",
    "content": "The short answer is: you're a songwriter now too. This is a new part of your professional repertoire. This is great.\n\nI made a similar transition from producing bands to doing co-writing sessions as a producer. You can still get hired as a producer or engineer (as I still do), but writing sessions are structured with different expectations and potential outcomes. \n\nWhen you participate in songwriting sessions, you are almost never getting paid up front as an engineer or producer. There are some cases where super rich people will pay for songwriting sessions, or artist with bigger budgets might get their label to pay a studio fee, but this will be a tiny minority of your writing sessions. \n\nPhilosophically, the idea is that you're all creating something together that, if it's good enough, it will be released into the world in someway. But your experimenting and will make many ideas that don't cross that threshold. However, if any of the recordings of these song come out you will still get paid as a producer (/ engineer / mixer / whatever else you do on the final version). If no peace of the recording that you made when the song was written gets used, you will still participate as a songwriter on the copyright.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354657767440388278",
    "author": "oaklandmatt",
    "date": "2025-03-26",
    "content": "@peterlabberton  I've not seen a joint publishing deal as you describe it, though I suppose it's possible. Generally it makes sense for everyone to have separate publishing deals as many songs get written with different people and different splits. You could certainly sign to the same publisher at the same time, just with separate deals. Or this person could sign you to their publisher with some finders fee type thing.\n\nWhat it sounds like you're doing is providing a great sounding board and musicianship for someone who is more primarily a songwriter? If so, you would just participate in any songs that are written in the room. If it's the sort of thing where he is really doing the bulk of the songwriting (like all the lyrics and melody, and you're helping with some of the music) you could certainly work out a deal where you get a smaller piece.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354660204406636564",
    "author": "peterlabberton",
    "date": "2025-03-26",
    "content": "@oaklandmatt you and this place are both gems, thanks! I actually got hit up by an artist this morning to schedule something for this exact co-writing thing—that and this response are good motivation to keep after this avenue of work!\n\nYes, role so far has been sounding board/musicianship/engineering and mixing/producing/providing studio. I can’t remember the split but on the Suki song he did get a bigger cut. I got a production fee when it made the album and it all felt fair to me. It’s registered with a PRO.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356413580974751845",
    "author": "Brian Reynolds",
    "date": "2025-03-31",
    "content": "First most of what I'll have to say for this is built on the foundation of this course by Louis Bell of Post Malone, Halsey, and Justin Bieber #1 fame. In this course he spends hours going over exactly how he writes lyrics to his gibberish melodies. Then how he goes about pitching these ideas to artists. After he has 24k Goldn there for a few hours and they write another song to gibberish melody. And you can see how the process are alike and contrast. https://studio.com/classes/louis-bell/hitmaking-for-producers?utm_medium=paid&utm_source=google&utm_campaign=ws_studio_brand_louis-bell_us_phrase&utm_content=studio&utm_term=louis%20bell%20studio&ref=m&gad_source=1&gclid=CjwKCAjw-qi_BhBxEiwAkxvbkH_XdBqN7jbkwQK-0pisWV_MsC4-VSGH_iGfcL85MML5SoRwB01Q9xoCFl0QAvD_BwE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357495132324233258",
    "author": "Brian Reynolds",
    "date": "2025-04-03",
    "content": "No, I read it as. He sifted thru hit country songs for a few days. Used an \"AI\" stem splitter. And then complied just the drums into folders based on tempo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357498919981944892",
    "author": "diamndsdancin",
    "date": "2025-04-03",
    "content": "logic pro has a ai stem splitter now?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411680905625337878",
    "author": "Brian Reynolds",
    "date": "2025-08-31",
    "content": "\"But I cut people out, like tags on my clothing\" \nConan Gray",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472561810099142788",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "in hindsight the conversation got very high level, but i could have def brought up simple things like, what are signs or principles that help you CUT lines, or when to repeat things adn how much, or even generally how to be efficient and impartial when reassesing an idea. i find that when im inspired.. its quite easy to overwrite and over execute many potentially viable ideas for example. when it rains it pours as they say. \n\nim gonna be taking in and applying everyones input. but perhaps at some other time, illl bring up a topic you guys have reminded me of as well, in regards to even re-experiencing/re-performing your own ideas and succesfully capturing that magic of the first take which seems so hard to do, and antithetical in some ways to the idea of how writing happens often, as opposed to recording.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]