[
  {
    "id": "1221123573503230003",
    "author": "oaklandmatt",
    "date": "2024-03-23",
    "content": "I have a different angle you could try. I would focus almost all your energy on becoming a better, more truthful, richer lyricist. That's the only place you'll be original because there's only one you. Paradoxically, it's also the way you'll write songs that have a universal appeal because the more personal you get, the more the underlying universal emotions will resonate with people.\n\nTrying to be analytical about melodies and structure and style when writing has never yielded good songs for me or literally anyone I know. All the best songwriters I've met write all their best songs lyrics first.\n\nAlso, when you have something to say, it's surprising how little you pay attention to the melody. The melodies and structural components seem to just come when your heart is already in the story.\n\nThe only other thing I'd say is learn A+ songs. Learn the lyrics completely and learn the story behind them as much as possible. Then learn to sing them the way the original version is sung. That will expand your vocabulary as a vocalist and reinforce great lyrics.\n\nLastly, technology is going to continue to increasingly replace stylistic innovation. Yeah AI blah blah blah, but already drum machines and synth presets and splice and DAWs. The last thing to be replaced will be you personally writing things from your experience. Songs about your deepest insecurities and songs about your pet gerbil both fall into this category. Explore all of it.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035057327809773609",
    "author": "Slow Hand",
    "date": "2022-10-26",
    "content": "Does anyone else love the bridge section of songs as much as I do? I feel as if bridges don't get enough love. \n\nWhether listening or writing, I think a good bridge can be extremely satisfying because you tend to get a really interesting emotional counterpoint to the rest of the song, and I love the tension that can come out of that contrast.\n\nMaybe I just love tension in general.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033198903132172288",
    "author": "Slow Hand",
    "date": "2022-10-21",
    "content": "On that tip:\n\nI've definitely been on a few productions where we *Ship of Theseus*'d the entire record. Usually it starts out by dropping in a new verse, which then leads to an exciting new idea for the chorus, and before you know it the original song has been replaced completely.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "906129280021463080",
    "author": "Keyron",
    "date": "2021-11-05",
    "content": "i used to write everything on my phone as it’s faster but i got suggested to use the old pen n paper as you CAN SEE WHAT YOU ERASED and this has been game changing for me\n\nso this is my “writing setup” now:\n1. i take a stack of A5 sheets of paper (i just love how small they are)\n2. a sharpie without the cap \n3. my phone to record myself in case i lose ideas\n\ni’ve developed something i call “The Dry Sharpie Technique” with which you challenge yourself to not let the sharpie dry up (duh) and the only way to do that is to keep writing words… eventually you’ll find yourself with\n1. a stack of scribbles and cancelled verses\n2. an incredible song\n3. a “backup” of your process",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1009885679062364191",
    "author": "Will Melones",
    "date": "2022-08-18",
    "content": "I’m sure we all share this struggle to some degree. I’ve got some projects that I’ve put many hours into, just to let them sit on a hard drive for years.\n\nCo-writing has helped a lot, and has taken some ideas to places I never would have thought to go. The feeling that you have some moral obligation to your collaborators to finish is motivating. When you’re making art for yourself, it doesn’t benefit from those positive forces of peer pressure, and there’s a lack of constraints and no sense of urgency. \n\nI think making creative decisions is metabolically expensive. It’s easier to defer all decisions, which is why you see DAW-age producers committing to so little until the mix. In the same way you can defer the entire songwriting process, especially if you have someone else’s project or deadline to prioritize over your own.\n\nTo be both the creative mind and the executive finisher is a lot of exhausting context switching. Some options might be to split these responsibilities with someone else, or to dedicate separate time to each task. If someone hires me to print stems or solder a patchbay, the last thing I want to do is engage in creativity. But when I get inspired to write, I don’t want to stop and troubleshoot the plug-in that’s crashing the session.\n\nMaybe like the divergence/convergence approach would be to set aside an hour or three at the end of your day to finish ideas you’ve already got brewing—set a timer and finish a song, or a verse. Or, even better yet, dedicate the *end* of your day to play and experimentation. Then the next morning, hopefully with fresh perspective, get in the mood to tie up loose ends and prepare your next steps. You’ve demonstrated that you’re good at wearing that hat for other artists, so you can do it for your songs, too. Just maybe not while you’re in the creative flow.\n\nI’m not practicing what I preach, just brain-dumping. I definitely don’t have this figured out.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463942883466805425",
    "author": "Nomograph Mastering",
    "date": "2026-01-22",
    "content": "Repeat verse but with one word changed, love that effect of the full repeat but with a twist",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222179366575013939",
    "author": "oaklandmatt",
    "date": "2024-03-26",
    "content": "Definitely doesn't hurt! It's also the easiest part to learn and can be learned through doing. The \"doing\" being pushing oneself to be more honest and vulnerable and authentic about putting yourself into the song.\n\nWhen you focus on analysis of structure and melody, you don't learn how to be authentic emotionally. When you continually write songs where you try to improve emotional authenticity and clarity, you learn structure and melody.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463943698365677588",
    "author": "Nomograph Mastering",
    "date": "2026-01-22",
    "content": "Or repeat verse verbatim lyrically but with a melodic variation towards the end, also love anticipating that as a listener",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "829067268910481409",
    "author": "antoniohannamusic",
    "date": "2021-04-06",
    "content": "Hey Matt,\nThank you for taking the time to come back to me and with such a detailed breakdown.\n\nI think of in terms of where I’m currently at, the \n\n#1 for me - released work is almost all band focussed; I probably spent the better part of the last 10 years recording rock, alt, pop punk, metal etc etc and only super recently even considered the idea that I could be a songwriter.\n\n#2 Makes loads of sense and is definitely something I will focus on in the immediate future - work with people I know and I like working with already, like even some of the artists outside their bands / solo stuff, I didn’t even really consider hitting up my favourite clients for this as I assumed (and have been met with hesitation) most bands don’t like the idea of having someone come in and “write their songs” but this approach seems way more achievable I.e just hang out and write something!\n\n#3 the struggle haha! Unfortunately being in London almost 100% of my work has been remote, I’ve found myself tracking drums, bass, vocals, trumpet etc all using AudioMovers and while it’s great to finish projects I agree with you that it’s way better to do any or all of the above in person.\n\nThat said maybe the cold call/ intro is more like a “hey, here is some of my stuff, let’s jump on a zoom call, if you don’t hate me in the first 30 mins come hang at the studio for a day” \n\nThat all said, if anyone on here wants to jump on and do a session hit me up 🤣\n\nThanks again Matt, even more keen to push forward now!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842440412672032779",
    "author": "oaklandmatt",
    "date": "2021-05-13",
    "content": "well that's the magic formula for a certain kind of pop song: every section is good enough to be a chorus",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156983296148910230",
    "author": "Chris Doms",
    "date": "2023-09-28",
    "content": "Here’s the prompt, for the record I didn’t make this. Michael Morgan sent it to me\n\nI want you to become my Prompt Creator. Your goal is to help me craft the best possible prompt for my needs. The prompt will be used by you, ChatGPT. You will follow the following process: 1. Your first response will be to ask me what the prompt should be about. I will provide my answer, but we will need to improve it through continual iterations by going through the next steps. 2. Based on my input, you will generate 3 sections. a) Revised prompt (provide your rewritten prompt. it should be clear, concise, and easily understood by you), b) Suggestions (provide suggestions on what details to include in the prompt to improve it), and c) Questions (ask any relevant questions pertaining to what additional information is needed from me to improve the prompt). 3. We will continue this iterative process with me providing additional information to you and you updating the prompt in the Revised prompt section until it's complete.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178394854213034135",
    "author": "Rob Domos",
    "date": "2023-11-26",
    "content": "His stance against slant rhymes seems to be more about being in favor of things fitting very tightly together and having intentionality and form and structure. He and another friend of mine viewed slant rhymes as mostly a product of laziness, as if the writer couldn’t be bothered to find something that truly fit.  \n\nI countered referencing the hook to an Olivia Rodrigo song where every single rhyme is a slant rhyme, which IMO adds to the value of it because she’s trying to express how things don’t quite fit and how the thoughts in her mind are unresolved, and the rhyme scheme should reflect that to create a unified feeling. \n\nThe lyrics are:\n\nYou’ve got me thinking\nThat two plus two equals five \nAnd I’m the love of your life \nCause if rain don’t fall and sun don’t shine \nThen changing you is possible \nNo, Love is never logical \n\nHere she’s searching and grasping. She’s unresolved. She literally uses a metaphor of the math not adding up. Why would we then make the math add up phonetically? It would weaken the effect. \n\nAlan was meh on it. \n\nI also argued that hard rhymes can be like the phonetic equivalent of a classical Haydn V-I movement that has very little color or tension, and that slight rhymes can be like jazz chords and that adding a 7 and a sharp 11 on top of the tonic chord doesn’t mean you “failed to resolve”. Someone else at the table was like “well show me a truly great song built on slant rhymes and we’ll see. I’m open to it” and in my head I was like “I thought I just did” but they didn’t love it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463933495637311815",
    "author": "Jack",
    "date": "2026-01-22",
    "content": "I usually majorly struggle with writing second/third verse lyrics when I’ve sat with a V1 + Chorus only demo for too long.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070188693073170492",
    "author": "Slow Hand",
    "date": "2023-01-31",
    "content": "Hmmm. Fun challenge. So both of these songs seem to be pretty heavy on evocative or surrealistic imagery without an obvious central subject (if there is one at all).\n\nHow about this idea: For each section of your song pull up a movie scene that you know or enjoy. Then write down everything you see without explicitly giving away what movie scene it is. Describe everything. Pick out details. Whether their actually represented in the scene or you're just speculating on something that *could* be. Or make up descriptions of the scenario beyond what's actually spelled out:\n\n*Two people casting glances across the room. One doesn't notice*\n*Hard shadows stretched across the floor*\n*Does he have enough cash in his wallet?*\n*Somebody's running late*\n*The room is thick with tension*\n*Someone did the crime*\n\nI dunno. I'm just spitballing, here.\n\nOR start mashing concepts together. Things that don't normally co-exist. You're bound to get some evocative results. Cedric from *The Mars Volta* fits into this mode pretty well. His lyrics are extremely evocative but after all these years I still can't say for sure what they're actually saying. If there's a coherent thought in his songs it's so far obfuscated that you'd never know anyways.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153463619590291537",
    "author": "austenballard",
    "date": "2023-09-18",
    "content": "I just kind of say \"so what\"\n\njust finished my 12th song today\n\nmost of them suck and won't matter and I won't send them out, and most of the ones I send out won't get cut or (in one specific case) added to someone's live set\n\nand even if they do, most of the work I do is for people who get one or two songs out, get their (increasingly literal) 15 minutes and then everyone forgets and moves on, including the artists themselves\n\nultimately I just remind myself that this is, for better or for worse, what god/the universe/who or whatever put me into existence to do and my responsibilty is to respect that and become as good at it as I can, and find as much meaning in it as I can, even if that's the kind of stuff @oaklandmatt said that won't necessarily move your career but brings you joy and makes the time you spend here worth something",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178408050089009334",
    "author": "chrissorem",
    "date": "2023-11-26",
    "content": "Good point! Pop culture has changed drastically and is moving at record speeds. And there seems to be two categories. musicians/bands and entertainers whose specialty is music.  I often think the world of speed dating song writing is not a great catalyst for writing  a great song.  Not that it can’t happen but the structure generally leads to mediocre songs that are written in forms we can predict.  I do miss the arch of a well written song with melodies give me chills and a bridge of that breaks my brain.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463933343249727519",
    "author": "Jack",
    "date": "2026-01-22",
    "content": "I think there are two schools of thought here:\n\n1. Fuck it, do it. Path of least resistance. You’ve tried other lyrics, they’re not hitting. Cut V1 again with a different vocal, do some arrangement modification and send it. \n\n2. Nobodies heard this song before, whatever icky stimulus you’re receiving from attempting V2’s can probably be attributed to your personal saturation of V1; something nobody else will struggle with. So get a decent V2, accept it won’t hit the same for you because you’re cursed and send it. \n\nBoth work!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842411240415297546",
    "author": "Josh",
    "date": "2021-05-13",
    "content": "How the fuck did I just realize Mr. Brightside just repeats the first verse as the second hahaha.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842529811603783690",
    "author": "thejadenmejia",
    "date": "2021-05-13",
    "content": "Don’t bore us, get to the chorus 🦦",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860138941508222986",
    "author": "oaklandmatt",
    "date": "2021-07-01",
    "content": "@Zack Hames @1ggy yeah I like the idea of a collab channel. I'm trying to think of the way of structuring it though so it isn't just \"hey here's a thing I did who wants to work?\" Which could end up very spammy. \n\nHow could we structure it so it's not spammy?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014972557180555284",
    "author": "Slow Hand",
    "date": "2022-09-01",
    "content": "There's a small discussion in #🎹production-talk right now about how short a song can be, and I'd be remiss if I didn't shout out the remarkable songwriting economy of *One Fine Day* by The Chiffons.\n\nThis song is not fucking around. Once the first verse begins @ 0:11 they proceed to burn through a verse, a chorus, *and* a post chorus in the span of 22 seconds. This song has amazing momentum. It is *flying* through its sections without a note out of place and I love it. It's perfect at what it is.\n\nHats off to Carol Kaye and Gerry Goffin.\n\nhttps://open.spotify.com/track/6vcG9EgeqJUSmmF65lxUm6?si=1f80c0e895f3436b",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076027141638078464",
    "author": "Nomograph Mastering",
    "date": "2023-02-16",
    "content": "And we’ll discover that the only thing the universe abhors more than a vacuum is a 90s inspired song from me",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472283335555285053",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Yeah I agree. What do you consider \"finished\" for a real rep? For the 30 minute songs, my bare minimum is roughly a verse, pre, and chorus, plus a voicenote of it played and sung all the way through. If there is no pre, or if it's more of a verse/refrain structure, I will definitely write a second verse.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472303932561952828",
    "author": "Jack",
    "date": "2026-02-14",
    "content": "I feel like it has to happen away from the computer. I can only speak for myself but there’s this wild temptation when I’ve written 3/4 of a verse or something that has potential to commit it somehow and it just leads to rumination. I don’t think anything unfinished ‘deserves’ permanence. It’s like mise en place or something. I don’t want to get my pan ripping hot while I’m still dicing vegetables.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472572222370480322",
    "author": "Brian Reynolds",
    "date": "2026-02-15",
    "content": "Then back to Matt's advice. Think less, do more. Write, write and then write some more. I used to sit on the train and listen to things like Gym Class Heroes, John Mayer, Say Anything, etc. and write lyrics to their melodies and songs. This is in 2006 before you could just download instrumentals. And by osmosis you'll learn and pick up on their lyrical structures and how they create a \"consumable product\"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472618867023937801",
    "author": "Zack Hames",
    "date": "2026-02-15",
    "content": "Thanks for all the info, it’s good to know where you’re coming from in more detail. That’s cool. \n\nSo you’re focused more on writing lyrics it seems then; I’d say write way more verses for a song than are needed, and pick the best ones to keep. Not only do you get reps but you end up with more to choose from than needed and potentially a better song.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842438728860958791",
    "author": "Josh",
    "date": "2021-05-13",
    "content": "It’s crazy because the whole verse could pass as a pretty solid chorus. So it makes sense that great verse and pre can just be repeated.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983961320288321576",
    "author": "chloe corley",
    "date": "2022-06-07",
    "content": "also j thought,if its like changes and repeated sections, could be helpful to memorize individual sections and then memorize the form/arrangement of those sections",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983981143336575026",
    "author": "Deleted User",
    "date": "2022-06-07",
    "content": "Personally, I latch onto vocal parts (if there is any) or other instrument parts to associate memories of what happens in the arrangement. It kind of takes me out of the charts too- if in some rare cases of “no charts” gig. But I find writing charts always helps in the process of learning parts even when it’s a no chart type of situation",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064659538659246080",
    "author": "Slow Hand",
    "date": "2023-01-16",
    "content": "Haha totally. There's a point on the 2nd Chorus of 'I Love Reading Books' where Blake starts cracking up because Sean is laughing at him while he raps about books and they just let the beat ride for 30 seconds until he gets his concentration back\n\nIt's just *fun*.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153374214586372137",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "And I’ll drop them into my Apple notes and listen to them a couple times a week and I actually realized a verse and a chorus I had where in the same key and fit together perfectly.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180920587158294629",
    "author": "shaunobi",
    "date": "2023-12-03",
    "content": "I do both when songwriting. I have a Google Doc of “songwriting starts” that includes little fragments - some titles, some a couple lines of verse, etc. A lot of times though it’s just the hook. So the title I start with becomes the hook, or the hook becomes the title. Like Chad notes smarty pants titles are kind of boring to me now…",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188047183694532650",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "moving conversation with @rae here\n\nI've been doing more of \"study the greats\" with production, when it comes to arrangement and production, I feel that things are a lot more clear cut than songwriting. For example, I can try break down the drums of a song into a  drum pattern, dynamics, feel, and the drum sound (type of drum kit, machine, and processing on it). \n\nBut with lyrics (or language) - it feels more gray to pinpoint how to take a concept and apply it into my own writing. How do you usually break it down?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242449455815458917",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-21",
    "content": "https://music.apple.com/at/album/open-country-joy/298144082?i=298144259 the long silence after the intro jam makes what comes after 1000x more effective",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275724524813553675",
    "author": "bookchild",
    "date": "2024-08-21",
    "content": "This has made me realise that I don’t write as many bridges as I thought I did - I’m not sure how I feel about that, but thanks for getting me thinking.\nWhere I have written bridges they seem to have a different pov/understanding than the song to that point. Maybe they also have a key change that reflects this. \nI can’t think of a time that I’ve added a bridge to a song. If I’m editing I’m more likely to take bits out (more clay is rarely the answer).  I think bridges have always felt necessary/natural when I got to that point. Maybe I’m not enthusiastic about another verse/chorus or maybe I just try another chord that make me go “oh”.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385030307278749817",
    "author": "Brian Reynolds",
    "date": "2025-06-18",
    "content": "I'm always in the daw. Always recording.\n\nSometimes melody first. But mostly drums first.\n\nBuild an instrumental just chasing intuition, quickly. 2-3 melody parts and a bass line on top of drums. And youve got a chorus loop. \n\nThen take that improvisational melody muscle and apply it to the vocal melody. \n\nIm not a big humming guy, I get to words pretty quickly. But will start with common phrases to me like,  \"runnin runnin runnin round runnin runnin runnin down\" I have a few others.\n\nI start to land on a melody, with a feeling and story. That I haven't told. Sometimes it takes 90 seconds, sometimes 5-10 mins. \n\nRecord and comp till I have what I like. Than do all the background vocals. \n\nThen start muting a couple of the melody parts. Find my verses.\n\nRinse repeat the process above. But now I know the story and I just have to find the melody and the thru line narrative.\n\nDepending on how the verses feel running into the chorus. Or short length of track. I'll write a bridge \n\nMelodyne the vocals.\n\nStructure the song.\n\nMix the song.\n\nUpload the song.\n\nMake another.\n\nThis usually takes 2-4 days, intermittent with regular life.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1439348333826015313",
    "author": "Brian Reynolds",
    "date": "2025-11-15",
    "content": "I rhymed \"Hammurabi's time\" with \"victimless crime\" in a verse. Today I'm the winner 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441835223322202152",
    "author": "Josh",
    "date": "2025-11-22",
    "content": "Made the mistake of eating Taco Bell at 1am and caught “you fucked with my head like a bleach blonde Bible verse I read while bleeding out on a Sunday afternoon” the next morning and what’s wild is that actually happened to the artist so here I am refining traumatic stories while fighting for my life",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452413474213990652",
    "author": "Brian Reynolds",
    "date": "2025-12-21",
    "content": "Do the final two lines of verse two ever come easy?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471659259895746641",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "1. Write a song every day (or attempt) certainly you’ve heard of and likely tried this, but nothing beats reps.\n\n2. More technically, write out the structure (intro, verse, chorus, etc) of some of your favorite songs and mimic it exactly. Even as far as how many measures, or even dynamics (or tempo changes!)\n\n3. If you play an instrument, Learn “great” songs. And ideally sing with them. Playing the best songs in the world will seep into your writing and show you new ideas on chord movements, melodies, and the physicality of a great song.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827593540641095720",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "As for learning music theory in depth. Oh man. That's so hard to recommend. As someone who is *very* self-directed, loves to read, and is hungry to learn as much as I can, I find *reading* about music theory to be incredibly boring and difficult to comprehend. It's fine now that I'm already well-versed in it, but nothing makes my eyes glaze over faster than reading someone describe theory in writing. Let me think on it for a bit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827638754876325968",
    "author": "Zack Hames",
    "date": "2021-04-02",
    "content": "My best way of learning theory was just by actually having a reason to use it. Just trying to learn broadly/abstractly is very difficult IMO. A project in school, I had to transcribe a 70s funk tune by ear, get musicians to come and play the charts, then record it authentically and recreate and match the mix. This has organ, horn section, guitar, bass, drum kit, background and lead vocals. I learned so much from that process.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "830332601482477568",
    "author": "antoniohannamusic",
    "date": "2021-04-09",
    "content": "Tried to listen to this with an open mind but couldn't hear past the \"my first logic session\" feel of the whole thing. \n\nI don't know that X-Billion dollar AI tech was required to write the song but it might have had some credibility if say they got Dave Grohl to play on it instead of using midi instruments? \n\nIt just feels very sterile and not Nirvana, also, why were there so many sections in the song structure? The bolted on outro.\n\nWould love to know if anyone else here has heard this and immediately got annoyed hahaha!?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831596833812906024",
    "author": "Slow Hand",
    "date": "2021-04-13",
    "content": "Godard shot a documentary in '69 of The Rolling Stones tracking 'Sympathy For the Devil'. You get to watch them do every take in the tracking room until they land on the final arrangement: https://www.youtube.com/watch?v=juChsS5KvhQ",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "846649161982017536",
    "author": "i am willie",
    "date": "2021-05-25",
    "content": "people in the room and producers getting writing credits add up- not to mention some people getting writing for arrangement and stuff that's a lot of people tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851462412610961458",
    "author": "Yago Ibars",
    "date": "2021-06-07",
    "content": "I've been having a thought on my songwriting I wanted to share here. As a songwriter I have this toolbox of melodic and harmonic approaches  that I can use to solve any problem when making a song, or to have direction to create another section. But recently I've been noticing that something that makes a huge impact on songs is how the different sections relate to the tempo of the track. I think this might not happen to people who write to a beat, but I think that when you are playing an instrument, tempo is so fluid that some parts of a song might \"feel\" good and others won't (at a same tempo). When all the sections flow well into another in terms of tempo (and probably how that affects to vocal delivery) it sucks you in as a listener and it is way more singable/enjoyable. And now I'm starting to see this as a priority more than which notes of the scale have more weight on the chorus and stuff like that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851469831248412744",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I think a lot of it has to do with the melodic rhythm. In terms of how the sections flow, if the melody can drive it on its own- the accompaniment or production will follow. And as you mentioned, high notes can move the energy and accent the rhythm. Lyrical stress patterns could contribute to the accenting and note selections. Weight sometimes means notes that are held longer than the other sometimes the opposite. Contrasts can do a lot though. Range of movement or the range of the pitches themselves, pacing of the rhythm and rests, breaking the patterns/repetition can help with contrast",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851475913195782205",
    "author": "Yago Ibars",
    "date": "2021-06-07",
    "content": "Couldn't agree more! I think what I was trying to say is that melodic rhythm is very much related to the tempo of the song and the delivery of the singer. And when tempo changes, even if the ratio remains the same, it has a different impact on how it feels. And, sometimes, because you might not be writing to a click, different sections of a song might \"feel\" cohesive at different tempos. And when you sum everything up it just doesn't translate well. And I've had the experience of trying to work around it but ended up noticing that it didn't have to do with the melodic rhythm in each section, but how it relates to the whole song. And now I try to be more aware of it because I think it might be something that is not easily noticeable when you are writing. I don't know if that makes sense (I'm not a native english speaker and therefore I struggle a bit sometimes 😆 ).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591456035438592",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Look at a song like “The Weeknd - Can’t Feel My Face”, that chorus top line wouldn’t be possible without a rhythmic and detailed instrumental",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591591104479252",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Or even the verse melody in “Dua Lipa - New Rules”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855592008713764905",
    "author": "David Fuller",
    "date": "2021-06-18",
    "content": "great song, but that chorus is one note",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855595000037244978",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Especially the verses",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860161400152653864",
    "author": "antoniohannamusic",
    "date": "2021-07-01",
    "content": "I totally get where you're coming from and obviously it benefits no one if there's 1000 links per day with no follow up.\n\nDon't know if this is a solution but could have set rules around it?\n\n*Limited posts per person (1 x a week?) \n*Must state intention in the post.\n*State genre in the post\n*No spamming, only DM people if you genuienly want to work with them\n*No posting work that isn't yours/ you don't have the right to open up to collab\n*Must delete your post once you find a collaborator - keep the forum clean \n\nSelfishly I want something like this so I could be like: \n\n\"Hey, got a new song I'm co-writing (Think Lauv meets PATD)  hung up on lyrics/melody/stuck on bridge (etc etc), DM to work on it (soundcloud link).\"\n\nInterested to hear your thoughts on how something like this could be implemented!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874367727295418440",
    "author": "peterlabberton",
    "date": "2021-08-09",
    "content": "Alright, I’ve got a semi-songwriting, semi-biz question:\n\nI have never written a song entirely from scratch in my life; musically I’m a drummer first and foremost but play most things guitar-related and can plunk something out on keyboards as well with a lil editing. 🙂 I can’t say I have a great ear for melody, but building a rhythm section and producing a track I feel very confident in.\n\nI frankly don’t have an interest in writing songs per se, BUT a friend of mine who does a fair amount of songwriting sessions says he tries to do one a week, partly just to get in the room with new people and start the ball rolling on potential tracks to produce.\n\nWould it be crazy to try and do a few songwriting sessions, which I understand basically have no pay up front, with the hopes to then have the artist back and finish producing/mixing the track if it goes well? Is this a version of how that works?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874668818235011133",
    "author": "oaklandmatt",
    "date": "2021-08-10",
    "content": "depends what we're talking about. if i'm writing with an indie band, we cross the business bridge when we come to it because i'm a co-owner of the songs we make. if they want to use the songs, we have to come to an agreement at some point and it always sucks talking business while trying to be creative.\n\nif an unsigned band wants me to produce existing songs, there's an agreement before we start.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876189678439657482",
    "author": "Josh",
    "date": "2021-08-14",
    "content": "Doesn anyone else feel like the cadence of a top line says more than the lyrics? I feel like I’ve been doing this for awhile and just started noticing recently when @Rob Domos  told me my run on sentence of a chorus was terrible (I still love you) because it wasn’t perfectly symmetrical with the first half of the chorus. But to me, having that manic performance really struck home the idea that you’re experiencing a blur of the night just to lead up to an extremely quiet post chorus to make it feel like you woke up alone. Both of those themes also reference the lyrics of course. Idk this doesn’t make that much sense without context, but that’s really been on my mind. I feel like I’m broken for not making everything extremely simple but I like to think that even average listeners feel more from the performance and energy of things changing than just having something that’s super predictable. I don’t think people particularly like simple songs over songs that make them feel something.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876219864585490433",
    "author": "Yago Ibars",
    "date": "2021-08-14",
    "content": "In my experience the sweet spot is somewhere in between both, as you guys have said. Melodically I tend to be like @Rob Domos and make everything as simple and predictable as possible, but sometimes it feels too easy and there is nothing that stands out. Lately my approach has been to use lyrics and chords to spice things up. For example, If I've got an idea for a lyric that I like, most times the metrics of it won't be incredibly predictable, and when I come up with a melody for it will be a bit more interesting than if I started out with the melody. Maybe then, for another section of the song I'll start with the melody and it'll be simpler. I think contrast is key. It really is an interesting topic!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983960273092214814",
    "author": "ehutton21",
    "date": "2022-06-07",
    "content": "hmmm, it’s been a while but i do have experience memorizing like big works (albeit on piano). bass may be different than my experience but maybe this helps. i definitely say break it down in bits. always smaller bits when possible\n\ni think a big thing for me to make a song less daunting is analyzing the theory and structure of the song, and then break it down into bits and write down “chorus 1 motif”/keep a list of what you need to know for the track, and it’ll make you feel less in over your head when you feel the volume of work increase.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009589247126290444",
    "author": "Zack Hames",
    "date": "2022-08-17",
    "content": "I've written a million songs but I haven't finished a millions songs,\nWhat are some approaches for really getting a song wrapped up in the writing/production stage?\n\n I have a hard time coming back to ideas after the initial start .(like getting a verse and chorus down, 1:30 long recording demo, then coming back to finish it has been incredibly difficult). \n\nIf I don't get the whole thing structured out and pretty much written in one sitting it almost never gets done. Any ideas?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009590516750491808",
    "author": "youngteam",
    "date": "2022-08-17",
    "content": "also like, consider what does finished even mean? i make samples for people so that might mean recording, comping and creating a structure out of my improvisations and then sending it someone else to write to. in this scenario finished doesnt mean full beat, mix, master etc but just an idea for someone else to get inspired to",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035071416963432552",
    "author": "ehutton21",
    "date": "2022-10-26",
    "content": "Bridge is the most important part of a good pop song, IMO",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035089311764328491",
    "author": "Ross Fortune",
    "date": "2022-10-27",
    "content": "Love a bridge. Can be an opportunity to get a counter argument (thematically, logically, melodically, harmonically, rhythmically…) to the entire song into a few bars. Almost a mini song within a song, that still has to build and lead satisfyingly back around to the chorus that birthed it.\n\nTop 2 bridges in my head at this particular moment: Adele - Someone Like You, Jason Derulo - Want To Want Me (been a fan of Ian Kirkpatrick for years)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058038205544419328",
    "author": "Zack Hames",
    "date": "2022-12-29",
    "content": "Things I do:\n-Try to write all the music for a song in a day (full structure, verse, chorus, bridge, etc)\n\n-write all the lyrics for a song in a day\n\n-write a chorus or a verse with music and lyrics together\n\n-make a beat or something electronic or pop based\n\n-write completely removed from a computer\n\n-make a drum beat first and jam over that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1060291565328805909",
    "author": "austenballard",
    "date": "2023-01-04",
    "content": "@NoahNeedleman moved from monitoring\n\nwhat did you mean by demos getting upgraded to masters btw, like when you start something as a 'demo' and before you know it you're tracking it out for mixing without swapping out drum samples or re-playing the parts you thought you were going to? \n\nI definitely see the distinction between demo and arrangement getting blurrier and blurrier.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153374090883760258",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "Something I’ve been doing way more than ever though is I’ll have like a good verse or a good chorus",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153452502205861898",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-18",
    "content": "Follow up question if you don't mind, really interested in your expertise - at what point do you personally go from that quantity mindset to polishing? At what point if ever would you for example write X number of prechoruses to find an ideal one for a track?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155993482603790427",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-09-25",
    "content": "„Don‘t let the chorus be a mystery“",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156024303310077972",
    "author": "Nomograph Mastering",
    "date": "2023-09-25",
    "content": "I guess my idea was that by asking it for song form “Joni style” you are limiting it’s options to song style inputs. Like asking it for almost any other form may yield more inspiring jumping off points",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156026674622779445",
    "author": "Nomograph Mastering",
    "date": "2023-09-25",
    "content": "The net needs to be cast much wider than song form",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186032423184642138",
    "author": "samvalentine",
    "date": "2023-12-17",
    "content": "Interesting. We’re basically taking the refrain of a Beatles song and repeating it over and over… almost like a mantra. Can’t imagine that’s a cover exactly. It’s the same melody but I think because the structure is so different it’s more of an interpolation. Is there an easy way to get permission or do I have to call Paul?\nAlso would be down to just submit it as a cover and relinquish publishing, but if it’s truly not a cover I could see that resulting in a headache… or is cover just a safer bet overall?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186157787433140276",
    "author": "oaklandmatt",
    "date": "2023-12-17",
    "content": "I don't know the legal definition of a cover. But I'm pretty sure just taking a chorus is not a cover.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200536583577817098",
    "author": "Rob Domos",
    "date": "2024-01-26",
    "content": "How finished would you say these sounded arrangement production wise?\n\nLike, are y’all using placeholder patches and scratches tracks when working at that speed or are you keeping enough that it’s at 90% day of?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200555098598821999",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "I go off the assumption that this is the only time I'll have this artist focused on this idea, so my priority is always getting a finished lead vocal and some ad libs. Those are the only things that can't be done without the artist there. I'll get the production together as much as it needs to be to get the artist excited about the song. \n\nThe challenge is doing this quickly, without spending unnecessary time going through snares and patches and shit. I find that nearly all of the best songs I've written happen in about an hour long window of excitement. Sometimes you can stretch and get harmonies or punch in some vocals beyond that hour, but the excitement of a great idea is exhausting and it's hard to keep everyone 100% engaged for a long period of time. If I'm on hour 2 of a song and we're still trying to decide if we like a chorus, 100% of the time it's not a good song (in my experience).\n\nA BIG mistake I make (still) is \"oh we have tomorrow we can take a break and come back.\" It's not about being able to get the artist physically back, but getting everyone back into the emotional space. So much of what I need from an artist is the emotional focused to commit 100% to a vocal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220657576333545534",
    "author": "Marshall",
    "date": "2024-03-22",
    "content": "Do any of you guys fall into the trap of writing the same type of song over and over again? lol. I feel like when I’m improvising over a beat or something I tend to make similar subconscious choices in the melodic structure/melodic rhythms/etc. the only way I can get out of it is by setting parameters before hand (ex: don’t start the melody on the 1…..use an AAAB structure……..make the A sections complex and have their own micro-structures/use many types of rhythms,  use like 3-4 notes in the scale maximum and mostly dwell on a single pitch/don’t hit the “money notes” lol…..Make the B section almost completely one  consistent rhythm, use way more notes in the scale than the “A” and hit all the notes you didn’t hit in the “A” to resolve the melody)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222122011132694538",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "The melody also is very well structured. Maybe they did it subconsciously…..but idk. Seems pretty intentional to me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222123690259644466",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "But idk, I feel like studying and understanding structure couldn’t possible hurt",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222125436583149649",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "I feel like the people who go into writing a song with the heart first are extremely valuable too. It’s like ying and yang. If you are improvising a chorus with a great song concept over a great beat, the melody falls into place……but if it doesn’t, why not use some theory/etc to understand why the topline isn’t just falling into place naturally? Could be a quick fix like switching up the rhythmic phrasing or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222133779603263549",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "It’s just music theory and song structure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223922252106563654",
    "author": "Marshall",
    "date": "2024-03-31",
    "content": "Maybe that’s another example of the structure just coming together instinctually because the story and lyrics were so powerful? Would love to hear about it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232647477211955211",
    "author": "Marshall",
    "date": "2024-04-24",
    "content": "Idk why but once the “Your wife waters flowerrrrs” hits in the chorus and resolves the tension between the melodies and chords it just gives me chills every time lmao",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232647772600139797",
    "author": "Marshall",
    "date": "2024-04-24",
    "content": "And the “move to floooorida” post Malone bridge",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1238673677948551271",
    "author": "Slow Hand",
    "date": "2024-05-10",
    "content": "Here's a friendly reminder to write your song intros with intention and as early in the process as possible. I am once again writing the intro last and driving myself up a wall trying to make it all work.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1238674714608537631",
    "author": "Edward Rivera",
    "date": "2024-05-10",
    "content": "Don’t bore us, get to the chorus !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1238890034380279808",
    "author": "montrose recording",
    "date": "2024-05-11",
    "content": "some pals and i ran down kaya by bob marley a couple days ago.  some of the intros were amazing and iirc were referencing the bridge harmony,  then drops into chorus",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239018418322276383",
    "author": "Will Melones",
    "date": "2024-05-11",
    "content": "I remember a clip where Dave talks about making the chorus lyric something you’d read on a bumper sticker. Genius.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242449834611445922",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-21",
    "content": "https://music.apple.com/at/album/raider-ii/674008092?i=674008202 the silences inbetween the piano chords in the intro are so long it almost seems like he‘s taking the piss but they add sooo much tension",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254682262688108606",
    "author": "rawssx",
    "date": "2024-06-23",
    "content": "The use of silence on the chorus of this song is phenomenal, glad you brought that topic up its always interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275533333945782343",
    "author": "DanRodriguezMusic",
    "date": "2024-08-20",
    "content": "Hey, y'all. Forgive me if this is a question asked already, but how do YOU decide if a song needs a bridge or not?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275533837065257085",
    "author": "gatewoodsensei",
    "date": "2024-08-20",
    "content": "If i didn’t say everything that needs to be said in the first and second verses or if i need a points to be emphasized more.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275838615296934001",
    "author": "lystell",
    "date": "2024-08-21",
    "content": "I use to ask the bridge. Sometimes she gets back and sometimes she don’t 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275962457659015271",
    "author": "AJ",
    "date": "2024-08-21",
    "content": "I think @gatewoodsensei  gave a great answer. It mirrors my exact thought process. I'm very used to writing a bridge though. Trying to give myself permission to not write them too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276576592767881236",
    "author": "Chad Rodgers",
    "date": "2024-08-23",
    "content": "Made like 4/5 sketches today for an artist I write for, and I'm feeling a little merrrrr for all of them. Need to get out of my go-to chord structures, vibes and feels. Anyone have any tips for this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324815186938429471",
    "author": "SoundsLikeJoe",
    "date": "2025-01-03",
    "content": "Do the songwriters get paid to create those demos?  No...  but they often PAY OTHERS to help them make the demo possible.  Nashville folk will often have \"Demo Days\" where a group of Ace players charge a flat fee to perform and record the rhythm section (for instance, could be anything the song needs). They might record 5-10 tracks in a day. I'm sure some have done more. These \"demo day tracks\" are used by songwriters to then pitch their track to recording artists, labels, anyone.  There's also a whole army of producers ready to help songwriters demo-up...  where the songwriter pays a producer to turnkey the track.  Sometimes it's one guy playing everything or a few remote players all chipping in under the producers direction.  \n\nAnd...  these are viewed as a \"very basic demo\" in the eyes of industry vets. A really good \"one take\" by great players with high quality equipment recording the basic tracks is a strong demo but not fully produced. Happens all the time, but the producer (and their team) gets paid by the songwriter (or their team) to produce the track.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1327928057536974889",
    "author": "itamaramati",
    "date": "2025-01-12",
    "content": "Question for the people: What are things that helped you create a healthy writing workflow? \nI mostly jam on an idea, record a verse and a chorus and save it for later (sometimes I write a whole song in a bang), but I would like to write full songs more often.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328028492562038938",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-01-12",
    "content": "Great stuff above, my experience is a bit different, as I’m sure everyone’s is :)\n\nI find that lyrics is where I get stuck, especially if I’m trying to write to a set melody. The biggest unlock for me was to write an entire song’s lyrics first, sometimes preceded with some journaling and/or research on the topic so I have real, meaningful things to draw from. I keep track of syllables etc so it lines up.\n\nOnce the lyrics are done and I’m working on the song, I always end up having to change a lot, usually simplify and take out, but it’s an easy problem when you have excess good lyrical content. As opposed to trying to summon something meaningful to fit a certain melody.\n\nSimple stuff like starting with getting the chorus right has also been super helpful, and keeping production to a minimum before the topline is finished.\n\nExcited to read more people’s hacks here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354656891736821782",
    "author": "oaklandmatt",
    "date": "2025-03-26",
    "content": "The short answer is: you're a songwriter now too. This is a new part of your professional repertoire. This is great.\n\nI made a similar transition from producing bands to doing co-writing sessions as a producer. You can still get hired as a producer or engineer (as I still do), but writing sessions are structured with different expectations and potential outcomes. \n\nWhen you participate in songwriting sessions, you are almost never getting paid up front as an engineer or producer. There are some cases where super rich people will pay for songwriting sessions, or artist with bigger budgets might get their label to pay a studio fee, but this will be a tiny minority of your writing sessions. \n\nPhilosophically, the idea is that you're all creating something together that, if it's good enough, it will be released into the world in someway. But your experimenting and will make many ideas that don't cross that threshold. However, if any of the recordings of these song come out you will still get paid as a producer (/ engineer / mixer / whatever else you do on the final version). If no peace of the recording that you made when the song was written gets used, you will still participate as a songwriter on the copyright.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378679290429837452",
    "author": "Pio",
    "date": "2025-06-01",
    "content": "Late to this one, hope your songwriting journey is going great this past while! \n\nIf you’re still looking for more on this, and don’t mind a little reading, I was recommended Pat Pattinson’s Write Better Lyrics years ago and I found it a super helpful tool - I loved the recommendation of a 10 min a day exercise of ‘object writing’, and also the idea of thinking about your verses as a way of ‘loading’ story and fuel for your choruses. \n\nJeff Tweedy also has an even shorter but really uplifting book on writing called ‘How to Write One Song’, which is excellent. It’s more geared towards the personal, less towards industry, but I’m so convicted that writing personal songs IS the way to reach others that I would definitely recommend it too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385323238024024227",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "That is so interesting to head - I’ve never started with drums but can totally see this. I focus on the soundscape of the chords and melody, add a drum skeleton for lyric writing, write lyrics with song sections and overall composition in mind, then go back and change the production and drums to interact with the combination of the composition I envisioned and the cadence of the lyrics and how the drums interact with both at the same time.\n\nHuh - I’d like to be a fly on the wall for the drum first sessions to see how it all unfolds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412165636624486440",
    "author": "Brian Reynolds",
    "date": "2025-09-01",
    "content": "I love the contradiction of how it structured. Frightens and Awful are adjectives you think are leading somewhere and that somewhere isn't to Sweet. But life, like the lyric is full of suprises.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412523037307441225",
    "author": "Brian Reynolds",
    "date": "2025-09-02",
    "content": "\"There's a you-shaped space in my bed\nAlways you-shaped thoughts inside my head\"\nMark Ronson and Camila Cabello\n\nI love these types of lines in verses. Where you have multiple similar words and rhyming spots across a two line phrase. To me it creates this very delectiable ear worm quality. That starts to tickle at chorus quality. And as soon as you tickle that sensation, It disappears as the song moves forward. Makes want to replay just to experience that feeling again. Also love how its about a collective experience about missing a former lover in the physical world and thinking about them.\n\nAnd in classic fashion I've been signing the second line as, \"All these you shaped thoughts\" as opposed to apparently she is singing \"Always\". It should have \"always\" been \"all these\". Only realized my error when Googling the lyrics for this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463905037884457092",
    "author": "herbie",
    "date": "2026-01-22",
    "content": "what are people’s thoughts about copying and pasting a first verse to the second verse? we’ve tried a bunch of new lyrics and nothing seems to stick as well as just copying the first verse over. i know its prob sacrilegious to do so but just curious to hear people’s thoughts. \n\nwe also probably have horrible demoitis but it just feels right :kekcry:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463915321239929064",
    "author": "Will Melones",
    "date": "2026-01-22",
    "content": "Can you do this and then write a new first verse? Maybe you haven’t said everything there is to say, but you have the perfect second verse",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463926919233011809",
    "author": "herbie",
    "date": "2026-01-22",
    "content": "the first verse is what its supposed to be so that probably wont work unfortunately but i’ll def try that suggestion on some other songs!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463992473792807037",
    "author": "herbie",
    "date": "2026-01-22",
    "content": "it’s actually the worst haha. we do have quite an arrangement change in the second verse so i think keeping it should work!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471654730995466455",
    "author": "revolution",
    "date": "2026-02-12",
    "content": "im not a professional, pretty new to music in the sense of trying to create a product/song. Ive been an instrumentalist, engineer, writer, etc etc as a hobby or interest from time to time... and i notice that writing is one of the areas that I have the least doubts about myself. i fully believe i can write interesting bars/emotions/etc from time to time... but it's very much an abstract 'writing' skill that could be applied to poetry or essays or anything... rather than a reflection of my actual song writing ability.\n\ni want to learn how to hone my strengths and bridge the gap between having or putting out decent ideas (wether lyrical or melodic) and actually distilling a song structure and 'product' if you will. A good analogy is the gap between someone with good cinematography instincts/eye vs a director/writer/editor level of structure or authorship",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471659916518490165",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "Note on writing every day - focus more on the nuts and bolts of the song, the chords and melodies and structure. The production side and extra layers can come later. If you’re taking more than 5 seconds to pick a snare sound, you’re not focusing on the right thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472284607972901107",
    "author": "Jack",
    "date": "2026-02-14",
    "content": "Yeah, agreed. If all the repeated components are there (with different lyrics I guess. Verse, pre, chorus) then it’s a rep for sure. I think we get passes on bridges, especially if they’re instrumental. I have no justification for this but bridges have always been latent for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472293494910484572",
    "author": "Brian Reynolds",
    "date": "2026-02-14",
    "content": "I think if your also trying to up your production game in conjuction with lyrical top line melody. Then a rep should be a whole song. You gotta learn the nuances of subtle or drastic changes from verse 1 to 2. And deploying multiple transition techniques to keep the narrative moving and compelling",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472304124103229490",
    "author": "Jack",
    "date": "2026-02-14",
    "content": "And if I do commit it I start layering and it starts becoming an exercise in arrangement rather than songwriting. I try work horizontally, not vertically.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472305467568164865",
    "author": "Will Trotman",
    "date": "2026-02-14",
    "content": "Big agree and love the analogy haha. I also feel like hearing any section I've built out on loop burns me out on the song so insanely fast before any actual song is written.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472305687186112623",
    "author": "Jack",
    "date": "2026-02-14",
    "content": "That’s it, I become attached to these mad loops of potential. Those aren’t fucking songs. So often my ego wades in and I start building a verse that sounds really great and I’m like WOAH THIS ALMOST SOUNDS LIKE A GREAT SONG!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472317650884624475",
    "author": "Zack Hames",
    "date": "2026-02-14",
    "content": "Totally; I saw that OG poster said that as well, but some of their other notes In that post seemed to mention more songwriting aspects like melody and having more than just 1 verse or riff written.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472553605637607702",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "i guess other forms of art like film or books often do require a lot of structure and thought in order to cohesively convey or execute a vision... even if the vision is fundamentally grounded on a seed of feeling or very specific idea. songs and music are so temporal and intuitive that it doesnt really require that necessarily. \n\nfor better and worse, i tend to have this desire to seek out a 'scientific' nature in things. for me as a fan of films, i can often decipher or intuit the internal logic and intentionality that choreographs lights and angles and framing to create a moving feeling/painting. \n\ni do fully agree that fundamentally the only thing that can create this sense of 'spatial awareness' in a medium, or a sense of dialectic/causality between the subtle and intuitive, creative elements is experience and repetition; but i can't help but seek out knowledge or structure/self critique to my approach.\n\ni think to that end, i should collaborate more with people who are experienced so i can accelerate my own learning if that's what i seek. i find myself always searching for this 'internal' awareness of intentionality, searching for the forces and patterns that make a system or experience exist and change how they do.\n\ni am alwasy looking for this feeling of purpose or understanding of which steps are wanted/needed for me to take what ive created closer to its essence or my original vision. i think people understand this at the level of more technical creative aspects... for example mixing. ultimately the art is still to have a creative vision and executing that, but it's the experience and awareness to have intentionality and wisdom in how to execute that separates raw creativity/talent from a professional level of execution no? I think the same can be applied to more abstract skills like writing/songwriting.\n\ni'm going to commit to writing new material everyday for a month and see what happens!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472560839809826901",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "@Brian Reynolds if it gives context, im speaking from a place of doing zero production. i fully agree with @oaklandmatt about not trying to produce or really do any editing while writing. i primarily work off premade instrumentals, and am frankly only interested in the idea/feeling in front of me. in essence its usually a barely consious continuous freestyle. the best ones at least, come up on their own, i am there to maintain the moment and my presence in it. (and to turn on the recorder lol).\n\nso i was speaking almost entirely from an exclusively songwriting pov, and especially taking idea/demo with appeal/feeling to an actual song structure and consumable product/commodity frankly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]