[
  {
    "id": "1059283855841968160",
    "author": "Slow Hand",
    "date": "2023-01-01",
    "content": "Hey @everyone. After some discussion we've instituted a new forum #song-a-week for what will be the first of a weekly songwriting exercise that we now invite you to participate in.\n\nThis is an opportunity to flex your songwriting muscles and share your work with your peers. Every Sunday evening we'll pick a songwriting prompt for the coming week. It may be a theme, or perhaps a popular song that we'll all use as a jumping-off point for inspiration. Participants will have between Monday and Fri of the following week to write and share their song demo. Then we do it all over again the following week.\n\nThe forum is located right beneath #✍songwriting-talk on the channel sidebar. Everyone is welcome to participate starting tomorrow (Monday).",
    "reactions": 45,
    "categories": [
      "creative_process_workflow"
    ]
  },
  {
    "id": "827583267477782529",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "@everyone added a songwriting channel because i know a lot of you (and me too) are writers as well. i might have more thoughts on songwriting than mixing and producing tbh. even though the jon talks are so engineer focus, i'd love to chat more about writing with you all! i've done a ton of it...",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1187776390855131198",
    "author": "1ggy",
    "date": "2023-12-22",
    "content": "My 9yo working out some lyrics. Better than his old man already. 🏎️",
    "reactions": 23,
    "categories": [
      "lyrics_lyric_writing"
    ]
  },
  {
    "id": "1200522135244914768",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "If you're trying to be a highly successful professional, you should do all of these things and be prepared to adjust on the fly.\n\nI pretty much always have full songs, tracks, hooks, and concepts prepared. Much of the time, you won't use any of them on any given day. But good news: they're useful for future days.\n\nI've had all of that prepared and then the artist and I just chat for five hours, then write a song on a piano.\n\nI've had all that prepared and then cut song after song because the artist goes \"what else do you have???\"\n\nAnecdote that might be helpful: I've been in with an artist all week. Me, another producer/writer, and her. The other producer/writer has his rig set up and he also writes topline. We usually bounce back and forth depending on what the song requires. We've all worked together before and we had the whole week blocked out so there's no pressure to perform on day one. But we did three songs on the first day because she just came in firing. The first song she came in with a title and we worked from scratch and knocked it out in an hour. The other producer made the track quick with some existing drum loops he had prepped for her, adding keys and horns as we wrote. Then she asked \"do you have anything to play?\" I played her a track hook I had prepared. She liked it and we powered through that one in another hour. Then we broke for lunch. We caught up. As we were finishing she mentioned this one kinda stupid and sassy idea she tried to bring into another session but the producers didn't like it. So we wrote that one and it was fire. I tapped out a tempo as she rapped the hook idea and just make a skeleton beat on the fly.\n\nBeing way over prepared is rarely going to hurt you.",
    "reactions": 20,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "cowriting_collaboration",
      "demos_song_production",
      "instrument_composition",
      "publishing_business"
    ]
  },
  {
    "id": "876057469837799454",
    "author": "oaklandmatt",
    "date": "2021-08-14",
    "content": "@everyone watch this. whether you're a songwriter or not, it's by far the best insight into the modern process of making records that ever seen.  yes there are plenty of masterclasses and song breakdowns and people going on IG live talking about not using compressors, but this gives a unique insight into how the process actually FEELS behind closed doors",
    "reactions": 17,
    "categories": [
      "creative_process_workflow",
      "vocal_performance_delivery",
      "references_study_learning"
    ]
  },
  {
    "id": "1221123573503230003",
    "author": "oaklandmatt",
    "date": "2024-03-23",
    "content": "I have a different angle you could try. I would focus almost all your energy on becoming a better, more truthful, richer lyricist. That's the only place you'll be original because there's only one you. Paradoxically, it's also the way you'll write songs that have a universal appeal because the more personal you get, the more the underlying universal emotions will resonate with people.\n\nTrying to be analytical about melodies and structure and style when writing has never yielded good songs for me or literally anyone I know. All the best songwriters I've met write all their best songs lyrics first.\n\nAlso, when you have something to say, it's surprising how little you pay attention to the melody. The melodies and structural components seem to just come when your heart is already in the story.\n\nThe only other thing I'd say is learn A+ songs. Learn the lyrics completely and learn the story behind them as much as possible. Then learn to sing them the way the original version is sung. That will expand your vocabulary as a vocalist and reinforce great lyrics.\n\nLastly, technology is going to continue to increasingly replace stylistic innovation. Yeah AI blah blah blah, but already drum machines and synth presets and splice and DAWs. The last thing to be replaced will be you personally writing things from your experience. Songs about your deepest insecurities and songs about your pet gerbil both fall into this category. Explore all of it.",
    "reactions": 17,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "song_structure_form",
      "vocal_performance_delivery",
      "references_study_learning"
    ]
  },
  {
    "id": "836143867022934026",
    "author": "Rob Domos",
    "date": "2021-04-26",
    "content": "I once got in a lonnnnnnnnng philosophical conversation with this mastering engineer who was mentoring me back when I was still an artist and he gave me the best assignment ever. He said “I want you to incriminate yourself. Write whatever you least want people to hear from you.” I did and it was the best response I’d ever gotten on something I’d made at that point. It completely changed the way I write",
    "reactions": 16,
    "categories": [
      "lyrics_lyric_writing",
      "references_study_learning"
    ]
  },
  {
    "id": "900188589231587340",
    "author": "oaklandmatt",
    "date": "2021-10-19",
    "content": "write embarrassingly honest songs about your life. what's exciting you stressing you making you sad making you uncomfortable etc. \n\nps, all the A level songwriters i've worked with are super lyric forward. most people think it's finding a melody then writing lyrics to it, but 90% of the great writers i know are putting their feelings into words well before they're getting on the mic",
    "reactions": 16,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "vocal_performance_delivery"
    ]
  },
  {
    "id": "1075789852584444075",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "Some songwriting-related morning routine thoughts:\n\nI've been starting my day with doing piano scales and vocal warm ups to a metronome and then singing/ learning a song and recording a voice note of it. (recently it's been Tom Petty Wildflowers at the piano). Then I look at my phone and start my day.\n\nHard to know for sure if it's causal, but my songwriting abilities have sped up. I'm quicker in sessions, both with topline and tracks. \n\nI think it's related to several aspects of the morning routine, and they all compound. \n\n*I'm playing music before I'm on my phone, so I'm outputting music before my brain starts reacting.\n\n*doing scales w piano and voice opens up my vocabulary on both instruments and makes me much more comfortable to sing/play ideas when writing\n*doing these to a metronome has improved my timing on all instruments (not just piano and vocal)\n*learning a great song and singing it every morning has massively improved my lyrical writing/ improvisation (probably the hardest part of songwriting) by just reinforcing good *sounding* words.\n*singing and recording the same song every morning for a few days or a week makes me really THINK about vocals and vocal production. How I'm singing the words, how to push certain vowels in a certain part of my voice, etc \n\n@Slow Hand  @Ross Fortune @Will Melones @OJ",
    "reactions": 16,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "creative_process_workflow",
      "demos_song_production",
      "vocal_performance_delivery",
      "references_study_learning",
      "instrument_composition"
    ]
  },
  {
    "id": "977308745669439498",
    "author": "BatMeckley",
    "date": "2022-05-20",
    "content": "No joke, I find the oblique strategy deck of cards wildly helpful in times like that. \n\nAlso, unfortunately (and I hate hate HATE this) sometimes the only way to get a track from 95% to 100% is to take it back down to like 40% and start there.",
    "reactions": 15,
    "categories": [
      "demos_song_production"
    ]
  },
  {
    "id": "1076849791700574228",
    "author": "oaklandmatt",
    "date": "2023-02-19",
    "content": "Yes exactly! I've found that the best songs are never calculated, they're always just felt as they're being created. They are magical/ incalculable moments. As soon as people start analyzing – \"is this too generic?\" \"maybe we should have a part like **insert artist**\" – the songs loses its magic.\n\nBut the paradox is that you can't  just sit around and wait for them to happen. You have to be in motion. So often times building habits and processes (which are calculated) is a great way to keep oneself in the motion of creating things. Piano scales, learning songs, writing a song a day, etc., are just some of the many ways to do this.\n\nAnd the other aspect is also correct. These are skill building exercises that help the quick translation of creative ideas. It's the emotional and psychological side of workflow. Just like technical workflow – where you want the shortest time between idea an execution – same goes for writing. If you are constantly writing lyrics and singing melodies and playing instruments, when that emotional magical idea arrives, you can translate it more quickly into lyrics, melody, and music.",
    "reactions": 15,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "creative_process_workflow",
      "vocal_performance_delivery",
      "references_study_learning",
      "instrument_composition"
    ]
  },
  {
    "id": "990465284051709992",
    "author": "oaklandmatt",
    "date": "2022-06-25",
    "content": "have her learn classic songs and write a song a day for the next month or two. repetition in the process with a great musical diet. it is rarely more complicated than these two things",
    "reactions": 14,
    "categories": [
      "lyrics_lyric_writing",
      "creative_process_workflow",
      "references_study_learning"
    ]
  },
  {
    "id": "1009815950876491887",
    "author": "NoahNeedleman",
    "date": "2022-08-18",
    "content": "Oh buddy do I get that. \n\nIt was a big realization for me that I’m an Enneagram 2, “The Helper.” I often find real purpose in helping others finish songs, but when I’m only creating for myself I don’t have that natural “why” like I do when I’m looking at someone else. \n\nI’ve embraced that for myself though. Even though I theoretically could be writing producing mixing shit for myself, I realize it’s just not that interesting for me, and way more fraught with things that don’t bring me joy. So I make sure that any “artist” type thing I do, any time I’m doing something for myself, I have someone else to work with and for and support. For me, “alone” just isn’t that fun. \n\nThat’s why I’m so active on the discord, not cause I like to share as much as I really orient myself in community. I don’t need or even love the sound of my own voice, but it makes more sense to me when I’m the context of others. \n\nI used to think that was a weakness, (thanks Ayn Rand,) but now I employ it thoughtfully and it’s a bit of a superpower. \n\nNot saying you should think of yourself this way, but the artists I know who are successful on a large scale are obsessed with themselves in a way I was never comfortable with. And thank God for artists like that, cause I find my purpose there. It takes all kinds!",
    "reactions": 14,
    "categories": [
      "chord_progressions_harmony",
      "vocal_performance_delivery"
    ]
  },
  {
    "id": "1140310058048163930",
    "author": "Zack Hames",
    "date": "2023-08-13",
    "content": "So shit really was bananas, wow",
    "reactions": 14,
    "categories": []
  },
  {
    "id": "1200603495351464108",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "I always tailor it to the artist in some way. It's a combination of making fresh ideas specifically for them and taking existing ideas that could work (sometimes reworking existing ideas). I never go into a session like an actual blind date where I don't know anything about them.\n\nThe challenge is always do I make something that sounds like what they've done, or do I make something that sounds like where they're going? That's impossible to answer. I've had success in major label POP artist sessions by having a 100 year old piano and specifically not playing tracks. Meaning, you never know if an artist is tired of doing the same shit. Because I have confidence in my skill as a producer, I'm happy to get an A+ ballad because I know I can turn it into whatever production I want. \"In The Name Of Love\" is my most successful example of this. It's an emotional 3 chord piano ballad that was produced into a festival EDM anthem. \n\nI've had the most success being prepared for all options. Mostly because that makes me flexible for what an artist is feeling that day, but also because the more stuff I make, the more music I'm making. If I prep for a session, I'm not working cold. The prep is also like a psychological and creative warm up for me. Prep makes me a better improviser.",
    "reactions": 14,
    "categories": [
      "lyrics_lyric_writing",
      "chord_progressions_harmony",
      "cowriting_collaboration",
      "demos_song_production",
      "genre_style",
      "instrument_composition"
    ]
  },
  {
    "id": "1288194554918338591",
    "author": "EliHeathMusic",
    "date": "2024-09-24",
    "content": "Watched this video last night of Billie and Finneas talking about writing \"Birds of a Feather.\" The main thing that stood out to me was hearing them discuss how long it took and how much they disliked the song at first. It sounds like they were writing and rewriting it for almost a year and it almost didn't make the album. They also emphasized the amount of time it took to record; Billie mentioned that it took a bunch of days just to figure out the delivery of the first line and at one point Finneas was like \"oh yeah, that 10 second vocal stack tucked way in the background took us 7 hours.\" I feel like we all hear stories of great songs being written and recorded really quickly and at least for myself I sometimes find it frustrating and discouraging when things aren't coming together like that. I think this is partly because I'm comparing myself to a made up notion that all of the best artists/writers/producers are able to consistently finish a great song in a single session. But I guess this video is reminding me that sometimes the quality that makes these people great is their perseverance and willingness to face discomfort and frustration and keep going long enough to finish an idea.  https://www.youtube.com/watch?v=1bkjEO_Zj2g&ab_channel=BillieEilish",
    "reactions": 14,
    "categories": [
      "demos_song_production",
      "vocal_performance_delivery"
    ]
  },
  {
    "id": "975885922614771782",
    "author": "oaklandmatt",
    "date": "2022-05-16",
    "content": "the answer largely depends on how A&R driven the project is. sometimes the A&R is really running the show (like with a young pop boy band or something) and sometimes the A&R doesn't really matter and the artist is the whole identity. \n\na VERY loose way i often think about it is like this: if you're going to lean toward the A&R, do it on the production, not the songwriting. every great song i've been a part of writing (and i mean literally 100% of them) have been about capturing an emotional moment or excitement that is happening in the room with the people in the room. if you start thinking about \"what does the A&R want the lyrics to be like?\" you're gonna lose that.",
    "reactions": 13,
    "categories": [
      "lyrics_lyric_writing",
      "demos_song_production",
      "genre_style"
    ]
  },
  {
    "id": "990776963394326528",
    "author": "Slow Hand",
    "date": "2022-06-26",
    "content": "Depending on the kind of wall that you’re hitting with her, there are a few simple approaches that you can suggest that will get her thinking about the different dimensions of melody and how to play with it:\n\nA) Expansion - How long is the melody? It is a small fragment, or a full sentence? Stretch it out over a longer period of time. Sing it half as fast. Hold certain notes for emphasis.\n\nB) Diminution - Compress parts of the melody into faster runs. Make it shorter. Remove notes. Simplify the melody to its melodic essence.\n\nC) Repetition - Take a fragment of the melody and play it again. And again. And again.\n\nD) Modulation - Take a melodic idea and transpose it to different keys. The first movement of Beethoven’s 5th Symphony is built entirely off of a simple four-note motif. He got a lot of mileage from such a small element.\n\nE) Dynamics - Play with volume or intensity. Encourage her to go from soft to loud, or loud to soft. Accent certain notes for emphasis. This one is really powerful. For inspiration suggest that she try voicing her dynamics like a great horn player might. Get her to clip her notes very short or to make them “bloom” or be soft and round. Make them bark or be breathy.\n\nF) Be Another Instrument - Encourage her to try writing as another instrument with her voice. Sing a bass line. Sing a horn part. Sing percussively like Michael Jackson or James Brown would.\n\nG) Role Playing - Give her a character and a persona to inhabit. Make her sing the same thing as different personalities or people. Pick a melody and then make her sing it in the style of three singers that she’d know.",
    "reactions": 13,
    "categories": [
      "melody_hooks",
      "chord_progressions_harmony",
      "creative_process_workflow",
      "vocal_performance_delivery",
      "instrument_composition"
    ]
  },
  {
    "id": "1200555574601986131",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "There are many stories of people marinating on a song a lyrics evolving over time, but that's mostly an artist who writes by themselves (Leonard Cohen, Tom Petty, Frank Ocean). I have rarely had that experience co-writing",
    "reactions": 13,
    "categories": [
      "lyrics_lyric_writing",
      "cowriting_collaboration"
    ]
  },
  {
    "id": "1033174367988875386",
    "author": "BatMeckley",
    "date": "2022-10-21",
    "content": "As a fundamental rule, I do my best to not bring up an issue with something unless I feel pretty strongly I’ve got the solution. At the very least, I make sure i can really specifically say WHY I’m not into an idea. Nothing I hate more than “that sucks, it just does”.",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1153469045631361034",
    "author": "oaklandmatt",
    "date": "2023-09-18",
    "content": "Because when you make lots and lots more music, you're doing the thing that will maximally help you get really good at it and give maximal shots at people hearing your music.",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1177707325725884447",
    "author": "Rob Domos",
    "date": "2023-11-24",
    "content": "Just had thanksgiving dinner at Alan Burgman’s house and we talked a good amount about songwriting. If you’re not familiar with his work, he’s 98 years old and has written lyrics for everyone from Frank Sinatra to Aretha Franklin to Quincey Jones to half of the artists your grandma listened to. \n\nAnyways, some good takeaways from last night’s convo:\n\n“Writers these days are more interested in immediate appeal than they are in a great song. They aren’t the same thing. A great song is only a great song if people will want to cover it in 30 years” \n\nHe cares immensely that whatever is being said in a song is worth saying. Does the message have strong intrinsic value?  \n\nHe’s verrrry quick to say he doesn’t like a song.\n\nHe has a strong preference for melody being written before the lyrics, which is particularly interesting consider his career is as a lyric guy. \n\nHe has a strong dislike for slant rhymes. (I disagreed and it turned into a whole family convo about phonetic tension and release)\n\nHe’s still writing every single day without fail. Today he’s writing on an upcoming Pat Metheny record. \n\nHe’s never heard of Drake or Olivia Rodrigo. Mind you his wife was the president of ASCAP for 15 years so this is particularly mind blowing. It shows me how siloed different worlds can be even when they are so similar and near to one another. What wisdom does one silo have on lock that the other is missing? What rules have been taught to us by people in one silo that don’t apply in the silos we ourselves are working in? A lot to chew on here.",
    "reactions": 12,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "references_study_learning",
      "publishing_business"
    ]
  },
  {
    "id": "874709894878605342",
    "author": "Josh",
    "date": "2021-08-10",
    "content": "Just make sure the people you’re investing your time in are not only great at what they do, but they care about you just as much as you care about them. I made the decision this time last year that when I came back to PA that I’d get a day job so I don’t have to worry about writing and producing for artists who don’t care, and I could afford to do shit like fly to Atlanta or LA to write with artists who aren’t even making waves YET and it’s already paying off. September is going to be my last month working. I’m getting too busy and it’s time to start doing what I’ve been working towards every night I’d come home from the dealership for the past year.",
    "reactions": 11,
    "categories": []
  },
  {
    "id": "1204960712242241636",
    "author": "oaklandmatt",
    "date": "2024-02-07",
    "content": "Anytime I'm intellectualizing when I'm writing, the song gets worse. if you're editing or producing or prepping, it's definitely good to intellectualize some of the time. If you're going to write for pitch, I would suggest thinking about it in your prep and in your production/finishing, and completely ignoring it when you're creating",
    "reactions": 11,
    "categories": [
      "demos_song_production"
    ]
  },
  {
    "id": "1328101073243607061",
    "author": "Slow Hand",
    "date": "2025-01-12",
    "content": "Apropos of nothing, this is still one of the best $20 I’ve ever spent. \n\nJust lyrics and chords. I can crack it open at any time and start playing the songs that I know deep in my bones.\n\nSo much condensed songwriting goodness. I wish that this existed for more artists.",
    "reactions": 11,
    "categories": [
      "lyrics_lyric_writing",
      "chord_progressions_harmony",
      "instrument_composition"
    ]
  },
  {
    "id": "1464116556760875040",
    "author": "oaklandmatt",
    "date": "2026-01-22",
    "content": "This is way less trite and colloquial than it seems:\n\nDo whatever the fuck you want. Whatever your instincts say. Whatever is good to you.",
    "reactions": 11,
    "categories": []
  },
  {
    "id": "829370154273079346",
    "author": "Josh",
    "date": "2021-04-07",
    "content": "AYE WERE DOING THE SAME THING. Finally got a decent income stream in metal and said fuck thaaaattt and moved to pop. I’ve just been writing with friends, using those tracks to get with smaller artists, and pushing from there.\n\nAlso, to add to the cold call grind. There’s a really solid formula I’ve learned in marketing to get higher open rates, and my brother who’s launching a clothing brand just found out a really silly formula to get that even better. He’s getting clothes sent out to major label artists right now for free (aside from the cost of shipping and production) because he’s speaking the right language and sending clothes that people actually want. Same thing can be applied to songs. Might make a little outline and post it in here for everyone because it’s not only super important for the entry level grind, but it helps in day to day communication as well!!",
    "reactions": 10,
    "categories": [
      "lyrics_lyric_writing",
      "chord_progressions_harmony",
      "demos_song_production",
      "vocal_performance_delivery",
      "references_study_learning"
    ]
  },
  {
    "id": "905901008998244362",
    "author": "delwin",
    "date": "2021-11-04",
    "content": "do y'all write on 📱 or 📔  ?",
    "reactions": 10,
    "categories": []
  },
  {
    "id": "1035057327809773609",
    "author": "Slow Hand",
    "date": "2022-10-26",
    "content": "Does anyone else love the bridge section of songs as much as I do? I feel as if bridges don't get enough love. \n\nWhether listening or writing, I think a good bridge can be extremely satisfying because you tend to get a really interesting emotional counterpoint to the rest of the song, and I love the tension that can come out of that contrast.\n\nMaybe I just love tension in general.",
    "reactions": 10,
    "categories": [
      "lyrics_lyric_writing",
      "song_structure_form"
    ]
  },
  {
    "id": "1153748669867245578",
    "author": "LAPhill",
    "date": "2023-09-19",
    "content": "This extends well beyond just music. Art doesn't exist in a vacuum! You need to get out, talk to people, look at paintings, touch grass, all the things. The music will come from all sources, not just listening.",
    "reactions": 10,
    "categories": []
  },
  {
    "id": "1304328106072473620",
    "author": "oaklandmatt",
    "date": "2024-11-07",
    "content": "You won't run out of story. And yes to all the ways you mentioned. Try them all. Combine them. Switch back and forth. Anything to get you to just keep writing.\n\nThe other thing to keep in mind is that you try your best not to worry if something is good or meaningful or important WHILE you're making it. Just make things because it feels interesting or fun, then decide at another time which ones you like the most.",
    "reactions": 10,
    "categories": []
  },
  {
    "id": "1472297813420544222",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Given that this is #✍songwriting-talk , I would strongly advise people who want to learn how to be great songwriters to avoid any production at all when doing the practice we're talking about.\n\nIt's so much easier (and time consuming) to play with snare drum sounds and production transitions than to stay focused on lyrics and melody. Almost everyone I know, and seemingly everyone that asks questions here, just needs to write lyrics and melody over and over and over.\n\nIf you want to get reps to become a producer, that's awesome. Go to #🎹production-talk and talk about those reps.\n\nTrying to also do production while doing the exercises that we're talking about will only slow you down.",
    "reactions": 10,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "creative_process_workflow",
      "demos_song_production",
      "references_study_learning",
      "instrument_composition"
    ]
  },
  {
    "id": "834662921963044875",
    "author": "oaklandmatt",
    "date": "2021-04-21",
    "content": "i would only write about real experiences. if you're feeling scared or vulnerable or nervous to show the world how personal the songs are, you're doing the right thing. it should be uncomfortable. the hard part of songwriting isn't the craft, the hard part is the risk",
    "reactions": 9,
    "categories": [
      "lyrics_lyric_writing"
    ]
  },
  {
    "id": "885206512883101696",
    "author": "oaklandmatt",
    "date": "2021-09-08",
    "content": "also thinking of having him on a live",
    "reactions": 9,
    "categories": []
  },
  {
    "id": "1032479007997952060",
    "author": "masteredbyjack",
    "date": "2022-10-19",
    "content": "This is such a deep and cool topic. I’m in mastering now, so while I do a lot of collaboration it’s not quite what you’re getting at here but I’ve got a decent amount of experience in the room/tracking/producing. \n\nTo me it is a matter of developing trust and belief with another person. My approach is to be brutally honest with people and let the chips fall where they may. When things are amazing, meh, or bad. As @BatMeckley said…you want the $10k mic. Don’t waste the time with anything in the middle.\n\nSo in short — I’d just tell them exactly what you wrote above. But I tend to be more on the extremes — I’d like to think that people come away from working with me with a deep-seated belief in themselves and their potential but also honest feedback about very specific things we can do better. I actively seek to challenge my collaborators (which I’m sure you do as well). I’ve found people really respond to this if it’s done with the clear intention to help both of us improve and with the curiosity of the potential in the art!\n\nIn short, I’m an extreme encourager but also a harsh critic (in a kind way). I never let someone give up on themselves if I can help it and show love for them by very specifically calling out how I recognize their potential but see areas for improvement!\n\nI feel that I’ve always been able to tell when people do things like “lead with a compliment” or whatever. So that’s my POV on this whole topic…I just like people to be straight with me. When I have dealt with artists who clearly need the validation you’re speaking about….I’ll specifically call it out with something like “stop looking for validation you have the talent to do this now start believing in yourself”…etc. Seems sort of harsh but it really can cut to the chase and open up a deeper level of trust and communication.\n\nSometimes people don’t like this…and that’s all good too. Always lead with kindness and things work out. Depth > quantity",
    "reactions": 9,
    "categories": [
      "lyrics_lyric_writing",
      "cowriting_collaboration",
      "publishing_business"
    ]
  },
  {
    "id": "1061286042872856649",
    "author": "NoahNeedleman",
    "date": "2023-01-07",
    "content": "This is gonna sound shitty, but If it doesn’t come naturally to you, my suggestion would be to decline the invitation. If you don’t see exactly what needs to be done and how…\nYou don’t have to be all things to all people ya know?",
    "reactions": 9,
    "categories": []
  },
  {
    "id": "1061290781794652180",
    "author": "NoahNeedleman",
    "date": "2023-01-07",
    "content": "I’ve never lost the respect of an artist by telling them “I’m not the guy for this.” Humility is knowing who you are, and who you are *not.* Being confident in what you do and don’t have to offer in a situation helps build relationships.",
    "reactions": 9,
    "categories": []
  },
  {
    "id": "1129835680722321408",
    "author": "Ross Fortune",
    "date": "2023-07-15",
    "content": "Came across this in a book on creativity. Such a cool idea, looking forward to trying it.",
    "reactions": 9,
    "categories": [
      "references_study_learning"
    ]
  },
  {
    "id": "1153456123576332388",
    "author": "oaklandmatt",
    "date": "2023-09-18",
    "content": "Yes, all the time. But my perspective is sort of tough love: nothing you or I do matters. Even if I make a culturally transcendent song, in 100 years we'll all likely be forgotten.\n\nOk, so then what? Well, you still have a subjective experience of the world. So what is meaning for you? \n\nDo you like making things? Do you enjoy the process? Do you feel fulfilled and connected to the experience of life by playing piano or singing or mixing or making weird keyboard sounds? \n\nI love all that shit so much. When I get stressed out and uninspired, I try to find the ways to get me back into making things. When I do, I always feel better. Piano scales or learning songs or playing guitar for my girlfriend or whatever it is that makes me feel joy.\n\nIt's very important for me to have significant parts of my life that are creative and not for any purpose.",
    "reactions": 9,
    "categories": [
      "creative_process_workflow",
      "vocal_performance_delivery",
      "references_study_learning",
      "instrument_composition"
    ]
  },
  {
    "id": "1221433011405328465",
    "author": "oaklandmatt",
    "date": "2024-03-24",
    "content": "Ok this is one of my favorite topics ever.\n\nHappy to go deeper, but the gist is this: I believe people connect to the underlying emotion, even if their analytical brain isn't reading or understand the lyrics. If the emotion is authentic, the song has a MUCH better chance of connecting. Without that emotion, it is almost impossible. \n\nThe more I write songs, the older I get, the more I work with the greatest songwriters, the more I think that writing an authentic emotion is everything. \n\nA favorite example (I have 100 more, just ask): \n\nParty In The USA. Silly pop song? Or deep truth about the power of music being able to transcend loneliness? Go into the lyric and you realize it's Jessie J writing about her first time coming to Los Angeles: \n\nStepped off the plane at LAX with a dream and a cardigan... am I gonna fit in... everybody looks so famous... I'm feeling homesick, too much pressure and I'm nervous... but then my favorite song comes on the radio... I know I'm gonna be ok... it's a party in the USA\"\n\nTbh I tear up every time I think about this song. Yeah people might not analyze the lyric, but the reason this song will play for the next 50 years (and not the 1mil other simple songs about having a party) is the deep, authentic, universal emotion underlying the record.",
    "reactions": 9,
    "categories": [
      "lyrics_lyric_writing",
      "references_study_learning",
      "genre_style",
      "instrument_composition"
    ]
  },
  {
    "id": "1223698173453799465",
    "author": "oaklandmatt",
    "date": "2024-03-30",
    "content": "If you write a full song every day, and record even a voicenote of it. In a year you'll just BE a songwriter.",
    "reactions": 9,
    "categories": [
      "vocal_performance_delivery"
    ]
  },
  {
    "id": "1261743620416081920",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "I'll give a point by point analysis, cuz why not?\n\nFirst off, I love Irving Berlin. One of the greatest ever. White Christmas, God Bless America, Always, Cheek to Cheek. A master of the craft. \n\nThat being said, adhering to portions of this list could lead a songwriter in 2024 exactly in the wrong direction. Keep in mind two things: one, great artists are rarely great explainers of what makes them great. And two, his career ended in the late 1950s. This means his golden era was pre-Motown, pre-Beates, pre-television, etc.\n\nOk, my thoughts:\n\n1. This doesn't apply any more. He's speaking in relation to a time when music was more complicated. Music is MUCH simpler now. For example, White Christmas has a much larger vocal range than every Selena Gomez song. Also, 99% of songs today are recorded by someone writing it. It's much more important for the singer/songwriter to sing the song in their vocal range than to worry about some future audience. People rarely write songs and then hire a demo singer any more.\n\n2. (and 7 and 8) The best advice on here. Simplify. \"Kill your children.\" Remove things you love in order to make the song more concise.\n\n3. No. The culture changed, there are a million counter examples since Motown/Beatles. Sure, you can write a song without gender (\"you\"), but saying songs SHOULD be genderless is just wrong.\n\n4. Don't write frivolous songs? I'm all about authenticity and connecting emotionally to a song, but this is strangely phrased and doesn't seem very instructive. \n\n5. Every time I've seen people try and follow this, they write bad songs. As the great David Foster said \"There are only 12 notes and 26 letters, and Beethoven and Shakespeare already did it better than you.\" You're unlikely to find original chords, melodies, or words. The only original thing is your own life experience. Don't be \"original,\" be honest.\n\n6. Kinda. I guess I mostly stick to this. But also, there are thousands of great counterexamples after 1960.\n\n7, 8, 9. All great",
    "reactions": 9,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "chord_progressions_harmony",
      "demos_song_production",
      "vocal_performance_delivery"
    ]
  },
  {
    "id": "1269171909262704731",
    "author": "eliotpeace",
    "date": "2024-08-02",
    "content": "I tend to go through… creative slumps, and recently, I’ve found that recording covers of songs can be an excellent icebreaker when looking to get back into the swing of creating at a consistent level",
    "reactions": 9,
    "categories": []
  },
  {
    "id": "834682721695432724",
    "author": "Slow Hand",
    "date": "2021-04-21",
    "content": "@Deleted User Oh lord, *this*. You've hit it on the nose. We can waste a lot of time in life trying to give people what we think they want from us when it doesn't line up with our own thoughts or desires. Being honest with ourselves and open with others in this way can help to remove a lot of internal struggles that cause us distress. Of course I'm simplifying a nuanced point and everyone's personal context will vary. Nonetheless I do want to give a little positive feedback because while I'm far from a people-pleaser I do, from time to time, have to catch myself shying away from expressing how I really feel on a subject. Again it's nuanced and seems very plain and simple to say so, but being honest in your emotions with yourself and others to the best of your current abilities is going to serve everyone better at the end of the day. Whether you're writing a song or when you're dealing with interpersonal issues.",
    "reactions": 8,
    "categories": [
      "lyrics_lyric_writing",
      "vocal_performance_delivery",
      "references_study_learning"
    ]
  },
  {
    "id": "846662569799450655",
    "author": "Slow Hand",
    "date": "2021-05-25",
    "content": "Now that everyone is incentivized to play *their* song the current iteration becomes the most-requested song of all time. DJ's revolt. Publishing companies and PRO's buckle under the logistical strain of addressing everyone's financial claim to authorship. 'Sicko Mode' derivatives can be heard echoing from every car, bodega, and grocery store intercom. TV has become unwatchable now that every comedy, drama, and reality show is saturated with these songs. The mob can't get enough of *their* song! Society breaks down. After a dark period and reconstruction civilization reforms as feuding warlord states where the only currency are promissory notes for royalties on the song that once brought humanity to the brink.",
    "reactions": 8,
    "categories": [
      "vocal_performance_delivery",
      "instrument_composition",
      "publishing_business"
    ]
  },
  {
    "id": "865641879492100096",
    "author": "oaklandmatt",
    "date": "2021-07-16",
    "content": "the words \"talent\" and \"genius\" are mostly used to justify laziness \n\nnearly all of the best writers of our time have just done it way more than you",
    "reactions": 8,
    "categories": [
      "lyrics_lyric_writing"
    ]
  },
  {
    "id": "972176771262844968",
    "author": "Slow Hand",
    "date": "2022-05-06",
    "content": "Speaking of taking a lion's share of the publishing: Son Lux's manager wrote a fun blog post years ago explaining the time that Fall Out Boy sampled a Son Lux song and Son Lux denied the sample clearance because they really, *really* didn't like the song.\n\nUnfortunately, it was also the planned lead-single for FOB's new record and so Universal kept offering them more and more money for the clearance, with Son Lux denying them continually, until they finally relented and agreed to it, with the vow that they would use the money to invest in new artists and \"Robin Hood this shit\".",
    "reactions": 8,
    "categories": [
      "publishing_business"
    ]
  },
  {
    "id": "1033187040805797989",
    "author": "BatMeckley",
    "date": "2022-10-21",
    "content": "I had this corporate thing just recently where they commissioned me to do two songs, with the explicit understanding that I would do a series of revisions for them but due to time constraints they just got the two songs. So. They hated them lol (they asked if I could give them one more modern and then played me a song I’d worked on a decade ago). Wanted me to write a third, to which we responded “if you want to pay us for a third we’ll squeeze it in but otherwise just revisions on these two”. Meeting ended with an understanding we’d reconvene next day. \n\nNext day, we got the head of the department in. Very well spoken, very complimentary. Said they actually really liked the second song, could we just change the first half entirely. “You know what, we’ve had a lot of success together sure”. Couple seconds later… “could you also maybe totally rewrite the second half”. \n\nWe politely told them to go fuck themselves.",
    "reactions": 8,
    "categories": []
  },
  {
    "id": "1033198903132172288",
    "author": "Slow Hand",
    "date": "2022-10-21",
    "content": "On that tip:\n\nI've definitely been on a few productions where we *Ship of Theseus*'d the entire record. Usually it starts out by dropping in a new verse, which then leads to an exciting new idea for the chorus, and before you know it the original song has been replaced completely.",
    "reactions": 8,
    "categories": [
      "song_structure_form",
      "demos_song_production"
    ]
  },
  {
    "id": "1076492915804741652",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "The world reinforces the idea that you should network and here's a million ways to expand your social media reach and all that.\n\nSome of that is worthwhile advice, but most of it is there because you don't get clicks and you can't make money by telling people \"just put in the time.\"\n\nIt's really that simple. It's difficult, because you're not gonna get positive feedback all the time and it takes a lot of time. But it's really simple.\n\nIf you wrote 1000 songs and then just put songs 1001-1010 out onto the internet, people will find you quickly because the songs will be great. I promise you.",
    "reactions": 8,
    "categories": []
  },
  {
    "id": "1153471222974263346",
    "author": "Nomograph Mastering",
    "date": "2023-09-18",
    "content": "I am motivated by the power of great art, and what I can do to connect artist to listener. My career will grow and then it will recede and then I will die. But right now today I am handling precious cargo, songs from beginners to billion streamers. And imma show up",
    "reactions": 8,
    "categories": []
  },
  {
    "id": "1217982444259508314",
    "author": "Slow Hand",
    "date": "2024-03-14",
    "content": "Hey! Sam and I were roommates in Boston and threw a bunch of shows that got us arrested. Good times.",
    "reactions": 8,
    "categories": []
  },
  {
    "id": "1226590681095602206",
    "author": "Zakhiggins",
    "date": "2024-04-07",
    "content": "Whenever I’m writing or producing a song, I imagine the social setting/environment where I’d want it to be played. So whenever I make a move, I think would this kill the vibe at the party? If no, keep it, if yes then don’t",
    "reactions": 8,
    "categories": []
  },
  {
    "id": "1294787958867628062",
    "author": "oaklandmatt",
    "date": "2024-10-12",
    "content": "Yup, most of western music was driven by horny Christians, from Mozart to Ray Charles",
    "reactions": 8,
    "categories": []
  },
  {
    "id": "1294789284183937095",
    "author": "oaklandmatt",
    "date": "2024-10-12",
    "content": "Holy shit really? My goodness he really was prolific",
    "reactions": 8,
    "categories": []
  },
  {
    "id": "1304992419074412576",
    "author": "Pio",
    "date": "2024-11-09",
    "content": "Something I find really fun and which often gets me out of a rut is picking an artist and imagining you’re in their shoes/writing for them and go. Limit yourself, set a timer, write a song - what words do they use? Listen to a few songs of theirs first and notice what stories they’re interested in telling. I find even if I don’t end up writing a song in their style at all by the end (usually the case) the exercise gets me thinking about the stories I have rolling around my head. Ideas I wouldn’t have thought of as being good for a song. Gets me out of writing the same song too many times, and always makes me realise we have way more songs in us than we thought. Make a weapon out of your empathy and have fun - you can step into anyone’s shoes and try thinking what song you might write if you were there. (The fun challenge is to STLL keep it genuine and authentic to you - kind of paradoxical but I believe heavily in amazing stuff being able to come this way)",
    "reactions": 8,
    "categories": [
      "lyrics_lyric_writing",
      "creative_process_workflow"
    ]
  },
  {
    "id": "1328022413983879199",
    "author": "Zakhiggins",
    "date": "2025-01-12",
    "content": "1. I do it first thing in the morning when I wake up before things like my phone ruin my brain for the day. \n\n2. Make it a routine. I make some time before i have to go anywhere every morning to try and create something. When your brain gets used to the idea that you're going to that place at the same time every day, once you go there then the ideas flow better with time.\n\n3. Understand it's ok to write something bad, with time good ones come. \n\n4. Understand that a song is never actually finished, it can only be abandoned wherever you chose to abandon it.\n\n4.5. Understand that it's ok to figure out what a song means after you write it.\n\n5. Understand that we're trying to make trees, not tables. (As in sometimes it's not healthy to keep refining something till it's too straight edge and the vitality is gone from it)\n\n6. Said it already but saying it again, don't check your phone before you write\n\n7. I don't always write lyrics. Sometimes i write a melody, sometimes a chord progression, sometimes lyrics. Every now and then i do a session of what i call Lego writing, where i try to see what lyrics i wrote before fit with what melody/chord progression etc. \n\n8. Oh and did i mention, it ruins my creativity to check my phone before i make anything? \n\nThis is what works for me, hope it helps you!",
    "reactions": 8,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "chord_progressions_harmony",
      "creative_process_workflow",
      "cowriting_collaboration"
    ]
  },
  {
    "id": "1444134118995656815",
    "author": "BatMeckley",
    "date": "2025-11-28",
    "content": "My entire private highschool was paid for by “cause there ain’t no one for to give you no pain”",
    "reactions": 8,
    "categories": []
  },
  {
    "id": "845670223012560946",
    "author": "Josh",
    "date": "2021-05-22",
    "content": "From my understanding I think Matt wanted to have it so him and the other more experienced guys can actually give more than “yeah it sounds good!”  That way you don’t have a flood of comments like “your snare sucks” when someone is looking for writing feedback, or have no feedback at all.",
    "reactions": 7,
    "categories": []
  },
  {
    "id": "874382654655574097",
    "author": "oaklandmatt",
    "date": "2021-08-09",
    "content": "yes. start doing it immediately. also start writing and completing songs 100% on your own. the goal for those songs, for now, should simply be to finish them, quickly, regardless of quality. every song is a rep. it will massively improve your skills as a producer and mixer. \n\nother than getting hired to produce existing songs (about 1/3 of the time) , the last paragraph you wrote is essentially description of what's i do for a living",
    "reactions": 7,
    "categories": [
      "demos_song_production"
    ]
  },
  {
    "id": "876097575223185409",
    "author": "rae",
    "date": "2021-08-14",
    "content": "Quote I saved a little while ago similar to this 😊",
    "reactions": 7,
    "categories": []
  },
  {
    "id": "881350955013132299",
    "author": "isaac joel",
    "date": "2021-08-28",
    "content": "re: writing songs acapella first...if I had to guess I'd swear that Aaron Cartier does that, his songs are so simple and hooky but very vocal driven. As an aside I don't understand how he's not like...the biggest artist in the world and dominating TikTok 🤷‍♂️ so damny good https://www.youtube.com/watch?v=F-iWQRHJwxs",
    "reactions": 7,
    "categories": [
      "melody_hooks",
      "vocal_performance_delivery"
    ]
  },
  {
    "id": "906129280021463080",
    "author": "Keyron",
    "date": "2021-11-05",
    "content": "i used to write everything on my phone as it’s faster but i got suggested to use the old pen n paper as you CAN SEE WHAT YOU ERASED and this has been game changing for me\n\nso this is my “writing setup” now:\n1. i take a stack of A5 sheets of paper (i just love how small they are)\n2. a sharpie without the cap \n3. my phone to record myself in case i lose ideas\n\ni’ve developed something i call “The Dry Sharpie Technique” with which you challenge yourself to not let the sharpie dry up (duh) and the only way to do that is to keep writing words… eventually you’ll find yourself with\n1. a stack of scribbles and cancelled verses\n2. an incredible song\n3. a “backup” of your process",
    "reactions": 7,
    "categories": [
      "lyrics_lyric_writing",
      "song_structure_form",
      "creative_process_workflow"
    ]
  },
  {
    "id": "983960359440384020",
    "author": "Slow Hand",
    "date": "2022-06-07",
    "content": "In this case spaced repetition is your friend. Choose an interval of time that you want to spend practicing a song (10 min, 15 min, 20 min) and practice Song #1 for that amount of time. Then - even if you're not proficient or haven't yet committed the song to memory - move on to practicing Song #2 and let the first song process and consolidate in your memory while you work on Song #2. \n\nWash, rinse, repeat until you go through the entire rotation of songs.  If some songs are significantly more difficult to learn or memorize then come back to them more often. The point is to constantly be checking back in on the songs that you're trying to learn just as you're on the threshold of forgetting them.",
    "reactions": 7,
    "categories": [
      "chord_progressions_harmony",
      "creative_process_workflow",
      "references_study_learning"
    ]
  },
  {
    "id": "1009885679062364191",
    "author": "Will Melones",
    "date": "2022-08-18",
    "content": "I’m sure we all share this struggle to some degree. I’ve got some projects that I’ve put many hours into, just to let them sit on a hard drive for years.\n\nCo-writing has helped a lot, and has taken some ideas to places I never would have thought to go. The feeling that you have some moral obligation to your collaborators to finish is motivating. When you’re making art for yourself, it doesn’t benefit from those positive forces of peer pressure, and there’s a lack of constraints and no sense of urgency. \n\nI think making creative decisions is metabolically expensive. It’s easier to defer all decisions, which is why you see DAW-age producers committing to so little until the mix. In the same way you can defer the entire songwriting process, especially if you have someone else’s project or deadline to prioritize over your own.\n\nTo be both the creative mind and the executive finisher is a lot of exhausting context switching. Some options might be to split these responsibilities with someone else, or to dedicate separate time to each task. If someone hires me to print stems or solder a patchbay, the last thing I want to do is engage in creativity. But when I get inspired to write, I don’t want to stop and troubleshoot the plug-in that’s crashing the session.\n\nMaybe like the divergence/convergence approach would be to set aside an hour or three at the end of your day to finish ideas you’ve already got brewing—set a timer and finish a song, or a verse. Or, even better yet, dedicate the *end* of your day to play and experimentation. Then the next morning, hopefully with fresh perspective, get in the mood to tie up loose ends and prepare your next steps. You’ve demonstrated that you’re good at wearing that hat for other artists, so you can do it for your songs, too. Just maybe not while you’re in the creative flow.\n\nI’m not practicing what I preach, just brain-dumping. I definitely don’t have this figured out.",
    "reactions": 7,
    "categories": [
      "song_structure_form",
      "creative_process_workflow",
      "cowriting_collaboration",
      "demos_song_production",
      "instrument_composition",
      "publishing_business"
    ]
  },
  {
    "id": "1058037149146038312",
    "author": "NoahNeedleman",
    "date": "2022-12-29",
    "content": "I used to do a thing like that with a bunch of buddies in LA every September. \n\nIt started cause I wanted to practice using key changes or modal shifts as a songwriting technique, and so I had rules for myself:\n\n1) first idea that fits, wins. No agonizing over lyrics or Melodies or whatever, if it rhymes and makes some kind of sense, move on with it. \n2) first year: ever song needed a key change or modal shift. Second year: shifting or alt time signatures. Third year: some other esoteric tool I wanted to learn etc…\n3) the moment you’re done, record a voice memo and send it to someone. Mistakes and all. \n\nThe key for these rules was the make the quality of the songs less important than the act of writing. But damn if I didn’t get two or three real winners every year.",
    "reactions": 7,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "chord_progressions_harmony",
      "creative_process_workflow",
      "vocal_performance_delivery",
      "references_study_learning"
    ]
  },
  {
    "id": "1058082483704443010",
    "author": "BatMeckley",
    "date": "2022-12-29",
    "content": "Absolutely this. Some of my favorite songwriters did this, it’s a muscle like any other. Katy Perry used to write a song a day. Jon Foreman of Switchfoot would write 3. You rarely get worse at something by doing it more often.",
    "reactions": 7,
    "categories": [
      "lyrics_lyric_writing"
    ]
  },
  {
    "id": "1075791534328393790",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "The other overall point to make is that I find nearly all the great songwriters I know are just comfortable in a session. \"Good vibes\" in a sense, but also just comfortable generating ideas. They don't really get stuck anywhere. If something isn't working (even if they suggested it), they're comfortable moving forward. Just forward momentum, very little negative energy.\n\nAnd so much of that is *simply doing it a lot*. It's great to talk about tips and tricks (and yes, morning routines), but mostly it's just putting in time where you're enjoying doing it. \n\nThat's why I think learning songs is so important. It's actually not really about intellectualizing or analyzing what great songs are doing. It's much more just practicing being in the feeling of singing and playing great music. It's the same feeling you're after when you write. By learning great songs and singing them, you get comfortable in that feeling and you're better able to connect to it when writing.",
    "reactions": 7,
    "categories": [
      "creative_process_workflow",
      "vocal_performance_delivery",
      "references_study_learning",
      "instrument_composition"
    ]
  },
  {
    "id": "1076571860617134141",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "This and one or two more parts\nWith chords and melody\nDo it daily for a year\nA great songwriter you'll be",
    "reactions": 7,
    "categories": [
      "melody_hooks",
      "chord_progressions_harmony",
      "creative_process_workflow"
    ]
  },
  {
    "id": "1140174853429801000",
    "author": "Rob Domos",
    "date": "2023-08-12",
    "content": "I remember someone onetime saying that Gwen Stafani would never put a line in her song if it wasn’t exactly true. Someone would have a line they thought was banger and she’d reject it on the basis that it’s cap. I’ve been employing this rule the last few months and I think the results have turned out far more emotionally resonant. The songs with untrue statements feel like cardboard cutouts of people where the songs where only true statements are made feel like humans with flesh on their bones",
    "reactions": 7,
    "categories": [
      "lyrics_lyric_writing"
    ]
  },
  {
    "id": "1180975899395498035",
    "author": "austenballard",
    "date": "2023-12-03",
    "content": "I Was Going To Title This Song One Thing But Then You Broke My Heart So Now It's About You, Hope You're Happy (Breaking Up In The Michaels Parking Lot)",
    "reactions": 7,
    "categories": []
  },
  {
    "id": "1464322819470131359",
    "author": "Josh",
    "date": "2026-01-23",
    "content": "Could always just have a giant guitar solo",
    "reactions": 7,
    "categories": [
      "instrument_composition"
    ]
  },
  {
    "id": "1472308753662611680",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Outside of just getting daily reps, the main goal of this particular practice (the 30 minute write) is that you're setting parameters where you don't have time to decide if something is good. The point is to relieve yourself of any editing and force yourself to quickly write lyrics and melodies. \n\nIt's doing two separate and important things: building muscle memory and teaching to work on instinct.\n\nBuilding songwriting muscle memory is just like learning a language. You're practicing over and over until you learn how to express yourself emotionally. This is the basics component. You'll learn what notes you can hit and what words rhyme and how rhythms bounce. You'll build a foundation that will become second nature.\n\nRelated but distinct, you will learn how to move quickly. It turns out most great songs come in an unthinking way. Until you learn how to write without editing and thinking about what you're doing, you are less likely to write those great songs.\n\nI'm speaking from a lot of personal experience, but also whether it's Hemmingway's \"write drunk edit sober,\" or the Rick Rubin, Pharrell, etc. belief that great songs come from some power outside of ourselves (\"Source\" or God or whatever), learning to create without being analytical is super super important.",
    "reactions": 7,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "creative_process_workflow",
      "references_study_learning"
    ]
  },
  {
    "id": "836022881028145192",
    "author": "joebegalla",
    "date": "2021-04-25",
    "content": "All of the Oliver splice packs have the best drum sounds for pop/electronic. They barely need any mixing. For hip hop/r&b I love Jimmy Edgar or Sophie’s splice packs. If you won’t more of a Frank Ocean style R&B drum sound, there’s a splice pack called “alternative r&b” that has killer stuff. Basically, splice is the best hahahah",
    "reactions": 6,
    "categories": [
      "genre_style"
    ]
  },
  {
    "id": "858205648285073439",
    "author": "oaklandmatt",
    "date": "2021-06-25",
    "content": "@David Fuller with rare exception, a hit song can be sung and clapped along to. Occasional instrumental hooks (though most of them can be sung) are the only exception I can think of. \n\nThis is where the \"a great song can be sung and played on piano\" gets it wrong. Singing/ clapping is the fundamental. Rap songs to ballads to dance songs.",
    "reactions": 6,
    "categories": [
      "melody_hooks",
      "demos_song_production",
      "vocal_performance_delivery",
      "instrument_composition"
    ]
  },
  {
    "id": "874708941274222662",
    "author": "Josh",
    "date": "2021-08-10",
    "content": "Also I’m at this stage rn so I should probably chime in. I just paid for a trip to go write with people I decided I liked from one conversation and some texts over the Internet. Today I got hit up to add production stuff to a song I didn’t even write on. Another artist I’m writing with is introducing me to everyone he knows and is coming through so we have songs to push at meetings simply because he wants me to get with a great team so I can afford to fly out and work with him whenever.",
    "reactions": 6,
    "categories": [
      "demos_song_production"
    ]
  },
  {
    "id": "876356259287293972",
    "author": "longstoryshort",
    "date": "2021-08-14",
    "content": "watched that ed doc tonight, awesome watch",
    "reactions": 6,
    "categories": []
  },
  {
    "id": "977319425336287282",
    "author": "NoahNeedleman",
    "date": "2022-05-20",
    "content": "Ok legit first I’m hearing of Oblique Strategies.",
    "reactions": 6,
    "categories": []
  },
  {
    "id": "1059361024848965723",
    "author": "rae",
    "date": "2023-01-01",
    "content": "@Slow Hand what time zone is the deadline in? Aussie here so I think I’m a day ahead 😂",
    "reactions": 6,
    "categories": []
  },
  {
    "id": "1069408608732860527",
    "author": "austenballard",
    "date": "2023-01-29",
    "content": "So it seems like the format of #song-a-week with everyone doing a song every week is kind of difficult, not least because we all have a lot of other things going on, or get sick as I have, or what have you.\n\nI was wondering if we might switch it up to make participating easier and more practical. I've been binge-listening to Conversations and in one episode, someone suggested something that might be fun.\n\nIt's a game of telephone/Chinese whispers (is that name for it cancelled?) but with songs - so the first person in the chain writes a song, then the second person listens and rewrites it in their own style, and so on and so on. The key point being that if it's your turn to write, you only get to listen to the song before you ONCE before you write yours.\n\nI really like this idea, I think it'd be cool to see what ideas we get from each other, what stands out the most from each person's interpretation, and so on and so on.\n\nThoughts?",
    "reactions": 6,
    "categories": [
      "chord_progressions_harmony"
    ]
  },
  {
    "id": "1070191773449715743",
    "author": "Slow Hand",
    "date": "2023-01-31",
    "content": "At the end of the day if I had to sum it all up, just go wild and pick the parts that feel best because...",
    "reactions": 6,
    "categories": []
  },
  {
    "id": "1153443126992711810",
    "author": "oaklandmatt",
    "date": "2023-09-18",
    "content": "I haven't met anyone who is trying to be a successful record maker where my thought is \"they're writing too many songs\"",
    "reactions": 6,
    "categories": []
  },
  {
    "id": "1153457477560565790",
    "author": "Rollmottle",
    "date": "2023-09-18",
    "content": "> It's very important for me to have significant parts of my life that are creative and not for any purpose. \ni abide by this ethos full stop. it took a while to get there, but it's very freeing and i think is one of the keys to longevity in the creative life.",
    "reactions": 6,
    "categories": []
  },
  {
    "id": "1155628456181252139",
    "author": "Slow Hand",
    "date": "2023-09-24",
    "content": "I assume you mean for GPT4 to help with lyric writing? \n\nIf so, I think you may be asking too much of GPT. It's not really capable of new or novel ideas. The answers are trite because it's built on repackaging past inputs (most of which are unremarkable), and creating novel ideas (that are also coherent) is hard.\n\nWhat if instead of asking it for lyrics you asked it for situational prompts that you then dramatize and write about? Ask it to role play a point of view:\n\n\"Pretend that you are two quarreling lovers\"\n\"Pretend you are a human and you are currently on fire.\"\n\"Pretend that you are a statue watching people pass by. What would you see?\"\n\"Generate a list of nonsense words that sound plausible.\"\n\"Summarize the plot of the movie *Airplane* like you are visiting Earth for the first time.\"\n\"Summarize *King Lear* in the dumbest way possible.\"",
    "reactions": 6,
    "categories": [
      "lyrics_lyric_writing",
      "instrument_composition"
    ]
  },
  {
    "id": "1204962498525274143",
    "author": "oaklandmatt",
    "date": "2024-02-07",
    "content": "As is always the answer: it works every way you could imagine. Back to what I said a few days ago, you gotta learn a lot of skills and get a lot of reps using them. \n\nThen you learn the meta skill of making strong decisions based on your taste. Sometimes that's \"hit this note instead of that note,\" and sometimes it's \"let's stop trying to write to this track and go outside with acoustic guitars.\"",
    "reactions": 6,
    "categories": [
      "demos_song_production",
      "vocal_performance_delivery",
      "references_study_learning",
      "instrument_composition"
    ]
  },
  {
    "id": "1212964832135876668",
    "author": "miario_atl",
    "date": "2024-02-29",
    "content": "I've learned to detach from the music I write. The masterpieces I may believe to be writing are a gift to the world so if that song is maximized by someone else's voice instead of mine, then they should have it. If the song blows up, it's still my contribution to the world. My voice isn't the right fit for everything I write so a great song can become simply a good song if the wrong voice is on it.",
    "reactions": 6,
    "categories": [
      "vocal_performance_delivery",
      "references_study_learning"
    ]
  },
  {
    "id": "1236569086046109716",
    "author": "Rob Domos",
    "date": "2024-05-04",
    "content": "Wow this mkgee is absolutely phenomenal. Breathes new life into me and my love of music",
    "reactions": 6,
    "categories": [
      "vocal_performance_delivery"
    ]
  },
  {
    "id": "1238675495009255494",
    "author": "Slow Hand",
    "date": "2024-05-10",
    "content": "I'm about to chop the whole damn thing off and serve it up like that.",
    "reactions": 6,
    "categories": []
  },
  {
    "id": "1378333490524848209",
    "author": "Brian Reynolds",
    "date": "2025-05-31",
    "content": "That feeling when, the song you wrote yesterday. Feels better than you remember!!",
    "reactions": 6,
    "categories": []
  },
  {
    "id": "1385595768664096778",
    "author": "Ross Fortune",
    "date": "2025-06-20",
    "content": "I’ve been pushing myself to write more 100 percenters, and lyrics are a challenge for me. \n\nMy studio neighbour sings in a band but writes alone. His tack is to bounce his instrumental along with whatever gibberish vocal guides he’s laid down, then take a walk and have it on loop on headphones. Whenever he gets to a point where his mind is wandering he’s forgotten he’s supposed to be writing, that’s when the lyrics usually come.\n\nHaven’t had a chance to try it yet but it sounds like a good approach",
    "reactions": 6,
    "categories": [
      "lyrics_lyric_writing",
      "demos_song_production",
      "vocal_performance_delivery",
      "instrument_composition"
    ]
  },
  {
    "id": "1385770568506146816",
    "author": "Slow Hand",
    "date": "2025-06-20",
    "content": "I've always been inspired by the working relationship between Elton John and Bernie Taupin. \n\nBernie (who strictly writes lyrics) would mail completed lyrics to Elton, who would sit at the piano and write to them. I can see several advantages  here:\n\nA) You have a complete subject, theme, and narrative arc.\n\nB) The dramatic arc of the lyric informs the shape of the music, which can give the lyric additional support and also shake the writer out of their usual approach.\n\nC) The lyric can be stretched or compressed until it finds it's proper cadence and allow the singer (Elton) to find the best melodic fit to support the lyrics.",
    "reactions": 6,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "vocal_performance_delivery",
      "instrument_composition"
    ]
  },
  {
    "id": "1405958356094554124",
    "author": "oaklandmatt",
    "date": "2025-08-15",
    "content": "Roll with it. If each song works best with their voice and thematically, why complicate it?\n\nWe're also in an era where because everyone has access to EVERYTHING on the internet, there's this desire to be more broad. But the things that last are often deeper, not broader. If G is the key, stick with it and go deeper",
    "reactions": 6,
    "categories": [
      "vocal_performance_delivery"
    ]
  },
  {
    "id": "1463942883466805425",
    "author": "Nomograph Mastering",
    "date": "2026-01-22",
    "content": "Repeat verse but with one word changed, love that effect of the full repeat but with a twist",
    "reactions": 6,
    "categories": [
      "lyrics_lyric_writing",
      "song_structure_form"
    ]
  },
  {
    "id": "831233459213172777",
    "author": "oaklandmatt",
    "date": "2021-04-12",
    "content": "i don't know anyone who can truly be writer and editor at the same time. certainly you know if you're enjoying it or not when you're creating. but the best writers i know work off excitement and emotion, then worry about if it's great another day. sometimes you listen the next day and decide it's terrible. but if you try to decide how great it is when you're doing it, you'll usually lose the emotional spark that allows the creativity.",
    "reactions": 5,
    "categories": [
      "lyrics_lyric_writing"
    ]
  },
  {
    "id": "831646389876031539",
    "author": "oaklandmatt",
    "date": "2021-04-13",
    "content": "I liken it to a boxer. A boxer spends years perfecting his mechanics and motion and technique, thinking and analyzing and training. But when he's in the ring, he just reacts creatively. Mixing, production, songwriting are all the same￼",
    "reactions": 5,
    "categories": [
      "demos_song_production"
    ]
  },
  {
    "id": "846657552355033128",
    "author": "Slow Hand",
    "date": "2021-05-25",
    "content": "Sure is. Just wait until someone interpolates 'Sicko Mode' and all 33 of those credited become attached along with whichever team wrote the new song. Theeeeen we'll *really* be cooking. Party in the album credits!",
    "reactions": 5,
    "categories": []
  },
  {
    "id": "865607225590284298",
    "author": "Josh",
    "date": "2021-07-16",
    "content": "E. Dan was talking about how Mac would show up with 200 songs for every record they did together. I forget the guys name, but the executive producer for swimming and circles also said the same thing. Some of the best writers of our time aren’t inherently talented, or have this magical gift, they just do way more than us.",
    "reactions": 5,
    "categories": [
      "demos_song_production"
    ]
  },
  {
    "id": "879505315123589150",
    "author": "Josh",
    "date": "2021-08-23",
    "content": "One has mastered the creation of fire. The other is about to discover it. 😎",
    "reactions": 5,
    "categories": []
  },
  {
    "id": "880155087626981396",
    "author": "oaklandmatt",
    "date": "2021-08-25",
    "content": "yes and do it all the time. And write more acapella. Thats the most underrated shit. Truthfully, a lot of the best songs I've been a part of have been started as a lyric/melody combo before any chords were played.",
    "reactions": 5,
    "categories": [
      "lyrics_lyric_writing",
      "melody_hooks",
      "chord_progressions_harmony"
    ]
  },
  {
    "id": "983961841573183508",
    "author": "samvalentine",
    "date": "2022-06-07",
    "content": "In addition to actually practicing and learning the parts I think it's helpful to really get to know the songs. Hopefully you have recordings to listen to. Pop those puppies in a playlist and listen when you're driving, cooking, exercising, etc.",
    "reactions": 5,
    "categories": [
      "references_study_learning",
      "genre_style"
    ]
  }
]