[
  {
    "id": "876057469837799454",
    "author": "oaklandmatt",
    "date": "2021-08-14",
    "content": "@everyone watch this. whether you're a songwriter or not, it's by far the best insight into the modern process of making records that ever seen.  yes there are plenty of masterclasses and song breakdowns and people going on IG live talking about not using compressors, but this gives a unique insight into how the process actually FEELS behind closed doors",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221123573503230003",
    "author": "oaklandmatt",
    "date": "2024-03-23",
    "content": "I have a different angle you could try. I would focus almost all your energy on becoming a better, more truthful, richer lyricist. That's the only place you'll be original because there's only one you. Paradoxically, it's also the way you'll write songs that have a universal appeal because the more personal you get, the more the underlying universal emotions will resonate with people.\n\nTrying to be analytical about melodies and structure and style when writing has never yielded good songs for me or literally anyone I know. All the best songwriters I've met write all their best songs lyrics first.\n\nAlso, when you have something to say, it's surprising how little you pay attention to the melody. The melodies and structural components seem to just come when your heart is already in the story.\n\nThe only other thing I'd say is learn A+ songs. Learn the lyrics completely and learn the story behind them as much as possible. Then learn to sing them the way the original version is sung. That will expand your vocabulary as a vocalist and reinforce great lyrics.\n\nLastly, technology is going to continue to increasingly replace stylistic innovation. Yeah AI blah blah blah, but already drum machines and synth presets and splice and DAWs. The last thing to be replaced will be you personally writing things from your experience. Songs about your deepest insecurities and songs about your pet gerbil both fall into this category. Explore all of it.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "900188589231587340",
    "author": "oaklandmatt",
    "date": "2021-10-19",
    "content": "write embarrassingly honest songs about your life. what's exciting you stressing you making you sad making you uncomfortable etc. \n\nps, all the A level songwriters i've worked with are super lyric forward. most people think it's finding a melody then writing lyrics to it, but 90% of the great writers i know are putting their feelings into words well before they're getting on the mic",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075789852584444075",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "Some songwriting-related morning routine thoughts:\n\nI've been starting my day with doing piano scales and vocal warm ups to a metronome and then singing/ learning a song and recording a voice note of it. (recently it's been Tom Petty Wildflowers at the piano). Then I look at my phone and start my day.\n\nHard to know for sure if it's causal, but my songwriting abilities have sped up. I'm quicker in sessions, both with topline and tracks. \n\nI think it's related to several aspects of the morning routine, and they all compound. \n\n*I'm playing music before I'm on my phone, so I'm outputting music before my brain starts reacting.\n\n*doing scales w piano and voice opens up my vocabulary on both instruments and makes me much more comfortable to sing/play ideas when writing\n*doing these to a metronome has improved my timing on all instruments (not just piano and vocal)\n*learning a great song and singing it every morning has massively improved my lyrical writing/ improvisation (probably the hardest part of songwriting) by just reinforcing good *sounding* words.\n*singing and recording the same song every morning for a few days or a week makes me really THINK about vocals and vocal production. How I'm singing the words, how to push certain vowels in a certain part of my voice, etc \n\n@Slow Hand  @Ross Fortune @Will Melones @OJ",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1076849791700574228",
    "author": "oaklandmatt",
    "date": "2023-02-19",
    "content": "Yes exactly! I've found that the best songs are never calculated, they're always just felt as they're being created. They are magical/ incalculable moments. As soon as people start analyzing – \"is this too generic?\" \"maybe we should have a part like **insert artist**\" – the songs loses its magic.\n\nBut the paradox is that you can't  just sit around and wait for them to happen. You have to be in motion. So often times building habits and processes (which are calculated) is a great way to keep oneself in the motion of creating things. Piano scales, learning songs, writing a song a day, etc., are just some of the many ways to do this.\n\nAnd the other aspect is also correct. These are skill building exercises that help the quick translation of creative ideas. It's the emotional and psychological side of workflow. Just like technical workflow – where you want the shortest time between idea an execution – same goes for writing. If you are constantly writing lyrics and singing melodies and playing instruments, when that emotional magical idea arrives, you can translate it more quickly into lyrics, melody, and music.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009815950876491887",
    "author": "NoahNeedleman",
    "date": "2022-08-18",
    "content": "Oh buddy do I get that. \n\nIt was a big realization for me that I’m an Enneagram 2, “The Helper.” I often find real purpose in helping others finish songs, but when I’m only creating for myself I don’t have that natural “why” like I do when I’m looking at someone else. \n\nI’ve embraced that for myself though. Even though I theoretically could be writing producing mixing shit for myself, I realize it’s just not that interesting for me, and way more fraught with things that don’t bring me joy. So I make sure that any “artist” type thing I do, any time I’m doing something for myself, I have someone else to work with and for and support. For me, “alone” just isn’t that fun. \n\nThat’s why I’m so active on the discord, not cause I like to share as much as I really orient myself in community. I don’t need or even love the sound of my own voice, but it makes more sense to me when I’m the context of others. \n\nI used to think that was a weakness, (thanks Ayn Rand,) but now I employ it thoughtfully and it’s a bit of a superpower. \n\nNot saying you should think of yourself this way, but the artists I know who are successful on a large scale are obsessed with themselves in a way I was never comfortable with. And thank God for artists like that, cause I find my purpose there. It takes all kinds!",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1288194554918338591",
    "author": "EliHeathMusic",
    "date": "2024-09-24",
    "content": "Watched this video last night of Billie and Finneas talking about writing \"Birds of a Feather.\" The main thing that stood out to me was hearing them discuss how long it took and how much they disliked the song at first. It sounds like they were writing and rewriting it for almost a year and it almost didn't make the album. They also emphasized the amount of time it took to record; Billie mentioned that it took a bunch of days just to figure out the delivery of the first line and at one point Finneas was like \"oh yeah, that 10 second vocal stack tucked way in the background took us 7 hours.\" I feel like we all hear stories of great songs being written and recorded really quickly and at least for myself I sometimes find it frustrating and discouraging when things aren't coming together like that. I think this is partly because I'm comparing myself to a made up notion that all of the best artists/writers/producers are able to consistently finish a great song in a single session. But I guess this video is reminding me that sometimes the quality that makes these people great is their perseverance and willingness to face discomfort and frustration and keep going long enough to finish an idea.  https://www.youtube.com/watch?v=1bkjEO_Zj2g&ab_channel=BillieEilish",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990776963394326528",
    "author": "Slow Hand",
    "date": "2022-06-26",
    "content": "Depending on the kind of wall that you’re hitting with her, there are a few simple approaches that you can suggest that will get her thinking about the different dimensions of melody and how to play with it:\n\nA) Expansion - How long is the melody? It is a small fragment, or a full sentence? Stretch it out over a longer period of time. Sing it half as fast. Hold certain notes for emphasis.\n\nB) Diminution - Compress parts of the melody into faster runs. Make it shorter. Remove notes. Simplify the melody to its melodic essence.\n\nC) Repetition - Take a fragment of the melody and play it again. And again. And again.\n\nD) Modulation - Take a melodic idea and transpose it to different keys. The first movement of Beethoven’s 5th Symphony is built entirely off of a simple four-note motif. He got a lot of mileage from such a small element.\n\nE) Dynamics - Play with volume or intensity. Encourage her to go from soft to loud, or loud to soft. Accent certain notes for emphasis. This one is really powerful. For inspiration suggest that she try voicing her dynamics like a great horn player might. Get her to clip her notes very short or to make them “bloom” or be soft and round. Make them bark or be breathy.\n\nF) Be Another Instrument - Encourage her to try writing as another instrument with her voice. Sing a bass line. Sing a horn part. Sing percussively like Michael Jackson or James Brown would.\n\nG) Role Playing - Give her a character and a persona to inhabit. Make her sing the same thing as different personalities or people. Pick a melody and then make her sing it in the style of three singers that she’d know.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "829370154273079346",
    "author": "Josh",
    "date": "2021-04-07",
    "content": "AYE WERE DOING THE SAME THING. Finally got a decent income stream in metal and said fuck thaaaattt and moved to pop. I’ve just been writing with friends, using those tracks to get with smaller artists, and pushing from there.\n\nAlso, to add to the cold call grind. There’s a really solid formula I’ve learned in marketing to get higher open rates, and my brother who’s launching a clothing brand just found out a really silly formula to get that even better. He’s getting clothes sent out to major label artists right now for free (aside from the cost of shipping and production) because he’s speaking the right language and sending clothes that people actually want. Same thing can be applied to songs. Might make a little outline and post it in here for everyone because it’s not only super important for the entry level grind, but it helps in day to day communication as well!!",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153456123576332388",
    "author": "oaklandmatt",
    "date": "2023-09-18",
    "content": "Yes, all the time. But my perspective is sort of tough love: nothing you or I do matters. Even if I make a culturally transcendent song, in 100 years we'll all likely be forgotten.\n\nOk, so then what? Well, you still have a subjective experience of the world. So what is meaning for you? \n\nDo you like making things? Do you enjoy the process? Do you feel fulfilled and connected to the experience of life by playing piano or singing or mixing or making weird keyboard sounds? \n\nI love all that shit so much. When I get stressed out and uninspired, I try to find the ways to get me back into making things. When I do, I always feel better. Piano scales or learning songs or playing guitar for my girlfriend or whatever it is that makes me feel joy.\n\nIt's very important for me to have significant parts of my life that are creative and not for any purpose.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223698173453799465",
    "author": "oaklandmatt",
    "date": "2024-03-30",
    "content": "If you write a full song every day, and record even a voicenote of it. In a year you'll just BE a songwriter.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261743620416081920",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "I'll give a point by point analysis, cuz why not?\n\nFirst off, I love Irving Berlin. One of the greatest ever. White Christmas, God Bless America, Always, Cheek to Cheek. A master of the craft. \n\nThat being said, adhering to portions of this list could lead a songwriter in 2024 exactly in the wrong direction. Keep in mind two things: one, great artists are rarely great explainers of what makes them great. And two, his career ended in the late 1950s. This means his golden era was pre-Motown, pre-Beates, pre-television, etc.\n\nOk, my thoughts:\n\n1. This doesn't apply any more. He's speaking in relation to a time when music was more complicated. Music is MUCH simpler now. For example, White Christmas has a much larger vocal range than every Selena Gomez song. Also, 99% of songs today are recorded by someone writing it. It's much more important for the singer/songwriter to sing the song in their vocal range than to worry about some future audience. People rarely write songs and then hire a demo singer any more.\n\n2. (and 7 and 8) The best advice on here. Simplify. \"Kill your children.\" Remove things you love in order to make the song more concise.\n\n3. No. The culture changed, there are a million counter examples since Motown/Beatles. Sure, you can write a song without gender (\"you\"), but saying songs SHOULD be genderless is just wrong.\n\n4. Don't write frivolous songs? I'm all about authenticity and connecting emotionally to a song, but this is strangely phrased and doesn't seem very instructive. \n\n5. Every time I've seen people try and follow this, they write bad songs. As the great David Foster said \"There are only 12 notes and 26 letters, and Beethoven and Shakespeare already did it better than you.\" You're unlikely to find original chords, melodies, or words. The only original thing is your own life experience. Don't be \"original,\" be honest.\n\n6. Kinda. I guess I mostly stick to this. But also, there are thousands of great counterexamples after 1960.\n\n7, 8, 9. All great",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "834682721695432724",
    "author": "Slow Hand",
    "date": "2021-04-21",
    "content": "@Deleted User Oh lord, *this*. You've hit it on the nose. We can waste a lot of time in life trying to give people what we think they want from us when it doesn't line up with our own thoughts or desires. Being honest with ourselves and open with others in this way can help to remove a lot of internal struggles that cause us distress. Of course I'm simplifying a nuanced point and everyone's personal context will vary. Nonetheless I do want to give a little positive feedback because while I'm far from a people-pleaser I do, from time to time, have to catch myself shying away from expressing how I really feel on a subject. Again it's nuanced and seems very plain and simple to say so, but being honest in your emotions with yourself and others to the best of your current abilities is going to serve everyone better at the end of the day. Whether you're writing a song or when you're dealing with interpersonal issues.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "846662569799450655",
    "author": "Slow Hand",
    "date": "2021-05-25",
    "content": "Now that everyone is incentivized to play *their* song the current iteration becomes the most-requested song of all time. DJ's revolt. Publishing companies and PRO's buckle under the logistical strain of addressing everyone's financial claim to authorship. 'Sicko Mode' derivatives can be heard echoing from every car, bodega, and grocery store intercom. TV has become unwatchable now that every comedy, drama, and reality show is saturated with these songs. The mob can't get enough of *their* song! Society breaks down. After a dark period and reconstruction civilization reforms as feuding warlord states where the only currency are promissory notes for royalties on the song that once brought humanity to the brink.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "881350955013132299",
    "author": "isaac joel",
    "date": "2021-08-28",
    "content": "re: writing songs acapella first...if I had to guess I'd swear that Aaron Cartier does that, his songs are so simple and hooky but very vocal driven. As an aside I don't understand how he's not like...the biggest artist in the world and dominating TikTok 🤷‍♂️ so damny good https://www.youtube.com/watch?v=F-iWQRHJwxs",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058037149146038312",
    "author": "NoahNeedleman",
    "date": "2022-12-29",
    "content": "I used to do a thing like that with a bunch of buddies in LA every September. \n\nIt started cause I wanted to practice using key changes or modal shifts as a songwriting technique, and so I had rules for myself:\n\n1) first idea that fits, wins. No agonizing over lyrics or Melodies or whatever, if it rhymes and makes some kind of sense, move on with it. \n2) first year: ever song needed a key change or modal shift. Second year: shifting or alt time signatures. Third year: some other esoteric tool I wanted to learn etc…\n3) the moment you’re done, record a voice memo and send it to someone. Mistakes and all. \n\nThe key for these rules was the make the quality of the songs less important than the act of writing. But damn if I didn’t get two or three real winners every year.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075791534328393790",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "The other overall point to make is that I find nearly all the great songwriters I know are just comfortable in a session. \"Good vibes\" in a sense, but also just comfortable generating ideas. They don't really get stuck anywhere. If something isn't working (even if they suggested it), they're comfortable moving forward. Just forward momentum, very little negative energy.\n\nAnd so much of that is *simply doing it a lot*. It's great to talk about tips and tricks (and yes, morning routines), but mostly it's just putting in time where you're enjoying doing it. \n\nThat's why I think learning songs is so important. It's actually not really about intellectualizing or analyzing what great songs are doing. It's much more just practicing being in the feeling of singing and playing great music. It's the same feeling you're after when you write. By learning great songs and singing them, you get comfortable in that feeling and you're better able to connect to it when writing.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "858205648285073439",
    "author": "oaklandmatt",
    "date": "2021-06-25",
    "content": "@David Fuller with rare exception, a hit song can be sung and clapped along to. Occasional instrumental hooks (though most of them can be sung) are the only exception I can think of. \n\nThis is where the \"a great song can be sung and played on piano\" gets it wrong. Singing/ clapping is the fundamental. Rap songs to ballads to dance songs.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204962498525274143",
    "author": "oaklandmatt",
    "date": "2024-02-07",
    "content": "As is always the answer: it works every way you could imagine. Back to what I said a few days ago, you gotta learn a lot of skills and get a lot of reps using them. \n\nThen you learn the meta skill of making strong decisions based on your taste. Sometimes that's \"hit this note instead of that note,\" and sometimes it's \"let's stop trying to write to this track and go outside with acoustic guitars.\"",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212964832135876668",
    "author": "miario_atl",
    "date": "2024-02-29",
    "content": "I've learned to detach from the music I write. The masterpieces I may believe to be writing are a gift to the world so if that song is maximized by someone else's voice instead of mine, then they should have it. If the song blows up, it's still my contribution to the world. My voice isn't the right fit for everything I write so a great song can become simply a good song if the wrong voice is on it.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1236569086046109716",
    "author": "Rob Domos",
    "date": "2024-05-04",
    "content": "Wow this mkgee is absolutely phenomenal. Breathes new life into me and my love of music",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385595768664096778",
    "author": "Ross Fortune",
    "date": "2025-06-20",
    "content": "I’ve been pushing myself to write more 100 percenters, and lyrics are a challenge for me. \n\nMy studio neighbour sings in a band but writes alone. His tack is to bounce his instrumental along with whatever gibberish vocal guides he’s laid down, then take a walk and have it on loop on headphones. Whenever he gets to a point where his mind is wandering he’s forgotten he’s supposed to be writing, that’s when the lyrics usually come.\n\nHaven’t had a chance to try it yet but it sounds like a good approach",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385770568506146816",
    "author": "Slow Hand",
    "date": "2025-06-20",
    "content": "I've always been inspired by the working relationship between Elton John and Bernie Taupin. \n\nBernie (who strictly writes lyrics) would mail completed lyrics to Elton, who would sit at the piano and write to them. I can see several advantages  here:\n\nA) You have a complete subject, theme, and narrative arc.\n\nB) The dramatic arc of the lyric informs the shape of the music, which can give the lyric additional support and also shake the writer out of their usual approach.\n\nC) The lyric can be stretched or compressed until it finds it's proper cadence and allow the singer (Elton) to find the best melodic fit to support the lyrics.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405958356094554124",
    "author": "oaklandmatt",
    "date": "2025-08-15",
    "content": "Roll with it. If each song works best with their voice and thematically, why complicate it?\n\nWe're also in an era where because everyone has access to EVERYTHING on the internet, there's this desire to be more broad. But the things that last are often deeper, not broader. If G is the key, stick with it and go deeper",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076506185051676672",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "I was moreso a producer and added being a songwriter to it. \n\nFirst off, DO IT. It massively improves your production and usefulness to the music industry. And it's fun as fuck to be good at another thing.\n\nSecond thing. Another way to think about it, especially as a producer, is to start thinking of yourself as a songwriter first. What does that mean? Write lyrics all the time. Keep notes of song title ideas. Make voice notes. And write a bunch of songs.\n\nLast point: tracks and melodies are easy. Everyone can do that. Lyrics are hard. Write lyrics all the time. Lyrics lyrics lyrics. @OJ",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1294764501865857098",
    "author": "BatMeckley",
    "date": "2024-10-12",
    "content": "It’s the difference between writing about an event and conveying how the event made you FEEL. \n\nI call it “Hotel Cafe Songwriting” 5 writers a night sit down and sing a song about how Trevor broke their heart and left them at the coffee shop. But no one outside their friends and family knows the story, knows Trevor, knows the coffee shop, and so no one cares. BUT, when the writer conveys the specifics in a way that conveys how something made them FEEL, then it becomes universal. We’ve all (except for me) have been dumped, we’ve all been hurt, we’ve all had coffee. Now we relate and care. \n\nI’ll always remember the showcase that got Switchfoot their deal for the record that blew up for them, and telling one of the people there how funny it was they had these songs licensed in all the teen dramas, because “these people don’t even realize they’re singing about God, not a girl, how dumb”. The A&R looked at me and said “no, they’re singing about LOVE, and that resonates with everyone.” Really changed how I looked at songs.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399123329658654764",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-07-27",
    "content": "In my mind, this is one of the strongest arguments for how AI can be useful in society. Surfacing the right (or CLOSER to right) thing for the right person at the right time. Instead of relying on the archaic, unspecific randomness of exposure to self-help books, charismatic leaders, philosophy and random advice we run into at any given time. \n\nImo advice that doesn't take the receivers' full situation into account is only ever useful by chance, and more often than not leads to focusing or thinking about the wrong things",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827616829853270036",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "learn your favorite songs in depth. there's always a lot more going on that you think. many of the best songwriters i know just know a ton of songs. not only does it teach your conscious brain, but it builds muscle memory for a TON of good habits. lyrics, rhymes, the sound of words, melodies, harmonies, cadences, vocal performance, etc. Study the greats like @joebegalla said!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "829067268910481409",
    "author": "antoniohannamusic",
    "date": "2021-04-06",
    "content": "Hey Matt,\nThank you for taking the time to come back to me and with such a detailed breakdown.\n\nI think of in terms of where I’m currently at, the \n\n#1 for me - released work is almost all band focussed; I probably spent the better part of the last 10 years recording rock, alt, pop punk, metal etc etc and only super recently even considered the idea that I could be a songwriter.\n\n#2 Makes loads of sense and is definitely something I will focus on in the immediate future - work with people I know and I like working with already, like even some of the artists outside their bands / solo stuff, I didn’t even really consider hitting up my favourite clients for this as I assumed (and have been met with hesitation) most bands don’t like the idea of having someone come in and “write their songs” but this approach seems way more achievable I.e just hang out and write something!\n\n#3 the struggle haha! Unfortunately being in London almost 100% of my work has been remote, I’ve found myself tracking drums, bass, vocals, trumpet etc all using AudioMovers and while it’s great to finish projects I agree with you that it’s way better to do any or all of the above in person.\n\nThat said maybe the cold call/ intro is more like a “hey, here is some of my stuff, let’s jump on a zoom call, if you don’t hate me in the first 30 mins come hang at the studio for a day” \n\nThat all said, if anyone on here wants to jump on and do a session hit me up 🤣\n\nThanks again Matt, even more keen to push forward now!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880520432665645127",
    "author": "Josh",
    "date": "2021-08-26",
    "content": "Now that I think of it, the best songs I’ve written are when the melody and lyrics hit me while I’m still fucking with chords, and there’s nothing even in the DAW yet. Gonna spend the next few weeks hopping on voice notes now. Will update my findings.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "972722536804671528",
    "author": "Slow Hand",
    "date": "2022-05-07",
    "content": "Second. I love that The Neptunes’ musical voice is so distinct that they can make a track that’s this simple (808 and snap) that I can guess their presence on the record without even looking.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472777380891332759",
    "author": "oaklandmatt",
    "date": "2026-02-15",
    "content": "I alleviate my anxiety by doing something small every day. I feel best when I've done some writing and some singing. On days when I don't have a session and am otherwise busy, this means doing some singing and some songing. I do my normal 20 minute vocal warm up and either a 30 minute song or singing a few of my favorite songs or learning a song. Just something to keep my brain in that mode. The sense of accomplishment at the end of each day is what keeps me feeling in the swing of it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "834679444387004456",
    "author": "Deleted User",
    "date": "2021-04-21",
    "content": "This is a real struggle... When I was starting out with writing songs, I would only write stuff that I feel like people would like or that I feel like would be a cool thing. It never worked out and ended up fake and awkward. And once in a blue moon I would really feel the necessity to write about my own experience it was scary. Scared of exposing myself and what i'm feeling even to the cowriters or people that I'm sharing music with. Fuck, and I'm even shy about sharing it with my girlfriend and my family. Slowly growing out of it by training myself to be emotionally honest and vulnerable. And I also recognized that this issue is not only in songwriting but also in playing music and just expressing myself in general. ** If anyone is also struggling with this, you are not alone. I'd be happy to chat with you **",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "858206009221578782",
    "author": "oaklandmatt",
    "date": "2021-06-25",
    "content": "Not to get all anthropological on it, but it makes sense as humans have been singing and dancing and playing drums together for WAY longer than any of the instruments we use have been around.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "858218965499248641",
    "author": "Alessandra Morris",
    "date": "2021-06-25",
    "content": "Definitely! Probably because our brains loooove patterns, it’s like candy for the brain. How we create our behaviour is by recognising and repeating patterns. It’s like our brain naturally looks for these patterns to then put them in context and make sense of whats happening. 🧠",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860535201440202792",
    "author": "Alessandra Morris",
    "date": "2021-07-02",
    "content": "it’s like an  intuitive thing i think. But like @oaklandmatt said, it kinda comes with time, practice and also messing up. I’ve found great hooks by making mistakes. Sometimes i just grab the idea for a hook from a portion of the top line that I already did, I just change it a bit, make loads of variants of that motive. Or just move around the key of the song and get a lot of options. You know what i mean? Its hard to explain by writing😂But its just trial and error tbh. Don’t think there is like a formula 🤷🏻‍♀️",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240733755400912927",
    "author": "Slow Hand",
    "date": "2024-05-16",
    "content": "Chilly Gonzales (the musical genius) with some good insights on melodic writing, using the ABBA catalog as an example: \nhttps://www.youtube.com/watch?v=BM0MO8y72t8",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1299067141206704190",
    "author": "Brian Reynolds",
    "date": "2024-10-24",
    "content": "They're always a line i think of from John Mayer's Heavier Things inside album notes and credits. Where he talked about we would of gotten the album done faster but for the smoke breaks. He followed it up with \"I don't smoke. But I do like to get outside and take a break with my friends.\" Paraphrasing. The CD case made it to the dump long ago",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357039395701784867",
    "author": "spectrummasters",
    "date": "2025-04-02",
    "content": "Came across this , Charlie Handsome , describing Louie Bells process for Posr Malones F1 writing \n““Louis [Bell] was involved in the writing and production, and he recorded Post’s vocals. I think he’s done that for nine years now, and they have their routine. And Louis is good at creating libraries. At the beginning of the project he AI‑ripped the drum beats of tons of classic country songs. He had hundreds of them. So while I was doing the music, he would go, ‘What tempo are we at?’ I’d say ‘135’, and he’d have 50 drum grooves that work at 135 bpm. There was this huge catalogue of ideas we could aim for,”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463906722702950603",
    "author": "Brian Reynolds",
    "date": "2026-01-22",
    "content": "But probably you should sing it again for the variation excitement",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463933343249727519",
    "author": "Jack",
    "date": "2026-01-22",
    "content": "I think there are two schools of thought here:\n\n1. Fuck it, do it. Path of least resistance. You’ve tried other lyrics, they’re not hitting. Cut V1 again with a different vocal, do some arrangement modification and send it. \n\n2. Nobodies heard this song before, whatever icky stimulus you’re receiving from attempting V2’s can probably be attributed to your personal saturation of V1; something nobody else will struggle with. So get a decent V2, accept it won’t hit the same for you because you’re cursed and send it. \n\nBoth work!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827668863486263306",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "If you're a producer and not a songwriter, and you want to be a songwriter in sessions, start writing songs on your own. Write 100% songs yourself, where you write all the lyrics and melodies and record your own vocal. The first 50 will probably be trash. That's ok. You don't have to show anyone. Just finish the songs and then write more. Put in the time and then you won't have any hesitation in a session because you'll be a songwriter.\n\nWatch the Ed Sheeran doc for more inspo. He wrote 2-3 songs a day for ten years. That's why he's so good. There's no shortcut. Just start writing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "844384828454862889",
    "author": "oaklandmatt",
    "date": "2021-05-18",
    "content": "@Alan McKee I love this topic. People connect to the emotion of lyrics way more than the literal story. yes, the lyrics are important in that catchy memorable things are important. But more than that, lyrics are the way to express a feeling. \n\ngreat songwriting, like great poetry, allows people to connect their own lives to words that aren't about them.\n\nI didn't grow up in the hood in atlanta but I love Young Thug because I hear his joy and his pain and his bravado in his songs and my heart connects. I've never worked on a farm but when I hear \"I ain't gonna work on Maggie's farm no more\" by Bob Dylan I feel that rebellion and connect it to my life. When the chainsmokers sing \"baby hold me closer in the backseat of your rover that you can't afford and your roommate back in boulder and the mattress that you stole\" I know that feeling because I've been 20 and in love and in a crazy time in life.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876215060844916746",
    "author": "Rob Domos",
    "date": "2021-08-14",
    "content": "I’ve been trying to solve this puzzle and I have a working theory that the goal is to meet people’s expectations in a way that they don’t expect to have them met. Like for example: If I hear a melody in my head, rather than singing the next note I hear in my head, I’m trying to sing a related note, like a a 5th below or a third above or pop the octave on that one note or something so it still goes where they expect it too harmonically and tension / release wise, but it surprises them melodically",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984002886323281971",
    "author": "peterlabberton",
    "date": "2022-06-08",
    "content": "I don’t think I’ve ever encountered a no charts gig—but that said, I keep them small and concise. It’s just a detailed set list; if someone has a problem with that they can go take a deep breath and get over themselves. Obviously it’s great to have things memorized but developing a comfortable chart system that works can be invaluable. I remember in 2019 doing rehearsals for a tour where I was playing in two bands on the bill, and hopping on a friend’s quick run of shows last minute right before leaving. No fucking way was I gonna remember 30-40 songs I’d learned over a week or two!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061300275605938176",
    "author": "Will Melones",
    "date": "2023-01-07",
    "content": "I’m still not sure I’m very good at this, but I didn’t know what to even offer as a co-writer until I’d had someone critique me, if that makes any sense. I mean really pull apart one of my songs word for word. Have you ever offered up one of your songs for that experience?\n\nPerhaps the most value you can add is by looking at the song out of context, with fresh ears and no bias, and just determine whether or not the writer’s intention is clear and cohesive.\n\nIt’s a thing close to the heart, so you have to approach it with care (kinda like vocal producing). I can’t think of a time that I’ve ever offered lyrical input if a song I’m producing. It would have to be really detracting from the message.\n\nIt’s another thing altogether when you’re *invited* to offer a critique or help finish an idea…although sometimes I find that the invitation isn’t always an indication of open mindedness.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138146336093507736",
    "author": "chrissorem",
    "date": "2023-08-07",
    "content": "Another thing to try is to listen to other instruments and replicate their rhythms and phrasing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218008416967065611",
    "author": "Slow Hand",
    "date": "2024-03-14",
    "content": "Come to think of it, everyone was such a good songwriter. Greg (of Celestial Shore) wrote this one, and it's still my favorite things they've done. That song is pure Greg with Sam and Max shredding over top. I wish Greg released more music these days. He's got such a distinct songwriting voice.\nhttps://open.spotify.com/track/0EbuTq1xtwVEbVkxuqkx9W?si=711e8bb7db8644a8",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280279153958191204",
    "author": "LeoBlue",
    "date": "2024-09-02",
    "content": "Where does everyone get their most creative fun idea from? For me it’s always when im at the gym exercising all these random ideas pops into my head, or when I shower really late at night. What activities stimulate you creatively?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280345253110616176",
    "author": "Zack Hames",
    "date": "2024-09-02",
    "content": "I love this. \n\nGenerally I’ll listen to the in prog of whatever song or idea and go for a walk. Usually gives me ideas instantly. So similar to you!\n\nSomething to be said about blood flow increasing brain activity and therefore creativity and problem something. It’s real!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417225387825561791",
    "author": "Brian Reynolds",
    "date": "2025-09-15",
    "content": "\"The truth is you could slit my throat\nAnd with my one last gasping breath\nI'd apologize for bleeding on your shirt\"\nTaking Back Sunday\n\nI still remember walking into Hot Topic and doing what I always did. Walked directly to the headphones, that had 6 CDs loaded up to choose from listening. Drawn immediately to the NJ Parkway signage and a sticker that said, \"If you like Thursday and New Found Glory\". Hit play and I was all in from second one. \n\nThe lyrics and especially the one above I couldn't get enough of on this record. They are so visceral and clever. \n\nThe imagery of having you neck slit is like horror and action movie territory. But here it is in an angsty punk rock song about lost love. \n\nStarting the line with \"the truth is\" somehow enhances the line slit my throat. Its great storytelling.\n\nThen to top all the clever with the killer line of all killer lines. \"I'd apologize for bleeding on your shirt.\" The painful self awareness that somehow thru it all, your devotion remains. Youre still deferential to your tormentor.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472283335555285053",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Yeah I agree. What do you consider \"finished\" for a real rep? For the 30 minute songs, my bare minimum is roughly a verse, pre, and chorus, plus a voicenote of it played and sung all the way through. If there is no pre, or if it's more of a verse/refrain structure, I will definitely write a second verse.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827617584492576779",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "yes! better than soda and white bread. do the same with your music diet. listen to classic timeless incredible songs only. sing them. learn them. get them into your bones",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "889949871602282549",
    "author": "Zack Hames",
    "date": "2021-09-21",
    "content": "I think communicating that through text is *incredibly* difficult. What i usually do is try to confirm by describing what they're talking about BACK to them while also using the correct terminology.\n\nI have a good friend / amazing writer who calls \"measures\" how many times a progression repeats.  So he will say something like \"just add another measure\" or \"have that layer fade halfway through that measure\" or something, and I just go \"wait, so you want it to repeat through the whole progression again or am I missing something?\" Just an example. Then later I may take an opportunity to explain that a measure is much smaller than the entire progression and try to explain the difference. He's incredible, amazing writer and has amazing ears but does not have any training or speaks with any technicality with almost anything in his life. It would be almost impossible to actually break those habits for him, he just doesn't care.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "899717743400583279",
    "author": "eliotpeace",
    "date": "2021-10-18",
    "content": "It’s interchangeable for me. 9/10 times I like the sound of my u87 clone straight to daw better than voice memos when it comes to super melody content. That said, voice memo recordings have a really unique time capsule-ey sound to them. Similar to how a dictaphone or tape recorder can date a sound. I still use voice memos all the time, usually out of necessity of time / space",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983981143336575026",
    "author": "Deleted User",
    "date": "2022-06-07",
    "content": "Personally, I latch onto vocal parts (if there is any) or other instrument parts to associate memories of what happens in the arrangement. It kind of takes me out of the charts too- if in some rare cases of “no charts” gig. But I find writing charts always helps in the process of learning parts even when it’s a no chart type of situation",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075389524970045510",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "That's a awesome idea too, keeping it in your head as you ponder elsewhere and record voice memos of the sparks",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1124157043633307698",
    "author": "austenballard",
    "date": "2023-06-29",
    "content": "@LAPhill @Keyron it ended up getting postponed actually 😦 but @Deleted User 's suggestions were really helpful to think about and free write on! Highly recommend using them",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139623628107948133",
    "author": "popaganda.",
    "date": "2023-08-11",
    "content": "Honestly, the best way to find your own voice is to copy people you like until what you love is integrated into your own unique style.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153461840983097375",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I might start doing this. The two things I care about deeply right now are figuring out crazy sound design shit to compete with skrillex and figuring out how to make a song that shakes someone with just a voice and a guitar. So I’m on two very very different kicks right now.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153749573240639568",
    "author": "austenballard",
    "date": "2023-09-19",
    "content": "Interesting. I kinda feel the same, especially when I'm working on modern stuff and then go and listen to modern stuff. It feels more like reference than inspiration. So I decided I was gonna watch Weather Report's 1976 Montreux performance and some Allman Brothers instead. That felt very mentally nutritious",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177712380742992003",
    "author": "Slow Hand",
    "date": "2023-11-24",
    "content": "> “Writers these days are more interested in immediate appeal than they are in a great song. They aren’t the same thing. A great song is only a great song if people will want to cover it in 30 years” \n\nI think about this a lot. My natural tendency (for better or worse) is to sit on records/songs that I've made for myself. No rush. I'll often ask myself \"Am I missing the window of opportunity here by not releasing?\" and my answer is often some version of \"If it's a good record today then, it'll still be a good record tomorrow\". Ideally it's release is not dependent on catching a wave before the popularity runs out.\n\nOf course, I'm unlikely to seize upon the cultural zeitgeist with this behavior, and there's a lot of reasons to not do what I do, but Alan's line of thinking feels right for my needs.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180876120040677376",
    "author": "Chad Rodgers",
    "date": "2023-12-03",
    "content": "Title afterwards generally. Whether it means picking through the lyrics and finding something cool or apt, or just using the main refrain/hook to inform whatever it’s called (90% of the time it’s the latter as I think overly clever or smarty pants titles tend to be lost on the audience).",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188047183694532650",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "moving conversation with @rae here\n\nI've been doing more of \"study the greats\" with production, when it comes to arrangement and production, I feel that things are a lot more clear cut than songwriting. For example, I can try break down the drums of a song into a  drum pattern, dynamics, feel, and the drum sound (type of drum kit, machine, and processing on it). \n\nBut with lyrics (or language) - it feels more gray to pinpoint how to take a concept and apply it into my own writing. How do you usually break it down?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188126231389024296",
    "author": "cy (sigh)",
    "date": "2023-12-23",
    "content": "Questlove was actively trying to imitate the feel of J Dilla's drums in those sessions and he said he STRUGGLED  because he was so used to trying to be perfectly on time in those days - there's a couple interviews (red bull is ones I think w d'angelo there ). also I forget the engineer's name but he also has a seperate interview (if you haven't already seen it)\n\nbut on the topic I think in my case my fiction (creative writing) background helps a lot. Theresa few exercises we used to get m, some for eveyone and another was based on each person's writing styles. \nfora general excercise teach would have us write down a phrase or two we overheard during the week ina public setting (train. bus, in class etc) and create a short story that Stems from it.  this is good for being able to create things out if nothing - world creation using a set core, \n\nmy natural writing style is v descriptive so one of my peesonal excercises was to write explicit sex scenes every week. it's extremely hard to find the correct balance between keeping it enticing and going over the top and losing either making the readers cringe  or unintentionally laugh. (and we laughed so often 😂)\nall these would be read and workshopped in the class itself. \n\nI think one of my main skillsets now is based in those skills. I'm very good at re-writing / editing and most of all reframing sentences. when other ppl give mea direction to follow, whether  it's just the idea or maybe they already have words and need to readjust to whatever music we now have on hand. \n\njust recently wrote a whole song I thought was too generic and open ended but loved the ideas. pitched to an artist and they loved it. we're working on editing the lyrics to insert a ciuole personal scenarios of hers but most of the vocal melodies and words are actually the same as what I had.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188128157740564480",
    "author": "cy (sigh)",
    "date": "2023-12-23",
    "content": "also, whike I write other things without issue. I write songs with a melody carved in 100% of the time. whether or not I have music for it.  I can change it up after without issue but writing without vocal melody vs writing without then editing gives me very different results (I feel anyway)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220668347700744222",
    "author": "Deleted User",
    "date": "2024-03-22",
    "content": "There may be two ways of approaching this\n\n1: Trying to make the better versions of ‘same type of songs‘.  I do this myself, using same moves that have worked before I can make a better version of the same type of song. \n\n2: Copy from style you are unfamiliar with. This can get you out of making ‘same type of songs’\n\nI think there are main four elements of musical habits: rhythm chords cadence/resolution tempo \n\nyou may find there are a few key things that you gravitate towards like your “home” in all four of those. You can explore outside of the patterns that you lean on in those four elements if you want to prioritize breaking out of some of the habitual choices.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221191225105846425",
    "author": "samvalentine",
    "date": "2024-03-23",
    "content": "Might be an unpopular opinion but logic drummer is pretty solid for this purpose (if you’re using logic)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221397512938852402",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-24",
    "content": "That‘s a very intersting and thought provoking perspective. On the other hand, don‘t you think that a lot of people, especially those who don‘t have as deep of a connection with music as we do, don‘t really care about lyrics that much as long as they have a simple, easy to remember hook they can sing along to? Or at least a memorable melody they might not even remember the lyrics of?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287557823152259266",
    "author": "Calvin Lauber",
    "date": "2024-09-22",
    "content": "Try handing him a bass and asking if he wants to write a song focusing on the root notes, vocal Melodies first, if you come up with something throw a drum loop on it and hand him the guitar and I bet he’d play some cool stuff to it. I get when that’s your primary instrument starting too guitar-brain to focus on the songwriting part",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304263718883819591",
    "author": "oaklandmatt",
    "date": "2024-11-07",
    "content": "Yes x1000\n\nStudy the best things, even if they don't always seem to apply directly to what you're doing. \n\nMax Martin is maybe the best at making vocals sound A+. He is well known as a detail oriented, vocal-focused pop savant. He is often a part of every choice from writing lyrics and melody all the way to adjusting sibilance in the mix. His instincts for great melody and rhythm, paired with lyrics that sound good, is unmatched. And I say \"sound good,\" because though I think many of the lyrics of his songs are meaningful (especially with the best lyric co-writers), the choice of words and how they are emphasized and enunciated is what separates him from everyone else. It's like Michael Jackson. \n\nDo some YouTube searching on artists talking about working with Max Martin. You can learn a LOT about writing vocal from him.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1329523363898458336",
    "author": "Pio",
    "date": "2025-01-16",
    "content": "Have dm’d you about this! 🙏🙏 (just bc I wanted to do a voice note bc in a little rush today 🥲🙃)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356414365825237164",
    "author": "Brian Reynolds",
    "date": "2025-03-31",
    "content": "But beyond that. You can comp the gibberish together to make the most compelling melody for the part your writing to. Then just loop that part. And start to sing with your comp. Ask yourself what's the mood of the song, what mood am I in. And just kinda flow with it. Like improvising on an instrument. Its a muscle so it will take time and effort. The more often you sit down and improvise melody the easy this will be. Doesn't always have to be a voice exercise. 15 mins of mindless melody exploration on a guitar or piano will stretch the same brain muscles.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385025632873746451",
    "author": "Brendan Trinkle",
    "date": "2025-06-18",
    "content": "I love this question, thanks for asking us. \n\nI either write with a guitar & a notebook/phone or I go production first in a DAW. I use a lot of guitar pedals & programmed drum loops to create a vibe & then I’ll write a song to that. \n\nI use Notes to organize things. The parent folder in the screenshot is also kind of an inbox & contains in-progress songs that don’t yet have a folder home. \n\nI use Voice Memos often & have a little naming convention system: \n\n“Working Title proto” for first recording of an idea\n“Working Title YYYYMMDD” for each iteration after\n“SFX title description” for field recordings\n\nI use voice memos as long as I’m developing an idea outside of a DAW. Sometimes I have to let songs brew for a long time, play them out loud a lot, and listen back as an editor with fresh ears before they feel like themselves. Love using these tools to fit that work in while I’m at the grocery store or in the car.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385030307278749817",
    "author": "Brian Reynolds",
    "date": "2025-06-18",
    "content": "I'm always in the daw. Always recording.\n\nSometimes melody first. But mostly drums first.\n\nBuild an instrumental just chasing intuition, quickly. 2-3 melody parts and a bass line on top of drums. And youve got a chorus loop. \n\nThen take that improvisational melody muscle and apply it to the vocal melody. \n\nIm not a big humming guy, I get to words pretty quickly. But will start with common phrases to me like,  \"runnin runnin runnin round runnin runnin runnin down\" I have a few others.\n\nI start to land on a melody, with a feeling and story. That I haven't told. Sometimes it takes 90 seconds, sometimes 5-10 mins. \n\nRecord and comp till I have what I like. Than do all the background vocals. \n\nThen start muting a couple of the melody parts. Find my verses.\n\nRinse repeat the process above. But now I know the story and I just have to find the melody and the thru line narrative.\n\nDepending on how the verses feel running into the chorus. Or short length of track. I'll write a bridge \n\nMelodyne the vocals.\n\nStructure the song.\n\nMix the song.\n\nUpload the song.\n\nMake another.\n\nThis usually takes 2-4 days, intermittent with regular life.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385273564210532505",
    "author": "Josh",
    "date": "2025-06-19",
    "content": "So I’ve been trying to write more and I was getting frustrated because telling myself “it’s time to write” doesn’t yield the best results. I’m also trying to get better at guitar and just started playing more. Turns out playing more makes me find cool tones which gives me cool ideas that I end up finding melodies to while I’m practicing whatever it is that sounds fun that day. Then to double down on the practice I come up with lead lines over the track until my fingies get tired and then lay down the vocal.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385324320942854259",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "Anyone else have times where they go lyrics first? It’s not as common, but I’ve definitely built songs around vocal lines that I knew hit enough to have a song built around it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392835440343781417",
    "author": "Ross Fortune",
    "date": "2025-07-10",
    "content": "New songwriting voice memo app just dropped and their lifetime premium is free for 24 hours.\n\nNot associated and not tried it but feels like it could be useful for people in here, especially if it’s free https://apps.apple.com/app/dubnote-voice-memos-for-music/id6445849526",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397690971017314345",
    "author": "Ross Fortune",
    "date": "2025-07-23",
    "content": "I really tried to force myself to write in PT - committed to it for 4 whole years, but it is just ball ache. There are producers who make it work, but being restricted on actions when in loop / record is just not the one for me.\n\nI find it also forces me to think like an engineer, which is great when I’m properly engineering, but not what I want when I’m throwing paint at the wall. \n\nThese days with comping in Ableton, I’m happy to get most of the work done in there. When it comes to mix I’ll usually fly the vocals out to PT with an instrumental so I can do my clip gain and RX workflows there, but otherwise I’m saving more time and frustration by just staying put.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1413267814533304360",
    "author": "Slow Hand",
    "date": "2025-09-04",
    "content": "That's great!\n\nThere is some nuance, but it rarely hurts to ask. You get 0% of the shots you don't take.\n\nIt's also nice to simply reach out to someone you admire and tell them they're doing great work, without pushing for anything. I've had a lot of opportunities come from simply expressing heartfelt admiration and gratitude. They rarely pay off on the spot (and that's a good mindset to go in with), but they've often been the beginning of something good.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471659259895746641",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "1. Write a song every day (or attempt) certainly you’ve heard of and likely tried this, but nothing beats reps.\n\n2. More technically, write out the structure (intro, verse, chorus, etc) of some of your favorite songs and mimic it exactly. Even as far as how many measures, or even dynamics (or tempo changes!)\n\n3. If you play an instrument, Learn “great” songs. And ideally sing with them. Playing the best songs in the world will seep into your writing and show you new ideas on chord movements, melodies, and the physicality of a great song.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472776139452977224",
    "author": "oaklandmatt",
    "date": "2026-02-15",
    "content": "As I'm sure you already know , there is no such thing as enough. It's like how perfection doesn't exist. \n\nIt may be easier to think of being a writer on a spectrum from hobbyist to full-time artist. The one end is the hobbyist who does it whenever they want and have time (other priorities take precedent). The other end is the artist who is compelled to do it and it has to turn it off in order to live a normal life.\n\nMost people here are somewhere in between. For most of us, the key is to do a combination of two things:\n\n1. Find every way possible at all times to joyfully write. Direct yourself toward it with how live. Write silly things for fun, have a guitar you like to play next to the place you always like to sit, write emotional things for catharsis, write with other people for the collaborative joy, sing in the shower, write on different instruments that feel inspiring, etc etc \n\n2. The harder part is developing habits and practices that keep you consistent. It's easy to write when it's fun. It's harder to write when it's not fun, and that's the time to make sure you're doing it. Daily practices, schedules, deadlines (self imposed or otherwise) are the best way to do this.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827635658511482910",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Let me ask a more direct question: What are you interested in learning? Do you just want to learn some diatonic cowboy chords that you can play on guitar and sing over? Do you want to learn jazz harmony? Does classical counterpoint interest you? Music theory is really broad and takes time to absorb before you can comfortably move on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827635837835149333",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Depending on what styles you're interested in you can probably disregard the more esoteric stuff, for example. Nobody is using Jacob Collier-style negative harmony or mirrored quartal stuff unless they're making avant classical or are a Herbie Hancock-grade improv virtuoso.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827638754876325968",
    "author": "Zack Hames",
    "date": "2021-04-02",
    "content": "My best way of learning theory was just by actually having a reason to use it. Just trying to learn broadly/abstractly is very difficult IMO. A project in school, I had to transcribe a 70s funk tune by ear, get musicians to come and play the charts, then record it authentically and recreate and match the mix. This has organ, horn section, guitar, bass, drum kit, background and lead vocals. I learned so much from that process.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "830332601482477568",
    "author": "antoniohannamusic",
    "date": "2021-04-09",
    "content": "Tried to listen to this with an open mind but couldn't hear past the \"my first logic session\" feel of the whole thing. \n\nI don't know that X-Billion dollar AI tech was required to write the song but it might have had some credibility if say they got Dave Grohl to play on it instead of using midi instruments? \n\nIt just feels very sterile and not Nirvana, also, why were there so many sections in the song structure? The bolted on outro.\n\nWould love to know if anyone else here has heard this and immediately got annoyed hahaha!?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831595748747247616",
    "author": "Slow Hand",
    "date": "2021-04-13",
    "content": "I thought it was a unique documentary in that you also get to watch a song go through all the stages of production. From hashing it out on guitar and voice with other writers, to arranging for band, to tracking, to mixing, to release. I thought that was nice.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831625230827913226",
    "author": "Keegan",
    "date": "2021-04-13",
    "content": "It's that enjoyment aspect that was so surprising to me! I pictured professional songwriters approaching the process a bit like Jon does with individual moves while mixing: 'What do I want to accomplish? What tools will allow me to accomplish that?' There's a way that might come off as a bit formal and like you don't actually need any kind of enjoyment to go about doing that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842444273378000906",
    "author": "Josh",
    "date": "2021-05-13",
    "content": "I’ve been thinking a lot about how pop music is supposed to be easy to sing along to. So I def have the advantage here considering I play auto tune like an instrument with my flat ass voice. Now I just gotta do it all way better hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "844400508626010122",
    "author": "i am willie",
    "date": "2021-05-18",
    "content": "its a combination of good execution and and your own voice which creates great music",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "844400597549711380",
    "author": "i am willie",
    "date": "2021-05-18",
    "content": "and being comfortable with your voice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851462412610961458",
    "author": "Yago Ibars",
    "date": "2021-06-07",
    "content": "I've been having a thought on my songwriting I wanted to share here. As a songwriter I have this toolbox of melodic and harmonic approaches  that I can use to solve any problem when making a song, or to have direction to create another section. But recently I've been noticing that something that makes a huge impact on songs is how the different sections relate to the tempo of the track. I think this might not happen to people who write to a beat, but I think that when you are playing an instrument, tempo is so fluid that some parts of a song might \"feel\" good and others won't (at a same tempo). When all the sections flow well into another in terms of tempo (and probably how that affects to vocal delivery) it sucks you in as a listener and it is way more singable/enjoyable. And now I'm starting to see this as a priority more than which notes of the scale have more weight on the chorus and stuff like that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851469831248412744",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I think a lot of it has to do with the melodic rhythm. In terms of how the sections flow, if the melody can drive it on its own- the accompaniment or production will follow. And as you mentioned, high notes can move the energy and accent the rhythm. Lyrical stress patterns could contribute to the accenting and note selections. Weight sometimes means notes that are held longer than the other sometimes the opposite. Contrasts can do a lot though. Range of movement or the range of the pitches themselves, pacing of the rhythm and rests, breaking the patterns/repetition can help with contrast",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851475913195782205",
    "author": "Yago Ibars",
    "date": "2021-06-07",
    "content": "Couldn't agree more! I think what I was trying to say is that melodic rhythm is very much related to the tempo of the song and the delivery of the singer. And when tempo changes, even if the ratio remains the same, it has a different impact on how it feels. And, sometimes, because you might not be writing to a click, different sections of a song might \"feel\" cohesive at different tempos. And when you sum everything up it just doesn't translate well. And I've had the experience of trying to work around it but ended up noticing that it didn't have to do with the melodic rhythm in each section, but how it relates to the whole song. And now I try to be more aware of it because I think it might be something that is not easily noticeable when you are writing. I don't know if that makes sense (I'm not a native english speaker and therefore I struggle a bit sometimes 😆 ).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851495917428277258",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I deal with (unintentional) inconsistent tempo and some time even time signature/pulse pretty often when working with songwriters and artists. It seems to solve the problem when you tap your feet to the melody. Then you would realize that the tempo has changed. And count 1-2-3-4 or whatever the meter is. So you don’t end up unintentionally having an extra beat because of words and disrupt everything else. A lot of writers ask people for beats first for this reason, but if the melody doesn’t stand on it’s own- relying on the beats will do more harm than good in my opinion. They often end up being mediocre melodies from my experience because there’s already tons of subdivisions and grooves in the beat and the topliner is relying on that to drive the rhythmic feel. But also beats need to come in with pocket so there are space for the vocal melody to fit in. It would be good for writers to start without a beat or instrumentals and it would be good for beatmakers to practice leaving vocal pockets when starting with a beat first",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "858192358013534209",
    "author": "Deleted User",
    "date": "2021-06-25",
    "content": "@whereisstarrah looking for singer songwriters.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "860879075018145813",
    "author": "antoniohannamusic",
    "date": "2021-07-03",
    "content": "What do people here do as far as keeping a writing portfolio goes? Do you keep a bunch of 'song starts' accessible on a soundcloud or dropbox link that you can use as a jumping off point with new artists, or is it just voice notes or both? Or do you approach each session completely from scratch?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876189678439657482",
    "author": "Josh",
    "date": "2021-08-14",
    "content": "Doesn anyone else feel like the cadence of a top line says more than the lyrics? I feel like I’ve been doing this for awhile and just started noticing recently when @Rob Domos  told me my run on sentence of a chorus was terrible (I still love you) because it wasn’t perfectly symmetrical with the first half of the chorus. But to me, having that manic performance really struck home the idea that you’re experiencing a blur of the night just to lead up to an extremely quiet post chorus to make it feel like you woke up alone. Both of those themes also reference the lyrics of course. Idk this doesn’t make that much sense without context, but that’s really been on my mind. I feel like I’m broken for not making everything extremely simple but I like to think that even average listeners feel more from the performance and energy of things changing than just having something that’s super predictable. I don’t think people particularly like simple songs over songs that make them feel something.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876190173929545788",
    "author": "Josh",
    "date": "2021-08-14",
    "content": "For reference “I’d love it if we made it” by The 1975 is fucking exhausting to listen to. But that’s the entire point Matty was trying to make. In “Me” he says “I been thinking about killing myself” so matter of fact that I burst out into tears the first time I heard it. I’m “Grief” by Earl Sweatshirt he sounds like he was locked inside for weeks and absolutely does not like shit and does not go outside like the title of his album suggests. I think I’m really intrigued by the deeper connection we can make outside of lyrics and the rhythms in which we sing them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876214268045955163",
    "author": "Josh",
    "date": "2021-08-14",
    "content": "I wish I could do voice messages on here ugh",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880165583495262220",
    "author": "Josh",
    "date": "2021-08-25",
    "content": "I need to hop on this soooo bad. Feel like I always have great melody ideas and then just never toss em into voice notes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880447673709244488",
    "author": "Josh",
    "date": "2021-08-26",
    "content": "Yeah. I need to try this out. All of my songs start with a track. Mostly because I feel like great tracks make writing way easier. But I’m interested to see how a vocal can influence my decision making when building the track out now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880509757297930240",
    "author": "Alessandra Morris",
    "date": "2021-08-26",
    "content": "This is so true! This made think about when you are a kid and create songs out of nowhere. Maybe this happened to you guys too, before I learned any instrument I used to do that for fun. \nI think humans are naturally musical, for example accents or using different lenguages, there is melody in there, even the tone of the voice changes. When I write in spanish is a different vibe than when I write in english.     Its crazy how we forget to keep it simple as we grow 😂. Im gonna try to start to write  with acapella more often.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880511866395295765",
    "author": "Alessandra Morris",
    "date": "2021-08-26",
    "content": "I think it might change the decision making, maybe you have even more liberty in a way, cause sometimes when you are the instrument its like you enter into one pallet of color and automatically stay within that “color range”. But without that, maybe there is more freedom. Something like that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880512214291861514",
    "author": "Josh",
    "date": "2021-08-26",
    "content": "Right. I’m interested to see how it goes. Because I hear a track and immediately know what “type” of song it’s going to be as far as the vibe of the vocal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "899710723029086248",
    "author": "eliotpeace",
    "date": "2021-10-18",
    "content": "A common theme with lyrics deemed to be great is that they correlate and feel one with the (also great) feeling of the music. Part of my workflow recently has been recording a one mic jam of myself singing (scratch ideas) while playing acoustic guitar, which I then chop up and rearrange into what I want to hear/think sounds best, then I listen closely to the emotion of the song and overdub the rearranged sample with vocal ideas that FEEL correlated to the emotion of the song. I've found I've made some really emotionally vibrant music this way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "899715708798259212",
    "author": "swarga",
    "date": "2021-10-18",
    "content": "That’s such a great idea. I always get stuck with vocals on produced tracks. Trying to put words on an existing theme is hard it turns out. I’ll give this a try! Do you record straight into a daw or voice memos and then import ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "902846518606835722",
    "author": "Sanj Pali (The Pali Gap)",
    "date": "2021-10-27",
    "content": "@swarga Totally agree with the above @oaklandmatt. My advice is just to write write write. Read a lot and be receptive to things around you. With my song Venom (by The Pali Gap on Spotify) my lyrics are really streamlined and I crafted it carefully to cover everything I need to say (down to the syllables and eventual delivery) , but at the early stages it was just rough lines on a few scraps of paper, then did the tidy up later.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990458763788038184",
    "author": "ehutton21",
    "date": "2022-06-25",
    "content": "So I’ve got a songwriting question, and I’ll tag @Slow Hand cause I’ve got a feeling with his teaching experience, maybe he knows (big love if you do have advice here man!) but I’ll see if I get any others with good advice here. \n\nDoes anyone have good resources or exercises to help educate a new artist on how to write a vocal melody? I can explain the specific details if necessary but I’ve found myself a little stumped to develop this technique in one of my newer artists. She’s an incredible lyricist with a great instinct and vision, and having her in sessions has really sparked the song creation process, but she’s really struggling to learn the “theory”/musical side of vocal melody and I feel like my attempts to coach by example aren’t strengthening her knowledge or confidence.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990459602443309067",
    "author": "ehutton21",
    "date": "2022-06-25",
    "content": "I find myself a little stymied because I grew up in a musical household, and man I just kinda started sing off of imitation, but that natural “monkey see, monkey do” tactic doesn’t seem to be in her wheelhouse and her confidence takes a hit where if she’s had a rough day, convincing her to hum a just a little melody becomes intimidating. Looking to find insight and new perspectives here hopefully!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990551214108323900",
    "author": "ALXCPH",
    "date": "2022-06-26",
    "content": "This! 👆 learn a bunch of vocal melodies and apply what you’ve learned by making your own. Repeat 😇 \n\n\nSame process for pretty much anything, study, practice, apply, repeat.   😎✌️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990776830195826698",
    "author": "Slow Hand",
    "date": "2022-06-26",
    "content": "First off, I’ll second @oaklandmatt’s recommendation that she start exposing herself to a lot of different songs, learning them, and working her writing muscles. A lot of this melodic intuition will come with time, familiarity and having a feel for what’s possible.\n\nHow is her ear? I’ve worked with plenty of great singers with little-to-no comprehension for theory. While it can help, I find that for some personality types being too technical and trying to get them to learn theory is a turnoff and is never going to happen. Where does she fit on this spectrum?\n\nDo your best to assure her that she can open up and not be perfect right away. It sounds like she might be clamming up a little bit because she feels uncertain or unconfident. I always try to give my singers a place where they will feel comfortable throwing out any idea. Even horrible ones. It’s okay to fail or fall on your face.  Maybe she needs some reassurance in order to open up. Let her know that she doesn’t have to be perfect. Many singers do better when they have a safe space to open up and attempt new things. Even Prince would tell his engineer to leave the room every time when it became time to track his vocals. Hendrix would hide himself behind a wall of gobos where nobody could see him.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1005933903493730314",
    "author": "Ross Fortune",
    "date": "2022-08-07",
    "content": "*follow up. I've just been having an amazing time flipping through existing spotify playlists with names like \"Classic Songs Everyone Knows\", and the Rolling Stone 500 Greatest yadda yadda. Whatever you think about Rolling Stone or these kinds of lists, it is a great jumping off point for going down all sorts of classic song alleys.\n\nI've filled my own playlist with far more than I need (though it's still a little thin on more recent songs, so please add to the collab list above), and the joy of this exercise has been finding song after song that I love with all of my being, and now I get to learn and sing them over the course of the rest of this summer!\n\nFor anyone interested, this is where I got to: https://open.spotify.com/playlist/1pLCs1BIIQGxHu5v2btVpw?si=982f99218b9543f7",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009590137530892298",
    "author": "youngteam",
    "date": "2022-08-17",
    "content": "i dont have a productivity / finishing ideas hack for you but i think starting from a mindset of practicing \"finishing\" things that we start that are promising is a good mentality",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017287019262660668",
    "author": "Slow Hand",
    "date": "2022-09-07",
    "content": "Question for everyone: What is your approach to fostering the best creative output from a collaborator or a team member?\n\nI'm writing/producing with an artist right now who has submitted a medium/excellent vocal concept for a song. As co-writer and producer I feel that this is a great jumping off point but it's not 100% of the way there and it will take some refinement. They're very excited about it. And they should be, because it's elegant and it's exciting.\n\nMy concern is that they may rest on their feelings of accomplishment and not give it that extra push and exploration that I believe it needs to truly shine.\n\nWhat do you find is a good way to guide collaborators towards exploring an idea further and pushing themselves harder to really make something exceptional? I feel there are only so many ways that I can say \"I really like what you've done, but let's explore some more stuff\" without exhausting them or undermining the praise that I am giving them. How do I show them what's possible without micromanaging and writing it myself? It should come from within them and feel like it's theirs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1019111458749042700",
    "author": "TheBlur",
    "date": "2022-09-12",
    "content": "Another thing I’m sure a lot of us do; play the vocal melody on piano. See how it sounds. It’s easier to see flaws in a cadence or melody this way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034365067090735154",
    "author": "ehutton21",
    "date": "2022-10-25",
    "content": "Usually a change in approach is pretty conscious, at least for me. I know a lot of people have voiced like activity ideas or conceptual ways of working through things (cards I believe, was one thing) etc and while I think if that can help jump start a situation, I usually find that if a songwriting session needs a change of pace it’s best if I lead a discussion and ask some questions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034365865753325622",
    "author": "ehutton21",
    "date": "2022-10-25",
    "content": "Wil Anspach has been one of my favorite engineers to follow over the years, because he’s a very down to earth guy and he’s always got epic stories. I remember he described working with such a range of guys, and he pretty much described his number one asset as being able to just sit their and be an artist’s best friend who will talk shit till like 3 AM, passing a bottle and trading stories and then hitting record when something feels right.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061012551678312508",
    "author": "NoahNeedleman",
    "date": "2023-01-06",
    "content": "Basically when demos are turned in they’re expecting it to sound like a master, and most of the time they live with these demos so it either gets mixed or mastered as is, or they call in a producer to finish the track but keep most of the elements. Basically a demo should sound like a master, even if it’s just a guitar/vocal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061288739260874792",
    "author": "Deleted User",
    "date": "2023-01-07",
    "content": "That makes sense. Potentially, what I may need to do is to expand the ranges of what I can naturally do but if it doesn’t come to me naturally at a give time then it may be the right thing to do to politely decline the invitation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075386842586828800",
    "author": "rae",
    "date": "2023-02-15",
    "content": "@OJ I agree with everyone else in that collaboration could be an awesome avenue! I tend to write songs lyrics first, then everything else and have only once or twice come up with chords/gibberish in place of words first and then worked out the lyrics later - when I was stuck i found walking around my house  for an hour just singing random lines to that pre existing melody I created and recording everything on voice memos to go through later helped a lot!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075392408872816650",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "Maybe I'll start recording these gibberish vocal ideas down and saving them to a folder",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075392983295340544",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "Mos def. Mine all just live in my iPhone voice memos. If a few of them belong to the same song, I’ll make a project folder and throw them in there. Sometimes on an ableton timeline edited so the bones of the song are there to come back to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075426773531119748",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "Hmm, probably the likes of @BatMeckley and co could speak to this too, but the social skills ain't always the thing.\n\nI've been in rooms with shy/quieter people who are just incredible at what they do. In one case, on a very high profile session, one of the beatmakers literally didn't speak to anyone, ever. He was 19 at the time, literally only opened his mouth to very politely ask me for my email address so he could fly the beat into Pro Tools to cut vocals. But he was making absolute fire, and even though he didn't speak, you could feel a good vibe off him.\n\nI've also been in rooms with *unbelievably* obnoxious characters (the occasional particularly unpleasant example of that LA type we were discussing recently). Utterly repugnant as people, but their work is undeniable.\n\nI know who I prefer to be in a room with (and that really does count for a lot, in my experience), but in the speed dating world of pop music writing that a lot of people go through, you get all sorts. \n\nNot everyone is super charismatic of course, but that's just the world. Either way, 90% of the people I've met at the highest level are really delightful.\n\nAlso, my experience has been that the more accomplished the artist/writer/producer, the more lovely they've been. They've got nothing to prove, and perhaps at a certain level, anyone who's not truly undeniable has already been filtered out of those rooms by being a jerk on the way there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075453104482422986",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "I haven't tried co-writing, not exactly sure what that entails! Riiiiight so it's almost good to just get in with people to warm up your whole skills there before proceeding onto bigger rooms.. Makes sense.. I was invited to a studio in LA before and it was a fairly known singer and I couldnt make a beat on the spot, this was like 4 years ago now and I look back and can see my mistakes there (whilst shuddering from cringe)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075804056418799696",
    "author": "Ross Fortune",
    "date": "2023-02-16",
    "content": "That’s deeply awesome. I instated a routine of piano and singing in the mornings (keyboard lives in the studio, so I can’t do it before phone, but someday…) at the start of the year. I did it for a week and learned Hey Jude (I’m not a piano player, so it took me a few days to get it in the brain and the hands).\n\nIt was great, and I need to get back in the habit (sister act 2) for all the reasons you’ve described above. Thank you for the reminder!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076471570584842240",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "When you produce and write/record vocals of a song, do you send a pack out to potential artists / anrs or anything? Wondering how you ship them out to maybe be used...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076505462515712063",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "think as someone said (or maybe yourself haha) the other day just write and record when ur making the beat, as right now i sometimes make a beat and just sing gibberish ontop but love the flow/melody of the gibberish but going to work on putting lyrics down at the same time to get those reps in🙏",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076509267160485908",
    "author": "austenballard",
    "date": "2023-02-18",
    "content": "+1 for video call sessions, they're totally doable. It's worth figuring out how to route your DAW and microphone both into Zoom/FaceTime/Google Meet.\n\nOr just write old-school with a piano/guitar and your voice. Obv not practical for all genres but perfectly fine for pop, country, rock, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076712527037218816",
    "author": "masteredbyjack",
    "date": "2023-02-18",
    "content": "Hey Matt! Had a question…regarding all this songwriting. I don’t do it anymore, I just master but I am playing with a lot of these ideas applied to my own workflow…i.e. finishing things, focusing on my intuitive flow state…letting things just “come” to me.\n\nI saw you mentioned you’re applying the practice of scales/learning songs first thing in the morning, etc. I’m assuming that these things just “find” their way into your workflow when the time is right and you have grasped them.\n\nWhen you’re creating, how often are you actively trying to fit the song into some predetermined mold that you’ve set out? Or are you mostly just accepting what comes?\n\nI saw a great Bill Evans documentary where he said something along the lines of “just play what you can, and what you are, do not worry about if it’s complicated/advanced/etc…it’s more authentic to play something simple that you feel than something complicated just for the sake of it”…he was talking about jazz improv but I’ve tied it with much success into my work…when it’s time to go I’m only using things I know intuitively and not trying to force myself to be “better” than what I really am in that moment. I set aside other time to raise my skill set/potential with specific things (like scales, but for mastering haha)\n\nJust curious if this kind of stuff is on your mind and something you’re actively pursuing. \n\nI think it ties really deeply into the notion of “just write”…the skills and good music will come. \n\nBut your perspective is so valuable because you’re working on records with deadlines/commercial implications/expectations/etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138166336036552705",
    "author": "Nomograph Mastering",
    "date": "2023-08-07",
    "content": "“My brain was better than my muscles” on my gravestone please",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139619964253376673",
    "author": "TrashDoggo",
    "date": "2023-08-11",
    "content": "would love to have that book, as a new artist I have been struggling with my originality and having this fear of crossing the line between reference and stealing basically, many times I've found myself wondering if something I've written doesn't sound like something I have heard. maybe I can find it somewhere on the internet and buy it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1145742665770602517",
    "author": "lystell",
    "date": "2023-08-28",
    "content": "I hope it's OK, asking. We're writing a song in which we're singing \"black water\". English is not my native tongue and we're afraid that it doesn't mean what we have in mind. What connotations do you get from that?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153371532324782141",
    "author": "austenballard",
    "date": "2023-09-18",
    "content": "writers/composers: how many pieces of music can you get done in a day? I find I can do about 30 loops, 5-10 instrumentals, or 3-5 demos with vocals. I feel like I'm slacking though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153380062058532905",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-18",
    "content": "I was gonna ask what your use case was, but if you’re sending out a lot of beats it make sense! \n\nWhenever you collect an idea/beat to go through later, conceptualize it as sending a package to your future self. If there’s too much noise, or if you’re banking on your future self to do too much heavy lifting or filtering, the packages will not be useful to you and it will be a waste of time. But if you have a strong use case and a system for processing it in the future, as it sounds like you have, it makes a lot of sense!\n\nPersonally I like to only save the things that inspire me in the moment - mainly because I know I will lose inspiration if I go through too many things that don’t resonate later.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153385754463064124",
    "author": "cy (sigh)",
    "date": "2023-09-18",
    "content": "recent switch for me but I used  to just have dozens (sometimes hundreds) of things just sitting.  now i work on building kits and presets and in the process end up making stuff with them or at least getting one or two melodies out of it. \n\nmy main issue is that I get to a point where I start getting different ideas that I wouldn't want together in the same song /beat /inst \n\nwhen I get to that point I'll try a bunch of those ideas and keep the ones I like. after anything sits on my drive for too long without me changing it I open sessions up and export them as multi tracks, Stems or a 2 track (any combination I like really) and keep  them in specific folders. \n\nI'll flip through some of those in sessions (on top of anything I mightve made for the specific session). after a while of those being there. I move them toa diff folder which is linked to to my cloud service and let's anyone I share the link with download (w general guidekines for use) that way friends and ppl I work with can use them in their sessions or for fun. \n\nstart a new batch of stuff and repeat this process. some things I'm more attached to (for one reason or another) I might keep  longer to try to work on or pitch but that's it. \n\nup until maybe 5 months ago my process stopped after exportingthe tracks /Stems and using them in sessions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153457186228416553",
    "author": "oaklandmatt",
    "date": "2023-09-18",
    "content": "Like, I have to get detailed and make sure the snare drum cracks with the right high mid attack against the vocals, but I also have to listen to the song and just be like \"do I like this?\"\n\nOn the flip side, I have to create emotionally. Making beats and writing lyrics and melodies quickly and instinctually, then go back a week later and listen to all my ideas on headphones away from the studio. That's how I know which of them are still good.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153750398520275074",
    "author": "austenballard",
    "date": "2023-09-19",
    "content": "wonder how that squares with how @Josh feels and what I just said. I love discovering something new to me but that's been around for a while; I think time-tested records are much better for inspiration than chasing whatever's on the charts",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156007932455043122",
    "author": "austenballard",
    "date": "2023-09-25",
    "content": "an experiment in using GPT-4 to prompt some songs",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1156980706136834058",
    "author": "austenballard",
    "date": "2023-09-28",
    "content": "okay so i have a bit of a workflow going asking chatgpt for writing prompts (asking for a \"vignette\" works better than a \"prompt\") and then feeding that to textfx and then feeding some of the textfx ideas back into chatgpt and then using that for inspo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157720150347366402",
    "author": "austenballard",
    "date": "2023-09-30",
    "content": "Mostly using ChatGPT because I'm familiar with it by now",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177735379458203789",
    "author": "Rob Domos",
    "date": "2023-11-24",
    "content": "IMO for every piece of wisdom the contrapositive is also true. He told me an opposite story last night where he had 1 hour to finish writing a song before it was about to be recorded by Bing Crosby and Louis Armstrong and he was sweating bullets and had to just crank it out. Whatever he wrote down in that hour was ending up on the radio. Frankly I think the moral you’re getting out of this is not only not his point, but maybe not even a good virtue to hold if it leads to you releasing far less of what you love. (I myself am quite guilty of this and don’t mean to come down on you in anyway, it’s just the thoughts I’m having)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178402026200248442",
    "author": "Rob Domos",
    "date": "2023-11-26",
    "content": "It’s hard to say what is a step backwards vs forwards overall when speaking of all popular music. Often you have to sacrifice one virtue to gain another, but there are certainly valuable aspects of music that have been lost over time with popular music. Our melodies and harmonies no longer have long arcs where different points in the journey express different points on an emotional rollercoaster, which was a staple aspect of most classics from 80 years ago. Hell even 30 years ago Disney songs had beautiful arcs. Sing “part of your world” from the little mermaid to yourself and feel the rollercoaster of the arc in that hook. It’s magical. I think that’s a lot of what makes a song like Bohemian Rhapsody so impactful and we have close to none of it these days.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183696227947262013",
    "author": "ehutton21",
    "date": "2023-12-11",
    "content": "I keep a few midi prints for drum patterns that are common or familiar that I like using etc when I’ve got a melodic situation scored up. It’s nice because if I’m ever not driving but I have an idea I want used I can usually airdrop or email it quickly and boom.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186925659847675954",
    "author": "ehutton21",
    "date": "2023-12-19",
    "content": "Idk I’ve seen some low clearing rates, it really depends, I know DMG might be able to get a good fee (they also might have their own) but it’s also the Beatles so there’s that to consider. They might discount the clearance because the use isn’t exactly a high grossing project (or they might not be interested at all due to lack of return). \n\nBest of luck though and please let me know how it goes, im curious to follow this lead",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199473948597956669",
    "author": "Deleted User",
    "date": "2024-01-23",
    "content": "A couple of things I always do before and during sessions\n\nHave some things ready to play so collaborators can understand my background, and same with collaborators. I would ask them to play some things they did and grew up listening to so I can understand where they are coming from with decisions or comments they make. \n\nAlways set up so it’s ready to record. have a phone running on record whenever music is played and the computer isn’t recording\n\nHave a few small incomplete ideas at disposal before walking into the sessions. Could be a simple guitar chord progression with a little something on top, could be riff or banging drum patterns. Important thing here for me is to continue moving on to next ideas if I don’t get an immediate response (which is usually singing on top) and continue to work my way into it. \n\nI like to have full drums ready to go somewhere on my computer. So I can just import it in, and it will get people moving. Splice drum loops are fine too. Some sort of instant vibe is needed in my experience. Splice really helps with that, because then you don’t have people looking at the back of your head trying to dial in drums or synth patch for more than 5 minutes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199476568586715226",
    "author": "Deleted User",
    "date": "2024-01-23",
    "content": "I’ve tried different ways with hangs- I’m still figuring out. And I typically don’t touch lyrics anymore because I’ve found that I’m not that great at lyrics yet and if I don’t have a line (which I usually don’t….), it’s better to leave it be for the longevity of relationship because lyrics can be one of the most personal things in music making because… it is literal. If you are more lyrics person, I think you can get a lot of value out of hanging out. \n\nFirst thing is creating safe space- and it really depends on person to person. Some people never open up, some people can open up immediately. In my experience, the more experienced they are - the more they tend to be the latter. I think how much time you spend on it can be dependent on this. You mentioned wanting to be more intentional, one idea that came to my mind is communicating this from the get go. Obviously there are going to be times where bring this up can be weird in the beginning of the session, but it should get them to think about opening up as part of work at the very least. It needs to be done carefully of course\n\nThe other part of it is understanding the person themselves. Their general vibe and energy. It’s easier to tell with some folks, and it’s harder to know what kind of person it is with some other folks. regarding this, I find diving into work right away helps feel it out. my job is often to constantly create ideas and inspirations. I can often gather some information from how they respond to different ideas. \n\nLastly, I used to spend a lot of time hanging up until very recently and I found it’s so much more productive to just work and bond through that experience. Nature of work calls for connecting on a personal level, but it doesn’t require it. I’ve been trying to take it easy on getting closer with people, and focusing on the overall experience of collaboration and it has been making sessions more productive. So I plan on sticking with this way for a bit and see how it goes!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199782227190501517",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-01-24",
    "content": "I always try to ask myself what I can do so that artist wants to work with me again. And I don‘t wanna come across as another producer who cares only about making the next sick beat instesd of the song itself. I‘ve been told by a friend of mine that a lot of edm producers she‘s working with dont even put on headphones while she‘s tracking bc they don‘t give a shit about the vocal or performance",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200536583577817098",
    "author": "Rob Domos",
    "date": "2024-01-26",
    "content": "How finished would you say these sounded arrangement production wise?\n\nLike, are y’all using placeholder patches and scratches tracks when working at that speed or are you keeping enough that it’s at 90% day of?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200555098598821999",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "I go off the assumption that this is the only time I'll have this artist focused on this idea, so my priority is always getting a finished lead vocal and some ad libs. Those are the only things that can't be done without the artist there. I'll get the production together as much as it needs to be to get the artist excited about the song. \n\nThe challenge is doing this quickly, without spending unnecessary time going through snares and patches and shit. I find that nearly all of the best songs I've written happen in about an hour long window of excitement. Sometimes you can stretch and get harmonies or punch in some vocals beyond that hour, but the excitement of a great idea is exhausting and it's hard to keep everyone 100% engaged for a long period of time. If I'm on hour 2 of a song and we're still trying to decide if we like a chorus, 100% of the time it's not a good song (in my experience).\n\nA BIG mistake I make (still) is \"oh we have tomorrow we can take a break and come back.\" It's not about being able to get the artist physically back, but getting everyone back into the emotional space. So much of what I need from an artist is the emotional focused to commit 100% to a vocal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200575979916099655",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-01-26",
    "content": "When preparing songs/hooks for an artist in a session, what influences your decision making in the genre/sounds you‘re using for those? Is it literally anything you have written maybe the past days before or do you try to „guess“ what the artist might be looking for in a song/production or sound?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212436517159436368",
    "author": "Will Melones",
    "date": "2024-02-28",
    "content": "In college I got the opportunity to go listen to a bunch of Nashville songwriters play songs they'd gotten cut, and some of their performances were so much more compelling than the hit records. Gary Burr singing \"That's My Job\" about the death of his dad is a thousand times more moving than Conway Twitty singing it, but I guess it went gold and made somebody a bunch of money anyway.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220657576333545534",
    "author": "Marshall",
    "date": "2024-03-22",
    "content": "Do any of you guys fall into the trap of writing the same type of song over and over again? lol. I feel like when I’m improvising over a beat or something I tend to make similar subconscious choices in the melodic structure/melodic rhythms/etc. the only way I can get out of it is by setting parameters before hand (ex: don’t start the melody on the 1…..use an AAAB structure……..make the A sections complex and have their own micro-structures/use many types of rhythms,  use like 3-4 notes in the scale maximum and mostly dwell on a single pitch/don’t hit the “money notes” lol…..Make the B section almost completely one  consistent rhythm, use way more notes in the scale than the “A” and hit all the notes you didn’t hit in the “A” to resolve the melody)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221180463314632766",
    "author": "Jonathan Arnold",
    "date": "2024-03-23",
    "content": "(I am mainly doing pop, rock, singer songwriter)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221344091841892382",
    "author": "Jonathan Arnold",
    "date": "2024-03-23",
    "content": "But how do you get a beat there fast without loosing the drive and creativity",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221435603791646822",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-24",
    "content": "I was privileged enough to be a teenager during the 2010 club banger era. Back then I hated it but looking back it‘s fascinating that at every club I went to people who might not have been musically inclined at all could sing along every word of the songs of that era, think Hangover, DJ got us falling in love, all the avicii stuff even levels which is mostly instrumental. There seemed to have been something magical about those lyrics and that particular kind of songwriting that really resonated with people and created an unbeblievable sense of unity. If you‘ve ever been in a club with hundreds of people singing along to Hangover on the top of their lungs you know what I mean. Raw power. It‘s easy to dismiss those songs as stupid but there seems to be something primal about them that really connects with people",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221480854128431218",
    "author": "Herb🇮🇪",
    "date": "2024-03-24",
    "content": "James Blake and Bon Iver, my ears naturally tune to their lyrics and singing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222123583334121586",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "I have a hard time believing every detail of that melody was perfect without any thought behind it…..There is the joke that Some singers have “built in autotune” and can sing amazingly without editing and on the flip side I think some songwriters have “built in  melodic math” and don’t need to know any theory and can just improvise sick songs, which is definitely a real thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222125436583149649",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "I feel like the people who go into writing a song with the heart first are extremely valuable too. It’s like ying and yang. If you are improvising a chorus with a great song concept over a great beat, the melody falls into place……but if it doesn’t, why not use some theory/etc to understand why the topline isn’t just falling into place naturally? Could be a quick fix like switching up the rhythmic phrasing or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222128718562988042",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "Doesn’t seem any less automated than using a DAW to compose midi -> a vst imo. Just another tool to speed up the process",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222134368835735662",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "But I feel like the likelihood of improvising an incredible song is probably less than setting out to do it with a toolbox of ways to achieve it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222135108299915264",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "Maybe using a different method to write a song every single time you write is the best method, then comparing the outcomes after the fact",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1229683945499660288",
    "author": "Deleted User",
    "date": "2024-04-15",
    "content": "https://www.instagram.com/reel/C5TpPShsvpe/?igsh=MzRlODBiNWFlZA==\n\nI love people watching and listening/observing conversations, but never thought about using it for songwriting. And thinking about memories as a library is also trippy",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1231342360240193628",
    "author": "LIZZIE JEAN",
    "date": "2024-04-20",
    "content": "hi everyone, im new and a singer/songwriter 🙂 does anyone have any music out I could listen to and give feedback? I can also send my songs too 🙂 xoxoxo \nHave an amazing day",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242288956561817632",
    "author": "AJ",
    "date": "2024-05-20",
    "content": "Kind of a weird question for y'all. What do you think about using moments of silence in a song? The song I'm working on right now has it as a placeholder in a small spot. However, within the specific context it's in, I honestly like the choice and am tempted to keep it. That said, since I've never had any of my songs do that, it's harder to trust my gut instinct on this one.  Thus, I wanted to get some other perspectives on the tactic. I've also rarely heard songs that implement it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242669325576310784",
    "author": "rae",
    "date": "2024-05-21",
    "content": "Def go with your gut!! I love silences in songs and when I’ve heard this technique in recorded tunes it’s predominantly been in indie rock tunes from bands like The Strokes and Catfish & The Bottlemen & they have a pause for like a bar (i can find the songs where they do this if you’d like, can’t remember them off the top of my head haha). \n\nAlso, it’s becoming a thing in live performances too!! There’s a whole heap of vids on tiktok of Olivia Rodrigo, Maddison Beer & I think Taylor Swift too where they are doing a ‘mute challenge’",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287548237129056317",
    "author": "thegreatcarsoni",
    "date": "2024-09-22",
    "content": "Hey guys! sorry for the essay, got somethin on the brain i'm interested in your thoughts on...So i'm not much of a songwriter, and writing sessions tend to give me a lot of anxiety. it's something I'd like to get stronger at but don't totally have the bandwidth to dedicate resources to right now. Regardless, one of my good friends and I have committed to a sort of \"exposure therapy\" in getting together once a week or so to make stuff. My friend is an excellent guitar player and we've worked together in various capacities for a long time, but every time we get together the stuff he brings to the table is just balls out riffs and fanciful effects/tone that don't really translate to a seedling of a song. I have a hard time hearing where to take things or having a clear feeling about the sounds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356405098821189753",
    "author": "OJ",
    "date": "2025-03-31",
    "content": "I lay down some chords, maybe add a little beat.\n\nGet my vocal chain on. And sing sweet gibberish away for a while. I really enjoy this bit and I'll listen back to the gibberish like this sounds nice.\n\nNow - how on earth do you go creating good lyrics to this melody to make it real?\n\nI realise I'm not really thinking of anything when singing the gibberish, no story line but I tend to automatically say things like \"she\" so almost talking about relationship/love kind of stuff but not necessarily what I want to go for actually.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357591878664585217",
    "author": "spectrummasters",
    "date": "2025-04-03",
    "content": "….hey man , yeah what Brian said . A stem ripper . \nI didn’t want to say in my OG post much more so as to not bias a potential interpretation of Louie bells process , but what I was struck by was the simple brutal idea of just taking the proven best elements of others work as a foundation to begin building your own frameworks . \nWe ve spoken about it before in other channels with regard to using a  sample to write to and ditching it later , or reconstructing a track and letting it become something new …..I’d not thought of or heard of simply ripping hundreds of classic drums and taking them into a writing session before though . \nThere’s something so abrupt and utilitarian about that approach that I felt it might be helpful to anyone who is struggling with their own process , should they be trying to write all from scratch",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378784030954356860",
    "author": "OJ",
    "date": "2025-06-01",
    "content": "It’s going pretty well, just having fun with it and experimenting putting my ideas out there into the world. I’m not exactly trying to be an artist myself so allowing myself to write as if it is for someone else to sing is a fun way for me to write as it’s fictional",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1384999147958042826",
    "author": "Gabriel Tyranny",
    "date": "2025-06-18",
    "content": "Prompt for a fun question for the group: Is there a workflow that you’ve found to be a common denominator between your songs for how you write them?\n\nI’ve been writing songs for my current project by using a compilation of many notes, voice memos, journal entries, letters I’ve written then later converted to lyrics, etc. From there I used my current craft to sculpt them into each track that captures a theme, emotion, or something else that stood out to me.\n\nI often wonder how other active song writers put their finished pieces together. Is it as scattered as my process? Do they usually sit with an idea and write it linearly, line by line? A combination of things?\n\n\nI’d love to read other people’s processes and mindsets, if anyone would like to share.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385598496777965570",
    "author": "Brian Reynolds",
    "date": "2025-06-20",
    "content": "Reminds me of this extreme Edison example of accessing your dormant mind",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397679017900904569",
    "author": "bobby k",
    "date": "2025-07-23",
    "content": "Anybody running writing sessions in pro tools? Any tips or workflow things you can recommend? \n\nAbleton has usually been home base for this, I see it as a flexible scratch pad to throw down parts while the artist and 3rd are going in on lyrics. I’ll go over to pro tools once we have something concrete and start vocals, but it’s annoying doing stems in the middle of a write lol. I’m wondering if pro tools sketch is at all useful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1398609105748492348",
    "author": "Ross Fortune",
    "date": "2025-07-26",
    "content": "* Always sing to women - women buy 50% of all records, and make men buy the other 50%.\nYour song is a script to make the character look good to women at the worst possible time of day - 7am on drive time radio when they’re on their way to a job they hate, or they’ve got 3 screaming kids in the back of the car.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399506657876115567",
    "author": "Ross Fortune",
    "date": "2025-07-28",
    "content": "I certainly didn’t take them as a set of rules I’d follow, and admittedly I was being a little bit pot-stirry in choosing to present them as always/never statements. He does acknowledge himself that they’re not absolutes, saying “it’s not always the fittest athlete that wins the race… but they’re the one you should bet on”.\n\nSo maybe that was a touch irresponsible of me - for those out there who might absorb them at face value - but it’s all in the spirit of encouraging critical evaluation and generating discussion.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405934537938174033",
    "author": "Johnny I",
    "date": "2025-08-15",
    "content": "Working with a singer songwriter on a 4 song EP. The songs they want to record are all in G (with G as the home chord) and work well with their voice/thematically together as a whole.  \n\nIn a situation like this, would you suggest trying a capo to shift some of the songs into a different key (if it fits their range)? Or just treat every song individually and if they work best in G, roll with it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412523037307441225",
    "author": "Brian Reynolds",
    "date": "2025-09-02",
    "content": "\"There's a you-shaped space in my bed\nAlways you-shaped thoughts inside my head\"\nMark Ronson and Camila Cabello\n\nI love these types of lines in verses. Where you have multiple similar words and rhyming spots across a two line phrase. To me it creates this very delectiable ear worm quality. That starts to tickle at chorus quality. And as soon as you tickle that sensation, It disappears as the song moves forward. Makes want to replay just to experience that feeling again. Also love how its about a collective experience about missing a former lover in the physical world and thinking about them.\n\nAnd in classic fashion I've been signing the second line as, \"All these you shaped thoughts\" as opposed to apparently she is singing \"Always\". It should have \"always\" been \"all these\". Only realized my error when Googling the lyrics for this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463917316147515544",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2026-01-22",
    "content": "Maybe try and keep the lyrics but a different performance? Like the killers did",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463927412373852265",
    "author": "herbie",
    "date": "2026-01-22",
    "content": "yeah i think we might just have to do that. just sucks because all the energy is in the demo vocal and we were moving so fast i dont remember how we did the vocal hahaha. cant seem to get the same energy again when we re record",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471659916518490165",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "Note on writing every day - focus more on the nuts and bolts of the song, the chords and melodies and structure. The production side and extra layers can come later. If you’re taking more than 5 seconds to pick a snare sound, you’re not focusing on the right thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472555769869369490",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "idk what qualifies as a song or not.. but to this end, by chance before i got time to read everyone's response, i happened to turn a small poem and a few lyrics into a valentine voice note for a friend. by nature of simply singing it and imbuing it with melody it sort of became a song. in some sense, its that easy, and i am failing myself by not carving out the time and commitment to that every single day.\n\nperhaps what im asking is really a reflection of a lack of courage and patience/grit. where i'd like technical and direct feedback, i search for 'knowledge' and 'technique' instead of collaborators and mentors. where i am afraid to fail, i avoid the daunting task of putting ink on a blank canvas every day. \n\ni honestly fully agree and expected your answer to be the primary one!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472561810099142788",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "in hindsight the conversation got very high level, but i could have def brought up simple things like, what are signs or principles that help you CUT lines, or when to repeat things adn how much, or even generally how to be efficient and impartial when reassesing an idea. i find that when im inspired.. its quite easy to overwrite and over execute many potentially viable ideas for example. when it rains it pours as they say. \n\nim gonna be taking in and applying everyones input. but perhaps at some other time, illl bring up a topic you guys have reminded me of as well, in regards to even re-experiencing/re-performing your own ideas and succesfully capturing that magic of the first take which seems so hard to do, and antithetical in some ways to the idea of how writing happens often, as opposed to recording.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]