[
  {
    "id": "1070577147955118162",
    "author": "cian riordan",
    "date": "2023-02-01",
    "content": "Contrary to a lot of good advice here, I would rather be slammed busy mixing below my ideal rate than making a higher rate doing less work. I realize it's silly, but I take comfort in staying busy and keeping my 'pirate ship' afloat. I definitely have a bottom line, but I like to work with artists to meet them at what they can afford. It keeps my work portfolio diverse and my toolkit in good working order.",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1103744625895809114",
    "author": "popaganda.",
    "date": "2023-05-04",
    "content": "Same. I crop-cycle. And I would be depressed if I had to let go of writing or playing out etc for mixing full-time. Specializing is the right move for some people, and in some ways it’s easier to market/brand yourself if you just do a thing, but it’s not inherently better. I love all the parts of the music making process",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1122175319932149860",
    "author": "masteredbyjack",
    "date": "2023-06-24",
    "content": "Gonna circle back with more later, but this is my 2 cents (I started mastering with zero clients about 9 months ago)...\n\nGet over your fear/insecurity/weirdness of not having a portfolio. Go fuck it mode. You need to have a ton of contacts. Take a lot of shots. Of course I have no idea about what you are doing currently...but zero people I've ever talked to in this situation have taken enough shots. \"I reached out to 5 people this week\"...no. HUNDREDS. Most people will ignore you. But just keep going. Watch a Goggins video before you start or something haha\n\nReally think about the experience of working with you. Is it amazing? Is it easy? Is your communication, care, intention incredible? Even things like how files are named/delivered/etc matters. You can only be as good as you are at mixing until you get more reps. But you can control how you interact and the professionalism and confidence you can inspire on the other side.\n\nIf someone lets you mix a song...are they coming back? They need to if you are going to have a business doing this!\n\nSorry to be prescriptive here...but I've seen this question asked of me enough to know that it's so so hugely about just brutal persistence in many aspects, assuming you have talent, etc to do the actual thing.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1252689092358180925",
    "author": "cian riordan",
    "date": "2024-06-18",
    "content": "Man, sounds like you're doing the thing and you've got a great head about it. My only notes would be to start thinking about the 'work' that brings the least value to your career (and your life) and figure out ways to get that off your docket -- whether thats farming it out to assistants or just letting go of projects that don't make as much sense. I was not handling things this well 10 years ago when I was your age.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "980342386586705930",
    "author": "Slow Hand",
    "date": "2022-05-28",
    "content": "Let me begin by saying that your feelings and experiences are more common than you may realize. It's alright to feel that way. Though I don't believe it's constructive to dwell on them.\n\nIt's not unusual to feel inferior when surrounded by people who are more experienced and talented than you. We've all felt this. The thing is this; you are in exactly the right place and will only benefit from engaging with this environment. Being surrounded by so many professionals and people with experience is absolutely a benefit to your development and someday you'll look back at how far you've come and be amazed by how fluent you are.\n\nLet me drive this point home just a little more: When you were young and learning your native language, nobody put you in a room and expected you to learn the language by conversing with a bunch of inexperienced two year-olds who couldn't speak. Instead, you were surrounded by expert speakers and learned through interactions with people who were leagues ahead of you in their ability to speak the language. Learning to speak is not an easy task, but by immersing yourself in a community of experts you are on the path to mastery and in no time you'll reap the benefits of that exposure.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "976392126038409256",
    "author": "Slow Hand",
    "date": "2022-05-18",
    "content": "I think it comes down to ear training, lots of repetition (mixes), and focused practice. He's very familiar with the characteristic sound that each frequency zone imparts on a given instrument and has mixed most instruments enough times to know how to achieve a given effect without having to hunt for it.\n\nOn top of that, he's probably thinking an order of magnitude higher than that because he would also understand that if he wants to accentuate a given frequency range in an instrument then he can do that by subtracting that frequency from an adjacent instrument. In this sense, I think he's listening closely to the effect that a cut has on every other instrument in a mix - not just the instrument he's subtracting from.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1103362928360562842",
    "author": "hyanrarvey",
    "date": "2023-05-03",
    "content": "You’ll learn more about mixing by recording an album and then mixing that album than any youtube video or class ya gotta do the thing",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134748809151381574",
    "author": "Barbara",
    "date": "2023-07-29",
    "content": "Man, my eyes lighten up when I think about setting up an analog session 😍 have fun, @Zack Hames  ! I feel really lucky to work in a studio where we still do analog sessions and to learn from people who have worked with it their whole career. Being an enthusiastic assistant, usually, it's on me to calibrate and prepare the tape machines and the sessions, so if you need any help with that (I certainly did, the first few times I've had to deal with tape... stuff), let me know!\n\n(Edit: Wrong Zack tagged)",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1170445646973644930",
    "author": "Jeremy Klein",
    "date": "2023-11-04",
    "content": "i never listen to my past mixes because im too scared ill hear something that will make me rethink my career choice",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "979112435967492156",
    "author": "peterlabberton",
    "date": "2022-05-25",
    "content": "I’d echo a lot of what’s been said, but add that, I think looking back on my own intern days, a big reason people took me under their wing was they could tell I was obsessed with learning how to produce/engineer. I really didn’t have much to offer besides being a warm body in the room that could go get a Red Bull down the street for the band or coil a cable, but I made it known that I was super dedicated. (And managed to do so in a way that apparently wasn’t too annoying to be around.)",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1236960609808023573",
    "author": "yaldaram",
    "date": "2024-05-06",
    "content": "Try to prove that you have good work ethic and valuable skills in a sincere way. I met my boss on instagram, asked good logical questions to him and he answered. Because he helped me I decided to help him too and made english subtitles for the covid era youtube channel project he had. Thats how we get to know each other. I visited his studio and said I wanted to work with him (bought some coffee and moka pod as a gift :D)  and he accepted. I thought my story can be an example.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1256460951553572978",
    "author": "cian riordan",
    "date": "2024-06-28",
    "content": "Someone calling you a dum dum and you feeling like a dum dum are different things here. I have the pleasure of knowing Ruairi and many others here in real life and can say he’s coming at you with all the love and compassion you can get from an extremely talented person wasting his time on a dum dum internet discord. \n\nTo be fair, your posts have been a scatter shot of ad hoc questions and musings about gear and techniques… and that’s totally cool, you’ve done no wrong. But this place is a few years old and has a great track record of giving folks of all walks a real platform to dig in a little deeper — much more than the typical audio engineering forum offers.\n\nYour enthusiasm is rad and so, so welcome. But if you’ve got the time, try digging into some of the pinned posts to see the kind of detail and experience is being shared… it’ll help you curate your thinking and questioning to make your experience more valuable here — both to you and everyone else.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "811350866401558540",
    "author": "cian riordan",
    "date": "2021-02-16",
    "content": "Yes, I have my lawyer stipulate correct drum panning in contract before I even receive a session. I'm trying to run a professional operation over here.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1194391644288602192",
    "author": "cian riordan",
    "date": "2024-01-09",
    "content": "Making the jump from working on music for local bands to making music for bigger commercial acts was obviously a big move forward. What I realized very quickly is that the process is fundamentally the same with people of all levels. You get in a room, you make a plan, and you execute it. However, when you've got a major label backing you, there's many more resources available, enabling you to spend more time (and money) making the record... although in my experience this can be both a blessing and a curse!\n\nI assisted Eric for a few years and eventually started networking with more local Los Angeles artists and was able to mix and produce their stuff out of Eric's studio. He was very cool about letting me use the space when we weren't working on bigger projects. He set a very high standard and made it clear that anything that left our studio had to sound really, really great. After assisting and working on my own stuff for several years, Eric then hired me as his full-time main engineer and now I'm on call to work on him for any of his projects. This has been amazing in so many ways as I get to work on high-level commercial music and apply all of my own sensibilities to the process – as well as the stuff I've learned from Eric over the years.\n\nObviously my tale is one in a million and there's not a day that goes my where I don't realize how lucky I am. Now that I've worked full time recording music for almost 8 years, I've realized there are certain things you need to have to be successful:",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1195922281864626276",
    "author": "NoahNeedleman",
    "date": "2024-01-13",
    "content": "Organize, retitle, color code, group, quick gain staging/leveling to get all the loudest parts of the song hitting around -3db, import any templates I wanna work from. All the things I’d have my assistant do if I wasn’t my own assistant.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134153184382828564",
    "author": "BatMeckley",
    "date": "2023-07-27",
    "content": "He also has the super rare ability to admit he was wrong about something and course correct. Good person for advice.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1252678960714879008",
    "author": "LAPhill",
    "date": "2024-06-18",
    "content": "I have plenty of thoughts about all this, will try to respond later. But you're at an exciting point in your career, it sounds like, and what might feel like overwhelming stress may well be the friction that comes with the cusp of success and new challenges. \n\nAlso, what's MJM?",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1254914170390843494",
    "author": "Adam Thein",
    "date": "2024-06-24",
    "content": "I’d also say this doesn’t have to be an all in thing - challenge yourself to keep the 40 hour job and work on music for 15-20 hours a week on top of that.  In reality if you are just starting as a freelance engineer or if you are trying to make your own music career as an artist you will be often working 50, 60+ hours per week",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1398416582526632027",
    "author": "NoahNeedleman",
    "date": "2025-07-25",
    "content": "This is a constant in record making. Balancing your own thoughts with those of your client or collaborators. \n\nCian is right on of course, but I’d encourage you not to think of it as binary. Almost always, there’s a version of their note that makes the song better, and it’s your job to hear it. \n\nIn the end, it’s their record tho, and they’re the ones who will be playing it out, selling it, promoting it however they can… so they’re the ones who *need* to be happy with it in the end. \n\nMy longtime producer & collaborator Jon Kaplan used to say “it’s your record, you can be wrong if you want to.” I give that to artists I work with now. Going in I tell them I’m going to treat you like an equal, until you tell me it’s your record and you can be wrong if you want to. \n\nHonestly that one idea has eased the tension on so many occasions for me.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1459021704171884545",
    "author": "cian riordan",
    "date": "2026-01-08",
    "content": "Eric interviewed my for his YouTube channel a while back and the last question he asked me was poignant: \"how do you go from being an assistant to a successful  career in music?\" I told him something to the tune of the best thing that ever happened for me was to stop working for him.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069277345107689522",
    "author": "BatMeckley",
    "date": "2023-01-29",
    "content": "No, definitely don’t. Please. For the love of God. Don’t. \n\nMaster bus processing to this day still suffers from poor delay compensation, across a variety of daws. You’ll be sending him a 2 track that does not line up with your session, and the ensuing vocal you get back will not line up with what you’ve recorded. Pocket will be off. \n\nThis has been THE SINGLE biggest nightmare in my career as a vocal producer. Please. If at all possible, leave the master off. \n\n(Unless you do the square wave trick at the end that will allow him to precisely align the files)",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1194391615490506852",
    "author": "cian riordan",
    "date": "2024-01-09",
    "content": "I started getting serious about recording while I was in college (studying chemistry). I was playing bass in a band at the time and I was the only one that had any sort of decent recording equipment. I found myself being the guy recording all of the band's demos before we went into a 'proper studio'. Eventually, we realized my demos were sounding better than the ones we paid other people to record! Meanwhile, I started assisting (for free) at a local small recording studio and met a really great mentor. The studio was small and its business was mostly weekend warrior type stuff – nobody really notable. That being said, it was a working studio – and booked almost 6-7 days a week. The producer was the big fish in the small pond and had a great repeat clientele. Most of the music was not my cup of tea – but this proved to be a good thing as I was exposed to all sorts of different styles and it allowed me to be comfortable in genres of music which I normally wouldn't gravitate towards. It just made me comfortable around music and musicians in general.\n\nOnce I graduated and decided I wasn't going to use my chemistry degree, I ended up helping the producer build a bigger studio complex from the ground up. I learned an insane amount of stuff during this period – whether it was researching which Pro Tools system we would need to helping design the wiring layout to actually implementing it all. Ultimately, after months of hard work (and lots of borrowed money) the studio was complete and it was ready for business. I worked here for 2 years or so until I got introduced to Eric Valentine through former Street To Nowhere guitarist Matt Radosevich in Los Angeles. He needed a new full-time assistant and so I hopped at the opportunity and moved to LA – leaving behind the studio and crew I helped build (they're still going today and they're doing great).",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1254910284515246193",
    "author": "Nomograph Mastering",
    "date": "2024-06-24",
    "content": "I’d also say that very few people Logic’d their way into music careers",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1352689511770882211",
    "author": "Rollmottle",
    "date": "2025-03-21",
    "content": "Unless @Brian Reynolds is an electrician, I think these questions are best for a professional. Household electricity is not something to trust to Google’s AI summary. Your friend should consult a pro.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1410383162621562890",
    "author": "youngteam",
    "date": "2025-08-27",
    "content": "I’m an extremely mediocre vocalist but got some professional lessons a few years back. Asides from warm ups the thing that really stuck with me was to not try and correct to make it sound good to my ear, but to learn what it feels like to sing properly",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1005883899114700930",
    "author": "NoahNeedleman",
    "date": "2022-08-07",
    "content": "https://m.youtube.com/watch?v=2k8fHR9jKVM\n:39\nJust for proof that our eyes are liars and our ears are gullible.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033540056566222898",
    "author": "Slow Hand",
    "date": "2022-10-22",
    "content": "A strong second on this. I'm not someone who interacts with many kids on a regular basis, but I've felt a similar openness and lack of inhibition during my experiences doing improv comedy. It has so much in common with what we observe in children. Finding your way back to that state of non-judgement is such a worthy pursuit.\n\nImprov education places such an emphasis on not being precious about things, accepting what's happening in front of you, and not overthinking. Most of all, the biggest lessons were always about *listening*: Listening to your partners, listening to their intent, and listening to the audience. There is no time to plan. You just do.\n\nI did it for two years and it was one of the most rewarding experiences of my life. The improv mindset really enriches everything else in your life once you open yourself up to it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070559657267056670",
    "author": "Zack Hames",
    "date": "2023-02-01",
    "content": "I definitely fear not working; being and simply appearing busy, working with more people, building reputation, these are the things that I have seen visible gains from. I think I fear losing that.\n\nI’ve talked about this before, but when I did an UnFuck Consult, Rauri and Spider told me I need to be working in more high stakes situations and to not spin my wheels on low quality projects. I took that to heart, stopped doing work for free, and started being choosy about working with people I’d NEED to “kill it” for, or would feel intimidated or out of my league, etc. this paid off immensely even though it was quiet for several months.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070726984746930208",
    "author": "Will Melones",
    "date": "2023-02-02",
    "content": "My take is, yes, push your *friends*, show them the difference you can make and they will never look back. For artists you're just meeting, it may be a tough sell, and perhaps you're better off looking for the ones who already know the value of a mix. Those people are looking for what you offer.\n\nBut I'm not the person who should be giving this advice, and I'm the absolute worst at putting it into practice, so take it with a grain of salt.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1096661841465319434",
    "author": "Nomograph Mastering",
    "date": "2023-04-14",
    "content": "But mostly I was not shitting on YouTube, I was encouraging @austenballard to use his racehorse mind on the racetrack, and not at the dump",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115671853189566494",
    "author": "oaklandmatt",
    "date": "2023-06-06",
    "content": "100 Gecs \"mememe\" gets to -2.9. Sounds incredible. No transients of course but it's an outstanding track.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1154856614822682684",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-22",
    "content": "Great answers all, thank you. And if you do come across any strong online learning stuff that seems like they could be complimentary, I'd love to check it out. \n\nBecause most people reaching out to me do so online, I get this feeling I have to give them online resources, but referring to real-world education is a really good shout. Appreciate yall ♥",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1183807567189786634",
    "author": "tomtom",
    "date": "2023-12-11",
    "content": "I've had a few interns come through my little production studio. The best ones knew when to stay out of the way and when to pick up a soldering iron and start fixing cables. The worst one vampired an entire croissant tray before the client showed up and took 5 minutes to set up a mic stand w/ a 57 on it. To echo the others- ask how you can be helpful (and double echo the advice to brush up on basics on your own). I recommend keeping a notebook- shit moves fast and you won't remember everything. Keep tabs on fussy gear (especially if multiple producers or engineers are using the space and aren't as familiar with it). Be a cable-wrapping ninja and know how everyone takes their coffee.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1254905844487950356",
    "author": "LAPhill",
    "date": "2024-06-24",
    "content": "Noah covered a lot, but a few (also stream of consciousness) thoughts to add:\n\nThere is no formula to when to take the leap. It's helpful to have some money in the bank, because it's going to take awhile for things to start happening. The more connections you have, the more in-roads you've made, the easier it will be to drum up work in music and keep the lights on. The less responsibilities and overhead you have, the easier the beginning stages of freelance life will be.\n\nDon't think about your music career in terms of the same metrics as your day job, you're burnt out on it for a reason. So instead of \"am I making what I made before,\" think \"can I survive on this for now?\" and if not, \"what will get me to a place that I can afford to pursue this dream?\"\n\nAny music job can be a boon for your career, and chances are you don't know where the opportunities will come from. The Beatles became the Beatles by playing cover songs at shady clubs, honing their sound and learning to play with each other. For someone else, that would've been a mindless, thankless gig with no upside. When they started playing better gigs, they were ready and stood out because of it.\n\nHow you do anything is how you do everything - if you're an intern at a studio cleaning up trash, you may be around huge artists and engineers. If they see you as dependable, friendly, going above-and-beyond, there's a tiny chance that a life-changing opportunity could emerge. Likewise, if they see you doing a sloppy job, that's how they're going to assume you'd be in the room, too.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1275806802965168248",
    "author": "lystell",
    "date": "2024-08-21",
    "content": "Not 💯 related but also.\nI love YT and Puremix and all that. \nI love to do stuff for practice. Like, I’m gonna take this recording and try that Gudwin thing.\nBut when working on a song, I always end up at a better place when I try to leave all this things out of my consciousness and just go with the flow. \nI’ve tried to shoehorn in so many things just because Shawn Everett did them.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1289562151928987710",
    "author": "NoahNeedleman",
    "date": "2024-09-28",
    "content": "Looking forward to other answers here, but considering that 700-2k is the so much of the sound of the electric guitar I’m much less inclined to scoop there.  In fact if the guitars only lived 700-2k I bet your vocal would pop easily. (Hard to tell without source material of course.)\n\nBut, philosophically, it’s way more about panning. You guitars can be huge if they’re on the sides.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "812301647614836776",
    "author": "rae",
    "date": "2021-02-19",
    "content": "Not to do with recording but something I found interesting in terms of mixing backing vocals was the approach taken with John Mayer’s single ‘New Light’. Super pop-y vibe but they used autotune as an instrument and flattened his backing vocals to sound almost synth-y, this blew my mind and made me stop hating on autotune so much haha. Interesting lil 8 minute vid on YouTube where he explains this process (he starts talking about the backing vox at the 6 minute mark if you wanna skip ahead).\n\nhttps://youtu.be/u03DZEaSewM",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "812463559719387137",
    "author": "Slow Hand",
    "date": "2021-02-19",
    "content": "Mmhm. I feel like this is also a really good example of what I’m talking about: https://m.youtube.com/watch?v=C4xgHB_uT6M",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "926978242848637009",
    "author": "cian riordan",
    "date": "2022-01-01",
    "content": "If anything an external clock on a single converter will introduce more jitter because of coax cables than using a decent internal clock.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1002251867335696384",
    "author": "Ross Fortune",
    "date": "2022-07-28",
    "content": "Not a question, but an attempt to give something back. Over the last 7 years of engineering in studios of all kinds on a wide variety of projects, I've built up a bunch of recall notes + photos / tips that I picked up, all gathered in Evernote. Some of them will be audible in commerical recordings. I've wanted to formalise them to share in some way for a while, so I'm wondering if the people here can suggest the most useful and accessible way to do that.\n\nIn a perfect world I'd do YouTube videos for them all, but I just don't have time to commit to that. A reasonable tradeoff might be to build out a reference section on my website (what I've been calling... The Cookbook), and leave it there for ever more for people to pilfer from.\n\nWhat say ye?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1057644736971817061",
    "author": "Ross Fortune",
    "date": "2022-12-28",
    "content": "**Orchestral/Scoring**\n\nSpitfire Audio - obviously focusing on their own products, but they are excellent and the tutorials are made by real life working composers, with interviews, studio tours and workflow suggestions - https://www.youtube.com/@spitfireaudiollp\n\nSpitfire’s Christian Henson - as above, but from his own account - https://www.youtube.com/@ChristianHensonMusic\n\nJunkieXL (Mad Max Fury Road, Hans Zimmer protegé) walks through projects, gear setup, music theory, professional practice stuff - https://www.youtube.com/@junkiexlofficial",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1089063680647376958",
    "author": "peterlabberton",
    "date": "2023-03-24",
    "content": "\"Facial area\" just jogged my memory to some venue in SF where the promoter (in the years before the internet!) kept a log of all the funny PR packages he'd receive in the mail from bands, and had them organized in various categories. One was \"facial consequences\": \"OUR BAND WILL MELT YOUR FACE OFF WITH OUR RIPPING SOLOS AND RAW VOCALS\", etc. etc.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1103359043600396378",
    "author": "Nomograph Mastering",
    "date": "2023-05-03",
    "content": "I see zero information that could help us help you. Are you 15 or 50? In LA or sub Saharan Africa? Are you working professionally in music right now, actually making a living or do you have a day gig?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1131665840853483660",
    "author": "Edsel Holden",
    "date": "2023-07-20",
    "content": "Very similar to Cal - but a long time ago someone told me to seek out full Rez waves of songs and use a HPF and LPF to see where they sat things in the frequency spectrum. \n\nSome songs the cymbals will go away when you filter below 10k, others you will need to filter to 5-6k.\n\nDo the same on the lows filter and see what goes away. \n\nIt’s very similar to what cal said but all you need is any EQ. And your listening for what goes away. I still do it sometimes. It’s a great practice.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133965202858193058",
    "author": "peterlabberton",
    "date": "2023-07-26",
    "content": "Highest lufs, of course",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1170878899912187977",
    "author": "Ingmar Carlson",
    "date": "2023-11-05",
    "content": "i actually have a running list of songs i've been meaning to re-mix as \"practice\" mixes. gigs i've lost or mishit are at the top of the list of course. haven't really had time since the height of quarantine to actually do any of them, but still keeping the list going",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1199125759562891414",
    "author": "Ross Fortune",
    "date": "2024-01-22",
    "content": "Curveball for you. Genre and context dependent of course, but often I’ll deliberately avoid fixing “mistakes” unless they really break the spell or otherwise grate on me as the mix wears on. It can help keep me from excessive tuning, timing etc and ironing out humanity.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1225155351863623822",
    "author": "LAPhill",
    "date": "2024-04-03",
    "content": "In my time as an assistant to three different composers, and then working as an additional composer for a few more, I found equal value in the things I didn't want to adopt as much as the things I did learn. It's all part of taste making and discovering what makes you unique.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235645200756379657",
    "author": "cian riordan",
    "date": "2024-05-02",
    "content": "Lots of concentrated advice from working professionals here -- take it or leave it.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1257411941148921936",
    "author": "LAPhill",
    "date": "2024-07-01",
    "content": "Speaking of the evolution of the trap kit, Wynton Marsalis has a great talk on the matter: https://www.youtube.com/watch?v=u1jnbeKxf7I",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268622918129160253",
    "author": "Nomograph Mastering",
    "date": "2024-08-01",
    "content": "Save some time at the end of the day to launch your YouTube mastering channel selling courses",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345057227207086240",
    "author": "Ross Fortune",
    "date": "2025-02-28",
    "content": "Of course depends on the tempo, part, sound of the drums, aesthetic of the track - but a few things that have worked in different scenarios for me:\n\nCreate the impression of some distance to walls by sending snare (start there, maybe add other mics) to a short stereo delay. Often something like 90ms on one side, 120ms on the other. Feel it out on one side, then add some time to the other.\n\nTry adding some fake distance to your existing room mics with a simple delay with no feedback (there’s a Steve Albini drum video on YouTube where he demonstrates this). You can delay both sides equally, or solo one side, delay it til it feels good/sounds cool, then do the other. Anything from 12ms-around 23 seems to work. From there things start to become more like a slap, but than can be cool too.\n\nSmash up your existing rooms a bit, or a lot. Omnipressor, Devil Loc, UAD Zener, decapitator, Rough Rider (free), Arousor/Distressor in nuke, Lo-Fi. \n\nSend to a gated verb - Cian shared a drum session a while back with a short VintageVerb preset that’s often useful. RMX16 Non-Lins can be good too, although it’s easy to bring things into 80s territory this way.\n\nSend to a short room verb like ocean way, SP2016, Pro-R, Valhalla Room, Raum. Sometimes from close mics, sometimes from overheads, sometimes just slapping it straight on room mics. A little distortion (Decapitator, Devil Loc) after is often helpful.\n\nWith all of these solutions, the thing that seems to help them gel with the rest of the real kit is drum bus processing - compression and/or saturation.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "810268654775828511",
    "author": "oaklandmatt",
    "date": "2021-02-13",
    "content": "great answer! @Zack Hames it's worth playing with different distances to see how it sounds in the context of each song. just make sure you match gain because of course being farther away will be lower in volume. but you may find that a little bit of room bleed in a song isn't so bad, and you might like the balanced tone better being a few inches away from the mic. I've been playing with this effect for about 25 years and even yesterday had an artist at the house where we did vocal takes at different distances from the mic. never stop experimenting and learning!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "818963181430112287",
    "author": "Slow Hand",
    "date": "2021-03-09",
    "content": "https://www.youtube.com/watch?v=bQRzrnH6_HY",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "888788813307068416",
    "author": "Zakhiggins",
    "date": "2021-09-18",
    "content": "I find it's kind of like physical exercise, your long term improvement is never linear, and as you get more experienced, you need to be smarter with how you practice if you want to progress.\n\nWhat helped me improve guitar was treating it like a gym programme, pick a specific thing for a specific amount of time to practice on a Monday for example, and do that every Monday, then have another thing you practice on Tuesday etc etc. Take videos to track your progression over time. Showing up and doing it consistently over a really long time will be infinitely more valuable than a few really intense sessions here and there",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "888793610571640832",
    "author": "Josh",
    "date": "2021-09-18",
    "content": "Yeah this 100%. Can’t wait to get back to it. Everyday I’d practice something when I was doing metal constantly.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "944469295805644831",
    "author": "NoahNeedleman",
    "date": "2022-02-18",
    "content": "If you’ve got the cash, +1 for the KSM 8 or 9. I tour as MD for Brett Young (country artist) and we’ve gone through the ringer looking for the perfect mics. Of course it’s different for everyone, but we like the KSM 9 on everyone in the band. We’re playing mostly arenas tho, and the drum bleed situation is real in smaller venues. The hypercardiod capsule helps with rejection, but size of venue really dictates usefulness.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1005844109178708118",
    "author": "Zack Hames",
    "date": "2022-08-07",
    "content": "Practice practice practice. It gets easier with time and experience. \n\nAlso reliable monitoring makes it easier! Good question though",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1028829709095673887",
    "author": "Nomograph Mastering",
    "date": "2022-10-09",
    "content": "Be the kind of engineer who tests these things yourself (the internet is wrong about 99% of things audio)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1043703831910944898",
    "author": "ALXCPH",
    "date": "2022-11-19",
    "content": "Being prepared shows that you are professional and will usually make building up some trust and confidence a little easier",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1061463456844365954",
    "author": "Rollmottle",
    "date": "2023-01-07",
    "content": "It's explained in the first installment of the Conversation series https://www.youtube.com/watch?v=C10NSFdxa-w",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121932672374145146",
    "author": "Deleted User",
    "date": "2023-06-23",
    "content": "If you also produce and write, you could try building your portfolio as a mixer using your own songs. You can collaborate with a singer/artist, or bring in AI vocals on the songs you wrote. \n\nIf you record bands, you can take the recording you did and mix it even though your job was to just record. Show it to the band and see what they say, ask them if you can use it as part of your portfolio. Make sure you ask !! \n\nYou can also build relationships with producers with similar experience level as you and offer to mix their stuff. Producers can bring you a lot of work because they work with multiple artists\n\nIf you have other stuff that you’ve mixed in the past but they are not the best representation of your current skill level then mix them again so you can include them on your portfolio.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1122194838884986952",
    "author": "masteredbyjack",
    "date": "2023-06-24",
    "content": "Glad to hear it! There's a huge part of the discussion we are leaving out about ambitions, goals, etc, I posted that as much for you as the many others I see get frustrated too. So I like to challenge, sorta how @Nomograph Mastering does sometimes. The frustration solves nothing. But it's a data point. If what you are doing isn't working, it's time to change and adapt. The world isn't fair, mostly no one who would hire you actually cares about how you are feeling or what's happening in your life. Or even some sense of loyalty for what we have done before. Do we bring value? And how can we bring more? That's all that matters really. And it is brutal and hard. It still very much is for me too. But I'm on the Goggins tip and I sorta love that about the game. \n\nSo I guess it depends on what your long term creative and life goals are if filling the calendar is a worthy goal of course!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1183680843135340554",
    "author": "Rob Domos",
    "date": "2023-12-11",
    "content": "I’ll echo Ruairi’s point one more time. If you’re curious about something you want to know, I’d first look for the answer online, and if you can get a good consistent answer from google / chat gpt / YouTube where all sources are agreeing on the answer, then maybe you don’t need to be asking that question to these producers. Ask them the questions you struggle to find answers for online",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1185691214482243696",
    "author": "Nomograph Mastering",
    "date": "2023-12-16",
    "content": "Also my interview with Dale at Just For The Record’s YouTube is good",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1199138027474268233",
    "author": "Adam Thein",
    "date": "2024-01-22",
    "content": "You mentioned it already but one of the only consistent rituals for me is trying to split up the \"mix assistant\" type work on a different day if possible or at the very least with a break that involves leaving the room and doing something completely unrelated for a while.\n\nOther than that pretty typically starting from drums/bass/vocals and trying to fill in around that.  But that's on an ideal day for me - more often it's just getting excited about something I heard, getting an idea, and playing around with the mix a lot.  I'm pretty early on in the journey with mixing relatively but realized I was getting burned out already if I didn't continue experimenting and playing around with a song the way I did when I first got interested in this in the first place.  Usually trying new things on every single mix because I have the luxury of usually not being up against the clock working on indie releases.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1254820989330657340",
    "author": "Adam Thein",
    "date": "2024-06-24",
    "content": "Case dependent on song of course but generally 3 phases\n\n1) Clean - clean up obvious issues, noise, excessive low end, overly roomy, overly dynamic (sometimes completely raw like this might have 20-30db or higher swings in dynamic range between sections) clip gain\n\n2) Dynamics and EQ in track context - compress and EQ how you usually would for what's appropriate\n\n3) Stylize - effects, saturation, stylized EQ",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266023796574523402",
    "author": "montrose recording",
    "date": "2024-07-25",
    "content": "my 2 cents is - its most definitely not the best!  its a great test in a known, real world space that can tell you alot about how you mix translates, and to a certain degree, how your monitoring situation is in your studio.  its a good test for getting out of the studio, off a screen and listening in a very very different environment physically and mentally.   i think lots of cars sound pretty bad - worth doing listening in any car situation before referencing your work just like you would in a new studio environment",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1267291759092699136",
    "author": "BatMeckley",
    "date": "2024-07-28",
    "content": "Is it cool if I have a listen too?\nThis entire discourse from the very beginning feels like doing absolutely anything and everything to avoid putting out any music (and therefore having to stand behind it). I’d be more than happy to be wrong, in fact I had a real project where the click being off was a real impediment that we had to figure out and overcome to get the record across the finish line. But that was a very specific case, and I don’t know that this feels the same. So, any chance you can dm me a link so I can make a contribution with context?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1269316508631306271",
    "author": "chrissorem",
    "date": "2024-08-03",
    "content": "😂 yes  very true. One thing I’ve always done in practice of learning and experimenting and this applies more in a tracking situation.  Is to use what I know for sure will work and in addition add something odd or something I’m curious about without tying my hands",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1282536000165380148",
    "author": "cian riordan",
    "date": "2024-09-08",
    "content": "Backblaze would be great. Most professionals here will have several stages of failure for backups, but in your situation, I would not reccomend getting sucked into this rabbit hole. Either A) Setup backblaze, have it backup to cloud all the time, and get on with it or B) Setup a secondary drive that you copy files to at the end of every working day. If you use a program, so be it. This can be as simple as dragging the session files over and replacing the previous files.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1311289850930003969",
    "author": "mixedbywong_my",
    "date": "2024-11-27",
    "content": "I'd say just try it , some technique's sound a bit out of the box but 5/10 times its a great way to discover new ways to do certain things. I've tried enough youtube tutorials to know what works and what doesn't . Just give it a go , might be glorious or could be just horse shit . 🙂 . Learning something new is good for the soul 🙂",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1348013887232020522",
    "author": "Bryan DiMaio",
    "date": "2025-03-08",
    "content": "time to go out of your comfort zone man, practice recording guitars to drums",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1348019015536218265",
    "author": "hyanrarvey",
    "date": "2025-03-08",
    "content": "If everything is right drum/timing wise \n\nThen yeah what Bryan said practice it!!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "818963162158071839",
    "author": "Slow Hand",
    "date": "2021-03-09",
    "content": "Here's two examples of songs with nylon guitar: https://www.youtube.com/watch?v=ihpcN_vns0k",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "818965212430073899",
    "author": "oaklandmatt",
    "date": "2021-03-09",
    "content": "https://www.youtube.com/watch?v=iDsa4uDM3zU",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "875840204815106058",
    "author": "cian riordan",
    "date": "2021-08-13",
    "content": "Process/Theory:\nI see lots of people’s previous responses say they begin with getting the overheads to sound great and then start blending in close mics. If the drums were recorded by someone who knew what they were doing, with a good sounding kit, in a nice room — this would be a wonderful way to approach things. However 90% of the time that’s not the case with tracks that come my way. So I’m solving fro two problems — making the drums:\n1) The foundational rhythm element. It doesn’t matter how good tonally your drums sound, they need to fill specific duties to carry the rhythm of the song. This is usually problem solving with phase within the elements of the drum set and then mostly getting the kick and snare to sit right around the rest of the instruments. Literally getting the right transients in the right frequency ranges — agnostic of ‘tone’ and ‘vibe’.\n2) The sense of space for the mix. The drums are a huge part of this… and the foundation for the aesthetic of a mix. Is it a tight space? Big verby snare? This is all great, but will rarely deal with this stuff until #1 is taken care of. So my process starts with close mics.\n\nAfter poking around and listening to the close mic various options to get a sense of what I’m working with, I’ll start with getting everything in phase. Solo the kick drum mics and get those in phase with each-other. If they don’t add up, I’ll start playing with HP filters at various Q’s to try and get things closer. You’d be surprised what you can get away with even when things are even 90 degrees out. Then, I’ll start introducing more spot mics (snare, toms, HH) and start getting things in focus with just phase flips. By the time you get to the overheads and rooms, you should have all the spot mics in phase with each-other so then you can get a better sense of how the overheads are going to play into the game.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "881718116038639637",
    "author": "Deleted User",
    "date": "2021-08-29",
    "content": "Most DAW’s internal processing happen in 32 bit floating point. Meaning even 16bit recordings will be going through 32bit floating point math when plugins are processing the audio. So the only benefit I can think of is being able to unclip recorded signal.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "888793646026072065",
    "author": "ALXCPH",
    "date": "2021-09-18",
    "content": "This is of course all perfect scenario stuff and will be impossible to do perfectly so don’t be hard on yourself if it seems like too much.\n\nSo in short just play a fuck ton and learn a Fuck ton of songs ✌️",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "944581483966902293",
    "author": "Eric Martin",
    "date": "2022-02-19",
    "content": "I didn’t know this was a thing, but of course it is, and reading the document it’s almost exactly what I’ve determined on my own is necessary for me, AES is definitely a community for me 😆",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "991744275282919486",
    "author": "BatMeckley",
    "date": "2022-06-29",
    "content": "It seems backwards but the E strips in practice always felt more clinical and sterile (not necessarily in a bad way) while the G felt more  grunty (Terrible word but best I can do at the moment). There was more of that thing you get with an sm57 on a guitar cab with a G series. You would think the G would’ve been cleaner considering it specs better and came out later, but the E feels more that way to me. Like you would’ve expected the G series to come out first and then they cleaned it up with the E. Is that at all helpful? 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1005990299337773156",
    "author": "oaklandmatt",
    "date": "2022-08-07",
    "content": "I love (trying) to explain this because it always makes me think of new things to try.\n\nYou can stereoize a sound using lots of techniques, the main three being pitch, delay, and phase. Often times your favorite plugins will do combos of these, so flipping the phase on one side will sometimes kill some of your wideness.\n\nIt's worth doing a google, but something like a flanger is simply duplicating the signal and micro delaying one of them at a variable rate. So the duplicated signal might oscillate between 2-20 milliseconds, which makes that crazy flanger sound. If you take that duplicated signal and run it through an aggressive filter (which will introduce some phase shift) and that's what a phaser is. \n\nYou can play with multiple duplicate signals, flipping phase on one side and getting wild effects. You can play with pitch on the delayed signal and start getting an effect we call \"chorus.\" But of course, each of these types of effects are just combinations of fundamental ways to manipulate audio. Many combos are possible!\n\nHooray sound design!\n\nAlso, I would love @Slow Hand to correct and expand, since I know he (and many others on here) are REAL sound design nerds.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1024916118730702900",
    "author": "David Fuller",
    "date": "2022-09-28",
    "content": "That said, I'd be surprised if there wasn't some degree of phase shift on older analog consoles from level changes, just because analog is weird and imperfect",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1057736985311191070",
    "author": "LAPhill",
    "date": "2022-12-28",
    "content": "Are you looking for resources on writing/production, or mixing? Just like with the record side, there's so much noise from bedroom composers and people that have zero real-world experience. And as Ruairi is always saying, even the people with real success often can't teach what they know. Maybe I'm a bit cranky after an 8 hour delay at the airport yesterday, but Spitfire has gotten quite good at creating \"tutorial\" videos that are thinly veiled advertisements, and many of their libraries are the equivalent of one-knob plugins or CLA vocals. Selling paint-by-numbers solutions to naïve kids who want to get into scoring (They're far from the only ones guilty of this). But to focus on some of the channels I think are actually worth their salt:\n\n8-Bit Music Theory: https://www.youtube.com/@8bitMusicTheory/videos\nCan be a bit basic at times, but he talks a lot about structure which, IMO, is becoming a lost art in modern scoring.\n\nAnne-Kathrin Dern: https://youtube.com/playlist?list=PLWJg1w7F3PKPbSpEF2YOejVjWAg-KcM3Z\nNot the biggest name out there, but she has a no-bullshit way of explaining things about orchestration and theory that is clear and concise. As far as \"teachers,\" I think she's a good one.\n\nAlan Meyerson Waves Sessions: https://youtu.be/h9jZqn5lnw4\nI hesitate to include this. I know for a fact that Alan swapped out a bunch of his go-to plugins to make everything a Waves product. I haven't watched this in awhile, but it's a good insight into how he sets up a big mix session and why he makes some of his decisions. He's also playing to the camera/audience some, so this is a your-mileage-may-vary recommendation.\n\nMcGowen Soundworks: https://www.youtube.com/@McGowanSoundworks/featured\nPhil knows his shit, and goes pretty deep breaking down a few actual mixes, which is pretty rare to find.\n\nIf I think of others, I'll report back. Hope that helps",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066052410390351942",
    "author": "Jeremy Klein",
    "date": "2023-01-20",
    "content": "whoa would love a tldr on what NARAS guidelines are. That sounds professional. \n\nI posted what my mix deliverables typically look like a while back and a few people had more or less the same setup",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066402172511719435",
    "author": "Will Melones",
    "date": "2023-01-21",
    "content": "Dropbox Pro for Professionals would be great. I’d pay.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1076261785054744727",
    "author": "ALXCPH",
    "date": "2023-02-17",
    "content": "Information with context by people actually doing the work is so much more valuable than death scrolling google and youtube videos 😅",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1077247398306394152",
    "author": "spectrummasters",
    "date": "2023-02-20",
    "content": "Last time I looked on GS serbans  assistant  was being asked what’s the magic frequency they take out of all their kick drums . Maybe that eq has the preset !!!!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1103470148800753664",
    "author": "Chris Doms",
    "date": "2023-05-03",
    "content": "I can see that. I feel like having an assistant could help with that but depending on the scenario maybe I’m wrong",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1103474830159904789",
    "author": "Deleted User",
    "date": "2023-05-03",
    "content": "sometimes even the assistants are remote 🥲",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1103476781324968076",
    "author": "LAPhill",
    "date": "2023-05-03",
    "content": "Having been around many people that have used assistants as hired friends.. don’t be that guy.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104931287267037246",
    "author": "BatMeckley",
    "date": "2023-05-07",
    "content": "There is a very real difference in the sound of shelves vs passing. I remember a time in my career where I learned that and went from pass to shelf. And then realized was the wrong move for me. My signature move now is the shelf with the pass on the corner.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121928460777033911",
    "author": "mario dones",
    "date": "2023-06-23",
    "content": "After spending years studying from afar, I buckled down and started mixing at the end of last year. LWMR really helped everything click for me. I used to be an artist, so I have years and years of recording experience, and doing rough mixes for myself and the homies, but I’m very new to this side of things. I was lurking around on here and I see that it’s common when starting out that doing free mixes can easily turn into doing much more. I only have 2 real “clients” right now but I’m mixing, producing, writing, recording… I love it, don’t get me wrong. The more I can help, the better. I guess I’m just having trouble navigating this space. Going deep with these 2 artists, I’m having a hard time building a portfolio, which is messing with my confidence. Specially with mixing. I can get thumbs up from the people I’m working with, my mentor (my old engineer), but without audience interaction I don’t know what to do with that. I’d like to take on more work, but I only have 1 mix out. Hopefully an EP a couple more mixes by the end of next month. I feel weird shopping myself with no portfolio, free work or not. I don’t know where I stand, where to focus my energy and everything just feels like it’s on slow-drip. Any advice?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1127674911872262144",
    "author": "Deleted User",
    "date": "2023-07-09",
    "content": "https://www.youtube.com/watch?v=n02tImce3AE\n\nhave you ever ran into this video?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1154852302037987408",
    "author": "LAPhill",
    "date": "2023-09-22",
    "content": "I'd encourage anyone interested in music to pick up an instrument and get a local teacher, if possible. @Joel \"Roomie\" Berghult to your point about everyone learning differently, kids can get stuck on some very basic things that snowball into larger misunderstandings down the road if not caught early, which can lead to frustration and quitting. \n\nIf online is a requirement, I'd be trying to point them towards some kind of game or interactive website where they can get feedback on their progress (which also, for kids, generally makes learning more fun). Watching YouTube videos is a hard starting point, but great once they've got the bug to learn more.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182011538949812335",
    "author": "Zach Bloomstein",
    "date": "2023-12-06",
    "content": "Hey friends, I wanted to post this here for anyone starting out. This podcast has been and continues to be a massive inspiration for me on my journey as a recording professional https://www.workingclassaudio.com/ I wouldn't be surprised if someone has already shared this. I bet a few folks on here have even been guests. Enjoy!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1183206240663375882",
    "author": "xico1702",
    "date": "2023-12-09",
    "content": "Hii folks!\n\nI hope you're all doing well! 😊\n\nWell, I'm the newest intern of a music production team, and I'm working in a simple production studio with a control room and a small recording room.\n\nNext week, I'll have a studio presentation where I'll have the opportunity to ask questions. The first question on my mind is about the signal flow, but I'm trying to gather some more interesting questions to ensure I get the most useful information possible.\n\nAny suggestions for additional questions that could be helpful? I'd love to have your help in preparing!\n\nThank you in advance, and I can't wait to get started for real. 🎶✨",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1183317484091211856",
    "author": "Nomograph Mastering",
    "date": "2023-12-10",
    "content": "There must be 100 good books and YouTube vids on signal flow, you should learn that on your own time",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1184554200139567234",
    "author": "Adam Thein",
    "date": "2023-12-13",
    "content": "Discord butchered the mobile app search functionality, I had to find it on YouTube \n\nhttps://youtu.be/FSqX4bt9to4?si=c52c-rJzCA9oCtx4",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1204270711624179822",
    "author": "bobby k",
    "date": "2024-02-05",
    "content": "kaotica ads are all that i've seen the past 24 hours since searching for this photo (youtube, facebook, instagram) . the algo really wants to sell me on it after i looked up one pic",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1209974130452078643",
    "author": "NoahNeedleman",
    "date": "2024-02-21",
    "content": "I'm on a 5 hour flight today, so I splurged and got internet.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1232196950284308600",
    "author": "BoozleBAM",
    "date": "2024-04-22",
    "content": "This has happened to me a number of times: Just did song order for a band from New Zealand for debut their album. When I asked if I gould get a mention -Zip.  Co-wrote 3 songs for a top 40 guy a few years back and was promised credits. Also zip. I am a bit of a newbie myself, but next time, I'm gonna make sure I have something in writing (At least and email) confirming I get credits. No more worky-work for free. Sick of this shit!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1232203284450770994",
    "author": "BoozleBAM",
    "date": "2024-04-22",
    "content": "Did you try calling them and just asking?? Say, \"Hey man, I did all this and I really want some credit - Something to show for my portfolio. I put the work in, so...?\" Sometimes you just need to make yourself heard, bro. Let em know! Get it off your chest. It's work you did and you deserve credit. Can't tell you how many sharks I've met in my short tenure in this industry.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1236206665469132842",
    "author": "Deleted User",
    "date": "2024-05-03",
    "content": "I have a feeling Minilogue would mesh really well with the stuff you do. Surfaces; I don’t remember hearing much synths- but music like this could probably use Minilogue too. \n\nProphet 6 sounds really pristine and thick while also having hollowness to my ears; you can certainly dirty it up and I believe they come with bitcrusher effect (I’m not sure)- But minilogue has this spongy but grimey feel to it that I feel like would work really well for what you do. \n\nultimately best thing is trying them out before buying them, but you can also hear what they sound like on Youtube demos and let your own taste decide for you!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1254893862871371851",
    "author": "jet",
    "date": "2024-06-24",
    "content": "on day jobs and switching careers as a burnt out 20 something\n\nHey yall, I have a few questions on how can one make a successful transition between careers, since Im kinda burnt out on corporate jobs and wanna take a hand at becoming a performer/producer/writer/engineer for a career:\n\n-when exactly is the right time to switch? somewhere around making the same amount as the day job?\n\n-is taking a leap a valid strategy? It seems to me that if I cant build momentum working full time on music for ~6 months, its not happening, and I really have no free time w my current job + study situation\n\n-is working music jobs good for momentum, or does it hinder you? Im talking doing bar cover gigs for money/making content while building skills during the day\n\n-how is it living w roommates as a musician? Want to get out of my folks’s somewhat soon, and trying to figure out the logistics of needing to practice or record every day",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1254900063931731969",
    "author": "NoahNeedleman",
    "date": "2024-06-24",
    "content": "Hey howdy hey. Stream of consciousness response here:\n\nFirst of all- great question. Haven’t seen you around these parts yet so I don’t know your situation and can’t speak to your specifics. But, there are some overarching philosophical ideas worth considering. \n\n1) the answer to each of these questions is different for every person. None of us got into music because we’re risk averse and looking for stability, so dont think just cause you’re “going full time” or you start calling it a “career” that somehow that will be different. \n\n2) and this is universally true, you’ll never be younger or have fewer responsibilities than you do now.\n\n3) don’t take the leap if you’re not willing to: be poor. Have roommates. Eat ramen. Breakup with girlfriends/boyfriends who expect more from you. Borrow money for your cellphone bill. Drive a shitty car. Etc etc. \n\nBut also, if you don’t bet on yourself, no one else is going to either.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256443861568589824",
    "author": "BoozleBAM",
    "date": "2024-06-28",
    "content": "@Nomograph Mastering  And these types of conversations are so, soo difficult to have over the internet - Especially two people who don't know eachother at all. So, I'm not trying to be a dick here...",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1256545431656206426",
    "author": "rawssx",
    "date": "2024-06-29",
    "content": "@BoozleBAM sorry for the ping, i think the reason i personally dont get along very well here is mostly because i speak from a producer/artist perspective (i am turning 19 this year so i have a lot to learn). Maybe its that for you too, or you are new on this journey just like me. The folks here are (mostly) engineers who do this stuff for a living, ofcourse they value their own time. But in my opinion, how beautiful of a place would this be if we could ask the questions we actually want, if i am asking ruairi a question about eq, its not because my intention is to waste his time, its because i want to learn from him, i look upto him and i respect him, if he doesn’t have the “time”, maybe someone else will, but saying “ask better questions” thats for sure very rude, especially to a newbie (this is the newbie chat) I genuinely think this is one of the most important audio communities on the internet. We should be more open minded and communicate with generosity. Lead with love!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1257394425429102693",
    "author": "Rollmottle",
    "date": "2024-07-01",
    "content": "2 drummers https://www.youtube.com/watch?v=tFTLxkMmY4M",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1257395004955951264",
    "author": "Rollmottle",
    "date": "2024-07-01",
    "content": "2 drummers https://www.youtube.com/watch?v=YDONujOW7OY",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1257397541582934056",
    "author": "LAPhill",
    "date": "2024-07-01",
    "content": "3 Drummers? That's cute.. https://www.youtube.com/watch?v=QTOMIyynBPE",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1258536182489550899",
    "author": "BatMeckley",
    "date": "2024-07-04",
    "content": "I find the phone useful for general leveling rather than Sonics…plus it just seems like good practice if you want to make a living in commercial music to reference one of the most universally used playback systems to make sure nothing heinous pops out",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1262185889551876128",
    "author": "David Fuller",
    "date": "2024-07-14",
    "content": "https://www.youtube.com/watch?v=TpohVYomw2o no mids to be seen anywhere",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1270852778541060197",
    "author": "Adam Thein",
    "date": "2024-08-07",
    "content": "Long and scattered watch but some nuggets to harvest in here https://www.youtube.com/watch?v=OaLxz5_M_IQ",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1296248163367387236",
    "author": "Eric Martin",
    "date": "2024-10-16",
    "content": "I’ve never had a file to tune that was this much problems, of course it came from a live show, got in, spent way more time than I had allowed for but I know what to do -hopefully- for the future when it’s needed.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1311274185162620958",
    "author": "Jemody",
    "date": "2024-11-27",
    "content": "What's everyone's goto way to discovering new techniques? I've really been finding myself reluctant to trying something new and just end up doing what I'm comfortable with and I don't necessarily trust youtube tutorials too much and/or find them a struggle to watch sometimes",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1313238632995360800",
    "author": "spectrummasters",
    "date": "2024-12-02",
    "content": "In programmed music you can shape adsr in the sampler of course, but compression allows us to do this also\n\nEmbrace it man , get a feel for it and then you’ll have so much power to manipulate that pocket . Both of an instrument and its relationship to other instruments ….and then between buses etc .",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1313267402007380028",
    "author": "Josh",
    "date": "2024-12-02",
    "content": "Of course! I would read all day about how compressors work but I could “hear” what was actually happening and this immediately gives you a VERY obvious representation of what’s happening.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1323498178842066944",
    "author": "onanisland",
    "date": "2024-12-30",
    "content": "Totally, not planning on a deep dive, was just a fyi because youtubers make false claims when it comes to vpns",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1324203674838368319",
    "author": "Zack Hames",
    "date": "2025-01-01",
    "content": "Eric Valentines YouTube channel and now website are awesome.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1326388828549677158",
    "author": "Matt Huber",
    "date": "2025-01-07",
    "content": "Of course  it depends on the track, but 99% of the time, I pan them hard left / right. That said, I’m generally very close to LCR in my panning approach once I hit the chorus.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1348076161317736458",
    "author": "cian riordan",
    "date": "2025-03-08",
    "content": "But this community was created with the intention of helping people make better music… with a strict bent towards creating a career out of it doing it at the highest level.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1363278490207653969",
    "author": "Nomograph Mastering",
    "date": "2025-04-19",
    "content": "What are the topline advantages to Management?- say chasing money, doing deals, admin/email, strategy\nNot everyone who arrives at the \"I need a Manager\" threshold will have an even distribution of those needs. Some people are excellent at one aspect, some people just don't need it in their business, some others are not growing becuase of bad long term strategy etc\nIt might be that having just one of those needs met is the big unlock for your career, but whatever the mix it won't be even",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1376622848004722818",
    "author": "conor // wbotm",
    "date": "2025-05-26",
    "content": "https://www.youtube.com/watch?v=QspuCt1FM9M",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1394022271454281888",
    "author": "Rollmottle",
    "date": "2025-07-13",
    "content": "Every item in Music Pro is covered individually, same as your homeowner's. My experience with filing a claim with Music Pro was painless. I filed it, provided the documentation and got paid. The damage happened on the road, which is covered by Music Pro. I don't know that your homeowner's will be so responsive or flexible to the real world scenarios of how instruments and gear get used in practice. If you never leave your home with your gear, maybe you'll be fine. If I have vintage instruments, amps, things no longer in production and the like, I am going with the company who understands what replacing that stuff may look like.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394851573061910708",
    "author": "Bryan DiMaio",
    "date": "2025-07-15",
    "content": "yeah whatever length you need and just tell the octopre to look at the word clock in (so the light would be illuminated on \"WORD CLOCK\" instead of \"INTERNAL\")",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1398374096684978188",
    "author": "chrissorem",
    "date": "2025-07-25",
    "content": "@Felipe De Mari Scalone  he was my last assistant and he studied to be a lawyer and even practiced Law and realized this can’t be his life. He’s too passionate about making music and creating art and basically started over and I’ll tell you what this dude has what it takes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1398936204262510684",
    "author": "andrew_yv",
    "date": "2025-07-27",
    "content": "I, like many can’t stand Mr beast, but yeah, I think the value in that paragraph is not his choice of goal—not one I would choose, but his clarity as to what that goal is and degree of optimization around achieving it. Imagine if you or I had an actually cool/valuable goal that we were that clear about and dedicated to and beyond that had a team of people who were working with you toward that shared vision",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1399840114884214784",
    "author": "el",
    "date": "2025-07-29",
    "content": "yo gang. any idea how you get this kind of clipping sound?  https://www.youtube.com/watch?v=F8loVhlwP9M",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1458920074000732293",
    "author": "oaklandmatt",
    "date": "2026-01-08",
    "content": "When successful music producers talk about \"mentors,\" it's almost always working under someone. This usually starts out as an internship or assistant position of some sort. Some come through your network of music friends, some come from doing exceptional work and people further along in their career taking notice, and some come from applying to the various \"looking for an assistant with xyz qualifications\" posts you see here and on social media.\n\nI made an album with a local band called the Matches up in Oakland. They started getting attention from record labels and big producers in LA. I moved to LA and met Eric Valentine who liked the album and met with the band. I asked if I could intern for him. He said he didn't have interns but I should stay in touch cause sometimes they hired extra help. I called him every two weeks for the next six months until an opportunity opened up. Then I assisted him for five years while making indie records on the side.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1458940420049338388",
    "author": "oaklandmatt",
    "date": "2026-01-08",
    "content": "My advice is to have in person interactions as much as possible. When it comes to making records at a super high level (intense, stressful, high standards, egos, deadlines, freakouts, etc), you need to build a level of trust that for me is impossible without spending time with a person.\n\nIt doesn't mean you can't build a career remotely, but it's harder. Not only is it harder to build trust, but the remote option is available to anyone with an internet connection. So you're competing with a much larger pool of people too.\n\nDoes that mean move to LA or London or Miami or wherever? Not necessarily. But finding a way to get in person with the kinds of people you want to work with is extremely important",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1459069701459284070",
    "author": "oaklandmatt",
    "date": "2026-01-08",
    "content": "@Kian @sinaigimenez I sometimes forget that this discord was spun off of our livestreams, but we did a whole hour about assistants:\n\nhttps://youtu.be/xD6HmSk1rNw?si=DcczxzSMVq8IeJcB",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472081356627640542",
    "author": "masteredbyjack",
    "date": "2026-02-13",
    "content": "Another way to see this, at least the harmonics that clipping adds, is considering a simple sin wave vs a square wave. Read into the harmonics created (it’s just wave theory). But it’s especially clear in synthesis in that case.\n\nOf course musical applications are much more complex, but that’s why clipping (squaring off the top of a rounded waveform) adds harmonics\n\nThat’s what people mean when they say it spreads the energy across the spectrum. In the case of a sin wave, you have a single fundamental. At the far other end, you have a square wave which has harmonics all up the spectrum of frequency",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1473003181515739206",
    "author": "revolution",
    "date": "2026-02-16",
    "content": "if you heard the previous take it was likea. straight up robot. and each version i changed which tune and pitch plugins i used bc of licesnses and random bs. it was so chaotic. ill try to do a clean mix and use the tutorials online and maybe ask for your feed back after",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "812461526589767712",
    "author": "Zakhiggins",
    "date": "2021-02-19",
    "content": "Awh man there's nothing I love more than mjs accapellas on YouTube. Just listened to that top to bottom, it's such greatness.. But yeah I completely get what you're saying, it makes the whole package so 3 dimensional.. This has inspired me, I'm going to go play with some ideas",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "819635972273602580",
    "author": "Zack Hames",
    "date": "2021-03-11",
    "content": "Is there a best practice for running audio through another mic preamp to get some coloration? Or will it not make as much of a difference Line In vs mic in? I feel like this is a simple thing to know. I’m asking because I’m curious if running audio through my UTA MPDI-4s will give me the same or some of the coloration as when I record with it. Maybe @oaklandmatt or @cian riordan have an answer for this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "821120550201720884",
    "author": "hendrick",
    "date": "2021-03-15",
    "content": "😭 he gave me a professional way to do it but i had already destroyed the box",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "825719082170843147",
    "author": "Zack Hames",
    "date": "2021-03-28",
    "content": "That’s all awesome. Congrats! I know Matt and Jon have recommended exactly what you did, don’t rock the boat on the first credit you get screwed on, make sure you get it next time. The relationship is more important long term “earlier” in your career.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "829296217711181855",
    "author": "antoniohannamusic",
    "date": "2021-04-07",
    "content": "Not a plug but on the live recording thing, this is an example of the DI everything method, the band wanted this constant moving video so we faked a dolly / track with me walking in circles with a gimbal and a DSLR, All instruments DI/Kemper except for drumkit and vocals, we did 3 x takes full band then for safety I had the lead singer do a one take over the best live playthrogh, this gave me the option of having a completely isolated vocal for the end where the drums get a bit hectiv : https://www.youtube.com/watch?v=P-v_S5sOZYE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "830795738350223440",
    "author": "AlexLayne",
    "date": "2021-04-11",
    "content": "Of course. Also, I really think the UI of insight takes the cake. its fully modular. I know hawkeye is too but, maybe im just an old head who doesn't like change. And TBH izotope has always done right by me as a company",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "839609395947634688",
    "author": "Deleted User",
    "date": "2021-05-05",
    "content": "plus, most daw’s internal processing is 32bit floating point and the summing is done in 64bjt floating point. I don’t see much reason to record 32bit -audio files- though, other than the fact that clipping isn’t an issue anymore. Because the daw processes them in floating point anyways it would be only taking up the hard drive space. I think in earlier protools (i believe before version 10) wasn’t like that so they had to go through that process. It isn’t necessary now anymore. I only started using PT from version 12 so I don’t know what it was like before the floating point became something we take for granted by default",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "842195014208585758",
    "author": "alecdibell2",
    "date": "2021-05-12",
    "content": "@thejadenmejia the futur youtube channel is also really resourceful for negotiating and backing the value of your work when encountering price resistance",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "852378893712359444",
    "author": "Eric Martin",
    "date": "2021-06-09",
    "content": "being a tracking engineer for sessions like that where you have to wrangle file for someone else is kind of a pain, that’s what’s made me consider hiring an assistant to do it for me 😂 $10-15 an hour, you prep my files for me so I don’t have to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "857126397662461972",
    "author": "cian riordan",
    "date": "2021-06-22",
    "content": "I would tell them there's a few things to consider when pressing vinyl:\n1) Mastering is especially important as it’s the real bridge between the music and the mechanical production of the record. I had the great pleasure of mastering a few records for vinyl with Doug Sax (give him a google) and there’s a lot more to the process than modern mastering for digital services. They will actually cut the acetate disc which will be what manufacturers use to make the metal stamper that actually molds the records. A lot of thought goes into this process such as the width of the grooves to accommodate bass frequencies, etc. If you want a good sounding record, there’s no way around working with a seasoned professional.\n\n2) Side lengths are important, as is track order. The more music you put on a side of vinyl, the less fidelity it will have as a whole. There will be sacrifices in the manufacturing to accommodate all of the music, so it’s best to keep your side lengths under 20 mins. Closer to 15 mins per side is ideal sonically, but sometimes that means doing double records and that just gets expensive. Also the order in which the tracks play on each side plays a part. The songs at the beginning of the side have more bandwidth and less distortion… it basically diminishes the closer you get to the center. Whatever the last track on the side is will just sound worse. It’s a flaw in the medium… so think about that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "857391230319984640",
    "author": "hendrick",
    "date": "2021-06-23",
    "content": "class was led by jonathan wyner, president of AES and director of the education department at izotope",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "862832865804419113",
    "author": "peterlabberton",
    "date": "2021-07-08",
    "content": "Nerding out on some drummer shit might really come in handy—go listen to some of The Meters and listen to Zigaboo’s feel. That was a big thing for me learning sort of “in between” feels that can’t really be defined on a grid. Getting the nuances of different degrees of swing on different subdivisions can get kind of mind-bending until you have an intuitive feel for it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "863102439120437308",
    "author": "peterlabberton",
    "date": "2021-07-09",
    "content": "The internet can be pretty neat sometimes. I was really into New Orleans drumming in high school, which I feel really goes deep on these nuances of swung/straight—I had an instructional DVD from this very drummer talking about this very exercise, which was super helpful at the time: https://www.youtube.com/watch?v=8PQaU_tCbjg",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "863103725765787668",
    "author": "peterlabberton",
    "date": "2021-07-09",
    "content": "In the video I had in high school, he spends more time on the first exercise, which I feel like he kind of glosses over here. Just setting a metronome and playing eighths, and smoothly going from purely straight to super, over the top swung, and then smoothly transitioning back to perfectly straight is a good one to practice.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "868582479508955146",
    "author": "Ian",
    "date": "2021-07-24",
    "content": "So not quite a music question but ive been editing twitch vods and they are super quiet since I have to upload to YouTube. I can push the clip gain in the video software all the way up and not clip before I bring it into protools for final limiting. I still end up around -20 LUFS before limiting which means I need about 6 LUFS to bring it to YouTube 's -14 standard. So my question is what strategies with gain staging etc would you recommend so that im not having the limiter clamp too much when I go to do final export?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "874815968814174279",
    "author": "cian riordan",
    "date": "2021-08-10",
    "content": "I never enjoyed the inside Tom mic sound personally, so 45 degree angle about 3-6 inches off. Again, cymbal bleed management is the game",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "887100312547119146",
    "author": "sethearnest",
    "date": "2021-09-13",
    "content": "The amount of gating to me feels like a dry/wet mix knob for natural-to-“modern” drum sounds. Mics mostly wide open always feels more natural/old school; each drum gated and attacks accentuated a la the other guys’ messages above feels more modern and “produced” (I don’t like that word used in that way but hopefully the point is there). And of course many shades between the two.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "888787256272363591",
    "author": "rae",
    "date": "2021-09-18",
    "content": "Does anyone have any tips on getting better at a musical instrument? \n\nI’ve been playing guitar on and off for the past couple of years and haven’t felt like I’ve progressed much so I thought I’d see if anyone had any advice on what to practice/practice routines/general up-skilling stuff when it comes to playing an instrument 😊",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "916107288765419600",
    "author": "Zack Hames",
    "date": "2021-12-02",
    "content": "Power question:\n\nI just had a power strip completely die - and I think melt slightly! All the gear was totally protected (pretty nice power strip, but old at this point).  It had my Computer, my PMC twotwo8's, a synth, some other odds and ends plugged into it.\n\nSo, what are some best practices when it comes to power/electrical and recording/music gear? Does it really matter if things are on separate outlets if they all go to the same breaker? and if they are on separate breakers and then interconnecting later on, isn't there potential for ground loops / noise?\n\nThis is the first time I've had one completely fry - I've had things shut off but nothing like this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "916108742813163571",
    "author": "David Fuller",
    "date": "2021-12-02",
    "content": "That power strip probably had an internal short. Admittedly, I'm a little leery of running that much stuff off one circuit, especially stuff that draws lots of current on the same strip like the monitors and the computer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "926965480214908930",
    "author": "KushKadett",
    "date": "2022-01-01",
    "content": "maybe not a newb question but I thought it was really interesting what Jon said in regards to distortion of converters. I noticed something similar by experimenting with different clocks on my rather cheap interface. \nOne being the internal clock and the other a high quality Antelope Isochrone clock. The minute I hooked it up I was able to monitor a lot louder without it having the feeling of hurting my ears- the increase in clarity was immediate. \nSo It seems to be the case that this subtle (intermodulation?) distortion literally hurts our ears and can make people go deaf. 40 of Drake was saying something similar, so I'm wondering if there's more to this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "934873784081612870",
    "author": "KushKadett",
    "date": "2022-01-23",
    "content": "to expand on this: what is the best way of learning piano and music theory? I feel overwhelmed by all the options on youtube. Any specific course that is good?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "934878393097396294",
    "author": "Zack Hames",
    "date": "2022-01-23",
    "content": "Just a place to start - learn and practice all of the scale modes (Ionian, mixolydian, aeolian etc) and basic chords. (Major, minor, augmented, diminished, etc) \n\nFrankly you can start with just basic 3 note chord and expand to bigger chords and inversions. I am by no means an expert but I am a long time guitarist with 0 theory that learned theory via piano playing so hopefully this might give you a very basic direction rather than something overly technical.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "934881911120232489",
    "author": "KushKadett",
    "date": "2022-01-23",
    "content": "with learn and practice you mean able to improvise over a song key?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "936550054720839681",
    "author": "Maxim",
    "date": "2022-01-28",
    "content": "As far as coming up with a number only you can decide what would seem “fair” and minimize potential regrets down the line. Even though if something gets placed with a label and you’re credited you win career wise and if it doesn’t you still have the cash which you didn’t have yesterday.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "940298537495826453",
    "author": "itaylerner",
    "date": "2022-02-07",
    "content": "Fabfilter has some phenomenal educational videos, including a three part guide to compression- highly recommend! Has great examples and solid explanations, huge help if you really take the time to watch, pause, rewind, internalize the information.\n\nhttps://www.fabfilter.com/video",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "944410972095922196",
    "author": "peterlabberton",
    "date": "2022-02-18",
    "content": "I do it out of habit at this point, but a habit built from trying to be thorough/professional and also get credited when my shit gets used—in many situations, you may not know if there are other people submitting mixes, and to me it also just adds some clarity to file names. Also if you’re working with a team of people, initialing mixes/PT sessions/etc. can be a good way to do some forensics months later if needed; at least there’s some hint of who to ask to help you track down that one version of that one thing you need now that you didn’t think you’d need last year when you wrapped that project.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "945417545966555229",
    "author": "itaylerner",
    "date": "2022-02-21",
    "content": "Buying some bulk cables and connectors to practice soldering has me wondering: any benefit to speaker cables / instrument cables over balanced cables for everything? Why would I not just use balanced cables with TRS / XLR for my instruments and monitors?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "952913676829073438",
    "author": "chadwahlbrink",
    "date": "2022-03-14",
    "content": "I use a smart plug to turn on and off my noisy raid archive drives each night via a Furman power conditioner. They mount when the plug turns on, then Keyboard maestro ejects them a few hours later, and they turn off with HomeKit automation. I was tired of coming down to work and having the drives humming super loud when I walk in. \n\nI want to get another plug for my other Furman that powers my Apollo and monitors. I do turn off the Furman switch instead of individual components. \n\nAll that to say, you should be good to use a smart switch for something like this. I have the WeMo plug currently. The only caution is that it’s often “good practice” to turn off your monitors before anything else, although modern gear seems a bit better about not popping your monitors!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "979027679208702054",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2022-05-25",
    "content": "Can Anybody give me advice on how I can land a internship in a Music Studio?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "980334153427988540",
    "author": "ehutton21",
    "date": "2022-05-28",
    "content": "I’m not sure if this is a newbie question or not, but I’ll throw it here anyways and see what happens (I hope it helps newbies too). I’m already somewhat aware of the answers I may get, but who knows. Sorry if this is long, I’m bad at short form.\n\nContext: I have been producing music in sincerity for maybe 3 years now, been a hobby since like 16. I’ve started to engineer out of necessity for my individual artistry, but one thing led to the next and I gained a fair bit of skill at it (or so I’ve been told, I’m still pretty insecure, honestly even being around all the really knowledge people on here makes my panic disorder go 📈). I’ve gotten an internship at a studio as a runner and a session assistant down here (it’s not paid but it’s not exactly unpaid), and I truly have learned a lot (I learn something new on the daily I swear), but I’ve yet to have any true guidance from an established figure yet (which very well may never happen), which I know isn’t necessary, but it absolutely makes me question my own abilities/career decisions despite what happens with my freelance work and I’m curious to know if this is like normal/how other people cope. \n\nLike, I’ve gotten a somewhat okay share of people who pay for my work as an engineer/producer/writer, but the “do you really know what you’re doing” doubt doesn’t fade easily—even when I’ve been paid by people on like label level budgets, I’m never really registering that success. I’ve had cool moments and landed spotify placements as a mixer for artists, and there’s this part of me that’s still somewhat ashamed that I do a lot more work for free than I care to admit. \n\nMaybe it’s the comments on the old episodes that has me spooked (Jon on #61 re: “not everyone can be a mixer”), but is this like just me or do even some of the really wicked smart people here still feel that—and if so, how do you guys handle the it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "981262559351029840",
    "author": "ALXCPH",
    "date": "2022-05-31",
    "content": "Just go on Spotify or YouTube and search live with Matt rad. I think they have something like loudness pt1 and 2 in their names",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "994435360266403911",
    "author": "Slow Hand",
    "date": "2022-07-06",
    "content": "Hey there. It's a bit of a large topic to cover without knowing more about the kind of issue that you're having. Luckily, there are lots of tutorials on how to warp Ableton Audio on Youtube. Videos like this: https://www.youtube.com/watch?v=OoVvYtqzT3s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "997896140647301243",
    "author": "Adam Thein",
    "date": "2022-07-16",
    "content": "Should just be two steps:\n\nOn 3rd party plugins in live that allow sidechaining, you should see this little Sidechain menu show up.  So this should look really similar to the sidechain settings in the stock compressor. (1st picture)\n\nNext, inside the plugin there should be an option to change the source of the sidechain to \"external\" from default internal.  With the stock Ableton plugins this happens automatically when you engage the sidechain but for 3rd party you have to add it manually.  I don't have F6 but looking up an image of the plugin it looks like the option is in the bottom right (2nd picture).\n\nIf that doesn't work then I'm not sure what's going wrong.",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1020797300982939709",
    "author": "joshua_wav",
    "date": "2022-09-17",
    "content": "hey y’all i could use some advice on how to deal with revisions. i don’t like charging or setting limits but some artists i’ve been working with have been asking for mix changes / arrangement changes months after it got approved and sent to mastering. i had one song where all the drum samples were replaced with live drums, the bass and guitar was recut and a bunch of backgrounds got sent in over the course of 6 months. where do you draw the line on changes like that? i feel like i’m living inside of the ship of theseus thought experiment 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1033511424376455290",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "- **More samples (slices) per second equals a better representation of the analog waveform.** Within half the band of the sample rate (say up to 22.05k for 44.1k) this is demonstrably not true. I know that is confounding, but digital and information theory is basically miraculous\n- **We can hear/feel/sense sounds above 20k.** We truly really cannot and if you experiment with significant energy above 20k you’ll actually see problems creep in for electronics and speakers etc. Information above 20k is not our friend (space for harmonic information to live without aliasing back excepted)\n- **Working at multiples of 44.1k is better because the sample rate conversion will work better.** This used to be a little bit true a long time ago but hasn’t been for a long time. Use the SRC in iZotope RX on it’s stock preset to 44.1 and you are in pretty good shape\n- **Digital EQs work better at higher sample rates because of cramping.** Cramping was an esoteric problem with older digital EQs that looked bad on analyzers but never actually sounded very bad. It’s a solved problem nowadays with most EQs.\n- **Video and film is at 48k so we must start there.** Yes film and TV still work at 48k (although YouTube specs 44.1 now) but I have sent a million tracks for sync at 44.1 and it gets dropped in with SRC and away we go",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033515567245705308",
    "author": "peterlabberton",
    "date": "2022-10-22",
    "content": "When I was interning, the guy I was working for did a full half day session at one of those not 1/2 sample rates. The singer kept saying something sounded off/the song was too slow/etc., and my dude realized a few hours in. Oops!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033526735641260133",
    "author": "Slow Hand",
    "date": "2022-10-22",
    "content": "Of course. I’ll send it to you for feedback and approval before it’s published.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033540338310201354",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "YES YES YES. I did a weekend course at Second City and it changed me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1034507485920362536",
    "author": "Rollmottle",
    "date": "2022-10-25",
    "content": "would probably be less the mic and more the cable that is bearing the brunt here (providing of course your mic doesn't fall and bounce off the floor)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1042663756037107842",
    "author": "Will Melones",
    "date": "2022-11-16",
    "content": "Last I had an issue with ads (maybe a year or so ago?) there was a way to open up a Messenger chat with support, but they really did their best to bury the access. But at the end of the day they’d rather take your money than have you give up. They even had a program where a “marketing expert” would call and walk you through optimizing your ads over the course of a few weeks. So…not much advice here, except to keep hunting and I’m sure you’ll find a living, breathing(ish) support rep.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1043685876707905547",
    "author": "cy (sigh)",
    "date": "2022-11-19",
    "content": "I heavily disagree with this point. \nmost of what worked on has been either from scratch or ppl picking from premade stuff and adjusting from there. \n\nif they know how they write and are confident in their taste a good writer can write a whole song in 30mns sometimes less. \n\nagain v genre dependent and this doesnt mean some edits wont be made later on but its easily doable if theybhave thw practice. \nespecially w rnb and hip hop. \n\ni much prefer building around their verses but sometimes the song is the song and you just roll w it.\n\nnote: i would never do this for anything leaning towards pop or rock though. i always work around the artist's parts for those.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1048649737450029136",
    "author": "mixedbywong_my",
    "date": "2022-12-03",
    "content": "https://www.youtube.com/watch?v=ygkLqJq1Gyk is it me or does the first verse mostly the vocals sound like they're recorded from a Zoom call ? 👀",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1056983142830964797",
    "author": "Chris Doms",
    "date": "2022-12-26",
    "content": "My fellow noob mixers (< 5 years) just curious how long does it take y’all to mix a track? I know deadlines affect this but I’m just wondering where y’all are it with your experience. I feel like I’m usually spending 10 hours on a song at least. (Feel free to tell me that’s not enough)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1057644677853098054",
    "author": "Ross Fortune",
    "date": "2022-12-28",
    "content": "**General**\n\nInterview style material can be great, and sources like Mix With The Masters where you can watch legitimate professionals working while they explain why they do what they do. Of course, you first need to understand the tools in order to understand why people use them in certain ways in specific situations, so building your knowledge of the fundamentals is important.\n\nIn general beware of anything with hyped titles like “30 MIXING HACKS I WISH I KNEW”. The internet is awash with misinformation, so it’s important to assess who the information is coming from, and what their agenda may be (whether that’s building subscribers, or shilling a product etc). If in doubt, research the records these people have worked on, and listen to them to see if you actually like how they sound!\n\n\n**Engineering/Mixing/Production**\n\nSteve Albini / Electrical Audio: https://www.youtube.com/@ElectricalAudioOfficial\n\nMaking records with Eric Valentine: https://www.youtube.com/@mrwev\n\nJust For The Record - Mixing/interview streams - https://www.youtube.com/@JFTRLive\n\nSol State - Clips from longer form streams by (mostly electronic and pop) producers - https://www.youtube.com/@SolStateMusic\n\nLive With Matt Rad (focused around Instagram Live interviews, with a generous community on Discord - generally skewing towards pop)\nInsta: https://www.instagram.com/livewithmattrad/\nDiscord: https://discord.com/invite/fcfEtxRbWT\nPodcast on Spotify, Apple Music etc.\nYouTube Channel: https://www.youtube.com/@LivewithMattRad\nYouTube Clips Channel: https://www.youtube.com/channel/UCs8ZKTveuxghTN-QaHFemsw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1061463392327569509",
    "author": "JakeTB",
    "date": "2023-01-07",
    "content": "Also if you check out the unf*ck conversation at the gift shop on YouTube, Ruairi goes in on it there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1069284316900765776",
    "author": "austenballard",
    "date": "2023-01-29",
    "content": "It seems like your square wave trick should be a best practice, since it's definitely not just master bus PDC that can throw things off. The other person's effects, or their sample rate, or working across DAWs could all contribute to misalignment.\n\nWhat's your method for doing the square waves? Is there a particular plugin you like for generating the tones? Is there a specific 'low frequency' that works best?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1070328352222740490",
    "author": "austenballard",
    "date": "2023-02-01",
    "content": "But I'm not sure that's necessarily a best practice, or even advisable",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1070341076134678600",
    "author": "hyanrarvey",
    "date": "2023-02-01",
    "content": "https://m.youtube.com/watch?v=9NVrzg-8QBE&t=279s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070902493531349135",
    "author": "austenballard",
    "date": "2023-02-02",
    "content": "What's the lore with the @BatMeckley and @cian riordan mom jokes?\n\nIt seems such an integral part of all the insightful, high-level discourse that goes on here that I just have to ask.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1076671323482361977",
    "author": "skeed",
    "date": "2023-02-18",
    "content": "anyone know how to achieve and set this kind of effect up? im confused on how hes able to have the panning \"tempo\" synced https://youtube.com/shorts/pMdb4szzuGg?feature=share",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1076687623420117062",
    "author": "MikeMillerMixes",
    "date": "2023-02-18",
    "content": "Of course glad you liked it!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1096649960168099863",
    "author": "LAPhill",
    "date": "2023-04-14",
    "content": "I haven't watched this, but Dan's great at explaining this sort of stuff. https://www.youtube.com/watch?v=qrXXNKhjBE8",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1096650201109897286",
    "author": "LAPhill",
    "date": "2023-04-14",
    "content": "This is likely too basic, but here's another: https://www.youtube.com/watch?v=_fDg_pgit5c",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1096650560708546570",
    "author": "austenballard",
    "date": "2023-04-14",
    "content": "thank you! Nothing is too basic when you're me lol\neverything I know about EQ has been learned on the job\nI feel like I probably should have watched a tutorial like this at some point but never did, oop\n\nbetter late than never",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1096660275635175424",
    "author": "NoahNeedleman",
    "date": "2023-04-14",
    "content": "Technology does have a way of creating a need for itself. I wonder if having the discord prompting deeper questions leads to us questioning things that aren’t that deep. Like YouTube is still a great place to learn shit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1096661077284106390",
    "author": "Nomograph Mastering",
    "date": "2023-04-14",
    "content": "Sure, I fixed my shower recently with a YouTube tutorial, would have been a $300 plumber call",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1096661220414726146",
    "author": "Nomograph Mastering",
    "date": "2023-04-14",
    "content": "But everything else being equal if you gave me a young record maker raised on YouTube and one who wasn’t I’d bet on the latter",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1096830599613923461",
    "author": "Nomograph Mastering",
    "date": "2023-04-15",
    "content": "But low latency/natural phase is basically no difference. In theory and practice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1103370146678059139",
    "author": "popaganda.",
    "date": "2023-05-03",
    "content": "Specializing and hustling mix work  is a hard game to play. Literally everyone wants to be a pro mixer. Asking people on a discord channel to tell you whether to specialize in it is not the move. What do you love most? What lights a fire under you? Focus on that thing and go hard. But don’t choose mixing or mastering or whatever to focus on because you think it’s a smart career choice that will bring a lot of work and success. It’s not. (Until it is for the small % with a lot of talent and 💯 commitment)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1103475455891345468",
    "author": "Deleted User",
    "date": "2023-05-03",
    "content": "I’ve met a few people that put everything on avid cloud for their assistants to prep and they are on the other side of the country.\n\nI’ve prepped for a mixer in hong kong. He would send me sessions right before he left the studio and I prep during the day so he can wake up to sessions prepped in the morning.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1103476205677719653",
    "author": "Adam Thein",
    "date": "2023-05-03",
    "content": "Haven’t quite crossed the threshold yet here but I could definitely see having an assistant in the same city as you would be a huge help with that.  One day!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104926553990762506",
    "author": "austenballard",
    "date": "2023-05-07",
    "content": "re: when I brought up producergram/tok/tube talking shelves vs HPF/LPF\n\nhttps://www.youtube.com/watch?v=9bJrPtXYNtI\n\nIt's definitely a real thing people are talking about",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1104931541026619443",
    "author": "Adam Thein",
    "date": "2023-05-07",
    "content": "\"education company\" makes my brain hurt",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104933521669238855",
    "author": "austenballard",
    "date": "2023-05-07",
    "content": "Like something that maybe was accurate for someone once and then got extremely warped through the internet game of telephone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1106348624373366854",
    "author": "bobby k",
    "date": "2023-05-11",
    "content": "got an Izotope RX question. I have RX-10 Advanced and need to help a government translator isolate dialogue from rough footage that's over a decade old. The editing is just for internal purposes and won't go anywhere. It's arrest footage caught on hidden cameras, so yea the recording is pretty bad. never thought i'd be doing something like this lol but it's for a family friend.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1109111183035875478",
    "author": "Bryan DiMaio",
    "date": "2023-05-19",
    "content": "First course of action: support ticket. They’re surprisingly quick with that stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1109111419846267012",
    "author": "Bryan DiMaio",
    "date": "2023-05-19",
    "content": "That’s the internal source",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120719102508544030",
    "author": "hyanrarvey",
    "date": "2023-06-20",
    "content": "https://m.youtube.com/watch?v=i8jLzlMVS80&pp=ygUZYS9iIG1hY2hpbmVzIHNsZWlnaCBiZWxscw%3D%3D this song live is nuts",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121934954394288219",
    "author": "mario dones",
    "date": "2023-06-23",
    "content": "I think trying to find producers who are busy may be the route. Building songs with AI vocals to build the portfolio?? Never thought about that, but I kinda like this idea",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1121937868785451098",
    "author": "Deleted User",
    "date": "2023-06-23",
    "content": "Also mixing good songs is probably just as important as mixing well in terms of building a portfolio. Even if you killed the mix, a shitty song is gonna mess with people’s first impression on your work. \n\nIf you are also supplying the songs for your portfolio, it may take longer to build it song by song- but it will give you more control over what goes on your portfolio",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1124119116106694796",
    "author": "Rollmottle",
    "date": "2023-06-29",
    "content": "(in theory of course)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1137112306732511263",
    "author": "JONESY",
    "date": "2023-08-04",
    "content": "I am willing to pay a professional at this point. Would love to get back to creating music that's for sure! Thanks for your help @Rollmottle @Nomograph Mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1154815321811730492",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-22",
    "content": "What would you consider the best beginner online music education for contemporary music making and methods? If you had a child who wanted to get into making music via online classes, where would you send them and why?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1154843795733631068",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-22",
    "content": "Let me push back for a moment here - I think I agree with what you're saying, but I'm not feeling like you're addressing the question. \n\nYou for example say \"technique is teachable\" - so where would you send people for that? \n\nI think it can be tempting be relativistic about everything to do with music and artistry, but if you interact with people who feel lost and want some guidance to get their footing in the space, arguing tenacity alone might not be the way. Many people's learning style is to watch online courses etc, especially when entering a subject for the first time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1159945603988590592",
    "author": "peterlabberton",
    "date": "2023-10-06",
    "content": "I tried it for a while on my studio rig, and even hardwired into fiber internet it would drop on me sometimes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1178181434721189918",
    "author": "! Andy !",
    "date": "2023-11-25",
    "content": "sorry about the late reply, internet goes down here when it rains 😂 - interesting though, just tried your output into input idea & same deal, 0 signal. This time no white noise when cranked either (because the 273 is out the equation) so the interface is registering the 273 all ok, but won't actually recieve volume from an output into one of the inputs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1178183945842610226",
    "author": "! Andy !",
    "date": "2023-11-25",
    "content": "for the ammount of \"setting up\" tutorials they're are online, i'm struggling to find any that talk about how the actual output & software communicate, further than \"it outputs vvolume/turn up & down\" etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1178193299023085628",
    "author": "! Andy !",
    "date": "2023-11-25",
    "content": "(unless i plug something else in of course like a gtr)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1178814106468360192",
    "author": "OJ",
    "date": "2023-11-27",
    "content": "Does anyone know a way to track whos uploading your music to youtube/streaming services? Like content ID stuff...\n\nSay I upload some beats to youtube, someone rips em and uploads it, how to track whos doing that...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1181000784054337546",
    "author": "jonmatteson",
    "date": "2023-12-03",
    "content": "if you have any specific tuning q’s feel free to dm as i used to spend my days wrangling drums full time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1181296876503437403",
    "author": "john",
    "date": "2023-12-04",
    "content": "https://www.youtube.com/watch?v=QlG2eFOCFWU&t=474s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1181298924863107113",
    "author": "popthetrunk",
    "date": "2023-12-04",
    "content": "You gotta be them to make their music, but you can make your own hits if you practice and work enough to get in the right situations edit: and with enough luck",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1194387615319863406",
    "author": "M3MIYAGI",
    "date": "2024-01-09",
    "content": "Im looking to be a full time audio engineer, mostly mixing and recording, I interned at a local studio for about 8 months n learned alot, went to a few other studios but I wasn't feeling their \"system\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1194388782477226045",
    "author": "cian riordan",
    "date": "2024-01-09",
    "content": "Most studios these days are one-person operations with the owner typically being the main engineer/operator. There might be budgets for assistants and runners... but even that's becoming less of a thing nowadays.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1194389999978819795",
    "author": "cian riordan",
    "date": "2024-01-09",
    "content": "How I started my career in music? Or how I got a job at a recording studio? Or both?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1196655456786059265",
    "author": "! Andy !",
    "date": "2024-01-15",
    "content": "Heyo - any idea how to get the effect at 0:40 on the lyric brain?? Been trying to use a granulator with some sick automation for it but it just ain't cutting it https://www.youtube.com/watch?v=Zm7c2FDb7jQ",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1196852385037955183",
    "author": "rse",
    "date": "2024-01-16",
    "content": "does anybody have any recommendations for tutorials/reading material on club systems? Very interested in learning more about basically the whole signal flow from cdjs to the speakers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1203425543228366928",
    "author": "popaganda.",
    "date": "2024-02-03",
    "content": "I have no clue where to post this, but it's kind of an advanced newbie question in a way. I've been doing some editing for a friend who records nature full-time. She sells the recordings online, and the clientele is presumably people in gaming, film, and app dev. A lot of the recordings are double mid/side and we're trying to figure out what's standard or expected in those industries when it comes to deliverables for multichannel recordings. 3 channel for the client to decode? 4ch? 4 stems front, back, L, R? Mono front, mono back, stereo L/R? maybe a long shot but does anyone have experience in this world?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1209978226168832020",
    "author": "NoahNeedleman",
    "date": "2024-02-21",
    "content": "I hated the songs, felt he was unprofessional, his notes bugged me to no end, and everything he asked for made the song worse. That record was half duds because he had bad taste.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1209979297423556639",
    "author": "NoahNeedleman",
    "date": "2024-02-21",
    "content": "2) I quit touring and have been producing full time for the last year or so",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1222759632515240007",
    "author": "BoozleBAM",
    "date": "2024-03-27",
    "content": "I do like it thus far. I don't pan the mics hard R and L either, but rather at about 66 degrees, maintaining as much of the integrity of the kit image as possible. Makes a difference.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1232193167936458782",
    "author": "FlugeBluge",
    "date": "2024-04-22",
    "content": "I could use some advice. I just helped out on a recording with a medium-sized indie label, kinda bouncing between assistant and main engineer roles. It was only for a couple of days, but I was hoping to see my name in the credits on allmusic and... nope, nothing. What should I do? Any tips? Thanks for any isnight.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1232204236650053703",
    "author": "BoozleBAM",
    "date": "2024-04-22",
    "content": "You BETTER fuckin' rock that boat, bro!! Come on. And - Even if you don't get formal credit like in the liner notes, you can still claim the work you did in your portfolio. I worked with a producer who did \"co-production\" on one of Rage's records supposedly. His name isn't in the notes, but he sure put that thing front and center on his website. lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1232204859378237460",
    "author": "BoozleBAM",
    "date": "2024-04-22",
    "content": "But if you don't, claim it in your portfolio anyway.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1232336410975928361",
    "author": "jordanmcleod_io",
    "date": "2024-04-23",
    "content": "If you have direct contact info for someone at the label that you interacted with, I'd say it's worth a shot. When I was an intern several years ago, I was thrown into my first big recording session with an 88rising artists because the artist's engineer did not know Pro Tools. I forgot about the song until I saw a billboard for the artist months later, so I looked up the credits and I was not on there. I double checked the recording was the same thing I did, and it was, so I emailed the contact I had about adding my name to the credits and they were super easy about updating the metadata.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1236139200986878046",
    "author": "noahc",
    "date": "2024-05-03",
    "content": "I’m reading that you can install packs. Saw the jamirouqui keys guy on YouTube has some",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1252667813622054943",
    "author": "bobby k",
    "date": "2024-06-18",
    "content": "Let me preface by saying nothing tangible has got me feeling down or discouraged. In fact I think I'm in the best season of my life so far and it feels like everything is going right (aside: aren't you more likely to self sabotage when things are good than when they are bad?) to zoom out a little bit, i already know the answer. I'm doing too much at once, spreading myself thin beyond enjoyment. in the grit of a transition and it's clear where I'm going but I have no frame of reference for the timeline. A few years ago, I was mid-20s, in a band on a major, had roommates & cheap rent, and a chess app addiction. i was still a \"professional\" but things were extremely simple. in short, left the band, spent a few years mixing much more than producing, and now am swinging back that way. I'm about to turn 30, I have a mortgage, a (semi) dependent, my first real studio, an intern to set an example for, 5ish mixing clients at any moment, producing for 3 artists and co-prod/consulting on 2 other projects, playing occasionally in any of 4 different bands, and producing/recording some live performances (as well as starting a YT channel in this lane). In my experience at least, it really seems like something shifted at the top of this year, and I hate to say it but part of the fault is TikTok (is the rest of the fault mine?). Everything is urgent to everyone and nothing informs each other or oscillates together. It feels like a clock is constantly going \"tick, tock, tick, tock\" and the anxiety I once had over money is shifted completely towards my time management. Every time I look away from my phone I have 30 new texts. I think I'm crushing it in my professional demands but I don't know that I'm being the person I want to be for my friends, family and partner. I don't know that I'm setting a good example to this intern. I don't know that I'm there to take care of myself all the way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1254908287757979728",
    "author": "jet",
    "date": "2024-06-24",
    "content": "very true\n\nif its all you got then it either works or it doesn’t, it becomes much simpler than balancing effort and commitment with another career (not that its impossible, its just that I dont enjoy being mediocre at a job when I could be great)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1254910096744382556",
    "author": "Nomograph Mastering",
    "date": "2024-06-24",
    "content": "Worth considering what you think is expected of you by others, what norms are, what you think music as a career can reasonably deliver",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256435578522828850",
    "author": "Nomograph Mastering",
    "date": "2024-06-28",
    "content": "There's a thing that happens all over the audio internet which is engineers of all ages asking \"what about this shiny rock?\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256438267801239664",
    "author": "BoozleBAM",
    "date": "2024-06-28",
    "content": "We're just two strangers onthe internet trying to acheive things.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1256438768747937833",
    "author": "Nomograph Mastering",
    "date": "2024-06-28",
    "content": "Where I came up I had no mentor, no studios to access and it was pre internet",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256444143903707226",
    "author": "Nomograph Mastering",
    "date": "2024-06-28",
    "content": "Probably the best vibe of any internet community I've been a part of",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256652557695320209",
    "author": "Rollmottle",
    "date": "2024-06-29",
    "content": "the goal here is to raise the bar of the discourse, not lower it. we have our fun and indulge in our own brand of idiocy at times, but you would know when you cross over the line if you slowed down and grokked the vibe of this server before speaking.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256656473082171472",
    "author": "Slow Hand",
    "date": "2024-06-29",
    "content": "Take some time to think about what's just happened and what these professionals have been very graciously trying to to tell you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256658703336079522",
    "author": "Josh",
    "date": "2024-06-29",
    "content": "Of course they do. I’m trying fill the void",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1257300629068714005",
    "author": "BoozleBAM",
    "date": "2024-07-01",
    "content": "I'm curious: Does anyone here have any insight into the drum sound on Foo Fighters \"My Hero?\" It's a really wild drum sound. Whenever I'm driving and that song comes on the radio it always piques my interest... I've been sifting through a few different reference tracks recently, and I just listened to it on headphones for the first time. They do some really wild stereo stuff with the drums in the intro and the chorus - You can hear it really pronounced on headphones. It's actually a little disconcerting hearing the cymbals basically mirroring each other in the left and right like that - and the snare, too. The cymbals also have a very pronounced \"BWEEESHHH...\" sound. It's a very unique sound... I suspect there were a lot of room mics going on in that sound, but of course I have no idea. Anyway, would love to hear from anyone who might know.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1258823426534277153",
    "author": "bobby k",
    "date": "2024-07-05",
    "content": "Considering looping in my lawyer for sure. I bet he's got somebody over there he already knows so that's a no brainer. but was hoping to avoid that if possible. currently self-managed as my former manager is transitioning careers and wouldn't wanna take him on a potential 14 month side quest haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1262843889174188152",
    "author": "Edward Rivera",
    "date": "2024-07-16",
    "content": "Ah, but they’ve been out of production for while no ? FWIW I used them before 2012. And of course stuff should be built to last…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263588556061020234",
    "author": "Rollmottle",
    "date": "2024-07-18",
    "content": "https://www.youtube.com/watch?v=IOy1_qMAt6E\n\nhttps://www.youtube.com/watch?v=E3c_UPu1UTE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263615434494836737",
    "author": "Josh",
    "date": "2024-07-18",
    "content": "Reaper is only good if you have the patience to make it work using your four year coding degree",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263733897955377175",
    "author": "cian riordan",
    "date": "2024-07-18",
    "content": "You've got a community of professionals here willing to help and answer questions. You're gonna be out to sea with Reaper, Audacity, et al.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263736396011536456",
    "author": "BoozleBAM",
    "date": "2024-07-18",
    "content": "I was talking about youtube channels - Like, quick \"Getting started\" tutorials...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263745178691178536",
    "author": "mixedbywong_my",
    "date": "2024-07-18",
    "content": "I used to work in PT loads from 2004-2010, then transitioned to Logic then back to PT and now in Cubase for last 8 years . What made it easier for me was mapping all my cubase or logic key commands to be as close as possible to the PT one . Doing that really helped my brain adjust to the diff DAWs ( of course there’ll be some workflow  changes to get used to .)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263837249045397587",
    "author": "rawssx",
    "date": "2024-07-19",
    "content": "you are right, thanks i’ll think about that. that was just an example, i am not pursuing sound engineering as a career, my main gig is the singer, songwriter and producer side but i love to learn the engineering side as much as i can. i dont see a reason (yet) to move to PT, as i am not taking any mix work from any clients. hope that makes sense",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263850843480784940",
    "author": "BoozleBAM",
    "date": "2024-07-19",
    "content": "Right, right, yes, of course. I'm aware. I just wanted to download it to get a feel for the flow again.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1264409959563530374",
    "author": "h3x",
    "date": "2024-07-20",
    "content": "Thanks man! I think im in a weird stage of my career where Ive done some mixes that im extremely proud of and i know can hold up well in the real world, but also still feel like i dont know anything. I think hearing a client say that the vocals i did from scratch sound bad while the copy and paste ones from an older song sound good took a stab at my ego a bit. I think this is a big learning experience for me for sure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1264419323838206025",
    "author": "BoozleBAM",
    "date": "2024-07-20",
    "content": "Very newbie question here: I've just finished tracking drums for my first album. I played along to guide tracks of bass, vox, guitar and click, of course. The intention was for these tracks to be replaced after the drums were laid. Should I: 1. Slip edit the drums now and then stack the new bass, guits and vox ontop of what is essentially the final drum edit, or 2. Play the final bass, guits and vox now and then slip edit everything kind of at the same time/ stage? - Or is there another process ya'll recommend?? Thnx.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1264420469474590741",
    "author": "BoozleBAM",
    "date": "2024-07-20",
    "content": "Any suggestions on how to \"key in\" to this?? I played everything pretty well, and I can't really see myself doing too much editing, to be honest - But I've been watching youtube vids the past few days and I'm seeing people do everything from basically nudging a kick here and there, to all out identifying the transients of every little hit and super going bananas...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1267134359203483759",
    "author": "Iwan Morgan",
    "date": "2024-07-28",
    "content": "If it’s any consolation I googled then downloaded a 120 bpm click a few weeks ago as the Pro Tools Click wasn’t working, and even the downloaded file was not consistent. Luckily spotted it before tracking to it. But, this kind of stuff happens all the time, the main thing is to build a strategy into your practice which expects it to happen and then zero in on ways to make it less likely to happen or at least have the tools to fix things.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1267231287576498277",
    "author": "Edward Rivera",
    "date": "2024-07-28",
    "content": "I’m butchering the exact wisdom, but it was said to me that often when nearing the finish line of a record, it’s common practice for people to compile a list of all the reasons why the audience won’t like their record. It’s now their duty to tend to these things and not consider their work complete until all these little nuisances have, one by one, been crossed of this holy list…et voila ! It’s _perfect_ !\n\nFWIW I wouldn’t want to consume any body of work made from this perspective",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267270955722342461",
    "author": "Bryan DiMaio",
    "date": "2024-07-28",
    "content": "And these are all questions you’ll be able to internally ask yourself throughout the process",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267608601560743998",
    "author": "Bryan DiMaio",
    "date": "2024-07-29",
    "content": "typically on traditional speaker designs you want them more or less angled towards you at 30 degrees, but with a coaxial design (the midrange driver and tweeter are besties) you'll want to toe them out a bit from that typical 30 degrees, so more like 20",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267800392306266123",
    "author": "BoozleBAM",
    "date": "2024-07-30",
    "content": "2. I'm experimenting with delaying room mics (drums again, 20-30ms) and I've noticed that if I have the \"Effect\" level on the delay turned up to any degree, that I get this very wild, \"clattering\"/ oscillating sound. It almost sounds metallic. It's really unpleasant. I'm aware delays can get really wild, but this type of sound is something I've only noticed when delaying room mics. It's something unique to them, I feel - at least in my situation.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1267832043643998249",
    "author": "BoozleBAM",
    "date": "2024-07-30",
    "content": "Here's what I'm kind of dealing with now, though - I watched this the other day: https://www.youtube.com/watch?v=Iqmsb6BqeRU&t=2s It was a really great peak inside a professionals process for me. The way this guy sends things out and compresses the drums bus, like... he's constantly weaving the sounds through all this gear. I've been wondering how people produce that incredible sound for a while now and this is my first view of a real mix. Like, my stuff is NEVER going to sound like that - The process... I can see how he created such depth, but I mean... my mixes are WAAYYY far off from this. lol. It's encouraging and discouraging at the same time - Sobering to see. The gear and the weaving in and out, I mean... it makes a difference... Like, he's got that EXTRA shit going on...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1269449518114406532",
    "author": "BoozleBAM",
    "date": "2024-08-03",
    "content": "Oh, oh, right right yeah, I get what you're saying. Yes, of course. Thank you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1270836580545986582",
    "author": "FlugeBluge",
    "date": "2024-08-07",
    "content": "Was original thinking about asking this in #🎹production-talk or #🟣pro-tools, but figured I try here first. \n\nCan someone point me towards videos, tutorials, classes etc on advanced editing workflows? Basically, I'm looking to learn how professionals do their vocal and live instrument editing. Their techniques, tips, etc. (How they go fast. When to do what.) I'm looking to improve past the basics.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1270838950256181350",
    "author": "cian riordan",
    "date": "2024-08-07",
    "content": "I would imagine these sort of specific usecases would be hard to find in a Youtube, content-creator format. Most the people doing this at a high level are busy and aren't making videos about it. Are you in a place where you might be able to shadow some heavier-hitting engineers?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1271047087336722474",
    "author": "yaldaram",
    "date": "2024-08-08",
    "content": "URM Academy fast tracks has amazing session prep course, editing included",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1271047448571412553",
    "author": "yaldaram",
    "date": "2024-08-08",
    "content": "And other specific courses too like melodyne, editing poor drums etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1274706252496109589",
    "author": "BoozleBAM",
    "date": "2024-08-18",
    "content": "I just need(ed) some exposure to a real mixer going from start to finish, and I think this MWTM thing was just the ticket. Great place to start. Basically... I want an SSL now. lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1274858950323601523",
    "author": "BoozleBAM",
    "date": "2024-08-18",
    "content": "- Of course I offered to cook for him. Lol. Just kidding.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1278514634650943500",
    "author": "BoozleBAM",
    "date": "2024-08-28",
    "content": "@Bryan DiMaio I just followed this video on a whim just now and I can now access the files. I lost two sessions that I tried to open on the other computer for whatever reason, but I can access the rest of the files now, which is tight. Whew. Going out to get the T7, though. Fuck all this nonsese: https://www.youtube.com/watch?v=Ix13LRGmzk8",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282405300992999487",
    "author": "Adam Thein",
    "date": "2024-09-08",
    "content": "If I remember right you are on an older mac?  If you want to squeak out some extra life if you haven’t upgraded the internal drive to an ssd yet that could be a worthwhile upgrade",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1283493408391954494",
    "author": "Bryan DiMaio",
    "date": "2024-09-11",
    "content": "(keeping a backup of course)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1283494279666208790",
    "author": "BoozleBAM",
    "date": "2024-09-11",
    "content": "This is exactly what I've been doing. I do pre pro on my upstairs laptop and work straight on to the Samsung (or whatever drive). I save the sessions straight on there. I then take that drive downstairs to my tracking room and tracking on another computer. As soon as I take that session upstairs and try to open it up again in Reaper I get the message \"there was an error trying to open session 142.\" I got back into where I saved the files and it's completely gone. This of course doesn't happen every time, but it happens enough.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1293053144418357298",
    "author": "vostral",
    "date": "2024-10-07",
    "content": "Hello everyone!  I have this question: I'm a producer from Vietnam. Currently I'm using Focusrite 2i2 and a pair of Focal Evo 65 to mix and master my own songs. Even though i've learnt and practiced a lot of mixing stuff but my mixes sound still amateur. I'm thinking of upgrading to UAD Apollo for better converters as i've learnt that DA converter does affect what i can hear out of my speakers. Could you guys kindly give me more insight into this issue? Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1295405360374480982",
    "author": "cy (sigh)",
    "date": "2024-10-14",
    "content": "there's are people way more versed on this but an absolute phase shift would be a polarity flip or 180 degrees. besides very specific filter types any EQ move is usually changing the phase to PART  of the signal to get the new freq response. it is not absolute \n\nEQ changes the phase to change the frequency (not the other way way around).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1295609932074455141",
    "author": "spectrummasters",
    "date": "2024-10-14",
    "content": "I’m fascinated with phase and waves . I expect this might all be familiar to you but it seems there’s some handy info about phase and audio here https://mycourses.aalto.fi/pluginfile.php/666520/course/section/128564/Jon%20Fagerstr%C3%B6m_1929997_assignsubmission_file_AAT_Seminar_paper_Phase_Equalization_JF_FINAL.pdf?time=1558421096226#:~:text=Phase%20equalizers%20are%20filters%20that,response%20of%20a%20given%20system.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1295611646600810510",
    "author": "spectrummasters",
    "date": "2024-10-14",
    "content": "I also use SSL’s X phase a lot , as much to investigate how many different ways one can adjust phase on a source and to listen to the interplay between sounds . I’ll usually always employ it on low end elements at the moment , just as much as an educational tool as anything . You can do much much more than flip the phase \n\nAnd finally phase rotators . I got really into these . RX has one . And the manufacture who make that teote plug in make one and Maat I believe .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1297609304379097281",
    "author": "itaylerner",
    "date": "2024-10-20",
    "content": "I still don’t understand how you guys use Melodyne in standalone instead of in the daw, gotta do some YouTube research",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1297640002695462953",
    "author": "EliHeathMusic",
    "date": "2024-10-20",
    "content": "For manual de-essing do you prefer using Melodyne over clip gain and RX? Or do you do multiple passes using different tools over the course of working on a production/mix?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1297659923164958761",
    "author": "BatMeckley",
    "date": "2024-10-20",
    "content": "It’s just so intuitive and so easy, and when you have all the doubles and harmonies lined up you can really match pitch and timing to comically tight tolerances. Earlier on in my career I actually fucked up a project with Larry Klein because I tuned and timed the harmonies too tight and it collapsed the stereo field. It’s very easy to get things so locked in in standalone that you can get everything to phase.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1298677628672151612",
    "author": "Josh",
    "date": "2024-10-23",
    "content": "I feel like it’s less of an issue the better the I get, and of course the better the vocalist is. But that’s always something that’s scared me after I have a couple nasty choruses",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1304347189761277954",
    "author": "vostral",
    "date": "2024-11-07",
    "content": "Hey, could you guys tell me what are the meaning of the colors of user's name?? It looks like the Purle ones are professionals here right?????",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1308008136048640000",
    "author": "spectrummasters",
    "date": "2024-11-18",
    "content": "The pre production phase starts here and the rest of the  stages of the record can be found in his playlists \n\nhttps://youtube.com/playlist?list=PLzjpyd_mw14ytMOkQO6l_6aOJL4-Jn-Gr&si=fgOhhDH79hYYX2DD",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1308919153398251591",
    "author": "bobby k",
    "date": "2024-11-20",
    "content": "Producing/recording my first rock track & would love any tips on getting the drums right! I know Cian already crushed a LFTWR tutorial in here I should revisit that discusses parallel saturation n such. We tracked today, got 441s on kick and snare top, sm7b’s on snare bottom and hat, LCR overheads with my 251 in center and some flat pencils L/R, M201 on each tom, some random Omni EV mic on crotch and a stereo ribbon in the room (r88 clone). Room is rather dead but it’s 600 sq feet so we still get some life out of it when rocking. Refs are like anything Steve Albini has touched, as well as that latest Bully record. I’m mostly working on soft pop Americana type stuff so this is a very fun new adventure. So far really digging slamming the left right overheads with saturn2 transformer, may sample replace kick and snare but just with samples we took at the end. Any tips on making that shit slap in a crunchy modern way would be appreciated ❤️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1311740285306409040",
    "author": "spectrummasters",
    "date": "2024-11-28",
    "content": "Oh of course !! Right . Send my music , drums and bass to a bus , glue it there then send it to the 2 bus to meet up with the vocal and just the final  limiter . Brilliant. That’ll give me the little bit of pumping off the low end I want",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1312409769654616145",
    "author": "TEYAH",
    "date": "2024-11-30",
    "content": "The artist abandoned the song, however, I feel like it's good to try new and improved techniques for old mixes. This is just practice but I feel that it will be useful to know how to deal with intense bleed for future mixing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1317262544372502548",
    "author": "Zack Hames",
    "date": "2024-12-13",
    "content": "1000 words to say what everyone else said in 10, but this has bothered me for my entire career and I feel like I’ve maybe made some headway now that I don’t abhor every mix I do now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1323494678548709396",
    "author": "popthetrunk",
    "date": "2024-12-30",
    "content": "😂  do you want to hide your traffic from whoever is serving your internet or do you want to tunnel from let’s say your studio to someone elses",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1324191978363158559",
    "author": "SawyerM",
    "date": "2025-01-01",
    "content": "Hey I am going through the live stream backlog and I am finding it very valuable... That is not something I can say about a lot of resources available. Ever since I started watching the video series my YouTube recommendations are full of garbage tutorials. I was wondering if people could share resources they know are accurate and valuable. So far I have found Dan Worral, Electrical Audio, Yamaha's book and this. Any other recommendations would be appreciated!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1334523570566594651",
    "author": "BoozleBAM",
    "date": "2025-01-30",
    "content": "Howww... is everybody recording DI bass?? Last time I think I just went XLR out of my Radial Passive DI Box into the front of my interface, but I dooonn't... think that's right? Maybe I had some type of additional preamp going??  It was a little noisy if I remember correctly. Surprisingly, after 30 mins of Youtube I couldn't find a straightforward tutorial. Everything involved an amp or a PA or something else weird...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1340461502791942296",
    "author": "cian riordan",
    "date": "2025-02-15",
    "content": "Pros and cons, like anything else. Open back tend to have a more neutral response… almost closer to being on speakers. Less fatiguing. Downside is lack of isolation from outside world, lack of low/high end “hype”. Neither are a panacea and both will have their issues with translation to the outside world. I can mix in headphones because I’ve mixed in good sounding rooms as built up good practices - with good results - for 20 years. But it isn’t my ideal. I would almost always trust a decent sounding — even unideal room before solely relying on them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345034439247532053",
    "author": "masteredbyjack",
    "date": "2025-02-28",
    "content": "What you described above is definitely important re: \"breathing of track\"...but I also may use a longer lookahead or something if it's a soft track to make things smoother and closer, more intimate, whatever. So there is not really one way (from my side), which is of course why it changes every time. Reps reps reps",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1348015038119804938",
    "author": "Bryan DiMaio",
    "date": "2025-03-08",
    "content": "okay so now practice recording guitars etc to drums",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1348016533611216947",
    "author": "Bryan DiMaio",
    "date": "2025-03-08",
    "content": "which in that case just practice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1348019419888222241",
    "author": "BoozleBAM",
    "date": "2025-03-08",
    "content": "Thank you everone for everything. Best community onthe internet!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1348075416971251792",
    "author": "cian riordan",
    "date": "2025-03-08",
    "content": "All we can offer is advice from the realm of professional music makers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1349076081700900934",
    "author": "BoozleBAM",
    "date": "2025-03-11",
    "content": "Boy, I've been finding a hard time finding someone actually professional who can do it in an expedient fashion.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1349076732161822741",
    "author": "BoozleBAM",
    "date": "2025-03-11",
    "content": "But my question still stands for everyone knowledgeable about a mixing course/ program in the Midwest. Please le me know.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1349081336735862824",
    "author": "BoozleBAM",
    "date": "2025-03-11",
    "content": "I would love to do both - At least have the skills to. If I had to prioritize one, it would absolutely be to be fully independent in making my own music; fulfilling my vision with as little outsourcing as possible... But I do have a real love for colaborating and producing/ songwriting for people, so I would really, really love to do more of that on a professional scale.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1376670701582291016",
    "author": "BoozleBAM",
    "date": "2025-05-26",
    "content": "Holt shoot this thing looks INSANE... https://www.youtube.com/watch?v=O7AT6mDRtnM",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1385688270658211840",
    "author": "Zey",
    "date": "2025-06-20",
    "content": "Hey everyone, what is the best way to record your screen with the internal sound on a Mac? I tried BlackHole upon Google’s advice but it looks sketchy and doesn’t work at all with Logic or even GarageBand when you’re screen recording those",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1387151768231739474",
    "author": "Zey",
    "date": "2025-06-24",
    "content": "Thank you all! Will try these and report back. Just trying to show a friend how I did a few things so I don’t need anything to be super professional. One of these has to work 😁",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1389756406433058857",
    "author": "BoozleBAM",
    "date": "2025-07-01",
    "content": "Just messaged the organic lordes at the radio station via internet tele mail. They should be getting back to me soon with some organic goodness. At least i sure hope so!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1390422575913631805",
    "author": "Ciweeeee🐢",
    "date": "2025-07-03",
    "content": "Just reminded me that the dude who invented the Uni Vibe pedal was inspired by this effect when he picked up international radio stations, contrary to people believing it was trying to mimic the Leslie rotating speaker. If I'm not mistaken he also worked for Korg in designing the MS-20!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1392534781454975077",
    "author": "James Cronier",
    "date": "2025-07-09",
    "content": "yeah, I'm a lefty on the mouse, so rocking asdfg on my right hand is a bit odd. of course it's gonna be a process to re-learn but I wanna make sure what I re-learn is something I wanna keep in the long run.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1393665756507668552",
    "author": "Rollmottle",
    "date": "2025-07-12",
    "content": "one of the most obtuse, snowflakey keyboard shortcut creators around, but yeah, you can customize RX shortcuts to the nth degree",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1393914321112924301",
    "author": "Ross Fortune",
    "date": "2025-07-13",
    "content": "In the UK there are specialist providers for musicians and producers with studios. You submit a spreadsheet of your inventory including the value it would cost to replace each item (I update annually based on reverb / eBay current prices), and the location of cover needed (just in studio, or maybe on the road nationally or internationally if you play shows too). \n\nNot sure if the same in the US but I’d imagine there’s similar.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394113306754678854",
    "author": "SawyerM",
    "date": "2025-07-13",
    "content": "Hey, my first few projects that I've worked on are getting close to releasing. With that I have a few questions about how to best use Instagram for advertising myself. 1. Should I make an engineering specific account? 2. Does it make sense to make posts for every release or just stick to stories? 3. I would appreciate any best practices or things you wish you did when getting started with promoting yourself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1398203008545853450",
    "author": "BoozleBAM",
    "date": "2025-07-25",
    "content": "Communication is so often lost over internet servers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1398346442862498043",
    "author": "LAPhill",
    "date": "2025-07-25",
    "content": "After spending the morning with the search function and ChatGPT, I would happily spend some money on a LWMR guide to RX. \n\nThis is a great idea though - quick little primers on a variety of topics, best practices, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1398678408124174366",
    "author": "BoozleBAM",
    "date": "2025-07-26",
    "content": "That's why I hate the internet. Anyway.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1398684274840043595",
    "author": "BoozleBAM",
    "date": "2025-07-26",
    "content": "Well, I'm not going to say that I don't think I'm talented, but it was kind of... not said that seriously. That's why I said that I hate the internet - and that communication can be often lost.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1398705343122378752",
    "author": "BoozleBAM",
    "date": "2025-07-26",
    "content": "Well, in order to do that, we'd have to take some time and actually talk about what happened and not restaurant analogies. And, like I said, over the internet - I think it's just so easy for misunderstandings, but anyway... yeah?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1398705987078193202",
    "author": "Edward Rivera",
    "date": "2025-07-26",
    "content": "Keeping things here helps me auto regulate my train of thought, and could potentially help others. Not sure a DM would help because it’s still “the internet” but my inbox is open to you always, just can’t promise I won’t make analogies. They’re useful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1398740919062237274",
    "author": "Slow Hand",
    "date": "2025-07-26",
    "content": "I'm not Conor, but I'll jump in: That Mr. Beast document is illuminating because it drives home how single-minded, clear, and focused he is on his objective. So the remarkable part - for me - is that he's not trying to make great videos. He's trying to make great *Youtube* videos. Videos that perform exceptionally within the Youtube ecosystem. It's extremely focused and his messaging is crystal clear.\n\nFYI, that excerpt is from an internal document for his business that was made public. It's all about orienting his staff towards how they do things, and what they are here to do. To get everyone aligned on the mission. It's a pretty remarkable act of leadership; whether you like Mr. Beast or not.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1410005616663068806",
    "author": "Yu Justin K",
    "date": "2025-08-26",
    "content": "As purely an instrumentalist at the moment, I'm trying to expand the sounds I can get in my productions with singing (mainly supporting artists with BGVs/vocal pads/doubling etc.).\nMy voice and tone is very weak to support artists in most styles at the moment, so I'll be starting from ground 0 in my practice routine.\nSo far, I've been practicing going up and down scales with a met (half-time and full-time), using different syllables thru the scales, and singing long tones with different syllables.\n\nDoes anyone have sources and or advice for a beginner to strengthen their singing voice?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1410339609094651945",
    "author": "Yu Justin K",
    "date": "2025-08-27",
    "content": "Thank you Matt and Beck for the advice!\nI've also been recording all my practice sessions with an R84 (trying to hear myself as un-hyped and as transparent as possible), listening back to them and taking notes during breaks, so I'm glad it sounds like I'm heading relatively in the right direction.\n\nFinal question: is there a point where you can be singing too much and do more harm than good to your vocals (as my end goal is not really going for a totally thrashed and raspy voice)? Is that the point of having daily vocal warm ups, where they're meant to keep you going for 4+ hours of singing when needed? Just trying to be pretty cautious of how I start out so I don't potentially build harmful habits with singing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1437161556243648532",
    "author": "Zack Hames",
    "date": "2025-11-09",
    "content": "(To a point of course)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1439396779379527815",
    "author": "Bryan DiMaio",
    "date": "2025-11-15",
    "content": "And the server is *not* necessarily a backup, still practice safe data storage",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1445832980982399142",
    "author": "AJ",
    "date": "2025-12-03",
    "content": "Does anyone have experience with YouTube music? \n\nI’ve been eyeing Spotify replacements, and I’ve definitely ruled out Apple Music. The added benefit of ad free videos is enticing to someone  who watches a lot of them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1445839074253475940",
    "author": "Edward Rivera",
    "date": "2025-12-03",
    "content": "Best short video I’ve found on the subject \n\nhttps://www.youtube.com/watch?v=D5jX_2tbeic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1450250481845666005",
    "author": "AJ",
    "date": "2025-12-15",
    "content": "Just as an update: I tried YouTube Music for a bit, and didn't like my experience on it. Going to be switching to YouTube Premium Lite to get the ad free videos. As for music, this is my first day on Tidal and... I wish I switched sooner. Y'all weren't kidding about the audio quality difference! Not to mention the ethical considerations, and the ability to send a music link that opens to any streaming platform. Appreciate the suggestion!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1458894505443856536",
    "author": "Kian",
    "date": "2026-01-08",
    "content": "Hi guys. I’m getting to a point where I feel like I could really benefit from some mentorship, but I’m not familiar with how those relationships tend to function in the space. \n\nI see some of you mentioning past mentors, how did that come to fruition?? Was it on paper internships at their studio? Or did you seek them out specifically and pay for their time?\n\nIdeally I’d like to work under someone, but I’m not sure how to open that door.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1458935154042081290",
    "author": "sinaigimenez",
    "date": "2026-01-08",
    "content": "@oaklandmatt , your experience with EV is really interesting and makes me think about cultural differences. This question goes out to anyone with experience in this. I’d love to have a mentor too. I’ve been a musician since I was a kid, producing for 17 years and mixing for about 10. Even though I make a good living from this, I’ve always missed having a mentor figure.\n\nIn my country there aren’t many role models, so I’ve always looked to the UK/US. That makes me wonder if my approach fits the Anglo world. I’ve written to mixers I really admire, offering remote assistant work in exchange for learning, but most already have assistants or aren’t interested. I get it—I’ve been approached the same way, and I can’t always afford or fully trust an assistant either.\n\nA producer with big credits was very generous with me, taught me a lot, and said he’d keep me in mind. Once he even contacted me for some drum edits on a known band’s record, but he ended up doing it himself because he was in a rush. Over two years, I only reminded him twice that I was available. So when I read that you used to call EV every two weeks, it honestly blows my mind. That’s where my question about cultural differences comes from\n\nIn my country that would feel inappropriate, but I often notice that in the Anglo world, insisting (within reason) isn’t seen as a bad thing. Any advice? I’m pretty shy and always afraid of coming off as annoying. I’d love to hear your thoughts guys",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1458989307758121072",
    "author": "Kian",
    "date": "2026-01-08",
    "content": "Thanks Matt! What I’m picking up is keep my head down, make sick records and take full advantage of any opportunities shown to me. It seems like internships/assistant positions are altogether quite rare these days, hopefully I can find something. Any advice for something you’d like to see in a cold email?? Is that the route, or do you reckon establishing contact with other intentions first?\n\nYour advice on personal connections and trust really speaks to and affirms what I’ve been trying to cultivate. Living in a smaller town, those connections come easily and run deep, but often without the same big city opportunities.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1459020986317013163",
    "author": "cian riordan",
    "date": "2026-01-08",
    "content": "I just cold reached out to Eric V. after I met him through Matt. Told him I wanted to just hang on the couch for a day and watch him work. Two weeks later I'm moving to LA to work for him. @Tyler Graham hit me on this discord forum almost 4 years ago to come by for coffee -- he ended up working as my mix assistant until this past summer... he is now the head engineer at a new studio in town.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1459021471480418469",
    "author": "cian riordan",
    "date": "2026-01-08",
    "content": "But also realize that mentorship does not equal a career... you still need to be able to operate on your own two feet, outside the shadow of whoever you're trying to work for.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1459070363542749184",
    "author": "oaklandmatt",
    "date": "2026-01-08",
    "content": "There are actually several questions we answered like this.\n\nDon't sleep on just going to YouTube and typing \"live with matt rad\" and whatever topic you might be curious about. We did a lot of Q&A, so browsing and searching through YouTube is kinda like a FAQ",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1463989587406880870",
    "author": "spectrummasters",
    "date": "2026-01-22",
    "content": "He expressed to me how engineering and an engineering mind / understanding was a part of a citizens education and socialisation and development  .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1471857582799978649",
    "author": "GenoFlux",
    "date": "2026-02-13",
    "content": "Hey everyone, new to the channel - I'm wanting to try selling some Kemper profiles at some point later this year. Would anyone actively selling profiles be open to sharing some best practices with launching and promoting the website/if there are third party sites that sell profiles for others?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1471861557859323927",
    "author": "hyanrarvey",
    "date": "2026-02-13",
    "content": "For sure! Best way to promote them is to get people who have dope ass guitar tones go use them in productions and shout you out on the internet",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472083946698444800",
    "author": "masteredbyjack",
    "date": "2026-02-13",
    "content": "To illustrate a good example of the difference and why (guessing) Jon would want to clip rather than do this (which would control the transients as you describe)\n\nIf you use a long look ahead, call it a limiter with a long look ahead. That will let the processor know about the transient well before it hits the GR circuit, thus avoiding distortion/harmonics (of course there still could be some artifacts). But even though there will be samples at the threshold, it won’t be a straight line waveform as if you clipped it. It is pushing the waveform down. The waveform itself is actually changed still, so it is not exact but it’s different than clipping.\n\nA clipper just squares it off. Hence harmonics.\n\nThis is why you can limit/compress an instrument like piano, which has a tendency to hear distortion easily, when clipping it would be a disaster (unless you are going for that)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1472998602073968713",
    "author": "revolution",
    "date": "2026-02-16",
    "content": "but i want to at least learn to engineer vocals better; since i also track my artist friends. im learning pro tools well but i dont have the ear and mix practice yet",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1473004792384061472",
    "author": "revolution",
    "date": "2026-02-16",
    "content": "of course, thank you so much! we can get in touch at your convinience ill def be checking. ill request you let me know what's the main thing taking you out of the song, or the lowest hanging fruit i should work on big picture... if something comes to mind. ill look forward to hearing from you and mixing the song again soon. Ty 🫶",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  }
]