[
  {
    "id": "1033511571135139870",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "__**TLDR 2 - the return**__ - The final word. If I was asked “What sample rate should people make records at in 2022?” And was forced to choose then the answer would be 48k. Why?\n\n- Film and TV prefer it\n- Labels prefer it\n- *(I hate Atmos)* Atmos is at 48k *(I hate Atmos)*\n- There are small but meaningful technical and sonic advantages\n- It doesn’t place demands on CPU or drive space",
    "reactions": 59,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345257465188585513",
    "author": "cian riordan",
    "date": "2025-02-28",
    "content": "Here's where I ended up -- it's a WAV file so feel free to use it if it's useful. On the house. https://www.dropbox.com/scl/fi/9b52pxedvxtpz89qekf0g/boozle-drums-CR-rgh.wav?rlkey=hueyxufc8boyrmnvisbv5s44u&dl=0",
    "reactions": 19,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "991393600476827709",
    "author": "cian riordan",
    "date": "2022-06-28",
    "content": "I say “stems”, because that’s what we fucking call everything now apparently.",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066180305582555236",
    "author": "cian riordan",
    "date": "2023-01-20",
    "content": "If you change the zero to a 1 at the end of a Dropbox link, it defaults to download when you send it out",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1122175319932149860",
    "author": "masteredbyjack",
    "date": "2023-06-24",
    "content": "Gonna circle back with more later, but this is my 2 cents (I started mastering with zero clients about 9 months ago)...\n\nGet over your fear/insecurity/weirdness of not having a portfolio. Go fuck it mode. You need to have a ton of contacts. Take a lot of shots. Of course I have no idea about what you are doing currently...but zero people I've ever talked to in this situation have taken enough shots. \"I reached out to 5 people this week\"...no. HUNDREDS. Most people will ignore you. But just keep going. Watch a Goggins video before you start or something haha\n\nReally think about the experience of working with you. Is it amazing? Is it easy? Is your communication, care, intention incredible? Even things like how files are named/delivered/etc matters. You can only be as good as you are at mixing until you get more reps. But you can control how you interact and the professionalism and confidence you can inspire on the other side.\n\nIf someone lets you mix a song...are they coming back? They need to if you are going to have a business doing this!\n\nSorry to be prescriptive here...but I've seen this question asked of me enough to know that it's so so hugely about just brutal persistence in many aspects, assuming you have talent, etc to do the actual thing.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1020798891593044018",
    "author": "cian riordan",
    "date": "2022-09-17",
    "content": "You're very much being taken advantage of here. I would recommend politely writing them an email saying that you've done the work that you were hired to do (especially if things have been delivered for mastering) and given the amount of additional work they're requesting, you need to negotiate a new fee for said work.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1173806133450915900",
    "author": "NoahNeedleman",
    "date": "2023-11-13",
    "content": "Label delivery requirements are insane. The oversight and hoops to jump through, and the higher stakes. I’m not gonna give a label a deal if I don’t have to, and I’m not gonna charge an indie artist the same as I would a label. It’s not that deep.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "964610700058193970",
    "author": "samvalentine",
    "date": "2022-04-15",
    "content": "For mixes I'll save a different version every bounce. Tracking I'll save based on significant arrangement decisions, different days recording, different artists or instruments - really depends.\nBut noooo I'll really only use save copy in if I'm sending a session off to someone. Check out save as - it just creates a new ptx file in the same session folder. Doesn't duplicate all of your audio files etc. Shortcut is command control s on mac",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "875840013550649394",
    "author": "cian riordan",
    "date": "2021-08-13",
    "content": "Mixing Drums:\n\nAfter now listening to many of Jon & Matt’s podcasts, as well as existing on this discord for a while, I’ve found myself feeling a little perplexed by people’s ability to mix things so fast. It finally clicked that many folks these days (especially in the pop world) are getting stems to mix from — not full multitrack sessions — and often not real drumsets/instruments in real rooms. In my world, for better or worse, I’m almost always getting multitrack files. So the prospect of only spending 2-3 hours on a mix is just impossible. That will often times barely get me past the drum sound! So for us mere mortals that are still stuck mixing real instruments, here’s my process for approaching drum mixing.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069302430640119819",
    "author": "BatMeckley",
    "date": "2023-01-29",
    "content": "Also, again, after decades of getting sent a fucking mp3 with non compensated mastering bus plugins on it, you don’t whine, you line it up quick best you can and get on with it. Don’t bitch about it and deal with it after the artist leaves, slaving in a darkened room accompanied only by a glass of whiskey. \n\nSo much of our job comes down to “just solve the fucking problem and move TF on”",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070549600764698687",
    "author": "NoahNeedleman",
    "date": "2023-02-01",
    "content": "$250-$300 is a reasonable rate for an newer mixer, and it’s what I ask for a demo mix. $500 for indie, $1000 for label (cause label deliverables are insane.) \n\nYou can release my hot mix, but ill push you hard to call @Rollmottle. I’ve even offered to pay for him myself.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1173801189540900875",
    "author": "Josh Bowman",
    "date": "2023-11-13",
    "content": "I think a few things can factor in... sometimes there are contracts, maybe you need your lawyer to read it or at a minimum spend time to go over it yourself. Negotiation could be more intense, deliverables could be more scrutinized and annoying. Often deadlines are tighter/more strict.  Dealing with them dictating terms of payment IE when/how you get paid, as opposed to indie gigs where you can set your own payment terms and most people will be happy to follow them. And for me personally, the label gigs ive had (not a ton but a few at least), i ask for more because I know the budget generally will be higher than most of my local indie clients. And TBH it feels more like what im worth, than what i normally get paid by local artists without label support.  Thats partially because i probably dont ask for enough for my indie gigs, and partially just my location/client base.\n\nTBH  I also dont have a problem morally with asking a corporation to pay me more for a service than an individual that is paying out of pocket... partially for the reasons listed and partially because if they're playing the capitalism game, why cant i when im working with them? Not to the point where i feel im being greedy, but, just advocating for myself a litlte stronger than i normally do.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1194398109984358480",
    "author": "peterlabberton",
    "date": "2024-01-09",
    "content": "Just a small note: when you say you weren’t feeling their system, that reads as a possible red flag. Assuming these studios are not run by total hacks (and therefore worthy of you not wanting to be involved), you’re most likely going to have to work on lots and lots of stuff you don’t like, for a long time. And that might apply to working in ways you wouldn’t personally choose. But—again, assuming these studios are at least semi-decent—you’ll learn a lot by involving yourself in other peoples’ work flows. Then you can take it or leave it as you see fit in your own work.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1197951653953949751",
    "author": "cian riordan",
    "date": "2024-01-19",
    "content": "CDs aren’t really a deliverable anymore and 48kHz is the standard for tv/film AND accepted by streaming services… so it just saves some space and time with a higher resolution.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345289010112892988",
    "author": "Calvin Lauber",
    "date": "2025-02-28",
    "content": "@BoozleBAM been following along w your journey on here a long while. it’s great to see you posting some music even just drum stems, Cian’s mix sounds sweet and the drum parts are cool (wanna hear the song!). I know so many people on this discord (myself included) would probably be down to donate some time to help you get music finished. Some of the best records ever weren’t tracked under perfect conditions, and often that added to the character and specialness of them. Keep going and holler if you ever need help getting to the finish line!",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1353798013356871761",
    "author": "cian riordan",
    "date": "2025-03-24",
    "content": "Does a Serban mix always sound $6k or 7k better than other A-list mixers? Probably not — but he’s going to be more consistent and have a proven infrastructure in place to deliver exactly what you need in the time frame and not let anybody down",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069280903584546916",
    "author": "BatMeckley",
    "date": "2023-01-29",
    "content": "Man. 85 percent of the tracks I’d get would require an hour of trying to line up the song PROPERLY to the grid. It’s not as easy as lining a kick to the grid as half you guys are using kick samples that have space before the transient.  When I’m out here nudging and stretching vocals at 1/1000th of second resolutions, which can dramatically change the pocket and vibe, it’s a kick in the teeth then if the whole track ends up being a tenth of a second off. \n\nThe trick I came up with was putting four low frequency Square wave bursts maybe an 1/8th note long each at the beginning or end of each song. That means at no matter the master bus processing (or worse the mp3 meta data at the beginning pushing the song back) you can recalibrate EXACTLY the track back on to the grid. In that case, once you’ve figured that bit out, slap whatever you want on the bus. The square wave trick is how we were able to prove how logic or ableton was bouncing out of time even when a ton of people didn’t hear it or notice.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1208109361139023872",
    "author": "kylem",
    "date": "2024-02-16",
    "content": "Adding on to this - have an excel spreadsheet with everything you've worked on where you got a point or 2. Once a quarter just quickly scan through and see where you're at. Sometimes this means chasing down a LOD that wasn't fully executed by the artist. Sometimes this means poking a lawyer to wrap up a contract that is in limbo. Just make sure you have a really good tracking system in place from day 1. At first I didn't pay much attention and was very unorganized. When I got my first royalty check I ended up going back over everything (nightmare) and realizing there was money left on the table. Years later I'm still chasing things that I should've been on top of from day 1",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "855561225354346496",
    "author": "Slow Hand",
    "date": "2021-06-18",
    "content": "When I make stems for people, I usually deliver them in sub folders to make it easier for the recipient to orient themselves: Folder 1 = *Drums*, Folder 2 = *Harmonic Instruments*, Folder 3 = *SFX*, Folder 4 = *Vocals*, etc. This way they can import the drums as a group and arrange, route, and edit them before they import the next class of instruments.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066169716005154886",
    "author": "Slow Hand",
    "date": "2023-01-20",
    "content": "Dropbox. It just works for me. \n\nI never have to think about it and I can walk from one computer in my house to another and everything is perfectly synced at the speed of my upload/download connection.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066214964420947978",
    "author": "NoahNeedleman",
    "date": "2023-01-20",
    "content": "The download hack it great- except when I’m on my phone walking the bubbas (or picking up dogshit in the yard,) that’s when I need to stream audio. And I stream from Dropbox a LOT. It was utter dogshit for a while but it’s gotten noticeably better over the past few years. Though Apple Music is always louder. \n\nI’ve gone through a few cloud streamers for this and IME nothing works as cleanly and reliably as db. \n\nI just wish they’d implement a playlist function",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069297985197981706",
    "author": "oaklandmatt",
    "date": "2023-01-29",
    "content": "I love my dear friend @BatMeckley but I think he's wrong here. Just send the instrumental how it sounds the best, and have them send you a bounced ref along with the vocal. I ask them to send me the session too as I have Pro Tools, Logic, and Ableton and can play with their processing and do a new bounce if need be.\n\nIf a vocal bounce comes back with some delay uncompensated or otherwise off the grid, lining up the vocal will NOT take you an hour. You simply line up the ref to your session and the vocal to the ref (the latter is 99% of time already done since they're bouncing from the same session). This takes a few minutes max and I've done it dozens of times. Nudge and flip some phase and you're within a couple samples. You're fine.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1194391615490506852",
    "author": "cian riordan",
    "date": "2024-01-09",
    "content": "I started getting serious about recording while I was in college (studying chemistry). I was playing bass in a band at the time and I was the only one that had any sort of decent recording equipment. I found myself being the guy recording all of the band's demos before we went into a 'proper studio'. Eventually, we realized my demos were sounding better than the ones we paid other people to record! Meanwhile, I started assisting (for free) at a local small recording studio and met a really great mentor. The studio was small and its business was mostly weekend warrior type stuff – nobody really notable. That being said, it was a working studio – and booked almost 6-7 days a week. The producer was the big fish in the small pond and had a great repeat clientele. Most of the music was not my cup of tea – but this proved to be a good thing as I was exposed to all sorts of different styles and it allowed me to be comfortable in genres of music which I normally wouldn't gravitate towards. It just made me comfortable around music and musicians in general.\n\nOnce I graduated and decided I wasn't going to use my chemistry degree, I ended up helping the producer build a bigger studio complex from the ground up. I learned an insane amount of stuff during this period – whether it was researching which Pro Tools system we would need to helping design the wiring layout to actually implementing it all. Ultimately, after months of hard work (and lots of borrowed money) the studio was complete and it was ready for business. I worked here for 2 years or so until I got introduced to Eric Valentine through former Street To Nowhere guitarist Matt Radosevich in Los Angeles. He needed a new full-time assistant and so I hopped at the opportunity and moved to LA – leaving behind the studio and crew I helped build (they're still going today and they're doing great).",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1197966910839603300",
    "author": "LAPhill",
    "date": "2024-01-19",
    "content": "Meanwhile, Hans Zimmer runs everything at 44.1…",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267476504665653385",
    "author": "montrose recording",
    "date": "2024-07-29",
    "content": "death to google drive for audio please",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1279451949405831330",
    "author": "Adam Thein",
    "date": "2024-08-31",
    "content": "https://archive.org/details/wolfgang-amadeus-phoenix-stems",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1317261551098400851",
    "author": "Zack Hames",
    "date": "2024-12-13",
    "content": "This has been my experience;\n\nMixing was always guess and check. It was also a lot of mixing in compensations. Example: when the vocal is barely too loud it’s actually perfect. When the low end is just barely too thin it’s actually perfect. \n\nTo me, the right monitoring is whatever you can mix 100% intuitively and then be satisfied far more often than not when listening on other systems. \n\nSo, In short:\n\n-are you able to mix intuitively and not be shocked by what the mix sounds like outside of the studio?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1043717471271665795",
    "author": "ALXCPH",
    "date": "2022-11-19",
    "content": "Never be the guy, lusting for money when coming up. Do your work, show people how great you are, and over deliver.\nIf you stay consistent you will end up with a great network and getting gigs that pay",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067987643608076298",
    "author": "oaklandmatt",
    "date": "2023-01-25",
    "content": "I... don't have a great system for all this stuff. It started – and mostly remains – on a whim.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1174040596151816282",
    "author": "kylem",
    "date": "2023-11-14",
    "content": "Echoing this. The 24hr turn around on a sunday night with 15 people on CC. Multiple levels of approval needed. Deliverables including multi track, grouped stems, pro tools sessions and alt mixes. Contracts and lawyers. Lots of stuff that makes charging 2-3x your indie rate reasonable",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1179485430798880838",
    "author": "Bryan DiMaio",
    "date": "2023-11-29",
    "content": "The Apollo also has a systemwide key command to adjust the volume, which is neat",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235640805012541481",
    "author": "cian riordan",
    "date": "2024-05-02",
    "content": "Highly recommend sending files via another service. Receiving Google Drive files really is a nightmare (doesn't download, downloads in several zip files with directories randomly scattered across them). We can be hyperbolic about our silly strong opinions here... but this one is real. Google Drive is the devil.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235641354135142411",
    "author": "cian riordan",
    "date": "2024-05-02",
    "content": "WeTransfer is another great option... little clunky dragging things into web browsers... especially big uploads, but you can send a decent amount for free and its quite reliable.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1297628564694372412",
    "author": "BatMeckley",
    "date": "2024-10-20",
    "content": "Bounce all your vocals from beat 1. Make a stereo instrumental bounce. Open up standalone. Put the aforementioned bounces in the session. Tune and de-ess and re consonant and time to your hearts content. Clear some wall space for the ensuing plaques. Repeat.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1455204883744424058",
    "author": "Ross Fortune",
    "date": "2025-12-29",
    "content": "No probs, I keep it in a folder with all my other important stuff so I don’t lose any of it: http://dropbox.com/lifesavings",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "838642786416721921",
    "author": "oaklandmatt",
    "date": "2021-05-02",
    "content": "@hendrick yes i would keep it. whatever vinyl sample you're using is likely to sound quite different than whatever actual noise comes of the vinyl record itself when played. also, everyone has a different quality needle and turntable and listening environment and cleanliness etc. so the sound (and noise) of a vinyl record can vary wildly between systems",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1028283643325599845",
    "author": "oaklandmatt",
    "date": "2022-10-08",
    "content": "i think the \"commit\" function will turn it into audio. then do whatever you'd do with any other audio track re: stems",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066084234760044594",
    "author": "samvalentine",
    "date": "2023-01-20",
    "content": "My system is generally Artist_Song_additionalinfo*_Date\nThat goes for sessions, deliverables - pretty much everything is a derivative of that.\n* additional info being revision#, ACA, clean, final… something along those lines if applicable.\n\nI think the most important aspect is finding a system that works for you and being consistent about it.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066165697568309309",
    "author": "Rollmottle",
    "date": "2023-01-20",
    "content": "i am very anti-adding somebody's dropbox share to my own dropbox for that reason. always download into my own world from the top.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069326214646477000",
    "author": "austenballard",
    "date": "2023-01-29",
    "content": "I generated 10-second, 110 Hz square waves, as 32-bit .wav files at 44.1, 48, 88.2, 96, 176.4, 192 kHz\n\nSharing them here for anyone else who might find these useful.",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1069378929149874196",
    "author": "Adam Thein",
    "date": "2023-01-29",
    "content": "My advice here - I have not seen the issue I mentioned today if I'm batching out groups of stems.  For example - if I print a group of stems on THE SAME RENDER then they tend to sum with each other correctly/sample accurately.  It seems in my case to be if I'm printing stems one at a time, then one print may sometimes be offset 1 sample.  So if you are printing multitrack drums, try and print them together, or at the very least, load them into another DAW or a clean session and make sure they are adding back up like you expected ESPECIALLY for parallel processing.\n\nThe main takeaway here should be if you are sending files to another person to work on them you should always check your work so what goes out is what you expected to have go out!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121991413501001839",
    "author": "NoahNeedleman",
    "date": "2023-06-23",
    "content": "Sometimes the pitch isn’t “let me mix for you,” sometimes the pitch is “If you’re down to send me stems I’d love to take a crack at a mix. Not tryna snake the gig, just getting reps in!”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1153384313069506600",
    "author": "cian riordan",
    "date": "2023-09-18",
    "content": "There's some standards that are useful -- outs over ins, normalling strategy... that type of stuff. Really comes down to what you're trying to achieve. If you're operating a big tracking studio, then you want that workflow in mind: tie lines normalled to mic pres, mic outs normalled to A/D inputs, D/A outs normalled to monitor controller & headphone boxes, etc. If you're in a mixing room (like me), I have things setup so outboard gear is accessible via hardware inserts through patchbay normalization. As for labelling, I've been using my own spreadsheet system that I find more useful than patchbay labelling software. Here's an example of my setup from last year:",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1197965840889425970",
    "author": "Slow Hand",
    "date": "2024-01-19",
    "content": "Yeah. There's so much video-centric content these days that we seem to be converging on 48k as the all-purpose default sample rate. I don't know anything other than red book CD audio that requires 44.1k. I find doing all my sessions in 48k gives me less to worry about.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1323495801770475541",
    "author": "popthetrunk",
    "date": "2024-12-30",
    "content": "At the coffee shop or hotel I like Proton, good backup email service you can forward your stuff to as well, lots of different protocols and locations to choose from.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407297661173760072",
    "author": "masteredbyjack",
    "date": "2025-08-19",
    "content": "From my side -- this gets down to \"what is mastering even for?\" territory -- but to the question at hand, it completely depends. As it must. Every project and song is different. Even on the same project, from the same mixer, it can vary widely. Mixers differ in how they deliver as well.\n\nMy opinon is mixers should take the song as far as they can, get it as close to finished as possible, this is better for the music to me. Don't even think about mastering. Then any great ME can add more x/y/z as they hear it (not always level, mastering is also about restraint). \n\nIf you can be concerned with making the music the most itself and singular as possible, really listening for the song, you are doing the right thing. Maybe it needs to be loud, maybe not. Often it seems to me there is a misplaced focus on continuity, or a comparison to a reference, which leads me to ask...are we listening for the music anymore? Or some target that is not what we've actually made?\n\nJust listen for what's there, and do absolutely everything you know how to do to help that. Any competent ME can take it from there, however you prefer to deliver",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "824750940350578759",
    "author": "oaklandmatt",
    "date": "2021-03-25",
    "content": "Ooooo we talked about it in this weeks live (I think?). It's in the first 30 minutes (before Cian). Jon talked about guys like Skrillex who will do LESS limiting for the club, so the records can sound dynamic and huge, but then extra crunchy when you jam them through the club's PA system. I don't know a huge amount about that world, but it makes sense to me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "875840435652804608",
    "author": "cian riordan",
    "date": "2021-08-13",
    "content": "https://www.dropbox.com/sh/fjg68uwomusldj8/AAAUTqPLu9bzSKmhnMR-0Umna?dl=0",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "965958542756560956",
    "author": "Zack Hames",
    "date": "2022-04-19",
    "content": "I love google drive for this stuff. Google sheets, google docs. Otherwise I just take notes on the Notes app on my computer or phone. Nothing fancy but it’s all permanent and easy to access. I share all audio files using Dropbox.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033513708044951552",
    "author": "David Fuller",
    "date": "2022-10-22",
    "content": "I agree, 48k is probably my default choice. \n\nI'd argue that it gets the AA filter far enough into ultrasonic territory as to not matter, though, and if a plugin is *designed properly* (big if, there... not many get this totally 100% right) aliasing should not be an issue.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066171793032876142",
    "author": "ALXCPH",
    "date": "2023-01-20",
    "content": "But I do a lot of sharing as well, which Dropbox is the goat for. I know some people aren’t content with their audio preview quality, and that’s fair. I’ve never lost a client because of it. And most of the time when I send stuff out(session, stems, mix) it’s usually listened to on subpar speakers anyway or the files are instantly downloaded.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070550098561482793",
    "author": "ehutton21",
    "date": "2023-02-01",
    "content": "This is where I sit, but if it’s someone Ive known for years, I’m not gonna accost them if they can’t pay me upfront before working. I usually just don’t deliver till I get $$",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158495098506584224",
    "author": "bobby k",
    "date": "2023-10-02",
    "content": "What the hell does it mean when mixers bounce out a mix that says “HEATED” are they literally referring to Avid HEAT or is it something else",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1166447436869410938",
    "author": "Nomograph Mastering",
    "date": "2023-10-24",
    "content": "An M1 should be able to rock 96k all day, have fun and let us know what you hear",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1198027871332085882",
    "author": "noahc",
    "date": "2024-01-19",
    "content": "I was just watching a mastering live the other day and it was discussed that Spotify plays back @ 44.1k. So if you had submitted a 48k file it does live conversion which may sound worse than submitting 44.1k that was converted before submission. The option is good to have if needed.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1203511001547407360",
    "author": "SoundsLikeJoe",
    "date": "2024-02-03",
    "content": "Double M/S is by default a Quadraphonic matrix output. LRLsRs.  Quad files are an odd format, but you can scale them to a standard SMPTE surround file. L R C Lfe Ls Rs....   but use audio black in C and LFE imo. You could push LR to C and all to LFE but you might lose mono compatibility with folddown. \n\nDispite what they say...   Don't over bloat your deliverable with everything and the kitchen sink. It's sort of unnecessary if you include the natural matrix output of the format. Preserving the Quad output in a standard SMPTE poly wav would be the cleanest thing.  Just make sure you're also using UCS metadata formats.  These days that's a big feature for sound designers.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235645194075111589",
    "author": "Adam Thein",
    "date": "2024-05-02",
    "content": "+1 for WeTransfer all day over Google Drive",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235650829537775678",
    "author": "Nomograph Mastering",
    "date": "2024-05-02",
    "content": "When a Google drive user says the files are in THE folder what they mean is that they are somewhere in some folder on google’s servers",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235664629477150830",
    "author": "Zack Hames",
    "date": "2024-05-02",
    "content": "@BoozleBAM what's hilarious you sent me the drive link, I responded saying you should consider dropbox, and then I come on here and see everyone saying the same thing LOL",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1276371468053119048",
    "author": "hendrick",
    "date": "2024-08-22",
    "content": "if you can only send one stereo bounce the best way for me is just asking the artist what they wanna hear live. some folks want me to mute all the lead vocals in the verses but leave them for the hook. others just want the instrumental. others will want just background vocal all the way thru",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282536000165380148",
    "author": "cian riordan",
    "date": "2024-09-08",
    "content": "Backblaze would be great. Most professionals here will have several stages of failure for backups, but in your situation, I would not reccomend getting sucked into this rabbit hole. Either A) Setup backblaze, have it backup to cloud all the time, and get on with it or B) Setup a secondary drive that you copy files to at the end of every working day. If you use a program, so be it. This can be as simple as dragging the session files over and replacing the previous files.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1302815315230457906",
    "author": "Rollmottle",
    "date": "2024-11-03",
    "content": "The buffer has nothing to do with sample rate or fidelity of a given capture. Buffer only matters for the performance of your computer. For setting your buffer, you'll have to find the balance between latency and stability if you're recording. If you're mixing, raise the buffer until your system is stable. \n\nFor sample rate and bit depth, you will be fine working at 48/24.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345175614004396124",
    "author": "cian riordan",
    "date": "2025-02-28",
    "content": "Google drive works but is often a pain on the downloading end",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1416105246371090605",
    "author": "oaklandmatt",
    "date": "2025-09-12",
    "content": "When Jon receives a song to mix, there is almost always a lot of compression on the individual stems, especially drums and vocals. So he does more subtle moves to bring out the best in each mix. If you're recording stuff yourself, you will likely want to add a lot of compression to get the same modern, perceived loudness.\n\nThe fundamental thing to know is that \"compression\" simply means \"reducing the dynamic range\" (aka \"compressing\" the range of volume of your sound ). This can be achieved with \"compressors\" as well as \"limiters,\" \"saturators,\" \"clippers,\" \"distortion,\" and a number of other types of effects that do it in different ways (and may add other sonic characteristics to your sound).",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472999265046626315",
    "author": "spectrummasters",
    "date": "2026-02-16",
    "content": "Yeah man send me an mp3 for sure \n\nI’ll put like my top three recommendations for a great engineer demonstrating vocal processing for ya a bit later tho . \n\nYou should be able to spot the similarities between their approaches",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "810585791184896061",
    "author": "Zakhiggins",
    "date": "2021-02-14",
    "content": "I did make it quite clear before they sent them to keep them organised, they've already sent me 2 updated versions of the stems, not sure if it'd be out of line to ask again, it's a real mess 😂 I think my real question is more about understanding intent of a song when it's really not clear at all",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "839595148686000182",
    "author": "Slow Hand",
    "date": "2021-05-05",
    "content": "We listen to most records in 16 bit and that sounds fine. 17 bits is *double* that resolution. 18 bits is *quadruple* that resolution. By using 24 bits we've increased the resolution of the dynamic range 256 times compared to a 16 bit signal. I've never seen any evidence that we can hear the difference between 24bits of audio and 32 bits.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "844612054437986324",
    "author": "Eric Martin",
    "date": "2021-05-19",
    "content": "I’d echo what’s been said but I’d also add that you should play with the tuning of the batter and reso head to get the sound, you might be surprised to hear that tighter might actually deliver more low tone and overtone to the mic than the puff of air that a too loose head will deliver, I’d also mess with the dampening material, start with less dampening and only dampen what it needs to tame the basketball ping if you get that tone. And let the beater rebound don’t bury the beater, imagine the kick drum is a guitar string and burying the beater is like playing with a piece of foam killing the resonance. play with all these things and you’ll get more low end",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "852375236925587456",
    "author": "Eric Martin",
    "date": "2021-06-09",
    "content": "when I send files, I always also send a stereo mix-down of the drums themselves, and a mix-down of the whole track with my parts added, so they can here the parts without opening a session",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "854648701531717662",
    "author": "Yago Ibars",
    "date": "2021-06-16",
    "content": "I'd say the \"s\" being sibilant doesn't have much of a transient and you will anyways turn it down, and the \"t\" sound does have a transient. So it will probably not be much of a problem as long as the \"s\" is kept short and the delivery of the vocal is good. As @Zakhiggins said is hard to tell without hearing the song, but having the downbeat on the accented syllable will also be more coherent, my bet would be on that. The song \"stay\" by Zedd and Alessia Cara comes to mind.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "876891581712592916",
    "author": "David Fuller",
    "date": "2021-08-16",
    "content": "Some DAWs like Pro Tools can actually change pan law. PT can do -2.5dB, -3dB, -4.5dB, and -6dB. Mixes sound different with different pan laws - and I'll bounce some stuff real quick to demonstrate.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "914601898353524836",
    "author": "peterlabberton",
    "date": "2021-11-28",
    "content": "@hendrick yeah, you just have everything plugged into it all the time. There are outlets on the back that provide battery power in case of an outage, and others that just offer surge protection. I’m not sure whether the battery outlets are *always* running off battery power, or if they seamlessly switch over when power is cut. But yeah, the idea is to give you time to backup and power off.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "965966785285357609",
    "author": "sethearnest",
    "date": "2022-04-19",
    "content": "Same as Zack for me: Shared Google sheets/docs. Shared Dropbox for files with a “latest” version in the top-level folder per project and an “Olds” folder to move previous versions into.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "993350000136441898",
    "author": "blanco",
    "date": "2022-07-03",
    "content": "the plug-ins follow the UAD hardware not the computer or the login. transfer ownership to yourself from studio account. keep in mind how many devices you’ll have total. limit is 6 devices per system. if you exceed 6 and go to 7 you’ll have to rebuy plug-ins for that second bank/system etc",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "997862154587873300",
    "author": "Zakhiggins",
    "date": "2022-07-16",
    "content": "When you export in FL studio, on the dialogue box that comes up before you export, there's a little button that you can hit to mute all plugins before export, you probably have it enabled",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1020800895807668327",
    "author": "itaylerner",
    "date": "2022-09-17",
    "content": "I always say unlimited revisions until any new stems / files are sent, then it’s an additional fee. I can always tell them not to worry about it if it’s something small and simple, but i at least have it there as a safety net",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066052410390351942",
    "author": "Jeremy Klein",
    "date": "2023-01-20",
    "content": "whoa would love a tldr on what NARAS guidelines are. That sounds professional. \n\nI posted what my mix deliverables typically look like a while back and a few people had more or less the same setup",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066168132491817091",
    "author": "ALXCPH",
    "date": "2023-01-20",
    "content": "Thats a shame. I really Think dropbox is an amazing app. If you get a good file/folder structure going, nothing ive tried beats it for cloud storage. \n\nIt has saved my ass a couple of times. \n\nI can load up, songs, sessions, samples, mixes and stems. From any computer anywhere in the world. \n\nIts really awesome. I even have my daw preferences saved, so if i need to i can instantly put my own perfs on a different system without having to use more than a couple of brain cells.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066170732918345848",
    "author": "ALXCPH",
    "date": "2023-01-20",
    "content": "Honestly never had friction with Dropbox. I once accidentally gave someone access to my Dropbox and he deleted almost everything. And I was panicking. Then I looked on their website and they just have a time machine roll back type system that let me click a button and set a date I wanted to roll back to. So cool. I hadn’t set it up or anything it just worked and within 20 seconds I had everything back up and running.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066171072493408347",
    "author": "Nomograph Mastering",
    "date": "2023-01-20",
    "content": "The audio preview is one of the reasons I don’t use Dropbox",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066402172511719435",
    "author": "Will Melones",
    "date": "2023-01-21",
    "content": "Dropbox Pro for Professionals would be great. I’d pay.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066404242232983613",
    "author": "ALXCPH",
    "date": "2023-01-21",
    "content": "I always  assign a folder to each artist I’m working with that they have access to, with mixes, demos and so on. And once finalised also project files and stems.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069372925314085026",
    "author": "ehutton21",
    "date": "2023-01-29",
    "content": "No doubt! I’ve noticed issues with bounces before and it felt like something I noticed tons on 9, but on 11 I’ve had minimal issues. Though now that I think about some of my session prep, there’s a fair possibility that i may just be accustomed to adjusting for all the things it does on a bounce",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1116922230681636884",
    "author": "jantrit",
    "date": "2023-06-09",
    "content": "Higher sample rates also give you less latency, something to consider",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1117830859903467520",
    "author": "Barbara",
    "date": "2023-06-12",
    "content": "Well, sounds like a backup plan! Gonna try that and see if it makes me go faster! 🤜🤛",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1134522057682583554",
    "author": "Ross Fortune",
    "date": "2023-07-28",
    "content": "One approach to recalling board mixes a la Ben Baptie: If there’s a tweak, he pulls up the relevant stem (printed through the board) against the mix and flips its phase, essentially taking it out of the mix (or enough to make adjustments then recombine through ITB mix chain).\n\nMight not work as well if there’s wow and flutter on your Otari, but could be worth experimenting with?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1163606465798471710",
    "author": "Adam Thein",
    "date": "2023-10-16",
    "content": "A few more that I use constantly:\n\nCmd + K for Key Mapping (great for auditioning a chain)\n\nIn adaptive grid mode:\nCmd + 1 for more subdivisions in grid\nCmd + 2 for fewer subdivisions in grid\nCmd + 3 for triplet grid\n\nHold Cmd to override grid for selections and moving clips\nShift + Opt + Cmd and click and drag within a clip to slip audio within clip region\n\nShift + Cmd + R to enter export screen\n\nFor arranging things quickly shift modifier will add or remove time and move all automation.  For example:\n\nShift + Cmd + D = Duplicate and add time\nShift + Cmd + X = Cut time\nShift + Cmd + V = Paste copied time",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1166677423778177074",
    "author": "Ross Fortune",
    "date": "2023-10-25",
    "content": "It made sense that time around as it was an 86 min live show of 30-40 tracks. RX took ~5mins, while PT was looking at +1hr. I haven’t braved the downsample and relink approach. \n\nIf it were a complex session but you know the comps are final, and all fades have been checked etc, another solution might look like the following (though with all these steps it’d likely be faster in PT):\n\n- batch rename audio tracks in PT to prepend with 2 digit numbering (01, 02, 03…), or 3 digit if +100 tracks\n- consolidate all audio to bar 1 (previous step ensures useful sequential naming of the consolidated files, a big help later)\n- export consolidated audio files to finder\n- batch downsample in RX\n- save copy of PT session at new sample rate, don’t include audio\n- drop downsampled audio from RX into corresponding tracks in new session, *automation follows edit* OFF)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1167648799578136669",
    "author": "Nomograph Mastering",
    "date": "2023-10-27",
    "content": "I’m not sure there’s any reason for a mixer to be doing it. Mastering should handle if it needs to happen but 95% of the time we submit 48 or 96k masters",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235641217145114745",
    "author": "cian riordan",
    "date": "2024-05-02",
    "content": "I'm in the Dropbox ecosystem... that has its own issues, but I find it great for managing incoming and outgoing files to clients. Lots of people use it so its easy to sync up folders/projects.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235675139354661026",
    "author": "Deleted User",
    "date": "2024-05-02",
    "content": "This is why recommended prophet, a lot of other synths don’t have preset-ability. \n\nThere is a workaround by using System Exclusive, but sometimes you don’t want to bother",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1258536182489550899",
    "author": "BatMeckley",
    "date": "2024-07-04",
    "content": "I find the phone useful for general leveling rather than Sonics…plus it just seems like good practice if you want to make a living in commercial music to reference one of the most universally used playback systems to make sure nothing heinous pops out",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268622606374797374",
    "author": "NoahNeedleman",
    "date": "2024-08-01",
    "content": "Put them all into one session, adjust levels (clip gain or limiting) accordingly, bounce again",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1278868890306478153",
    "author": "PKirk",
    "date": "2024-08-29",
    "content": "Just following up on an earlier post about gridded vs. loose grooves. Downloaded the stems for Wolfgang Amadeus Phoenix earlier today for fun. The drums are more gridded than I expected. But everything else around them is all over the map. The guitars and bass are way behind the beat which gives the drums this really forward feel. Fascinating!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282533715070816257",
    "author": "Rollmottle",
    "date": "2024-09-08",
    "content": "Same thing. Backing up to the cloud is just backing up to a hard drive on a computer somewhere else. The point being, you want to set up a backup routine that doesn’t require your intervention so you can set it up once and be  covered.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394858921381986334",
    "author": "Bryan DiMaio",
    "date": "2025-07-15",
    "content": "That way can be easier in terms of communicating sample rate changes, and I've had good luck doing it that way for a wide variety of devices and digital protocols for many years without issue. I'm sure Ruairi has a good reason for saying to go otherwise but personally I'm not as converter sensitive as others so maybe he can chime in with his expertise",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1452430061977211063",
    "author": "Adam Thein",
    "date": "2025-12-21",
    "content": "it's not an issue with the location of WAV files - the project itself got corrupted, the file",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1452651742524346409",
    "author": "Bryan DiMaio",
    "date": "2025-12-22",
    "content": "The base model already comes with 16GB of RAM which is great for tracking/mixing/mastering but you can increase the RAM if you want. Personally I think 24 or 32 is the sweet spot, then just get as much storage as you feel you need. The base M4 on the Mac mini or M5 on the MacBook Pro is so fast, faster than the M2 Max I’ve been using on my 16” MBP",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "810579451779743754",
    "author": "Zakhiggins",
    "date": "2021-02-14",
    "content": "Any thoughts on dealing with people who send you extremely un organised stems? Trying to figure out a 50 odd stem mix rn, few blank stems, the names of all the tracks look like \"vtogb3802:393\" so who knows what else is in there, it's difficult for me to really understand the artist/producers intention here.. Any ideas welcome!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "810583325558308874",
    "author": "mixedbywong_my",
    "date": "2021-02-14",
    "content": "If it’s possible just request for them to render again with understandable names . There has been times where I had to just use the “preset” names the producer users in logic for the tracks . Or rename it so it’s makes sense for my workflow. That saying , this was after being sent the same set of stems with still wrongly named tracks 3 times over . So yea . If possible just ask for new stems .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "811273410227208232",
    "author": "jacobmunk",
    "date": "2021-02-16",
    "content": "When I get stems from people who work in a diff daw (usually ableton or logic), the track names are usually a nightmare, so I’ll copy the original name of the track to its comments section on the track, then name the track something that makes sense to me. color coding helps too. That way your brain can do a little less work trying to figure out what’s what, and if the artist/other producer/etc goes “can you turn up ‘wonky snare 0003_72849’” you just check your track comments",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "811411391810371594",
    "author": "rae",
    "date": "2021-02-16",
    "content": "I’ve got a Q regarding my headphones... I bought a pair of Audio Technica ATH-M50s at the beginning of 2020 and was recommended them for mixing/critical listening as they are  reviewed as ‘well balanced’ and were in my price range. However, I delivered a mix to a teacher and he stated that there was an error with low end in my headphones that was coming through in the mix (I re mixed it on the monitor on campus to test if it was an error on my behalf or the headphones). \nI was wondering what people’s thoughts are on this, if anyone has used these headphones or had similar issues with other headphones and maybe how to combat this 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "821098886218645565",
    "author": "hendrick",
    "date": "2021-03-15",
    "content": "look at how my guitar was delivered 💀 @oaklandmatt @Slow Hand",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "821485179183824947",
    "author": "cian riordan",
    "date": "2021-03-16",
    "content": "The only issue here is many of the system files get updated with the upgrade as well, so if it's a big enough jump, it will cause hiccups opening pro tools in my experience.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828282571942920202",
    "author": "Zakhiggins",
    "date": "2021-04-04",
    "content": "How long do you guys usually take to get used to new monitoring systems?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "828310993816911888",
    "author": "i am willie",
    "date": "2021-04-04",
    "content": "at what point would you bounce it out at",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "828312355359686676",
    "author": "David Fuller",
    "date": "2021-04-04",
    "content": "and then slice at the right place when you export",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828312460212568084",
    "author": "i am willie",
    "date": "2021-04-04",
    "content": "you typically export at the end of the fade right",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "832316684915310682",
    "author": "mixedbywong_my",
    "date": "2021-04-15",
    "content": "just got some stems for a song im mixing . the two snare mics seems to line up right . on some hits the snare top seems to have some out of phase hits. could it be the top mic moving as the drummer is playing ? trying to figure out whats the issue. but seems likely i'll just have to copy n paste from another part.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "837064973002735616",
    "author": "Zakhiggins",
    "date": "2021-04-28",
    "content": "If its for your own stuff - I'd definitely reccomend exporting your stems first (if you mess with the input gain when you've plug ins on, it'll change how the plugins effect the audio)\nSo export them to keep things the same as you had, put them in to a new session and just clip gain everything down.\nMatt and Jon actually did an episode on gain staging",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "837065474796945418",
    "author": "i am willie",
    "date": "2021-04-28",
    "content": "exporting it and hopping in another session is prolly the best way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "837374346405216268",
    "author": "Eric Martin",
    "date": "2021-04-29",
    "content": "it’s hard for smaller artists too, everyone wants to offer it, but it’s mostly a pain, I have 100’s of copies of a 10” EP, in storage because fans don’t see much value in a 4 song 45 that cost $20 😆",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "839592104098660382",
    "author": "thejadenmejia",
    "date": "2021-05-05",
    "content": "24 bit vs 32 bit mixing? What are the benefits of upsampling to 32 bits?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "839594921438216244",
    "author": "Slow Hand",
    "date": "2021-05-05",
    "content": "Unless you're doing scientific testing, I would think that there is very little reason to ever need 32 bits of audio information when making music. 24 bits of dynamic range is already huuuge.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "852373201815076894",
    "author": "Zack Hames",
    "date": "2021-06-09",
    "content": "What are some do’s and fonts of File delivery naming conventions? Specifically for delivering project files, not final mixes. \n\nI recorded drums for a project and am sending off the individual tracks for overdubs and mixing. Right now I’m doing:\n\n1_01_Kick In.wav\n1_02_Kick Out.wav\n1_03_Snare Top.wav\nEtc, etc. \n\nThe 1 in front is designating the Take (I’m sending 3 takes of drums in case they need to pull from other takes) then the numbers after lay the drum tracks In a Logical order in their DAW rather than it going alphabetically.\n\nIs any of this annoying for the end user? Pointless? Things I should consider? Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "855559283319373865",
    "author": "Zack Hames",
    "date": "2021-06-18",
    "content": "Right - makes sense. Definitely stuff you may not think about until after delivering files",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "857391460878123008",
    "author": "hendrick",
    "date": "2021-06-23",
    "content": "earlier today i was working on my final assignment which is to master and ep and deliver as a DDP lmao this prolly will be the first and last time i make DDPs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "858143558505463818",
    "author": "peterlabberton",
    "date": "2021-06-25",
    "content": "The only thing I’ll ever document in a tracking scenario is a vocal chain. This is just in case a lyric or delivery changes and we need to come back and punch a line or something. But personally my attitude is just move quick and redo it if you need to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "868582479508955146",
    "author": "Ian",
    "date": "2021-07-24",
    "content": "So not quite a music question but ive been editing twitch vods and they are super quiet since I have to upload to YouTube. I can push the clip gain in the video software all the way up and not clip before I bring it into protools for final limiting. I still end up around -20 LUFS before limiting which means I need about 6 LUFS to bring it to YouTube 's -14 standard. So my question is what strategies with gain staging etc would you recommend so that im not having the limiter clamp too much when I go to do final export?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "875840153640398959",
    "author": "cian riordan",
    "date": "2021-08-13",
    "content": "https://www.dropbox.com/s/10kkcrmbp2muipi/CR%20DRUM%20TEMP.ptx?dl=0",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "875950933568278558",
    "author": "rae",
    "date": "2021-08-13",
    "content": "What about a google drive for discord shared resources ?? @Slow Hand 😊",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "876895834812350535",
    "author": "David Fuller",
    "date": "2021-08-16",
    "content": "https://www.dropbox.com/sh/hrzoebnmpbuj0re/AACj8A6BC2eICC8IMm-pQaUna?dl=0 All the same mix, only change was pan law.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "877956063662571521",
    "author": "Deleted User",
    "date": "2021-08-19",
    "content": "this is a bit pricey but I’ve tried Earthworks piano mic system and they sounded pretty dope",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "878003061832966155",
    "author": "SoundOfPatrick",
    "date": "2021-08-19",
    "content": "Both myself and the artist want to make sure the length of silence, and transitions between songs (where applicable) are as intentional and fine tuned as possible. Obviously each song has been mixed in a separate project file, so wondering if anyone has workflows they recommend for doing final mix deliverables on an album and fine tuning the space and/or transitions between songs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "881646271251763251",
    "author": "Zack Hames",
    "date": "2021-08-29",
    "content": "2 Questions:\n\n1. Does anyone have a reason to *not* use 32 Bit Float as opposed to 24 bit depth? I've stuck with 24 out of habit, but 32 seems to have 0 downfalls, besides space usage.\n\n2. I am having trouble monitoring hardware inserts without the obvious latency, even when I figure out the time delay in Pro Tools. Is there something I'm missing? I imagine there has to be a way to monitor hardware inserts in real time and have it be in sync (Delaying all the tracks to be in sync).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "881654221366263848",
    "author": "absflores",
    "date": "2021-08-29",
    "content": "Bounce between the two and see what works",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "882063160926961755",
    "author": "chadwahlbrink",
    "date": "2021-08-30",
    "content": "In regards to 32-bit, I try to stick with 32bit until Mastering. This is mainly out of an \"abundance of caution,\" but basically, it's theoretically possible to have rounding errors/quantization distortion (granted at like -128dB) when bouncing between the 32-bit processing within the DAW and other processing like izotope RX or even just bouncing stems from one person to another. Note - there is also a settting in pro tools to \"always use 32-bit for audiosuite processing\" for this reason! Also, you can just use a 24bit dither when you go from 32 to 24bit at mastering stage as needed (if you are providing the master).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "885201398856310845",
    "author": "hendrick",
    "date": "2021-09-08",
    "content": "and do yall know if it's possible to use in two different systems?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "900971691918897212",
    "author": "Deleted User",
    "date": "2021-10-21",
    "content": "Does anyone do remote production? Not the kind of workflow where you just send beats and have recording back and forth, but more involved type of holistic production. I’ve been trying to do it, but it hasn’t been working out for me. Especially vocal production. I feel like the most ideal scenario would be traveling but that’s not always possible. So it feels like the next best thing would be finding good vocal producers in the local area. But what if the budget is tight and that is not possible either? I definitely do think teaching artists how to record themselves is going to be beneficial and that wouldn’t be difficult. The problem is in vocal delivery and just getting the vibe of the whole music right. On my end, it’s definitely possible to do live streams and have the artist give me active feedback. But it doesn’t work the other way around, nor it’s not gonna be easy to quickly record vocal ideas while doing this either. The real time magic of collaboration would face technical obstacles in remote settings. So I wondered if anyone has found some kind of solution to this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "923319440286842900",
    "author": "hendrick",
    "date": "2021-12-22",
    "content": "to my understanding the default was when dragging in the same system it just moves",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "926979201888813117",
    "author": "KushKadett",
    "date": "2022-01-01",
    "content": "yeah I mean it won't make a difference to the quality of a song. I for my system found it to make a difference so I can't speak on anyone else's experience",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "940724859871309926",
    "author": "ALXCPH",
    "date": "2022-02-08",
    "content": "Does summing two stems of 4 tracks each(2 audio tracks) = summing all 8  audio tracks individually? We’re talking purely digital. Can’t seem to find an answer and haven’t gotten around to doing a null test",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "943646760348315708",
    "author": "Maxim",
    "date": "2022-02-16",
    "content": "I like Acustica stuff too. Some plugins run better than others. So far things were smoother on Big Sur. But not by much. \n\nThere's only been 4 cases for me where I wasn't able to finish a project properly because PT refused to play. At that point, you just have to make some stems for yourself. Can be a good thing too but it for sure kills creativity in the moment. Maybe committing to something more often might work for you. But I'm really just hoping Avid pulls this update through in Q1.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "943958673326215268",
    "author": "Adam Thein",
    "date": "2022-02-17",
    "content": "You can select the version it boots under the \"Get Info\" menu at least for Ableton - I'm brand new to my Mac so I'm sure someone else can chime in!  But it's definitely on the application level and not the system level",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "964609047900876860",
    "author": "Maxim",
    "date": "2022-04-15",
    "content": "How are you guys saving different versions of your Pro Tools sessions? Every time you bounce and send it or while you’re working on the track? And is the “Save Copy In” feature the only option here?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "964627159954128956",
    "author": "Tyler Graham",
    "date": "2022-04-15",
    "content": "File_name [day working on mix].[iteration that day].[bounce] - [note]. So it’d look like \n\nSong 1.4.0 - vocals\n\n(first day on mix, 4th iteration that day, no bounce). I save incrementally because those .ptx files take up next to no space, why not",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "965879185849589841",
    "author": "samvalentine",
    "date": "2022-04-19",
    "content": "Probably the wrong channel but question:\n\nWhat strategies do yall use to stay organized when writing, producing, recording, or mixing a whole project with an artist? For example I make a shared note with the artist or team so everyone can hear the latest mix version in one place. Also I'll make a spreadsheet with which songs I need to collect beat stems for, get a feat.'s vocals. Shit like that but could be anything about staying organized when working on bigger projects",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "965882760034127922",
    "author": "samvalentine",
    "date": "2022-04-19",
    "content": "Probably the wrong channel but question:\n\nWhat strategies do yall use to stay organized when writing, producing, recording, or mixing a whole project with an artist? For example I make a shared note with the artist or team so everyone can hear the latest mix version in one place. Also I'll make a spreadsheet with which songs I need to collect beat stems for, get a feat.'s vocals. Shit like that but could be anything about staying organized when working on bigger projects",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "966205309821526087",
    "author": "samvalentine",
    "date": "2022-04-19",
    "content": "@Zack Hames @sethearnest nice guys, thanks. Google sheets for sure is a life saver. I've had some trouble with Dropbox in the past but maybe it's time to give it another shot.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "979853637058707506",
    "author": "samvalentine",
    "date": "2022-05-27",
    "content": "Everytime I download an mp3 from an email, say, it automatically adds to my Music library. Checked preferences but can't find a way to stop that from happening. Feel like it's a recent change or maybe I've just been oblivious until now... I'm on M1 Monterey 12.3.1. Anyone know what I'm talking about and how to fix it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "979876523068756018",
    "author": "samvalentine",
    "date": "2022-05-27",
    "content": "I think that means the file will be duplicated to the Music folder instead of Music playing the file from wherever else it lives on your system, but either way good find and I'll check it out..maybe that is what I'm looking for. Thanks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "979976639687565363",
    "author": "Eric Martin",
    "date": "2022-05-27",
    "content": "I think it’s system preferences",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "990354213139804280",
    "author": "Adam Thein",
    "date": "2022-06-25",
    "content": "I definitely experienced this on my M1 Macbook - some explanation I saw seemed to make sense to me where the power saving/efficiency settings adjust the clock speed of the cpu cores to meet the demand/load.  I think similar features are implemented in Intel systems depending on how you have your power settings set in the BIOS and OS (at least in Windows).  So counterintuitively if you aren't pushing your cores to the limit they won't be operating as effectively.  When I'm working on the Mac I keep the buffer as low as possible and then tick it up during the mix process, and on Windows my machine is usually really stable at 1024 from start to finish in a mix so I just leave it there, but I've also disabled any sort of power saving stuff on my PC in the BIOS so the clock speeds should be relatively stable.  Again, I'm not sure if this is actually the cause or not but just what I've seen posted about online anecdotally!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "997853730110181498",
    "author": "gagsmile",
    "date": "2022-07-16",
    "content": "Hey guys im kindda new to Fl studio I normally use ableton, I exported a song and for some reason some audio clip don’t apply effect on the final export I’ve some of my voice recording that are totally dry like they been exporting without going tru the effect chain. It’s really weird,\nI guess I messed something because when I play the song on fl studio is totally wet and sounds really good but when I export some random verse don’t have effect on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "997864911289987082",
    "author": "gagsmile",
    "date": "2022-07-16",
    "content": "Here are my export setting, I don’t think is that because most of my recording is wet with effect it’s just some sentence that are dry",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "997865740130598962",
    "author": "gagsmile",
    "date": "2022-07-16",
    "content": "The sentence where I put my mouse in for some reason is completely dry when I export but totally fine when I playback on fl",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "997871574445207562",
    "author": "gagsmile",
    "date": "2022-07-16",
    "content": "Update : I changed my export setting to 256 and restarted my laptop and the issue is gone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1018939485943238776",
    "author": "Adam Thein",
    "date": "2022-09-12",
    "content": "Haven't been able to dig up much but it seems like they are the brainchild of Rick Carson, partnering with Metric Halo to deliver at least the beta versions of the plugins through their Production Bundle",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1022285650982080542",
    "author": "Shaquan Talbert",
    "date": "2022-09-21",
    "content": "It would be better if it didn't distort things so easily lol. Or maybe my car just needs a better system.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1028271633162571826",
    "author": "emre",
    "date": "2022-10-08",
    "content": "how can i export my aux sends (reverbs, delays and other fx) individually when sending out to mixing ? im on pro tools btw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1029470328272990289",
    "author": "Rollmottle",
    "date": "2022-10-11",
    "content": "i used to run SPDIF at 96k",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1029473467302686720",
    "author": "Rollmottle",
    "date": "2022-10-11",
    "content": "anybody in the real world actually working above 96k?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033395662139699281",
    "author": "GaspardMurph",
    "date": "2022-10-22",
    "content": "@Nomograph Mastering can you school us on sample rate once and for all ? That way we can choose one and stick with it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1033461324522455050",
    "author": "ehutton21",
    "date": "2022-10-22",
    "content": "Sample rate lessons for the youth!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033511021047984169",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "__**Sample rates in modern record making**__\n\n**What matters\nWhat does not matter\nAnd how to choose what to use**",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1033511111686885486",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "**Tiny TLDR** - Which sample rate you use is not a deal breaker, or even close. You can make a great sounding record at any sample rate. There are edge cases where it can make a meaningful difference but in modern Pop, Rock and Hip Hop production it’s not *that* important",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033511284295077938",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "- **Higher sample rates reduce aliasing.** There is effectively no difference between 44.1 and 48k here but a meaningful difference at 96k and above. Aliasing is caused by non linear processes like distortion, and dynamics processing (compressor or limiter). Lots online about what it is and why it happens but you can sum it up by saying it’s an inharmonic, digital sounding hash that can feel bright but in a kind of ugly way (but remember sometimes ugly is good)\n- **Higher sample rates reduce the impact of Anti Imaging and Anti Aliasing filters in AD to DA converters.** Filtering is necessary for accurate capture and replay of analog signals, and it in the early days of digital it used to be a real challenge. Now it’s basically a solved problem, but if you are doing acoustic music, with delicate transient information there is still a small but real advantage to higher rates\n- **Higher sample rates reduce overshoot and inter sample peaks on limiters.** This really only matters if you are sending your loud mixes directly to release, otherwise your mastering girl or guy should handle that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033511424376455290",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "- **More samples (slices) per second equals a better representation of the analog waveform.** Within half the band of the sample rate (say up to 22.05k for 44.1k) this is demonstrably not true. I know that is confounding, but digital and information theory is basically miraculous\n- **We can hear/feel/sense sounds above 20k.** We truly really cannot and if you experiment with significant energy above 20k you’ll actually see problems creep in for electronics and speakers etc. Information above 20k is not our friend (space for harmonic information to live without aliasing back excepted)\n- **Working at multiples of 44.1k is better because the sample rate conversion will work better.** This used to be a little bit true a long time ago but hasn’t been for a long time. Use the SRC in iZotope RX on it’s stock preset to 44.1 and you are in pretty good shape\n- **Digital EQs work better at higher sample rates because of cramping.** Cramping was an esoteric problem with older digital EQs that looked bad on analyzers but never actually sounded very bad. It’s a solved problem nowadays with most EQs.\n- **Video and film is at 48k so we must start there.** Yes film and TV still work at 48k (although YouTube specs 44.1 now) but I have sent a million tracks for sync at 44.1 and it gets dropped in with SRC and away we go",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033511469448437780",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "__**TLDR**__ - So what to do practically in the real world? If I had a super fast and stable computer I would record, produce and mix at 96k. It’s subtly better in every way and you can introduce any of the “desirable” problems from lower sample rates at will. BUT BUT BUT….if there was even the tinniest chance that the rig would hiccup, or my drives would not access fast enough, or that I would have a glitch in a real session then I would absolutely start at 48k.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033514339849744435",
    "author": "David Fuller",
    "date": "2022-10-22",
    "content": "I don't consider it a good idea to work above 96 though, as you'll start introducing junk from switching power supplies, class D amps, noise shaping from D/A and A/D, etc into the program material. At lower sample rates it's effectively rolled out by extremely steep AA filters",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033515139581874186",
    "author": "David Fuller",
    "date": "2022-10-22",
    "content": "Anyway: just work at 48, and stop asking me to change the clock to 44.1 because I know you'll forget to change it back after and the next person will be all confused why their session sounds wrong",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033515567245705308",
    "author": "peterlabberton",
    "date": "2022-10-22",
    "content": "When I was interning, the guy I was working for did a full half day session at one of those not 1/2 sample rates. The singer kept saying something sounded off/the song was too slow/etc., and my dude realized a few hours in. Oops!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033525770959732777",
    "author": "1ggy",
    "date": "2022-10-22",
    "content": "Why do you think JJP considers 44.1k superior to 48k? What is he hearing?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1034507485920362536",
    "author": "Rollmottle",
    "date": "2022-10-25",
    "content": "would probably be less the mic and more the cable that is bearing the brunt here (providing of course your mic doesn't fall and bounce off the floor)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1040525393448407060",
    "author": "Matt Teden",
    "date": "2022-11-10",
    "content": "I remember hearing Jon say that he would drop his \"how to prep stems for me to mix\" sheet that he sends to clients. Did that make its way here? I haven't been able to find it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1044712595397021767",
    "author": "itaylerner",
    "date": "2022-11-22",
    "content": "Question for RX users - I recorded a rap vocal to a 2-track, the session was at 44.1. Stems just came in for mixing, and they're at 48, so I figured I would throw the vocal into RX and upsample to 48. Best way to do this? Should I not do this? any insight is much appreciated",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1044713546124116008",
    "author": "itaylerner",
    "date": "2022-11-22",
    "content": "So far,  just I exported the raw vocal out of the session at 44.1, imported it to RX, went to utility -> resample, set the new sample rate to 48, left the other settings at default, and hit render. Now gonna drop this new 48 file into the mix session with the beat stems at 48 and go for it. This is all ITB so no conversion happening.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1045052395664711680",
    "author": "itaylerner",
    "date": "2022-11-23",
    "content": "It’s just a vocal stem",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1045778553926602813",
    "author": "Calvin Lauber",
    "date": "2022-11-25",
    "content": "Random q. Spotify “highly” recommends delivering FLAC’s over WAV files… does anyone do this? What is even the difference? I’ve always delivered WAV’s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1049849361946902578",
    "author": "itaylerner",
    "date": "2022-12-06",
    "content": "Recorded some vocals in 48k and just got instrumental stems in 441 - do i downsample the vocal or upsample all stems?  👀 and on a scale of 1-10 how much does it matter",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1049851634550833302",
    "author": "cian riordan",
    "date": "2022-12-06",
    "content": "Matters 0% but I'd suggest doing the SRC to the least amount of tracks... so in this case just get the vocals down to 44.1 and move on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1057739466707570828",
    "author": "LAPhill",
    "date": "2022-12-28",
    "content": "Absolutely! For awhile, the entire John Powell MWTM series was up for free, which was a great peak behind the curtain of one of the greatest working today. And hearing those solo'd Shawn Murphy stems was just :chefkiss: .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066048001421885440",
    "author": "austenballard",
    "date": "2023-01-20",
    "content": "What are your systems for naming files? I mostly follow the NARAS guidelines for deliverables but I'm curious what you all do to stay organized.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066158007647481997",
    "author": "Zakhiggins",
    "date": "2023-01-20",
    "content": "My computer is actually such a mess man, I actually have a fear that if I randomly died in an accident, no one would ever be able to navigate my extremely chaotic filing system to recover all my best work 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066164732903575612",
    "author": "ALXCPH",
    "date": "2023-01-20",
    "content": "Fair enough. I know being creative and being messy often goes hand in hand. But you have no idea how worth it is to get your stuff sorted and cleaned up. It just makes everything so much easier Down the Line. I dedicate a couple of  hours every other week to just sort and make sure everything is Nice and in systems. It makes working so much quicker when you know exactly where everything is and where to find it. Can recommend. It really isnt a lot of effort once you have a system.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066165397809799258",
    "author": "Nomograph Mastering",
    "date": "2023-01-20",
    "content": "Dropbox is the worst",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066165900165791795",
    "author": "Nomograph Mastering",
    "date": "2023-01-20",
    "content": "I only use Dropbox to receive files so it’s a graveyard and monument to shitty labeling",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066169016617541632",
    "author": "austenballard",
    "date": "2023-01-20",
    "content": "the direction this conversation went in leads me to a follow up question: which cloud storage/file transfer do y'all like best?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066169217579229316",
    "author": "ALXCPH",
    "date": "2023-01-20",
    "content": "Google drive can happily go fall into a void",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066169338958200903",
    "author": "austenballard",
    "date": "2023-01-20",
    "content": "I miss when google drive was good 😦 I have infinite storage from using google domains",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066169861111296100",
    "author": "austenballard",
    "date": "2023-01-20",
    "content": "I don't use it for sharing at all; I only use it for syncing between my machines + having file access from my phone. Google and Dropbox I find are less frictionless if you're entirely within the Apple ecosystem",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066169866077339658",
    "author": "Rollmottle",
    "date": "2023-01-20",
    "content": "yeah, i got my Reaper template and config backed up to dropbox so i can dial it up inside the house on my laptop and tweak and tune and try new stuff out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066170949524795402",
    "author": "austenballard",
    "date": "2023-01-20",
    "content": "Ok I used to love Dropbox but I feel like it fell off and got really crappy a few years ago... it's better now? I still use the web version for sending files (the audio preview feature is great) but I was having big issues with having it on my computer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066293774168358942",
    "author": "Zakhiggins",
    "date": "2023-01-21",
    "content": "@ALXCPH I think you've sold me the whole Dropbox thing lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066400567905234964",
    "author": "hyanrarvey",
    "date": "2023-01-21",
    "content": "https://www.dropbox.com/s/h9c6aigasl3yzwk/woah.mp3?dl=0\n\nhttps://dl.dropbox.com/s/h9c6aigasl3yzwk/woah.mp3?dl=0",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066401302483058728",
    "author": "ALXCPH",
    "date": "2023-01-21",
    "content": "Let’s say I make a bounce in my system and then open the file from my phone to test in the car",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066401646302724167",
    "author": "ALXCPH",
    "date": "2023-01-21",
    "content": "Let’s say I make a bounce and then wanna play it in the car. I just okay it from the cloud but within the app",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066402244469198970",
    "author": "ALXCPH",
    "date": "2023-01-21",
    "content": "I pay for Dropbox already",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066402839632543854",
    "author": "hyanrarvey",
    "date": "2023-01-21",
    "content": "You could probably make a script that changes all www.dropbox to dl.dropbox to make your life even easier to",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066403978037956659",
    "author": "Will Melones",
    "date": "2023-01-21",
    "content": "And I also like to keep a running Dropbox folder that anyone can check back to for previous mixes, etc. And as an option to download the wav",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066404697319149649",
    "author": "cy (sigh)",
    "date": "2023-01-21",
    "content": "I use opendrive but do the same. v organized files abd ease of access makes thinga a lot smoother in the long run. i do yell them they should make boyh physical and a cloud backup of their own but i keep those folders as is in yhe long run (no size limits in opendrive). you van stream mp3 s on theee so i upload both wav and mp3 so theybhave the option.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066405282869149786",
    "author": "ALXCPH",
    "date": "2023-01-21",
    "content": "That’s cool. But still an extra step. I wish we had someone on the inside of Dropbox that we could ouch a high quality streaming tier to 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067140503721742447",
    "author": "Jeremy Klein",
    "date": "2023-01-23",
    "content": "regarding the dropbox site stream vs the download link, i recorded the output of the stream from the website using the Piezo app. I then dragged it into ableton and level matched it with the download.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1068782360868429854",
    "author": "oaklandmatt",
    "date": "2023-01-27",
    "content": "@TNG G.O.A.T I watched Bainz do this in the studio with T Shyne with tracks I played for them. T Shyne liked one of the tracks, which was fully slammed and limited. I airdropped the mp3 to bainz, he opened his template, dropped the mp3 in, found the grid and key quickly, *clip gained the file down by like 10dB*, and then started cutting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069280447030378678",
    "author": "austenballard",
    "date": "2023-01-29",
    "content": "The only comparable situations I have personally had were when something in the other person's vocal chain wasn't PDC'd properly, or they tracked at a different sample rate, and the file that came back was misaligned. But that's just my own limited experience.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1069284316900765776",
    "author": "austenballard",
    "date": "2023-01-29",
    "content": "It seems like your square wave trick should be a best practice, since it's definitely not just master bus PDC that can throw things off. The other person's effects, or their sample rate, or working across DAWs could all contribute to misalignment.\n\nWhat's your method for doing the square waves? Is there a particular plugin you like for generating the tones? Is there a specific 'low frequency' that works best?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1069294583952986112",
    "author": "austenballard",
    "date": "2023-01-29",
    "content": "Anyway @BatMeckley now that you've enlightened my obsessive-compulsive tendencies to all this, I'm envisioning a nightmare scenario where I send the 2-track to someone who's 1.) using Ableton 2.) at a different sample rate 3.) with clip fades on and 4.) warp set to complex by default...\n\nI guess you can only control for so much when it comes to other people, though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1069326803115716650",
    "author": "Adam Thein",
    "date": "2023-01-29",
    "content": "Lol I just messed up bad - I was like 45 minutes into a stem print in ableton at 48k, downloaded these and decided it was a good idea to open the 192k file in RX and my interface switched sample rates and Ableton got very mad",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069339519129751672",
    "author": "ehutton21",
    "date": "2023-01-29",
    "content": "But I get stems from someone who is still running a copy of 7.5 (if you’d believe it)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069343185727402156",
    "author": "Deleted User",
    "date": "2023-01-29",
    "content": "the dead space issue seems to happen in both logic and ableton. And I found printing click track helpful because I can make sure it’s lining up in the daw after exporting the vocal files. I’m working on a rubato-ish track with more classical time feel and I printed click track to double check the tempo map I imported from a midi file, correcting issues only took me 5 mins. \n\nBoth Ableton and Logic seem to bounce tracks with extra few ms in the beginning of the song and if you print click (separately) you can figure out how far off it is and just match to that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1070314238012305429",
    "author": "austenballard",
    "date": "2023-02-01",
    "content": "It's a little like \"Sic Transit Gloria\" by Brand New in delivery",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1070550099370971207",
    "author": "David Fuller",
    "date": "2023-02-01",
    "content": "label deliverables are nuts",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1109105343394492477",
    "author": "sarawls",
    "date": "2023-05-19",
    "content": "Bryan do you think my plan will work or could my issues stem from stuff beyond the drivers?   What’s your setup?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1109106213364437034",
    "author": "Bryan DiMaio",
    "date": "2023-05-19",
    "content": "If you’re on TB though, it may just be a matter of setting system permissions in the recovery hd mode in macOS. I had a similar thing happen and Antelope Support sorted me out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1109110388001349654",
    "author": "sarawls",
    "date": "2023-05-19",
    "content": "I am using TB.  Maybe I should talk to Antelope about it.  The easiest way to get it to fuck up is to simply try to play any sort of music (mp3s in emails, Google Drive, iTunes, Spotify - any of it) and it's all slow and crackly and won't play.  This is only sometimes!  Sometimes unplugging the TB plugging it in again will do the trick.  Or restarting the computer.  Sometimes neither of those does the trick.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1109110926856167526",
    "author": "Bryan DiMaio",
    "date": "2023-05-19",
    "content": "Sounds like it’s randomly changing it’s own sample rate?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1109111273674788935",
    "author": "sarawls",
    "date": "2023-05-19",
    "content": "Yes.  I've noticed on the ZT screen it's switching the sample rate in various ways and I can manually override it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1113521828959371304",
    "author": "cian riordan",
    "date": "2023-05-31",
    "content": "Your question prompted me to start thinking about what next for ProTools HD-centric audio folks and I just now found out about the MTRX II. Seems like a decent solution for those staying in the ecosystem that need a decent # of I/O and Digilink compatibility.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134503197478752316",
    "author": "Edward Rivera",
    "date": "2023-07-28",
    "content": "I think if you're going from the repro head into tools you're cutting off a significant of information based on the sample rate",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134504508974702653",
    "author": "Edward Rivera",
    "date": "2023-07-28",
    "content": "In photography we use drum scanners that can scan even the oldest film and print them at incredible resolution (there's that word again) but those scanners are useless on say, a shot on a digital camera from 1999 at 12MP. Would it not be the same idea to want to preserve the resolution of tape instead of baking in a session at whatever sample rate it was ran at ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134504858137919498",
    "author": "Adam Thein",
    "date": "2023-07-28",
    "content": "Huh yeah I understand - but for what I’m using it for I don’t need anything above nyquist personally, I’m just using it as an effect not for tracking\n\nTo be clear my use case is in mixing/post production - running tracks captured at 44.1 or 48k most often, using tape for compression/color/distortion and then bringing back in digitally at the same sample rate as the session.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1159950006749503490",
    "author": "kylem",
    "date": "2023-10-06",
    "content": "Was also surprised to see that bouncing stems is basically the same speed on both rigs. I'm not Native yet on the laptop, so assuming thats why - but generally the hackintosh is still just as fast as the m2",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1166529085938344007",
    "author": "river",
    "date": "2023-10-24",
    "content": "I feel like my reverbs sound nicer in 96k but I've never done any tests or a/b etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1166529595143618560",
    "author": "river",
    "date": "2023-10-24",
    "content": "Also playing back vocals I recorded at 96k, then changing sample rate to 48k, make the vox sound weird. I've noticed that once, and again didn't look much into it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1166531436799602688",
    "author": "cian riordan",
    "date": "2023-10-24",
    "content": "Let's say you have a working session in PT that you want to downsample to 44/48. How do you go about RX'ing it down? Hit all the audiofiles with the RX converter, do a save-as at a different sample rate, then re-link the files?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1166531824428781648",
    "author": "cian riordan",
    "date": "2023-10-24",
    "content": "Anytime I get sent something at 88/96 I bring it down to 48 right away with a save copy and just click on the SRC -- I'm not trying to be no hero and hobble along in a 96k mix session.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1166533876747866132",
    "author": "Will Melones",
    "date": "2023-10-24",
    "content": "I feel like relinking the files with a different sample rate would really piss off pro tools",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1166537101605621760",
    "author": "Nomograph Mastering",
    "date": "2023-10-24",
    "content": "RX for SRC is definitely more of a  “I’ve got 12 stems” rather than a 200 track mix with 1000 regions per track",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1167637284535926795",
    "author": "Ingmar Carlson",
    "date": "2023-10-27",
    "content": "Fr tho is there any mileage in downsampling from 48 to 44.1 with RX?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1173764271868493884",
    "author": "Ingmar Carlson",
    "date": "2023-11-13",
    "content": "Great question! Personally always on the fence about this myself, though I still do it. I don't actually quote two different rates anymore, but I do tend to be more flexible when there isn't a label budget involved (especially not a major). I do believe that it makes a difference who's footing the bill, which you've already framed very well above! I don't feel the same way about playing hardball with a major (who might not even pay me in the same calendar year) as I would with an independent artist paying out of pocket who's coming to me saying they're a fan of my work (many of whom are willing to pay me as soon as they send files).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1173776431814295583",
    "author": "Bryan DiMaio",
    "date": "2023-11-13",
    "content": "For me, my rate depends on how quick something needs to be turned around and how intense I have to be with delivery (different versions, alts, stems, etc)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1179085083064418314",
    "author": "Barbara",
    "date": "2023-11-28",
    "content": "Sorry to interrupt another issue, but I wasn't sure where to address this question...\n\nMelodyne standalone folks (looking at you @BatMeckley 👀), I am tunning a chunk of vocals and backing vocals for an album and when I export them, they don't align with the original file.\n\nI am aware the audio file has changed and I've been messing with the time and pitch of some parts. What worries me is that some of the files that I didnt touch also don't align. I've exported them referencing the range of the instrumental track and ive also exported them using \"entire length\" as a reference. It always seems to happen. I've never had this happening to me, or I didn't notice.... Have you encountered this before? Is there an obvious workaround for this that I'm not getting?\n\nThanks!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1179110163706298449",
    "author": "BatMeckley",
    "date": "2023-11-28",
    "content": "Hmmm. I’ve always just bounced every file from beat one, using the “start of reference track” bit.  Have never had this issue, I’m sorry I can’t be more help. \n\nMaybe in the interim drop a square wave transient at the beginning or end of the track to help line it back up? But ultimately you shouldn’t have to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182458692319313981",
    "author": "Maxim",
    "date": "2023-12-07",
    "content": "Hey peeps, what's the safest way to send files? As in, I'd like to not be responsible for something getting leaked. I had something for this years ago but forget the name. Is Samply good enough? I'm thinking 2FA + options to control playback/downloads.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1182460357135044738",
    "author": "Bryan DiMaio",
    "date": "2023-12-07",
    "content": "You could try doing an encrypted .zip over password protected Dropbox link, and send them both passwords via different methods",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1194387615319863406",
    "author": "M3MIYAGI",
    "date": "2024-01-09",
    "content": "Im looking to be a full time audio engineer, mostly mixing and recording, I interned at a local studio for about 8 months n learned alot, went to a few other studios but I wasn't feeling their \"system\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1194399080827326546",
    "author": "M3MIYAGI",
    "date": "2024-01-09",
    "content": "Very true and i don't have a problem with that but their system was mostly lazy engineering and i will not par take in it, having local artists work in the \"big A room\" for $300-$400 for two hours to give them a recording session mix",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1196852385037955183",
    "author": "rse",
    "date": "2024-01-16",
    "content": "does anybody have any recommendations for tutorials/reading material on club systems? Very interested in learning more about basically the whole signal flow from cdjs to the speakers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1197718178676080650",
    "author": "shaunobi",
    "date": "2024-01-18",
    "content": "I follow a similar approach when doing blue-sky producing - I'll prep song I like beforehand, splitting them into stems using UVR (which uses the best machine learning algos like Demucs v4 to split tracks). When people get there, I then play just the drums, or whatever, and we start layering other stuff on top of them. I speed it up, slow it down, use various parts, cut and paste - basically just to get something that inspires me during composition. Later, I'll come back with real musicians and actually record it, but this is a pretty powerful demo creation method, for me at least. Kinda fun to un-mute the OG track at the end and be like \"yeah, it's been Interpol this whole damn time :)\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1197949927226085436",
    "author": "bobby k",
    "date": "2024-01-19",
    "content": "Kind of a silly one, but why do people work in 48 that aren’t from the film/tv word? My thought has always been to do everything at 44.1 and forget about it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1197977201157607476",
    "author": "Nomograph Mastering",
    "date": "2024-01-19",
    "content": "It’s a bit wordy but I write something on this that’s pinned somewhere. TLDR 48k is good",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1198141724955004938",
    "author": "Rob Domos",
    "date": "2024-01-19",
    "content": "Yes, and… AirPods default to 48k  and will sample convert everything to 48k. There’s no escaping inadvertent SRC at this point. Maybe a decade from now we’ll coalesce around a sensical standard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1203425543228366928",
    "author": "popaganda.",
    "date": "2024-02-03",
    "content": "I have no clue where to post this, but it's kind of an advanced newbie question in a way. I've been doing some editing for a friend who records nature full-time. She sells the recordings online, and the clientele is presumably people in gaming, film, and app dev. A lot of the recordings are double mid/side and we're trying to figure out what's standard or expected in those industries when it comes to deliverables for multichannel recordings. 3 channel for the client to decode? 4ch? 4 stems front, back, L, R? Mono front, mono back, stereo L/R? maybe a long shot but does anyone have experience in this world?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1204088068584509471",
    "author": "Zack Hames",
    "date": "2024-02-05",
    "content": "Thanks everyone, this makes me feel way less crazy. I really just need like a 25 foot to go straight into the monitor, thank god, but I want to buy this once and never think or worry about it again.\n\n@SoundsLikeJoe The system at the day job was set up in a machine room and I undid all of that because everything was failing after however many years (lots of hdmi to sdi to this and that and ethernet and blah blah blah) so with the Mac Studio, I decided I just want the simplicity of it being in the same room.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1207930611994460160",
    "author": "cian riordan",
    "date": "2024-02-15",
    "content": "2) Have a mix agreement signed by both parties. Make sure the details of the royalty, what it applies to, and whats required as a deliverable are spelled out clearly.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1227313184747290734",
    "author": "Will Melones",
    "date": "2024-04-09",
    "content": "We always talk about delivering mix stems that add up to match the mix, but what alt mixes do you have mastered, and how do you manage the discrepancy between the deliverables that go to a ME and the ones that just have your mix bus processing? Particularly those of you doing label work",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1227341336261431367",
    "author": "Charlie Deane \"Hypn0.iRL\"",
    "date": "2024-04-09",
    "content": "What does your loudness look like for delivering to mastering? In the past when I spoke with my longtime engineer they told me they preferred that I don't even put a bus compressor on the print but now that I am branching out that seems to be an exception rather than a rule. Should also say that I recognized your name immediately, I had a chance to produce a mini mansions show some years ago and became a big fan of that band.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1228891077113806858",
    "author": "Eric Martin",
    "date": "2024-04-13",
    "content": "agree, as long as the limiter wasn’t controlling overs, if it was controlling overs and that wasn’t recognized during the bounce then I use the lim",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1232211263980044350",
    "author": "Nomograph Mastering",
    "date": "2024-04-22",
    "content": "But crediting from indies and indie labels is notoriously poor, it rarely propagates through the system",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235634767999926293",
    "author": "BoozleBAM",
    "date": "2024-05-02",
    "content": "Just bounced down the wav file. Gonna PM you a goggle drive link. I agree, gonna have to figure this out, though. ZEro experience with sampling things, and I'm definitely worried about the loss of dynamics - with essentially replacing a human being with a \"shot\" or a kick drum repeating itself over and over again.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235642379772494025",
    "author": "BoozleBAM",
    "date": "2024-05-02",
    "content": "Gotchu. Gonna look into both of these more. Stopped dropbox cuz I didn't want to pay for it, but yeah.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235643289064046633",
    "author": "Slow Hand",
    "date": "2024-05-02",
    "content": "Make no mistake, Google Drive exacts a heavy toll of it's own.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235646476265328650",
    "author": "Edward Rivera",
    "date": "2024-05-02",
    "content": "Ive only run into a few boneheads who don’t download the link after 7 days. The real bottleneck is the file size limit but that barely gets hit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235650349554077879",
    "author": "Rollmottle",
    "date": "2024-05-02",
    "content": "While I'm sitting here still waiting for permissions to be granted on a Google Drive link sent last night...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235653180445032520",
    "author": "Slow Hand",
    "date": "2024-05-02",
    "content": "I’m sure Google Drive makes sense to someone somewhere. \n\nSome engineer at Google is happily using it as intended, oblivious to the decade-and-a-half of sorrow the rest of the world have been enduring.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235654812637462608",
    "author": "Deleted User",
    "date": "2024-05-02",
    "content": "this is inherently a hostage situation if you think about it. \n\n“YOU MUST GRANT ME ACCESS OTHERWISE YOU WON’T GET YOUR MASTERS DELIVERED”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1254910096744382556",
    "author": "Nomograph Mastering",
    "date": "2024-06-24",
    "content": "Worth considering what you think is expected of you by others, what norms are, what you think music as a career can reasonably deliver",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263587813933191249",
    "author": "Felix Byrne",
    "date": "2024-07-18",
    "content": "seems like something is set up wrong - maybe the clips are set to warp? and as you're changing the BPM it's also changing the length of the stems\n\nie: you drag the 80bpm stems into a 120BPM session\ntry to change the session stems to 80BPM and your drums get warped to 60or whatever the math would be",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263593724856893663",
    "author": "spectrummasters",
    "date": "2024-07-18",
    "content": "Same sample rate between reaper and audacity ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263594654792814592",
    "author": "spectrummasters",
    "date": "2024-07-18",
    "content": "Logic will analyse everything in a session if ya tell it create a session tempo track for ya and I wonder if you can import that  id be tempted to go rogue and edit off grid . Used to have to do it with my mpc drums stems cause Akai clock drifts. In logic This would be the process you’re needing if I’m understanding your goal . https://youtu.be/cEDaa-C02EI?si=-Fn15MKrzDfDQ4gl",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263597245907996769",
    "author": "rawssx",
    "date": "2024-07-18",
    "content": "It should be same in both daws for you to have everything on grid. i.e if you recorded the drums on a 4/8 grid and you drag the stem to a different daw, you have to have the project time signature at 4/8 for you to have it on grid in the second daw. normally it would be at 4/4 so that could be the confusion",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263609469120811129",
    "author": "BoozleBAM",
    "date": "2024-07-18",
    "content": "Reaper converted the sample rates - Did everything in Audacity at 96 and Reaper downsampled to 44.1.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263859549111324786",
    "author": "Bryan DiMaio",
    "date": "2024-07-19",
    "content": "https://9to5mac.com/2024/07/19/crowdstrike-explained-how-one-faulty-update-killed-half-the-worlds-it-systems/\nSome context",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267161243983151207",
    "author": "spectrummasters",
    "date": "2024-07-28",
    "content": "…..I have three sessions on my system that for the life of me I can’t get the mix to where I want . I keep mixing past the place it sounds best because I’m still trying to push it somewhere it just won’t seem to go , but I don’t want these mixes to be any other way . I must have lost days to these three projects over the last year . I can get up in the morning ., produce , mix and send out three polished  lovely instrumentals a day . But these three mixes keep eluding me . They drive me nuts . I tell myself I’ll leave them alone and forget them . They are always in my thoughts tho . They might drive me doolally eventually or I’ll crack the code eventually and then I’ll sleep a happy man .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267344062692720651",
    "author": "Bryan DiMaio",
    "date": "2024-07-28",
    "content": "I feel like it gets a lot of mentions here, it's just a good way to present songs and has a free version, rather than having people deal with using google drive",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268571070965874688",
    "author": "BoozleBAM",
    "date": "2024-08-01",
    "content": "Might be a stupid question, but - I've comped and bounced down a bunch of rough mixes for listening. I was a little sloppy with my master bus, so some are louder than others - Is there an easier/ quicker way to bring them all to the same volume than going back into the sessions and leveling them out there? Thanks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1272985126673977508",
    "author": "Nomograph Mastering",
    "date": "2024-08-13",
    "content": "At 48 or 44.1’any more the 4x oversampling is a waste of resource. What matters more is filter type (linear better mostly) and cutoff frequency",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1276227621730127884",
    "author": "h3x",
    "date": "2024-08-22",
    "content": "Hey guys! Can someone give me a good way to do performance mixes for an artist? One of the artists i work with is going on tour and need to export some performance mixes for him. Never done it before so didnt know how to do it if weve gotten the songs mastered and also dont wanna undo the gain staging of stuff. Anything helps! Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1276229463515856939",
    "author": "cy (sigh)",
    "date": "2024-08-22",
    "content": "you mostly just mute the leads and any other vocal track they don't want in the playback. \n\nif they'll have a producer /engineer doing playback sending stems (groups) might be helpful. \n\nthe mastering doesn't usually come into play here. some big label folk might ask to send those files to mastering too. would probably be considered alts (some mastering folk will charge extra for them, some wont if it's not too many files)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1278507021666095196",
    "author": "Bryan DiMaio",
    "date": "2024-08-28",
    "content": "Do you format your drives after opening up the packaging and before putting files on them?\nAre you using solid state drives (as asked above)?\nAre these computers different operating systems?\nAre these drives ExFAT?\nAre you unplugging them without ejecting them?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1278509968458256404",
    "author": "BoozleBAM",
    "date": "2024-08-28",
    "content": "Same operating systems. ExFat - I have no idea. Will look up. No, I'm always \"safely ejecting\" them before I pull them out. I have \"unsafely\" ejected them/ simply yanked them out before though, yes. Accidentally.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1278511365169872972",
    "author": "BoozleBAM",
    "date": "2024-08-28",
    "content": "Okay - If I go buy and SSD right now, can I transfer/ copy files from my backup Western Digital drive to it? Do I have to change some formatting or something?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1278511583932321843",
    "author": "Bryan DiMaio",
    "date": "2024-08-28",
    "content": "Open up disk utility with the new drive connected and erase/format the new drive with whatever name you want and the APFS file format. Look up on Apple’s site how to use disk utility if you get stumped",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1278511705164615722",
    "author": "Bryan DiMaio",
    "date": "2024-08-28",
    "content": "You won’t easily be able to use it on windows though but it’s worth it to use a file system meant for SSDs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1278512383668785203",
    "author": "Bryan DiMaio",
    "date": "2024-08-28",
    "content": "If not format it and use as a secondary backup. If you do, there may be a data recovery service you can use (but it may be costly)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1279444240740384802",
    "author": "Iwan Morgan",
    "date": "2024-08-31",
    "content": "Where did you get the stems? That’s a great record",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282410648936120341",
    "author": "Nomograph Mastering",
    "date": "2024-09-08",
    "content": "Before we advise @BoozleBAM on hot rodding let’s consider his big picture. Two observations \n\n1) I’ll bet that there is no Time Machine running, and that backup protocol for audio projects is not yet optimized (same as we all did when we were at that stage of the journey)\n\n2) Swapping out a system drive requires the skills to clone the drive, or rebuild with latest OS from scratch. Then we have updates to contend with, license issue etc etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1282437776913989774",
    "author": "Nomograph Mastering",
    "date": "2024-09-08",
    "content": "Time Machine is a built in system on Apple Macs for system drive backup. I’ll defer to the brain trust here about the best (easy!) way to set you up for a similar type of backup on a PC",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1282501017916932138",
    "author": "LAPhill",
    "date": "2024-09-08",
    "content": "AFAIK nothing as straightforward and painless as Time Machine. I use AOMEI Backupper, previously used something offered from Paragon. There are options.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1282501489453039741",
    "author": "LAPhill",
    "date": "2024-09-08",
    "content": "We’ve talked here about what a robust backup strategy looks like, but to start, the important thing is that you have some automated backup in place. Drives fail, files get corrupted, mistakes happen and things get erased. My backups have saved me from some potentially catastrophic situations over the years.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1282532011705106547",
    "author": "BoozleBAM",
    "date": "2024-09-08",
    "content": "Example of \"automated backup\": A setup where something is copied to another drive in real time? Or to the Cloud?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282846251817373716",
    "author": "fakedad916",
    "date": "2024-09-09",
    "content": "I went through and exported the pairs as stereo files, my ir loader won't let me load two separate mono files",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1283493408391954494",
    "author": "Bryan DiMaio",
    "date": "2024-09-11",
    "content": "(keeping a backup of course)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1283493644048928779",
    "author": "Bryan DiMaio",
    "date": "2024-09-11",
    "content": "you can copy the files elsewhere as a backup",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1283515457256685599",
    "author": "Bryan DiMaio",
    "date": "2024-09-11",
    "content": "yeah that's a great idea, though I think it's still important to sort out the file location stuff for integrity of backups etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1295609932074455141",
    "author": "spectrummasters",
    "date": "2024-10-14",
    "content": "I’m fascinated with phase and waves . I expect this might all be familiar to you but it seems there’s some handy info about phase and audio here https://mycourses.aalto.fi/pluginfile.php/666520/course/section/128564/Jon%20Fagerstr%C3%B6m_1929997_assignsubmission_file_AAT_Seminar_paper_Phase_Equalization_JF_FINAL.pdf?time=1558421096226#:~:text=Phase%20equalizers%20are%20filters%20that,response%20of%20a%20given%20system.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1302807563401953330",
    "author": "T1NGA",
    "date": "2024-11-03",
    "content": "Hey there! What’s good ?\nSo I’m trying to solve this basic but yet important topic.\nI’ve read here on the discord that a higher sample rate will ensure less aliasing and digital eqs will work better, also that I should be symmetrical with the buffer size (let’s say I use 128 and 48k). \nMy questions here are\n1- If I want to upload music to spotify ( which I guess it converts it all to 44.1k ) should I still use a higher sample rate ?\n2- What buffer size and sample rate would stick to for recording ? And for mixing ? (Music only)\nThank you! Have a good day!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1302812598475165700",
    "author": "T1NGA",
    "date": "2024-11-03",
    "content": "I’m using 48k at the moment, but the article mentions 96k is better overall.\nAs I said before, all my projects will be uploaded to spotify.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1302812997571579914",
    "author": "T1NGA",
    "date": "2024-11-03",
    "content": "I really want to know what your buffer size is , I’m sticking to the lowest one I could get (48) but I’m afraid of losing information or not letting the system ‘breathe’",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1302813392121368596",
    "author": "T1NGA",
    "date": "2024-11-03",
    "content": "So basically my options are\n1- 48khz 48 samples\n2-48khz 128 samples\n3-96khz 48 samples\n4-96khz 128 samples\n5-96khz 256 samples\nAll this considering latency and quality, I’m so lost 😞",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1302818490226573363",
    "author": "NoahNeedleman",
    "date": "2024-11-03",
    "content": "If you’re producing, a lot of instrument plugins aren’t 96khz compatible. 48k is pretty much industry standard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1302818913427525693",
    "author": "T1NGA",
    "date": "2024-11-03",
    "content": "And for mixing or mastering should I do 32 bit depth?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1302822036535771187",
    "author": "Nomograph Mastering",
    "date": "2024-11-03",
    "content": "I wrote the article and I master a lot of records, stick with 48k",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1308931010200862860",
    "author": "bobby k",
    "date": "2024-11-20",
    "content": "this makes me think a bit of a trick from another discord user josh bonanno who sometimes puts Lossy on overheads to mimic early 2000s mp3 vibes haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1312409559037382716",
    "author": "Jemody",
    "date": "2024-11-30",
    "content": "Outside of manual editing I can only think of using RX tools or stemming software like spectralayers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1317249394340532334",
    "author": "David Fuller",
    "date": "2024-12-13",
    "content": "Do you feel like your mixes always have a constant flaw that shows up on other systems?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1317266956893556807",
    "author": "onanisland",
    "date": "2024-12-13",
    "content": "I also have to point out that, while great monitors and great rooms are revealing, you still have to put in the time. It's one thing to come in and fix the mistakes of a close to finished mix, its another to mix something from scratch. So it's hard to know if your monitoring system is holding you back but still a very good option is to check the speakers, check the room, check what you can improve and test in others setup",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1331785859464167464",
    "author": "BoozleBAM",
    "date": "2025-01-22",
    "content": "I haven't lost any sessions in a while and have been copy/ paste backing up like crazy. I did lose two sessions recently due to connection issues with the usb port, I think. That was not fun - Luckily reaper makes backup files, but still... I hate it all.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1345155627638329354",
    "author": "BoozleBAM",
    "date": "2025-02-28",
    "content": "SHould I export the wavs at 48k or 44.1?? The project was recorded in 44.1.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1345156424254099628",
    "author": "Bryan DiMaio",
    "date": "2025-02-28",
    "content": "Bit depth is a different thing from bit rate",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345156503971303564",
    "author": "Bryan DiMaio",
    "date": "2025-02-28",
    "content": "If you’re doing 128kbps that sounds like a lossy bounce. Use WAV",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345156957753049178",
    "author": "Rollmottle",
    "date": "2025-02-28",
    "content": "Change from MP3 to WAV",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345157172199428117",
    "author": "Rollmottle",
    "date": "2025-02-28",
    "content": "You can set it export both if you need an mp3 too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345172159592534107",
    "author": "Bryan DiMaio",
    "date": "2025-02-28",
    "content": "^when Google Drive link haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345172849416998932",
    "author": "Josh Bowman",
    "date": "2025-02-28",
    "content": "Brooo gotta zip it first if your gonna hit us w a google drive link",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1345208841670758430",
    "author": "BoozleBAM",
    "date": "2025-02-28",
    "content": "And Wetransfer didn't work for me. And, yes... I know it's a \"me\" thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1348018192978804778",
    "author": "BoozleBAM",
    "date": "2025-03-08",
    "content": "It's not clicked out wrong at all - You've got an mp3 of the song that Cian mixed the drums to in our PM, right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1352699526871252992",
    "author": "Brian Reynolds",
    "date": "2025-03-21",
    "content": "My father is a contractor. I was as well. Changed hundreds of outlets. If your not going to reground the whole system and don't have a long standing relationship with an electrician. They're probably  not coming for outlets. A handyman will be your best bet to offload the work practically if you don't want to do it yourself. Like I said in deleted comments, if you going to do it yourself. Get the electricty detector pen. And check each outlet before starting. Even after turning off the breaker. Just cause the first 4 are off. The fifth might be on the washer and dryer breaker line a floor above. The electricity wont kill ya, but it will zoom ya. Also if renting landlord should be consulted first to see if theyll carry the weight of the task. Considering the state of the 30 plus year old outlets, probably unlikely. Your above question about protect you not the gear, I don't understand that framing? I used the AI to try and save myself from typing this..... alas",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1353799142429692025",
    "author": "Rollmottle",
    "date": "2025-03-24",
    "content": "it's worth paying for the thing you've come to rely on for specific results, to always sound like the thing that delivers specific results.  consistency can definitely take a hit as different price points are managed.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1354225345582207108",
    "author": "Paris / Blue Butler Studios",
    "date": "2025-03-25",
    "content": "Drop an MP3 of the hiss?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1371623861233258537",
    "author": "cian riordan",
    "date": "2025-05-12",
    "content": "If you don’t, upload a bass stem here and me or somebody can take a look",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1379196912254849094",
    "author": "Gabriel Tyranny",
    "date": "2025-06-02",
    "content": "Happy Monday!\n\n**I have a project management question**, for those experienced in overseeing entire albums / multiple songs in multiple stages at the same time, timelines, deadlines, etc.\n\nThis week I made Trello boards and Kanban boards to track my progress for each part of the process while juggling multiple songs, which I'm fine using for this project, but I was wondering if there's a program / system that inherently lends itself to organizing music projects that I can integrate into my flow for the next project.\n\nMy current system gets the job done, but takes a lot of upfront effort and lacks automation when updating.\n\nAny advise would be greatly appreciated!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1385689005298946119",
    "author": "Bryan DiMaio",
    "date": "2025-06-20",
    "content": "Most interfaces these days have a loopback feature, do you have an interface? otherwise Loopback from Rogue Amoeba would let you grab a feed from your system or DAW while still routing out to your monitoring device",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1385768862800154716",
    "author": "Ross Fortune",
    "date": "2025-06-20",
    "content": "Do you have pro tools? You can set up PT Audio Bridge (like Blackhole) as an output from any daw, set it as the audio input in QuickTime screen record then monitor system audio through your interface. \n\nIf you need to record system audio and daw audio simultaneously one of the other suggests above would probably be better.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1387162777893867520",
    "author": "Gabriel Tyranny",
    "date": "2025-06-24",
    "content": "This thread has inspired me to setup a system for creating BTS / In the box content - Excited to get it working.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1394024411597770883",
    "author": "BoozleBAM",
    "date": "2025-07-13",
    "content": "Okay, that's awesome. So, say a piece of gear is worth such and such price this year, but creeps up in value another $500 next year and something happens to it before I have a chance to formally adjust the value in their system, they'll take that into account?? - I'm pretty sure that's something my insurance company wouldn't do unless I got another \"signature\" from Guitar Center or wherever.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1398740919062237274",
    "author": "Slow Hand",
    "date": "2025-07-26",
    "content": "I'm not Conor, but I'll jump in: That Mr. Beast document is illuminating because it drives home how single-minded, clear, and focused he is on his objective. So the remarkable part - for me - is that he's not trying to make great videos. He's trying to make great *Youtube* videos. Videos that perform exceptionally within the Youtube ecosystem. It's extremely focused and his messaging is crystal clear.\n\nFYI, that excerpt is from an internal document for his business that was made public. It's all about orienting his staff towards how they do things, and what they are here to do. To get everyone aligned on the mission. It's a pretty remarkable act of leadership; whether you like Mr. Beast or not.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1413588437583265932",
    "author": "baccwardshead",
    "date": "2025-09-05",
    "content": "Hey guys! Heard a lot about this community. Sorry for the ChatGPT post but English is not my native language. Tried searching a lot about this by looking at \"headphone rec\" and \"hrtf\" but I'm getting even more confused, just craving a stable monitoring system for me. Hope this is not too newbie of a question.\n\nI’m an intermediate mix engineer — normally mix on Yamaha HS8s but I’ve been travelling a lot lately, and I’m craving a stable monitoring solution I can rely on while on the road. I actually love how the ATH-M50x sound, but they’re not giving me the translation I need for mixing. I tried Beyer DT-990 and disliked the sound. Thinking about getting Sennheiser HD650 — should I pair it with a headphone amp even though I already have an Apollo Twin? HD650 + amp might be pricey, or would AirPods Max 2 be a reasonable travel/monitoring/critical mixing alternative? Clients send notes that confuse me with the M50x (rare on the HS8s) — it’s only ~10% of the time but I want that gone. Any recommendations?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1413616538451447819",
    "author": "baccwardshead",
    "date": "2025-09-05",
    "content": "Got it, I have no choice now I am travelling for some time. I've been able to finish and deliver mixes on M50x so I think AirPod can only be better?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1439064003484717277",
    "author": "Bryan DiMaio",
    "date": "2025-11-14",
    "content": "https://learn.microsoft.com/en-us/windows-server/storage/disk-management/change-a-drive-letter",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1439352587143876932",
    "author": "Beck Nebel",
    "date": "2025-11-15",
    "content": "I’ll try that! I’ve had this one for 2 years and used every day and this is the first time I’m sensing a slow down - I probably need another drive to round out my backups anyways",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1439366932787626277",
    "author": "Bryan DiMaio",
    "date": "2025-11-15",
    "content": "But it’s been really great having all that storage, plus have been using it for some other stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1439396779379527815",
    "author": "Bryan DiMaio",
    "date": "2025-11-15",
    "content": "And the server is *not* necessarily a backup, still practice safe data storage",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1452407791116619896",
    "author": "Adam Thein",
    "date": "2025-12-21",
    "content": "It’s been a while since I’ve used windows but in the Disk Management utility you can right click the drive in the list and an option called “Change Drive Letter and Paths” comes up if you want the drive letter to be the same between machines.  \n\nI’m not totally sure if this is what you’re asking but hopefully it helps.  I’d maybe backup that data before changing the drive path just in case.  Hopefully that would resolve some of the issues with file management between the two machines.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1452419786561818674",
    "author": "Adam Thein",
    "date": "2025-12-21",
    "content": "Yeah found it on google - did you try opening a backup?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1452420682733453545",
    "author": "BoozleBAM",
    "date": "2025-12-21",
    "content": "Yes, Sir - Unfortunately, the backup file is unable to be \"parsed out\" as well. I ran a function called \"Move to media source preferred position\" and that managed to put everything (all the different takes) where they were time-wise in the session, but there is apparently no way to put them back in their respective \"lanes\" for takes and such - Reaper is a little funny with takes etc; So, what would normally be 10 different tracks is now fifty.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1452422021874061466",
    "author": "Felix Byrne",
    "date": "2025-12-21",
    "content": "peculiar\ndoes it come up on the original computer? maybe you could save a backup session",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1452426022006821009",
    "author": "Felix Byrne",
    "date": "2025-12-21",
    "content": "try open a backup from before it happened on the original computer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1452426852026290389",
    "author": "Felix Byrne",
    "date": "2025-12-21",
    "content": "reaper should auto backup every 5 mins or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1452426986675769475",
    "author": "Felix Byrne",
    "date": "2025-12-21",
    "content": "“Backup Projects” in the folder",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1452427258563268608",
    "author": "BoozleBAM",
    "date": "2025-12-21",
    "content": "Huh, man Reaper is way above my pay grade sometimes; if I open the session folder, I've got the rpp file and the session backup file (and all the wavs) but that's it. And the green colored duplicate was files or whatever.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1452428860489732216",
    "author": "Adam Thein",
    "date": "2025-12-21",
    "content": "I think the idea is that if you can find older backups maybe one of them will open",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1456002135333404876",
    "author": "Eric Martin",
    "date": "2025-12-31",
    "content": "proper dry storage is the most important part of TAPE, a cave would most likely be a bad place to store tape because of the humidity",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1464308917340209350",
    "author": "BoozleBAM",
    "date": "2026-01-23",
    "content": "I'll have to see if I can't break into my father's storage unit this afternoon - perhaps he has some of Mr. Thorpes recordings stored on my old mini disc players...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1472983809757544731",
    "author": "revolution",
    "date": "2026-02-16",
    "content": "i bounced the demo previously on basicalyl the rec aux and the effect goes away so its definitely an interaction with the effects in this particular song, but seriously none of those plugins are remotely moving anything",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1472984026552991957",
    "author": "revolution",
    "date": "2026-02-16",
    "content": "weird tho its an m2, maybe i. bounced/recordered while the buffer was set too low?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  }
]