[
  {
    "id": "927051207258816573",
    "author": "cian riordan",
    "date": "2022-01-01",
    "content": "Agreed -- be critical of everything. Be critical of things that are expensive for the sake of being expensive. Things that are just  instagram ads shilling to newbies. Critical of  Greg Wells pandering to whatever his base is. But recommending a 4k converter based on 'audible conversion quality' isn't helpful if the consumer doesn't have a million other ducks in a row first -- room treatment, adequate monitoring, proper gainstaging, etc. Jon has that figured out, so it makes sense for him. But when people come into a forum with questionable knowledge and background in music production asking what's the best converter, I think it's fair to ask some prying questions before just making blanket recommendations on what one person heard or not. I have plenty of semi-OK stuff that still gets used on the regular, and plenty of expensive gear that I would happily toss out of my workflow. They're all just tools. And whether its bougie DW Fearn or a black-friday Acustica plugin, , if it works for your workflow and gets you results you're happy with, then its worth whatever money you're willing to pay for it.",
    "reactions": 23,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1020798891593044018",
    "author": "cian riordan",
    "date": "2022-09-17",
    "content": "You're very much being taken advantage of here. I would recommend politely writing them an email saying that you've done the work that you were hired to do (especially if things have been delivered for mastering) and given the amount of additional work they're requesting, you need to negotiate a new fee for said work.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070581843738505286",
    "author": "NoahNeedleman",
    "date": "2023-02-01",
    "content": "I work free and at low rates a lot, (some might argue my rates *are* low, read: my fiancée,) but always with the caveat that I might not be as fast. Good Fast Cheap- usually gotta pick two right?",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "944967385490804746",
    "author": "jantrit",
    "date": "2022-02-20",
    "content": "AES recommends sativas during the day and indica at night",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "811397222016745472",
    "author": "oaklandmatt",
    "date": "2021-02-16",
    "content": "i love this question. i've been doing this for long enough that the cycles of how records sound has changed several times. so every few years i try and take some time to unlearn/relearn.\n\nthere's no good short answer, but i'd start with taking some time outside of mixing to just listen to records. whether you've done this before or not, get to know your speakers and your monitoring environment better than before. listen to your favorite records that you know well, and make some tweaks. you don't necessarily have to redo your whole setup, but listen to your speakers in slightly different positions, different settings on the back of the speaker, etc. and really dig into listening and enjoy yourself.\n\nthat's usually enough to make me think about mixes very differently (which ultimately means i get better when i re-incorporate most of the things i already know). but if you need more, just try and simplify. start a mixing by just leveling everything. clip gain and leveling and panning. then balance frequencies and compress (via compressor or saturator or limiter or whatever). basically, with fresh ears, go back to basics.\n\nnot sure if that will transform you into a new mixer, but that's an outline of an approach i use when i feel like i need a big talent upgrade",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1103605053220200448",
    "author": "Ross Fortune",
    "date": "2023-05-04",
    "content": "Totally with @Adam Thein, I can’t do too much of any one thing in a row. If all I’m doing is mixing, I want to be recording. If all I’m doing is recording, I want to be writing. I’m happiest when my weeks have a bit of everything. \n\nIncidentally though, songwriting has been a surprising source of mix work - would recommend. If we’re at my place, people get to come and see the space, and when the rough mix from a day’s writing sounds good, it inspires confidence in the mix work.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1398382089489092721",
    "author": "Felipe De Mari Scalone",
    "date": "2025-07-25",
    "content": "Oh man, thanks! Likewise 🙂 I'm super grateful for my time in LA assisting you at the Nest, it was the best time of my life, no doubt. The more I get into this job, the more I see how difficult it is, but things like mentorship and having a strong community like this make it so much worth it.\n\nI tried to run away from it when I was younger, but couldn't. I don't think that's a choice for those of us who love it more than anything... so finding people that think and feel the same way is so inspiring and NEEDED 🙂",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "857126419195625482",
    "author": "cian riordan",
    "date": "2021-06-22",
    "content": "3) Not all manufacturers are created equal. With vinyl pressing plants months behind on their bookings, there are many budget plants that seem to be doing things for cheaper and quicker. You get what you pay for. QRP in Kansas are the best in the business. RTI in CA used to be the gold standard, but they dogged me real hard on a project about 10 years ago and never made things right. Even Doug Sax had to step in to set them straight.\n\nThe short of it is, if someone is venturing down the path of manufacturing vinyl for their project — *especially* if it’s self funded — they have to ask what they’re really looking to achieve. If they want a high-quality, analog preservation of their record for all to enjoy, then they need to be prepared to spend some real coin to achieve good results. If they just want a physical item to sell at shows and toss in a download code — that’s OK too — but it will still be pricey, and probably won’t sound great if you do it on the cheap. Just my $0.02.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "980342676295671848",
    "author": "Slow Hand",
    "date": "2022-05-28",
    "content": "If your position as a studio runner is paying dividends and you can sustain the lifestyle and afford to go without compensation then continue down that path. It sounds like you're in a position where people may not be giving you the time of day. At this point what a potential mentor figure will be seeking from you is an assurance that you are committed to the path and that their effort will not be wasted on someone who is not committed. \n\nConsidering your position, right now I would recommend adopting an attitude of A) respectful persistence when asking others for insight and help B) private study and a self-starting attitude to make things happen for yourself without their assistance C) actively seeking opportunities to assist, contribute, and be of help to others and D) building your own network of creative collaborators with whom you can continue to create and experiment together.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1127999853092413492",
    "author": "popaganda.",
    "date": "2023-07-10",
    "content": "I think you can cop a convincing tone with a cheap guitar and good pickups, especially if it’s just for a part in a track. But there’s a lot of other stuff going on with guitars besides the core tone of the strings/pickups/cab. Really nice guitars feel integrated and resonate in a way that invites you to “make the bond.” Not so nice guitars you’re manipulating elements to achieve a sound.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "944413150244118549",
    "author": "peterlabberton",
    "date": "2022-02-18",
    "content": "AES also recommends doing a save as if you get too stoned to be sure you’re making responsible mix decisions",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1173776905229574324",
    "author": "Bryan DiMaio",
    "date": "2023-11-13",
    "content": "Like that diagram of “good, cheap, fast; pick two”\nI’ll always aim to do my best but it’s either going to be cheap or it’s going to be fast",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1262443318252539967",
    "author": "cian riordan",
    "date": "2024-07-15",
    "content": "I had the presonus and I’ll say that you get what you pay for. Lots of flexibility but terrible Sonics and build quality.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1276242984567836963",
    "author": "jonmatteson",
    "date": "2024-08-22",
    "content": "I would recommend bouncing down a multi-track with all plugs, panning, fx, and master buss applied as well as an instrumental, instrumental with BGV’s, and a lead accapella. Also include a full mix ref in that folder and that should be everything any MD would need to succeed. Bonus points if you have sub folders for everything and their instrument groups with good labeling!",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "857827337578872842",
    "author": "Slow Hand",
    "date": "2021-06-24",
    "content": "You can sneak in some early reflections from a reverb to add space around the vocals without sounding overtly spacious. That should give the sound some depth without reading as “processed”.\n\nBjörk is notorious for having her vocals bone dry. Based on what you’ve described I might give her a listen for  suggestions on how to proceed.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1179485430798880838",
    "author": "Bryan DiMaio",
    "date": "2023-11-29",
    "content": "The Apollo also has a systemwide key command to adjust the volume, which is neat",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1179841634670751884",
    "author": "David Fuller",
    "date": "2023-11-30",
    "content": "No idea. But I wouldn't focus on the gear. In fact I'm going to come right out and say that whether or not he uses an Apollo doesn't matter.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1183807567189786634",
    "author": "tomtom",
    "date": "2023-12-11",
    "content": "I've had a few interns come through my little production studio. The best ones knew when to stay out of the way and when to pick up a soldering iron and start fixing cables. The worst one vampired an entire croissant tray before the client showed up and took 5 minutes to set up a mic stand w/ a 57 on it. To echo the others- ask how you can be helpful (and double echo the advice to brush up on basics on your own). I recommend keeping a notebook- shit moves fast and you won't remember everything. Keep tabs on fussy gear (especially if multiple producers or engineers are using the space and aren't as familiar with it). Be a cable-wrapping ninja and know how everyone takes their coffee.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235640805012541481",
    "author": "cian riordan",
    "date": "2024-05-02",
    "content": "Highly recommend sending files via another service. Receiving Google Drive files really is a nightmare (doesn't download, downloads in several zip files with directories randomly scattered across them). We can be hyperbolic about our silly strong opinions here... but this one is real. Google Drive is the devil.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1341409400794910781",
    "author": "Adam Thein",
    "date": "2025-02-18",
    "content": "Swapping headphones feels like getting a new prescription on your glasses after several years.  The signatures can be so wildly different and it typically takes me 6-8 weeks of listening to them regularly to get well adjusted.  I wouldn’t recommend switching out monitoring in general mid-project - better to use what you know and get to the finish line than to suddenly add a lot of doubt to the work.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1353826332353630361",
    "author": "Nomograph Mastering",
    "date": "2025-03-24",
    "content": "And if the difference between say a Kali IN8 and a PMC 6 is beyond your skill level to perceive, or beyond your need (say as a hobbiest) then it doesn't matter how justifiable the extra $$$ on the PMC is, it's not worth it for you",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1366825398901407946",
    "author": "masteredbyjack",
    "date": "2025-04-29",
    "content": "Something I've been thinking a lot on is how becoming very good on the business side actually leads to more and better opportunities for work, helping the craft improve faster than if you are not as up on that end of things (staring at myself here, believe me I have a lot to improve on there too). And working with more serious people who cause you to up your game\n\nI think the above is true so long as you are \"good enough\" at the craft to play the game for real",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1045502618509783051",
    "author": "Adam Thein",
    "date": "2022-11-24",
    "content": "Also in general Izotopes upgrade pricing is pretty god awful - so if you are planning on getting everything eventually you will save a LOT by just saving up and buying their music production suite or everything bundle.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1057644736971817061",
    "author": "Ross Fortune",
    "date": "2022-12-28",
    "content": "**Orchestral/Scoring**\n\nSpitfire Audio - obviously focusing on their own products, but they are excellent and the tutorials are made by real life working composers, with interviews, studio tours and workflow suggestions - https://www.youtube.com/@spitfireaudiollp\n\nSpitfire’s Christian Henson - as above, but from his own account - https://www.youtube.com/@ChristianHensonMusic\n\nJunkieXL (Mad Max Fury Road, Hans Zimmer protegé) walks through projects, gear setup, music theory, professional practice stuff - https://www.youtube.com/@junkiexlofficial",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1060007011393220728",
    "author": "David Fuller",
    "date": "2023-01-03",
    "content": "The gold standard are Fluke meters. Not cheap though.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1082118061663981679",
    "author": "popaganda.",
    "date": "2023-03-05",
    "content": "The base model will be a huge upgrade from what you have",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1143741634199175219",
    "author": "Bryan DiMaio",
    "date": "2023-08-22",
    "content": "From my interpretation of what you've said, you're wanting to send line level audio from your mix bus into it from your interface to add the color of the Burl? If so just route the mix to some outputs on your interface, then analog into the Burl, and then digital (If you're not on an apollo 16 you'd use toslink or coax spdif, if you're on an apollo 16 you'd use AES) back into the interface, arm a stereo track, and record.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235670447878570036",
    "author": "peterlabberton",
    "date": "2024-05-02",
    "content": "It’s monophonic, but I got a Moog Grandmother several years ago, partly to wrap my head around synth basics. No presets, simple controls, but surprisingly deep with all the different patch points. Would def recommend.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263598896567812207",
    "author": "cian riordan",
    "date": "2024-07-18",
    "content": "Until that happens, all these other suggestions are way down the well",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263736992810926230",
    "author": "Nomograph Mastering",
    "date": "2024-07-18",
    "content": "Not recommending it! But PT is easy to learn, the most intuitive DAW by a long way",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1404211243010490440",
    "author": "hyanrarvey",
    "date": "2025-08-10",
    "content": "Tbh if you’re good enough at looking you can get a shit load of panels and mic stands for free",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "822911707344535642",
    "author": "oaklandmatt",
    "date": "2021-03-20",
    "content": "i don't know about usb 500 series boxes, but having an A+ preamp into the line input on the apollo will likely be an improvement on the apollo preamps (which are actually not bad though). \n\nps, this is what i do with my undertone pres into my apollo x16",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "848413616939335690",
    "author": "Josh",
    "date": "2021-05-29",
    "content": "Yo so my twin actually broke and I had a crazy ass noise floor. Got my arrow and it disappeared. I haven’t met a single person with a broke Apollo.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "883415086054641704",
    "author": "Rollmottle",
    "date": "2021-09-03",
    "content": "Microshift is dope. Recommend waiting for when the whole Soundtoys bundle goes on sale and you can cop the whole shit for pretty cheap",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "989663794454212699",
    "author": "Josh Bowman",
    "date": "2022-06-23",
    "content": "Ya it’s something to do with the io setup in console. I think the outputs and inputs by default aren’t aligned 1-1, but I remember when I had an Apollo and was doing this there is a setting that fixes it in the apollo console settings io page (I can’t remember the name and don’t own an apollo anymore.). To make sure it’s not the analog gear you can just go directly out and back into the Apollo ad we’ll just during the troubleshooting phase…",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "989902105546465291",
    "author": "chadwahlbrink",
    "date": "2022-06-24",
    "content": "https://help.uaudio.com/hc/en-us/articles/208992366-Configuring-Apollo-s-I-O-for-Hardware-Inserts-in-Pro-Tools - you need to do some extra finagling with how the I/O is laid out in the console softwares matrix. \n\nThe time alignment is not always great… but I think that also comes from needing a pro tools HDX setup potentially? That’s one of the weird things I have never fully understood with PT.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1042952537831116842",
    "author": "ehutton21",
    "date": "2022-11-17",
    "content": "I will say that depending on your goals FB ads are a great platform but be prepared to just set aside your humanity and dignity. When they are run well, it’s effective. Downright frightening how well they can be run, especially if the visual components and the demographic is well targeted. The AI/ML processing is insanely powerful. Running a good campaign can also be dirt cheap, too.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1043584143356870677",
    "author": "cy (sigh)",
    "date": "2022-11-19",
    "content": "it varies greatly with the artist /genre id say. some artist i write/produce for and they come with no musical ideas besides their likes and dislikes. some are more involved and will have ideas that'll you'll be tasked to bring to reality. \n\ni highly recommend having at least a handful of things to present from jump. these can be some progressions or a couple lead melodies and a few drums. doesn't have to be complete but in most cases its better if it has direction on its own. if at all possible i would have the artist send you sonic references to what they've been feeling recently and maybe some spiritual /energy reference as to the type of performances they might be interested in doing themselves.\n\nI've asked folks to make a ahort Playlist and based on that I'll add a few more songs and we'll listen to those while discussing /shooting the shit for a few minutes before starting. \n\nif they have a concept or idea in mind well work from there. if they're coming in blank then id usually touch on some of the prepped stuff and start playing around with old/new parts to find something we groove with. \n\non the other end or the spectrum there are artists im familiar enough with that they'll just ask me to play anything i have that's not used or they'll hit me up and just ask to send stuff. \n\nthe back and forth ones are usually more involved in production and some of them will do the same in the room or not. i.e tell you to take stuff out /out stuff in and others will do it themselves. especially if they play instruments. \nhow much you chop /edit their parts will also depend on the relationship but i always let them know that im gonna always experiment and we can always take a step back if i go too far. \nhow you send the files will depend on your trust.\n\ni rarely do random pitches anymore unless i know the person or their primary producer is asking for starters. \n\nyou'll likely have to adjust a lot at first if you haven't worked w them much but you learn your clients w time",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1045502120847228988",
    "author": "Adam Thein",
    "date": "2022-11-24",
    "content": "What DAW are you in?  The reason I ask is that I work mostly in Ableton and Fabfilter Q3 was a huge game changer in workflow for me being able to resize the window and have more flexibility with curves and slopes over EQ Eight (the stock EQ).  I’m not sure how the math works out but if I were starting fresh again I’d rebuy the Soundtoys bundle and Fabfilter Q3.\n\nIf you need just Q3 the cheapest I found this year is https://www.jrrshop.com/fabfilter-pro-q, and use code GROUP to bring it down to around $107 USD",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070554987882618911",
    "author": "hyanrarvey",
    "date": "2023-02-01",
    "content": "Like its weird when things are too cheap it scares bigger artists away weirdest phenomonon but its like if its too good to be true",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1088692552011612210",
    "author": "Nomograph Mastering",
    "date": "2023-03-23",
    "content": "Search for some posts from me about the benefits of 2 subs (even cheap ones) over 1",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1131797991284551780",
    "author": "Deleted User",
    "date": "2023-07-20",
    "content": "I trained using EQs with horizontal interface. Use the same one for a long time, you'll be able to graphically know where it sits. I wouldn't recommend using analyzers to do this because they are deceiving. At some point the numbers will start pop up in your head on their own.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235671229390786681",
    "author": "Deleted User",
    "date": "2024-05-02",
    "content": "What is your budget/price range?\n\non affordable side, roland desktop synths are top notch. If you have higher budget- prophet 6.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235728030169698405",
    "author": "Slow Hand",
    "date": "2024-05-02",
    "content": "Modulars are great and boatloads of fun, but I wouldn't recommend them to anyone who is just starting out because they're expensive, overwhelming, and an absolute rabbit hole.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1262831478480568522",
    "author": "Zack Hames",
    "date": "2024-07-16",
    "content": "Yeah those presonus are hot garbage",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267528609468252241",
    "author": "Will Melones",
    "date": "2024-07-29",
    "content": "Somebody told me that Audible specs or recommends Reaper, so….definitely Pro Tools. I have voice actor friends doing it in Audacity, Reaper. None really used a DAW prior to the pandemic. Just don’t use the life-ruining click and I’m sure the software will stay out of the way",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293056829806612522",
    "author": "Slow Hand",
    "date": "2024-10-07",
    "content": "Hey. Welcome! \n\nBased on what you've shared, it sounds like you're early in your journey making records. There are a lot of reasons that an Apollo might be a good investment, but buying them for the converters probably isn't the best use of your money at this stage.\n\nThe difference that converters will make (if any) is very very small compared to other factors. Factors like having a good room to listen in, acoustic treatment for the room, and the monitors you're listening through. I would prioritize those and consider converters to be very low priority until you get those other factors working well.\n\nSo unless there are other reasons that you'd like to have an Apollo I think you can save your money for the time being.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1326390052707766406",
    "author": "Matt Huber",
    "date": "2025-01-07",
    "content": "Some of my favorite Tom mics are CHEAP",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1393918434273787945",
    "author": "Ross Fortune",
    "date": "2025-07-13",
    "content": "Hopefully someone who’s actually had to claim can recommend a provider, but this feels like a googleable question at least to get some quotes",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1400538285985628160",
    "author": "Matt Huber",
    "date": "2025-07-31",
    "content": "CAPIs & Hairball Lola’s rule, are cheap and the skills acquired along the way are so valuable. Another affirmative vote here.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1404258273778995270",
    "author": "Beck Nebel",
    "date": "2025-08-10",
    "content": "I'm a Kali IN-8 user - they are truly incredible. I also just finished my GW build - if you decide to go that route, I recommend scouring FB Marketplace/Craigslist for supplies. I saved about $1500 that way - Sheets of MDF for $10 a piece, bags of rockwoold for $15 each, the list goes on.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1472999265046626315",
    "author": "spectrummasters",
    "date": "2026-02-16",
    "content": "Yeah man send me an mp3 for sure \n\nI’ll put like my top three recommendations for a great engineer demonstrating vocal processing for ya a bit later tho . \n\nYou should be able to spot the similarities between their approaches",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "829348455439794188",
    "author": "Zack Hames",
    "date": "2021-04-07",
    "content": "I keep seeing those being recommended, definitely if you can go listen somewhere you’ll be able to make a really good choice! Good luck!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "858145410785738752",
    "author": "Zack Hames",
    "date": "2021-06-25",
    "content": "I just downloaded the “snapshot” plugin today to do recalls for the MPEQ-1, otherwise I just use the comments section in PT to document what gear was used if I want to remember. Usually what guitar, amp, mic, or other important particulars, or what drum/mic or something.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "888788447165317210",
    "author": "Josh",
    "date": "2021-09-18",
    "content": "Being that I grew up in metal, and then switched to pop, all of those years of learning how to play deathcore were wasted as I couldn’t even tell you what the fuck I was playing. I’d recommend just learning new songs to start. That’ll get your brain working differently. And then learning different chord voicings. That’s what I’m on right now.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "926978755136720937",
    "author": "peterlabberton",
    "date": "2022-01-01",
    "content": "This is an Apollo X16, there are higher end boxes and certainly lower end boxes, but… I just think converters/clocks are waaay over hyped. Not trying to pile on but I just think these conversations are an expensive distraction from making music!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1057736985311191070",
    "author": "LAPhill",
    "date": "2022-12-28",
    "content": "Are you looking for resources on writing/production, or mixing? Just like with the record side, there's so much noise from bedroom composers and people that have zero real-world experience. And as Ruairi is always saying, even the people with real success often can't teach what they know. Maybe I'm a bit cranky after an 8 hour delay at the airport yesterday, but Spitfire has gotten quite good at creating \"tutorial\" videos that are thinly veiled advertisements, and many of their libraries are the equivalent of one-knob plugins or CLA vocals. Selling paint-by-numbers solutions to naïve kids who want to get into scoring (They're far from the only ones guilty of this). But to focus on some of the channels I think are actually worth their salt:\n\n8-Bit Music Theory: https://www.youtube.com/@8bitMusicTheory/videos\nCan be a bit basic at times, but he talks a lot about structure which, IMO, is becoming a lost art in modern scoring.\n\nAnne-Kathrin Dern: https://youtube.com/playlist?list=PLWJg1w7F3PKPbSpEF2YOejVjWAg-KcM3Z\nNot the biggest name out there, but she has a no-bullshit way of explaining things about orchestration and theory that is clear and concise. As far as \"teachers,\" I think she's a good one.\n\nAlan Meyerson Waves Sessions: https://youtu.be/h9jZqn5lnw4\nI hesitate to include this. I know for a fact that Alan swapped out a bunch of his go-to plugins to make everything a Waves product. I haven't watched this in awhile, but it's a good insight into how he sets up a big mix session and why he makes some of his decisions. He's also playing to the camera/audience some, so this is a your-mileage-may-vary recommendation.\n\nMcGowen Soundworks: https://www.youtube.com/@McGowanSoundworks/featured\nPhil knows his shit, and goes pretty deep breaking down a few actual mixes, which is pretty rare to find.\n\nIf I think of others, I'll report back. Hope that helps",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1059189587488018473",
    "author": "popaganda.",
    "date": "2023-01-01",
    "content": "Running dac off Spdif def sounds better than toslink ime. Spent a long time slaving Hilo to Apollo for monitoring and loop. Worked great",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060010357302767707",
    "author": "austenballard",
    "date": "2023-01-03",
    "content": "I second getting a Fluke if you think you'll be doing this stuff long-term, but if you need something quick and cheap, Sperry products are pretty inexpensive and reliable.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060068360009818122",
    "author": "Nomograph Mastering",
    "date": "2023-01-03",
    "content": "I’ll do a little research and recommend something in that ballpark. I still have my first multimeter I bought 29 years ago and it works fine. Features wise it’s quite a price jump before you get trick stuff like logging and dB offsets etc, nothing you need to worry about",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1076124712507281488",
    "author": "Poll.EG",
    "date": "2023-02-17",
    "content": "So there is a LOT here.  Any suggestion on how/where to start to dig in ?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1117537681770033283",
    "author": "lulu lemon",
    "date": "2023-06-11",
    "content": "There’s no way I know of where you can undo after you’ve switched back to edit mode because Melodyne does a new analyzation based on your edits every time you leave Note Assignment Mode. There’s nothing you can’t undo in Note Assignment Mode after exiting it, either, though. If you don’t want to have to deal with both at the same time, I would recommend going through the whole track in Note Assignment Mode first and figuring out any note detection discrepancies and then start tuning.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1128442801072377966",
    "author": "Jeremy Klein",
    "date": "2023-07-11",
    "content": "in regards to cheap guitars, this is where i say my normal thing about how the berhinger moog sounds identical to the real thing, but the cheap plastic housing will make you play it differently",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133957366124138546",
    "author": "NoahNeedleman",
    "date": "2023-07-26",
    "content": "Producer signed off on the mix, and then back peddled and sided with the guy he recommended to master?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1183206240663375882",
    "author": "xico1702",
    "date": "2023-12-09",
    "content": "Hii folks!\n\nI hope you're all doing well! 😊\n\nWell, I'm the newest intern of a music production team, and I'm working in a simple production studio with a control room and a small recording room.\n\nNext week, I'll have a studio presentation where I'll have the opportunity to ask questions. The first question on my mind is about the signal flow, but I'm trying to gather some more interesting questions to ensure I get the most useful information possible.\n\nAny suggestions for additional questions that could be helpful? I'd love to have your help in preparing!\n\nThank you in advance, and I can't wait to get started for real. 🎶✨",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222750149277909082",
    "author": "BoozleBAM",
    "date": "2024-03-27",
    "content": "@Nomograph Mastering I was actually telling @NoahNeedleman that I've got a 6i6 that sounds great and also does spidif, but it has to be connected to USB and so does my tascam - The two brains of each machine tend to want to fight eachother for control, I think, and I'm constantly having to reset the focusrite in the control panel. Super fickle and super annoying. So, if I can get the Roland unit to work without squealing, that would be sweet.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235675139354661026",
    "author": "Deleted User",
    "date": "2024-05-02",
    "content": "This is why recommended prophet, a lot of other synths don’t have preset-ability. \n\nThere is a workaround by using System Exclusive, but sometimes you don’t want to bother",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1236194204510715946",
    "author": "Deleted User",
    "date": "2024-05-03",
    "content": "Minilogue is the most affordable out of all of them, but I guarantee you’d still have A LOT of fun with it. Especially with pedals. \n\nProphet 6 is so versatile- you probably won’t be looking at another synth for a while. It’s like getting a strat or a 335. \n\nTake 5- I’ve never messed with it so I can’t speak about its usefulness. But it seems like it comes with Prophet 5 filter and has polyphonic glide feature.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1260642463224299682",
    "author": "Josh",
    "date": "2024-07-10",
    "content": "Yeah it’s annoying but well worth it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1262939319132225576",
    "author": "Zack Hames",
    "date": "2024-07-16",
    "content": "I’d be shocked if the Roland was noticeably different to the focusrite in regards to its conversion / monitor path. But I could be wrong.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263735848327974922",
    "author": "BatMeckley",
    "date": "2024-07-18",
    "content": "I would also caution against making your magnum opus first time out. Focus on actually finishing g a song or two, instead of tweaking 10 albums worth of material. Let good enough be good enough, and get that beautiful music out into the world.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263737414837604415",
    "author": "tim adamson 🇦🇺",
    "date": "2024-07-18",
    "content": "Yes sorry, I was thinking to my assisting days were as bamboozle as also recording he's own music, I retract my suggestion whole heartedly",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1267603103817924648",
    "author": "xico1702",
    "date": "2024-07-29",
    "content": "Hi folks! I'm looking to buy my first pair of studio monitors. I choose the Kali Audio IN-8 2nd Wave. I saw the website and they were two colours, black and white. The white ones are cheaper than the black ones (18 euro difference). I'm not a person who cares a lot about the colours (as long as it's not too extravagant). Do you have any experiences that you want to share about this topic? 😄 Thank you!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1274858771486871602",
    "author": "BoozleBAM",
    "date": "2024-08-18",
    "content": "Watching the Andy Wallace mix with the Masters thing this morning was tremendously helpful... I tried desperately for the longest time to find someone to sit in with, but no one around here would let me do it - There was one guy in Chicago that would, but I would have had to pay him quite a bit of money. Maybe it would've been worth it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1280344497955405824",
    "author": "Zack Hames",
    "date": "2024-09-02",
    "content": "There’s no right or wrong in this regard.\n\nIf you’re landing the transitions really cleanly between the different levels of overdrive you’re golden. \n\nYou’re getting suggestions from folks who probably got burned on records where it was done poorly or it would have been easier for them to separate and organize like @cian riordan said. He described the benefits of it perfectly. \n\nI’m impatient as *fuck* and prefer to cut as many things live and in 1 go as possible. I don’t like overly complex sessions, etc. it’s prob more of a shortcoming than benefit unfortunately.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1284241489374744597",
    "author": "Nomograph Mastering",
    "date": "2024-09-13",
    "content": "I still have my first DMM I bought 30 years ago (and 5 more). Do yourself a solid and buy something a little better than the cheapest, as an investment in yourself",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1284305342913708203",
    "author": "Will Melones",
    "date": "2024-09-13",
    "content": "I’ve also been perplexed by the manual for my MOTU interface, and I’m skeptical about the values it specifies. After some back and forth with a couple support agents, I’m no more convinced that anyone is sure",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1331785058901819464",
    "author": "BoozleBAM",
    "date": "2025-01-22",
    "content": "I have two T7s and have formatted them both at your suggestion. Yes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1334534814786912266",
    "author": "Bryan DiMaio",
    "date": "2025-01-30",
    "content": "Well, it all depends on what gear you have and/or want to use.\n\nIf you have a DI box, an outboard preamp you want to use, and an available line input on your interface yes.\nIf you have a DI box and an interface with built in mic preamps but no outboard preamp, do that. If you have an interface with an instrument input but no DI box and no outboard mic preamp do that.\n\nSome outboard preamps even have a DI input on it that sounds pretty good, but without knowing your exact setup idk what to advise. Based on the above info though you should be able to make that choice.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1338586905226252329",
    "author": "Nomograph Mastering",
    "date": "2025-02-10",
    "content": "Better to get a small cheap good headphone amp like topping or smsl and run a balanced signal to where you need it with a local amp",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1353979829225000970",
    "author": "itaylerner",
    "date": "2025-03-24",
    "content": "For whoever was interested - I just brought my Apollo home and the hissing was gone. So seems like it might be the electricity at the studio which would be #tragic",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1363167623302479882",
    "author": "NoahNeedleman",
    "date": "2025-04-19",
    "content": "Deal points generally get approved by the artist, cause it’s the artist side it comes out of. There are sort of standard rates when you work on stuff like this so it shouldn’t be too big of an issue to hammer it out. \n\nAs long as you’re not tryna do something out of the ordinary, my suggestion is that you have the chat with whomever you’re closest too, artist or manager.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1413616363397976255",
    "author": "kylem",
    "date": "2025-09-05",
    "content": "Will definitely take some getting used to, but definitely an upgrade. Finishing mixes in headphones is super tough, not sure any pair would change my opinion on that",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1455084842382393435",
    "author": "Rollmottle",
    "date": "2025-12-28",
    "content": "Just taking the time to figure out the right changeover strategy and timing so that I could actually make the move once I basically had two fully functioning rigs stood up in parallel. My additional complicating factor is having a laptop that is a dupe of the studio rig, so keeping it all straight and everything in sync is a bit of a puzzle. \n\nI took the transition as the opportunity to phase out some mechanical drives so I had to get some new drives for the M4 instead of re-using the old Time Machine mechanical drive. The M4 mini only has Thunderbolt/USB C ports -- the M1 has USB A's and Thunderbolt/USB C's so I needed a TB hub to get my old USB hub to play on the M4. The move forced me to sort out my iLok strategy between my mastering rig and my production rig because it was quite messy (I ended up getting a 2nd iLok for the M4 to make things way easier between it and the laptop). It was just a lot of little stuff for me. If you're not changing machine form factors and it's mostly a software exercise, then it might be worth it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1455972857451647141",
    "author": "Zack Hames",
    "date": "2025-12-31",
    "content": "Alright gang - i've got this Otari MX5050 up and running and I wanted to ask if anyone had recommendations for buying new 1/4\" tape reels to record with in 2025/26.\n\nResearch I've done seems spotty, some people saying they've bought new tapes that were already shedding/sticky, etc. just wanted to see if anyone had current info or advice.\n\n\nSIde question; apparently after some time, tape reels simply go bad and have to be baked more or less every time you want to use them. So for those who have been using tape for a long while or did back in the day, you can't just use any old reel after baking it for a project? or can you say, bake it, use it for the project (record 2 track mix to tape, etc) and then just store it and re-bake it and use it again for the next project? \n\nI didn't grow up with tape but I love the sound and find the whole process romantic, despite how much extra work calibrating tape machines and maintaining them and the unpredictable nature of tape.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1460499497221099657",
    "author": "Eric Martin",
    "date": "2026-01-12",
    "content": "same interface or different? Running multiple Apollo’s? Try running the parallel on the same Apollo as the dry if you can to test.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1473001808489222206",
    "author": "spectrummasters",
    "date": "2026-02-16",
    "content": "I’d recommend just learning the ish out of one daw tbf ,",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "811411391810371594",
    "author": "rae",
    "date": "2021-02-16",
    "content": "I’ve got a Q regarding my headphones... I bought a pair of Audio Technica ATH-M50s at the beginning of 2020 and was recommended them for mixing/critical listening as they are  reviewed as ‘well balanced’ and were in my price range. However, I delivered a mix to a teacher and he stated that there was an error with low end in my headphones that was coming through in the mix (I re mixed it on the monitor on campus to test if it was an error on my behalf or the headphones). \nI was wondering what people’s thoughts are on this, if anyone has used these headphones or had similar issues with other headphones and maybe how to combat this 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "812588318159405087",
    "author": "Deleted User",
    "date": "2021-02-19",
    "content": "Interesting that that also plagues Audio-Technica's higher-end model! Fair enough, I just stick to my DT770s but am looking to upgrade sometime in the future(I use mostly headphones during pre-production)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "817081390176665620",
    "author": "hendrick",
    "date": "2021-03-04",
    "content": "do we have vocal producers in here? I'm working with an artist that is from a spanish speaking country but their songs are in english. what techniques do yall recommend to improve pronunciation when singing?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "820078706898501662",
    "author": "hendrick",
    "date": "2021-03-12",
    "content": "has anyone here upgraded to the new pro tools 2020.11? I'd like to upgrade but idk which files to download exactly since I already have 2019.6 i wouldn't want to download duplicate files",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "820081401265127424",
    "author": "cian riordan",
    "date": "2021-03-12",
    "content": "I'm running 2020.12 -- and its great. If you upgrade through the avid manager it should just take care of it for you, but dont worry about duplicate files... just download the full installer and it'll do the rest.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "821480529752490005",
    "author": "antoniohannamusic",
    "date": "2021-03-16",
    "content": "Yo! I have a quick solution for this! \n\nWhen you want to upgrade Pro Tools, just go into your applications folder (MAC) and rename Pro Tools to say Pro ToolsXX or whatever you want, then install the new version as normal it will just install as \"Pro Tools\" then you can open them up independently from your applications folder and keep both so you can always roll back if a new one buggs out with your plugs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "821485179183824947",
    "author": "cian riordan",
    "date": "2021-03-16",
    "content": "The only issue here is many of the system files get updated with the upgrade as well, so if it's a big enough jump, it will cause hiccups opening pro tools in my experience.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "821488446849155072",
    "author": "antoniohannamusic",
    "date": "2021-03-16",
    "content": "As with everything YMMV 🤣 but give it a go next upgrade and let me know how you get on!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "822905904437526545",
    "author": "hendrick",
    "date": "2021-03-20",
    "content": "so when we talk about 500 series lunch boxes. is the best thing to get one that connects thru usb or something? i just feel like having a high end preamp in there to then get it to the computer thru an apollo ruins it. how’s that different from plugin the mic straight to the apollo then? am i missing something?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "822912743187284018",
    "author": "David Fuller",
    "date": "2021-03-20",
    "content": "Line level and mic level are very different signals, and depending on the Apollo, some entirely bypass the mic preamp on the line input, others just pad it down to a lower level.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "825719082170843147",
    "author": "Zack Hames",
    "date": "2021-03-28",
    "content": "That’s all awesome. Congrats! I know Matt and Jon have recommended exactly what you did, don’t rock the boat on the first credit you get screwed on, make sure you get it next time. The relationship is more important long term “earlier” in your career.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "827586282716266546",
    "author": "mixedbywong_my",
    "date": "2021-04-02",
    "content": "Here’s what I’m experiencing on a project . It’s a musical type album almost like Hamilton that sort of vibe. All the vocals I’m getting for every song is recorded without an outboard mic pre or compressor from a C414 to an audient ID4’s mic input . Prob is even when the tracks are not clipping in levels but they all sound like there’s some small level of clipping going to the AD converters .  And I doubt the vocalists has decent microphone techniques singing in. Seeing that the vocals are supposed to sound kinda warm n not as polished , Even with some EQ moves, the vocals are still sounding like there’s some 3rd harmonic sounding saturation on them.  Anyone experienced this before ? Would love to hear anything that’ll help it sound better . 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "828750689739472906",
    "author": "Zakhiggins",
    "date": "2021-04-05",
    "content": "About to go record a band playing a pre recorded gig tomorrow. First time recording a fully live thing. Set up is acoustic guitar, e bass, epiano, 2 bg vocals and a singer. I think I'm set, but tbh I also feel kinda clueless. Just thought I'd come in here and see if anyone has any tips or suggestions? feel free to fire them at me please 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "829332142328774676",
    "author": "Zack Hames",
    "date": "2021-04-07",
    "content": "So I’m not crazy! I went to Emotiva Stealth 8s. They don’t make them anymore, nearly no one uses them either and not easy to find now so it’s probably not a great rec, even though I love them. One is out of commission so I’m using genelec 1032a’s with sonarworks. I started working on genelecs when I got my new job, and genuinely my mixes translated 100% more on those and they’re not even the best monitors. Sonarworks takes out the chunky low mid thing and adds more high end and low end which I like. It depends on the room/setup too. I think you can’t go wrong with any upgrade from the Yamahas. I wouldn’t buy genelec 1032s, they’re just what my studio has.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "831889011424755753",
    "author": "Boh",
    "date": "2021-04-14",
    "content": "Hey guys,\nI'm not sure if this the right channel for this sort of question, so please feel free to redirect me.\nI've got a live recording gig for some Opera Singers later in May-June (when Covid-19 settles down in my area) but I'm having trouble hashing out what to charge for the session and my time since I'm relatively new to this.\nThe session would include a Tenor vocalist and a piano performing 8 songs in a church/recital hall with the expectation of having those 8 songs cleaned up and mixed. I've done similar gigs twice before, and those were through recommendations, so I feel like I've been doing something right thus far. Can anyone ball park what someone like me, who is relatively amateur, would charge for something like this? \nI plan on renting some extra equipment for this session also, so that's another factor.\nHope someone can provide some insight,\nThank!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "837063793586339890",
    "author": "i am willie",
    "date": "2021-04-28",
    "content": "hey yall quick question : what is your process for creating headroom? do you guys just lower by a set db or do you recommend using like a vu meter",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "837369444636426270",
    "author": "Rollmottle",
    "date": "2021-04-29",
    "content": "The point of the test pressing isn't to pick one, it's more of a sanity check on the vinyl master.  I would always recommend an acetate to avoid the pain in the ass of discovering a problem with your master at test pressing. The acetate precedes the sign off on the master and allows you to hear what your music MIGHT sound like on a record. It is definitely lesser quality than a test pressing and a full vinyl run, but the $80 or $100 it costs will be money well spent to avoid a wasted cycle and cost of a bunk test-pressing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "839245984420200458",
    "author": "Slow Hand",
    "date": "2021-05-04",
    "content": "Gotcha. Generally speaking, effect pedals don't interface directly with a computer or plugins (although some can). Usually they can only be recorded as audio by plugging them into your audio interface and recording the audio as you perform it. I see that this one has a *MIDI In/Out*. That means it can probably receive *tempo* information (so that it synchronizes with other programs) and maybe some *program changes* that can tell it when to change presets.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "839247921458708562",
    "author": "peterlabberton",
    "date": "2021-05-04",
    "content": "https://www.radialeng.com/product/prormp This would be cheaper if you already have a DI",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "839248249802063902",
    "author": "peterlabberton",
    "date": "2021-05-04",
    "content": "They have a higher end model as well which has a trim on the output (so you can adjust level) and a basic filter going to the pedals, but this will definitely do the trick. Probably cheaper options than Radial but they make good shit that will last.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "844597283223896074",
    "author": "Zack Hames",
    "date": "2021-05-19",
    "content": "These are good suggestions, especially about the drummer’s playing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "845966590226071643",
    "author": "Lucci Rossi",
    "date": "2021-05-23",
    "content": "can’t agree more about making sure the drummer doesn’t hold the beater against the skin - that really makes a giant difference. If youve time to work with a drummer before recording this would be the main thing I’d always try to encourage if they don’t already do it and are open to technique suggestions . most drummers I know sadly always choke their kicks and it can be a hard thing to relearn on the spot while recording so might not want to add that extra pressure with the red button floating around !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "846571817090547753",
    "author": "longstoryshort",
    "date": "2021-05-24",
    "content": "what are you guys SLAMMING drums with on the bus?  i make house and love to have a very clean kick - some of these compressors chew my kick up, but i kind of need it to run in with the bus to get me the groove.  any suggestions on a good way to slam my bus without ruining my low end or phase?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "847881730441347073",
    "author": "peterlabberton",
    "date": "2021-05-28",
    "content": "I’m sure you’ve read this or could find it with a quick google search, but starting with the first reflection points would be my first step. Side walls next to the listening position and ceiling above. Then probably behind the listening position and perhaps behind the speakers. If you have anything to use as a bass trap, I’d recommend using something like fuzzmeasure to shoot the room and experiment with placing that stuff in different places. You’ll be able to see peaks and valleys moving around in the low end, assuming what you’re using is actually effective at sucking up bass. There are people with much more knowledge than me, but that’s where I’d start!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "847885980332851270",
    "author": "Rollmottle",
    "date": "2021-05-28",
    "content": "the concept is to couple your speakers to the front wall to remove or minimize SBIR and to leverage the room gain you get by being up against the boundary and then treat that energy at the rear wall. you will see most folks recommend this approach in small room contexts. i forget what exactly is considered an acoustically small room but most all residential rooms fall into this bucket.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "848276237901889566",
    "author": "David Fuller",
    "date": "2021-05-29",
    "content": "I take it it's an Apollo.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "848281138253791242",
    "author": "peterlabberton",
    "date": "2021-05-29",
    "content": "I’d second the recommendation to try not using any UAD processing on the way in. Try just using the Apollo pre (no modeling of another pre) and no additional processing. That should be plenty clean to work with... if not then I guess I’d look at the mics/cables to see if some combinations are better or worse. Just strip it back to the essentials and troubleshoot from there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "848371974158024714",
    "author": "Rob Domos",
    "date": "2021-05-29",
    "content": "If it’s the hissing kind of noise that you get more of when you switch from condensers to dynamics and ribbons, then it’s not the kind of noise that is coming from the room. \n\nIn rooms the main things you would be concerned about would be reflection (which you fix with treatment) and mechanical noise from things like computer fans, clocks, etc. and condenser mics would pick those kinds of sounds up more, not less. \n\nAny unison pre in the Apollo should be plenty low noise to not bother you on your condenser mics. I agree with others that not using any unison pre will make the noise floor lower, but I disagree with them in that I think using the unison pres is a pretty good idea often. \n\nThat said, if you’re struggling with noise, definitely try not compressing on the way in because compressors are only going to raise the noise floor. \n\nOn dynamic mics and ribbon mics, you can decrease your noise floor pretty considerably by picking up a cloudlifter and throwing that in the chain. \n\nIf you do all of the above and still have a high noise floor then either the Apollo is broken (which is pretty unlikely), or your microphone is picking up mechanical noise from your air conditioning, computer fan, refrigerator, etc. if those are the issue, then tackle the issue there. Turn off the A/C, turn off the fridge, turn off the LED lights, etc and see what you hear.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "853702982902611968",
    "author": "David Fuller",
    "date": "2021-06-13",
    "content": "That said I would highly highly recommend if you're building cables that you get one of these",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "857799968421183498",
    "author": "Zack Hames",
    "date": "2021-06-24",
    "content": "Also unfortunately it was recorded on a Focusrite scarlet with an AT2020 (remote production).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "862881882977861642",
    "author": "Rob Domos",
    "date": "2021-07-08",
    "content": "Thanks for the recommends! I’ve been wanting a playlist of any and all things related to excellent groove",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "863099631415590912",
    "author": "Slow Hand",
    "date": "2021-07-09",
    "content": "That's such a neat topic. Lately I've been putting a huge emphasis on groove and feel, as someone who programs drums (but doesn't play). I'm mostly nudging everything by hand and trying not to resort to anything like a DAW's swing. Do you have any resources you'd recommend for exploring the concept of timing/swing on groove?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "863106801125949450",
    "author": "Slow Hand",
    "date": "2021-07-09",
    "content": "Wow. Thank you. Great recommendation and an interesting concept to think about. Drummers are so neat when they have that total control.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "863108044865667106",
    "author": "Slow Hand",
    "date": "2021-07-09",
    "content": "On a side note, since you mentioned New Orleans drumming, I'm obligated to mention the show *Treme* that ran on HBO around 2010. That's probably the best show about music I've ever seen. It's such a celebration of the music life and it oozes with love for the art form (not to mention food and everything else it touches on). *Strong* recommendation.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "868582479508955146",
    "author": "Ian",
    "date": "2021-07-24",
    "content": "So not quite a music question but ive been editing twitch vods and they are super quiet since I have to upload to YouTube. I can push the clip gain in the video software all the way up and not clip before I bring it into protools for final limiting. I still end up around -20 LUFS before limiting which means I need about 6 LUFS to bring it to YouTube 's -14 standard. So my question is what strategies with gain staging etc would you recommend so that im not having the limiter clamp too much when I go to do final export?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "875745917507100684",
    "author": "mixedbywong_my",
    "date": "2021-08-13",
    "content": "Devil Loc 👌🏻 mixing live drums always a nerve wrecking time for me . What drum replacement plugins would you guys recommend?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "877404865503035412",
    "author": "Zack Hames",
    "date": "2021-08-17",
    "content": "Anyone have tips for recording live vocals while someone plays a grand piano? Id rather not use an SM58 but am open to any other mics, condenser or dynamic.\n\nThis is for a live video session, piano will be in a booth so I’m only dealing with piano bleed. I won’t have time to experiment much before the session so wondering if anyone has any wild suggestions!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "878003061832966155",
    "author": "SoundOfPatrick",
    "date": "2021-08-19",
    "content": "Both myself and the artist want to make sure the length of silence, and transitions between songs (where applicable) are as intentional and fine tuned as possible. Obviously each song has been mixed in a separate project file, so wondering if anyone has workflows they recommend for doing final mix deliverables on an album and fine tuning the space and/or transitions between songs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "880628741691301928",
    "author": "Ian",
    "date": "2021-08-26",
    "content": "Out of curiosity Im working on getting onto a tour as some level of sound tech, is networking the best way to get on one or does anyone have any recommendations?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "883224497052876801",
    "author": "hendrick",
    "date": "2021-09-02",
    "content": "eventide is running a sale and i'm thinking about copping the h910. anyone got some tips on it? is it worth it? going for $50",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "883342899708846122",
    "author": "kidcutler",
    "date": "2021-09-03",
    "content": "If I have the h3000 is it still worth it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "884978482864599060",
    "author": "hendrick",
    "date": "2021-09-07",
    "content": "i notice that HOFA is cheaper too so i'm curious why yall prefer that one over sonoris",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "916128661441237054",
    "author": "David Fuller",
    "date": "2021-12-02",
    "content": "yeah a single 15A circuit is plenty, but drawing that much over a cheap consumer power strip?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "926965480214908930",
    "author": "KushKadett",
    "date": "2022-01-01",
    "content": "maybe not a newb question but I thought it was really interesting what Jon said in regards to distortion of converters. I noticed something similar by experimenting with different clocks on my rather cheap interface. \nOne being the internal clock and the other a high quality Antelope Isochrone clock. The minute I hooked it up I was able to monitor a lot louder without it having the feeling of hurting my ears- the increase in clarity was immediate. \nSo It seems to be the case that this subtle (intermodulation?) distortion literally hurts our ears and can make people go deaf. 40 of Drake was saying something similar, so I'm wondering if there's more to this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "926989599090282517",
    "author": "KushKadett",
    "date": "2022-01-01",
    "content": "recommending a lynx converter costing 4000 dollars isn't playing into that type of crowd is what I'm saying",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "940298537495826453",
    "author": "itaylerner",
    "date": "2022-02-07",
    "content": "Fabfilter has some phenomenal educational videos, including a three part guide to compression- highly recommend! Has great examples and solid explanations, huge help if you really take the time to watch, pause, rewind, internalize the information.\n\nhttps://www.fabfilter.com/video",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "952913676829073438",
    "author": "chadwahlbrink",
    "date": "2022-03-14",
    "content": "I use a smart plug to turn on and off my noisy raid archive drives each night via a Furman power conditioner. They mount when the plug turns on, then Keyboard maestro ejects them a few hours later, and they turn off with HomeKit automation. I was tired of coming down to work and having the drives humming super loud when I walk in. \n\nI want to get another plug for my other Furman that powers my Apollo and monitors. I do turn off the Furman switch instead of individual components. \n\nAll that to say, you should be good to use a smart switch for something like this. I have the WeMo plug currently. The only caution is that it’s often “good practice” to turn off your monitors before anything else, although modern gear seems a bit better about not popping your monitors!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "988117210469916772",
    "author": "Davi Juno",
    "date": "2022-06-19",
    "content": "Hey everyone! Happy Father’s Day to all the dads out there! Question for you all!   I have a Vintage Rhodes  88 keyboard in italy that was my dads that I’d like to bring over here in LA … any recommendations on how to pack it, or tips that you can share for people who have shipped these instruments before! Thank you!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "989640262194200576",
    "author": "Maxim",
    "date": "2022-06-23",
    "content": "Anyone have experience using an Apollo interface with hardware? I’m having a bunch of issues setting up analog inserts. \n\nI have a cable plugged in on a “Line Out” and a cable connected on the Output of the Hazelrig VLC1 (set to line) going back in through a line input but there’s no sound coming in or out 🤷‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "993273268633075842",
    "author": "IanDobyns",
    "date": "2022-07-03",
    "content": "I just got a job at a studio in town, the room that I'm in uses a UA Apollo 8 (I use an x8 at home). Does anyone know if its possible to register the hardware at the studio on my UA account and also keep the hardware registered to the original owner on their computer when they're using it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1005855435414323330",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2022-08-07",
    "content": "Aight @Zack Hames 🙌\nWill do this @NoahNeedleman ⚡\nThanks for the Suggestions!🍻",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1013935127732166817",
    "author": "tcpicket",
    "date": "2022-08-29",
    "content": "Is there some resource anyone would recommend to get feedback tracks? Maybe something like trading tracks with someone near my level or even paying a couple bucks to someone with lots of experience?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017176437599502426",
    "author": "tcpicket",
    "date": "2022-09-07",
    "content": "Does anyone have a recommendation for a plugin to use to layer samples in with live drums? Trigger 2 seems a bit pricy if there's a decent alternative",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1028810536802074706",
    "author": "ALXCPH",
    "date": "2022-10-09",
    "content": "i'm running a lightning to jack adapter into inputs 3+4 on my Apollo x6, so people can connect their phones and show whatever music they want. Should i leave it at +4dbu or change it to -10dbV?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1028826647153094686",
    "author": "Nomograph Mastering",
    "date": "2022-10-09",
    "content": "6) Check Apollo input for clipping, and choose either +4 or -10 on that basis",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1029452261509845052",
    "author": "ALXCPH",
    "date": "2022-10-11",
    "content": "Does anyone here know if it’s possible to use an Apollo rack as an AD but something different(like a topping) as a DA, and still be able to use the uad with real time monitoring?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1029453899574292552",
    "author": "Rollmottle",
    "date": "2022-10-11",
    "content": "Anything with a SPDIF or an ADAT input should work for integrating a separate DAC for your Apollo. You'd have to ask the braintrust as I have no direct experience with them outside of their stellar reputation. Looks like D90SE gets the nod from @Nomograph Mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033516239852679268",
    "author": "Eric Martin",
    "date": "2022-10-22",
    "content": "Maybe it’s budget gear but I couldn’t get 24 channel sessions on ADAT to work without clicks and pops with only toslink, once I added word clock cables and linked properly it eliminated my issue",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1043699302402359396",
    "author": "Deleted User",
    "date": "2022-11-19",
    "content": "I do a lot of RnB and they have all been beat first. Most cases I’m reaching out to people with things I made- when it was other way around I had a really hard time finding the direction. It was all references and vague vision- but they definitely had solid understanding of what they didn’t want- which was kind of frustrating to me. I’d like them to either leave it open, or have a more solid vision. But most people with solid vision usually have lyrics IME\n\nBut interesting- I have never had anyone take offense to the beatstars recommendation. It’s not because I don’t want to work with them per se- I’m just trying to find them a way to get started haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1043718279782477824",
    "author": "cy (sigh)",
    "date": "2022-11-19",
    "content": "facts.\n\nstarted out doing so  much metal /banda/folk/infie stuff for free when i was starting out ( a lot of school contacts) and didn't  ask for credit but my first 3 paying clients were all session musicians in those free gigs. \n\nword of mouth and putting in thw time/work really pays off \n though it can def be frustrating. even when ppl think you're \"expensive\" when you start charging they'll see the value in your work once they try someone who's cheaper \"juat cause\". that consistency is everything and showing them you are doing everything for the song/project can be more important than the final song itself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1044334663252062298",
    "author": "Zach Hughes",
    "date": "2022-11-21",
    "content": "Yo so I recently upgraded to Melodyne Studio and am trying out the integration in Pro Tools. I used to have Melodyne 4 and in the standalone app you could click on a note and it would play the pitch as you hold and drag. This is NOT happening in pro tools and I miss it. Does anyone know if that's a feature that can be turned off and on or does it just not work that way in Pro Tools?\n\nupdate: it's working on my harmonies but not lead vocal track for some reason\n\nupdate 2: it started working and I don't know why haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1045778553926602813",
    "author": "Calvin Lauber",
    "date": "2022-11-25",
    "content": "Random q. Spotify “highly” recommends delivering FLAC’s over WAV files… does anyone do this? What is even the difference? I’ve always delivered WAV’s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060005843942252584",
    "author": "JakeTB",
    "date": "2023-01-03",
    "content": "Playing around with electronics seriously for the first time ever. I’m a short way through an online class and need to get a multimeter to start testing some of the ideas out myself. I have no idea what is good or bad, any (reasonably priced) recommendations? I don’t even know what my budget is, the prices seem all over the map on these things.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060007194579456121",
    "author": "David Fuller",
    "date": "2023-01-03",
    "content": "I have a cheap one from Circuit Specialists that is OK. I do wish it was autoranging though, I have another meter that is and it's a nice feature.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066164732903575612",
    "author": "ALXCPH",
    "date": "2023-01-20",
    "content": "Fair enough. I know being creative and being messy often goes hand in hand. But you have no idea how worth it is to get your stuff sorted and cleaned up. It just makes everything so much easier Down the Line. I dedicate a couple of  hours every other week to just sort and make sure everything is Nice and in systems. It makes working so much quicker when you know exactly where everything is and where to find it. Can recommend. It really isnt a lot of effort once you have a system.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069294936534556672",
    "author": "BatMeckley",
    "date": "2023-01-29",
    "content": "Imagine if they record it through a chandler 500tg pre going into an Apollo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070548255630430248",
    "author": "David Fuller",
    "date": "2023-02-01",
    "content": "$300 for mixing and \"mastering\" is quite cheap",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070550595687153674",
    "author": "David Fuller",
    "date": "2023-02-01",
    "content": "That is... interestingly cheap...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1077405370319917056",
    "author": "rae",
    "date": "2023-02-20",
    "content": "hi all, i'm looking for recommendations on wireless over ear headphones for general music listening on the go as my airpods have seen better days. i was wondering if anyone has any recommendations? part of me wants beats headphones (solo or studio) but ive heard that they arent worth the hype",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1078813413075066900",
    "author": "rae",
    "date": "2023-02-24",
    "content": "hey all, does anyone have any recommendations for a distortion plug in that sounds very similar to 'AM' era arctic monkeys ('arabella' specifically). thanks in advance 🥰",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1082112624705142784",
    "author": "7footer.",
    "date": "2023-03-05",
    "content": "I’m looking to upgrade my computer situation from a 16gb 2018 macbook pro to a new mac studio. Any spec recommendations? As far what to get ram and cpu wise? I don’t work on CRAZY huge sessions but I do run in to CPU problems when running bigger plug ins. Would 32gb of ram be enough or go to 64 for sure? Thanks 🙏🏼🙏🏼 btw I’m doing mostly tracking and mixing / vocal production.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1091382496169562182",
    "author": "Axl Rhodes",
    "date": "2023-03-31",
    "content": "tbh, i really need feedback on my pre-mastering. \nI'm not sure when it will be good enough to send for mastering. \nI also \"master\" my tracks myself and would like to know how good it is. \nMy environment is anything but studio, so I can just use what i have.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1093390148730900530",
    "author": "skeed",
    "date": "2023-04-05",
    "content": "Hey guys I had a quick question. I just realized I got sent an 808 with the tiniest bit of panning on it (they sent it stereo also) does anyone have any recommendations or experience of how they went about this? See pic for reference.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1109159638315847682",
    "author": "Eric Martin",
    "date": "2023-05-19",
    "content": "nice, that’s the next upgrade for me single unit I/O",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1113589381538787379",
    "author": "NoahNeedleman",
    "date": "2023-05-31",
    "content": "Thing about the Apollo is that it does so much more than console or dsp for plugs. It’s i/o, monitor controller, headphone output, and the unison tech for compressors & amp modeling on the way in is pretty great.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1118327327189905528",
    "author": "Adam Thein",
    "date": "2023-06-13",
    "content": "I’ve never done this before but I’d probably try and keep it foolproof simple unless there’s a savvy person in the band - FaceTime/zoom on a phone with the camera pointing at the band will do or even a video capture they can send you for comments.  Should be good enough to give arrangement and performance notes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1118327882771615835",
    "author": "Deleted User",
    "date": "2023-06-13",
    "content": "my concern is if it’s going to distort the fuck out of the iphone mic or if it would be good enough for me to actually hear the arrangement. \n\nprobably should just give it a try and see if I can hear everything. My experience doing rehearsals and recording them has been either the drums will distort the fuck out of the whole recording or I can’t hear the voice, etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1121944031233069156",
    "author": "mario dones",
    "date": "2023-06-23",
    "content": "I hear you 100%. I came up rapping in a crew full of producers. We used the same mix engineer for everything and nobody’s free or cheaper mix was getting in the way of that. I started the year thinking I’d focused on mixing, and putting in those reps. I never saw myself writing, or producing. Like with recording, I just picked it up along the way. But to do more mixing, it seems like I need to do more of everything. Because the people I can attract right now need a lot. I guess I need to double down on being cool with that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1124113635640361050",
    "author": "Rollmottle",
    "date": "2023-06-29",
    "content": "right...but it can do PoE. a Thunderbolt to Ethernet with PoE would potentially work. i'd reach out to Merging/Neumann and confirm that whatever one you find would work as expected (i haven't found one lol). if it's just power you're using the ethernet for, it should work, but i know the Anubis is finicky with ethernet adapters...but that's if you're networking it. also, you could get a tiny, cheap switch with POE but at that point, just plug in the MT48 power adapter.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124115629146902609",
    "author": "Rollmottle",
    "date": "2023-06-29",
    "content": "good question. i've PoE'd off a switch. haven't tried it off the computer. this is the recommended ethernet adapter if you're going to connect it through ethernet. i don't think it's PoE. https://www.bhphotovideo.com/c/product/1686536-REG/sonnet_avb_tb_thunderbolt_avb_ge_adapter.html/?ap=y&ap=y&smp=ba_f1_lar&smp=y&lsft=BI%3A514&gclid=Cj0KCQjw1_SkBhDwARIsANbGpFv3iUzJNrUbt7Jl8VKQz3TrRarvMEYdt4BY-qPweqFJkCYEyEdnSgwaAl1XEALw_wcB",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124115981225181265",
    "author": "Bryan DiMaio",
    "date": "2023-06-29",
    "content": "FWIW I’ve been using the apple TB2 to ethernet adaptor for my MOTU AVB interface haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124116631862386738",
    "author": "JakeTB",
    "date": "2023-06-29",
    "content": "I'd like to spend the $$ or just stick with something cheap I've already got. Got too many middling interfaces from over the years to justify anything that isn't a meaningful step up and portable",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1127671762390351962",
    "author": "JakeTB",
    "date": "2023-07-09",
    "content": "Guitarists: please forgive my naivety here, but there’s so much conflicting info online. How much of a guitar’s tone is in the pickups? Like, can I throw some Classic 57’s in a cheap semi-hollow and get a 335?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1130279376471203931",
    "author": "Bryan DiMaio",
    "date": "2023-07-16",
    "content": "Never done luxury vinyl plank before but thinking about replacing the carpet in my basement with it. Anyone have some good recommendations for brands that are durable and look nice?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1130365242241724457",
    "author": "Zack Hames",
    "date": "2023-07-16",
    "content": "Yes! I just did this.\n\nI used Pergo Defense plus. I recommend get as thick of planks as you can as they’ll feel the best and be the most forgiving in installing. I think ours were like 12–14mm. \n\nIts genuinely super easy and looks and feels awesome. Just find something you like the look of and go to town.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1131104826198085692",
    "author": "utilitron",
    "date": "2023-07-18",
    "content": "Any recommendations on ear training exercises or helpful resources online for mixers? I'm just getting started mixing in the studio and would like to make sure my ears are installed correctly. Working my way through \"Mixing with the Mind\" by Stavrou and I've been playing with some familiar references and visual EQ, just curious if y'all have any favourite resources I should be aware of.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1134511044845375569",
    "author": "Adam Thein",
    "date": "2023-07-28",
    "content": "Ah gotcha, yeah looks like the same memory locator as mine so you’ll have to rewind - I recommend setting up a timer so you don’t have to get the tape back onto the reel everytime - in other words don’t let it fully reach the end of the tape",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1139680115471691858",
    "author": "Jawn Delorean",
    "date": "2023-08-11",
    "content": "Hey i have some noob questions pertaining to room treatment. I've read a bunch over on gearspace in the forums, read a bunch of ethan winers stuff on his site, and will be occupying a room roughly 14x14x8. I got 16 manville 408 2x4 panels for absorption awhile back and my aim is to treat the room for mixing. I need a space to be able to accurately hear so that i can learn and train my ears. Someone on the unofficial reaper discord recommended you guys. I am gonna get a reference mic and set it all up with REW, adding/ removing /moving panels around and taking measurements and then comparing the results? I'm looking at safe  ' sound batting material for bass traps and clouds etc. This is all i've gathered and i won't be in the space for a few weeks so i thought I'd start to get my ducks in a row. Please any and all recommendations/resources/advice is appreciated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1143733298548441109",
    "author": "7footer.",
    "date": "2023-08-22",
    "content": "I’m using an Apollo rack mount.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1146823397779714212",
    "author": "livdejonghelvrs",
    "date": "2023-08-31",
    "content": "How much of a difference does having a stand alone converter make? I use an Apollo 8XP in conjunction with a Behringer ADA8200 for an additional 8 inputs when needed.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1163594713278988398",
    "author": "river",
    "date": "2023-10-16",
    "content": "Wow great suggestion, I forget about that feature",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1166022571423191130",
    "author": "river",
    "date": "2023-10-23",
    "content": "Would you recommend ordering two comes together, at the same time? Or could I buy one, and get one another time ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1166534555746967622",
    "author": "Rollmottle",
    "date": "2023-10-24",
    "content": "but highly recommend the RX Batch tool for mass SRC operations like these. very fast and you can make presets to have it do the same thing every time, append the right file naming, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1171881694106746910",
    "author": "LAPhill",
    "date": "2023-11-08",
    "content": "There was a time years ago that I got annoyed with their upgrade pricing, and had alternatives I liked better for most things anyway. But I'm an outlier, Waves is great. MAXX Bass is the main thing I still miss, honestly.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1172070997067845682",
    "author": "NoahNeedleman",
    "date": "2023-11-08",
    "content": "Ok I haven’t used it cause a) I assumed it was a high boost and b) I’m allergic to cheap sounding high end.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1178162007552307200",
    "author": "! Andy !",
    "date": "2023-11-25",
    "content": "Hi Ya'll! I'm just having osme routing issues with the evo 8 sending/returning through a mic pre. I'm not super familiar with the evo, so anyone w/ experience with it i'd appreciate the input. Here's my setup. I'm sending from output 3 on the evo 8, via a xlr cable (w/ trs adaptor attached at the audient output side), into the input of a WA273.\n\nI am then coming out of the 273 into input 4 of the Evo 8. Using abletons external audio effect device & always am getting signal on output 3, but never any back on input 4. I know that the units are communicating, as if I crank all the input gain up on evo 8, & output on 273, it affects the white noise being sent through both.\n\nI've tried all different cables etc to make sure it's working, but it's always the same each time. Any thoughts? It could also be a evo 8 mixer thing which i'm inspecting now, still haven't gotten used to the software.\n\nApologies if the message is a little convoluted, my brain is being melted by this. Appreciate all input! 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1178166571521277982",
    "author": "Adam Thein",
    "date": "2023-11-25",
    "content": "I’d take a look at the interface software - are the outputs to 3+4 turned up in the audient software?  Are you getting visual feedback of signal hitting those channels outside Ableton?\n\nI’d remove as many variables as possible and test each part of the chain individually.  Try connecting the output of the Evo 8 ch 3 back into the Evo 8 input 4 without the 273 first and make sure it isn’t a software issue, then check the analog connections one at a time if that works.  My guess is a software thing with the Audient mixer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1179380475681329204",
    "author": "owengineered",
    "date": "2023-11-29",
    "content": "Hey everyone,\n\nThe mixing engineer that I assist is looking to completely revamp his setup.\n\nHe currently works on a pair of Focals with an Apollo twin and wants to switch to a pair of 6-2s with a Lynx Aurora and a Grace M905.\n\nHowever we can’t really wrap our head around the best signal flow to get to the speakers. Is the recommended route to go to the Aurora from Pro tools, then over ADAT from the Lynx to the grace (assuming you need to have an ADAT card in the Lynx and the digital Grace) and then from the Grace over AES to the PMCs ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1179392765541486592",
    "author": "owengineered",
    "date": "2023-11-29",
    "content": "And taking into account that the AES (or ADAT) card for the Lynx is an extra 900£, and the digital Grace M905 is 1000£ more than the analog version, would you consider that 1900£ being worth it to go digital to the PMCs ? I know it’s a bit of a weird question but just looking to get some opinions/info to help my boss out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1179400779438751774",
    "author": "Ross Fortune",
    "date": "2023-11-29",
    "content": "Depending on which Apollo they use, that could function as the controller for the alt monitors (assuming they'd be something like NS10s / Auratones, where fidelity is less crucial).\n\nMy current setup is Apollo 8p which functions as controller for NS10s and a little radio, then the RME + ARC setup controlling the PMC 6.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1179401234654961674",
    "author": "owengineered",
    "date": "2023-11-29",
    "content": "Ok that’s really interesting ! So do you go optical from your Apollo to the RME ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1179401613589368904",
    "author": "Ross Fortune",
    "date": "2023-11-29",
    "content": "Exactly. \n\nApollo ADAT out > RME Fireface 400 ADAT in > RME SPDIF out > AES converter cable > PMC 6",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1179484493019631707",
    "author": "jonmatteson",
    "date": "2023-11-29",
    "content": "you could also go spdif out of the apollo if you wanted. that’s what i’m doing and it’s been working great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1179489185938296882",
    "author": "Ross Fortune",
    "date": "2023-11-29",
    "content": "Yes, I dimly remember digging through that spec at the time.\n\nI use the Toslink for 8 ADAT IO from the RME, and even though there are 2x in and out on the Apollo, the second pair can only mirror the first in my use case 🤦🏻‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1179828725450289183",
    "author": "john",
    "date": "2023-11-30",
    "content": "Does Ayo Juan uses the Apollo x8 in his studio desk?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1179849236024664145",
    "author": "Rob Domos",
    "date": "2023-11-30",
    "content": "Speaking as someone who does have an Apollo in my studio desk (half of my friends do too), David is right and it doesn’t matter much at all what he uses. What does matter is what priorities would lead to that purchase decision and if you have those same priorities. What works best for one engineer here is not what works best for the next. But pretty much everything works well enough these days.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1179968354337947832",
    "author": "Slow Hand",
    "date": "2023-11-30",
    "content": "I haven’t checked yet, but if the Apollo also has a key command to dim the output level I’m gonna be so stoked.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1181080737739456565",
    "author": "john",
    "date": "2023-12-03",
    "content": "Does Ayo Juan uses the Apollo X8 in his studio desk?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1182458692319313981",
    "author": "Maxim",
    "date": "2023-12-07",
    "content": "Hey peeps, what's the safest way to send files? As in, I'd like to not be responsible for something getting leaked. I had something for this years ago but forget the name. Is Samply good enough? I'm thinking 2FA + options to control playback/downloads.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1182461928883376238",
    "author": "Maxim",
    "date": "2023-12-07",
    "content": "I'll upgrade to pro and call it a day",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1184031869466066964",
    "author": "Deleted User",
    "date": "2023-12-11",
    "content": "There’s a lot you can do with just panning and arrangement. I’d recommend starting there and then reaching for imaging tools when it calls for it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1196852385037955183",
    "author": "rse",
    "date": "2024-01-16",
    "content": "does anybody have any recommendations for tutorials/reading material on club systems? Very interested in learning more about basically the whole signal flow from cdjs to the speakers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1197622655327682560",
    "author": "spectrummasters",
    "date": "2024-01-18",
    "content": "@Slow Hand I love those suggestions and have screenshotted  . Thanks for taking the time to write those ideas out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1200183717289795705",
    "author": "Nomograph Mastering",
    "date": "2024-01-25",
    "content": "It’s cheap, and worth having on hand",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1200188478395269181",
    "author": "Nomograph Mastering",
    "date": "2024-01-25",
    "content": "Let me say that I’m not recommending modeling that EQ because I think it’s great, I don’t. Just noting that because you mentioned it it is easier to model than most",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1209977422896824400",
    "author": "NoahNeedleman",
    "date": "2024-02-21",
    "content": "By the time he got in for vocals monday morning, the track was in good enough shape that he was amazed, crushed a whole vocal package in a couple hours, and left me to do my thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1217663895632871426",
    "author": "peterlabberton",
    "date": "2024-03-13",
    "content": "I found lots of spaces in LA when I was looking (2020/2021) in the $3k-$3.5k/m range that were decent to pretty nice. Ended up in a cheaper spot since my studio partner and I found a crazy deal on a place that worked for us, but that was seemingly very much the exception not the rule. Not sure how prices have changed in the last few years.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219324316399698063",
    "author": "Adam Thein",
    "date": "2024-03-18",
    "content": "I'd get in touch with a music lawyer who can help you make sure you have everything in place to collect all your back end - there's a lot of revenue sources you'll want to make sure you are collecting from.\n\nOften you'll have had a producer agreement in place and a letter of direction that will be sent to the distributor/label so that if you have points on the master you'll be paid directly from them.\n\nYou'll also need to have a PRO/Publisher in place to collect songwriting royalties, and many folks have in place a publisher deal or publisher admin deal to collect those royalties on your behalf in exhange for a % of your royalty.  In my case I am set up with BMI in the US as my PRO and Publisher and have an admin pub deal with Sentric to collect in territories outside the US.\n\nAlso you'll want to be set up with SoundExchange to collect digital performance royalties (SiriusXM, iHeart, Pandora).  This often also involves the letter of direction that is kicked off with your producer agreement.\n\nI'm probably forgetting something but I'd highly recommend talking with a music lawyer to get things set up and working for you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1222725093143351326",
    "author": "BoozleBAM",
    "date": "2024-03-27",
    "content": "@NoahNeedleman I also have a 6i6 which has spdif and that unit sounds great. The only thing is that it has to be connected via USB and so does my tascam, so what happens is that my computer will randomly go haywire and I'll have to go into focusrite control and reset the settings all the time. I think it's the brains of both interfaces fighting for control or something.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222741392456155237",
    "author": "NoahNeedleman",
    "date": "2024-03-27",
    "content": "Ok so it’s happening somewhere other than the DAW. Hearing that while recording has to be disconcerting. An external phantom supply solved some issues for me. Buy the absolute cheapest one you can find on Amazon and if it solved your issue, use it till it breaks and then buy the most expensive one you can afford.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1233246714027180043",
    "author": "peterlabberton",
    "date": "2024-04-25",
    "content": "Balancing rocking the boat vs. not is tricky, but also worth going to bat for something if it’s worth it. My first visible credit came after chasing it down, with the artists manager and verification from an insider on the team/record (shoutout @cian riordan!), and that credit has directly led to doors being opened for me in other situations. But if you’ve gotta hassle an artist directly, it a) might not work and b) might backfire.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235641019651854397",
    "author": "BoozleBAM",
    "date": "2024-05-02",
    "content": "I hate it as well. Suggestion for other service?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235669689074712617",
    "author": "noahc",
    "date": "2024-05-02",
    "content": "Would anyone recommend a first timers hardware synth to experiment with my fx pedals? Korg series?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235705389304119397",
    "author": "Zack Hames",
    "date": "2024-05-02",
    "content": "Prophet 6 is like the be all end all for hardware synths. If I could recommend anyone that’s serious about synths or production In General and can afford it, this is the move. \n\nOtherwise, I’d go quality over quantity. Get a knobby analog synth that’s easy to make sounds quickly. You’ll have more fun if you’re used to more tactile instruments.\n\nHaving a digital synth with a bunch of menus that’s “more powerful” (3+ oscillators, several LFO’s, tons of polyphony) isn’t any fun when you can’t change the sounds quickly,easily, or intuitively. \n\nKorg MS20 was the first synth I fell in love with. Felt like playing guitar or something. Like an actual instrument.\n\nProphet 6 and OB-6 are incredible. If I had to pick one for myself it would be the OB-6. But the prophet is super versatile and usable in any style more so than the OB6.\n\nI’d take an analog mono synth with knob per function over a powerful digital synth with menus",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235705576642838590",
    "author": "Zack Hames",
    "date": "2024-05-02",
    "content": "The Korg logue is the shit though for bang for your buck. Knobby, affordable, analog.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235750985905995858",
    "author": "Deleted User",
    "date": "2024-05-02",
    "content": "I’d recommend people to get started with VCV rack though- putting together modular rig is expensive and not as cost worthy as spending that to get a good mono synth. \n\nIt could also be not as musically useful for a lot of people’s niches",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1252667813622054943",
    "author": "bobby k",
    "date": "2024-06-18",
    "content": "Let me preface by saying nothing tangible has got me feeling down or discouraged. In fact I think I'm in the best season of my life so far and it feels like everything is going right (aside: aren't you more likely to self sabotage when things are good than when they are bad?) to zoom out a little bit, i already know the answer. I'm doing too much at once, spreading myself thin beyond enjoyment. in the grit of a transition and it's clear where I'm going but I have no frame of reference for the timeline. A few years ago, I was mid-20s, in a band on a major, had roommates & cheap rent, and a chess app addiction. i was still a \"professional\" but things were extremely simple. in short, left the band, spent a few years mixing much more than producing, and now am swinging back that way. I'm about to turn 30, I have a mortgage, a (semi) dependent, my first real studio, an intern to set an example for, 5ish mixing clients at any moment, producing for 3 artists and co-prod/consulting on 2 other projects, playing occasionally in any of 4 different bands, and producing/recording some live performances (as well as starting a YT channel in this lane). In my experience at least, it really seems like something shifted at the top of this year, and I hate to say it but part of the fault is TikTok (is the rest of the fault mine?). Everything is urgent to everyone and nothing informs each other or oscillates together. It feels like a clock is constantly going \"tick, tock, tick, tock\" and the anxiety I once had over money is shifted completely towards my time management. Every time I look away from my phone I have 30 new texts. I think I'm crushing it in my professional demands but I don't know that I'm being the person I want to be for my friends, family and partner. I don't know that I'm setting a good example to this intern. I don't know that I'm there to take care of myself all the way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1254805320002306139",
    "author": "h3x",
    "date": "2024-06-24",
    "content": "Anyone wanna share some tips on how u guys would go about mixing completely raw vocal recordings (no outboard pre or compression) straight into an apollo? Ive done this tons of times but would love to hear everyones workflows for this!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1256274748388671690",
    "author": "Matt Huber",
    "date": "2024-06-28",
    "content": "Hahah never something I would *recommend* but when you’re dealing with only the  tracks that were given to you…ya gotta do what ya gotta do",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1256672469419298817",
    "author": "BoozleBAM",
    "date": "2024-06-29",
    "content": "Right. How many channels are you wanting to run? What are some of your options? I was super horny for the motu 16a for a minute there, but then I started reading up on very practical issues people were having with it. I'd like to able to do at least 16 channels...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1260640093262053477",
    "author": "BoozleBAM",
    "date": "2024-07-10",
    "content": "I need suggestions for work desks, mouse things, vertical mouses, track balls, mixing/ editing setup, what-have-you. Right now, I'm just doing things on a little laptop and using exclusively the little touchpad thing and pinching it for edits and I don't know that it's sustainable. All hunched over on a little dresser thing. Combined with my chef job during the day, well... the carpal tunnel is starting to become a thing now. Please chime in with ergonomic sustainable suggestions for audio computer work. Thanks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1262079881005760512",
    "author": "Dereck Blackburn",
    "date": "2024-07-14",
    "content": "Figured this dort of question fits better here than anywhere else - I havent had a MacBook Production laptop in years but recently just loaded one up with Ableton Live and some of the basics I use in the studio to write music. Question is - do any of you use a interface while traveling (Focusrite/Babyface/Arrow) and is it really neccesary?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1262441440001392702",
    "author": "Josh",
    "date": "2024-07-15",
    "content": "Grace is sick and apparently the audient nero is actually really good.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1262443171887976581",
    "author": "BoozleBAM",
    "date": "2024-07-15",
    "content": "i'm now monitoring through a 6i6, which enables me to use two sets of speakers, but I have to go into focusrite control in order to \"toggle\" back and forth. It has two independant headphone jacks, though, so that's nice... I'd like to avoid going into the focusrite control - saw that the presonus one can do three sets of speakers and 4 headphones... Pretty nifty - $150 approx for a  V1.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1262739479630708818",
    "author": "BoozleBAM",
    "date": "2024-07-16",
    "content": "Wouldn't that be a treat? - To spend over 3k on a monitor controller only to find i'ts juust sliiiightly better than a presonus? lol - I'm sure it's going to be fantastic!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1262829589558988803",
    "author": "BoozleBAM",
    "date": "2024-07-16",
    "content": "I was trying to get fancy with setting up different monitors for reference purposes and started looking at monitor controllers, but I've decided to just keep monitoring through my 6i6, which I can run two sets of monitors and two heaphones through already, so it's already pretty sweet... I'm going to return the $50 used Presonus Control Station I bought from guitar center yesterday. Shhh - Don't tell Cian...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1262850006583349351",
    "author": "Zack Hames",
    "date": "2024-07-16",
    "content": "Audient Nero is the best for affordable analog. It’s reasonable and usable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1262850150653497541",
    "author": "Zack Hames",
    "date": "2024-07-16",
    "content": "I wouldn’t say it sounds better than like the focusrite outputs. But they aren’t a downgrade",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263613250830864436",
    "author": "Josh",
    "date": "2024-07-18",
    "content": "Was going to recommend checking this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263717051730497627",
    "author": "BoozleBAM",
    "date": "2024-07-18",
    "content": "I would honestly still be using Audacity if it weren't for the huge drawback of it not being able to track more than 2 channels at once (and, Audacity imparts some type of compression onto all of it's incoming signals, I heard, which is also not cool...). Unbelieveable drawback... When it was time to upgrade to a DAW for multi-tracking a few years ago, I got online and all the nerds were saying that Reaper was the DAW G.O.D., so I went with Reaper. Have regretted it ever since. lol. I basically use it as a tape machine. I am very, very bad with Reaper. The End.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263737179230965822",
    "author": "Nomograph Mastering",
    "date": "2024-07-18",
    "content": "Reaper is great, no shade. But we’re recommending PT for a reason",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263835360031408181",
    "author": "gatewoodsensei",
    "date": "2024-07-19",
    "content": "I wouldn’t say it’s the “industry standard”. It’s just the best way to record things. D4vd used what he had (at the time) until he could buy the stuff he needed. Look at the credits for his latest project. He isn’t the recording engineer. He went to a studio. Don’t fall into the trap of “whatever works for you is best”. That’s not good advice as the end all be all with no caveat. That’s like saying “You should fly to ny from La instead of walking there, but whatever works for you” - no spend the money and fly lol. If you have to use your phone, use it with it in mind that “I’m going to upgrade later”. Hope that makes sense.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1264419323838206025",
    "author": "BoozleBAM",
    "date": "2024-07-20",
    "content": "Very newbie question here: I've just finished tracking drums for my first album. I played along to guide tracks of bass, vox, guitar and click, of course. The intention was for these tracks to be replaced after the drums were laid. Should I: 1. Slip edit the drums now and then stack the new bass, guits and vox ontop of what is essentially the final drum edit, or 2. Play the final bass, guits and vox now and then slip edit everything kind of at the same time/ stage? - Or is there another process ya'll recommend?? Thnx.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1264420469474590741",
    "author": "BoozleBAM",
    "date": "2024-07-20",
    "content": "Any suggestions on how to \"key in\" to this?? I played everything pretty well, and I can't really see myself doing too much editing, to be honest - But I've been watching youtube vids the past few days and I'm seeing people do everything from basically nudging a kick here and there, to all out identifying the transients of every little hit and super going bananas...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1265417405203742740",
    "author": "Adam Thein",
    "date": "2024-07-23",
    "content": "A parent of a friend is looking for instrumental music to license (or creative commons) for a video they are making for their family genealogy.\n\nDoes anyone have recommendations to music licensers/libraries that would be good for this with a variety of styles to browse through?\n\nBonus points for an easy to use website.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1271039789059149856",
    "author": "Iwan Morgan",
    "date": "2024-08-08",
    "content": "Do you have access to Linkedin Learning? There’s a load of Pro Tools vids on there and some of the Larry Crane videos are good.\n\nBut…what Cian said is correct, best way to learn is to record people for free/cheap. It will force you to come up with solutions in real time and it’s where the main learning moments are.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1272969236414861462",
    "author": "EliHeathMusic",
    "date": "2024-08-13",
    "content": "I got standard clip recently and have been reading up on the manual and some of the discord conversations but am still figuring out how to apply that information intuitively into my own workflow (or at least having the confidence to feel like I really know what I'm doing with it). I'd love to hear, on a very basic level, how you all approach using the plugin and if there are any starting points that you would recommend. Also curious how this might change in different use cases (i.e. mastering, mix bus, drum bus). Are you simply sliding down the \"clip\" fader until you reduce the peaks a little and then making up gain with another plugin? Are you touching the other 3 faders at all? Do you find yourself frequently auditioning and changing modes and oversampling amounts or sticking to consistent setting. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1278511705164615722",
    "author": "Bryan DiMaio",
    "date": "2024-08-28",
    "content": "You won’t easily be able to use it on windows though but it’s worth it to use a file system meant for SSDs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1279450856709816321",
    "author": "bobby k",
    "date": "2024-08-31",
    "content": "A very good friend is asking for a preamp/channel strip recommendation that is an entry level option and sounds great. I think budget is like $1k, would love to have EQ and compression in it. I’ve suggested the LA610 from UA as well as JoeMeek VC1Q. Anything else you guys are fond of in that lane? I suppose 500 series could be a consideration too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1279499262635413575",
    "author": "youngteam",
    "date": "2024-08-31",
    "content": "oh to add one idea to the pile, a focusrite isa 220 if you can find a used one has pre, eq, comp and de-essing. https://losangeles.craigslist.org/wst/msg/d/alhambra-focusrite-isa-220/7769077927.html",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1280542158264340530",
    "author": "BoozleBAM",
    "date": "2024-09-03",
    "content": "What's your setup now? Curious. I've been thinking of going the DB25 route recently - when i upgrade...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282405300992999487",
    "author": "Adam Thein",
    "date": "2024-09-08",
    "content": "If I remember right you are on an older mac?  If you want to squeak out some extra life if you haven’t upgraded the internal drive to an ssd yet that could be a worthwhile upgrade",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1284180350607818753",
    "author": "centonomic",
    "date": "2024-09-13",
    "content": "thanks for the help. Looking to learn because pro and consumer/balanced and unbalanced  levels have confused me for years but Basically I want to feel confident in understanding plugging my Motu Ultralight mk5 into various things. I know it’s a big topic. I want to connect numbers on spec sheets with hands on measurements. every time i try to read up and make sure i’m not clipping a hifi amp with a “pro” interface for example, i come away more confused",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1284181136872046735",
    "author": "centonomic",
    "date": "2024-09-13",
    "content": "this section in the Motu UL manual keeps haunting me. I look at it and wonder “ok? how much do i trim or boost to hit one of these standards”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1284241641586163864",
    "author": "Nomograph Mastering",
    "date": "2024-09-13",
    "content": "Good tools make a huge difference and the situations where cheaper meters break down can be really confounding (and usually when you are already under pressure trying to solve a problem)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1290753189884203091",
    "author": "BoozleBAM",
    "date": "2024-10-01",
    "content": "Maybe I should buy a couple macs. What's the cheapest I could get way with? All I need them for is recording.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1293053144418357298",
    "author": "vostral",
    "date": "2024-10-07",
    "content": "Hello everyone!  I have this question: I'm a producer from Vietnam. Currently I'm using Focusrite 2i2 and a pair of Focal Evo 65 to mix and master my own songs. Even though i've learnt and practiced a lot of mixing stuff but my mixes sound still amateur. I'm thinking of upgrading to UAD Apollo for better converters as i've learnt that DA converter does affect what i can hear out of my speakers. Could you guys kindly give me more insight into this issue? Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1293058533096685649",
    "author": "vostral",
    "date": "2024-10-07",
    "content": "Thanks for your sharing! I'll consider investing my acoustic treatment before upgrading my audio interface. One more question if you don't mind: I'm using DT770 to mix, and i know that headphone isn't dependent on the treatment of the room. So if my mix still sound not right, that could only be attributed to my mixing skill right??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1295620760962076673",
    "author": "tinkerjef",
    "date": "2024-10-14",
    "content": "Currently developing an audio interface with a buddy of mine",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1299425187145584672",
    "author": "hendrick",
    "date": "2024-10-25",
    "content": "do yall have any suggestions on how to talk to an artist when you want them to write a better verse? without destroying egos haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1312405894138433608",
    "author": "Ross Fortune",
    "date": "2024-11-30",
    "content": "Hey Teyah. What’s the source? \nWhat are you trying to remove and why? \n\nSome more details will make it easier to give useful suggestions  here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1313238088939470941",
    "author": "BoozleBAM",
    "date": "2024-12-02",
    "content": "Okay, I'll look around - Any standard, free downloads you recommend that I could experiment with?? If I remember correctly, the Rough Rider one has all adjustable perameters...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1323497009579298836",
    "author": "onanisland",
    "date": "2024-12-30",
    "content": "But if someones into setting up their own vpn..., was recommended by one member of the lopht who testified before congress in the 90s, legendary group of good people",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1324191978363158559",
    "author": "SawyerM",
    "date": "2025-01-01",
    "content": "Hey I am going through the live stream backlog and I am finding it very valuable... That is not something I can say about a lot of resources available. Ever since I started watching the video series my YouTube recommendations are full of garbage tutorials. I was wondering if people could share resources they know are accurate and valuable. So far I have found Dan Worral, Electrical Audio, Yamaha's book and this. Any other recommendations would be appreciated!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1331783094503477318",
    "author": "BoozleBAM",
    "date": "2025-01-22",
    "content": "@Bryan DiMaio I'm hearing these USB cables that come with the Samsung drives are not of the greatest quality. SUggestions for updgrade? - USB cables?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1334535640989175921",
    "author": "Edward Rivera",
    "date": "2025-01-30",
    "content": "What interface boozy ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1334535833302204436",
    "author": "BoozleBAM",
    "date": "2025-01-30",
    "content": "I've got three total - Tascam US 2000 (which I probably would not be using for this), Roland Quad Capture and Focusrite 6i6.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1334536054346092605",
    "author": "Edward Rivera",
    "date": "2025-01-30",
    "content": "The focusrite has instrument ins on the front",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1334536145148842034",
    "author": "BoozleBAM",
    "date": "2025-01-30",
    "content": "Preamps in my posession are all various M Audio things or Golden Age Pre 73, Art Pro MPA... maybe another cheapie somewhere.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1340521744682844190",
    "author": "BoozleBAM",
    "date": "2025-02-15",
    "content": "May I ask: Why do these headphones sound so sensationally, phenomenally better than my cheap-mid grade Sennheiser and ATH closed backs?? Like, what are the actual mechanics going on?? Everything just sounds... excellent. I feel like I can hear freqs I've never heard before, and there is a clarity that's just so charming. I'm not the hugest fan of them for mixing, but they sound just fantastic. Wondering if I might want to hang onto them just for that reason alone.",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1340636078096388159",
    "author": "cian riordan",
    "date": "2025-02-16",
    "content": "Well you've likely made a quality jump from your cheap sennies and ATHs. You say you don't like them for mixing -- how much time have you spent working on them? Usually it takes a while to acclimate to a listening device/environment so you can get good results mixing on them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1340825884998893670",
    "author": "Josh",
    "date": "2025-02-16",
    "content": "Hey sorry just briefly scrolling through. It took me months to get used to my NDH 30s and I trust them more than anything. I still don’t like doing any entire mix on them because headphones are strange, but having something I trust completely that fits in a backpack is worth its weight in gold IMO. Planning on getting the 20s to make vocal tracking easier",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1345480069115543622",
    "author": "Brian Reynolds",
    "date": "2025-03-01",
    "content": "Typed that up for server suggestions this morning but never hit send",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1347424187341344819",
    "author": "BoozleBAM",
    "date": "2025-03-06",
    "content": "I wanna say real quick too, @Zack Hames , that I did a little test recording through my focusrite 6i6 (discontinued) and it sounds surprisingly good to me. Never recorded with this thing before!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1347615648892588052",
    "author": "BoozleBAM",
    "date": "2025-03-07",
    "content": "It was certainly an undertaking, but having the label of \"actual collector\" now made it all worth it for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1347616135465533513",
    "author": "Zeuswayn3",
    "date": "2025-03-07",
    "content": "I’m all about gear trust me- but I would bet that your money could be diversified better than in 9 4038s. I only got mine because the drummer of ghost sold it to me for cheap",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1353878989361643560",
    "author": "itaylerner",
    "date": "2025-03-24",
    "content": "I’m full of questions today - forgive me, having a humbling day. Apollo (twin) users - do you have hissing from your preamps? Wrote to UA but haven’t heard back yet, I’ve troubleshot it a lot and there’s a lot of hiss coming through both inputs. This is the input pretty cranked, doesn’t feel normal to me and not sure if it’s fixable?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1353881439539564604",
    "author": "itaylerner",
    "date": "2025-03-24",
    "content": "That is seriosuly reassuring. \n\nYep, all disabled that, did a hardware reset on the apollo as well. The noise comes through on both preamps - I've even tried different mics, cables, outboard pres, wall outlets... it's always there,",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1353881491083366420",
    "author": "itaylerner",
    "date": "2025-03-24",
    "content": "If a signal is passing through the apollo input, it's getting that ^",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1354230156754944211",
    "author": "itaylerner",
    "date": "2025-03-25",
    "content": "Doing some writing/recording but will record some when I get a chance! Reading through old convos I was reminded how important it is to go line in from preamp into the Apollo so I switched and that definitely helped",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1363262305135235132",
    "author": "jonmatteson",
    "date": "2025-04-19",
    "content": "Anyone have a good lawyer recommendation they could send my way? The guy I’ve been using is great but very expensive and I’d like to work with someone who works off of a percentage instead of a flat fee.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1371624110345687080",
    "author": "Slow Hand",
    "date": "2025-05-12",
    "content": "Many DAWs have some sort of tuner plugin, which you can use on your recorded tracks like a tuner pedal to verify the pitch. If your particular DAW does not have this I'd do a quick search for a free tuner plugin. Maybe someone here can recommend one they like to use.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1376294193424761003",
    "author": "BoozleBAM",
    "date": "2025-05-25",
    "content": "The valve kings were just too cheap, and I was thinking of them for touring heads - not a bad sounds out of those things, honestly.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1376673119548477571",
    "author": "BoozleBAM",
    "date": "2025-05-26",
    "content": "Any suggestions of similarly wacky stuff that would be more responsive??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1377839859561136260",
    "author": "BoozleBAM",
    "date": "2025-05-29",
    "content": "Appreciate you, Tim! Thanks for the suggestion!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1385101898914463815",
    "author": "BoxerLodge",
    "date": "2025-06-18",
    "content": "Speaker cable is cheap. I'd say give it a try. Record something close and then record the same thing through the speaker cable. If it sounds the same, then great. If not, invest in the little labs box",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1387874021634215998",
    "author": "M J",
    "date": "2025-06-26",
    "content": "Hi All! I’m building out my first studio and would like feedback on monitoring position(Also lmk if this should be in the my-setup thread instead). For context, I’ll primarily be tracking drums (I guess that was obvious lol) and I’ll be mixing/producing. I’m contemplating 2 options right now:\n\n1. leave desk where it is and just set up monitors on desk, however I’m worried about reflections/modes and that corner having a weird affect on what I hear. \n\n2. I remove the bookshelf, scoot the drums back to the wall, and place the desk against the wall parallel to  the drums. \n\nLastly, I’ve gotten a quote from GiK on panels, but I’m also talking to LA Sound Panels right now for a quote. If you guys have any acoustic recommendations feel free to share, thanks so much!",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1394846071364259891",
    "author": "itaylerner",
    "date": "2025-07-15",
    "content": "I/O Setup question... There's a Scarlett Claret+ interface that's connected to a computer via USB-C, it has 8 analog ins, 8 analog outs, and ADAT. There's also a Scarlett Octo Pre, same I/O. \n\nCan I get 16 analog inputs and 16 analog outputs by connecting ADAT Out from unit 1 to ADAT In on unit 2 + ADAT Out from unit 2 to ADAT in on unit 1? Also please let me know if I am just thinking about this all wrong.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1397996421310976193",
    "author": "BoozleBAM",
    "date": "2025-07-24",
    "content": "Very kind of you, Ryan. I've alreadyy tracked drums and bass and am now working on guitars. Took me a few days to fix some type of monitoring issue i was having with focusrite control. I'm still fucking with it, actually - You know i hired a mixer, too, right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1397997977649418332",
    "author": "Edward Rivera",
    "date": "2025-07-24",
    "content": "Good enough for ‘tallica !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1400521647643037807",
    "author": "bobby k",
    "date": "2025-07-31",
    "content": "Who here has built their own preamps from scratch? and between exploration/having fun, saving money, and the long term quality of your end result, would you recommend it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1400525429529641091",
    "author": "Edward Rivera",
    "date": "2025-07-31",
    "content": "I’ve built dozens of CAPIs if that counts as “scratch” if you have the time and patience, definitely worth it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1404211866921730239",
    "author": "M J",
    "date": "2025-08-10",
    "content": "Ok maybe I’ll go cheaper on monitors to afford more mics/possibly outboard pre’s and what not",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1404300309198667888",
    "author": "Jake Gillespie",
    "date": "2025-08-10",
    "content": "Agreed.. a great compressor wont fix a cheap mic pack. glad @M J is putting money in mics. and treatment; That will get you good tones so quick (so long as you're good at drums and tuning them which i know @M J is).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1409941952870486033",
    "author": "M J",
    "date": "2025-08-26",
    "content": "Trying the Demo for EQuilibrium, but I'm having trouble finding the knobs. Any layout suggestions to make them appear or am I just simply in the wrong place? :kekcry:",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1413588437583265932",
    "author": "baccwardshead",
    "date": "2025-09-05",
    "content": "Hey guys! Heard a lot about this community. Sorry for the ChatGPT post but English is not my native language. Tried searching a lot about this by looking at \"headphone rec\" and \"hrtf\" but I'm getting even more confused, just craving a stable monitoring system for me. Hope this is not too newbie of a question.\n\nI’m an intermediate mix engineer — normally mix on Yamaha HS8s but I’ve been travelling a lot lately, and I’m craving a stable monitoring solution I can rely on while on the road. I actually love how the ATH-M50x sound, but they’re not giving me the translation I need for mixing. I tried Beyer DT-990 and disliked the sound. Thinking about getting Sennheiser HD650 — should I pair it with a headphone amp even though I already have an Apollo Twin? HD650 + amp might be pricey, or would AirPods Max 2 be a reasonable travel/monitoring/critical mixing alternative? Clients send notes that confuse me with the M50x (rare on the HS8s) — it’s only ~10% of the time but I want that gone. Any recommendations?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1413615864254828645",
    "author": "baccwardshead",
    "date": "2025-09-05",
    "content": "I'm leaning in the AirPod direction also, just not too sure because I'm looking for something I can finish mixes on. I guess that will be coming from repeated usage and experience? AirPods sound better than the Senheiser HD 650/660, you think? I've gotten really used to M50x will the upgrade be weird to my ears haha?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1439393211302023361",
    "author": "Rollmottle",
    "date": "2025-11-15",
    "content": "very slick and cheap for what it is",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1439395672355770460",
    "author": "Bryan DiMaio",
    "date": "2025-11-15",
    "content": "I don’t have personal experience with this specific unit but in general yeah, I keep mine in a closet lol. Many HDDs all spinning away have a certain amount of noise, but the utility is worthwhile. Since all you really need to have connected to it is an Ethernet cable though, it can be anywhere else in the building and the cabling is cheap",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1450250481845666005",
    "author": "AJ",
    "date": "2025-12-15",
    "content": "Just as an update: I tried YouTube Music for a bit, and didn't like my experience on it. Going to be switching to YouTube Premium Lite to get the ad free videos. As for music, this is my first day on Tidal and... I wish I switched sooner. Y'all weren't kidding about the audio quality difference! Not to mention the ethical considerations, and the ability to send a music link that opens to any streaming platform. Appreciate the suggestion!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1450872522944938025",
    "author": "DarrenB",
    "date": "2025-12-17",
    "content": "I'm a big Tidal fan.  It's been my main choice since introduciton (2014-5 maybe?).  Their suggestion algo is getting better but still not Spotify good.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1452423136388710410",
    "author": "BoozleBAM",
    "date": "2025-12-21",
    "content": "Yeah, really strange. Either hard drive on the fritz or the mismatching hard drive letters confused something. I'm gonna start backing up the session on the downstairs computer before I move the hard drive next time. Should be a good enough band aid solution for now, right? I think that downstairs computer is a little funky somehow.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1460628031545807043",
    "author": "bobby k",
    "date": "2026-01-13",
    "content": "but in that case wouldn’t the other mics coming in ADAT be out of time too? It’s only about 4-5 samples but maybe seems to fluctuate. I’m running a cheap Audient as 9-16 and a nice Audient as 1-8/brain.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1463668993276776604",
    "author": "bobby k",
    "date": "2026-01-21",
    "content": "Anybody got recommendations on Eucon stuff for Pro Tools? Is the SSL one any good?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1469162518462070916",
    "author": "nick",
    "date": "2026-02-05",
    "content": "Can anyone recommend me a 500 series chain for pop vocals? I know rack units are where it’s at I just am totally mobile at the moment.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1471335592385319167",
    "author": "M J",
    "date": "2026-02-11",
    "content": "yeah but the mechanical feeling is what makes it worth it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1471335876675244107",
    "author": "M J",
    "date": "2026-02-11",
    "content": "the PM in question:\nhttps://reverb.com/item/92523669-yamaha-pm-1000-16-channel-fully-upgraded-excellent",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1471625655467643053",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "I've got to run some audio snake cables through walls for panels and such; does anyone have brand suggestions for best bang for your buck? easiest to work with, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472993674504831178",
    "author": "spectrummasters",
    "date": "2026-02-16",
    "content": "I’d recommend using it just for the comp (which iirc is a parallel cl76) and maybe a little tiny bit of verb",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472995979472011335",
    "author": "spectrummasters",
    "date": "2026-02-16",
    "content": "Id defo recommend not using it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  }
]