[
  {
    "id": "1033511571135139870",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "__**TLDR 2 - the return**__ - The final word. If I was asked “What sample rate should people make records at in 2022?” And was forced to choose then the answer would be 48k. Why?\n\n- Film and TV prefer it\n- Labels prefer it\n- *(I hate Atmos)* Atmos is at 48k *(I hate Atmos)*\n- There are small but meaningful technical and sonic advantages\n- It doesn’t place demands on CPU or drive space",
    "reactions": 59,
    "categories": [
      "file_management"
    ],
    "is_expert": true
  },
  {
    "id": "1188924913738842213",
    "author": "cian riordan",
    "date": "2023-12-25",
    "content": "Newbie is crushing out the gate",
    "reactions": 35,
    "categories": [
      "getting_started"
    ],
    "is_expert": true
  },
  {
    "id": "1194391682800681021",
    "author": "cian riordan",
    "date": "2024-01-09",
    "content": "1) a strong work ethic: You have to be willing to put in the time and energy into the project. You will always be the first person there and the last to leave. Once you accept this and work it into your life, it just becomes the way it is!\n\n2) a good personality: You need to be good around people. Half of this job is psychological. You have to know when to speak up as well as when to not say anything. Talkback etiquette is crucial. Learn to read people. Never get angry or passive aggressive. You always need to be voice of reason. People have to trust you.\n\n3) a solid skill-set: You have to always know what your doing and be confident in your abilities. Know the technical side of things. You should also be musically inclined. Be curious! Why does a song sound a certain way? How did they do it? If you don't care and don't want to know – you should do something else.\n\n4) actual follow through: You'd be surprised how many flaky people work in this business. If you're a guy that does things when you say you'll do them and answers phonecalls/emails in a timely manner, then you're already leagues above most other people.\n\n5) the ability to network with people and capitalize on your relationships is the only way to move forward in this business. Going to shows, parties, events, etc. You never know where work is going to come from.\n\nYour work gets you work. Make sure everything you do is the best representation of your abilities. Don't choose which projects to care more about. Give it your all on everything... even if its a shitty gig. That word will spread and you'll start getting more work through that.\n\nHope this helpful. Good luck!",
    "reactions": 34,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1209980592779960422",
    "author": "NoahNeedleman",
    "date": "2024-02-21",
    "content": "Now, i know that music is the medium through which I can love people.",
    "reactions": 33,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1323527500713689089",
    "author": "chrissorem",
    "date": "2024-12-30",
    "content": "Lots of great replies. Also here is another alternative that might get you to the root of the issue https://nofap.com",
    "reactions": 27,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1197235659736350882",
    "author": "BatMeckley",
    "date": "2024-01-17",
    "content": "This is fantastic fantastic advice.\n\nI’d take it a step farther and say it doesn’t even have to be just an acapella. A great writers block technique is to just a drop a song you dig into your DAW and start building on top of it. Lay down drums, maybe a counter melody. Now pull the original song out and you’ve got a new song with the scaffolding of a hit. Very useful trick.",
    "reactions": 24,
    "categories": [
      "music_theory_arrangement"
    ],
    "is_expert": true
  },
  {
    "id": "927051207258816573",
    "author": "cian riordan",
    "date": "2022-01-01",
    "content": "Agreed -- be critical of everything. Be critical of things that are expensive for the sake of being expensive. Things that are just  instagram ads shilling to newbies. Critical of  Greg Wells pandering to whatever his base is. But recommending a 4k converter based on 'audible conversion quality' isn't helpful if the consumer doesn't have a million other ducks in a row first -- room treatment, adequate monitoring, proper gainstaging, etc. Jon has that figured out, so it makes sense for him. But when people come into a forum with questionable knowledge and background in music production asking what's the best converter, I think it's fair to ask some prying questions before just making blanket recommendations on what one person heard or not. I have plenty of semi-OK stuff that still gets used on the regular, and plenty of expensive gear that I would happily toss out of my workflow. They're all just tools. And whether its bougie DW Fearn or a black-friday Acustica plugin, , if it works for your workflow and gets you results you're happy with, then its worth whatever money you're willing to pay for it.",
    "reactions": 23,
    "categories": [
      "getting_started",
      "recording_basics",
      "gear_recommendations",
      "acoustic_treatment"
    ],
    "is_expert": true
  },
  {
    "id": "1250069444341010462",
    "author": "Dereck Blackburn",
    "date": "2024-06-11",
    "content": "This morning I've booked the rest of July and a few dates in August.",
    "reactions": 22,
    "categories": [],
    "is_expert": false
  },
  {
    "id": "980389089650036746",
    "author": "BatMeckley",
    "date": "2022-05-29",
    "content": "So much good advice here, but I’ll just add: no one gives you a plaque that says “you’re a producer” or “you’re an artist”. You are because you do. Just keep doing, keep trying to find any avenue to push you’re knowledge/experience/discography forward. Every record you make you’ll learn something new AND you’re already getting paid for your work (win). Spoiler alert: You’ll NEVER feel like you REALLY know what you’re doing. If you do, you’ve lost (I know this must sound odd coming from someone who @cian riordan  thinks is so knowledgeable and brilliant) Satisfaction breeds mediocrity. Music is far too vast for anyone to fully understand    everything in their lifetime. Bake that into the equation as you try to figure out how you feel about where you’re at.",
    "reactions": 21,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1064017809820102656",
    "author": "BatMeckley",
    "date": "2023-01-14",
    "content": "He’s too humble to say it, so I will, but when you hire a guy like Cian you’re getting talent, not genre. While there’s something to be said about a mixer who worked with a band you like, a lot of that is the e band you like.\n\nWhile Cian has worked on bands and records I dig, if you pay attention to his discography it’s not just one style. The style or genre isn’t the through line, the consistent quality is. When looking for mixers, try to separate the mix from the band.",
    "reactions": 21,
    "categories": [
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "1077638880012021770",
    "author": "Rollmottle",
    "date": "2023-02-21",
    "content": "yes, they rely on DSP (Defiling Someone's Parent)",
    "reactions": 21,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1131968007057461331",
    "author": "cian riordan",
    "date": "2023-07-21",
    "content": "Silly and obvious answer, but it's the only one I think will really get you there: just do the reps. Mix your stuff, mix your friends stuff, mix anything you can get your hands on. Focus on getting a consistent sonic landscape, despite the source material. Figure out what about old or modern records you like; what you don't like. The world already has plenty of vanilla mixers that make things sound like everyone else, find a way to set yourself apart from the rest -- it's become a very crowded space and anything you can do to make your thing special will work in your favor.",
    "reactions": 21,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1326778976550781009",
    "author": "cian riordan",
    "date": "2025-01-08",
    "content": "Everything about a 421 is shitty. How it looks like it might be side address but its really front address. The stupid fucking clip that doesn't work. How its one number off from having a cool name. And oh yeah, how it sounds like dogshit on anything you stick it in front of.",
    "reactions": 21,
    "categories": [
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "991370279471300699",
    "author": "oaklandmatt",
    "date": "2022-06-28",
    "content": "another reason we kicked their ass in the revolutionary war tbh 🇺🇸",
    "reactions": 20,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1299443374541111357",
    "author": "chrissorem",
    "date": "2024-10-25",
    "content": "Find out which artists they despise and sneak in “ wow these lyrics really remind me of ____ band”",
    "reactions": 20,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1345257465188585513",
    "author": "cian riordan",
    "date": "2025-02-28",
    "content": "Here's where I ended up -- it's a WAV file so feel free to use it if it's useful. On the house. https://www.dropbox.com/scl/fi/9b52pxedvxtpz89qekf0g/boozle-drums-CR-rgh.wav?rlkey=hueyxufc8boyrmnvisbv5s44u&dl=0",
    "reactions": 19,
    "categories": [
      "file_management"
    ],
    "is_expert": true
  },
  {
    "id": "976531699418673216",
    "author": "BatMeckley",
    "date": "2022-05-18",
    "content": "Not true. I’ve been to his place and he has a giant Price is Right esque wheel with a variety of frequencies written on it. He just gives it a massive spin and gets lucky A LOT.",
    "reactions": 18,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1133961039751422002",
    "author": "LAPhill",
    "date": "2023-07-26",
    "content": "This is such an important lesson to anyone following along who's either a mixer or especially a mastering engineer. You can send someone spiraling with doubt based off of one comment, perhaps your own limited understanding of the material. \n\nEven the way you phrase something can make all the difference. \"Hey AJ, I hear what you're going for and I love it, but I think there's room for the bass to hit harder if you can back off the levels. Just trying to to get you the vibe that I think you're going for. And if you hate it, no worries and we'll go back to your louder track.\"",
    "reactions": 18,
    "categories": [
      "mastering_basics"
    ],
    "is_expert": true
  },
  {
    "id": "1407868335202369638",
    "author": "BatMeckley",
    "date": "2025-08-20",
    "content": "This is why I’m always talking about developing our musical taste. \n\nMost decent mics CAN get you where you want to go, they just take a little different processing down the line to make it happen. Even though the different mics basically sounded the same at the end, I can almost guarantee there was some different processing going on to get them there.  But if you don’t know what good is, what it’s supposed sound like, no matter how nice the mic is it will be tough to get there.",
    "reactions": 18,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1028830022083039304",
    "author": "cian riordan",
    "date": "2022-10-09",
    "content": "Just found this pic of Ruari from the last time we hung out:",
    "reactions": 17,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1079608180126003220",
    "author": "cian riordan",
    "date": "2023-02-26",
    "content": "“Out of which speaker did Elton touch you, Ruairi?”",
    "reactions": 17,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1104964772870488134",
    "author": "LAPhill",
    "date": "2023-05-07",
    "content": "The only truth is what comes out of the speakers",
    "reactions": 17,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1254913500321677393",
    "author": "Rollmottle",
    "date": "2024-06-24",
    "content": "i promise you, at 23, you will never be more free to have almost nothing to lose, to do literally anything.",
    "reactions": 17,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1256551090220961853",
    "author": "Edward Rivera",
    "date": "2024-06-29",
    "content": "@BoozleBAM by the skin o’ my teeth, I’m very lucky to be where I am at in life. \n\nI could have ended up in the literal dumps, and a few times I have…but I also could have it so much better. \n\nWhat kept me from the latter (and put me in the former) was dishing out responses very similar to yours when very important people were _very_ generous with their time, but gave me hard pills I didn’t want to swallow\n\nEven in cases like the one demonstrated on this server, I felt it more like an attack than an intervention. How I wish I could go back to those moments and do them differently. Those people couldn’t tell you where I am now because they rightfully stopped giving a shit \n\nI had to learn the hard way that their time was not infinite, nor were they obliged to give it to me, nor I deserving of it \n\nFinding this place feels like part of a bigger second chance I’ve been given, I try every day to treat it as such, and great things have happened because of it\n\n…and I mean more than a kickass drum sound",
    "reactions": 17,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "991393600476827709",
    "author": "cian riordan",
    "date": "2022-06-28",
    "content": "I say “stems”, because that’s what we fucking call everything now apparently.",
    "reactions": 16,
    "categories": [
      "file_management"
    ],
    "is_expert": true
  },
  {
    "id": "1070577147955118162",
    "author": "cian riordan",
    "date": "2023-02-01",
    "content": "Contrary to a lot of good advice here, I would rather be slammed busy mixing below my ideal rate than making a higher rate doing less work. I realize it's silly, but I take comfort in staying busy and keeping my 'pirate ship' afloat. I definitely have a bottom line, but I like to work with artists to meet them at what they can afford. It keeps my work portfolio diverse and my toolkit in good working order.",
    "reactions": 16,
    "categories": [
      "career_learning"
    ],
    "is_expert": true
  },
  {
    "id": "1155203098730561586",
    "author": "oaklandmatt",
    "date": "2023-09-23",
    "content": "This is why we have a newbie question channel! ❤️",
    "reactions": 16,
    "categories": [
      "getting_started"
    ],
    "is_expert": true
  },
  {
    "id": "1182183259224952882",
    "author": "David Fuller",
    "date": "2023-12-06",
    "content": "If I were to try and write up \"audio electronics for music producers\" would anybody be interested in that?",
    "reactions": 16,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1256441468013252638",
    "author": "NoahNeedleman",
    "date": "2024-06-28",
    "content": "@BoozleBAM \n\nCouple things. 1) if someone’s name is in purple, it means they’re a moderator AND they have real actual credibility, not only on this server but out in the real world. \n\n2) @Nomograph Mastering just mastered the number 1 song on Billboard. If that doesn’t make you wanna stop and think about why he’s spending time answering your questions or encouraging you to ask better ones… well you might be in the wrong place. \n\n3) you can get answers to questions like “should I use omnis for overheads” on Google. So Rauirí’s attempt to push the conversation toward more important things is a reflection of his care for the quality of conversation on this server. The mods here take great care to make this place a valuable place to spend our time. We’re trying to create a place we needed when we were exactly where you are.",
    "reactions": 16,
    "categories": [
      "mastering_basics",
      "acoustic_treatment"
    ],
    "is_expert": true
  },
  {
    "id": "1256657687677108276",
    "author": "BatMeckley",
    "date": "2024-06-29",
    "content": "If you’re just tuning in, A lot has happened here really quickly but if you scroll up a few (as of now) pages there’s a really kickass photo of me. Just keeping you all in the loop.",
    "reactions": 16,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1274179870804414518",
    "author": "Nomograph Mastering",
    "date": "2024-08-16",
    "content": "You have used (1) of (1) available credits for \"Let someone else google the manual for me\"",
    "reactions": 16,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1290753511927189565",
    "author": "cian riordan",
    "date": "2024-10-01",
    "content": "You investing in a single Apple M1/M2/M3 MacBook Pro would likely remove most of the technological hurdles that get in the way of you making this record.",
    "reactions": 16,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1349087201589329969",
    "author": "BatMeckley",
    "date": "2025-03-11",
    "content": "You keep getting the right answer. And you keep swearing it’s the wrong one. \n\nRelease some songs. \n\nThe quote above about hindsight is so spot on. If you have 16 full lengths RELEASE A SONG. You can always redo it with the wisdom you’ve gained in hindsight. But you keep asking for help, because you don’t know the answer, you keep getting the answer, and then you go “no that’s not the answer”. It IS the answer. This is how to get where you want to go. \n\nI totally get that living in the potential is cozy and safe. But it’s not how you actually progress. You have to face the actual. And if you don’t, you won’t. No amount of discord or Reddit is going to actually get you there. It’s like a guy going on a body building forum for two years asking about weights and reps and form and saying how he’s not gaining any muscle, and then it comes out that you actually haven’t lifted a weight yet. \n\nIt’s always “I JUST need this, and THEN I can…” but, again, (again again) it’s not. You need to actually listen to the advice or what are we doing here?",
    "reactions": 16,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1397993869802602529",
    "author": "cian riordan",
    "date": "2025-07-24",
    "content": "Did you run out of advice to not take?",
    "reactions": 16,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1404234984704708739",
    "author": "Nomograph Mastering",
    "date": "2025-08-10",
    "content": "Financial headroom is good for creativity",
    "reactions": 16,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "875840389720981504",
    "author": "cian riordan",
    "date": "2021-08-13",
    "content": "A tangent…\n\nI’m lucky to have spent many years in a great studio with lots of great drums & gear… not to mention being mentored by one of the great engineers of our time. Having this perspective is massively useful in mixing other peoples tracks, because I feel I have a north star of what good drums can sound like if they’re recorded and performed properly. It used to be that my starting point for mixing drums were working with tracks that I had recorded myself… and most of the above problems were solved before the mix stage. These days, with smaller budgets and time constraints, its very rare that this is a possibility.\n\nI’m including this drum tracking session from a few years ago that I recorded at Barefoot. It was for a project that Matt was producing that never saw the light of day. But we went all out with the drum setup in the big room, through the console, and had a great drummer. This might be useful for some people who have never gotten properly recorded drum tracks… to get a sense of how good thigns can sound before the ‘mix’ stage. These are the tracks that were printed into Pro Tools off of the console, and the three busses were prints of the outboard compressor busses we were using while monitoring. It’s unlikely these busses would get used in mixing, but they’re a good reference to what we were listening to in the room while we were tracking. But as you’ll notice, the individual drum blend can stand on it’s own two feet. Hopefully this is useful as well.\n\nThanks for coming to my Ted talk.",
    "reactions": 15,
    "categories": [
      "mixing_basics",
      "daw_workflow"
    ],
    "is_expert": true
  },
  {
    "id": "1104946061593821225",
    "author": "BatMeckley",
    "date": "2023-05-07",
    "content": "Look. I can’t tell you who I am. But I have 100’s of Grammys. I mix 536 songs a year, on average, and all of them go number 1. Half of them I mix on PMC’s just for the challenge. AND I can not only high shelf, but unlike other Grammy winning mixers here, reach things on the high shelf. \n\nMy one mix tip for the day is: don’t rely on the piano roll too much.",
    "reactions": 15,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1184856813053673483",
    "author": "masteredbyjack",
    "date": "2023-12-14",
    "content": "Haha I honestly only ever got on discord to be on here, which I love. Also think, and this is just a personal thing, that restricting the information I consume is really helpful -- there are a few people on here ( @Nomograph Mastering , @cian riordan , @BatMeckley to name a few) that are sorta true norths to me -- I weight their opinion heavily...between here and doing the thing everyday and learning in the fray so to speak, not sure there is much more that would be useful for me at this point!\n\nThis place is really incredible, so many ultra talented and kind folks sharing real world info",
    "reactions": 15,
    "categories": [
      "mastering_basics"
    ],
    "is_expert": false
  },
  {
    "id": "1070911548203225219",
    "author": "cian riordan",
    "date": "2023-02-02",
    "content": "See, because of layups like these, Matt's gonna go to bed this evening feeling like a real winner. Like he really accomplished something. We should all be cheering him on -- \"go, Matt, go!\"",
    "reactions": 14,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1194414566629724191",
    "author": "oaklandmatt",
    "date": "2024-01-09",
    "content": "Introduced to Eric \"through a friend\" smh",
    "reactions": 14,
    "categories": [
      "music_theory_arrangement"
    ],
    "is_expert": true
  },
  {
    "id": "1256651798584754196",
    "author": "chrissorem",
    "date": "2024-06-29",
    "content": "I’m just jumping in but if I were in your shoes I’d take back seat and observe for a while. You’ll learn more by saying less and listening more. There have been a few cats that came in here with the same vibe you have now and they didn’t last long and didn’t learn much.  Also we aren’t  your mum or dad",
    "reactions": 14,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1425846313316257945",
    "author": "cian riordan",
    "date": "2025-10-09",
    "content": "If I use outboard I just print it early on in the process. Only real way to stay sane imho",
    "reactions": 14,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "979101765288984606",
    "author": "BatMeckley",
    "date": "2022-05-25",
    "content": "This. 10% skill, 90% people actually wanting to be around you.\n\nNo matter how well you know compression or eq, if you’re not in the room you can’t make the music. I remember asking producers I’d do whatever, clean toilets, coil cables. Just wanted to be in the room. It’s actually how I ended becoming a vocal producer… a producer I admired didn’t want to tune vocals anymore lol",
    "reactions": 13,
    "categories": [
      "mixing_basics"
    ],
    "is_expert": true
  },
  {
    "id": "1066180305582555236",
    "author": "cian riordan",
    "date": "2023-01-20",
    "content": "If you change the zero to a 1 at the end of a Dropbox link, it defaults to download when you send it out",
    "reactions": 13,
    "categories": [
      "file_management",
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "1068784678879895562",
    "author": "oaklandmatt",
    "date": "2023-01-27",
    "content": "Haha just relaying my experience. If you're sending to a mastering engineer it's a whole different conversation.\n\nAlways think about what you're trying to accomplish at any given stage. Then go after that goal. \n\nI used to spend too much time on sonics in writing sessions. I should have been solely focused on finding emotional magic. Now  I am just trying to inspire the artists and writers around me, I'll deal with the sonics later. Much better results.\n\nI also used to fully mix-as-I-go, which painted me into a corner with gain staging and eq. Now when I get to the end of the process, I often pull things back and rebuild my levels so there's headroom and I can make that exciting production translate.\n\nDifferent approaches for different parts of the process.",
    "reactions": 13,
    "categories": [
      "recording_basics",
      "plugin_recommendations",
      "mastering_basics"
    ],
    "is_expert": true
  },
  {
    "id": "1070556925609119744",
    "author": "LAPhill",
    "date": "2023-02-01",
    "content": "If I can offer one bit of perspective from an outsider - As soon as someone pays you more, that is now your rate from that day forward. Everything else is a discount.\n\nIn composer land, I had a client come along and effectively pay me more than double what I was making up to that point. After that, all negotiations were done as that new number being my base rate, and anything less was a discount (I love the idea above of marking that discount on the invoice so your full rate is still shown). I sort of felt guilty for awhile charging that much, thinking I wasn't at that level, but then started to notice most clients instantly started to get pretty close to that number, where before they were half of that. Perception is a VERY powerful thing.",
    "reactions": 13,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1103744625895809114",
    "author": "popaganda.",
    "date": "2023-05-04",
    "content": "Same. I crop-cycle. And I would be depressed if I had to let go of writing or playing out etc for mixing full-time. Specializing is the right move for some people, and in some ways it’s easier to market/brand yourself if you just do a thing, but it’s not inherently better. I love all the parts of the music making process",
    "reactions": 13,
    "categories": [
      "career_learning"
    ],
    "is_expert": false
  },
  {
    "id": "1122175319932149860",
    "author": "masteredbyjack",
    "date": "2023-06-24",
    "content": "Gonna circle back with more later, but this is my 2 cents (I started mastering with zero clients about 9 months ago)...\n\nGet over your fear/insecurity/weirdness of not having a portfolio. Go fuck it mode. You need to have a ton of contacts. Take a lot of shots. Of course I have no idea about what you are doing currently...but zero people I've ever talked to in this situation have taken enough shots. \"I reached out to 5 people this week\"...no. HUNDREDS. Most people will ignore you. But just keep going. Watch a Goggins video before you start or something haha\n\nReally think about the experience of working with you. Is it amazing? Is it easy? Is your communication, care, intention incredible? Even things like how files are named/delivered/etc matters. You can only be as good as you are at mixing until you get more reps. But you can control how you interact and the professionalism and confidence you can inspire on the other side.\n\nIf someone lets you mix a song...are they coming back? They need to if you are going to have a business doing this!\n\nSorry to be prescriptive here...but I've seen this question asked of me enough to know that it's so so hugely about just brutal persistence in many aspects, assuming you have talent, etc to do the actual thing.",
    "reactions": 13,
    "categories": [
      "mastering_basics",
      "career_learning",
      "file_management"
    ],
    "is_expert": false
  },
  {
    "id": "1179016392318660628",
    "author": "oaklandmatt",
    "date": "2023-11-28",
    "content": "The landscape for pitching songs has changed dramatically in the last decade. It still exists, but it has shrunk to the point where even the top level writers can't rely on it as much.\n\nThis is simply because many more people can write songs and make demos quickly. This results in two things: the market is flooded with songs, and artists who used to rely on pitch songs are now writing (or co-writing) the majority of their material.\n\nMany songs that used to be sent to an artist are now brought into the room and finished with the artist themselves. Like, you'd pitch a chorus or a 3/4 finished song to an artist and finish with them on the spot.\n\nThe genres where pitching songs still predominates are country the (industry is still writer–driven), EDM (many artists are performers who do not write or produce), and pop (but they're mostly just looking for HITS).\n\nAnother consequence of this shrinking pitch landscape is that the projects that need \"outside\" songs are much more gate-kept by people in the industry. In country, there are publishers and labels that generally source the songs. In pop, labels and executive producers (of specific projects) tend to be the gate keepers, and in EDM it is a similar combo.\n\nSo, to answer your question directly, the best way to pitch songs is to build direct relationships with artists or go through the various business people who gate-keep the process.\n\nTo advise you based on your question: make incredible records with your friends, peers, and the people around you, and get visibility that way. Hustle like crazy and use every moment of new visibility as a stepping stone to get in the mix with the larger music community. Ultimately you probably sign a publishing deal and sing with a manager where you get business representatives to help guide you and connect you further.\n\nAs with all things music, if you actually really for real make A+ records, people will find you. It's just that this is a lot harder than people think.",
    "reactions": 13,
    "categories": [
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "1252689092358180925",
    "author": "cian riordan",
    "date": "2024-06-18",
    "content": "Man, sounds like you're doing the thing and you've got a great head about it. My only notes would be to start thinking about the 'work' that brings the least value to your career (and your life) and figure out ways to get that off your docket -- whether thats farming it out to assistants or just letting go of projects that don't make as much sense. I was not handling things this well 10 years ago when I was your age.",
    "reactions": 13,
    "categories": [
      "career_learning"
    ],
    "is_expert": true
  },
  {
    "id": "1256624211493916753",
    "author": "montrose recording",
    "date": "2024-06-29",
    "content": "im here to answer some newbie questions.  \n\nmy 2 cents though after doing this gig for more than half my life is that there arnt big rights and wrongs and no one silver bullet will solve any problem.  ive probably made all the mistakes - ive had huge swings in workflow and between  engineer to artist to mixer.   few things fatigue me more than folks discussing the ‘correct and only way’ to do something because i truly believe there are many many correct ways to solve a problem in music production\n\nbtw i think ive learned far more from observation than questioning fwiw\n\nthat being said - fire away",
    "reactions": 13,
    "categories": [
      "getting_started"
    ],
    "is_expert": false
  },
  {
    "id": "1266851879581782098",
    "author": "cian riordan",
    "date": "2024-07-27",
    "content": "I'll have you know that everytime I sit down and fire up Spotify to listen to some new music, the first thought that enters my head isn't \"I wonder how these folks managed their drum editing?\". To quote @BatMeckley's mother: \"Nobody cares how the sausage is made... I just like sausage.\"",
    "reactions": 13,
    "categories": [
      "mastering_basics"
    ],
    "is_expert": true
  },
  {
    "id": "1451989576058146839",
    "author": "BatMeckley",
    "date": "2025-12-20",
    "content": "Honestly, that line is a bit over blown. It’s more “oh the chorus is louder, let’s knock it back a click or two on the input so it doesn’t distort”\n\nWe were usually recording songs in fairly small sections, making sure to get the details right. There wasn’t a lot of jedi like fader riding. On very rare occasions if I knew there was going to be a huge dynamic shift I’d reach out and grab the output fader, but I can probably count on one hand how many times I’ve had to do that.\n\nWe were fairly conservative on the 1176 on the way in, largely cause you can’t un crunch a vocal that’s been over compressed, but once the vocal was in PT it would be hit by just irresponsible levels of compression and limiting. Like goes against how virtually every “expert” online would tell you how to do it. Most people would tell you the solo’d tracks would sound bad, but as part of the song their impact is objectively unarguable",
    "reactions": 13,
    "categories": [
      "mixing_basics",
      "mastering_basics",
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "989647146275975278",
    "author": "BatMeckley",
    "date": "2022-06-23",
    "content": "I would open up the uad console, go over to line inputs, check for cue, then chuck the interface out the window of a moving vehicle. \n\nHardware inserts not their forte unless you love phasing or time aligning manually",
    "reactions": 12,
    "categories": [
      "recording_basics"
    ],
    "is_expert": true
  },
  {
    "id": "1020798891593044018",
    "author": "cian riordan",
    "date": "2022-09-17",
    "content": "You're very much being taken advantage of here. I would recommend politely writing them an email saying that you've done the work that you were hired to do (especially if things have been delivered for mastering) and given the amount of additional work they're requesting, you need to negotiate a new fee for said work.",
    "reactions": 12,
    "categories": [
      "gear_recommendations",
      "mastering_basics",
      "file_management"
    ],
    "is_expert": true
  },
  {
    "id": "1067192805115559946",
    "author": "cian riordan",
    "date": "2023-01-23",
    "content": "Honestly, mono reverb down the middle leaves lots of rooms on the sides, and mono reverb to one side leaves lots of room in the middle + other side. Stereo reverb leaves no room.",
    "reactions": 12,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1077646243393703947",
    "author": "cian riordan",
    "date": "2023-02-21",
    "content": "We need to use this platform to make the MKII’s the U87ai of the monitoring world. Collectively protect our Vintage MKI resale value.",
    "reactions": 12,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1125206925978652724",
    "author": "Ross Fortune",
    "date": "2023-07-02",
    "content": "Alright now’s our chance, everybody get Sonarworks up and start boosting into nulls!",
    "reactions": 12,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1252427793699180644",
    "author": "bobby k",
    "date": "2024-06-17",
    "content": "Sorry if this has been asked before lol but is it normal to feel stressed and overwhelmed every day of your life",
    "reactions": 12,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1256284807193821254",
    "author": "Nomograph Mastering",
    "date": "2024-06-28",
    "content": "Anyone who has made records for a minute has done all the things - the minimal faders up thing, the crazy corrective fixing, the sound design mode where it’s heavy effected processing …\n\nBut the thing I’m missing in a lot of your posts is the why. There’s no sonic goal being held up, no destination being discussed, so sense of what it is you’re aiming for\n\nLike the Omni overheads for example, way easier to help you if you say what it is you’re chasing. With your 10 unreleased albums I’m concerned it might be your tail …. and I’m not keen to join that expedition so I often don’t reply",
    "reactions": 12,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1269069816275275897",
    "author": "Rollmottle",
    "date": "2024-08-02",
    "content": "nobody's going to judge you for the settings you used on a plugin or if you used a preset or if it was really extra super hard or if it was really extra super easy. literally nobody cares. they'll only hear the music. focus on the music. don't conflate time spent as a yardstick for the value of the outcome -- there is often little, if any, correlation.",
    "reactions": 12,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1272838506712141834",
    "author": "Nomograph Mastering",
    "date": "2024-08-13",
    "content": ".\nAssuming we're talking about fairly typical rock, pop and Hip Hop then this 3 part strategy covers a lot of ground\n\n1) Make sure the EQ is as balanced as you can get it - most of your perceived loudness comes from the arrangement and mid range focus (2k to 8k). Too much low end will sound bad when you limit. Make sure the relationship between 80, 160 and 320 makes sense (think of them a little like fundamental, 1st and 2nd harmonic).\n\n2) Consider shaving snare transients (and maybe kick transients) with a clipper. This spreads that peak energy harmonically across the spectrum, keeping energy, hiding in the noisey nature of snares and lets the limiter work less hard (I like SIR Standardclip - $25, great metering and responds intuitively)\n\n3) Pro-L2 on the settings below is a great start point for clean and predictable limiting, raising input gain until you get the desired level",
    "reactions": 12,
    "categories": [
      "mixing_basics",
      "mastering_basics",
      "music_theory_arrangement",
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "980342386586705930",
    "author": "Slow Hand",
    "date": "2022-05-28",
    "content": "Let me begin by saying that your feelings and experiences are more common than you may realize. It's alright to feel that way. Though I don't believe it's constructive to dwell on them.\n\nIt's not unusual to feel inferior when surrounded by people who are more experienced and talented than you. We've all felt this. The thing is this; you are in exactly the right place and will only benefit from engaging with this environment. Being surrounded by so many professionals and people with experience is absolutely a benefit to your development and someday you'll look back at how far you've come and be amazed by how fluent you are.\n\nLet me drive this point home just a little more: When you were young and learning your native language, nobody put you in a room and expected you to learn the language by conversing with a bunch of inexperienced two year-olds who couldn't speak. Instead, you were surrounded by expert speakers and learned through interactions with people who were leagues ahead of you in their ability to speak the language. Learning to speak is not an easy task, but by immersing yourself in a community of experts you are on the path to mastery and in no time you'll reap the benefits of that exposure.",
    "reactions": 11,
    "categories": [
      "career_learning"
    ],
    "is_expert": true
  },
  {
    "id": "1033467594566545428",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "Ok, worked super late. Gonna coffee up, and do this on the computer. Let’s see if I can’t be somewhat concise",
    "reactions": 11,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1033533279950880820",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "My phone lock screen is a pic of me at age 5, in many ways life is about finding your way back to that kid",
    "reactions": 11,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1033540888758075392",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "Fuck MWTM, let's do a LWMR Improv training weekend",
    "reactions": 11,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1036785475878387802",
    "author": "Slow Hand",
    "date": "2022-10-31",
    "content": "It's a big topic, but gain staging is about finding the optimal amount of gain at every stage of the recording and mixing process.\n\nGood gain staging allows you to get the best fidelity out of a recording by preventing things from creating unwanted distortion or amplifying unwanted noise. **OR** if you are *seeking* some distortion and compression it's about turning up the gain enough to give you the amount that you're seeking from your tools.\n\nGain staging is something to be considered at all steps of the production process. For example:\n\n*1. How loud is an amplifier turned up in the room? Is the microphone being blow out by it?\n\n2. How high is the gain on a microphone preamp and is it at risk of clipping if the performer plays loudly?\n\n3. Is the gain so low that when I turn a signal up later on the noise floor will rise with it?\n\n4. If I'm recording to tape, am I recording quiet enough that it won't saturate the signal, or do I want for the signal to slam the tape and be saturated?\n\n5. How loud is an individual channel in a DAW? Is it making the channel clip?\n\n6. How loud is a signal that's being sent into a piece of hardware or a plugin? Am I distorting the circuitry at all?\n\n7. Is my signal coming in so hot that it makes a compressor react way too hard?\n\n8. How loud is the entire track I'm mixing? Is the limiter crushing the dynamics in an unwanted way? Or am I hitting it just with just enough level to get a certain flavor of pumping and clipping?\n\n9. Is my final mix going to hit digital zero and create unwanted clipping?*\n\nSo gain staging is not a single thing, but a series of choices that are made every step of the way around how you manage the \"voltage\" of your signals. Together these choices all add up to a mix that \"breathes\" well and is free of excessive or unwanted distortion.",
    "reactions": 11,
    "categories": [
      "recording_basics",
      "mixing_basics",
      "mastering_basics",
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "1042673224149909524",
    "author": "NoahNeedleman",
    "date": "2022-11-16",
    "content": "You can edit your posts buddy.",
    "reactions": 11,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1045500000576217228",
    "author": "Slow Hand",
    "date": "2022-11-24",
    "content": "I would rule out the Izotope production bundle (Ozone is fine). I think Izotope is the least musical and hit-or-miss of the options. It's not bad, but it's not as fun to use as the other options, and I think that has an effect on your results.\n\nBoth the FabFilter Mastering bundle and Soundtoys bundle are great and you wouldn't go wrong with either pick. But they occupy different niches: FabFilter is clean and surgical while Soundtoys is all about injecting vibe and coloration and doesn't include anything remotely surgical.\n\nI guess if you can only pick one I'd start with Soundtoys for the vibe and the way it would expand the sonic palette for your production work. Your DAW is going to have some perfectly capable EQ's and compressors to tide you over until you're ready for FabFilter.\n\nPut another way, your production work is upstream of your mixing work and will influence the sound of your records more.",
    "reactions": 11,
    "categories": [
      "mixing_basics",
      "plugin_recommendations",
      "mastering_basics"
    ],
    "is_expert": true
  },
  {
    "id": "1056995320334139433",
    "author": "popaganda.",
    "date": "2022-12-26",
    "content": "I will say that the more noob you are the more you’re probably finishing productions, editing, tidying etc and that’s all very time consuming. And usually getting paid 1/10 of what you should for all that work.",
    "reactions": 11,
    "categories": [],
    "is_expert": false
  },
  {
    "id": "1064009620139556966",
    "author": "cian riordan",
    "date": "2023-01-14",
    "content": "I would suggest making sure that you like their output. Listen to things they've mixed and make sure they gel with your aesthetic. There's a technical baseline that you want to ensure your mixer can meet -- it's usually pretty obvious when they're hitting below it. Like Noah said, a personal connection is great because it usually makes the communication a little easier. They'll be less precious about reaching out to you for feedback/additional files/etc and you'll be more candid in your feedback. Also, if you haven't worked with that person, very easy to find people who have and shoot them a quick note. \"How was your experience? Would you hire them again?\" From there you can just go down the list of pricing, availability, etc.",
    "reactions": 11,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1070561216587628616",
    "author": "Slow Hand",
    "date": "2023-02-01",
    "content": "Also, consider that raising your prices will eventually *improve* the caliber of client that you are working with. To understand how that could be, this passage on *Price Transition Shock* does a great job at explaining: https://personalmba.com/price-transition-shock/",
    "reactions": 11,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1070907942351679529",
    "author": "cian riordan",
    "date": "2023-02-02",
    "content": "Here at LWMR HQ, we pride ourselves in appealing to all walks of the recording industry – even those like @BatMeckley that can't quite walk so good and remain stunted by room-temperature IQ. Mom jokes are Matt's only way of communicating with adults and I find it within charitable spirit to indulge him. God knows what else he'd be doing...",
    "reactions": 11,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1076684748564467722",
    "author": "MikeMillerMixes",
    "date": "2023-02-18",
    "content": "Hey guys it’s not the panning that’s synced. It’s the pre delay for the reverb. The sound is sent to pairs of objects that are mapped to points in the room and each one has a different predelay so that it moves the room.",
    "reactions": 11,
    "categories": [
      "mixing_basics"
    ],
    "is_expert": false
  },
  {
    "id": "1134159001718902826",
    "author": "NoahNeedleman",
    "date": "2023-07-27",
    "content": "My take, after listening, was that a ME should have no problem working on the non limited mix. I heard the clipping but it wasn’t ugly. There are lots of things that go into making a record, and a little clipping here and there isn’t gonna be the difference in a song hitting or not. \n\nBut also- allowing yourself to be curious without being fearful... Taking someone’s note and asking, without judgment, if there’s something you might’ve missed, is worthwhile.\n\nDeeper still, and I’m still working this out: taking the blame and taking the credit are the same thing, I think. Admitting you were wrong can be a sort of superpower, and all the sting and shame disappear and all you’re left with is the learning and growing and relationship building. Walls go down on all sides and it becomes a team effort again. \n\nIt’s real easy to let ego ruin a good feeling. Being able to say “shit what did I miss?” is wayyyy easier than saying “but I already said it was good so i can’t go back on it…” it takes longer to get there sometimes, but in the end it’s the path of least resistance. \n\nBBQ Sauce.",
    "reactions": 11,
    "categories": [
      "recording_basics"
    ],
    "is_expert": true
  },
  {
    "id": "1173806133450915900",
    "author": "NoahNeedleman",
    "date": "2023-11-13",
    "content": "Label delivery requirements are insane. The oversight and hoops to jump through, and the higher stakes. I’m not gonna give a label a deal if I don’t have to, and I’m not gonna charge an indie artist the same as I would a label. It’s not that deep.",
    "reactions": 11,
    "categories": [
      "file_management"
    ],
    "is_expert": true
  },
  {
    "id": "1185727875979157504",
    "author": "Rollmottle",
    "date": "2023-12-16",
    "content": "I have a couple distinct phases of my workflow. The “technical” phase let’s call it, is all about letting my brain objectively search for the very specific kinds of things that are distracting within the mix at hand. This is much more of a thinking and corrective process than it is a feeling one, even though feeling and taste is 100% involved. This part of the process is to get the mix on a more solid foundation if needed.\n\nThe next phase is where I want to actively NOT be thinking at all. This is why I do the first part separately. I want to be FEELING the music in this phase and not be taken out of it by the vocal resonance at 1.8k at 1:35 in the bridge. I want to turn that part of my brain off so I can focus on the music, the feeling, the lyrics, the intent, the song and try to find where (or if) I can elevate or reveal or better frame the heart of what’s there. This is meant to be the flow state, moving intuitively and viscerally based on what’s coming out of the speakers. This is where efficiency in toolset matters -- where an extremely efficient human-computer interaction matters, where knowing your tools cold matters. I want to reduce latency between feeling and move and I don’t want anything to get in my way. \n\nSo to answer your question: I think about ways to continue to be able to access and preserve that crucial flow state during the time where it matters the most. And it can manifest a million ways that aren’t directly related to mastering at all: taking a walk, working out, doing a J, listening to a new record, checking Discord, unplugging, whatever. And yes, sometimes it also means refining my template or my Streamdeck shortcuts or creating a new preset.",
    "reactions": 11,
    "categories": [
      "mastering_basics",
      "music_theory_arrangement",
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "1256652436425150495",
    "author": "chrissorem",
    "date": "2024-06-29",
    "content": "Keep it up and you’ll be making pancakes Instead  of records lol",
    "reactions": 11,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1288970924980178965",
    "author": "Slow Hand",
    "date": "2024-09-26",
    "content": "This is going in the lexicon.",
    "reactions": 11,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1297640225677250640",
    "author": "Josh",
    "date": "2024-10-20",
    "content": "Also I feel aside from splitting notes, the other most important part of tuning is knowing what not to tune",
    "reactions": 11,
    "categories": [],
    "is_expert": false
  },
  {
    "id": "1385330829076463647",
    "author": "oaklandmatt",
    "date": "2025-06-19",
    "content": "I would just avoid the temptation to bring insult humor on here tbh. Beckley and Cian have a weird thing that seems to work. But others have tried and it just brings the vibe down. \n\nWe can all just continue watching the two dogs growl and bite each other for our amusement, without sticking our hands in the way.",
    "reactions": 11,
    "categories": [
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "1436947576631857324",
    "author": "Slow Hand",
    "date": "2025-11-08",
    "content": "Do it better on the next record and keep moving. 99% of listeners don’t care about intonation. It is not going to break your record. \n\nIf Lou Reed can sell a million records and get into the Rock n Roll Hall of Fame with that ear for pitch you’ll be just fine.",
    "reactions": 11,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "846581406104551427",
    "author": "Rollmottle",
    "date": "2021-05-24",
    "content": "why do you need the kick going to the same bus as the other stuff? just leave it on its own channel and process it on its own. side chain your drum bus to the kick if you need the kick's groove.",
    "reactions": 10,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "964610700058193970",
    "author": "samvalentine",
    "date": "2022-04-15",
    "content": "For mixes I'll save a different version every bounce. Tracking I'll save based on significant arrangement decisions, different days recording, different artists or instruments - really depends.\nBut noooo I'll really only use save copy in if I'm sending a session off to someone. Check out save as - it just creates a new ptx file in the same session folder. Doesn't duplicate all of your audio files etc. Shortcut is command control s on mac",
    "reactions": 10,
    "categories": [
      "music_theory_arrangement",
      "file_management"
    ],
    "is_expert": false
  },
  {
    "id": "998459299632271360",
    "author": "NoahNeedleman",
    "date": "2022-07-17",
    "content": "This mf just said want something quieter, try the volume knob?!",
    "reactions": 10,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1067199825273159841",
    "author": "oaklandmatt",
    "date": "2023-01-23",
    "content": "Great responses above. One other thing to conceptualize is guitar amps. Many guitar amps have built in spring reverb. If you mic that amp with a single mic, that mono signal has the reverb as a part of it. When you pan that complete signal, it carries a kind of depth and character that is very different from a stereo reverb or even a separate send. \n\nMono elements with their own reverb can achieve an interesting spatial clarity that you can't get with eq or compression or whatever else you use to give elements their own place in a mix. I use it on all kinds of things from guitars to vocals to drums to whatever.",
    "reactions": 10,
    "categories": [
      "mixing_basics"
    ],
    "is_expert": true
  },
  {
    "id": "1070553488364417155",
    "author": "BatMeckley",
    "date": "2023-02-01",
    "content": "This is one of those seemingly complicated things that is actually ultimately incredibly simple. \n\nThe actual worth of your work and time is at the intersection of what you’re willing to do it for and what someone is willing to pay you.",
    "reactions": 10,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1070581843738505286",
    "author": "NoahNeedleman",
    "date": "2023-02-01",
    "content": "I work free and at low rates a lot, (some might argue my rates *are* low, read: my fiancée,) but always with the caveat that I might not be as fast. Good Fast Cheap- usually gotta pick two right?",
    "reactions": 10,
    "categories": [
      "gear_recommendations"
    ],
    "is_expert": true
  },
  {
    "id": "1197076862866821193",
    "author": "popaganda.",
    "date": "2024-01-16",
    "content": "Here’s a hack: choose a song you like. Get an acapella by dropping the file into gaudiolab.com. Make a beat around it and arrange it to honor the vocal. Do that a bunch of times I bet you’ll learn a lot about how to leave space for vox, contour the beat towards a song, and know where to put transition licks/accents.",
    "reactions": 10,
    "categories": [],
    "is_expert": false
  },
  {
    "id": "1252452866086666291",
    "author": "LAPhill",
    "date": "2024-06-17",
    "content": "@bobby k I'm curious how old you are/where you are in your journey. I'd say as years go on, I've learned to separate feelings of pressure/responsibility/schedule density from \"stress\" or being \"overwhelmed\" in the true sense. There's that Dale Becker quote, \"Don't feel victimized by your work.\" Making peace with what it feels like to be responsible for someone's record, or your own music, is important. It carries a lot of weight, but it's a privelage to be able to do it and it should not break your spirit. Not that that's necessarily what's got you feeling this way.\n\nLots of ways to dive deeper if you'd like to share more about where you're coming from.",
    "reactions": 10,
    "categories": [
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "1256445568256049203",
    "author": "BatMeckley",
    "date": "2024-06-28",
    "content": "This is a good reminder that a third of making records is knowing how the gear and the frequencies work, and the other two thirds is understanding human beings and how they work. It’s the difference between “guy who reads sound on sound” and “guy who puts out records”. This discord seems as much about the bigger picture to actually getting things done as it is about the minutia.",
    "reactions": 10,
    "categories": [
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "1256463437408505866",
    "author": "cian riordan",
    "date": "2024-06-28",
    "content": "And there’s no judgement with that… the “elders” here want nothing more than to help people early in their journey! But there is a bent towards folks who make this “thing” their all… we don’t really do hobbyists here… that’s what Reddit and GS is for. Our aim is to help folks living in the middle of nowhere, with no resources and no friends who don’t give a fuck, make it to the big time. We’re like fucking Top Gun for music producers. Strap in. Read some of the back posts. You’ll be glad you stayed. You are welcome here.",
    "reactions": 10,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1260665273153880265",
    "author": "cian riordan",
    "date": "2024-07-10",
    "content": "If you suffer from carpal tunnel, best strategy is getting the desk/ chair position dialed in... you want to avoid any unnecessary tension in your wrist. Even though I use one, I find trackballs the worst for aggitating my wrist with micro movements. Realistically, some sort of ergonomic mouse and trying to use macro-movements (broadly moving the mouse with your arm as opposed to twitch movements on the wrist). It won't make you fast, but it'll prevent CTS.",
    "reactions": 10,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1299483249206100021",
    "author": "oaklandmatt",
    "date": "2024-10-25",
    "content": "Which is both truthful and encouraging",
    "reactions": 10,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1347992281382125570",
    "author": "hyanrarvey",
    "date": "2025-03-08",
    "content": "But I’d suggest you use what you have before you go buying amps.. also if your looking for a good quad sound try some ampsims even in your own daw",
    "reactions": 10,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1409952863953748030",
    "author": "Slow Hand",
    "date": "2025-08-26",
    "content": "Frequencies cost extra. Gotta download the frequency expansions. I bought 1 kHz, 200 Hz, and 2.4 kHz. Currently saving up for 60 Hz.",
    "reactions": 10,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1439396377699287050",
    "author": "Bryan DiMaio",
    "date": "2025-11-15",
    "content": "Also to save money on drives, you can pick up manufacturer recertified drives at a significant discount on serverpartdeals.com\n\nGrab a bunch of 12-16TB drives and go to town",
    "reactions": 10,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1445873412496162960",
    "author": "oaklandmatt",
    "date": "2025-12-03",
    "content": "In addition to loving music and wanting the best user experience, add \"how well are the music makers treated and compensated\" to your equation.",
    "reactions": 10,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "875840013550649394",
    "author": "cian riordan",
    "date": "2021-08-13",
    "content": "Mixing Drums:\n\nAfter now listening to many of Jon & Matt’s podcasts, as well as existing on this discord for a while, I’ve found myself feeling a little perplexed by people’s ability to mix things so fast. It finally clicked that many folks these days (especially in the pop world) are getting stems to mix from — not full multitrack sessions — and often not real drumsets/instruments in real rooms. In my world, for better or worse, I’m almost always getting multitrack files. So the prospect of only spending 2-3 hours on a mix is just impossible. That will often times barely get me past the drum sound! So for us mere mortals that are still stuck mixing real instruments, here’s my process for approaching drum mixing.",
    "reactions": 9,
    "categories": [
      "file_management",
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "896143861754257441",
    "author": "Rollmottle",
    "date": "2021-10-08",
    "content": "just wait until mastering! 🥴 🥴 🥴 🥴 🥴 🥴 🥴",
    "reactions": 9,
    "categories": [
      "mastering_basics"
    ],
    "is_expert": true
  }
]