[
  {
    "id": "1298665623089582163",
    "author": "chrissorem",
    "date": "2024-10-23",
    "content": "Strange I find most people hearing tuning/intonation better with a bass element in the mix. If I’m tuning multiple vocals, I tune the lead and mute other melodic instruments that might be distracting. Then tune  doubles to the lead, tune  the harmony with the lead, tune the  doubled harmonies to the tuned harmony and so on. I try to move fast not worrying about it being perfect and I then solo all the vocals together the see how they feel or put them back in the mix. As I’m working on the song if something feels off I’ll scope it out then. For me It’s very easy to get into a hyper tuning mode where everything sounds like it needs tuned if I obsess over it. I find it better to do a broad stroke pass and fine tune things as needed",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1410015542441541874",
    "author": "oaklandmatt",
    "date": "2025-08-26",
    "content": "1. Sing a lot every day. If you don't, no other advice matters. Sing songs you like, sing in the shower, sing because you're now a singer. IN ADDITION TO THIS:\n\n2. Hire a decent vocal coach and do a few vocal lessons (even a single lesson with a great teacher is important). You will get someone to teach you in-person how to breathe properly (that's the power source for the instrument you're learning). ALSO, you'll come away with a recording of a vocal warm up (somewhere between 5-20 minutes usually). YOU WILL THEN:\n\n3. Start EVERY day with vocal warm ups.\n\n4. Do whatever else you want to do that gets you singing a lot. Make it fun. I like learning songs, doing a voice memo every time I sing, and occasionally listening back. I sing bob dylan songs for my girlfriend. I record tons of vocals for songs I'm working on. Etc",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1297628564694372412",
    "author": "BatMeckley",
    "date": "2024-10-20",
    "content": "Bounce all your vocals from beat 1. Make a stereo instrumental bounce. Open up standalone. Put the aforementioned bounces in the session. Tune and de-ess and re consonant and time to your hearts content. Clear some wall space for the ensuing plaques. Repeat.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1372277866624192623",
    "author": "BatMeckley",
    "date": "2025-05-14",
    "content": "Honestly? I’ll just start with slapping the old autotune up on it. Live bass, synth bass, whatever. If it’s better it’s better. If it’s not I bail on it and just let it be. Occasionally like Eric said you have to watch thirds, etc, (the old Runnin With The Devil detuning the b string trick) but that’s not that unique to just bass notes, that’s a bigger issue in general. \n\nBut for starters, just try slapping a bass autotune on the bass and see what happens.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1410016061750902917",
    "author": "oaklandmatt",
    "date": "2025-08-26",
    "content": "Also: A great vocal warm up from a great vocal coach will do a lot of things physically for your instrument, plus you're essentially learning the fundamentals of scales and runs. This will replace the thing you're already doing, while covering a lot more ground.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "812301647614836776",
    "author": "rae",
    "date": "2021-02-19",
    "content": "Not to do with recording but something I found interesting in terms of mixing backing vocals was the approach taken with John Mayer’s single ‘New Light’. Super pop-y vibe but they used autotune as an instrument and flattened his backing vocals to sound almost synth-y, this blew my mind and made me stop hating on autotune so much haha. Interesting lil 8 minute vid on YouTube where he explains this process (he starts talking about the backing vox at the 6 minute mark if you wanna skip ahead).\n\nhttps://youtu.be/u03DZEaSewM",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1269137147051376774",
    "author": "Josh",
    "date": "2024-08-02",
    "content": "Not much different than using a preset. I remember I was asking a dude about a record he worked on and I was super curious about the vocal chain and processing. He listed out literally $30k in gear and then goes “just start with the punk rock vocal preset in decapitator” and it was the majority of the sound I was hunting for hahaha.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1280552306773065858",
    "author": "Eric Martin",
    "date": "2024-09-03",
    "content": "Your gonna pay either way when integrating a patch bay or loop switcher, effectively doubles the cables a lot of the time",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1372064018042322985",
    "author": "hyanrarvey",
    "date": "2025-05-13",
    "content": "I track bass with Autotune on hahaha",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472999265046626315",
    "author": "spectrummasters",
    "date": "2026-02-16",
    "content": "Yeah man send me an mp3 for sure \n\nI’ll put like my top three recommendations for a great engineer demonstrating vocal processing for ya a bit later tho . \n\nYou should be able to spot the similarities between their approaches",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "836116314699333664",
    "author": "jonmatteson",
    "date": "2021-04-25",
    "content": "Alterboy, Auto-Tune,  Ultrapitch, and doubler are great for these effects!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "868496524504608849",
    "author": "Zack Hames",
    "date": "2021-07-24",
    "content": "Everything @peterlabberton said. Clip gain is pretty clutch for this too. Other options: De-esser, especially if it’s targeted, or dynamic EQ.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1264405387680157697",
    "author": "h3x",
    "date": "2024-07-20",
    "content": "Sup everyone. Just wanted to check in here for some morale/mental advice, and possibly some technical advice. \n\nBasically ive been workig with this artist for almost a year now, and he’s by far my biggest client (both how often he books me and how many listeners). We’ve grown really close personally, but we are currently in the midst of doing a mix for his favorite song hes done yet. He expressed to me that he is frustrated that after all this time, i am still unable to get in the ballpark for his vocal mixes within the first handful of versions. He expressed that he’d rsther a much more formulaic copy and paste approach, but i explained to him that every song is different, etc etc. in the end, we ended up importing the vocal chain from one of his older songs and it definitely sounded better, having me questioning my skills with his stuff and leaving me feeling a bit embarrassed because i worked for 2 hours on the other vocals that sounded worse (he is sending me raw untuned vocals). Lemme preface this by saying that i dont have this issue with any other client ever, and ive gotten amazing feedback from our final mixes that we’ve put out, just not the inital ones. Anybody ever struggle with this before? Not sure how i should take this and how i can be better for the sake of my work with him and others.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1353829293880508446",
    "author": "itaylerner",
    "date": "2025-03-24",
    "content": "That all tracks. I usually don’t get too hung up on gear but helping some folks make some vocal chain decisions and it can be a real head scratcher. Without really being able to try a bunch of options it seems takes quite a bit of discernment and hope haha",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1372258694263476306",
    "author": "Eric Martin",
    "date": "2025-05-14",
    "content": "if the bass is playing a third make sure you’re tempering the tuning, and “in tune” third is not melodyne or autotune “in tune”\n\nunless you can choose tempered tunings that I’m not aware of yet in my novice use of either of these.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "838634081536311336",
    "author": "Slow Hand",
    "date": "2021-05-02",
    "content": "I guess it really comes down to aesthetic intent doesn't it? If you're making Knxwledge/Madlib type records that are already marinating in vinyl artifacts then what's one more crispy glaze over the top? It's probably an asset at that point.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "842188371488145409",
    "author": "thejadenmejia",
    "date": "2021-05-12",
    "content": "I usually just record vocals! Most artists that come in are artists bringing in mp3s. Sometimes I’ll record electric and acoustic guitars and I’ve tracked drums before. I usually do an hourly rate, but I find downsides to that method at times. My vocal chain is pretty good and I’m adding a Sony C800G to my mic locker. I’ve had recording experience for 4 years. Started when I was 15 and mentored under a local engineer. I have been charging $50/per hour. And I like your idea of the recording-mixing deal. Even still, I’m just at a loss on what to charge for mixing and recording. 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "857997853912858706",
    "author": "mixedbywong_my",
    "date": "2021-06-25",
    "content": "Is there anyone who'd help me listen to a vocal recording and tell me whats wrong with it ? been working with a long time collaborator and i keep getting vocals that sounds a bit too clipped but they're not actually clipping when i look at the waveforms. is it possible if i pm someone the clip if they're be kind enough to have a listen .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "858143558505463818",
    "author": "peterlabberton",
    "date": "2021-06-25",
    "content": "The only thing I’ll ever document in a tracking scenario is a vocal chain. This is just in case a lyric or delivery changes and we need to come back and punch a line or something. But personally my attitude is just move quick and redo it if you need to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "860497103750168586",
    "author": "Moodydodi",
    "date": "2021-07-02",
    "content": "Guys I love the stylistic choice gunna and playboicarti do with autotune is it possible to use autotune in a different key from the instrumental is and still sound good",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "860584630422732871",
    "author": "Zack Hames",
    "date": "2021-07-02",
    "content": "Fancy by Iggy Azalea hits me the same way as far as polytonality is concerned. Not really answering the autotune question but it’s a similar result.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "939932522949783593",
    "author": "thejadenmejia",
    "date": "2022-02-06",
    "content": "I read about someone chaining multiple preamps to each other in a single vocal chain. Would that not create phase issues?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "940747807105630288",
    "author": "ALXCPH",
    "date": "2022-02-08",
    "content": "Noice 🤘\nSo if i understand this Right.  mixing a beat in one project leaving a bunch of headroom and then running a separate vocal session over that 2 track and doing all your vocal processing and mixbus processing in that project, would be the same as pulling the vocal into the instrumental session and mixing the whole song with every track separated out. (This is in a perfect world where the beat is mixed perfectly and has the right amount of space for the vocal). I see this is how a lot of people are running sessions and how they are mixing demos, to either release or send out to mix & master. I’m wondering if it’s disadvantageous sonically to the mix rather ran keeping everything in one session besides control ofc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "943850338266542091",
    "author": "ALXCPH",
    "date": "2022-02-17",
    "content": "Only crash I has was when copying  a multiple izotope plugins from one track to another(part of a vocal chain)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "944998740643676211",
    "author": "sloth",
    "date": "2022-02-20",
    "content": "Hello people,got a question about setting auto-tune.If the harmonic content  of a certain instrumental has a fair bit of chromatic movement , reaching  out of the home key,not talking really crazy stuff but perhaps something like  I major 7/I minor maj7/vii min 7/iii,what would the best way to choose a key in auto-tune ? Do I go with what auto-key settles on and adjust the retune speed/humanize settings?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1069280447030378678",
    "author": "austenballard",
    "date": "2023-01-29",
    "content": "The only comparable situations I have personally had were when something in the other person's vocal chain wasn't PDC'd properly, or they tracked at a different sample rate, and the file that came back was misaligned. But that's just my own limited experience.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1217668186820968489",
    "author": "JakeTB",
    "date": "2024-03-13",
    "content": "Yea guess I should add some context\n\nI’m in Long Beach, CA now. My wife and I are moving out of our rental home in a couple months.\n\nI’ve been using an extra room in our house, but for lots of reasons it seems like that it’ll be better to separate home and work. Looking to stay in the south end of LA county or north end of Orange County.\n\nI’m mostly mixing, and doing a bit of vocal recording as well. The issues I’m running into are:\n\n1) Space. I really only need 200-400 Sq Feet, most spots I’m finding are quite large.\n\n2) Budget. I don’t know what’s realistic since I haven’t done this before, but I’d love to keep the rent close to 1k. Even less would be a dream.\n\n3) I’m not sure what flags to watch for or what type of space search would be effective. I’m kinda blindly looking at office and flex spaces online.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1254805320002306139",
    "author": "h3x",
    "date": "2024-06-24",
    "content": "Anyone wanna share some tips on how u guys would go about mixing completely raw vocal recordings (no outboard pre or compression) straight into an apollo? Ive done this tons of times but would love to hear everyones workflows for this!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1270839304184402051",
    "author": "FlugeBluge",
    "date": "2024-08-07",
    "content": "Not really unfortunately. I'm feeling confident with beat detective, and pitch correction, but vocal timing and instrument editing are eluding me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1274769085527359539",
    "author": "spectrummasters",
    "date": "2024-08-18",
    "content": "What I get from my sub groups is , once I’ve balanced gainstaged and shaped the tone of the individual elements of a mix , they arrive into groups . Then at the group level I can create parallels , do group automations and create more or less crosstalk between the instruments at a group level (via side chaining comps . Gates etc ) I like to do tiny side chains between the kick the bass and the music bus depending on how I want the groups to play together . I’ll do a tiny side chain between the vocal bus and the music and drums groups . (I’m talking 0.5db   , broad q At pertinent frequencies ) this isn’t corrective it’s just to create play/movement at a group level . \n\nMy groups usually are kick . Drums . 808/bass . Music . Vocals . Fx .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1279499262635413575",
    "author": "youngteam",
    "date": "2024-08-31",
    "content": "oh to add one idea to the pile, a focusrite isa 220 if you can find a used one has pre, eq, comp and de-essing. https://losangeles.craigslist.org/wst/msg/d/alhambra-focusrite-isa-220/7769077927.html",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282760337900179556",
    "author": "BoozleBAM",
    "date": "2024-09-09",
    "content": "Reaper has \"ReaVERB\" which doubles as an ir loader.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1297640002695462953",
    "author": "EliHeathMusic",
    "date": "2024-10-20",
    "content": "For manual de-essing do you prefer using Melodyne over clip gain and RX? Or do you do multiple passes using different tools over the course of working on a production/mix?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1297659923164958761",
    "author": "BatMeckley",
    "date": "2024-10-20",
    "content": "It’s just so intuitive and so easy, and when you have all the doubles and harmonies lined up you can really match pitch and timing to comically tight tolerances. Earlier on in my career I actually fucked up a project with Larry Klein because I tuned and timed the harmonies too tight and it collapsed the stereo field. It’s very easy to get things so locked in in standalone that you can get everything to phase.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1297660528512073738",
    "author": "itaylerner",
    "date": "2024-10-20",
    "content": "I find myself needing to adjust autotune settings on BVs for that same reason - the weird phase interaction when layered vocals are tuned too similarly is just awful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1298678188385374361",
    "author": "chrissorem",
    "date": "2024-10-23",
    "content": "You mean tune the lead before you track doubles and harmonies?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1298679035601354802",
    "author": "chrissorem",
    "date": "2024-10-23",
    "content": "Oh copy that! Both honestly I try to comp and tune before moving to doubles ect. I can usually comp and tune a vocal in 10mins  but the scenario I was describing above would be me receiving vocals I didn’t record",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1298679328963432508",
    "author": "chrissorem",
    "date": "2024-10-23",
    "content": "I’ve honestly tuned the lead at the same time as  tracking the doubles before lol but the song was easy and we were working at lightning speed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1302829196636061768",
    "author": "T1NGA",
    "date": "2024-11-03",
    "content": "There’s another thing I ‘ve been thinking lately which is tuning with autotune, not talking about the graph mode but the advanced tab for the chromatic mode in which you can remove some notes from the scale.\nHow often do you find yourselves doing this ? \nIs there a way to nail it everytime ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1341084289441202208",
    "author": "Josh",
    "date": "2025-02-17",
    "content": "And just because they’re dark doesn’t mean the high end isn’t analytical. I could finally hear exactly what my de-esser was doing and low passing became more important. But as far the “profile” of the high end, it rarely translates for me if Im sent a session where I have to really sculpt the high end material in it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1347909174733836400",
    "author": "BoozleBAM",
    "date": "2025-03-08",
    "content": "Are you building up the guitars completely before you move on, Ryan? -Doubles, solos etc?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1372266798862434304",
    "author": "sinaigimenez",
    "date": "2025-05-14",
    "content": "Is that a go-to technique for you when working with live bass? I assume you wouldn't use it with synth bass—unless we're talking about analog synths, right?\nI imagine it's genre-dependent as well.\nAlso, what's your favorite tool for that—Melodyne or Auto-Tune?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1410339609094651945",
    "author": "Yu Justin K",
    "date": "2025-08-27",
    "content": "Thank you Matt and Beck for the advice!\nI've also been recording all my practice sessions with an R84 (trying to hear myself as un-hyped and as transparent as possible), listening back to them and taking notes during breaks, so I'm glad it sounds like I'm heading relatively in the right direction.\n\nFinal question: is there a point where you can be singing too much and do more harm than good to your vocals (as my end goal is not really going for a totally thrashed and raspy voice)? Is that the point of having daily vocal warm ups, where they're meant to keep you going for 4+ hours of singing when needed? Just trying to be pretty cautious of how I start out so I don't potentially build harmful habits with singing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1437135305164718313",
    "author": "Zack Hames",
    "date": "2025-11-09",
    "content": "I pan the first one hard and then double with the other panned opposite. I may turn up the current one a slight amount.\n\nAlso when I do the doubles I always have to turn both down a few dB to be able to hear everything else.\n\nI’m also super used to doing it, so I don’t know how else I would do it. I just make micro adjustments to the levels as needed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472981029831573779",
    "author": "revolution",
    "date": "2026-02-16",
    "content": "any idea how vocal effects that dont involve panning can end up making a vocal sound not just phase-y, but also like its literally being panned in the stereo field?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1472996794123423845",
    "author": "spectrummasters",
    "date": "2026-02-16",
    "content": "(Re people talking about vocal processing )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472997833383870566",
    "author": "spectrummasters",
    "date": "2026-02-16",
    "content": "I can think of a few approaches to vocal processing that could really give you some ideas / insights",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  }
]