[
  {
    "id": "1367334864331997266",
    "author": "cian riordan",
    "date": "2025-04-30",
    "content": "Mix revision V14\nSends MP3 ref for mix approval\nClient is stoked, says it’s done.\nClient imports mp3 into *untitled*\nProceeds to Chops bridge in half, varispeeds whole song down 10 cents\nClient responds to mix approval email 4 months later — “hey, check this out - can we master this?”\nPour shot.\nTake shot.\nKill shot.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246052521718583338",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "Now convert to the following and what do we see/hear happen with our beautiful transition\n\nMP3 (Fraunhofer and Lame codecs)\nOGG Vorbis\nAAC/M4a\nALAC (Apple Lossless)\nFLAC",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1263976479885230131",
    "author": "Josh Bowman",
    "date": "2024-07-19",
    "content": "I switched my default application for .wav files to quicktime player a while ago because i was sick of accientally double clicking them and having them add to my apple music library",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042543183445364848",
    "author": "Nomograph Mastering",
    "date": "2022-11-16",
    "content": "Not everyone has level norm on. Spotify in smart TV does not have level norm. Spotify on web browser does not have loudness norm. Spotify and other DSPs can and will change the targets so you CANNOT depend on them. So what to do, you move with the herd. Listen to the Hot 100 with level norm turn off and tell me where it is. That’s where you want to be, or the equivalent for your genre",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360648572923678992",
    "author": "Paris Lee",
    "date": "2025-04-12",
    "content": "I’m not really qualified to speak from any technical standpoint of anything discussed here, especially among the giants and don’t want to look stupid …but as someone who DJ’d House, Techno, Drum and Bass etc back in the late 90’s as a teenager in LA on Vinyl (I’m 45 now), watched the transfer to CD’js…(no idol of mine has touched a vinyl in 20 years) and masters for modern EDM artists, I feel like I can speak with some authority about, I dunno, *something*…Back in those days, I guess Ill just say there were a lot of factors that influenced what sounded so good about that era, and what producers did then. The dynamics, combined with the *type of low frequency* content of those genres at that time, along with DJ’s who knew what the fuck they were doing, along with sound crews who worked the rave circuit and were continually hired and worked with the same DJ’s, all contributed so much to this magic rave Vinyl era.\nThere’s nothing that touched those deep kickass lows back then, But That was the style! \nSo much has changed. Producers back then got their loudness from pushing analog desks into the red, Simple Mackie desks, stuff like that. But We moved to an all digital world. I remember when the first pioneer digital DJ mixers came out, I’d put a vinyl on and just be like…this is shit! where’s my headroom?!?! the frequency distribution of the music has also changed, DJ’s also got more concerned with jumping up and down and clapping rather than mixing and gain staging. Clubs started putting limiters on the systems \nMost of these kids doing EDM at high levels-really don’t even need ME’s at all! Their mix busses are so super complex. If they took that stuff off, I’d be totally lost. But they like a little analog processing in a lot of cases. Loudness, they *don’t need*\nClipping, limiting, whatever, it’s the modern thing- If i can help I can- and I tell them not to change a thing- just back off the limiter until the exact moment where the track loses the vibe. Then I go.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1367850966677717122",
    "author": "Elaine Rasnake",
    "date": "2025-05-02",
    "content": "What wild timing! I just had a podcast interview with Chris the other day haha big day for NJ\n\nhttps://open.spotify.com/episode/48Hqo0cA5QHdCa8grra5IL?si=Uh4132FES1KFDA3enoAimQ",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038246369732870204",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "There we go. The records are often so clipped that Codec clipping is not a problem. Like \"Is this pot hot?\", \"I can't tell because the building is on fire\"",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068212926667837631",
    "author": "Nomograph Mastering",
    "date": "2023-01-26",
    "content": "Below I am sharing something that I send to my mastering clients when they inquire about targeting LUFS levels for streaming services. I hope it is helpful to some readers. Discussion is welcome.\n\n\nRegarding mastering to streaming LUFS loudness normalization targets, i.e. -14 LUFS - I do not recommend trying to do that. I know it's discussed all over the web, but in reality very few people actually do it. To test this, try turning loudness matching off in Spotify settings, then check out the tracks listed under \"New Releases\" and see if you can find material that's not mastered to modern loudness for it's genre. You will probably find little to none. Here's why people aren't doing it:\n\n1 - In the real world, loudness normalization is not always engaged. For example, Spotify Web Player and Spotify apps integrated into third-party devices (such as speakers and TVs) do not have loudness normalization. YouTube is normalized but \"YouTube Music\" is not normalized. Apple Music's web player is not normalized. With normalization off, your -14 LUFS track will sound much softer than most other tracks.\n\n2- Even with loudness normalization turned on, many people have reported that their -14 LUFS masters sound quieter than other tracks in playlists.\n\n3 - Some streaming services have different loudness targets (Apple's is -16) and there's no guarantee they won't change their loudness targets again in the future. For example, Spotify lowered their loudness target by 3dB in 2017, then in 2021 they switched measurement from ReplayGain to LUFS. Also, in Spotify Premium app settings you find 3 different loudness settings; \"Quiet, Normal, and Loud\". Now AES is recommending that all music streaming services switch to -16 LUFS. It's a moving target. \n\n4 - Some people suggest making multiple masters at different levels. But digital aggregators (CD Baby, etc.) generally do not allow more than one version of each song, so you'd have to make separate paid submissions.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1445937143817044058",
    "author": "cian riordan",
    "date": "2025-12-03",
    "content": "We call it getting 'Spotify Wrapped' around here.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "974850501634060358",
    "author": "Rollmottle",
    "date": "2022-05-13",
    "content": "nah, fuck -1 or -2. theoretically the lower the ceiling, the less risk there is of intersample peaks happening upon conversion to MP3 or some other lossless format streamers use to stream audio to your device. even if there are ISP's, they usually light up a meter but are inaudible. i live at -0.5db for most everything. sometimes i'll go to -0.3db if it's something that is pop oriented (this is where i landed for @thejadenmejia's single for example). i think a lot of the panic about it is overblown. in the real world, clients like their shit loud.\n\nas far as distro goes, i know some are starting to accept higher res files or even accepting multiple files. my deliverables have always been 96/24 and 44/16. I've recently started including 44/24's. i've always discouraged submitting anything other than 44/16 because who knows what some of these services are doing with SRC and dither, but i think with the advent of high res and lossless delivery, you are well-advised to submit the higher bit-rate files nowadays. all that said, with something like 44/24 you are probably pretty safe from getting your shit munched down-funnel.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038276961539215442",
    "author": "cian riordan",
    "date": "2022-11-04",
    "content": "Everything about the Spotify/streaming debacle is both hilarious and terrifying. It seems futile to try and keep up with streaming standards & deliverables. Best to put that energy elsewhere... hopefully somewhere where it'll actually be put to good use.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041943101549322240",
    "author": "cian riordan",
    "date": "2022-11-14",
    "content": "This is well said. Spotify does a lot of things right, but imagine if you had all of that curation and UX with a company that prioritized fair pay for the content they peddled through their service.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099073997322330192",
    "author": "noahc",
    "date": "2023-04-21",
    "content": "Bro the Dropbox link doesn’t sound as loud as Spotify can u turn it up",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034584269114310657",
    "author": "hebakadry",
    "date": "2022-10-25",
    "content": "You guys...streaming companies don't make money off of music.  If that was the case, spotify would have created a platform that was profitable for artists from the start.  That's so not the point of this.  It's data...NDA deals with majors, corporatised playlisting and fucking podcasts.  It's not about the music...ever.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085625298336362607",
    "author": "cian riordan",
    "date": "2023-03-15",
    "content": "I always intentionally send the ref as an MP3 so the ME *doesnt* use it to master.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1125840675670343910",
    "author": "Rollmottle",
    "date": "2023-07-04",
    "content": "i have mastered from an MP3 before. granted, it was a demo anyways so fidelity wasn't an issue, but providing the MP3 was high quality enough, any tradeoff might be marginal. you'd have to listen in context to see if it actually mattered. is the fidelity of the one song going to make or a break the record so much so that you'd have to redo days worth of work? seems unlikely. \n\ni'd be concerned less about ruining the record and more about ruining whatever trust i've built with a client. i'm not intending to pile on you here, but i'd be investing in some data backup plans so you're not putting yourself and your clients into this position in the future.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1268984896865701939",
    "author": "Iwan Morgan",
    "date": "2024-08-02",
    "content": "Just uploaded the first one, i’ll try and get the other formats done over the weekend and then I guess it’ll take a few days to go live.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1125907710077063231",
    "author": "Bryan DiMaio",
    "date": "2023-07-04",
    "content": "mp3 wrapped in a wav is going to sound like the mp3",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243713756236611665",
    "author": "cian riordan",
    "date": "2024-05-24",
    "content": "What does everyone do when Spotify/Apple/Whatever changes their loudness algorithm?",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255016611258302489",
    "author": "eschirtz",
    "date": "2024-06-24",
    "content": "I hear you Ruairi, and ultimately you gotta make your own call on this. \n\nBut I just wanna reassure you that our business is built around serving your type of workflow. Even if 99% of users don't give a shit about the perfect playback, we do. That's why we have that \"lossless\" switch. We'll never switch to AAC due to bandwidth issues.\n\nThe \"constant upgrades\" are often due to the ever changing landscape of browsers. Each client is often on a different browser, different device and different internet connection. It's our job to understand that landscape and push fixes to ensure we get perfect playback across all environments. \n\nThat's part of the reason we built the iOS app, to be able to provide a more consistent playback experience when browsers themselves are the limiting factor, and so that clients can listen offline to take the network out of the equation. But I totally understand that you can't really ask a client to install another app on their iPhone. \n\nTo my knowledge, Samply is still the only platform that lets clients stream full resolution lossless AND gapless track transitions in a browser. It's a really tough engineering challenge, but ultimately the backbone of our entire business. We're committed to continuing to solve this problem and evolve with the technology available.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382465497294966925",
    "author": "Edsel Holden",
    "date": "2025-06-11",
    "content": "I will share words that are not mine (these words belong to @Nomograph Mastering )\n\nContext is important here. This is an email that Nomogrpah wrote back to a client that said \"Hey I love the master so much but I am a bit worried about how much it might get turned down ?\" or something to that effect \n\nResponse was \n\n\"Glad you are feeling the master!\n\nRe the level thing that is a complicated question. A few thoughts\n\nNot everyone has loudness normalization turned on. It also doesn’t exist on Smart TVs, many streaming web interfaces etc\n\nThe different services all have different level norm targets (and even different settings within just Spotify) - and they change pretty regularly\n\nIn terms of absolute level when normalization is active what matters is arrangement (dense mixes sound quieter than sparse/spacious mixes), EQ (bright/mid range forward mixes sound louder than dark) and distortion levels (clipped/distorted mixes feel perceptually louder than clean). If I make a master a dB louder in mastering using just limiting for example, they just turn it down a dB more when it’s level normed.\n\nSo what does all of this mean? It means that every song has sweet spot where the EQ/tone, the arrangement and the overall clipping/limiting level works best and communicates the intent. That’s what we aim for.\n\nYou can use a site like loudnesspenalty.com to see what will happen but it will just drive you crazy and the only real way to meaningfully alter the result is to change the arrangement/mix or overall EQ a lot. On release day you can find 1000 records that are louder than yours if you want to.\n\nIf being the loudest is the intent - game everything listed above and you can “win”. If doing your unique thing and communicating a song and a performance is the goal then I think you are there!\"\n\n(posted with Nomographs permission)",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396915457747062914",
    "author": "kylem",
    "date": "2025-07-21",
    "content": "I'll take option 4C with extra brightness please. Hold the loudness, and can I get a side of -14 with that (for spotify)",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072387927180582953",
    "author": "peterlabberton",
    "date": "2023-02-06",
    "content": "Yes it absolutely will. One ME who will remain nameless (and not the one we all love to shit talk) went through many rounds of revisions on sequencing/spacing and just didn’t get it right. There was one semi-odd fade out fade in overlap moment but I even went so far as to make an mp3 of the *exact* timing we wanted and they still didn’t follow it. This has seemed to be particularly true with folks who over-rely on their management or other go betweens to get notes. Like, CALL ME.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085626472301076672",
    "author": "Nomograph Mastering",
    "date": "2023-03-15",
    "content": "But mastering from an MP3/AAC etc very much is",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211005603066028042",
    "author": "Nomograph Mastering",
    "date": "2024-02-24",
    "content": "So the first thing I recommend to everyone wondering about ceilings and true peak is to use RX to make some MP3, AAC and Ogg Vorbis. When I test I’ll use low bit rates to really make the uglies pop. I also will test with the Apple droplet and using the Fraunhofer codec in Sonnox’s Codec toolbox. Make a bunch and look at what happens to your peaks. Now listen to what happens",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217160366945992876",
    "author": "Rollmottle",
    "date": "2024-03-12",
    "content": "320kbps MP3s are pretty indistinguishable from WAVs IME",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1253772400495956069",
    "author": "Berlin",
    "date": "2024-06-21",
    "content": "the artist trying to upload one song 👆",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038240711352533032",
    "author": "Zach Hughes",
    "date": "2022-11-04",
    "content": "So this is straight from Spotify's website and obviously nobody really abides by it but I just want to know if theres a 'why':    *Target the loudness level of your master at -14dB integrated LUFS and keep it below -1dB TP (True Peak) max. This is best for lossy formats (Ogg/Vorbis and AAC) and makes sure no extra distortion’s introduced in the transcoding process.\nIf your master’s louder than -14dB integrated LUFS, make sure it stays below -2dB TP (True Peak) to avoid extra distortion. This is because louder tracks are more susceptible to extra distortion in the transcoding process.*",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041081647786885120",
    "author": "Nomograph Mastering",
    "date": "2022-11-12",
    "content": "Or we could just make songs that are compelling and not have Spotify decide how our verses sound?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041085525018300427",
    "author": "Rollmottle",
    "date": "2022-11-12",
    "content": "Apple and Amazon are durable businesses. Spotify is not. Netflix will go under in the next 10 years too IMO.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042587304222544002",
    "author": "Zach Hughes",
    "date": "2022-11-16",
    "content": "A few thoughts on all this.. I agree with @Nomograph Mastering that the top of funnel for Spotify isn't bringing in enough money to overnight increase the amount music rights holders are paid. However, I am not convinced Spotify couldn't raise their subscription price in certain markets. Netflix has successfully raised their prices many times over the years. I've been paying the same price for Spotify for close to 10 years (maybe it increased a dollar at one point, but not sure).\n\nI do believe Daniel Ek and Spotify have earned some ire from the music community. Ek is a billionaire and the average Spotify employee makes close to $110k / year. You would probably need around ~1.5 million monthly listeners and ~3.5 million streams / month to earn an equivalent amount (master recording side sans publishing and no other income stream). There are maybe a little over 6000 artists that have that large of a listenership in the entire world out of conservatively 5-7 million artists on the platform.\n\nThere are many things Spotify could do to improve economic outcomes for artists / musicians. Here are a few in no particular order:\n1) Allow artists to link to their own website. Believe it or not we can't do this. Your own website is the one piece of online real estate that you actually control. On Spotify, IG, Tiktok, etc... you are playing in someone else's sandbox.\n2) Allow artists more control over their profiles and the way they are laid out. One thing that infuriates me is how Spotify sorts albums by popularity rather than release date. I would like to change that. This would be beneficial to promoting newer releases. As well all external links off of Spotify are virtually hidden on the 'about' page at the bottom of your profile making it harder for fans to follow you where you want to be followed.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085626852309213214",
    "author": "Nomograph Mastering",
    "date": "2023-03-15",
    "content": "The killer is that the file that they will send back will sound fine…..until it goes to DSPs and goes through another round of data compression (more MP3/AAC/OGG) and *then* it will be all swirly birds and chirps and ugly artifacts",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217160507845382305",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-12",
    "content": "64kbmps MP3 is the sound of my Limewire childhood. Nostalgic",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220564408653058060",
    "author": "Slow Hand",
    "date": "2024-03-21",
    "content": "Fun fact: Ligeti does this in *Lontano*. There's a point where the entire orchestra fades away and it's nothing but a low bowed D on the basses with a single piccolo at the top of it's register: \nhttps://open.spotify.com/track/7B8CUAgtqaQXc5zq0yCcUK?si=351ceb246e5d4fb5",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1236712324413526188",
    "author": "Nomograph Mastering",
    "date": "2024-05-05",
    "content": "With extremely loud master prone to post codec clipping an ADM will sound better",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293416855066775606",
    "author": "Slow Hand",
    "date": "2024-10-08",
    "content": "I was just rudely reminded that Distrokid - at the very last step of uploading for distribution - will offer to \"master\" your track for a surcharge and call it \"enhanced\". And folks, the audio preview of the \"enhanced\" version is not pretty. Be careful out there.",
    "reactions": 4,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1293433942153629818",
    "author": "Berlin",
    "date": "2024-10-08",
    "content": "i got hip to it when one of my artists was like what happened to my song? it’s quieter than everything else on spotify? and i was like wutttt and went and checked it and sure i enough it was quiet as fuck with normalization turned off… really had me scratching my head and so I had to do some digging to figure out what happened.. and then the next following couple months every other release that i had master from the previous couple months was quiet because they checked that damn check box.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368338410829385879",
    "author": "Nomograph Mastering",
    "date": "2025-05-03",
    "content": "I sometimes think about the song as a life of it’s own, a force or a message trying to make it’s way through the minefield of Spotify, loudness wars; band fights, A&Rs with bad ideas, algorithms etc",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370069305118429377",
    "author": "Paris Lee",
    "date": "2025-05-08",
    "content": "At least human Playlist curators at Spotify give no fucks about any of *whatever* that sheet of paper is talking about. They typically do care quite a bit about not having the old ‘dead air’ thing and having long silences that don’t let them get into the next track fast, and maybe if you slip them a bag of cash lol. But definitely no long gap at the end",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983263282653724692",
    "author": "rse",
    "date": "2022-06-05",
    "content": "also keep in mind that loudness normalization is not as common as it seems. Spotify's loudness normalization doesn't work on most external devices, stuff like tv's, Sonos speakers etc. Like it has been said before, do what's right for the song.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070462359358931035",
    "author": "Rollmottle",
    "date": "2023-02-01",
    "content": "Samply is a purpose-built tool for audio professionals that allows me to provide clients (Artists, Mixers, etc) a way to experience their record as they and their audience would consume it via a custom player. The player is fully sharable,  includes artwork and track titles, etc. Feels like a private Spotify for somebody and doesn't require them to install or download anything and helps to make their record feel \"done.\" Dropbox or a link to a .zip can't do this.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211006565851734026",
    "author": "Nomograph Mastering",
    "date": "2024-02-24",
    "content": "Luckily the kinds of music where codec clipping is the most likely (slammed modern pop/rock/hip hop) is also the place where you are the least likely to hear it. And the genres where it’s more critical to get it “right” often have a little legroom for lower levels",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217594198103035954",
    "author": "Nomograph Mastering",
    "date": "2024-03-13",
    "content": "Even with same eq it’s got to be downloaded, is often out if sync, RX, SRC, set up, listen, tweak, print, SRC, QC, bundle and upload",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1253741624282972170",
    "author": "Berlin",
    "date": "2024-06-21",
    "content": "“Just download cyperduck and enter this address and PW to upload”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308448394779561985",
    "author": "Conah Tucker",
    "date": "2024-11-19",
    "content": "Hey folks! Following on from this, had a bit of time today to do some more testing, I've done a pink noise test today. 1 track 3 different loudnesses 5db apart. Uploaded the different loudnesses separately too.\n\nFinds: (please note this is off of web TikTok, app TikTok tests will come soon)\n• -4.6db overall (planning on testing this more in depth, but occurred 4 times on the 4 different audios I uploaded)\n• Int LUFS -7.4 down to -13.3 (for this specific case).\n• 5db differences remain.\n• Brickwall eq at 16khz (this was tested on many different videos).\n• The different levels uploaded separately did not change their respective loudnesses compared to the full noise track. So dynamic sections of track shouldn't boost if uploaded as a separate sound to TikTok.\n• No compression.\n• General audio quality does drop.\n\nThings that come to mind:\n•  Common 3rd party video editing apps (such as capcut) and how they affect audio\n• The level control TikTok users have and how that affects audio (in terms of peak/loudness and referring back to the -4.6db peak mentioned earlier)\n\n\nI'll run some more tests when I get the time to.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331343753725743104",
    "author": "masteredbyjack",
    "date": "2025-01-21",
    "content": "This is honestly something to be aware of -- a lot of people never play digital master files at full volume off their phone -- they are comparing to something like Spotify or Apple which turns stuff down on normalization (and thus has peaks that are not near zero). Seems natural to me to blast a master you get back to enjoy it -- so it can be easy to just explain that, people get it once you do\n\nCan also be an issue in cars, etc anything where the added level will drive stuff harder than what they are used to listening at\n\nThe impetus to be concerned is absolutely something I empathize with on their end (even though it's pretty rare I get that note), usually just a careful explanation leading with love and understanding is enough to make the lightbulb go off",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337593114621382740",
    "author": "Rollmottle",
    "date": "2025-02-07",
    "content": "i stream Apple Music extensively losslessly without downloading over a mobile connection without any issue. it's certainly easier if you own the full software stack. relying on a third party is where it gets hairy.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350494794484547635",
    "author": "Ted Whitten Media",
    "date": "2025-03-15",
    "content": "Tried chatting with Spotify Support. Not going well so far. 😂",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1373380685296963615",
    "author": "conordalton",
    "date": "2025-05-17",
    "content": "in other news, youtube quietly updated it's recommended sample rate and bit depth to 48kHz 24bit for uploads\n\nhttps://support.google.com/youtube/answer/6039860?hl=en&fbclid=IwY2xjawKVwMZleHRuA2FlbQIxMABicmlkETFMdHhKcGFhRlVjUlZoMWswAR7amwrfc1sBtibK2qtyfRF8ocf8cRNx14dkP8ASLwhLoS8IHxGKT8Kv808GFg_aem_caeJimsytYUJ-9s5Hqo6PA",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377027854503510066",
    "author": "noahc",
    "date": "2025-05-27",
    "content": "I gotta share something. there are some weird things happening in Hawaii. \n\nWe have some regular non music people, uploading 100% REVERBED out versions of already made songs onto YouTube and labeling it “Song Name” (EQ Version). What they’re basically doing is throwing a song in GarageBand, drowning it in reverb with some bass taken out. \n\nThe goal of these versions IMO is to play music as loud as possible at the beaches with their windows rolled down. Almost sound system competition lol. Some local songs here  got a little viral from it, and now today I’m being asked to master a regular and “EQ” version so that way their song is already gonna get played by their target audience. 😂  \n\nIMO this is STUPID AF and a small local isolated thing. But I AM trying to understand it to learn A market, but the solution can’t be I need to start adding more reverb to catch peoples ears around here. 😂",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035591691572351058",
    "author": "Nomograph Mastering",
    "date": "2022-10-28",
    "content": "1) Do individual tracks from this project need to compete on a Spotify playlist level? (often not with long projects)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038250586195370054",
    "author": "Zach Hughes",
    "date": "2022-11-04",
    "content": "Well when a noob uploads a track under -14 LUFS with peak levels at or above -1 dbFS Spotify turns it up to -14 and slaps a limiter on it. There you go. Spotify mastering",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038489762161504338",
    "author": "Will Melones",
    "date": "2022-11-05",
    "content": "All I know is that a lot of folks think Spotify doesn’t have a limiter—it only turns *down* loud masters when normalization is enabled. In fact Spotify definitely DOES have a limiter, and if you deliver a master below -14 LUFS it will be turned UP, and anything over 0 will be smashed (only when normalization is enabled).\n\nThere is also a 3-level setting for volume when normalization is on, and the app tells you that sound quality *will* be affected at the loudest setting. Not sure how this works in real life.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041082004030115871",
    "author": "Nomograph Mastering",
    "date": "2022-11-12",
    "content": "Spotify will be no more probably within 5 years, if that is the timeline for your art (and it is for some pop) then play the game, if not consider why you would optimize too much for one platform",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041088524788699269",
    "author": "ALXCPH",
    "date": "2022-11-12",
    "content": "i think the two major platforms for music, that we eventually will end up at, once all these massive companies become so big that they become the rulers of the world and monopolise everything, is (Google)YoutubeMusic and Apple Music.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041951926318800926",
    "author": "Zach Hughes",
    "date": "2022-11-14",
    "content": "For context if you have a song with 1,000,000 or more streams on Spotify that track has performed better than about 98% of all tracks on the entire platform. 1 mil streams pays about $3k if you own the entire master. So your song is in the top 2% performance of all released songs ever and you make $3k. Cut that into a quarter if you're in a band. Minus 15% to the manager. Minus 3-5% to the producer. Heck maybe even your distributor takes a cut. Granted I am only talking about the master side not publishing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085623018455310398",
    "author": "popaganda.",
    "date": "2023-03-15",
    "content": "From the producer/mixer side, I am 100% happy with you mastering the ref if that’s the move. However, one time I sent the refs to a very esteemed ME as mp3, and they mastered the ref and it just did not sound very good. It was kind of a rookie mistake on my end and an unacceptable oversight on theirs. So note to mixers-send everything hi-res. And MEs…be thorough.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097355805189210122",
    "author": "Nomograph Mastering",
    "date": "2023-04-16",
    "content": "You cannot depend on loudness normalization. It’s not turned on for everyone, it’s not available on web streaming platforms, smart TVs etc",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178085008376864803",
    "author": "Rollmottle",
    "date": "2023-11-25",
    "content": "@Karim Problem statement: It's a must have that when I deliver, I want the track names displayed to clients clean. Which means I have to rename everything I upload to remove the file type and designator (.REF.wav, .4824.wav, MASTER.wav, etc.).\n\nFeature request/nice to have: The ability to either batch rename tracks so I can strip out \".REF.wav\" from 10 files at once, or for the uploader to simply ignore the file type (\".wav\") from the track display so that if my files are named properly, I don't have to do anything in Samply once I've uploaded my files. I can adjust export on my side to accommodate in the latter case.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216126594096300042",
    "author": "Berlin",
    "date": "2024-03-09",
    "content": "Hell, I just did a program last month, it was all over the place sample rate wize, some songs previously mastered, and one of them was an mp3 because they lost the master wav from a previous engineer. All they had was the mp3 for it from their publicist (oof). Their original link was dead and when they asked their previous mastering engineer for the file, they wanted to charge them $320 for the hr to make an \"archive pull\".",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217916670073503794",
    "author": "Edsel Holden",
    "date": "2024-03-14",
    "content": "This is not the answer you want to hear - but if you convert you rendered .WAV (that you love) into a M4A, MP3, and OGG - you can get a preview of what the various codec's will do to your ISP and feel more confident running with a master with a TP over 0.00. \n\nThis will take you some time but then you will know forever.\n\nTeach a man to fish or whatever",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1238650414077841439",
    "author": "Nomograph Mastering",
    "date": "2024-05-10",
    "content": "In the spirit of money where my mouth is, I think the biggest streaming song I’ve ever mastered is Lana’s Say Yes to Heaven - sitting at 477M on Spotify right now",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242278628545396866",
    "author": "Nick Stetina",
    "date": "2024-05-20",
    "content": "Speaking of misguided I read this on GS re: how to pick out a mastering engineer. Has everyone uploaded some program material passed through their compressors to that forum yet? You might be leaving some work on the table.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1246073101486264461",
    "author": "Iwan Morgan",
    "date": "2024-05-31",
    "content": "Bravo again @Nomograph Mastering I now realise why they call it the LAME mp3 codec",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1259275760494182441",
    "author": "Nomograph Mastering",
    "date": "2024-07-06",
    "content": "And placing a value on my time - prep, Swap, print, QC, upload, samply, email - it’s all time I’m not working on something else",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1268967229563736219",
    "author": "Iwan Morgan",
    "date": "2024-08-02",
    "content": "No worries, seems I can upload as many titles as I like with Distrokid for a low fee, so i’ll do 44/48/96. Then we can all geek out on what’s better/worse",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1269688811034775664",
    "author": "Nomograph Mastering",
    "date": "2024-08-04",
    "content": "If the clipping on the MP3 is bothering you then why not make a second master pass with a lower output ceiling (say -0.5)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270078674334515352",
    "author": "Will Melones",
    "date": "2024-08-05",
    "content": "Distrokid, you just aren’t getting my artist aesthetic. You don’t even know what the kids are into these days. Let me be me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270791680718803033",
    "author": "Iwan Morgan",
    "date": "2024-08-07",
    "content": "Bit of an update on the test EPs, I have to go back to the drawing board and make them more musical to be accepted by the streamers apparently as although they were accepted by Distrokid they’ve been pushed back by an unnamed streamer.  I’m still keen to do this but it will take a bit more time to get these Trojan horses through the gatekeepers as I’ll need to add some more “musical” content on top of the sines.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270795071499014217",
    "author": "Iwan Morgan",
    "date": "2024-08-07",
    "content": "Good point. I’ll just focus on the main ones next maybe.  Slightly disappointed as I have bought quite a few music concrete albums which are on the face of it less musical than the ones I uploaded over the weekend",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283124111408889949",
    "author": "Berlin",
    "date": "2024-09-10",
    "content": "For the most part it should work if the listener has max settings on. Tho most streaming services do not come set detault max streaming settings. If they have them set to \"low\", you can almost guarantee a click or a very small pause between tracks because of the codec. @SoundsLikeJoe",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1311217980742307871",
    "author": "Slow Hand",
    "date": "2024-11-26",
    "content": "The only thing I can think of is that when you drag the audio files into Ableton to double check that they've printed correctly you're creating a new .asd analysis file for every audio file. Maybe your ME accidentally received an .asd file where they should have received an audio file.\n\nThen again, it sounds like you're covered since you checked on your friend's laptop. Are you sure the ME didn't receive an .asd? You would know not to upload that file, but the mastering engineer might not think to look for that if they're dragging in 30 files all at once.\n\nYou're printing in .wav or .aiff right? There shouldn't be any problem with the audio files on different OS's because audio files today are all OS agnostic and should function the same.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1314723910587256944",
    "author": "cy (sigh)",
    "date": "2024-12-06",
    "content": "oneRPM (a lot of Latin America uses that one)\n\nalso tunecore very revently changed their interface and prices. they were charging way more  than the others and took a way bigger cut on royalties. glad they switched it up.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324816324894920818",
    "author": "Moses Mastering",
    "date": "2025-01-03",
    "content": "ya i don't think its true peak that high over... when i measured it on spotify, normilazation off.. it does not really seem smashed to death and its barely true peaking over 0. I think its a meter thing haha... just opened up ozone 11... switch meters. This song is not going over 0 but on the k system it looks like it is.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337577537865384018",
    "author": "Paris Lee",
    "date": "2025-02-07",
    "content": "@masteredbyjack hey bud! Good to see you on here! \nIt js a good thing! And in time will be a foolproof good thing! Hell, there might be people here who report back they’ve never had a single issue with it. Not my experience. \n\nThe clear crux of this issue is we’re talking about instant phone playback. There’s a lot of options here, and to be honest the competition is catching up. Internal Files playback on the iPhone was fucking weird but that’s much better now. Even Dropbox, the notorious distortion chainsaw isn’t *as bad*\nAnd these features Samply had like password protection and paywalls, these other mainstream apps like Wetransfer and Dropbox are doing….\n\nIt’s also not a crime if you know how to ‘make a good sounding mp3–not so simple’ to send them an mp3 through text message. Platinum hits get approved like this all the fucking time.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337591677111763045",
    "author": "Paris Lee",
    "date": "2025-02-07",
    "content": "Valid points by all.\nWe’re all just looking for standards that don’t deviate, and developers under the hood tweaking things as the years go by and OS’s change and data bandwidth available to the phone when you’re in this neighborhood or that neighborhood…it’s hard. \n\nStreaming services no different. Will be interesting to compare Apple Music vs Spotify Hi Res vs TIDAL",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350482634085765161",
    "author": "Nomograph Mastering",
    "date": "2025-03-15",
    "content": "There’s no right answer re sample rates. Spotify is native at 44.1 kHz for example. So let’s say you have a 48k mix and you try to get ahead of that by down sampling and submitting a 44.1k Master? iPhone and Apple TV are native at 48k so it will be up sampled on playback",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350510348083658845",
    "author": "Nomograph Mastering",
    "date": "2025-03-15",
    "content": "From my tests I listed here before OGG was always gapless, mp3/aac not, and amount of gap varies on bitrate and sample rate",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350513600095322133",
    "author": "Berlin",
    "date": "2025-03-15",
    "content": "i have mint mobile and ain’t nothin playin back gapless anywhere on any platform.. that’s just an internet speed issue.. disregarding codec all together.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361376767738249217",
    "author": "Grover",
    "date": "2025-04-14",
    "content": "Surely there's something to learn from the history though yes? Cutting is what the profession of mastering used to be and digital is not wholly removed. We can certainly take learnings from our history while embracing modern methods. Cutting good vinyl is also respect for the folks who work on it and the artists who want their music conveyed appropriately across mediums. \n\nI have no problem making stuff massively loud with zero limiting and small amounts of soft clipping, and still retaining tons of transient peaks. I prefer this sound to heavy limiting at the master stage where the program material audibly hits the limiter and the soundstage and sense of headroom collapses. To me, the limiter is optional, but I do understand many use it before they acquire the skills to work without it. \n\nThat said, I also was taught that in genres where its appropriate (Imagine Dragons, Hip hop, EDM, etc.) that those sounds should go in at the production or mixing stage. At the mastering stage I was taught to do no harm, and only to enhance what was present. In my work pushing more than a few dB into a limiter to affect the groove of a piece does not track with my understanding of doing as little to change the sound as possible. But of course, it all depends on the project. My clients who make very mainstream pop/youtube music don't particularly care if I radically editorialize as long as it sounds good and serves the tune. \n\nThere's also something to be said for music which needs to be quiet. Not all music should be loudenated to within an inch of its life. Not all music needs quiet and intimacy. I think of we hold the pursuit of \"the program material's individual requirements to be king\" we cannot then also dismiss vinyl as unimportant or say that one MUST always do things a particular way.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369369761414119425",
    "author": "masteredbyjack",
    "date": "2025-05-06",
    "content": "My 2 cents -- going forward those of us who think of mastering as \"finishing\" instead of \"mastering\" in the traditional sense might be very well equipped. I know Edsel you are similar -- but when I let go of the \"this is what mastering IS\" mindset, and leaned into the \"this is the box in front of me I have to operate within\", things got much better. Acceptance.\n\nIs it mastering if I only work from a stereo file? A limited REF? Tearing apart an mp3 bounce with AI and remaking it? An Ableton session? I say yes to all if we are the ones getting the record across the line. \n\nThat said, the traditional approach is IMO the best for many reasons, but in some sense just having a stereo file is an almost arbitrary restriction based on how projects are made and shared (though a good one). But as technology evolves and shifts, best to be on the cutting edge of knowing how to make a lot of situations work -- I bet the winners will be those who do",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1408193001850929193",
    "author": "Berlin",
    "date": "2025-08-21",
    "content": "creator was uploading their mix for notes from ChatGPT and using a Foo Fighters record as a reference. \n\nGave Chat a list of their DAW, Plugins, etc...",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410620520520486913",
    "author": "Brian Reynolds",
    "date": "2025-08-28",
    "content": "The big change of length track was uploaded but not released. But others that I've changed after release, have kept their menial stream numbers",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410623291051213000",
    "author": "Nomograph Mastering",
    "date": "2025-08-28",
    "content": "But I gather one reason for having uploaded weeks in advance is editorial playlisting",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415358766563725342",
    "author": "Edsel Holden",
    "date": "2025-09-10",
    "content": "\"you can now stream tracks in up to 24-bit/44.1 kHz FLAC, unlocking greater detail across nearly every song available on Spotify\" from the press page",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1438906515640811651",
    "author": "chrissorem",
    "date": "2025-11-14",
    "content": "whats the thought process of sending an mp3. rather than sending a wav?  I haven’t sent anyone an mp3 since 2010",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012130185262411817",
    "author": "Josh Bowman",
    "date": "2022-08-24",
    "content": "Only had one experience with abbey road online mastering, but it was a LONG time ago. The master i got back was trash. But the client sent it to them and did all the communication so i have no idea what the process was like. Also again, many many years ago so could have been an isolated incedent. I'd rather pay a mid level guy in my town that i can easily communicate with than do an online thing like that though.  I think when we did it, we never even got to find out the name of the engineer that did it. EDIT: As Cian said, sterling is also just uploading through an online portal and dealing with assistants, but, at least you know who is mastering it. They also generally only include one revision in the per song mastering rate at sterling, so its similar that way. If you dont have a label budget, it can be limiting if its not quite right the first time back, way less flexible than going with someone who might be able to acommodate a bit more back and forth when needed.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1019603053738991726",
    "author": "ALXCPH",
    "date": "2022-09-14",
    "content": "only when i play raw files from my phone, mine and others, it does not do it when playing from spotify or a radio app, as their sound comes from the apps themselves",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1019688073962991657",
    "author": "ALXCPH",
    "date": "2022-09-14",
    "content": "Hmm I don’t think it’s a file type thing as it I’m only playing mp3 and wavs. To me it sounds like some strange limiter type thing with a super long release or something. So strange",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1027372833053102142",
    "author": "cian riordan",
    "date": "2022-10-05",
    "content": "I always send the limited as an MP3 so they can reference it but not use it. Always sending 5db quieter than the refs.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038093195139108884",
    "author": "Zach Hughes",
    "date": "2022-11-04",
    "content": "I think Spotify is converting to a 320 kb/s MP3 and I wonder if that's the reason why they recommend not uploading tracks that peak above -1",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038240990080807013",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "Can you find me a record that Spotify has mastered?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038244376259858534",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "It gets even wilder. Youtube will use a different codec depending on which CPU you have in your computer",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038248206137569403",
    "author": "Zach Hughes",
    "date": "2022-11-04",
    "content": "Ok so wtf is the deal with Spotify and their mastering recommendations? Just total nonsense?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038248719725891584",
    "author": "David Fuller",
    "date": "2022-11-04",
    "content": "I have heard records *ruined* by Spotify's guidelines, that's for sure...",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038510111448113314",
    "author": "Nomograph Mastering",
    "date": "2022-11-05",
    "content": "From the level and also from Codec overs, technically two separate problems",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041942125014691910",
    "author": "Zach Hughes",
    "date": "2022-11-14",
    "content": "Day late and a dollar short but catching up on the Spotify convo from earlier. A few thoughts: I don't think or hope that Spotify will be gone in 5 years and if it is, that would be bad for most artists (at least in a vacuum). 66% of all the money I've made from DSPs in the past five years has been from Spotify and before this past year it was probably closer to 80% (had a track get lucky on Youtube Red and Amazon Music). I see similar distributions of earnings from pretty much every artist in my community. One thing that Spotify does better than any other DSP is music discovery and recommendation. On Spotify an independent artist with modest buzz around a release can find their track being recommended via Discover Weekly or Release Radar to thousands of new listeners sometimes over night. Spotify also has the most robust user playlist experience out there. Allowing users interoperable playlists I think is a huge boon to us music creators. W/o user playlists and Spotify's music recommendation algorithms I honestly don't know if I could have made a living in music production the past five years b/c all the artists I work with would be broke.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041974173104345108",
    "author": "Nomograph Mastering",
    "date": "2022-11-14",
    "content": "I’ve made the point here before but streaming is competing with piracy. What happens if Spotify costs $30 a month?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042832883355746324",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "For Codec Clipping I urge everyone   With RX to just grab a modern loud master WAV and export it from RX as a 160 kbps Ogg Vorbis, 160 kbps MP3, and use the Apple droplet to make an AAC",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044705368535748749",
    "author": "Rollmottle",
    "date": "2022-11-22",
    "content": "It's a compromise between all the way at 0 and too quiet  at -1 (or lower) and leaves enough room to not have rampant intersample peaks on codec ingestion. Pressed all the way to zero, you will definitely have ISP's. all of which may or not have audible effects. -.3 strikes a nice balance. -.5 is viable too.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044740069275209808",
    "author": "itaylerner",
    "date": "2022-11-22",
    "content": "Yeah they  won't let you \"swap\" unfortunately, I believe you would have to remove the original, upload the new one and yeah just put in the original ISRC; not sure if that would leave previous streams in tact",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044741542864240661",
    "author": "Rollmottle",
    "date": "2022-11-22",
    "content": "Just rename the original to Demo, then upload the new. 🪄",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053020209289646122",
    "author": "Zach Hughes",
    "date": "2022-12-15",
    "content": "There's really only been one EP I worked on where this was a major concern to me. Three song EP. Main features being upright piano and lead vocal with intricate arrangements, shifting dynamics song to song, but I really wanted it to feel like one song. Tracks were actually uploaded to DSPs as one 10 minute song.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085623512615624815",
    "author": "Rollmottle",
    "date": "2023-03-15",
    "content": "i've mastered from MP3 before (by necessity, not accident)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086749382344450058",
    "author": "popaganda.",
    "date": "2023-03-18",
    "content": "When my ref mp3 was mastered I was playing with the newfangled limiter, and there was some other shit happening in there that the ME couldn’t match. Simplest limiter is the best way",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1098271981348081684",
    "author": "cy (sigh)",
    "date": "2023-04-19",
    "content": "I've replaced a few files at this point and the only requirement I was made aware of (through distrokid) is that the length  of the files needs to be the same. \n\nso if the old one is 2:17 the new one needs to be 2:17 too.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117975773106683935",
    "author": "Nomograph Mastering",
    "date": "2023-06-12",
    "content": "And yet, very understandable from the artist side. They are releasing into the busiest marketplace ever and that sinking feeling of a track not hitting on Spotify is a nightmare",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1127356169531424859",
    "author": "Nomograph Mastering",
    "date": "2023-07-08",
    "content": "That Spotify video posted elsewhere today was the same, all huff and puff and \"can you believe this shit?\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178087443556212807",
    "author": "Karim",
    "date": "2023-11-25",
    "content": "This makes sense to me:) and sounds really time-consuming to do yourself for every upload. I’ll talk it with the team. I think it’s worth solving.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211005724302254130",
    "author": "Nomograph Mastering",
    "date": "2024-02-24",
    "content": "This is where the rubber meets the road, codecs used in real world streaming",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217160010354921602",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-12",
    "content": "sometimes I turn on the mp3 simulation in Ozone and convince myself I can hear it without soloing the artifacts, but I've never done a blind test",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217163056942022808",
    "author": "Edsel Holden",
    "date": "2024-03-12",
    "content": "Starting in 48/24 is required in 2024 IMHO, but I think the final upload can have some flexibility, at least science (and our ears) say so.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217421126318166118",
    "author": "Maxim",
    "date": "2024-03-13",
    "content": "I used Apple Music for years and couldn't believe it when I heard songs on Quboz. But it opened up another level of \"this sounds like the master\".\n\n\"Apple has developed its own lossless audio compression technology called Apple Lossless Audio Codec (ALAC).\" Maybe it has something to do with that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217478664715894784",
    "author": "Nacho Sotelo",
    "date": "2024-03-13",
    "content": "I’ve noticed in multiple different computers that Apple Music plays a small super fast glitch in some songs. Ive listened to it in at least 3 computers running Ventura, has anyone else noticed that?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217495666486673500",
    "author": "Maxim",
    "date": "2024-03-13",
    "content": "On the other hand, playing that same file back in quicktime vs. my daw vs. apple music vs. audirvana vs. quboz all feel a lil different. Therefore I'm not suprised they all sound the same comparing them inside of a daw. I'm fine with it being listener bias. Don't have stock in any company.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1224910181130047630",
    "author": "Jeremy Klein",
    "date": "2024-04-02",
    "content": "Ok so from what i can tell, Apple Digital Masters, (previously called MFiT), is basically just a series of guidelines that wants you to \n\na) deliver the highest res wave file possible without up sampling\nb) avoid clipping (so true peak + reduced ceiling + monitor any clipping through the tools they provide you)\nc) preview that after your wav is encoded for Apple Music, you make sure it still sounds good. (the Master for Itunes droplet tool they give you)\n\nIf you want that \"Apple Digital Master\" badge, on the track, you likely have to get it done by someone certified to do an ADM master.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230153459865751582",
    "author": "masteredbyjack",
    "date": "2024-04-17",
    "content": "I've spoken with him before, he was really kind and I think cares about the art and people so I think it's important to know that. But I definitely question this logic for the reason you mentioned -- maybe in the wav (I certainly prefer non-true peak limiting vs true peak limiting almost all of the time). But the type of record it is, how important those ISPs are to manage based on possible codec conversion to streaming, all of it is way too complicated a balance to just conclude from one file on an instagram story\n\nHe's making it seem like a free lunch -- more ISPs more volume! -- when it's really a balance of factors to consider\n\nAnd it definitely WON'T sound like a full db louder, if you look at the waveform stats there are only 50k or so samples above 0\n\nIn a hot pop record, maybe the ISP and distortion will give a touch of extra percieved volume -- in a piano ballad it could be disastrous (again, easy to check in RX, make an mp3 or OGG)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246256059530870784",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": ".\nSpotify serves MP3 and AAC on the regular",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266635576665182339",
    "author": "Edsel Holden",
    "date": "2024-07-26",
    "content": "Samply side update - new uploads going forward need not be afraid of the issue.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266983994407522344",
    "author": "Nomograph Mastering",
    "date": "2024-07-27",
    "content": "You’d need much more than 3 cycles, I’ve seen 50 mS chopped off by codecs, so I suggest 100 mS of each",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276824342944288779",
    "author": "Iwan Morgan",
    "date": "2024-08-24",
    "content": "Hey Ted, welcome! I did try uploading three versions and for various reasons the dsp’s pushed them back. I am still planning to do it but i’ve been slammed with projects since then. I may have some time later this week and will share once I have the results",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278130317156417630",
    "author": "Berlin",
    "date": "2024-08-27",
    "content": "Whatever works! - we typically don't embedd metadata on WAVs going to distro because, they/the artist/the team input it again at the upload stage.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283113349965418577",
    "author": "Nomograph Mastering",
    "date": "2024-09-10",
    "content": "Not my area of expertise but this would very much be a Producer call IMO\n\nMake them aware of the risk of glitches on gapless transitions on lossy streaming platforms and after that it's up to them how they'd like to balance the tradeoffs",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293434154406379551",
    "author": "Berlin",
    "date": "2024-10-08",
    "content": "had to start telling my indie artists on delivery “if uploading to distro kid, DO NOT enable mastering optimization, this will ruin the work we have done here together”.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293617105278865530",
    "author": "Berlin",
    "date": "2024-10-09",
    "content": "Great question. I used Tunecore for my last release, don't recall seeing a button to upgrade to MAX for tidal.. that being said I delivered 48 24 and looks like it only pushed through as 44,1 16 to tidal (just checked).",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293617440248430663",
    "author": "Edsel Holden",
    "date": "2024-10-09",
    "content": "Tunecore seems to be the lesser of the evils, but they all suffer from bloat. \n\nLevel was solid bare bones, but just closed, and is rmeoveing everyones music who used it (oof).\n\nHave a few who use \"united masters\" its like an IOS app - gives me the heebie jeebies, but seems to have less frills.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293623749895258123",
    "author": "Slow Hand",
    "date": "2024-10-09",
    "content": "I'll add that I'm actually very happy with Distrokid as a distribution service. They just happen to have this potentially disastrous \"mastering\" up-sell. If you're able to forewarn someone who may be tempted by the option, I'd still consider them to be a solid choice.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1296144061618589778",
    "author": "Berlin",
    "date": "2024-10-16",
    "content": "Make sure that the lossless toggle is enabled under the \"playback\" options, otherwise a codec kicks in.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313568771658481756",
    "author": "Ted Whitten Media",
    "date": "2024-12-03",
    "content": "Yeah I keep having to add lines to my delivery email template, mostly because of Distrokid... \"please for the love of god don't check any of these boxes!\" 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318323189176205484",
    "author": "Berlin",
    "date": "2024-12-16",
    "content": "this happens to me. I delete the file in samply and reupload - seems to solve the problem for me on those particular songs.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1332736401665691663",
    "author": "hyanrarvey",
    "date": "2025-01-25",
    "content": "You can bypass the Dropbox codec browser by changing www, to dl. As well",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334297725428174921",
    "author": "Nomograph Mastering",
    "date": "2025-01-29",
    "content": "This can happen for all sorts of reasons. Inc\n\n- Artist read on Gearslutz that they should get these variants (usually based on an answer from an ME who is autoexporting a gazillion formats and not QCing)\n- Label has requested as part of their standard upload request\n- (form Berlin) \"Perhaps they also have experience working with another mastering house who has delivered all of those versions before and now feel that that is standard\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337592535048257570",
    "author": "cian riordan",
    "date": "2025-02-07",
    "content": "I use Spotify pretty extensively and never experience the glitches I had on Samply.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337594335428087898",
    "author": "NoahNeedleman",
    "date": "2025-02-07",
    "content": "Apple Music skips at 6 second on every new track I pick when I’m using my phone",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350482895831175168",
    "author": "Nomograph Mastering",
    "date": "2025-03-15",
    "content": "And that’s aside from the ogg/mp3/aac roulette all of which sound quite different (I just did some codec comparisons last night on a project)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350484097667043402",
    "author": "Nomograph Mastering",
    "date": "2025-03-15",
    "content": "Gapless in Spotify! Gross",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350513009960947802",
    "author": "Nomograph Mastering",
    "date": "2025-03-15",
    "content": "I believe Apple is always AAC unless lossless is selected",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354192008264024267",
    "author": "Zack Hames",
    "date": "2025-03-25",
    "content": "Then why doesn’t Spotify play back gapless????",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354193712330178610",
    "author": "Ted Whitten Media",
    "date": "2025-03-25",
    "content": "OK. I wonder if older files didn't have it. Maybe they predate OGG and Spotify hasn't bothered to convert everything. Not sure. But I do know that a client of mine just released an album that was more or less one continuous song, and the gapless transitions are perfect down to the sample.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354274386978406421",
    "author": "Edsel Holden",
    "date": "2025-03-25",
    "content": "I was just asked for (the third time ever?) my provider email this week - US Virgin distribution I believe. The tools are public but you are “supposed to” have an email registered…. Andrew I’ll share the emails I used to get “certified” if it’s any help",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355505473658556426",
    "author": "Ted Whitten Media",
    "date": "2025-03-29",
    "content": "When it's isolated to a single DSP, it's usually an encoding issue on their end. I had a client who had a single end up with a couple seconds of silence mid song and it was only on Spotify. Apparently there was a hiccup with the encode on their end, so he had to reach out and have them fix it. Gave me a damn heart attack when I first heard it though. Lol.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368297454520504591",
    "author": "Paris Lee",
    "date": "2025-05-03",
    "content": "Mastering the mix has a good plugin- Reference 2 \n\nMy main use for reference 2 is auto sample alignment of the unprocessed mix and master on the master bus and to be able to listen to that live. \n\nThe time alignment of ab’ing -at least to me- is as just as big a problem as volume descrepancies…\n\nIt can also let you manually by ear tune volume up and down, it will also lufs match to either the quieter or the louder, it will also take everything and auto it down to streaming LUFS (good for evaluating maybe a change in dynamics) \n\nI also have a tidal playlist running on another cue which just goes and is in whatever genre i might be in and you never know what will come up at any time. This can be quite fun! Conscious’i must compare this to that’ is already a bias!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370041547759812734",
    "author": "Austin Gordon",
    "date": "2025-05-08",
    "content": "This is separate from Victor's question--but Spotify recommending -2dB TP is just...\n\nlol",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1374852071647346688",
    "author": "Halliemmelton",
    "date": "2025-05-21",
    "content": "in essence--i have a project that is sort of turning into a very long and drawn-out process, in that the publicist (this is an independent artist) is asking me to provide wav files that have a lot of information embedded in them. This is a double-album, 21-song project that I already discounted more than I probably should have based on the amount of time i've already put into the project because of all of the unexpected needs of the client. I keep trying to accommodate the needs as best I can, because the client is so kind and this is a project he is very passionate about. The issue is that the publicist is asking for things that she isn't fully able to be very clear about (I think maybe because she is somewhat inexperienced and doesn't know what it is she actually needs), and it's starting to approach a level in which I'm providing a lot of stuff for no charge--even though at the moment, I'm swamped and starting to get a little stressed trying to squeeze other projects in and also trying to wrap this up and get the client everything he needs. For some background, I had to re-make the DDPs because the client changed some song title information after I had already done the due diligence of confirming with him that all of the information was correct. now, his publicist, who had originally requested embedded MP3s with all of the album/artist/sequence info and album art for the album and also five singles, is now saying she meant to say she needed wavs.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389245527031545968",
    "author": "andrew_yv",
    "date": "2025-06-30",
    "content": "I have a comedian friend who made a couple TikTok’s that went somewhat viral using an AI generated song as the punchline last year. His fans asked him to put it on Spotify and for Spotify he asked me to “master” it. I chose to do it largely because I felt that in this case music was a secondary medium and the comedy was the art form. That said, it sounded terrible and with a stem splitter and heavy handed processing I managed to take it from atrocious to pretty bad, no further. As I said, a year ago. I’m sure things have changed significantly. Tbh probably wouldn’t do it again regardless of quality",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405014247976603769",
    "author": "Berlin",
    "date": "2025-08-12",
    "content": "is CD baby still only accepting 44,1k 16bit?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405580120621580400",
    "author": "Berlin",
    "date": "2025-08-14",
    "content": "For now nothing much to my knowledge.. In the future? Unclear. \n\nI think some digital direct access/upload stores may currently benefit (stores that are not controlled by a distro) where direct masters could be downloaded. Squarespace or possibly bandcamp.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412644526736150548",
    "author": "Berlin",
    "date": "2025-09-02",
    "content": "I appreciate multiple apps that do one thing and do it well.. RX, Hofa, mp3 tag, wavelab, reaper.. get the workflow locked in for yourself between the apps and you’re set.\n\nApps in my everyday arsenal flow like, RX > Wavelab > RX > mp3tag > Samply\n\nIf I’m exporting a DDP with Wavelab, toss in the Steinberg DDP player for QC to the workflow.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1438939888169783307",
    "author": "Berlin",
    "date": "2025-11-14",
    "content": "Similarly why gapless often doesn’t work when a poor net connection is happening when streaming. Streaming services often truncate the audio (even more so) with their codecs and these little gaps get put in.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441535449008050366",
    "author": "Berlin",
    "date": "2025-11-21",
    "content": "If not, I wouldn't worry about ISRCs. \nFor Digital, that will be handled on the distro side by your client when they upload.\nFor previously released material, I'd likely keep the track lengths the same.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "974843503110660166",
    "author": "BIGJOY",
    "date": "2022-05-13",
    "content": "And any thoughts on giving 24bit files to distrokid?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "977550614445821962",
    "author": "chadwahlbrink",
    "date": "2022-05-21",
    "content": "Okay - maybe it only happens on macOS Apple Music. Seems like it’s not as sketchy on iOS now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "977584537464872960",
    "author": "chadwahlbrink",
    "date": "2022-05-21",
    "content": "Very true. I’m going to test album mode again on my Monterey MacBook soon. But as far as I can tell, album mode is not a thing iOS in iOS 15, and it was still wonky in macOS 10.15. 🤞 fingers crossed no one else will ever hear Apple Music distort that badly 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "989199014488584222",
    "author": "ALXCPH",
    "date": "2022-06-22",
    "content": "Huh? According to this dude, Spotify only normalises to -14 when it’s on the phone? This can’t be right… can it?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "989199574117802044",
    "author": "CAPSLOCKDUB",
    "date": "2022-06-22",
    "content": "I don't know if that's true on spotify but I know tidal has options for normalization on both desktop and phone but I'd assume Spotify would be the same",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "991110640339013703",
    "author": "rse",
    "date": "2022-06-27",
    "content": "What do you guys use as your final output level on your final limiter? I use the Fabfilter L2 in true peak mode and set the output to -0.2db. I'm now checking some of my own mixes recorded out of Spotify (Loudness normalization: off, Quality: Very high) using internal routing. I'm still seeing some small overs, usually at 0db, but occasionally at 0.1 or 0.2\n\nIs this something I have to worry about? I suppose I yes, since intersample peaks (I think that's what these are) are obviously something you would want to avoid I think. What do you use as your final output or ceiling on your limiter?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "991111240917192744",
    "author": "CAPSLOCKDUB",
    "date": "2022-06-27",
    "content": "I use -0.11 to avoid anything turning red in the daw. But I've noticed on tidal with normalization off, most commercial mixes have overs reading out on my clarity M. I personally don't worry to much about it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012119002115485807",
    "author": "Felix Byrne",
    "date": "2022-08-24",
    "content": "same w sing - upload portals and emails",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1019600203440984074",
    "author": "mixedbywong_my",
    "date": "2022-09-14",
    "content": "Does it only happen when you play  your own songs/mixes ? Does it happen to stuff you play off Spotify or Tidal ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028138013462630400",
    "author": "Slow Hand",
    "date": "2022-10-07",
    "content": "Aaaactually… Now you’ve got me thinking. \n\nIs it possible to render and play back a file that switches sample rates partway through the song? Or would the codec simply convert the file to a single unified sample rate before playback?\n\nSure the different sections would be played at a different speed and transposed depending on the sample rate you read at. But if you accounted for that change there may be some interesting shenanigans to be had as you transition from SR to SR in each section.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033904906874138747",
    "author": "Nomograph Mastering",
    "date": "2022-10-23",
    "content": "I charge for each alternate, which covers file prep in RX, setup, print, QC and upload. The rate varies for indie to label to big projects",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034583659640012942",
    "author": "ehutton21",
    "date": "2022-10-25",
    "content": "Are you referring to Spotify or apple?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034584671801061516",
    "author": "hebakadry",
    "date": "2022-10-25",
    "content": "Highly recommend reading The Spotify Teardown.  It was written by a bunch of MIT researchers about the start of Spotify...it was meant to be a video format but the studios shut it down so hard because of how unionised and lawyered up they are. That's when they pivoted to music...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037924322070773800",
    "author": "Zach Hughes",
    "date": "2022-11-03",
    "content": "Folks, I have a question for the group. Would love to get a mastering engineers perspective. I'm curious what is the rationale behind masters clipping output converters and leaving in true peaks that exceed 0dBFS? I get that clipping converters can sound cool / desirable, but why not achieve the clipping you want and then print a final master under zero? Why risk a consumer product crapping out during playback and adding potential distortion and why totally disregard pretty much every DSP's recommendation that true peaks not exceed -1 for the encoding process? I'm noticing that a ton of major label releases are peaking above zero with loudness normalization turned off on Spotify.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038033628665491516",
    "author": "mixedbywong_my",
    "date": "2022-11-04",
    "content": "From what I can understand, the peak above zero is a product of reconstruction of the streaming format in Spotify (lossless format). There’ll be intersample peaks and level increase in that process. Anyone else whose more knowledgeable, please correct me if I’m wrong .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038172166291734669",
    "author": "mixedbywong_my",
    "date": "2022-11-04",
    "content": "I noticed a lot of these clipping happening with some huge Korean Kpop songs recently (power ballads or dance pop) . With or without loudness normalisation,  played from Tidal or Spotify. Most cases, the YouTube version does not have the same clipping bits.  🤷🏻‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038244103781109800",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "Codecs on the other hand very much are",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038244275131011133",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "And sadly it's way more complex that you what you said. Spotify alone use AAC, MP3 AND Ogg Vorbis depending on the playback device and quality level selected",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038244599484928081",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "And different codecs react very differently to excessive levels, and obviously worse at lower bit rates",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038245257827061820",
    "author": "Zach Hughes",
    "date": "2022-11-04",
    "content": "So are mastering engineers printing different masters for different DSPs and there different codecs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038245577055555607",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "Ok, another question. Can you point to real world examples of codec clipping being a problem?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038245920917172224",
    "author": "Zach Hughes",
    "date": "2022-11-04",
    "content": "I hear plenty of clipping in modern records but not sure if I could attribute it to the codec",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038248391286734890",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "Take a loud Master, preferably a WAV that you have purchased online. Use the Export function (Command E) to export the master as low quality compressed MP3, AAC and Ogg (say at 160kBPS). Then open those files against the main master in RX",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038248532282449960",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "You never answered my question. Can you point me to a record Spotify has mastered?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038251724118446120",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "Think they'll clip the codec? 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038482846173626489",
    "author": "Zakhiggins",
    "date": "2022-11-05",
    "content": "Actually guys - I had mixed a a song for a client one time, that when released, on Spotify it got clipped HARD, as in the transient of the kick got turned down like 5db... On every single other streaming service, it sounded just as the final master sounded.. I don't remember it being crazy loud either, maybe like - 8 lufs integrated.. Any idea wtf went on here?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038487314793500723",
    "author": "masteredbyjack",
    "date": "2022-11-05",
    "content": "Not sure why that would happen (though I suspect Ruairi would know) but something I’ve been finding useful is using Samply with clients to approve masters…and if there is indecision about how loud the master should be turning on the “loudness matching” algorithm. They having a loud master play right next to a more dynamic one.\n\nIt approximates what happens with streaming (minus the codecs and stuff) and at least you can see, sort of, how a really loud master would sit against a more dynamic one. From a creative perspective so people get an idea of the trade off between density and dynamics. \n\nHowever, I am quite new to the pro mastering side of things and while so far my projects are translating as expected I’m very interested to learn more about this and hear others perspectives",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038487869934813404",
    "author": "David Fuller",
    "date": "2022-11-05",
    "content": "That's... interesting. I mean spotify absolutely does have a \"sound\" to their transcodes but never anything that extreme",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038561908216823978",
    "author": "Deleted User",
    "date": "2022-11-05",
    "content": "this has happened to me before- I believe my client used distrokid mastering because I asked him “are you gonna send this to mastering” and he said “I was going to do it in FL studio myself” No shade to FL but he knew nothing about mastering so I suggested that he just put it out. So I think he ended up slapping that on. Everything got bumped up and squashed, but also I was less skilled back then. My mixes were already smashed a bit, but it wasn’t half as bad as the final version that went up on streaming services",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1039768037877874728",
    "author": "David Fuller",
    "date": "2022-11-08",
    "content": "like, 128k aac is no bueno and 128k mp3 is far worse",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040824932587802634",
    "author": "JakeTB",
    "date": "2022-11-11",
    "content": "If you want a TL;DR, Dale talks loudness normalization as it relates to projects, and how arrangement can impact the way a streaming platform perceives average loudness",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041068427982409768",
    "author": "JakeTB",
    "date": "2022-11-12",
    "content": "Yea it’s an interesting world. Ruairi might be able to confirm, but my gut is to trust Dale since I don’t have a good way to test it.\n\nThe more interesting conversation there to me was the idea of soft sections in the arrangement adding to the perceived loudness of the overall track after normalization; and the idea that Spotify averages the levels of an EP or LP, so having an acoustic track can reduce our average LUFS, resulting in louder playback.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041081359663382598",
    "author": "ALXCPH",
    "date": "2022-11-12",
    "content": "i wish Spotify would release a program or plugin, for people in music to test their normalisation algorithms. Some thing to run audio through, and test for result. I think everyone would win in that situation. And it would make a lot of indie released music, much more consistent in Deliverable quality.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041083223897296946",
    "author": "Nomograph Mastering",
    "date": "2022-11-12",
    "content": "Sure, I’ve thought about it. It should be run by Spotify and called “Approvify”, you upload the masters and clients can access via password",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041083519935447091",
    "author": "Deleted User",
    "date": "2022-11-12",
    "content": "I’m curious to hear why do you think Spotify will be no more within 5 years?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041086299303579721",
    "author": "Deleted User",
    "date": "2022-11-12",
    "content": "shit. time to move my spotify playlists and likes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041086608566407169",
    "author": "ALXCPH",
    "date": "2022-11-12",
    "content": "only reason im on spotify, is because my Family, Friends and most clients are on spotify. Makes it easy to share and collaborate on playlists. If that wasnt the case, i would move instantly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041087087300071715",
    "author": "ALXCPH",
    "date": "2022-11-12",
    "content": "i would love to just use apple music, since i pretty much sold my soul to apple anyway with phone, pods, pad, macbook.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041087300735602801",
    "author": "Deleted User",
    "date": "2022-11-12",
    "content": "for me it’s because I can see what other people are listening to. honestly- apple music is way better than spotify. even in terms of algorithm, I find that apple music encourages me to go deeper and explore diversity while spotify algorithm just recommends you popular songs in the genres",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041089437926445117",
    "author": "JakeTB",
    "date": "2022-11-12",
    "content": "Interesting, it actually seems like it could be a positive thing to me.\n\nIf Netflix followed their model for film, we could see artists cutting exclusivity deals for the platform distribution, which means more money in the pot for the people making the records.\n\nThis is probably wishful thinking but it’s the first thing that comes to mind",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041090141097308200",
    "author": "ALXCPH",
    "date": "2022-11-12",
    "content": "Dont quote me on this, but i think Spotify, either did, or was in talks about doing something like this already. Same with tiktok. they are already a Digital Distributor",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041144519162347540",
    "author": "Eric Martin",
    "date": "2022-11-12",
    "content": "9% of Spotify is owned by a Chinese Internet Services company call Tencent which is a 500 billion dollar company, they have 1.5 trillion in assets and have the largest consumer market in the world. Don’t forget about China, they hold a lot of power and are constantly buying up American stock exchange companies from the back end.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041973720031440916",
    "author": "Nomograph Mastering",
    "date": "2022-11-14",
    "content": "Let’s assume for a minute that Spotify is not horribly run",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042511105391603712",
    "author": "omarakrouche",
    "date": "2022-11-16",
    "content": "alright y’all… tidal hi-fi vs apple hi-fi… what do we think? been using tidal for almost two years now and have been pretty happy with it but decided to apple music since i was hearing good things about its new lossless playback. decided that i thought apple music sounded really good and started a/b-ing to the point where i’m no longer even sure what i think !!! lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042511460078714880",
    "author": "omarakrouche",
    "date": "2022-11-16",
    "content": "originally was interested in apple because it sometimes felt closer to final master .wav’s that i worked on, whereas tidal sometimes felt a little warmed up or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042538697427529739",
    "author": "masteredbyjack",
    "date": "2022-11-16",
    "content": "Interesting. I'm mainly working on popular music only, but am curious how things are translating for others out there. I think this is a purely technical topic...my master doesn't sound any different with TP or not if you just de-clip the occasional one (and I don't make creative decisions based on it at all). Was just wondering if it could induce some sort of distortion somewhere along the line in the codecs. Using TP on a limiter is a different story.\n\nObviously very few clients will be \"checking\" this but I think it's my job to understand the trade-offs or if it matters at all when things go to streaming. Saw an IG live by Dale Becker and he seemed to imply that if there were TP in files they might get turned down more on streaming. I don't think it's a great thing to chase how masters will translate to any one platform but it's important to understand the marketplace the music is going to!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042544211435720714",
    "author": "Nomograph Mastering",
    "date": "2022-11-16",
    "content": "BTW I’ve seen no evidence that Spotify is taking true peak into account for it LUFS measurement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042589870327091231",
    "author": "Zach Hughes",
    "date": "2022-11-16",
    "content": "3) Allow artists to retarget their listeners for advertising purposes. Imagine putting a facebook retargeting pixel on your spotify profile page.\n4) Allow artists to own their own data. Related to three. Spotify For Artists analytics is a neat distraction. There could be so much more.\n5) In the OG spotify days you could direct message other Spotify users which made it way easier to reach out to playlisters and promote your music. Granted this would probably get spammy real fast.\n6) Switching from a pro rata payout model to a user centric payout model. Given how spotify calculates the royalty pool currently the greater the total number of streams on the platform the LESS an individual stream is worth. Therefore the value of a stream has been decreasing for years. In 2017 I was making closer to $0.004 / stream and now I am making closer to $0.0026.\n7) Eliminate fraudulent streams from the platform. Switching to a user-centric model would eliminate a vast amount of streaming fraud over night. Spotify currently has very little incentive to police streaming fraud. What do they care? They scrape their 30-40% off the top.\n8) Democratize editorial playlists inclusion instead of making it a major label circle jerk\n\nI could go on but this is maybe getting excessive",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042658815377674281",
    "author": "Zach Hughes",
    "date": "2022-11-16",
    "content": "I mean relative in that if you turned a -8LUFS mastered track down 1dB with your fader it would output -9LUFS. And if your master once normalized on Spotify is turned down then the true peak is lowered (if measuring system output from Spotify) the same decibel amount the track is turned down to reach -14 LUFS. The true peak of a track with greater dynamic range that is turned down less or not at all post normalization will be higher. So relative peak levels upon playback, with normalization on, of tracks mastered at varying LUFS values is what I mean.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042776247186505768",
    "author": "Zakhiggins",
    "date": "2022-11-17",
    "content": "Saw this while uploading a track on Distrokid for someone - wtf is this about? Do I have to choose to allow Spotify to normalise the music I upload?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1042832476583772180",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "We talked about this here before ISPs matter more because of Codec clipping than converter clipping. I would say that at this point the vast majority of modern playback systems are using digital attenuation to control level, as never get hear full scale on a DAC",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042833182267023450",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "You will see lots of codec clipping, tracks that peaked at -0.1 will now have true peaks of +1.5 or 2",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043018661671211089",
    "author": "Zach Hughes",
    "date": "2022-11-17",
    "content": "What Spotify uses for normalization",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043032511263019018",
    "author": "mixedbywong_my",
    "date": "2022-11-17",
    "content": "Quick question , metadata on wav/mp3 of masters. Do you all do metadata inputs into the master wavs or only when you’re doing DDP creation ? I remembered that if it’s going into a streaming platform , they need to input the metadata info again .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043033042027040858",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "The only other place I may add metadata is some MP3s, but I release as few into the world as possible",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043043848458354738",
    "author": "Zach Hughes",
    "date": "2022-11-17",
    "content": "Makes me think of spotify editorial curators",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044387431228653669",
    "author": "Eric Martin",
    "date": "2022-11-21",
    "content": "I just learned that DistroKid doesn’t like if you upload a 24-bit file that’s truncated to 16-bit, why do I do that? because I haven’t  found out how to batch process with WaveLab to include bit reduction/dither when doing a batch render.\n\nMy Artist got the message \n\n“Error:\nThis track appears to be a 16-bit file in a 24-bit container. All masters submitted for MQA encoding should be submitted at the original bit depth of the audio.”\n\nsounds like it was only the Tidal “Masters” that rejected the file but that wa as first and now I have a new process when mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044413077371748392",
    "author": "Deleted User",
    "date": "2022-11-21",
    "content": "How does Distrokid know?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044738656394555533",
    "author": "itaylerner",
    "date": "2022-11-22",
    "content": "Haven't done it through distrokid but have had it done through a proper distributer (AWAL)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044738906777731112",
    "author": "itaylerner",
    "date": "2022-11-22",
    "content": "If the song is the exact same length and essentially identical, the only difference is the master, than DSPs should be able to accept it. But i don't believe an open distribution platform like distrokid or cd baby will allow it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044739458152534206",
    "author": "omarakrouche",
    "date": "2022-11-22",
    "content": "Def nailing the runtime but we are using Distrokid for this, so might be a guessing game",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044740193997033473",
    "author": "itaylerner",
    "date": "2022-11-22",
    "content": "Distrokid customer service is actually pretty solid though, i'm sure there's someone you/they could get on email pretty quickly to double check",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044740238196617216",
    "author": "masteredbyjack",
    "date": "2022-11-22",
    "content": "https://support.distrokid.com/hc/en-us/articles/360021298953-Can-I-Upload-a-Single-Before-My-Album-and-then-Include-that-Single-on-My-Album-\n\nThis seems to confirm what you are saying Itay!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065734241717067787",
    "author": "ehutton21",
    "date": "2023-01-19",
    "content": "Ye, I think tidal is like the only DSP I know that does a good job with full credits",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068303961494405140",
    "author": "masteredbyjack",
    "date": "2023-01-26",
    "content": "I'm nowhere near the level that most others are here...but I send both a Samply link for listening and use Dropbox for the deliverables and tell the client which is best used for which. People seem to like it and it's pretty seamless -- Samply allows an easy player and Dropbox allows easy downloads and clear file structures when needed (and allows you to switch out and add to uploads if ever needed for the same link, links don't go bad, etc). Had a project where we put up the masters and the mixing engineer bounced a wrong version of an alt (I couldn't tell this on my end due to the nature of the alt). But the link had already been sent to client. We were able to switch out the file seamlessly before the client listened via Dropbox and all was okay\n\nAnd to @Gerhard Westphalen point...if I ever fill up my very large dropbox allowance it probably means I'm rolling in dough and the cost of the extra storage is worth the overhead.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068322744548216902",
    "author": "Jeremy Klein",
    "date": "2023-01-26",
    "content": "is this still the case? A few days ago in #👼newbie-questions  I tested the difference between an **mp3 ** streamed from their website, and the download version of that mp3 and I heard no appreciable difference: https://discord.com/channels/800115582531928064/809922920947646494/1067141064101724230",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069386869047042150",
    "author": "Iwan Morgan",
    "date": "2023-01-29",
    "content": "Thanks Ruairi. I’ll try it this week, my usual approach has been to do the masters in Pro Tools, export the wavs and then do all the spacing/fades in Hofa. I can do all my exports from there (DDP, hi res Wavs for streaming distribution, and Vinyl A/B sides).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071227980438847599",
    "author": "Gerhard Westphalen",
    "date": "2023-02-03",
    "content": "@Nomograph Mastering the other day you mentioned having Apple Music but not using it in the studio. What’s the reason? Still trying to find the best system for myself and I may eventually get a Mac (for Atmos reasons) so I’m not sure if I should bank on using Apple Music then",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071294695436718080",
    "author": "Gerhard Westphalen",
    "date": "2023-02-03",
    "content": "Tidal is confirmed to be serving MQA on anything that’s “Master” and they’re no longer releasing albums that aren’t Master",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071298481672691762",
    "author": "Nomograph Mastering",
    "date": "2023-02-03",
    "content": "Yep, even in the non MQA HIfi mode, it’s audible when you compare to a master uploaded",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071304974815993966",
    "author": "Nomograph Mastering",
    "date": "2023-02-03",
    "content": "Sorry, I’m answering what does non decoded MQA do (ala poorly served tidal files) real MQA decoded is a whole other ball of wax",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071305691928723477",
    "author": "Nomograph Mastering",
    "date": "2023-02-03",
    "content": "It is, very dumb given that Tidal had the hifi space on lock",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071306963977240607",
    "author": "peterlabberton",
    "date": "2023-02-03",
    "content": "Or they just chop that really low level audio out in some sort of digital compression a la MP3?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071367571300950026",
    "author": "austenballard",
    "date": "2023-02-04",
    "content": "Did my homework about MQA recently when a client was losing sleep over not having the badge on Tidal for their newest release - hazy or not you nailed the important parts. \n\nThe format looks good enough on paper for audiophiles and less-technically-inclined executive types to buy into it in theory, but in practice Meridian were just looking for a licensing coup with the 'next mp3' ... but how many 'next mp3's have we gone through by now?\n\nAnother solution looking for a problem... y'know, like Atmos \n\n*-ducks and runs away-*",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072539193395400784",
    "author": "Iwan Morgan",
    "date": "2023-02-07",
    "content": "I maybe spoke too soon re: Samply. Has anyone had issues with Gapless Playback? I’m having issues (a click/short pause) where there is supposed to be a seamless transition between two tracks.  It plays back fine in Hofa DDP and the wavs playback with no click when lined up back to back in Pro Tools and when loaded into Apple Music. Contacted Samply so hopefully I’ll get a response but was interested if @Nomograph Mastering or anyone else who uses it has experiences this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075132898262405163",
    "author": "Jeremy Klein",
    "date": "2023-02-14",
    "content": "hahaha well i feel like a dumb dumb now. Definitely a few tracks on spotify of mine that are missing a 200ms something.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075133636858368012",
    "author": "Will Melones",
    "date": "2023-02-14",
    "content": "Who’s the *distributor*, like the people delivering to the streaming platforms? How do you deliver something that segues from one song to the next without a gap then?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082218754907324456",
    "author": "Nomograph Mastering",
    "date": "2023-03-06",
    "content": "What do you stream on? Tidal?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082219094222311445",
    "author": "spectrummasters",
    "date": "2023-03-06",
    "content": "Apple . Need to migrate to tidal for sure tho (I like credits )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082219171296845866",
    "author": "Nomograph Mastering",
    "date": "2023-03-06",
    "content": "Go straight to Qobuz and skip tidal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085625056366960700",
    "author": "Nomograph Mastering",
    "date": "2023-03-15",
    "content": "You should take zero responsibility for that. I know @cian riordan sends MP3 refs exactly because he does not want them used",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085651981542101022",
    "author": "noahc",
    "date": "2023-03-15",
    "content": "I once had someone release an mp3 of a song I produced and rough mixed. Yet to be paid years later 🥲",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086755393855836350",
    "author": "Gerhard Westphalen",
    "date": "2023-03-18",
    "content": "I always bring in and listen to the ref. Sending as an mp3 just means it gets converted back into a wav on my end. Just means an extra file on my end",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091414313572507738",
    "author": "Gerhard Westphalen",
    "date": "2023-03-31",
    "content": "Do you actually do anything different other than potentially auditioning through the codec? AFAIK no one follows the -1dBTP rules",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1098694380925222912",
    "author": "masteredbyjack",
    "date": "2023-04-20",
    "content": "Okay also circling back here regarding the previous discussion on having previously released songs on a new EP/album...\n\nHave 3-4 projects where I'm finishing them + doing some new masters on them, but they have some previous masters. In different sample rates. Obviously I want to deliver the project in a single sample rate. But we don't want the song to be counted as two separate releases, plays, etc when it goes to streaming.\n\nI'm assuming as long as the files are exactly the same length, when uploaded to streaming and using the same ISRC on the distribution side it shouldn't matter if there is a discrepancy in sample rate right between the \"new\" master and the previously released one right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1098812866301272106",
    "author": "LAPhill",
    "date": "2023-04-20",
    "content": "I borrowed a friend's vinyl player to check the test-pressing of this LANDR master'd soundtract and it's... abysmal. I'm going to guess the quality of this record player is pretty bad, but I've checked the bluetooth output and aux output and both of them sound like 7 tons of Napster mp3s, with all of the bottom rolled off and extremely distorted. \n\nThat's gotta be the disc, not the player.. right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102727648137981982",
    "author": "samvalentine",
    "date": "2023-05-01",
    "content": "Hey yall- I’m a mix engineer but for budget reasons they’ve got me mastering the project as well. What should I aim for dBTP for distribution? I’ve heard -1dB is required for many DSPs but how much does that matter?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102733011079942197",
    "author": "samvalentine",
    "date": "2023-05-01",
    "content": "Cool. And just don’t sweat potential distortion from DSPs normalizing? Maybe I’ve read one to many of these lol https://artists.spotify.com/en/help/article/loudness-normalization",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102735717391679608",
    "author": "Nomograph Mastering",
    "date": "2023-05-01",
    "content": "The question is how many records have Spotify mastered?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102739128354873396",
    "author": "Nomograph Mastering",
    "date": "2023-05-01",
    "content": "And don’t fuck with trying to measure the output of Spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102743420876886057",
    "author": "David Fuller",
    "date": "2023-05-01",
    "content": "this alone is gonna make me switch off tidal lmao",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102968515411062855",
    "author": "masteredbyjack",
    "date": "2023-05-02",
    "content": "@Nomograph Mastering I have been conviced to go the Qobuz route and am recreating my daily listening warm-up playlist out of the high res wavs (previously just had an apple music playlist).\n\nYou have any masters of yours that you think feel amazing? Like just your favorite. I have some on there now but would love to add one that you find compelling yourself! Currently have a Ruel track on there (love love love the connection to the vocal)\n\nAlso damn I am realizing how hot everything is...could sorta tell before from some other masters I've collected from mixing buds...but I'm pretty consistently about a db quieter (not true peak but in LUFS) than most of the stuff I'm finding...which I think suits the music I'm working, people are happy, I'm a more dynamic type anyway....but just interesting to note I suppose",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109162364588269700",
    "author": "shaunobi",
    "date": "2023-05-19",
    "content": "Watching on YouTube is a little sketchy too cause of the codec",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109162730574843955",
    "author": "Rob Domos",
    "date": "2023-05-19",
    "content": "Tbh I don’t think the YouTube codec is changing things enough to matter unless you’re referencing off of YouTube or something. I also really like the way the YouTube codec sounds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113925987080618025",
    "author": "sethearnest",
    "date": "2023-06-01",
    "content": "And along what Cian said, even within Spotify's own ecosystem (last I knew anyway), it's different from their app to the browser to streaming from Apple TV's app to wherever else, i.e. in some places, Spotify doesn't stream its loudness normalized versions, so you could end up at -14 between two -7 songs without the loudness normalization, which, if you're concerned about loudness, will be a bummer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113952684815433818",
    "author": "shaunobi",
    "date": "2023-06-01",
    "content": "Those are excellent points up above. Flip off normalization in Tidal and prepare to be amazed 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116765999111340265",
    "author": "JustinLeu",
    "date": "2023-06-09",
    "content": "Hey guys, if a client wants 2 songs to connect seamlessly but be separate tracks….I would just split the song at the desired location right? Then when they upload it to Spotify (via distrokid) is there an option they need to select?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116779945302179903",
    "author": "Nomograph Mastering",
    "date": "2023-06-09",
    "content": "3)  No special moves required during distribution",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117112652313923584",
    "author": "Gerhard Westphalen",
    "date": "2023-06-10",
    "content": "I don't deliver MP3s unless asked for since I don't want anyone releasing those",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117132510980214914",
    "author": "Gerhard Westphalen",
    "date": "2023-06-10",
    "content": "The only things which have come up lately that I don't charge extra for but are a huge pain since they're not in my normal workflow are MP3 and metadata. I should maybe charge extra for those",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121523794658472037",
    "author": "rse",
    "date": "2023-06-22",
    "content": "Trying to export an mp3 from RX, should I choose CBR, ABR or VBR, and what's the difference?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1125837198986584225",
    "author": "Michael",
    "date": "2023-07-04",
    "content": "Recently lost a client’s project before I had a chance to send a WAV of the final master. They just have an mp3. Has anyone converted an mp3 to WAV just to send to DSPs without losing so much quality that it ruins the record.\n\nJust considering what could be done before assuming I need to do a mix and master all over.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1125907221658746930",
    "author": "Michael",
    "date": "2023-07-04",
    "content": "Big ask: could you or someone with Streamliner put the mp3 (converted to WAV) through to see how it sounds? My laptop, hard drives, mixing headphones, etc were all stolen. I’m pretty compromised tech wise.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1125908530222862348",
    "author": "Adam Thein",
    "date": "2023-07-04",
    "content": "I’ve had things go weird before on DIY YouTube videos where they used an mp3 instead of the WAV and it goes into another codec and comes back very weird, happy to help on this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1125927719725695076",
    "author": "Nomograph Mastering",
    "date": "2023-07-04",
    "content": "This is a bad idea with unpredictable results in the real world. MP3 or any lossy codec works by throwing away information that it deems to be unnecessary becuase of frequency masking. When you upload your WAV (made from MP3) for streaming it will be data compressed again - MP3/AAC/OGG. This will result in very compounded data compression artifacts",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129724969467777127",
    "author": "rse",
    "date": "2023-07-15",
    "content": "currently working on a pop / ballad project. Artist is using distrokid. I'm thinking about uploading 48/24, or should I convert to anything else? Also, if I do upload 48/24, should I do any dithering at all? if so, what dithering? sorry still a little confused on when exactly I should dither",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136009849960935534",
    "author": "Rob Domos",
    "date": "2023-08-01",
    "content": "Well considering apple does SRC in the background without telling you so that you can seemlessly switch between YouTube at 48k and Spotify at 44.1k without anything switching on the hardware layer, shit can sound different there too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136192054884569228",
    "author": "Rob Domos",
    "date": "2023-08-02",
    "content": "I’m not sure it’s quite that simple. A lot of background SRC happens along various stages of information transfer without our knowledge and it’s not clear how they handle mixed sample rates from various applications being accessible to core audio at once. \n\nExample of SRC we’re generally unaware of: Airpods run at 48k no matter what, and Spotify is at 44.1  no matter what, so any time spotify is listened to through airpods there’s SRC happening. To make it even worse, if the song you are listening to was uploaded at 48, you’re getting two rounds of conversion. Down to 44 and back up to 48.\n\nSoftware engineers who can’t hear the difference and value user ease of experience are happy to do this willynilly many times over if it’s convenient from a software perspective. \n\nWith core audio, all applications, which run at different sample rates at the same time, all get summed to one channel in a way that I don’t know or understand that math decisions behind (and I’m not aware of anyone who does know the math decisions behind it, I’d love to chat with anyone who does), and it is then fed to us from that channel. How that’s handled feels like a black box to me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142097126915059843",
    "author": "Nomograph Mastering",
    "date": "2023-08-18",
    "content": "We went through a whole stressful ordeal with the DB player introducing clicks in files, replacing the files did not work, it reintroduced them in the same place. And it was not ISP or codec clipping",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142097785609519174",
    "author": "Nomograph Mastering",
    "date": "2023-08-18",
    "content": "It’s just like a Spotify or tidal window",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152979139192688670",
    "author": "hyanrarvey",
    "date": "2023-09-17",
    "content": "Then I heard it on Spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154092380312576071",
    "author": "Nomograph Mastering",
    "date": "2023-09-20",
    "content": "They’ll push out to all of the streaming platforms and some will include SRC to lower rates. Universal also always wants SD 4416 for Spotify directly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168604753329139874",
    "author": "itaylerner",
    "date": "2023-10-30",
    "content": "Not sure if this has come up before (I can’t find anything when searching) but - uploading audio to Instagram…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168605111568826390",
    "author": "itaylerner",
    "date": "2023-10-30",
    "content": "I feel like IG just sounds crappy, but maybe it’s because they have their own conversion or something? Maybe uploading a 16/44.1 .mp3 file or something would be better? Curious to hear y’all’s thoughts",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168607846884180099",
    "author": "Nomograph Mastering",
    "date": "2023-10-30",
    "content": "Is she uploading video?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168627796248109086",
    "author": "Nomograph Mastering",
    "date": "2023-10-30",
    "content": "I’m no IG expert or video but if her uploaded file has significant data compression and then gets compressed again it can be really ugly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172645837885677708",
    "author": "Maxim",
    "date": "2023-11-10",
    "content": "Quick question: currently exporting some things for a TV thing and was also asked to supply an mp3. Since the wav is pretty hot, should I gain down the file in RX like -0.3 and apply some dither before exporting it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174069692273541230",
    "author": "masteredbyjack",
    "date": "2023-11-14",
    "content": "Yo Theo! First off for the group, Theo is totally outstanding at mastering and a wonderful human. \n\nI’ve never had this request but you can embed the isrc in the wav in Wavelab, or perhaps even mp3tag (which actually edits wavs or whatever) or a similar metadata editing software (looks like mp3tag supports this under “extended tags”)\n\nMore experienced peeps feel free to correct if I’m wrong",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178086410423640246",
    "author": "Karim",
    "date": "2023-11-25",
    "content": "Oh interesting. No reason why we couldn’t make this an option. What can you tell me about your file naming conventions (before uploaded to samply)?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202312746151194724",
    "author": "Nomograph Mastering",
    "date": "2024-01-31",
    "content": "Then export various compressed formats from RX - AAC, MP3, OGG (or use something like Codec toolbox)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205186753452048436",
    "author": "montrose recording",
    "date": "2024-02-08",
    "content": "hmm no - i checked on apple music and spotify both sound distorted compared to other tracks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205187063641538643",
    "author": "chrissorem",
    "date": "2024-02-08",
    "content": "Oh strange I listened on tidal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205189778102820874",
    "author": "chrissorem",
    "date": "2024-02-08",
    "content": "It does feel quite limited. I’ll listen on Spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205190193485971457",
    "author": "David Fuller",
    "date": "2024-02-08",
    "content": "It's crackly on Tidal too, it's not a platform specific thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211004666641387530",
    "author": "Nomograph Mastering",
    "date": "2024-02-24",
    "content": "So yes, lots of the sterling guys do -0.1 as their ceiling but do that on a piano based record with sustained notes and you’re likely to have codec clipping (easy to test)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211277074095144960",
    "author": "Joshua Riley",
    "date": "2024-02-25",
    "content": "Main takeaways: \n\nAlways get a second opinion \nLet your emotions cool down before you respond to an artist \n\nContext: \n\nAn artist I work with regularly has a relatively small budget and isn’t the most experienced with the mix/master side. \nEvery track I’ve mixed for him, he’s had it mastered for free by an ME. Two songs ago he got onto experimenting with AI mastering which he thankfully moved off of because the tracks sounded horrible. \nThis last track we did, he had another ME offer to do a test master on it. I was down and just asked if I could hear it before it goes out. Fast forward, he uploads the track and the first time I hear about it was through socials. So I asked if he went with that ME and how it sounded and got told no, his drummer mate ended up mastering the track. \nSo I just got quite frustrated as him and I have quite an open relationship. Mainly because it didn’t sound that great. There was a bunch of true peak overs which thankfully I’m less stressed about after speaking to Jack\nSo I’m struggling to see if this is ego or just that I don’t trust this person who mastered the track.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1215975947677728820",
    "author": "masteredbyjack",
    "date": "2024-03-09",
    "content": "Question for the hive mind here:\n\nFinishing up a project where I mastered all but one song. Previous song is already released, sounds great. All that is needed to make it fit is to just gain down the master a bit (it was done in a previous era of the artist, one that was a little brighter/louder).\n\nAll the current mixes are at 48k. Previous master is at 44.1k. \n\nIs it okay to submit the project with all songs at 48k but just the one at 44.1k? Has anyone come across something similar?\n\nSeems ridiculous maybe but I'd like to avoid the upsample -- I know it's a tiny difference, if any but previous master was done by an outstanding engineer, would want to do as little changing as possible (and I love how it sounds too). I'm assuming since it gets converted when going to streaming all is fine but I can't find much info at even a distrokid about this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216023934391156746",
    "author": "Nick Stetina",
    "date": "2024-03-09",
    "content": "@masteredbyjack (sees the post time) I can’t tell if you pulled an all nighter or woke up wildly early on a Saturday 😄\n\nHas there been a discussion with the client on what the end destination is for this release and/or expected deliverables are? Great to have worked on and captured the original mixes as masters in their native sample rate, but if this is going to a DSP for streaming, its SRC your masters from the high-res 48k capture to 44k for submission that I’d be focused on, instead of the other way around (upsampling the original 44.1k master to 48k). If the 48k files didn’t get rejected at upload I’d hate to find out what their algorithm sounds like 😬  Better the devil you know, imo.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216034316312907867",
    "author": "masteredbyjack",
    "date": "2024-03-09",
    "content": "I’m an early riser haha. Goggins life.\n\nSo update — turns out we do have the 48k of the initial so that’s all cool. And I’m close with the producer, so we need 48k and 44k 16bit deliverables (they requested this). All easy.\n\nSo problem solved now — but still curious about if people have delivered projects with multiple sample rates as an exercise in learning\n\n@Nick Stetina it’s going to streaming but my default is to deliver the native sample rate the mixes come in at. Most distros take it almost anything, though I’ve seen more requests recently for 44k 16bit for some of these smaller, newer distros. \n\nApple will play it (in ALAC) at what’s delivered, yeah Spotify will covert but it’s making an OGG anyway (which we can check in RX) — so my preference (and I’m open to have my mind changed) is to deliver what it was created and mixed at for a lot of reasons. That seems to do great for me so far! Is there a reason you only do 44 (if I’m understanding that right?)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216083334912806942",
    "author": "Nomograph Mastering",
    "date": "2024-03-09",
    "content": "For indie upload I’m not certain that it matters, it might? But it might also just accept and spit out the mixed sample rates?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216127690759733319",
    "author": "Berlin",
    "date": "2024-03-09",
    "content": "Every time this is requested from me, it's because the artist is using CD Baby for distro (they are antiquated IMO), or they are suddently wanting to do CDs unbeknownst to me. At that point I'll offer to dither and resample and provide a DDP for CD manufacture. So nostalgic 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216176037030006794",
    "author": "Nomograph Mastering",
    "date": "2024-03-09",
    "content": "https://open.spotify.com/track/1KAJ8K4SZ4Bz4fE0AsfL8g?si=ffe59611fce34cf4",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216193868173803660",
    "author": "Herb🇮🇪",
    "date": "2024-03-09",
    "content": "Songwriters and producers get their own playlists of Apple Music and it's nice to be able to listen to discover peoples' work that you didn't know they'd worked on via it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216961527760945272",
    "author": "Rollmottle",
    "date": "2024-03-11",
    "content": "Some pretty whacky shit here. FYI https://support.tunecore.com/hc/en-gb/articles/115006499327-Uploading-Audio-Files",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216965413045534760",
    "author": "Berlin",
    "date": "2024-03-11",
    "content": "r folks really ripping from CDs to upload - seems antiquated as hell",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216969054682611722",
    "author": "Jonathan Jetter",
    "date": "2024-03-11",
    "content": "Yeah. Can't recommend Tunecore now. Can't recommend Distrokid w/ their \"mastering\" service. CdBaby stuck in the stone ages at 44/16 only. Fun times for unsigned artists.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217157133351518269",
    "author": "Edsel Holden",
    "date": "2024-03-12",
    "content": "Just curious here - who among us thinks they could identify a 16/44.1 vs a 24/48 or even a 24/96 in a blind test more than 50% of the time ?\n\n(does it even matter if CD baby only accepts 16/44 if we can't immediately tell which file is which)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217158751501422632",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-12",
    "content": "It's a good question. I definitely couldn't, but the idea of independent artists converting to one of two arbitrary formats, even if it weren't with a potential loss of fidelity at all, bugs me even at a \"wasting millions of people's time for no reason\" level. \n\nOther people on here can likely talk about whether uploading in the lower res formats will impact the conversion to streamable formats, since the source files are only that - what you hear on Spotify will (as I'm sure you know) be compressed a lot. The carelessness with both people's time and potentially quality bothers me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217159830771601500",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-12",
    "content": "how are you guys with the high bitrate MP3s? Easy to tell apart from a wav?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217159861649932418",
    "author": "Edsel Holden",
    "date": "2024-03-12",
    "content": "we need spotify to get aboard for that I think, no ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217159954679595068",
    "author": "Bryan DiMaio",
    "date": "2024-03-12",
    "content": "spotify is the last holdout for the very valid reason of:\nthe general listener doesn't care",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217159973554098337",
    "author": "Edsel Holden",
    "date": "2024-03-12",
    "content": "havent gone super high but generally last time I did the tests MP3's are an easy tell",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217160854273921165",
    "author": "Bryan DiMaio",
    "date": "2024-03-12",
    "content": "some people enjoy listening to lossless, if Spotify switched to Opus they'd still be able to have low data overhead and less of a quality dip vs mp3 but they don't care and neither do most listeners",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217160939103715391",
    "author": "Bryan DiMaio",
    "date": "2024-03-12",
    "content": "spotify has low bitrate mp3 as well when the data connection is slow",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217161492005126225",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-12",
    "content": "I wonder how many people are upscaling to 192 khz before uploading to tunecore. Seems like requiring to upload 16k videos to youtube",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217166213550182471",
    "author": "David Fuller",
    "date": "2024-03-12",
    "content": "Having done the tests on that I was *genuinely* surprised when I could hear Tidal et al sounding substantially better",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217395658647142492",
    "author": "Sam Segarra",
    "date": "2024-03-13",
    "content": "To me Qobuz sounds significantly better than Apple Music or Spotify, but that's probably because of the codecs, right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217415503195144202",
    "author": "Bryan DiMaio",
    "date": "2024-03-13",
    "content": "If you have lossless turned on and Atmos turned off, Apple Music should sound like any other service that is using the same master file",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217477843206934608",
    "author": "David Fuller",
    "date": "2024-03-13",
    "content": "Spotify is lossy for sure and it does seem to not be the greatest sounding compression algo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217483149228113971",
    "author": "Gerhard Westphalen",
    "date": "2024-03-13",
    "content": "If you have the settings set up properly they’ll be the same. I’ve compared all of the lossless streaming platforms by looping them back and then comparing to my own original masters. They’re all lossless",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217494739830571038",
    "author": "Maxim",
    "date": "2024-03-13",
    "content": "FWIW I did this too and came to the same conclusion. The files are lossless. I can play back the master inside of Apple Music and compare it to the release on streaming and they're identical. Yet, in some cases, I'm sure the files are a little different because \"Mastered for iTunes\" and \"Apple Digital Masters\" was a thing (no idea if MEs still care). Where in order to get that badge on a release you needed to submit a -1dbtp file.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217495215309455370",
    "author": "Rob Domos",
    "date": "2024-03-13",
    "content": "Actually the codec handles overs differently and we send out different masters to Apple than to other places",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217495710493184010",
    "author": "Rob Domos",
    "date": "2024-03-13",
    "content": "Something that doesn’t have overs without apples codec often will have overs after going through apple’s codec",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217501705680453662",
    "author": "Gerhard Westphalen",
    "date": "2024-03-13",
    "content": "I test that a streaming platform is lossless and then know it’s just as good as the others. No need to waste my time going down rabbit holes because someone said another one is better",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217501983511150622",
    "author": "Rob Domos",
    "date": "2024-03-13",
    "content": "To be clear, with the streaming platform conversation, I’ve never used apple and it very much could be. Qobuz, Tidal, and Spotify all sound different for sure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217502582319349911",
    "author": "Bryan DiMaio",
    "date": "2024-03-13",
    "content": "spotify is lossy so yes that makes sense but anything using the same file and giving you a lossless stream will sound the same",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217666656831148114",
    "author": "Nomograph Mastering",
    "date": "2024-03-13",
    "content": "Everything project included 192kHz 32 bit AND MP3 and DDPs and and and",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217914496727781456",
    "author": "wald",
    "date": "2024-03-14",
    "content": "I also realize ISP is a treacherous     Topic as to what can and can’t be heard, codec shenanigans etc. I guess Im just curious, having run into this for the 1st time, as to how far you guys would go/sacrifice ‘vibe’ wise, to make it go away",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220752044172771328",
    "author": "Maxim",
    "date": "2024-03-22",
    "content": "I know we killed this convo (for good reason), but I wanted to come clean since I realized that I had Apple Music lossless audio *disabled* on my iphone. Sooooo yeah...I canceled Qobuz.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220800507392561222",
    "author": "Edsel Holden",
    "date": "2024-03-22",
    "content": "Is the accepted wisdom here that Spotify normalizes off of one single LUFSi for an album? (All the songs together, this is what I understood)\n\nAudio Accountibility (Dale's thing) dropped a live saying that he has been told by the powers that be that is incorrect - and it actually normalizes off the loudest song on the album. Which is well, news to me. \n\nI often work on records that have very loud moments and very small moments, it is a bummer to realize that is lowering their normalized volume (when streaming form the album).\n\nAnyway, this blew my mind. Normalization sucks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220808085367427133",
    "author": "masteredbyjack",
    "date": "2024-03-22",
    "content": "So Dale is right on that? Is it only Spotify? Different than what I had thought too @Edsel Holden",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220808187910029322",
    "author": "masteredbyjack",
    "date": "2024-03-22",
    "content": "I know for sure there is a release I did that was released as a single alone, then with another couple songs it seems like it's not the case on Apple Music (the set is normalized as a whole there it seems)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220809854738890753",
    "author": "masteredbyjack",
    "date": "2024-03-22",
    "content": "From my understanding it's:\n\n1. Album is given an integrated LUFS score as a whole, and taken down (or turned up) according to the integrated score\n\n2. Album is turned down or up according to the LUFS score of ONLY the loudest song on an album\n\nDale says what's happening is #2 on Spotify\n\nFrom what I've seen with what I've been releasing, #1 is happening on Apple (but maybe it changed)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222544168904032407",
    "author": "masteredbyjack",
    "date": "2024-03-27",
    "content": "Alright I'm back with another question for the hive mind:\n\nFinishing up an EP today we've been slow-dripping for awhile. First song we did had big drums, tons of low, measures louder (-8.4 LUFS). Mastered and approved before the rest of them came this way. Rest of the songs are sparse, open, beautiful. But accordingly meausre much lower (loudest is -11 LUFS). \n\nSo with the new info Dale posted the other day re: how Spotify is normalizing levels, I thought let's just turn down the louder one a little to see how it fits (it's fine), maybe that can buy us a db or whatever for the other songs when they normalize to the loudest song as long as the creative intent is preserved (it is). And that's cool. But actually a better result IMO was to just ease up on the loudness of the first song (at -8.4 LUFS), it makes more sense in the project being a bit more dynamic rather than having the dense one be pulled down.\n\nQuestion is: will this cause the single version to be replaced by the new album one when going to distro?\n\nI've had masters that we replaced before with a lowered ceiling in projects and all was fine, but the actual master was exactly the same minus the ceiling, so in a single context it would normalize the same. I know to keep exact length to ms, etc etc. \n\nBut the new info Dale posted makes me rethink how to handle this in albums (on Spotify -- on Apple is doesn't seem to be doing that?)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225190673234395147",
    "author": "Montano Mastering",
    "date": "2024-04-03",
    "content": "New to the discord here but just read through the ADM chat and have an interesting follow up.\n\nI am certified to provide ADM. About a year ago I noticed that a label I work with was submitting my non-ADM files to Apple as ADM and still getting certified. I asked the label to use the ADM files in the future as I didnt want to risk my accreditation. They responded that nothing had been flagged by distribution nor by Apple but they would do so moving forward.\n\nFlash forward to this year - I noticed that some ADM files from other engineers had overs, not just clipping but significant overs, check the newest Olivia Rodrigo album. According to the aforementioned document, definitely not to spec hahah.\n\nFlash forward from there to about a month ago, I submitted my standard formats to another label I work with including standard streaming WAV as well as an ADM file. Through chatting with their distribution team it came to light that at the distro end of things they could only upload 1 file (the ADM) and this file would be delivered to each DSP in the specs they can receive, which I found very interesting since the ADM file is occasionally different than the other streaming WAVs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225912529658577020",
    "author": "Edsel Holden",
    "date": "2024-04-05",
    "content": "loopback, normal off, comparing to my own masters, same file that was uploaded to distro - i know for a fact this file was sent to distrubute",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225913300307677304",
    "author": "Edsel Holden",
    "date": "2024-04-05",
    "content": "it didnt sound all that different to Tidal to me on first listen",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225913515513086065",
    "author": "Edsel Holden",
    "date": "2024-04-05",
    "content": "interface is cool and i like how it is clear what file resolution is playing back and i like that it changed my converter sample rate as im playing back different albums... def a \"nicer\" expierence than tidal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225915533288013965",
    "author": "Edsel Holden",
    "date": "2024-04-05",
    "content": "Thats fair - I do not know shit about video editing - but a 128kbps can play out of Spotify if your internet is low connect - and thats a pretty drastic change haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225920039266291762",
    "author": "LAPhill",
    "date": "2024-04-05",
    "content": "If I listen to a master on my IB2s vs some ATC25s, that is going to have a bigger sonic difference than if I listen on Quboz or Tidal. These things matter as far as consistency for us to do work, and being familiar with your system, and your references, but... there is no unified standard of playback, and I don't think there ever can be",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1227626279709310996",
    "author": "masteredbyjack",
    "date": "2024-04-10",
    "content": "Also -- using this sorta \"new\" info that Dale shared about how Spotify is normalizing stuff right now on an album. Mixes done over the course of months, different arrangements and densities. Actually really important to know that the single loudest song will set the level for the entire album in this case. Of course the feeling is the most important - but if not adjusted in this case there would be songs playing back way quieter.\n\nI do study it all deeply, it still seems that Apple music isn't doing it that way best I can tell. Anyone else been using that info?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1228000022885302425",
    "author": "Nomograph Mastering",
    "date": "2024-04-11",
    "content": "My understanding is that majors send the 4416 directly to Spotify, all other streaming platforms are derived from the high res file",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1228009833626861669",
    "author": "Nomograph Mastering",
    "date": "2024-04-11",
    "content": "It’s easy to trip out on this stuff, just remember that the first thing that happens to your “pristine” 4416 WAV on Spotify is that is is data compressed to OGG/MP3/AAC, codec overs are baked in nicely, then level norm is applied if activated, then when it hits your iPhone/Apple TV etc it is SRC’d to 48k locally (or on a mac whatever rate you happen to be running)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1228106743616110622",
    "author": "Rob Domos",
    "date": "2024-04-11",
    "content": "A couple of things could be at play here:\n\n1) I saw a study once where participants preferred lossy audio over lossless. Maybe that’s because the OGG rolloff was just enough to make Travis Scott’s top end bearable, or maybe it’s because people have become accustomed to the lossy sound. All that to say, you could like the sound of the loss. \n\n2) It’s possible that Bluetooth is less destructive to audio than a DAC the size of a tic-tac fit into a lightening cable that feeds a port that is every bit as much for charging as it is for audio",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1228117937949511760",
    "author": "Maxim",
    "date": "2024-04-11",
    "content": "I thought it was the AD aspect initially but given that a lot of MP3 exports sound \"more pleasing\" to me than the Wav I'm totally on board with preferring a lil lossy audio.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230109062494949427",
    "author": "Iwan Morgan",
    "date": "2024-04-17",
    "content": "Anyone follow Borza Mastering? He’s posted the following image and I feel he’s right but the whole ISP/TP thing affects way more than playback level in the controlled sample (IE 44.1 wav Vs 96K wav), not to mention the effects ISPs over +1db have on codecs further down the chain.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1238193027848212601",
    "author": "Calvin Lauber",
    "date": "2024-05-09",
    "content": "Yesterday I had to click on the download button about 10 times (after refreshing several times) to get it to download a single mp3. It’s so screwey",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241409562876186764",
    "author": "Montano Mastering",
    "date": "2024-05-18",
    "content": "I would likely ask that clients specify which formats they need in advance. Anything more than a standard streaming master would add to the per song rate. Currently I include native, 441 24/16, high res mp3 in my rate. Without batch processing I wouldn’t be able to to justify the cost per time spent creating deliverables.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245813253792075939",
    "author": "Nomograph Mastering",
    "date": "2024-05-30",
    "content": "For gapless I print a single file with all processing\n\nThen find a zero crossing and split into 2 separate tracks, I don’t do a little fade in or out\n\nRe checking if it worked, iTunes is not a reliable indicator of anything ever, it’s a dead product now\n\nYou need to test several things to QC properly, all of these will bite you in the ass at some point\n\n1) Does the end of the first track (from the split file) play cleanly on it’s own\n\n2) Does the second track play cleanly (the start) on its own?\n\nIf so great. Now the big caveat \n\nStreaming services serve up many different types of files - OGG, AAC, MP3, FLAC and ALAC. From memory AAC and MP3 both add small amounts of silence at the start of file when you compress the file, this is done automatically during the data compression (and silence added can even vary depending on codec used and sample rate)\n\nThis means that what was a seamless transition between your spliced files will now have a gap, sometimes that creates an audible disturbance, sometimes not",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245813813261893632",
    "author": "Nomograph Mastering",
    "date": "2024-05-30",
    "content": "It means that what is a nice seamless transition locally can go wrong in certain streaming services sometimes, and it’s hard to predict. It can be fine on Spotify mobile but not on desktop because of the different codecs served",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245820951812112465",
    "author": "Nomograph Mastering",
    "date": "2024-05-30",
    "content": "MP3 and AAC most important",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245823898122063882",
    "author": "Jeremy Klein",
    "date": "2024-05-30",
    "content": "ahhh ok i will do this test and see how it fairs. fwiw, i just split my tracks at a zero crossing with no fade, and yeah... the audible pop has returned. (at least in Apple Music [which i originally meant, not iTunes]).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245825333945434275",
    "author": "Nomograph Mastering",
    "date": "2024-05-30",
    "content": "If you have a streaming click when you do have a perfect zero crossing split it’s because of the codec issue described above",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246030035484147732",
    "author": "Clara Araújo",
    "date": "2024-05-31",
    "content": "I've been doing this for gapless albums but it always goes with a warning to the clients. Apple music for example might play it without a problem or it might add a click. So even if you have a seamless transition, playback from streaming will probably mess it up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246033649246277672",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "Yep, it’s a bummer. It really depends on the codec served, which can vary a lot",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246052599090905119",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "Each screenshot compares WAV on top to one codec on the bottom",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246052840577958009",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "Ogg Vorbis (as used on Spotify) - off to a good start. Looks and plays fine",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1246053120631640198",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "MP3 Fraunhofer Codec - look closely! It's messed up and sounds it too",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1246054033261727785",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "- \"Hey my record is fucked on Apple Music!!\" ... \"Sounds fine here\" - if one person is on lossy and the other is set to lossless they will hear different things",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246054358777462834",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "- \"MP3 causes a gap\" ..... yes, but see how it's much worse with one codec than the other. With a careful edit Fraunhofer could probaly play back fine on a lot of transitions, Lame pretty much never",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246054443045093376",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "- Does bit rate effect how long the inserted silences are with MP3 and AAC/M4a - I would suspect so. Can someone do the test today?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246055168898764883",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "One thing is clear, a lil' fade out and a lil' fade in is a band aid on a decapitation with MP3 and AAC/M4a, and could actually *introduce* problems where there were none with ALAC, FLAC and OGG",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246163091398459484",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "Bluetooth is its own kinda Wild West, some of the graphs on ASR for different codecs are wild",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246254226753978468",
    "author": "alex stinson",
    "date": "2024-05-31",
    "content": "Great breakdown- thanks @Nomograph Mastering! As a classical music guy I’m delivering seamless masters regularly (just the nature of the music). Most of the time streaming alongside DDPi. Spotify always worked (Ogg) but I hadn’t considered what happens when the codec or bitrate changes. Food for thought 🤔",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246255849467285554",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "Spotify usually fine (on the device / quality level you listen on)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246258011844903003",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "(Important to note that you’ll get different answers often on the above even from Spotify, it changes)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246260309874839604",
    "author": "Nick Stetina",
    "date": "2024-05-31",
    "content": "Any idea why they would “highly recommend FLAC”? Doss the 60k song uploads a day have Spotify gently nudging artists towards a format with a slightly smaller file size so they can keep up with storage demands?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246264945818210305",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "Dropping Spotify's 2023 Annual report into GPT4o",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1250138768011300865",
    "author": "mixedbywong_my",
    "date": "2024-06-11",
    "content": "Whatever happened to mastered for Spotify !??!??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1253087636076367993",
    "author": "Berlin",
    "date": "2024-06-19",
    "content": "Standard practice for me is \"If approved, this one is ready for upload/distro.\" That way if she's good to go, the she's good to go.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1253089814681489490",
    "author": "Edsel Holden",
    "date": "2024-06-19",
    "content": "Well, I used a few different players over the years. Dropbox, one I can't remeber, and now samply. I remember on the one I can't recall, it had OPTIONS for the download - like a WAV, FLAC, MP3 lmao ... so since then i am we tarbsfer only for deliveries",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1253716513052033126",
    "author": "Eric Martin",
    "date": "2024-06-21",
    "content": "remember when every mastering engineer had their own web uploader coded into their website with dedicated FTP and didn’t rely on 3rd party components?\n\nIt’s easier now, no?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254967246531465287",
    "author": "Nomograph Mastering",
    "date": "2024-06-24",
    "content": "Make a player with my default settings for lossless and when I paste into a different browser it's defaulting to Adaptive AAC",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254967493706121226",
    "author": "Nomograph Mastering",
    "date": "2024-06-24",
    "content": "Double checked by toggling the lossless on my make player menu and pasted into a cache cleared browser and still defaults to AAC",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254970394843025443",
    "author": "Nomograph Mastering",
    "date": "2024-06-24",
    "content": "I've had it only once ever and it was becuase the player had switched to AAC",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254972593778331710",
    "author": "Rollmottle",
    "date": "2024-06-24",
    "content": "i saw it both ways on mobile. just tried incognito and confirmed the above broken adaptive AAC behavior. upon playback, it switches to lossless as it should be.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255013101401542686",
    "author": "Nomograph Mastering",
    "date": "2024-06-24",
    "content": "Thanks for the clear reply. I think I’m realizing in realtime that given the nature of the work, and how critical this bridge to clients is in the mastering stage that the constant upgrades and risk of errors is more than I can bear. My work moves at blistering pace (often against my will) and I have to be able to trust that what I send is what they hear, securely. No “oh the bandwidth was bad so we switched to AAC” or any of the other ways things can break",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255081712493396029",
    "author": "Iwan Morgan",
    "date": "2024-06-25",
    "content": "I’m also experiencing the AAC issue and not sure gapless is working even though selected.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255176562848825394",
    "author": "eschirtz",
    "date": "2024-06-25",
    "content": "Is this the same AAC issue as described above? Once you press \"play\" on a track, does it correctly say \"Lossless\"?\n\nIf you have an example link that fails to say lossless after playing (or is failing in any other way), are you able to share with me via DM so we can investigate?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255204586361458729",
    "author": "Nomograph Mastering",
    "date": "2024-06-25",
    "content": "But when I’m asked it’s usually by someone who thinks in error that they need that for streaming, and once I explain that it’s entered manually on upload the question usually goes away",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255204994349662288",
    "author": "Nomograph Mastering",
    "date": "2024-06-25",
    "content": "If you gotta make it happen something like an MP3 tagger should allow it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255293420973592597",
    "author": "James Cronier",
    "date": "2024-06-25",
    "content": "I was literally having an issue with samply not being lossless by default today. Like when I send a samply link to a client, the 𝘥𝘦𝘧𝘢𝘶𝘭𝘵 option on mobile is set to adaptive.\n\nWhen I recorded the lossless output into my DAW, it nulled with my bounce. The AAC did not. \n\nI’m hoping it gets sorted because it’s a fantastic experience otherwise.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255294382102544404",
    "author": "Nomograph Mastering",
    "date": "2024-06-25",
    "content": "Re-read some of the above, if you have selected lossless it does in fact play losslessly.. but when you open the player link it shows AAC",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255294989286506589",
    "author": "James Cronier",
    "date": "2024-06-25",
    "content": "I see.  my null test failed was when I selected AAC on purpose to run the test.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255295089803006073",
    "author": "James Cronier",
    "date": "2024-06-25",
    "content": "Which makes sense. Now I understand it’s not actually AAC by default.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255300055406088293",
    "author": "Nomograph Mastering",
    "date": "2024-06-25",
    "content": "Enjoy it, i’m … ahem …. at the opposite end of the distribution",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256344053151305789",
    "author": "Bryan DiMaio",
    "date": "2024-06-28",
    "content": "Opened my Apple Music app, saw new Local Natives, thought “damn they’re dropping like crazy lately, let’s check to see if Ruairi is on this one”, put it on and checked the credits, lo and behold it’s a great record, really set the mood for the vacuuming I had to do",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1263973513723904081",
    "author": "Berlin",
    "date": "2024-07-19",
    "content": "we just need a player that plays exactly what we upload, consitently and losslessly. 🙏🏼",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1263978085686968493",
    "author": "Berlin",
    "date": "2024-07-19",
    "content": "sometimes when I upload an ADM for atmos, it completely glitch locks the entire project for all the other files in there... so i stopped doing that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266806523749728358",
    "author": "Iwan Morgan",
    "date": "2024-07-27",
    "content": "I did take a screenshot of the codec issues and sent it to a couple of close clients and we ended up tweaking our pauses a little bit afterwards",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266811148356030524",
    "author": "Nomograph Mastering",
    "date": "2024-07-27",
    "content": "Truly the best thing would be to make a fake tone record and push to distribution so we can actually record from the streaming services",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266830355881791499",
    "author": "Nomograph Mastering",
    "date": "2024-07-27",
    "content": "Yep, with the last tests we saw how just two different MP3 codec gave different results",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266975518692085826",
    "author": "Nomograph Mastering",
    "date": "2024-07-27",
    "content": "And I think we should upload in 44.1, 48k & 96k to see what changes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266976497315614781",
    "author": "Nomograph Mastering",
    "date": "2024-07-27",
    "content": "I’ll pay the distribution fees if you can do the test",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266982263598354442",
    "author": "tim adamson 🇦🇺",
    "date": "2024-07-27",
    "content": "Idk if this would screw with the intended test but you could off set the -6 difference on one of the channels by a set cycle amount as another variable. If there are say three cycles at +/-6 on each end it would be much easier to count any cut offs/excess from the original upload ...not sure if that would help",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1268948332831571968",
    "author": "Nomograph Mastering",
    "date": "2024-08-02",
    "content": "For the codec delay question I can’t, great work",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1268962235288391710",
    "author": "Iwan Morgan",
    "date": "2024-08-02",
    "content": "I’ll probably only upload one sample rate (24/48) at first maybe do others if we feel it’s needed @Nomograph Mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1268963551524032522",
    "author": "Nomograph Mastering",
    "date": "2024-08-02",
    "content": "DM me PayPal or whatever and I’ll pay the distrokid fees",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1269611823204798597",
    "author": "rse",
    "date": "2024-08-04",
    "content": "Just exported a final master of a techno track (24bit - 48k wav, mastered to -0.25TP) and now trying to convert to other file formats for dj's etc. I'm doing this in rx but I'm not sure this is the \"correct\" way. Flac, aiff exports are all fine, 320kbps mp3 is clipping (expected due to conversion). Since I dithered my final master before export (24bit dither), can I now just gain down the track a little in rx to avoid clipping in the mp3 file? or does this mess up dither etc? What's best practice here?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1269688983575855205",
    "author": "Nomograph Mastering",
    "date": "2024-08-04",
    "content": "But know that pretty much every major track for the last 20 years clips like that when converted to MP3",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270038426712014999",
    "author": "Iwan Morgan",
    "date": "2024-08-05",
    "content": "Anyone familiar with distrokid? The test EPs i uploaded over the weekend seem stuck on the two sine wave tracks. Every other track has been accepted but on one of the EPs (2444) one of the tracks has been Distrolocked. Wondering if I should insert some random audio in the middle of each sine wave.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270058105903906858",
    "author": "Edsel Holden",
    "date": "2024-08-05",
    "content": "https://support.distrokid.com/hc/en-us/articles/360024829334-What-is-DistroLock",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270067304734134403",
    "author": "Zach Hughes",
    "date": "2024-08-05",
    "content": "I think DSPs in general are trying to cut down on non-music (i.e. white noise, maybe sine wave) track uploads. Shit rolls down hill to the distributor and they might be throwing a pretty wide net so as not to have to deal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270794845899984897",
    "author": "Zach Hughes",
    "date": "2024-08-07",
    "content": "You could try manually selecting what DSPs you want to upload to on DK rather than uploading to all available",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277037243663650898",
    "author": "Karim",
    "date": "2024-08-24",
    "content": "Agh metadata is weird because outside this channel not a ton of people have fully internalized that WAV files don’t have the metadata they’re looking for. \n\nI think we’ll keep it as a separate field that you can configure or turn off. If you uploaded a file with metadata that’ll of course take priority.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278115887320268842",
    "author": "Ted Whitten Media",
    "date": "2024-08-27",
    "content": "I'll see if I can find the discussion and link to it. But the short version is, encoding to AAC, Mp3 etc messes with the start of the file sometimes, depending on the codec. So files that are perfectly gapless in WAV will have sometimes short gaps at the beginning of each track after encoding.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278116631150727270",
    "author": "Ted Whitten Media",
    "date": "2024-08-27",
    "content": "So once my client uploads their album to Spotify, if the user gets an OGG stream, it'll play perfectly most likely, and if they get AAC there will likely be short gaps at the beginning of each track. It's out of our control.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278128345074372608",
    "author": "Berlin",
    "date": "2024-08-27",
    "content": "Yeah, basically once transcoded into different codecs, we all cross our fingers praying for mercy on gaplress programs on DSPs haha.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278128594576605316",
    "author": "Berlin",
    "date": "2024-08-27",
    "content": "If you don't use something like wavlab (since you are mixing and not mastering), you can use little programs like mp3 tag or tag editor lite to embedd your metadata",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278129720327934013",
    "author": "Ted Whitten Media",
    "date": "2024-08-27",
    "content": "I'm still struggling to get the Wavelab presets to do what I want so I end up using mp3tag anyways. 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278130753103855616",
    "author": "Ted Whitten Media",
    "date": "2024-08-27",
    "content": "Yeah I've just been baking it in so it's still there when I make the mp3's. Probably a waste of time, but who knows. Eventually I need to sit down and probably just go steal Justin's files so I can figure out the metadata presets.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278453313594986597",
    "author": "Nick Stetina",
    "date": "2024-08-28",
    "content": "I have crates and crates of vinyl as a preferred way of supporting bands and displaying it like artwork in our home, but I’ll never be the guy to wax poetic about how it “just sounds better”. It sounds worse and it’s inconvenient. I’ll stream Spotify on the main floor while making breakfast for my family in the morning, you won’t catch me flipping from side A to B. 2x LP can fck all the way off.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1281682565455024301",
    "author": "Edsel Holden",
    "date": "2024-09-06",
    "content": "Tone Tree said Tunecore kicked it back",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1281682658765574217",
    "author": "Berlin",
    "date": "2024-09-06",
    "content": "Tonetree is using tunecore!?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1281683096126886023",
    "author": "Berlin",
    "date": "2024-09-06",
    "content": "Yeah I've had a few snags with Tunecore over the years as well and I just have to tell them to send it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283949647701741699",
    "author": "aidanthillmann",
    "date": "2024-09-12",
    "content": "@masteredbyjack True Peak is definitely a can of worms we don’t need to get in to, but do you have any rules of thumb on how to set a good ceiling level? I feel like the general wisdom is that if peaks aren’t too bad, say over 1db then it isn’t too much to fuss over. That’s all I know haha\n\n@Rollmottle see all the alt passes and any physical release stuff, that’s where I would hope that if a client needs all that they have the budget for a pro. I will draw my line there haha. I think 99/100 clients of mine just want a mastered version of the mix to upload to streaming and that’s it, not even any mastered alt passes or anything else really. So I’m just wondering any best practices for the main master file",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283980088366600264",
    "author": "masteredbyjack",
    "date": "2024-09-12",
    "content": "The only time I specifically avoid true peak (I don’t think I’ve ever actually preferred true peak limiting) is on an open ballad type song, pianos in the open and it’s still getting limited, etc.\n\nUsually it’s no issue. But I will draw down any very big ones, just to be sure\n\nBest thing to do though is just make the actual codecs in RX or something — you can listen to them and actually check them (Ruairi posted stuff about this awhile back but I’m not sure what you would search to find it). Thus no guess work.\n\n@Rollmottle with great tips no surprise",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293430757716529172",
    "author": "Berlin",
    "date": "2024-10-08",
    "content": "the distrokid mastering optimization to -14 lufs option for 14.99 got a lot of my clients for a season.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293569693428224030",
    "author": "DarrenB",
    "date": "2024-10-09",
    "content": "I landed a project after an artist heard this 'enhancement.'  I've also helped a band with the Distrokid uploads (they weren't the most tech savvy).  There's way too many buzzword pitfalls presented when making your way through.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293587843246981162",
    "author": "Ted Whitten Media",
    "date": "2024-10-09",
    "content": "Wait, do you have to pay for that enhancement nonsense to get the tidal max badge now? Guess I need to log into distrokid and see what the hell they've done",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293588524968444037",
    "author": "Ted Whitten Media",
    "date": "2024-10-09",
    "content": "This is a great idea. I've got an account with Distrokid, but they're the only one.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293611363834269749",
    "author": "Berlin",
    "date": "2024-10-09",
    "content": "Last I saw yeah, u have to pay for the tidal max badge, even if you upload at 48k 24bit, they will SRC to 44,1k and deliver to tidal that way unlessssss u click the little box and pay $$",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293615773356396564",
    "author": "Nomograph Mastering",
    "date": "2024-10-09",
    "content": "Is there an aggregator/distributor that doesn’t suck like this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293619253123223625",
    "author": "masteredbyjack",
    "date": "2024-10-09",
    "content": "Just had an ATMOS \"master\" I did rejected by Tunecore, after getting in touch with support, checking it a million times (thanks @Nacho Sotelo + @🗽🍕😼 ), they came back to us and said \"oh wait it's on our end, we are having problems uploading ATMOS\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293619689485766717",
    "author": "Edsel Holden",
    "date": "2024-10-09",
    "content": "https://artists.spotify.com/providers?_ga=2.55267810.877770257.1728493335-471288581.1723499928",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293619857841066085",
    "author": "Edsel Holden",
    "date": "2024-10-09",
    "content": "its kinda strange you cant go strait thru spotify lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293620756093210654",
    "author": "Berlin",
    "date": "2024-10-09",
    "content": "A couple of my artist are using Symphonic with decent succes as well, they are MAX on Tidal, but don't know if they paid for it or not. I'll ask!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293622547996348530",
    "author": "Rollmottle",
    "date": "2024-10-09",
    "content": "I see Symphonic now has a DIY tier. I'm on their partner tier as I was brought in way early by a friend who works there, but they have been great. Soundcloud also now has a distribution service and we used that for our last release and it also seems fine.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293624050010034318",
    "author": "Berlin",
    "date": "2024-10-09",
    "content": "Yeah... working with alot of indies who are self produced and mixed and want to make sure they aren't fucking up their release, they get caught up in the distrokid marketing jargon.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301981327960309981",
    "author": "Edsel Holden",
    "date": "2024-11-01",
    "content": "i see some mentions of -2 TP / -14 but surely that is hogwash\n\nWould be cool to upload some dummy masters to tik tok sometime and see what happens",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301981696719327302",
    "author": "Edsel Holden",
    "date": "2024-11-01",
    "content": "Very interesting.\n\nI always notice on IG that the original post sounds OK, and the re shares get way worse.\n\nI wonder if something gets double encoded on tik tok sometimes depedong on how the content is made and uploaded",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301991463000997989",
    "author": "Nomograph Mastering",
    "date": "2024-11-01",
    "content": "Double conversion always a risk where a client uploads video with already data compressed audio that then gets level norm’s and data compressed again",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1302039066107445269",
    "author": "Iwan Morgan",
    "date": "2024-11-01",
    "content": "Also, there are a shit load of video export options in something like Adobe Premiere, and the audio is usually downsampled and compressed depending in the codec used.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1307060581580279868",
    "author": "Nomograph Mastering",
    "date": "2024-11-15",
    "content": "The kind of thing that sound loud on Spotify with normalization turned on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1307063764645843035",
    "author": "masteredbyjack",
    "date": "2024-11-15",
    "content": "https://open.spotify.com/track/44W2FeI0SRWDleedTeaD7O?si=67a60c0137a94aaf",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308314247507214338",
    "author": "vostral",
    "date": "2024-11-18",
    "content": "Can i ask you this @Nomograph Mastering . If you turn off the Normalization on Spotify (my favorite streaming platform), does Please Please Please you mastered sound exactly what you delivered as the final version?? Or is it slightly different due to Spotify processing? Just out of curiosity b/c lately im so addicted to this song!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308324645283565618",
    "author": "Nomograph Mastering",
    "date": "2024-11-18",
    "content": "Sounds different because of the data compression used on Spotify. Depending on the platform you’ll be listening to either AAC or OGG Vorbis",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313563661326880900",
    "author": "masteredbyjack",
    "date": "2024-12-03",
    "content": "Definitely a thing among the younger generation from what I can see. Also the Distrokid enhance or whatever it is...yikes. Definitely need to coach people on that, there have been several instances where entire albums we did were almost ran through it (the masters, not the mixes) at the last minute\n\nIt slams it, makes it very bright (from what I've seen), only gives you a small sample and then goes \"DON'T YOU WANT TO PAY TO HAVE YOUR MUSIC SOUND BETTER SEE HOW MUCH BETTER (louder) IT SOUNDS?\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313567811267989526",
    "author": "Rob Domos",
    "date": "2024-12-03",
    "content": "This aggressively makes me want to find an alternative recommendation  for artists to steer them away from distrokid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313568216538152992",
    "author": "masteredbyjack",
    "date": "2024-12-03",
    "content": "It's honestly almost tailor made to induce uncertainty (and hence make them money). And the price point is so low people are like \"eh why not\". Placed right before you hit upload of course",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1314719426486210630",
    "author": "Ted Whitten Media",
    "date": "2024-12-06",
    "content": "So someone in here had recommended setting up dummy accounts for the all the distributors so you could see what the clients are seeing if they're self publishing.\n\nWhat other distros are out there besides Distrokid, Tunecore, and CDBaby?\n\nI've been a long time Distrokid user, but I just signed up for the other two, and man, they make Distrokid look bad. Lol. Distrokid tries to sell you so much garbage, some of which can totally ruin the song. Overall, I think I like Tunecore's interface the best though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1314719718556307578",
    "author": "Ted Whitten Media",
    "date": "2024-12-06",
    "content": "Neither of the other two seem to have any BS options they try to sell you either. Certainly nothing I need to warn the client about (unlike Distrokid 🤮)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1314721797790236755",
    "author": "Ted Whitten Media",
    "date": "2024-12-06",
    "content": "Ha, I never even thought of that. Guess I need to check out that and Bandcamp and see what their interfaces are like. Haven't used SoundCloud in over a decade!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1320402820419293246",
    "author": "Ted Whitten Media",
    "date": "2024-12-22",
    "content": "Well, I found something else to put in my \"don't check these boxes when you upload your music\" email. This one seems pretty terrifying too. In the description of this video is a link to a longer more in depth video by an entertainment lawyer if you want to dive deeper.\n\nhttps://youtu.be/KXnEvIxYiXQ?si=eyLvN1QOWr8b1xC3",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324789150234181663",
    "author": "allearsmastering",
    "date": "2025-01-03",
    "content": "yep I know but man in that video its like 5-6dB clipped hahah . I listened to the song on spotify and its not that clipped. Still wondering how it was done. Possibly like declipped in rx after mastering? I am just so curious because I really respect Em's work. Still baffled lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324792247060795433",
    "author": "allearsmastering",
    "date": "2025-01-03",
    "content": "this is the released song from that webinar and now I promise I will stop obsessing over this lol : https://open.spotify.com/track/2ewEhuwTwSCOCgQhOP9uzs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1329530382218956800",
    "author": "Théo Quayle",
    "date": "2025-01-16",
    "content": "Do you guys have a rate structure for alts when they start getting crazy?\n\nI just had a client request all the usuals (INST, ACA, TV) in 16/44, 24/48, 24/96, and mp3s of each. Plus master prints on 6 or 7 stems \n\nIncluding the mains, we’re looking at a 23 file deliverable package for a single, but it seems ridiculous to charge them 20x my usual per alt rate so I’m thinking of capping it off somewhere. \n\nAre you guys packaging alts or capping the cost on them in any way to keep things reasonable?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330668555733307522",
    "author": "Will Pragnell",
    "date": "2025-01-19",
    "content": "How much are people worrying about mono compatibility in 2025? I know that many small bluetooth speakers, etc. are still summing to mono, so it feels like it matters to me. That said, I'm noticing a lot of recent releases that seem not to care. Latest example is https://tidal.com/browse/track/371179904?u - huge chunks of the strings just dissapear in mono, and looking at a correlation meter while it's playing I can see that it's negative a lot of the time. Would you have let this go out like this? How do you approach it if you get a mix like this? (edit to clarify: not asking about the technical side of how to fix this sort of thing, asking about how you think about this kind of stereo material, how you approach it with clients if you feel it needs changing, etc.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330695292663758908",
    "author": "Will Pragnell",
    "date": "2025-01-19",
    "content": "Great question. Let me try to answer. I suspect this may be where the learning opportunity lies...\n\nI think what matters to me is that 1) the piece is presented in the best way possible to maximise its impact or essence 2) the piece is listenable and that impact is not lost in a wide range of environments / contexts (i was tempted to say \"it translates well\" but I think that's a subtly different thing) 3) the client is happy with the result, and feel confident releasing their art, feeling good about it, feeling it's the best version of what it could be.\n\nI think it's point 3 that gives me pause. You can count my paying mastering clients on one hand, so I'm as \"beginner level\" as it gets, but that said, when i talk to those clients, they share with me that they want a mastering engineer to ensure that their music is going to \"sound right on streaming platforms and translate well to lots of systems\". There's a lot of FUD about loudness normalisation, LUFS, etc. I don't think it's a huge leap to feel that we should also be thinking about common playback devices such as airpods, and bluetooth speakers. For clients who aren't seasoned mixers or record makers, I wonder how they would feel if they listened to their mastered record on a bluetooth speaker and heard that whole parts had practically vanished. Of course I'm also sensitive to not wanting to introduce doubt in their minds unnecessarily.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1332503691973890200",
    "author": "Ted Whitten Media",
    "date": "2025-01-24",
    "content": "I never recieve Samply links either, I use the upload portal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1333625513201238036",
    "author": "Felix Byrne",
    "date": "2025-01-27",
    "content": "$800 reprint\n$400 archive fee\n$200 High Res audio fee for the 48k bounce\n$200 low res audio fee for the mp3 bounce\n$100 processing fee",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337574475264430191",
    "author": "Paris Lee",
    "date": "2025-02-07",
    "content": "…don’t get me started about Samply…and I have no desire to. I’ve said my peace to them, I’ll just leave it at that and live my life. \nTheir problem really is they update the software way too much  and also IMO promised something and then had unanticipated issues scaling up. But that’s pure conjecture. \n\nI use it for internal playback because it’s still the best, but I no longer send it out as a review method for clients \n\nFor the record though, one time i had a record on Apple Music have a bad pop on a song intro , in the same spot every time when i rewound it, I was horrified and felt like a complete asshole. \n\nI restarted Apple Music and played it again\nIt was fine. \nShit happens…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337596737031766061",
    "author": "Rollmottle",
    "date": "2025-02-07",
    "content": "is your Apple Music buggy too? i'm on latest phone and OS and it's always been great for me, even untethered to Wifi",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346646053373476935",
    "author": "Nomograph Mastering",
    "date": "2025-03-04",
    "content": "I’m not sure I understand why you’re not pulling the files onto a local drive to work on before re - uploading",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1349779653266505749",
    "author": "Edsel Holden",
    "date": "2025-03-13",
    "content": "going to war with Steinburg support about wavelab liscnse today. wish me luck. Somehow, my license is gone .... if you guys use a dongle make sure you upload your license to the cloud before May. I have ignored all the emails about it and about to pay for it lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350447149518819359",
    "author": "Nick Stetina",
    "date": "2025-03-15",
    "content": "I’ve seen a handful of instances recently where a project was recorded and mixed at 48k24b and only one set of masters were provided back, in some instances 44k16b, others 44k24b (the latter seem to be more common with engineers at Sterling). \n\nI know a lot of you deliver in the native resolution provided and deliver other sets of files if asked. Just curious if you’re providing direction to an artist/mgmt on what is best to upload to DSPs these days?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350483286803087360",
    "author": "Ted Whitten Media",
    "date": "2025-03-15",
    "content": "I was surprised to hear a gapless album I did that was just released. Some tracks were seamless and some were not, seems like the material has an effect on how the codec behaves more than I thought it would.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350483793982783664",
    "author": "Nomograph Mastering",
    "date": "2025-03-15",
    "content": "I’ve never heard of a streaming service delivering mixed codecs on a single project, unless of course you were on mobile and it was dynamically switching because of bandwidth",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350483954171510815",
    "author": "Ted Whitten Media",
    "date": "2025-03-15",
    "content": "Yeah it seems like the amount of silence varied. Some sounded perfect, with no gap at all (which is think is probably due to the gapless option in Spotify, which I'm guessing does a tiny bit of Kentucky windage to account for the gap induced by the codec).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350484190105436211",
    "author": "Ted Whitten Media",
    "date": "2025-03-15",
    "content": "No it's all the same codec, it just seems like the encoding didn't always have the same gap at the beginning. Or maybe it's the gapless option doing a better job on some songs, I dunno.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350484602384551937",
    "author": "Nomograph Mastering",
    "date": "2025-03-15",
    "content": "I have never once in my life had gaoless turned on in Spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350485147115589633",
    "author": "Nomograph Mastering",
    "date": "2025-03-15",
    "content": "But I have big experimented since I first heard it when Spotify launched and was like “hard no”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350502791608795166",
    "author": "Ted Whitten Media",
    "date": "2025-03-15",
    "content": "I captured the transition between two tracks, then compared to the original WAV files and they lined up perfectly (tried this with both the Automix feature and the Crossfade feature set to 0, same results either way). Gotta see what stream the desktop app is using though, if it's OGG that would make sense, I think OGG encodes the padding amount in the metadata so it knows exactly how much to remove when gapless is requested. (the split between tracks one and two is just left of cursor on the top track)",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1350504399436251250",
    "author": "Ted Whitten Media",
    "date": "2025-03-15",
    "content": "Actually managed to get Spotify support to escalate my request to someone who might actually know the answer, they're gonna email me at some point in the next couple of days.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350511954732515489",
    "author": "Ted Whitten Media",
    "date": "2025-03-15",
    "content": "This must have been OGG then it looked perfect. Is there way to measure what codec is steaming, or observe it anywhere? Or just have to take Spotify at their word?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350512911793262716",
    "author": "Nomograph Mastering",
    "date": "2025-03-15",
    "content": "And iirc Amazon is always MP3 unless lossless I selected",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352714598595432479",
    "author": "Nomograph Mastering",
    "date": "2025-03-21",
    "content": "I’m decades in with every kind of label and distribution and have never once encountered",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352756093889282131",
    "author": "Berlin",
    "date": "2025-03-21",
    "content": "i have had distros push back on me before from Distrokid to ADA.. tbh i think it’s just whoever is in the QC chair that day. \n\nThe one with ADA was a note about a gapless program that was playing back with a “pop” on their end. \n\nThey sent the note to label and mgmt, label and mgmt come to me and tell me to fix it..\n\ni check the master, no pop, plays through perfect on samply, DDP for cd? perfect.\n\nI send the two track’s WAVs back with a “.nopop.wav” suffix, rename only, and then ADA passed it.\n\nWent up on streaming with no issues.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352803986981257278",
    "author": "Slow Hand",
    "date": "2025-03-21",
    "content": "I'm still waiting for streaming platforms to introduce the varispeed slider to music playback.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353431866484592671",
    "author": "Gerhard Westphalen",
    "date": "2025-03-23",
    "content": "Anyone else here have constant problems with the Tidal desktop program? I switched from Amazon music partially because their desktop program wouldn't always load my library properly and the iPhone app stopped working completely (would stop playing in the car and wouldn't load my library) but my experiences with Tidal haven't been much better. The quality settings never seem to work and it constantly has problems with playback. Not playing at all either mid album or when I try to start a specific track, skipping tracks, and even weirder is if I'm listening to one album and then switch to a different one, it'll often throw in a track from the old album while acting like it's still playing the new one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353436753729683618",
    "author": "DarrenB",
    "date": "2025-03-23",
    "content": "That's odd.  I've been on it for 10 years across desktop OSX and Win 10 & 11 as well as iPhone and haven't had any of these issues.  I have Spotify too as that's what it seems everyone uses to send playlists, but Tidal is my main playback for sonic references and enjoyment.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353487496809418823",
    "author": "Rob Domos",
    "date": "2025-03-23",
    "content": "I’m open to it being placebo because I’ve been wrong on stuff like this before but Qobuz sounds more accurate than tidal  to me. I’ve played them back to back a number of times and was recently hyped when Tidal got rid of MQA thinking that was the problem but I still hear the difference",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353499891732709418",
    "author": "Rob Domos",
    "date": "2025-03-23",
    "content": "Yeah I have no interest in going that deep. It’s just not meaningful. I would be down to buy anyone lunch who would be willing to come over and toggle between Qobuz and Tidal without me being able to see the screen to see if it’s all in my head or not",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354190844374290637",
    "author": "Ted Whitten Media",
    "date": "2025-03-25",
    "content": "A little update to an earlier discussion about gapless playback on Spotify. I was able to actually get in touch with someone who confirmed that both their OGG and AAC streams have gapless capability, and, more importantly, they also confirmed that gapless is simply designed to remove the silence added by the encoding process and will not touch anything in the original master. So at least timing wise, listening to an album with gapless playback enabled should exactly match the master.",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1354193210032787547",
    "author": "Zack Hames",
    "date": "2025-03-25",
    "content": "Interesting. I guess every car I’ve ever driven just hasn’t supported it, or it’s gotten better.\n\nI’m not doubting you - just expressing frustration that there’s always a gap when I start any song on Spotify if it’s from the CD era",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354461258396471448",
    "author": "Sam Proctor",
    "date": "2025-03-26",
    "content": "Hi all, long time lurker first time poster! \nI am working on an album and three tracks have already been released on steaming. One of these I am remastering and two we are using masters I previously did.  The artist wants to upload the remaster with the same ISRC  to keep the play count in Spotify. \nHe says the new file must be exactly the same length as the old master. Is this the case?\nThe problem being that the single versions of the three tracks don’t have a gap burned at the end to get the track spacing right and I would prefer the track spacing from the CD to be the same on streaming rather than jumping straight in. \nAnyone got any intel or solved this in anyway?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354506154692050954",
    "author": "Goldring",
    "date": "2025-03-26",
    "content": "Not totally sure, I figure it'd be good to have it regardless. Hopefully they can just upload the file and be good, I just wouldn't want to cause any headaches for the clients if I can prevent it!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355169918504669234",
    "author": "Austin Gordon",
    "date": "2025-03-28",
    "content": "Question for the group: anyone ever experience issues with Apple Music messing with the audio of a track post-upload? Had a master come out this morning that I did for an artist, and there is a noticeable pop about 3 seconds in that wasn't there in any of the OG masters. Checked it on Spotify and it's not an issue there. Doesn't appear to be a buffering issue.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355191454645096561",
    "author": "itaylerner",
    "date": "2025-03-28",
    "content": "Mind DMing me the song? Just curious haha. I’ll check on Apple and Tidal see if it’s there on my end",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1367509292542070955",
    "author": "Ted Whitten Media",
    "date": "2025-05-01",
    "content": "Hmmm, I never checked that module out, but assuming it's just like the codec preview in Ozone, I never bother, unless I'm just bored and am curious how things like peak level might change post encode. \n\nHow would it be used to rebalance a mix? If it's mentioned in the YouTube video, I'll go see if I can find it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1367510230631714827",
    "author": "masteredbyjack",
    "date": "2025-05-01",
    "content": "But once you understand it and study it you can absolutely apply the concept in musical ways if it fits the track, I have for sure gotten things to come on Spotify, etc at least +1db louder with essentially zero downside (I'd argue more connection) when it fits the record",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374486583209627808",
    "author": "masteredbyjack",
    "date": "2025-05-20",
    "content": "it almost certainly would not be a problem on release -- Spotify and everything will play back with a lower peak value than the digital file and thus break ups solved (usually). I know you so I know you would leave enough headroom for good codec conversion",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374487477418594425",
    "author": "masteredbyjack",
    "date": "2025-05-20",
    "content": "But if anything of the genre \"spotify sounds fine but the master is clipping my phone/car\" and it's happening when the volume is turned all the way up, usually it's a digital file peak thing, that the master is playing back near the edge of what these systems can handle",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382454635582980188",
    "author": "lystell",
    "date": "2025-06-11",
    "content": "I am not a mastering engineer but I could use some guiding thoughts regarding mastering.\n(I am not a mixing engineer either but I mix some songs of ours that get released)\n\nI have noticed that some of these songs are/are perceived as low in level in comparison with some others on Spotify. \nI know I got lots to learn when it comes to perceived loudness etc, but I feel that are some aspects of the mastering for streaming that I need to understand better. \n\nFor example. I got a song mastered where the master measures at ca -8dB. I like how it sounds/feels. \nAs an experiment I tried uploading it on the site loudnesspenalty.com. After analyzing the result is showing that Spotify is lowering it by 5,5dB. That being that Normalization is on in app I suppose.\n\nI'd appreciate some advice in this subject:\n-  what should I draw as conclusion for me as a mixer in this case\n-  what should I think of in the dialogue with ME",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385659991138107495",
    "author": "aliberger",
    "date": "2025-06-20",
    "content": "i think i'm getting better at striking a balance and finding the character in that distribution, maybe just continuing to refine that is good but would be down for any suggestions/tricks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1390389830881513593",
    "author": "Nomograph Mastering",
    "date": "2025-07-03",
    "content": "If someone edits and stretches and uses an MP3 source in Ableton and SRC La but wants a remote thumbs up from me, they won’t get it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1403572713548681416",
    "author": "Gerhard Westphalen",
    "date": "2025-08-08",
    "content": "Do you guys ever play around with slience at the beginning of a track? I usually set things to be pretty tight but with a bit of room to avoid issues with codecs etc. Lately I've been thinking about how it changes the feel of a record when you hit play and it starts immediately vs if there's an extra second of dramatic silence (similar to when there's some noise or ambience before things start). Maybe it's just me so curious to see if this is something others are thinking about",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405011416674599066",
    "author": "masteredbyjack",
    "date": "2025-08-12",
    "content": "This, and you can study it by using RX, and converting masters down to OGG, mp3, etc and listening",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405011668483838106",
    "author": "masteredbyjack",
    "date": "2025-08-12",
    "content": "So for instance, a very clean piano track that is sparse im not letting true peaks in, because I’ve studied how that will codec convert (or a DAC can make the true peaks into real peaks when it goes to analog, etc)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405013562543308840",
    "author": "M J",
    "date": "2025-08-12",
    "content": "Don't want to ruin the flow but had a question about dithering. I'm uploading a project to Distrokid and they only allow you to upload one version of the song, so I wouldn't be able to do a 16-bit/44.1khz for spotify and a 24-bit/48khz for apple/tidal. Should I worry about optimizing bit and sample for each streaming service or just do 16/44 cuz it works for everything?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405014028425760909",
    "author": "masteredbyjack",
    "date": "2025-08-12",
    "content": "I’d just send that, many many many masters I do are delivered at that (unless you want to do as Berlin says)\n\nBut 48k 24bit will go to Spotify just fine",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405014285490585651",
    "author": "M J",
    "date": "2025-08-12",
    "content": "oh ok, i know spotify converts, but wasn't sure if it's better to give it what it wants so it doesn't have to convert on it's own",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405014384874618900",
    "author": "masteredbyjack",
    "date": "2025-08-12",
    "content": "Spotify will serve different codecs based on different things",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405014489086033950",
    "author": "Berlin",
    "date": "2025-08-12",
    "content": "same for tidal and apple music - depending on the connection, a codec kicks in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405014622184017960",
    "author": "masteredbyjack",
    "date": "2025-08-12",
    "content": "And who knows? Spotify may change in the future and go lossless too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405513169161424958",
    "author": "Ted Whitten Media",
    "date": "2025-08-14",
    "content": "When doing revisions, does anyone save a whole new project file with a version number appended to the end? Wondering if that might help me stay more organized. Currently working on an album where the client wanted to go back to V1 for release, and I swear I kept track of every move I'd made to get to v2, but for some reason I just couldn't get it to sound exactly like V1 again. It's no problem on their end because they just used the file I'd rendered and uploaded to Samply. But now I have a clip in my montage that doesn't match the released version, which I don't like. I ended up dropping the master on a reference track instead.\n\nI think this issue was partially caused because I tend to send an initial rough master too early in the process and they get demo-itis. For some reason I've always wanted to send clients an initial rough master after I've done the quick \"from the gut\" broad strokes, but before I've totally nailed down the nitty gritty stuff, to see if they like the direction I'm headed. And all too often they end up liking the first version.\n\nOr maybe I'm just overthinking v2 and making it worse on a regular basis? I dunno... 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405566377548578906",
    "author": "jordanmcleod_io",
    "date": "2025-08-14",
    "content": "Is it the norm now to be embedding ISRCs into the final master files? We have a longtime indie label client who we have not embedded ISRCs into the files for years (or any other client), but now they're asking why we are not and another ME they use is always asking for ISRCs even when CDs are not being pressed. (We are assuming he must be embedding the ISRCs).\n\nClient is concerned about streaming and Bandcamp files, which is easy to explain as it's done manually during the upload/distribution process. But am I missing anything else? Is the main use case of embedding in regards to broadcast files?\n\nI've searched and the topic came up a bit over a year ago and it seems it is not the norm (from Nomo). Just want to gather as much info before responding with a proper explanation.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405574633725497435",
    "author": "Berlin",
    "date": "2025-08-14",
    "content": "As far as philosophy regarding metadata and explaining oh you don’t need it until upload.. i don’t get into that. That’s their prerogative and I’m here to white glove their project for them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405577013330317562",
    "author": "jordanmcleod_io",
    "date": "2025-08-14",
    "content": "I guess one more thing @Berlin (or anyone), what is there to miss out on by not embedding the ISRCs? Like if the client is concerned about their songs are not being tracked properly outside of Spotify/YouTube, etc, when could it become problematic?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410472230676205712",
    "author": "Rob Domos",
    "date": "2025-08-27",
    "content": "Anyone here have experience doing file swaps on records that have been given to distribution but haven’t yet been released? Is there any reason it would still be beneficial to keep file lengths identical like it is with released tracks?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410472674563588136",
    "author": "Rob Domos",
    "date": "2025-08-27",
    "content": "Fully indie artist, using distrokid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410611085907722241",
    "author": "Brian Reynolds",
    "date": "2025-08-28",
    "content": "I've reuploaded well over 10 tracks last few months. Also change in length of 20 seconds. No issues, for a layman",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410620241397944512",
    "author": "masteredbyjack",
    "date": "2025-08-28",
    "content": "Apparently there is? I don’t know. In my experience these types of projects are ones whose distribution and management is working to secure playlist spots, etc. I don’t understand the behind scenes workings",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410622459534774395",
    "author": "Rollmottle",
    "date": "2025-08-28",
    "content": "Maybe in a label scenario with editorial placements locked in, it’s a challenge to change out the file. But even at that level, I can’t imagine anything is truly a one way door, especially when you have insiders shepherding it through. \n\nIn a DIY DistroKid scenario, I would think you can swap to your heart’s content until you actually release it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410623210944331837",
    "author": "Nomograph Mastering",
    "date": "2025-08-28",
    "content": "I know from Kendrick that just about anything is possible - those files were uploaded at 4am and released at 9am",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410627587889299516",
    "author": "Brian Reynolds",
    "date": "2025-08-28",
    "content": "I reuploaded a wildly different mix, same length song. To a two year old song with my most streams. Kept all numbers and algorithm momentum that was there before",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410636021812428882",
    "author": "BananErMat42",
    "date": "2025-08-28",
    "content": "Yeah. But luckily i keep flex mode off unless i need it, so it should not have had an effect. Guess i could do a null but it’s already been uploaded and it sounds identical to my ears.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411057547007492222",
    "author": "Victor Garcia",
    "date": "2025-08-29",
    "content": "Hey @Nomograph Mastering congrats for the new Sabrina Carpenter album. It sounds great. I have a question for you. I see on Apple Music credits that you mastered the majority of the songs and Nathan did the others. Who is in charge of the album sequence and QC in these situations? I’m curious about that. Anyway, congrats 👏🏼",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412619395699703808",
    "author": "Ted Whitten Media",
    "date": "2025-09-02",
    "content": "Just the bare necessities to make a DDP. I also usually add it to mp3's, sometimes people ask for those too. 🤷🏼‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412619557855825991",
    "author": "masteredbyjack",
    "date": "2025-09-02",
    "content": "Ah got you. So edge cases. Hofa for DDP, something like mp3Tag for metadata",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412619728521924738",
    "author": "Ted Whitten Media",
    "date": "2025-09-02",
    "content": "Yeah, I just like how in WL, I can set it up once, then it all just works (DDP, mp3, file naming during render, etc)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412619972043346023",
    "author": "Ted Whitten Media",
    "date": "2025-09-02",
    "content": "I do have Hofa and also have mp3tag installed, it would just be nice to not have to hop around. So yeah, Reaper is basically ready to go, just me being ocd about trying to get it just like WL. Lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412876179932712970",
    "author": "itaylerner",
    "date": "2025-09-03",
    "content": "I will go down this rabbit hole now! Using CD baby and I believe they have a pretty streamlined ‘uploader’ so hopefully that just walks me right through it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412876389304111172",
    "author": "Rollmottle",
    "date": "2025-09-03",
    "content": "oh never used CD Baby...maybe they will generate a DDP for you? not familiar.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415359005903028235",
    "author": "masteredbyjack",
    "date": "2025-09-10",
    "content": "Next they are gonna start pushing Atmos, one of the few things I like about Spotify is they just dgaf about Atmos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415375086185087077",
    "author": "David Fuller",
    "date": "2025-09-10",
    "content": "spotify doing lossless is good",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415452313459490888",
    "author": "spencerhoad",
    "date": "2025-09-10",
    "content": "https://musictechpolicy.com/2025/09/02/ai-implications-of-spotifys-updated-terms-of-use-your-data-is-their-new-oil/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415841854632628316",
    "author": "James Cronier",
    "date": "2025-09-11",
    "content": "Does Spotify loudness normalization work from an average across the entire file?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415882845754232932",
    "author": "Will Melones",
    "date": "2025-09-11",
    "content": "I do like having normalization activated in the Spotify iPhone app, but can't seem to find it in the settings anymore. Is it forced for iOS at this point?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417280392527872120",
    "author": "Berlin",
    "date": "2025-09-15",
    "content": "I was like \"go get adele out of your collection and AB it to spotify\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1420787541925433417",
    "author": "Jasper Boogaard",
    "date": "2025-09-25",
    "content": "I think the chance for playlisting here would be a lot higher if there’s a new team/label behind it pushing it to streaming services’ editorial teams. In my experience the label’s PR team is still very important in playlisting and if the remaster gets a new push from a new label that might help a lot.  \n\nif they do a smart repackaging as a deluxe remastered album, maybe add a live version or bonus track, this might help too. They will definitely get another push in the Spotify Release Radar which is a good source of new streams.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1421186410609643684",
    "author": "Berlin",
    "date": "2025-09-26",
    "content": "Hey there. The only way it would work is if it's an all new release, with new ISRC and UPC and everything.. but even then Spotify may see that it's a previously released track for this artist and not allow it for Playlist submissions. If you share the same metadata, track lengths, etc etc.. if it all looks the same, it will likely not be available to that artist for play listing at all.\n\nSo PR, MGMT, Label relationships with Apple, Spotify, etc would be the best fail proof approach I think there. Of if they get a distro deal like with Tone Tree or Symphonic who can help bring new life to the release.\n\nJust leaning on the algos and stuff won't do it in this case, I really thing a human working the release relationally is what it would take.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1439017346001015017",
    "author": "chrissorem",
    "date": "2025-11-14",
    "content": "If the best answer is , concerned about not getting paid you probably shouldn’t be working with those people and I doubt those are the type of people that wouldn’t just upload an MP3",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1439047220807864410",
    "author": "chrissorem",
    "date": "2025-11-14",
    "content": "Live your crazy lives and send your mp3s and drink your 4 locos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441823705264291840",
    "author": "vostral",
    "date": "2025-11-22",
    "content": "I wanna ask about a couple of technical issues of Big Hits. I wonder why the releases of such big artists would have such issues\n\n- Kali Uchis - Moonlight: It's very harsh in the top end and unbearable. Why was the mastering engineer unaware of that ?\n\n- Ava Max - Kings & Queens: Distortion at the beginning of the track, is it intentional for the loudness of the track, or is it accidental due to streaming platforms ? (i checked on both youtube & spotify)\n\nI'm not trying to bash anyone, i am just curious about them and dont want to make such problems happen",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1464324824724799801",
    "author": "Iwan Morgan",
    "date": "2026-01-23",
    "content": "I never quite got this - I just render then reimport onto a null track to test if any of the plugins or timings have messed up, before then doing QC in RX.  A year or so ago after chatting about this very same thing I submitted a couple of test albums for gapless playback tests to Distrokid, the idea being that onece they were on streaming we could do verified tests over how gapless works in different situations.  Unfortunately the masters kept getting rejected by the DSP.  I need to try again and add some musical content in there to fool the bots, but I lost a couple of days going down that rabbit hole.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]