[
  {
    "id": "1085342113337716826",
    "author": "Edsel Holden",
    "date": "2023-03-14",
    "content": "This experience was enlightening to me in many ways, so I wanted to share it here in case anyone else ever finds themselves in a similar position. I may not be very active here but I really appreciate this community and I got tons of love for everyone here. Cheers all !",
    "reactions": 48,
    "categories": []
  },
  {
    "id": "1050163354104242186",
    "author": "Iwan Morgan",
    "date": "2022-12-07",
    "content": "@Nomograph Mastering Congrats on mastering the new Lana Del Ray!",
    "reactions": 45,
    "categories": []
  },
  {
    "id": "1309935419919433839",
    "author": "Nomograph Mastering",
    "date": "2024-11-23",
    "content": "And for lack of a better word philosophically, are how I approached this project\n\nThere was no “oh this is different/bigger so I’m gonna change how I do things”, the opposite is true. I doubled down and had to\n\nSo if you’ve read what I say here you can guess the signal chain, and what I did to mixes before I mastered. And more importantly if you’ve met with some of what I’ve written here you’ll have a good sense of *why* I did what I did \n\nBut most of all I hope that you have a sense of the scale of Mastering’s contribution to a project like this. Let’s keep things in proportion and acknowledge the relative scale of invention and artistry in the songs, performances and production and what I did at the end\n\nNot feigning humility, or diminishing my work. Just re stating why this work is compelling, and it’s not equilibrium",
    "reactions": 44,
    "categories": []
  },
  {
    "id": "1085344179560915014",
    "author": "Nomograph Mastering",
    "date": "2023-03-14",
    "content": "This is his new pay grade",
    "reactions": 43,
    "categories": []
  },
  {
    "id": "1336142248290553877",
    "author": "Nomograph Mastering",
    "date": "2025-02-03",
    "content": "If I was in charge of newcomer's career in Mastering based on everything I've learned I would say\n\n1) Focus 100% of early efforts on getting the best speaker/room combo you can muster in place (forget all other gear for now except a functioning computer). Note I didn't say \"most expensive\"\n\n2) Next spend as much time as possible listening with the best listeners you can get access to (other engineers, music fans, kids)\n\n3) Ignore almost everything you read and watch on the internet about the topic of Mastering \n\n4) RIngfence your time developing and understanding techniques away from when you are actually working on music\n\n5) Maximize your availibilty to the music (keep distractions, overheads, gear envy, fear etc to a minimum)\n\n6) Now listen as widely as you can, to every genre - listen for details, listen like a fan, zoom in, zoom out, zoom in again\n\n7) Love everything you touch. You don't have to like it, but you've gotta love it. Love is a quality of attention. Attend to the music with generosity, as you would a child, or grandma, or a precious butterfly",
    "reactions": 40,
    "categories": [
      "business_pricing"
    ]
  },
  {
    "id": "1467226588725903523",
    "author": "Nomograph Mastering",
    "date": "2026-01-31",
    "content": "Breakfast with these two",
    "reactions": 39,
    "categories": []
  },
  {
    "id": "1379025825692782673",
    "author": "Conah Tucker",
    "date": "2025-06-02",
    "content": "Happy Monday folks!\n\nJust wanted to say a quick appreciation to you all! May was my most successful, and most consistent, month for my mastering career so far! I'll be full time mastering for exactly 1 year tomorrow and I wouldn't be where I am now without the insight and knowledge I've learnt from here! \n\nSo blessed to be a part of such an amazing community of people\n\nBiggest love ❤️",
    "reactions": 38,
    "categories": []
  },
  {
    "id": "1370166472554582087",
    "author": "Nomograph Mastering",
    "date": "2025-05-08",
    "content": "I think all other mastering engineers should follow the -2dB peak standard",
    "reactions": 35,
    "categories": [
      "diy_vs_professional"
    ]
  },
  {
    "id": "1278467443429347380",
    "author": "Berlin",
    "date": "2024-08-28",
    "content": "New one today from a \"returning\" client - \"We ended up not using your master on the last track, we went another direction. That being said, we would like you to master our next single, but perhaps at a discounted rate since we ended up not approving the last track we did together?\"",
    "reactions": 30,
    "categories": [
      "client_communication",
      "business_pricing"
    ]
  },
  {
    "id": "1095940339728125972",
    "author": "popaganda.",
    "date": "2023-04-12",
    "content": "@masteredbyjack you qualify your statements like this a lot, and I just want you to know I think your perspectives/opinions here are great and just as important as everyone else’s. No more disclaimers!",
    "reactions": 29,
    "categories": []
  },
  {
    "id": "1182936495967965236",
    "author": "cian riordan",
    "date": "2023-12-08",
    "content": "Pretty good for the boy from Killarney",
    "reactions": 29,
    "categories": []
  },
  {
    "id": "1243772175761014876",
    "author": "Nomograph Mastering",
    "date": "2024-05-24",
    "content": "TLDR - if there’s too much of any band between 1500 and 6000 you won’t be able to perceive the rest of the frequency range correctly - it “blinds” us",
    "reactions": 29,
    "categories": []
  },
  {
    "id": "1461871659974791451",
    "author": "jonmatteson",
    "date": "2026-01-16",
    "content": "Yall I just got a master back from @Berlin and he made my mix/production sound so much better it’s blowing my mind. Not sure what voodoo he put on it but just wanted to take a moment to celebrate a badass mastering engineer in the chat",
    "reactions": 28,
    "categories": [
      "diy_vs_professional"
    ]
  },
  {
    "id": "1117985467195994142",
    "author": "masteredbyjack",
    "date": "2023-06-12",
    "content": "This is great info. In a follow up to this, as a wonderful surprise, had my master picked in a shootout against an engineer who is leagues ahead of me.\n\nMy master was 1.6db quieter, and the artist actually liked the space it gave (it is still plenty plenty loud). Just was interesting that this artist had the understanding of really what they wanted, how it mattered to his art, etc.\n\nOther guys master sounded great too, just really hot and dense dense. which I feel 9 times out of 10 will win because explaining the trade offs and benefits of loudness (and having it understood) is very hard, but this felt like an artist really leading with their vision, not concern with the loudness stuff…how he articulated it to me confirmed that. Pretty cool, regardless of outcome",
    "reactions": 27,
    "categories": [
      "loudness_lufs",
      "business_pricing"
    ]
  },
  {
    "id": "1326303979118002340",
    "author": "cian riordan",
    "date": "2025-01-07",
    "content": "Hey mastering engineers, please don't do this to us.",
    "reactions": 27,
    "categories": [
      "diy_vs_professional"
    ]
  },
  {
    "id": "1028108241466576916",
    "author": "Jeremy Klein",
    "date": "2022-10-07",
    "content": "I render my verses at 48k and choruses at 44.1k",
    "reactions": 26,
    "categories": []
  },
  {
    "id": "1047363725453185094",
    "author": "Nomograph Mastering",
    "date": "2022-11-29",
    "content": "The confidence this gives people is part of what we are paid for, but again nothing I’m doing tonight can sell more gear, plug ins or tutorials so we never see it focused on",
    "reactions": 26,
    "categories": []
  },
  {
    "id": "1067236517526908948",
    "author": "hebakadry",
    "date": "2023-01-23",
    "content": "If someone communicates to me that they cannot pay my rate and their budget is just too low for me to move forward, I try to recommend at least 3 other ME’s that I know are great and a bit younger and need the work.  I think it’s important to spread the work around.  I try to push for more female engineers in that regard because its the only way to give these names a push.",
    "reactions": 26,
    "categories": [
      "business_pricing"
    ]
  },
  {
    "id": "1099032780198920253",
    "author": "dcmabon",
    "date": "2023-04-21",
    "content": "Happy dynamic range day y’all 😂😂",
    "reactions": 26,
    "categories": []
  },
  {
    "id": "1123041635849228378",
    "author": "Zach Hughes",
    "date": "2023-06-26",
    "content": "Turns out the ME in question was a rando from SoundBetter charging like $200 to master 6 songs. Convinced the artist to steer clear. 🤘🏽",
    "reactions": 26,
    "categories": []
  },
  {
    "id": "1284694760107278408",
    "author": "masteredbyjack",
    "date": "2024-09-14",
    "content": "This is great to see. And something I think is really great about Ruairi is not only does he do amazing work, but he really, truly helps people in the real world. I've said it before, but he's the most consequential person I've met in my music journey. And a lot of what I've gotten from him he probably doesn't even realize, but he really cares and puts time into the music and people. \n\nA huge inspiration both as a mastering engineer and human. Thanks Ruairi!",
    "reactions": 26,
    "categories": [
      "diy_vs_professional"
    ]
  },
  {
    "id": "1106293277851930684",
    "author": "cian riordan",
    "date": "2023-05-11",
    "content": "I found myself swimming in ego when I first started (mostly my own.) Propped myself up as someone who had all the answers, looked down on everyone else’s work. I was the best. Having a mentor like Eric was humbling in that regard. Not only was I not in fact the best, it didn’t take me long to realize that he wasn’t either… and he knew it. Seeing him traverse the music industry, doing the best job possible, while being kind and fair to people, understanding artist intent and vision, and being absolutely honest about his own shortcomings — you couldn’t pay enough money for that kind of masterclass. I’m very lucky to have been exposed to that, not just as a recording engineer, but as a human being.",
    "reactions": 25,
    "categories": []
  },
  {
    "id": "1333522027574726717",
    "author": "kylem",
    "date": "2025-01-27",
    "content": "This!!! A client of mine just texted me a v1 master from an ME I haven't worked with before. Keep in mind, all we did was send the mix and tell them to have at it. This is what we received for the first pass...6 different versions!!! To each their own, but this was not helpful and now there are multiple opinions (artist, manager + producer) on what master sounds \"best\"  😵‍💫",
    "reactions": 25,
    "categories": [
      "client_communication"
    ]
  },
  {
    "id": "1095016103337525419",
    "author": "Nomograph Mastering",
    "date": "2023-04-10",
    "content": "I am admittedly very cranky this morning but sometimes I am astounded at how self mix clients can miss their freeway exit by several miles and then quickly transition to giving you 1/16” accuracy parking notes on the master",
    "reactions": 24,
    "categories": [
      "client_communication",
      "album_mastering"
    ]
  },
  {
    "id": "1138296628768419971",
    "author": "Bryan DiMaio",
    "date": "2023-08-07",
    "content": "Make it read only and the only message says “get back to work”",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1243770918363467776",
    "author": "Nomograph Mastering",
    "date": "2024-05-24",
    "content": "Even with very amateur mixes I’m often leaving sub 150 Hz relatively untouched and biasing perception using the mid range",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1322648984795349034",
    "author": "Nomograph Mastering",
    "date": "2024-12-28",
    "content": "First rule of audio “All streams/videos about audio engineering must have dogshit audio”",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1442231570818797763",
    "author": "Nomograph Mastering",
    "date": "2025-11-23",
    "content": "Good points all. \n\nTo your last point though;\n\n“The enemy of art is indifference “ \n\nI would say in my practical experience in a record making town that I encounter almost no indifference, but what I do encounter all the time is engineers who are failing to meet the music because they’re focussed on the wrong things \n\n- these files are 16 bit!\n- I can’t believed they used a Claret to record the vocals \n- I would never use splice!!\n\nEtc etc \n\nRe taste I may have said this on the Dead Wax podcast … it’s entirely unreasonable to think that you will like everything you hear, but as a working pro it’s crucial to be able to understand why other people might (and not without cynical recourse to “they’re sheep!!”)",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1068213326888321074",
    "author": "Rollmottle",
    "date": "2023-01-26",
    "content": "Every streaming service has a different number at which they will do normalization. If you are above that number and the user has normalization enabled, the service will turn the music down to match that number.\n\nThe immediate problems baked in:\n1. Every service works differently. One cannot confidently shoot at a target that doesn’t really exist. So, just master the material for the material.\n2. Not every user has normalization turned on. Thus, the material will be arbitrarily quiet next to other material that isn’t mastered to the target. So, just master the material for the material.\n3. Not everybody consumes through streaming. Outside of a platform, the material needs to stand on its own. So, just master the material for the material.\n4. Lots of modern music benefits sonically from being pushed into a limiter. Mastering below that short changes the material. So, just master the material for the material.",
    "reactions": 22,
    "categories": [
      "loudness_lufs",
      "limiting_clipping"
    ]
  },
  {
    "id": "1092479396620795975",
    "author": "Nomograph Mastering",
    "date": "2023-04-03",
    "content": "I’m having one of those “I can’t believe this artist I used to listen to as a fan is coming out of my speakers” moments",
    "reactions": 22,
    "categories": []
  },
  {
    "id": "1380563615178031307",
    "author": "Nomograph Mastering",
    "date": "2025-06-06",
    "content": "Honestly I’ve just been using a match EQ from “Livin’ La Vida Loca” this whole time",
    "reactions": 22,
    "categories": [
      "mastering_tools"
    ]
  },
  {
    "id": "959503666014978058",
    "author": "oaklandmatt",
    "date": "2022-04-01",
    "content": "from audio hertz IG today",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "959512182423453756",
    "author": "cian riordan",
    "date": "2022-04-01",
    "content": "I hope Brian Lucey finds his way in here.",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "1066070323356782622",
    "author": "Nomograph Mastering",
    "date": "2023-01-20",
    "content": "Hey Everyone. It’s time. I need an assistant. LA based, in Pasadena but with some remote element too I guess. Lots to clarify but if you know someone who is passionate about music, the details and is a good hang then send them my way - ruairi@nomographmastering.com",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "1066751302920589332",
    "author": "Rollmottle",
    "date": "2023-01-22",
    "content": "Got a note to EQ 66.4hz. I have arrived!",
    "reactions": 21,
    "categories": [
      "mastering_tools"
    ]
  },
  {
    "id": "1068282247939096626",
    "author": "Nomograph Mastering",
    "date": "2023-01-26",
    "content": "The dedication with which a Mastering Engineer advocates -14  is inversely proportional to the amount of records they’ve done that you’ve heard of",
    "reactions": 21,
    "categories": [
      "diy_vs_professional"
    ]
  },
  {
    "id": "1100508635794247832",
    "author": "peterlabberton",
    "date": "2023-04-25",
    "content": "Hiring a mastering engineer seems like hiring string players: either get a fucking pro, or don’t bother",
    "reactions": 21,
    "categories": [
      "diy_vs_professional"
    ]
  },
  {
    "id": "1234865209466683504",
    "author": "Berlin",
    "date": "2024-04-30",
    "content": "Yes and a few reasons why.\n\nFirstly, I just didn’t have the time anymore to real time bounce - especially when it came to multiple deliverables (Main, ACA, INST, TV, Clean, etc).\n\nAnd Secondly going out and back in opens more opportunity for unintended changes to happen to the master, like LR Balance or dropped samples - you have to watch for that stuff like a hawk - so QC time increases as well keeping an eye out. More time spent bouncing and QCing, means less time available for more work and even less personal time.\n\nThirdly, I learned pretty quickly that people really love their mixes and the less I do to a track and the more I get out of the way to finish it, the happier everyone is. Having “fun” with gear (to me) was just me putting myself/ego into the equation and truthfully I just needed to get out of the way.\n\nFitter, Happier, More Productive.",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1334987020816093224",
    "author": "cian riordan",
    "date": "2025-01-31",
    "content": "Cant wait to lose a grammy to them on Sunday",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1362225712102375570",
    "author": "Huntley Miller",
    "date": "2025-04-16",
    "content": "Hi all! My name is Huntley Miller and I master records. Thanks to Paris for the tip, and Ruairi for the hospitality.",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1373816094502162572",
    "author": "Nomograph Mastering",
    "date": "2025-05-18",
    "content": "As Dave Collins always says \"the lost art of EQ in Mastering\"",
    "reactions": 20,
    "categories": [
      "mastering_tools"
    ]
  },
  {
    "id": "1374786657164857415",
    "author": "hyanrarvey",
    "date": "2025-05-21",
    "content": "Master like nobody is listening",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1374918201317785722",
    "author": "sethmanchester",
    "date": "2025-05-21",
    "content": "@hebakadry  taught my dumb ass over many years of patience that loudness is built in the mix which really shook up my workflow 8-10 years ago... that being said, after many years of working together we've recently collaborated on a few projects where I intentionally didn't take it easy on the mix bus but still encouraged her to push it further and get as creative & collaborative with the master as she wanted to. It's resulted in some of my favorite sounding records I've ever been a part of. She respected the mix, but took chances and didn't just hand me back my mix. Out the door they were some of my favorite mixes I've ever done and Heba brought something else to them that I couldn't or wouldn't have thought to. I trust her taste & I asked for her imprint. I think there's a way to do both... you can 100% encourage a mastering engineer to push things further and forward without undercooking a mix... but it definitely requires an alignment of taste and trust.",
    "reactions": 20,
    "categories": [
      "loudness_lufs",
      "diy_vs_professional",
      "album_mastering"
    ]
  },
  {
    "id": "1379917665425952920",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-06-04",
    "content": "Wanted to give a shoutout to @Berlin - had a song mastered by him recently and the whole process was super transparent, straightforward and smooth. \n\nThe product delivered was amazing as well obv\n\nBig love❤️",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1384670706339680316",
    "author": "Nomograph Mastering",
    "date": "2025-06-17",
    "content": "Highlighting and supporting that is much more powerful than just zapping everything that sticks out a little bit",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1384686185225519255",
    "author": "Rob Domos",
    "date": "2025-06-17",
    "content": "The best career advice I ever got was from a close friend of mine who I watched rise up from an immigrant with few resources to becoming a director at Instacart leading a huge wing of software engineers and a millionaire by the time he hit 30. He said that a mentor of his told him that nobody will ever promote you until you already have a track record of doing the role you’d be promoted into, so at a fundamental level, you have to do a ton of uncompensated work to advance",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1227662002307203115",
    "author": "Nomograph Mastering",
    "date": "2024-04-10",
    "content": "Oek's Law - Tools that appear to level you up fast often come with a hidden ceiling on your future growth",
    "reactions": 19,
    "categories": [
      "limiting_clipping"
    ]
  },
  {
    "id": "1309587238702682164",
    "author": "andresm",
    "date": "2024-11-22",
    "content": "Congrats on mastering the Kendrick album @Nomograph Mastering I’m going to enjoy it now",
    "reactions": 19,
    "categories": [
      "album_mastering"
    ]
  },
  {
    "id": "1456439593040871464",
    "author": "Berlin",
    "date": "2026-01-01",
    "content": "HNY. Grateful for y'all in this channel! \nY'all help me be a better servant to the art of mastering. \nCheers to 2026!!",
    "reactions": 19,
    "categories": []
  },
  {
    "id": "983478990624927805",
    "author": "hebakadry",
    "date": "2022-06-06",
    "content": "I have a theory that we will be remastering records decades from now that took those target levels too literally...just make it sound good.",
    "reactions": 18,
    "categories": [
      "client_communication"
    ]
  },
  {
    "id": "1096080190628704397",
    "author": "BatMeckley",
    "date": "2023-04-13",
    "content": "I disagree. I love that Jack gives a clear, even undersold, perspective of where he’s coming from. I wish more people on the internet would be more like that and less “when I was singing with michael Jackson” and what that actually means they were doing was karaoke in K town.\n\nIt actually makes me trust the opinions of Jack MORE.",
    "reactions": 18,
    "categories": []
  },
  {
    "id": "1132119232361017364",
    "author": "Nomograph Mastering",
    "date": "2023-07-21",
    "content": "https://youtu.be/AtqWvu4G1PY",
    "reactions": 18,
    "categories": []
  },
  {
    "id": "1200150491674447892",
    "author": "Nomograph Mastering",
    "date": "2024-01-25",
    "content": "I'm on hold with my Insurance company and the hold music is a track I mastered",
    "reactions": 18,
    "categories": []
  },
  {
    "id": "1243773704308129885",
    "author": "Bryan DiMaio",
    "date": "2024-05-24",
    "content": "^ruairi rn on his keyboard",
    "reactions": 18,
    "categories": []
  },
  {
    "id": "1271483345162993777",
    "author": "Berlin",
    "date": "2024-08-09",
    "content": "Had an attended session for an LP yesterday (a rarity for me). Artist didn’t want me to do any work without them in the room. I obliged. We got going, and as soon as I started digging into RX they interrupted and said, “Um.. can we just do the fun stuff like transitions and pacing and then we can go.. you can finish this stuff by yourself later?” They were gone in 45 minutes. 🙂‍↕️",
    "reactions": 18,
    "categories": [
      "mastering_tools",
      "album_mastering"
    ]
  },
  {
    "id": "1331039528718176257",
    "author": "Berlin",
    "date": "2025-01-20",
    "content": "Always a couple times a year where someone comes back with a note about their track \"sounding weird on my little bluetooth speaker\". I'll often ask how other tracks from other artists they like sound on it and I'll typically get a response like \"well.. also sounds bad tbh.. NEVERMIND.\"",
    "reactions": 18,
    "categories": []
  },
  {
    "id": "1357178376309182645",
    "author": "mcsnare",
    "date": "2025-04-02",
    "content": "Hey y’all. Dave McNair here. Seems like a cozy spot for an audio geek like me.",
    "reactions": 18,
    "categories": []
  },
  {
    "id": "1432844091317813348",
    "author": "Berlin",
    "date": "2025-10-28",
    "content": "just a reminder to not criticize your client base publicly on your IG stories.",
    "reactions": 18,
    "categories": [
      "client_communication"
    ]
  },
  {
    "id": "1064363639794040903",
    "author": "cian riordan",
    "date": "2023-01-15",
    "content": "What makes this place great. Nobody has anything to gain except knowledge and friendship.",
    "reactions": 17,
    "categories": []
  },
  {
    "id": "1065664813780451458",
    "author": "Nomograph Mastering",
    "date": "2023-01-19",
    "content": "Lots of good points. But there is a 3rd way. “Hey man, feels great. Can you send me a screenshot of your GP settings and a print without?”",
    "reactions": 17,
    "categories": [
      "business_pricing"
    ]
  },
  {
    "id": "1066660624244944896",
    "author": "spectrummasters",
    "date": "2023-01-22",
    "content": "@Rollmottle  and @Nomograph Mastering  gents thanks again , I just turned in those masters for the mixes that had TGP on , having followed both of yous handy advice. They love the masters and I’ll be doing their next ep too now . I got the TGP demo, and their settings for it , took the limiter off TGP and applied my own process and got it to where it needed to be with no head scratching or procrastinating. Realistically, I could be still messing about with harmonics and exciters at this point if not for your advice. This discord really GIVES . So, just want to say thanks again. Y’all helped me elevate my workflow in a very tangible way , quickly. I appreciate y’all 🙏🏼",
    "reactions": 17,
    "categories": [
      "limiting_clipping",
      "album_mastering"
    ]
  },
  {
    "id": "1091844263425351771",
    "author": "CK",
    "date": "2023-04-01",
    "content": "Anyways, I am ALWAYS going to put Mastering into my quote from now on, and I will always hire one of you. I do not know how you do what you do so well. Maybe one day I will. For now, Mixing is so much more fun for me. It is good to know that someone else can be my safety net and I can just be an \"artist\".",
    "reactions": 17,
    "categories": []
  },
  {
    "id": "1160336167720468480",
    "author": "Nomograph Mastering",
    "date": "2023-10-07",
    "content": "Yep, there’s no exact number but  REFs are generally genre appropriate. And I encourage it. If you want a -7 LUFS master then you need to build a -7 LUFS mix, otherwise things will change too much when the level is pushed",
    "reactions": 17,
    "categories": [
      "loudness_lufs"
    ]
  },
  {
    "id": "1337614464085655646",
    "author": "cian riordan",
    "date": "2025-02-07",
    "content": "Me and my 15 fake email accounts can be really hard on Ruairi some days, but yet we persist.",
    "reactions": 17,
    "categories": []
  },
  {
    "id": "1385636390422708436",
    "author": "Nomograph Mastering",
    "date": "2025-06-20",
    "content": "I have many thoughts but I would probably lead with this. You are likely learning what’s “correct” on the internet, having been in the game for a minute I can tell you that 90% of what you are reading is wrong, or incomplete or misses the point\n\nYour clients however will be your greatest teachers. I learn more every year than the last, and I’m 31 years into record life and 23’in mastering\n\nClients understand music intuitively, they are reaching for something bigger than LUFS, and tonal balance curves. Keep an open ear, write short emails and you’ll keep learning",
    "reactions": 17,
    "categories": [
      "loudness_lufs",
      "mastering_eq",
      "client_communication"
    ]
  },
  {
    "id": "1389061113903054898",
    "author": "Nomograph Mastering",
    "date": "2025-06-29",
    "content": "An easy and often overlooked solution is just to do a volume ride *into* the limiter. It's diving for huge gain reduction and you can make it's work easier but just carefully shaving off a few dB on the way in. It will still keep it's shape an feel, likely match the mix ref better and avoid the crunch",
    "reactions": 17,
    "categories": [
      "limiting_clipping",
      "business_pricing"
    ]
  },
  {
    "id": "1470913625337106554",
    "author": "cian riordan",
    "date": "2026-02-10",
    "content": "tell me more about this island",
    "reactions": 17,
    "categories": []
  },
  {
    "id": "1011670295792336907",
    "author": "NoahNeedleman",
    "date": "2022-08-23",
    "content": "I like guys who make me feel like a good mixer. Not like with compliments, but when the master comes back I listen and think “wow I’m really good at music.” \nThat’s not super helpful technically speaking. But I look for that in mixers too- does a mixer make me feel like a good producer? Does a producer make me feel like a good artist? Does an artist make me feel like a good songwriter? Does a song make me feel like a good human? \n\n… ¯\\_(ツ)_/¯",
    "reactions": 16,
    "categories": [
      "business_pricing"
    ]
  },
  {
    "id": "1011671114986037248",
    "author": "Rollmottle",
    "date": "2022-08-23",
    "content": "the \"not a dick\" factor would be high on my list",
    "reactions": 16,
    "categories": []
  },
  {
    "id": "1175838686366154772",
    "author": "Rollmottle",
    "date": "2023-11-19",
    "content": "Been trying to think of a way in to the question about what I did without being completely frustrating or giving a list of moves that don't mean anything outside of the context of being in my chair, hearing what and how I hear.\n\nThis process for this song is like any other...listen for what the song needs and act accordingly. That's the frustrating answer but it's also true. What did you do? \"I mastered it.\" lol\n\nBut I know that's not what you're asking. For a track like this, I'm primarily focused on the vocal and how it's sitting and feeling. The vocal performance is incredibly dynamic and intimate. This one had some ringy stuff through 2.5k and in the upper mid range that I felt was detracting from the \"fireside\" intimacy. The goal was to take off some of the edge without stepping on the presence. That was a combo of RX and EQ. \n\nOn this song, I did an analog pass because I am usually able to manage to get the balance of presence and de-edge I'm looking for very quickly. Since time was of the essence here, that was the move. Couple of moves on Equilibrium digitally before the Gyraf and Porter Grinder in the analog chain. The \"trickiest\" thing I did here was flip the Porter Grinder into M/S to bring the vocal closer into the center (by cutting!) and to push the mellotron and atmospherics to the sides (by boosting). All very subtle stuff.\n\nSo, there were some moves here, but the moves were all in service of the feeling the song was telling me it needed. We talk a lot about monitoring here. When you can connect to the song and walk around inside of it, it's much easier to know what you need to do (or not to do) to bring it to life.",
    "reactions": 16,
    "categories": [
      "converters_hardware",
      "monitoring_metering",
      "mastering_tools",
      "business_pricing",
      "vinyl_physical"
    ]
  },
  {
    "id": "1180198505910910986",
    "author": "hyanrarvey",
    "date": "2023-12-01",
    "content": "Get your money george",
    "reactions": 16,
    "categories": []
  },
  {
    "id": "1299802120480100352",
    "author": "Halliemmelton",
    "date": "2024-10-26",
    "content": "Oh gosh I have nothing to say but I’m excited about this thread. Hey y’all",
    "reactions": 16,
    "categories": []
  },
  {
    "id": "1360342664930787369",
    "author": "hebakadry",
    "date": "2025-04-11",
    "content": "Porky’s Prime Cuts…some of the most important (loudest) dance cuts ever released. Absolute legend https://www.youtube.com/watch?v=PpidqcG7sSo",
    "reactions": 16,
    "categories": []
  },
  {
    "id": "989203678781141073",
    "author": "cian riordan",
    "date": "2022-06-22",
    "content": "honestly cant listen to him talk, he needs to blow his nose or something.",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1030896471760973865",
    "author": "Nomograph Mastering",
    "date": "2022-10-15",
    "content": "And mastering is……what I should be doing right now 🙂",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1070476505383194684",
    "author": "Nomograph Mastering",
    "date": "2023-02-01",
    "content": "Very important for working with younger artists - don’t ask them for notes, ask them how it feels. If you create a space for notes they will feel compelled to fill it, often while creating doubt. When you ask how it feels their response will tell you everything you need to know",
    "reactions": 15,
    "categories": [
      "client_communication",
      "business_pricing"
    ]
  },
  {
    "id": "1127347271114174475",
    "author": "Nomograph Mastering",
    "date": "2023-07-08",
    "content": "I'm not a fan of the punching down energy",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1127368208874209411",
    "author": "Nomograph Mastering",
    "date": "2023-07-08",
    "content": "B) Answering questions on DM means only one person benefits",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1156345183202443294",
    "author": "Gerhard Westphalen",
    "date": "2023-09-26",
    "content": "Update - sent revision with no push back. Friendly email to the artist pointing out those notes weren't the best idea and I'd be happy to chat with the mixer if need be but would rather not be debating these things. Artist laughed it off and thought the notes were a little over the top suggesting I chat with him if these sort of notes continue",
    "reactions": 15,
    "categories": [
      "client_communication"
    ]
  },
  {
    "id": "1156347241569726475",
    "author": "Gerhard Westphalen",
    "date": "2023-09-26",
    "content": "I get lost when others start to make decisions which should be entirely in my realm. Once had someone ask me for a revision not using Crane Song converters. I've never owned any, never mentioned anything about them, and master was ITB...",
    "reactions": 15,
    "categories": [
      "converters_hardware",
      "client_communication"
    ]
  },
  {
    "id": "1199502854587678830",
    "author": "chrissorem",
    "date": "2024-01-23",
    "content": "I’d do it in the namm show floor. Just pick up all your favorite gear and take over the PMC booth",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1228825233377726545",
    "author": "Nomograph Mastering",
    "date": "2024-04-13",
    "content": "-6.9 is not even trying, this is a real master from last week",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1230184171192979469",
    "author": "Edsel Holden",
    "date": "2024-04-17",
    "content": "when will I learn.... poeple LOVE their mixes. stop changing it so fucking much you dumb fuck",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1230202481628287098",
    "author": "Adam Thein",
    "date": "2024-04-17",
    "content": "\"Hey Will, yeah good man good.  Yeah so there's this Discord server, you know Discord?  Yeah yeah gamers, yeah, so yeah there's this server where a bunch of engineers hang out and yeah they saw that story you posted the other day?  Right, yeah true peak, yeah.  Well...\"",
    "reactions": 15,
    "categories": [
      "limiting_clipping"
    ]
  },
  {
    "id": "1238187537948741692",
    "author": "Jonathan Jetter",
    "date": "2024-05-09",
    "content": "Might download perfectly on the first try, might take four tries, might download in three separate folders and leave out a file or two. Roll the dice and find out!",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1244397736137068624",
    "author": "Nomograph Mastering",
    "date": "2024-05-26",
    "content": "I’m left wondering how many people who know who Cindy Crawford is can still hear 14k",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1271485830124404789",
    "author": "Rollmottle",
    "date": "2024-08-09",
    "content": "When they find out what mastering really is",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1354485752461000734",
    "author": "Nomograph Mastering",
    "date": "2025-03-26",
    "content": "No non lim mix available? Flip the burger",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1377254308885561525",
    "author": "allearsmastering",
    "date": "2025-05-28",
    "content": "a quick update:) finally got the record approved at rev4:) at the end after trying loads of different things I managed to do it without reverb:) all it took was a slight percentage of the widener from the brainworx v2 eq:) basically they wanted to hear a wider stereo image:) again thank you everyone here for all your help especially @Elaine Rasnake @Nomograph Mastering @Bryan DiMaio @Rollmottle @Berlin @Paris Lee @Halliemmelton",
    "reactions": 15,
    "categories": [
      "mastering_tools"
    ]
  },
  {
    "id": "1411030778984398939",
    "author": "Halliemmelton",
    "date": "2025-08-29",
    "content": "Said this to @Nomograph Mastering already, but wanted to share here too—it is such a blessing when friends work on stuff that gets you excited. Having friends I can look up to and champion and celebrate is the best feeling in the world, and being excited about music is also the best feeling in the world.",
    "reactions": 15,
    "categories": [
      "business_pricing"
    ]
  },
  {
    "id": "1445881616521236481",
    "author": "Tim O’Sullivan",
    "date": "2025-12-03",
    "content": "\"The only remaining possible refinements are very small things (like a tiny polish in the 1.5–2.5 kHz area if needed, or a half dB here or there  — very subtle — just to add a tiny bit of forward energy without adding any brightness or harshness - This is not a brightness move — it's a micro-presence move). The midrange gains definition without aggression and a touch more confidence and articulation without getting harsh. The vocal feels more emotionally present. The whole track feels slightly more awake.I t could elevate the “mastered” feeling by 5–10%.\"",
    "reactions": 15,
    "categories": [
      "business_pricing"
    ]
  },
  {
    "id": "1028107179758202880",
    "author": "cian riordan",
    "date": "2022-10-07",
    "content": "I’ll usually side chain them from a serban or a manny mix. Get that “human touch”",
    "reactions": 14,
    "categories": []
  },
  {
    "id": "1028204422431518760",
    "author": "cian riordan",
    "date": "2022-10-08",
    "content": "Ruairi fishing for deep cuts! The best experience I ever had was over a decade ago. Having spent a considerable chunk of time recording an album for & with my best friend -- we asked Eric Valentine to master the record and he said yes. Having worked under for him for a few years at this point, it felt like a bit of a reckoning... having him critically listen to something I had really poured my all into. Needless to say, he treated it as he treated everything... with genuine curiosity and actionability. He sized up the mixes in no time, told me the strengths, the weaknesses, even sent me into the other room to re-print versions slightly quieter, fix this pop here, maybe put the guitar solo up here. He gave it his full 12 hours (what felt like 100 hours to me) and the end product leveled up in so many ways. Granted he is not really a 'mastering engineer', but he approached this little project like he approached everything in his music career, with a deep sense of giving a fuck and knowing that there's no real excuse to not fix the obvious issues in front of you. The album sounded fantastic and it really spoiled me for what a mastering experience could be.",
    "reactions": 14,
    "categories": [
      "diy_vs_professional",
      "album_mastering"
    ]
  },
  {
    "id": "1034566890602893322",
    "author": "hebakadry",
    "date": "2022-10-25",
    "content": "As far as the Atmos vs Vinyl debate…vinyl has an amazing organic culture that has spanned decades especially in the electronic and techno scene…unlike Atmos…a multi channel film format shoehorned by a bunch of corporations to sell their shitty proprietary headphones.  If one more person tries to shill the “stereo is vintage” debate, I will gouge them in the eyes.   Stereo rules…and it’s withstood all the changes this industry has seen because it’s FREE when Alan Blumlien's patent ran out and everyone eventually adopted it…it was not proprietary…and asking the consumer to add one speaker was not a huge ask.  Whereas now, with Atmos…I dunno…it’s depressing.  It's riddled with problems including their horrible horrible binaural algorithm which will continue to change and possibly improve while the engineers that make the records will have absolutely no say in said changes.  I think I wouldn't have had a problem with Atmos if they didn't force the binaural format because it takes the craft out of the medium and you end up spending half the time trying to remotely match the stereo version.  People are making money off of it, but it’s just NOT the artist.  I haven’t met a single artist that was actually excited about Atmos.  Like truly excited about it.",
    "reactions": 14,
    "categories": [
      "vinyl_physical"
    ]
  },
  {
    "id": "1040379503320502342",
    "author": "Nomograph Mastering",
    "date": "2022-11-10",
    "content": "I don’t want clients in the mastering weeds with me, I want them to feel like their record is done.",
    "reactions": 14,
    "categories": [
      "client_communication",
      "business_pricing"
    ]
  },
  {
    "id": "1044722572014657647",
    "author": "Nomograph Mastering",
    "date": "2022-11-22",
    "content": "Will pop in here when I can today",
    "reactions": 14,
    "categories": []
  },
  {
    "id": "1050644226565750854",
    "author": "hyanrarvey",
    "date": "2022-12-08",
    "content": "My vernacular has about 2db of headroom",
    "reactions": 14,
    "categories": [
      "mix_preparation"
    ]
  },
  {
    "id": "1059594235940184066",
    "author": "Nomograph Mastering",
    "date": "2023-01-02",
    "content": "first master of 2023 done!",
    "reactions": 14,
    "categories": []
  },
  {
    "id": "1066135816109305876",
    "author": "Nomograph Mastering",
    "date": "2023-01-20",
    "content": "Thankfully a couple of people have been in touch already",
    "reactions": 14,
    "categories": []
  },
  {
    "id": "1068213023984074802",
    "author": "Nomograph Mastering",
    "date": "2023-01-26",
    "content": "It has become fashionable to post online about targeting -14LUFS or so, but in my opinion, if you care about sounding approximately as loud as other artists, and until loudness normalization improves and becomes universally implemented, that is mostly well-meaning internet chatter, not good practical advice. My advice is to make one digital master that sounds good, is not overly crushed for loudness, and use it for everything. Let the various streaming sites normalize it as they wish. It will still sound just as good. Normalization does no harm to the audio - it's merely a playback volume setting.",
    "reactions": 14,
    "categories": [
      "loudness_lufs"
    ]
  }
]