[
  {
    "id": "1172898983195193404",
    "author": "denimes",
    "date": "2023-11-11",
    "content": "Here’s some construction pics and measurements of my home studio I recently finished. Still need to do some final EQ correction to get rid of the bump at ~200Hz and flatten the midrange area. Overall I couldn’t be more thrilled with how it turned out. I designed the room with multilayer absorption all around. 1ft thick side walls, 2.5ft thick rear, and 6in ceiling (wish I had more ceiling height!) Monitors are our custom 3 way mains with hypex amps.",
    "reactions": 20,
    "attachments": 7,
    "is_pinned": false
  },
  {
    "id": "1469461766894387339",
    "author": "peterlabberton",
    "date": "2026-02-06",
    "content": "So. Permits and construction take a long ass time! Finally FINALLY nearing the finish line. Just need to turn this pile of rockwool into a studio. Everything is itchy.",
    "reactions": 19,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1314638235535933461",
    "author": "Nomograph Mastering",
    "date": "2024-12-06",
    "content": "Tube traps are for suckers! I painted the concrete walls red, got sonarworks going and got right to work!!",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1048350636082733136",
    "author": "cian riordan",
    "date": "2022-12-02",
    "content": "Great reflective wall setup. Might want to consider a cloud, and get those first reflection points. Maybe some speakers too. But looking great so far.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "985366607238950912",
    "author": "Josh Bowman",
    "date": "2022-06-11",
    "content": "Ok so wife is away this week and I’m just working non stop. Then I was like… hey I should use this opportunity to get the house super dirty and build a full back wall bass trap like I’ve been meaning to. Then… you know your shooting stuff in rew, and your like, hey I wonder what it looks like without my big desk. Then you move the desk and it’s insanely better looking on the REW graph. Then you realize you have some old wood and a closet shelf that was gonna get tossed so you make a tiny desk and spend (waste?) 15 hours over the weekend that should have been spent on mixing renovating the studio room and moving things and taking measurements till you don’t know what a anything even sounds like anymore . Anyway I feel like a Total psychopath because this is what I did Friday and Saturday all day and night. Desk is obviously in progress and I need to figure out a shelf for the hilo etc. thinking off to the side and low so I can reach it easily but it’s not reflecting stuff. Also the back wall frame is full of pink fluffy now and covered in interm fabric till I figure out what I want it too like like.",
    "reactions": 14,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1079123764681379882",
    "author": "Slow Hand",
    "date": "2023-02-25",
    "content": "Buncha amateurs. I monitor in an open clearing dozens of miles away from civilization, hung by a crane 40 ft in the air so that I don't get first reflections from the Earth. I had every bird hunted to extinction within a 5 mile radius to cut back on ambient birdsong cause it was masking my midrange, and because they kept colliding with me.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080188315493478410",
    "author": "ehutton21",
    "date": "2023-02-28",
    "content": "9 monster GIK panels shipped my way last night 💪",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232579471937372190",
    "author": "AYOSHADOW",
    "date": "2024-04-23",
    "content": "Updated setup picture from the living room I posted a few weeks ago. Acoustic treatment handmade by me and my pops. I have 2 more of these panels I’m putting around the room. I’m loving the results I’m getting so far. Been a super fun project 🙂",
    "reactions": 14,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1270059547599306782",
    "author": "Zack Hames",
    "date": "2024-08-05",
    "content": "I don’t understand how these diaphragmatic membrane absorbers work…but damn do they work! It’s wild walking around this room and the low end is 100x more balanced. All those weird nodes are dramatically flattened and the decay of the low is reduced.",
    "reactions": 14,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1367215257294213170",
    "author": "cian riordan",
    "date": "2025-04-30",
    "content": "Hey nomo this looks great, what kind of diffusers should I stick above my couch?",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1414689342110040125",
    "author": "jonmatteson",
    "date": "2025-09-08",
    "content": "I finally got my cloud hung and it is feeling really good in here! Have had a bunch of sessions over the past month and everyone is really loving the new space. \n\nWanted to see if anyone had any advice on dealing with this big 50hz dip? Mostly doing co-writes and production in here but mix alot of that stuff as well. Vibe is #1 with acoustics being close behind but I don't want to lose too much space to treatment if possible. I also have this gerhard designed membrane absorber I built for my last place in here at the moment which in the last room was built to target 70-90hz and am wondering if I should take it out or leave it? It is very heavy so not an easy test to take it out. The room is 16'10\"L 15'W 15'5\" high at the top of the vault.",
    "reactions": 11,
    "attachments": 5,
    "is_pinned": false
  },
  {
    "id": "1088215757793542256",
    "author": "cian riordan",
    "date": "2023-03-22",
    "content": "This will get you a discount code for an Attack Wall, a Trinnov, and a handgun.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "873788497113260042",
    "author": "jantrit",
    "date": "2021-08-07",
    "content": "Here’s my home built attack wall! This thing is just amazing, changed my mixing life absolutely. Came to be when I was looking for a portable solution, working in this rented space. I didn’t want to invest in a proper build out and loose the space so everything here can be packed up and moved if need be (well it’s a bit more complex now that I’ve filled the space over the last year and a half haha) but it would still be possible to move the whole rig if need be. These are some older shots, been tweaking the space since then and I’m very very happy with the results. Never heard these a7x’s as clear and I’ve been using them for the last 11 years in 6 different rooms. Looking at getting something with a little more power for the room soon!",
    "reactions": 9,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "985370393948868648",
    "author": "cian riordan",
    "date": "2022-06-11",
    "content": "But seriously, I love this trend towards people minimizing their cockpit layout and putting time into real, meaningful bass trapping.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029148122108141628",
    "author": "masteredbyjack",
    "date": "2022-10-10",
    "content": "Okay here we go…\n\n@ALXCPH found a couple on my camera roll. Excuse quality, one is when I showed my parents the studio for first time. Couple (long) notes…I’m sure @Nomograph Mastering can expand if he chooses:\n\nUnf*ck designed the room. Ruairi you are incredible at this and I’m very grateful. The subtleties in the trade offs when designing a room are something I urge everyone to consider deeply as I learned when working with them!\n\n1. Studio is built in my basement…13 feet long x 30 wide x 8 tall (including treatment). Back wall divides it length wise and makes the studio part 12x15 approx.\n\n2. All treatment is built in…entire ceiling is stuffed with 9 inch pink fluffy, couple inch rockwool in the walls, tuned mass loaded vinyl behind the “housings” to L and R of listening position. Back wall is 6 inches of safe n sound in a frame built of 2x8s (by contractor) with a 24” door. It’s standing by friction just slid tight to ceiling. Quite precise measuring required to do that and make it sturdy so a door can open well\n\n3. Since I get asked a lot…the wall finishes are acoustic felt board. Went that direction because install was way better than a fabric wall (they are firm and can be cut with an exacto knife). Also they are absorptive with no reflections…caveats apply if that’s good for a given space though (rather than the acoustically transparent fabric).\n\n5. @BatMeckley can confirm hard front wall was farrrr superior for me. I had a soft one (felt) against Ruairi advice since I preferred the aesthetic lol, but room was too dead. Uncomfortable. When I switched I could hear much more depth and energy but everything still as crisp and clear. Highly recommend! \n\nHope this helps some people on here. FYI we started my room from concrete block, bare bones so could frame things to hold treatment needed.\n\nWill circle back with some better pics when I’m home. This community has helped me greatly.\n\nCheers friends!",
    "reactions": 9,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "930077029070700555",
    "author": "Maxim",
    "date": "2022-01-10",
    "content": "Optimizing acoustics at the moment ✈️ Once I move my cloud and dial in the rest of the first reflection points the sound will be awesome. Bass is already so much clearer just placing the speakers back against the wall. Anyone have some tips regarding panel placement beyond those typical spots? I have like 8 that aren’t getting used too well imo. Made a mini “vocal recording nook” with 2 extras. I also have 20ft behind my (new) listening positioning.",
    "reactions": 6,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1009318357209722920",
    "author": "Will Melones",
    "date": "2022-08-16",
    "content": "I just added this angle chunk of rockwool at the corner of the ceiling and front wall, and it improved a null at 135Hz by at least 6dB. I’m very pleased.",
    "reactions": 5,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1062040811769954344",
    "author": "bennythetweet",
    "date": "2023-01-09",
    "content": "😂 …not a chance. She’s on a good path, just needs a breather, safe space for a minute. Glad she still can find that here. I should migrate some acoustic treatment out of there tho.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256648089414926346",
    "author": "Deleted User",
    "date": "2024-06-29",
    "content": "Small changes. Stacked a couple of soffits at the first reflection points. brought them up against the wall. The thinner panels (7”) still have the air gap. The extra space is mentally freeing. Also my son listening to as it was for the 100000000000 time 👍",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "835931408748642345",
    "author": "kidcutler",
    "date": "2021-04-25",
    "content": "Ok i made tiny tube traps after seeing what they charge for their defunct nano traps, worked pretty damn well for reflectings between the wall/imac. Mailing tubes stuffed with pipe wrap insulation (folded over and scrunched so essentially as thick as what is inside a tube trap) & wrapped in linen/thumb tacked in place in the back. $100 and a lil more flexible than putting a panel on the desk",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "840275569672978443",
    "author": "Slow Hand",
    "date": "2021-05-07",
    "content": "I’ve compiled a lot of Art Noxon’s writing/speaking on how Tube Traps work from an acoustics/physics standpoint. If anyone would like I’d be happy to send/upload my notes on these.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "841417808574676992",
    "author": "cian riordan",
    "date": "2021-05-10",
    "content": "If you're doing vocals on hardwood or tile floor, rugs are great for nabbing first reflections off the floor. Most of what is bouncing back into the microphone is in that slappy high end area and will likely sound bad. With a guitar cab, the microphone will sit quite a bit lower to the ground -- so in theory this idea is even more useful. However, program-material depending, its likely whatever is coming out of the speaker is going to drastically overpower what gets slapped up from the floor. If there's a rug around I'll typically use it for these situations.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "871765562261405726",
    "author": "aemaury",
    "date": "2021-08-02",
    "content": "i get 'option anxiety' very easily. the prospect of finding and hiring the right acoustician who actually knows how to design for amazing results paralyzes me. buying tube traps has felt like a cheat code to get me around all that. i can't express enough just how amazing it was to go from DIY roxul panels on the walls + corners to the attack wall",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012512601592307792",
    "author": "Deleted User",
    "date": "2022-08-25",
    "content": "By studio build 3 or 4 you realize there are more colors than black and red all GIK got lazy didn’t want to do anything other than hang them up 🤣🤣",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061377054932742214",
    "author": "ALXCPH",
    "date": "2023-01-07",
    "content": "The boring but most usable answer is the same as always. First reflection points, cloud, behind you. If those places arent treated nothing Else will probably make any difference",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139555619968401458",
    "author": "chrissorem",
    "date": "2023-08-11",
    "content": "I just found these photos of my studio build. I promised my self I’ll never drywall again. 60,000 lbs of drywall and the photo on the right is 3ft of bass trap hangers a total of 21 hangers at the back of the control room and then of course the echo chamber behind that 🙂  anyway to anyone working on their build out keep it  up! Soon you will be working in that room and you’ll forget about this madness",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835964338950897666",
    "author": "Josh",
    "date": "2021-04-25",
    "content": "I think this is the start of a black market underground acoustic treatment network funded by the shadow army of musical elites 👻",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860590323167526952",
    "author": "peterlabberton",
    "date": "2021-07-02",
    "content": "Thanks! Yeah, the attack wall would be a stretch but one I’m willing to make if it’s gonna be the right move. I’m really trying to make the very best possible mix room in a rental house I can get, so if that’s the way to go I’m gonna figure out a way to swing it. The ability to move the whole acoustic treatment to a new space when needed is a major selling point. If I opt not to do it I’ll just use the panels I already have and build a ton of DIY tube traps.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "871761220426940497",
    "author": "aemaury",
    "date": "2021-08-02",
    "content": "basically... as someone who came up in NYC, i've always felt it would be a foolish endeavor to spend money on a room build. i sense a darkness around people's experiences building in the city. they inevitably lose the space and investment just a few years later for whatever reason. i have witnessed this pattern myself. only difference is, i bring my tube traps with me from room to room and get back to work immediately 🙂 and the attack wall sounds fucking awesome IMO.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001890817348214814",
    "author": "Will Melones",
    "date": "2022-07-27",
    "content": "My most recent revelation: It's cool to absorb 80 Hz if you have an 80 Hz problem, and you can absorb 80 Hz all day, but it ain't gonna do your room any good unless you put the 80 Hz absorption in the place(s) where 80 Hz is actually building up",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067881013688143912",
    "author": "Zack Hames",
    "date": "2023-01-25",
    "content": "and, from what i can imagine, helps with room modes etc",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082416413106503740",
    "author": "sethearnest",
    "date": "2023-03-06",
    "content": "@CK I can say from hard-earned experience that dealing with that spray foam removal is a big lift, esp. overhead. You'll have earned your shoulder strength by the end of it.",
    "reactions": 3,
    "attachments": 6,
    "is_pinned": false
  },
  {
    "id": "1247610730690121873",
    "author": "chrissorem",
    "date": "2024-06-04",
    "content": "New desk diffuser I’m working on… I’ll report back with the results",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1412858099823411244",
    "author": "Edsel Holden",
    "date": "2025-09-03",
    "content": "Answer is that no one else does ! if anyone has fabric buying questions, I now know a lot about that world, and if anyone is in Nashville needing fabric I have swatches for all GOM, DMD, GIK, Acosutimac, etc... cheers yall",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106778131181867118",
    "author": "BatMeckley",
    "date": "2023-05-12",
    "content": "Throw some packing blankets on the wall. Big desk. Bigger speakers on the desk. A tube trap or two. Profit.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106779506301206589",
    "author": "Slow Hand",
    "date": "2023-05-12",
    "content": "Wrap your head in Auralex foam and gaff tape. Cut some holes for air flow. Profit.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129446118208581753",
    "author": "GaspardMurph",
    "date": "2023-07-14",
    "content": "I thought I’d share my setup here ! I love my space here but I am starting to feel like I’ve hoarded myself into a corner. Too much stuff accumulated that I don’t need / use.\nHere is my plan to make more room, if anyone has an opinion, please shoot 🙂\n- condense all the rack gear into one of the rack cabinets, there a ton of stuff that is just in there and not being used (nor is it patched in)\n- Rhodes is going to my house, I think it will get more use as a practice / songwriting tool in my home.\n- Mellotron goes where Rhodes was, so I can store my tape echoes on the drawer cabinet\n- Smaller desk: I need to find the right one or have one built but I really only need my prophet, mouse and keyboard.\n- Would also be a good opportunity to improve speaker placement\n\nThe room is smaller than it looks in the pictures, it’s 161 sq feet. About 14.9’ long, 11.9’ wide and 7.6’ high. It’s a floating room design and there is acoustic treatment behind the fabric walls (no idea what though)",
    "reactions": 2,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "1135659756342751372",
    "author": "Zack Hames",
    "date": "2023-07-31",
    "content": "Quick and dirty threw together my setup in the “control room”. Long story short a session came up for a friends band to do a live video, we did the recording in this room in the basement, they helped me throw up some absorption in the ceiling as fast as possible and we went for it. Now I’m listening in this room for mixing. Excited to take it further with @Gerhard Westphalen",
    "reactions": 2,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1168983966913662996",
    "author": "itMIGHTbeNICK",
    "date": "2023-10-31",
    "content": "I remember doing insulation for the first time. I thought I could just jump all up into it like a pile of leaves or a pile of pillows. I later had to go to an ER and have a medical bath because my skin didn't mix with the fiberglass...",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187937762444320858",
    "author": "oaklandmatt",
    "date": "2023-12-22",
    "content": "How else am I supposed to put up the super important sound absolution foam?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1233102690075148430",
    "author": "Zack Hames",
    "date": "2024-04-25",
    "content": "Update:\nI was looking at the wrong thickness (3/4\") finding and sourcing affordable 1/4\" was *way* easier. i am getting them about $100 a pop from a local plastics manufacturer in KCMO.\n\nThis has been such a long process because of so many other things getting in the way, should be making some serious headway the next few weeks! Will post updates on the membrane absorbers as I go.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245787602779639828",
    "author": "Lee Rouse",
    "date": "2024-05-30",
    "content": "Really happy with the results of my room after getting proper treatment and bass trapping. This is with Kali IN-8s and the W6.2 subwoofer.",
    "reactions": 2,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "823709820204482620",
    "author": "Rollmottle",
    "date": "2021-03-22",
    "content": "One thing that might help too is some foam angled up sort of near the edge of your table to knock those first table reflections back. You can kind of see that same idea in my picture with the foam peaking up the top of the back of my sterling unit. Worth experimenting with.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835271770843512883",
    "author": "Slow Hand",
    "date": "2021-04-23",
    "content": "lol. Was just thinking: The ultimate \"fuck it\" bass trap would be to buy a few 4' x 2' bundles of Rockwool from Home Depot and just leave them in the plastic wrap and stack a few in the corner.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860233119989497886",
    "author": "cian riordan",
    "date": "2021-07-01",
    "content": "I think the attack wall solves the problem for people that can't build their room from scratch. As someone that just built a studio, building fake walls with insulation & membranes tucked behind aint cheap. And it's permanent. Having tube traps (or the ASC pressure traps, or whatever they are) are not a panacea -- but rather a scalable, portable method of getting an untreated room in the ballpark. I've found with tube traps that more is not necessarily better and you just don't know till you get in there and shoot it. My friend Andrew Maury raves about his. He's gets amazing results and he loves moving around his setup every few months just because he likes tweaking... and the attack wall allows him to do this. So -- if you're building a studio from the ground up, there are absolutely better options. But if you're hopping around from space to space and don't feel like spending $10-15k on framing, fabric, rockwool, & building limp mass membranes... these are a terrific option.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "871763999484702791",
    "author": "aemaury",
    "date": "2021-08-02",
    "content": "ive seen DIY tube traps. its not rocket science to build one that performs similarly to ASC's, but they usually look awful. wrapping the fabric tightly and accomplishing a smooth seam is where it all goes wrong. tube traps are a bit funny looking to begin with, and when the fabric is lumpy its tragic 😆 . my buddy jesse ray ernster is the only person to pull off a pretty damn good looking DIY tube trap.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982329995114450944",
    "author": "Will Melones",
    "date": "2022-06-03",
    "content": "Amazing, thank you for this! I can wrap my head around calculating the length of the waveform, but I’m really interested in checking out these apps. They sound like a convenient tool.\n\nApplying that to the building specs as you said is the complicated part. Like I can’t assume the same square footage of mass loaded vinyl or MDF is going to vibrate at 80 Hz regardless of thickness and composition, etc. Was just wondering if anyone had build anything in their own studios other than velocity absorbers.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001671076159426570",
    "author": "Eric Martin",
    "date": "2022-07-26",
    "content": "GIK Panels, GIK corner traps, 4 bundles of the R-21 soft stuff, and 10 Craigslist Panels that someone built out of 703.\n\nMy room is fairly tuned for being in a basement and not doing a build out.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001818319684370434",
    "author": "ALXCPH",
    "date": "2022-07-27",
    "content": "Bass absorption = mass & distance. No matter what. No tricks Will work. It’s just physics.\n\nA little reflection here and there Will make the room much more natural. Most people cant controll their bottom anyway. So having a completely dead highs and mids and a ringing bottom makes a room Sound very un natural. \n\nControlled is better than dead",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012694055794245642",
    "author": "Josh Bowman",
    "date": "2022-08-26",
    "content": "Haha trueee, I’ve just been dragging around my old ass gik black ones for the last 4 rooms. They’re looking a bit worn, gonna look into just re wrapping them to look like yours.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029971530878300160",
    "author": "cian riordan",
    "date": "2022-10-12",
    "content": "The loft might honestly be less work. Easier to contain high & mid issues while letting the low end vent out. Food for thought. This looks like you need quite a bit of absorption to contain the size of the room.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036048863343161384",
    "author": "Rollmottle",
    "date": "2022-10-29",
    "content": "looks like all the walls and ceiling are soft, so conceptually a diffuser in a room like that makes sense. would be dubious of one directly over the listening position in any case.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061387758410674248",
    "author": "Nomograph Mastering",
    "date": "2023-01-07",
    "content": "Keyboards can generally be to one side. We’re focused on dealing with first reflections, it trying to bracket the whole area with soft stuff",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079125759752409218",
    "author": "sethearnest",
    "date": "2023-02-25",
    "content": "“First reflections from the Earth” makes me think about building a mix room on a platform a la Cerebro in X-Men.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101600339880317009",
    "author": "Tim O’Sullivan",
    "date": "2023-04-28",
    "content": "Realized these are all pre acoustic panels",
    "reactions": 1,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1104176277772058735",
    "author": "Bryan DiMaio",
    "date": "2023-05-05",
    "content": "I'll venmo you a buck if I go home and remove my front wall absorption, stick the speakers against the wall, and my SBIR problems are gone",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110585857766858822",
    "author": "masteredbyjack",
    "date": "2023-05-23",
    "content": "You'll end up in a great spot regardless. One of the best things working with Ruairi taught me was to just really think deeply about all the factors involved, consider what they mean to you. When I came to him I was about to get ATC 150s with a full GIK panel plan. (** shudders**)\n\nThe fact that you're here asking all this, you're already way ahead of where I was",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140006465046855791",
    "author": "jonmatteson",
    "date": "2023-08-12",
    "content": "looks great adam!\nisn’t it insane the difference it makes?!\n\nwhat size absorbers did you end up doing on the back wall? \ni need to add some more to mine and think sizes like this could work well",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140270123438067822",
    "author": "Adam Thein",
    "date": "2023-08-13",
    "content": "It varied on some panels to @Gerhard Westphalen spec - apparently the type of material is dependent on the room modes you are targeting - in my case it was 1/4” on a couple panels and 1/8” on most",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174400827843149925",
    "author": "Nomograph Mastering",
    "date": "2023-11-15",
    "content": "Use a Porous absorber calc and see the differences for yourself",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1229519362772303902",
    "author": "Deleted User",
    "date": "2024-04-15",
    "content": "Burlap works, I bought it from here \n\nhttps://www.fabricempire.com/58-wide-burlap-fabrics.aspx\n\n: these are cheaper but not fire rated. My insulation material though is! I used Owens Corning Thermafiber. They had the dimensions and density I was looking for. \n\nJOANN also carries good fabric. \n\nFor solid but pricier options, Guildford of Maine as Ruairi mentioned, and Camira also has really nice looking fabric.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267366066607357952",
    "author": "EliHeathMusic",
    "date": "2024-07-28",
    "content": "I’m attaching pictures to show how they are constructed. Basically you make a box with rough plywood, brace it, add rockwool, stretch fabric over it, add trim pieces and then attach the 2 by 4s with wheels. \n\nSome tips:\n-The finish pieces should be a little over an inch longer than the internal frame pieces: 1 inch to account for the added length of 2 sheets of 1/2 inch plywood and a little extra to get over the fabric. This time I cut them 1.25 inches longer and had to sand down the top and bottom trim pieces a little.\n-Predrilll pilot holes as much as possible to avoid splittling the thin plywood. For the finish pieces I also did “diy countersinks” using a larger drill bit in order to have the screws be flush with the wood. \n-Stretch the fabric tight but not so tight that it warps the frame in the middle. Start by stapling on the long sides at each end of the middle brace, then work out from the center stopping a foot or two away from the corners. Then staple the centers of the short ends and finish with the corners. I staple every 6 inches or so and each time I add a staple I try to pull the fabric so that it is tight in two diffent dirrections (pullling away from the center of the panel). The way I’m describing this might be confusing and I can elaborate further if it is helpful.\n-The 2 by 4s at the bottom are 15\" long so they extend an extra 3 inches on each side of the panel and that ended up feeling very stable.",
    "reactions": 1,
    "attachments": 6,
    "is_pinned": false
  },
  {
    "id": "1277367109311004851",
    "author": "chrissorem",
    "date": "2024-08-25",
    "content": "I didn’t but i factored in the years of life I lost from breathing in all the fiberglass",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298793549059461121",
    "author": "Spencer Broschard",
    "date": "2024-10-23",
    "content": "Thanks man! I also stuffed 6” of rockwool on top of my existing cloud and I can definitely hear a tightening in the low end",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374260815066169437",
    "author": "Paris / Blue Butler Studios",
    "date": "2025-05-19",
    "content": "If the foam isn’t super dense I’m not sure it would do much, I’ve only used weather stripping and I know that works",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376727872840138812",
    "author": "masteredbyjack",
    "date": "2025-05-26",
    "content": "Even if within arms reach — you can draw the reflection points (in mind or on paper), to see what and where things would come back to your ears\n\n(I asked him the same question a while back)\n\nSo — low boy right back where you listen. Is there any way sound could reflect back to your ears there given angle of it?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383835175946817538",
    "author": "itaylerner",
    "date": "2025-06-15",
    "content": "And just the way it diffuser the light and adds some depth and texture. I love a great Bang for buck improvement ✅",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447336582964318371",
    "author": "Gerhard Westphalen",
    "date": "2025-12-07",
    "content": "With porous absorbers it’s not much more than the weight of the insulation. A big 9” panel will stand up on its own but I still recommend putting a stand (could just be strips of wood screwed into the bottom) if they’re not tied to the wall",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447365200771547258",
    "author": "Gerhard Westphalen",
    "date": "2025-12-07",
    "content": "Membrane absorbers are built using 3/4” since they need to be heavy enough to not resonate otherwise it affects the performance. Everything else can be 1/2” MDF or plywood. If you’re not wrapping the entire panel in fabric then you’d want nice plywood",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "823709538238201857",
    "author": "cian riordan",
    "date": "2021-03-22",
    "content": "Looks great! Are those bass traps to your 9 & 3 o clock?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "823710086072631387",
    "author": "Rollmottle",
    "date": "2021-03-22",
    "content": "Yeah. They're GIK soffits that used to be in the rear corners that Ruairi re-purposed in this position.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835255385568575558",
    "author": "Zakhiggins",
    "date": "2021-04-23",
    "content": "Making absorption panels out of a shit tonne of towels stuffed neatly into a wooden frame is a very under rated method for acoustic treatment",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835282401218265108",
    "author": "Zakhiggins",
    "date": "2021-04-23",
    "content": "Here's a bass trap I made out of towels and a wooden frame one time lol",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "835282693516165130",
    "author": "Zakhiggins",
    "date": "2021-04-23",
    "content": "I tested it out against a relatively inexpensive foam bass trap and it was believe it or not, significantly better, to my ears anyway",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835282913070940161",
    "author": "David Fuller",
    "date": "2021-04-23",
    "content": "I mean, towels have significantly higher GFR than foam",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835950718367039489",
    "author": "Slow Hand",
    "date": "2021-04-25",
    "content": "Yeah. The price on ASC's Tube Traps seems excessive. Seemingly they're targeting well-funded studio owners and not aiming for a broader market.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835951024535633981",
    "author": "Slow Hand",
    "date": "2021-04-25",
    "content": "I've tracked down Art Noxon's patents for the different tube traps, but I'm unclear on how to interpret them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835965255809105980",
    "author": "Slow Hand",
    "date": "2021-04-25",
    "content": "Ok. So the first attachment is the first patent I came across. I believe Art has a few patents, but since this is the common tube trap, let's focus on that. The second attachment is a diagram which you can find on the ASC website.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "840119682690056208",
    "author": "skinnybreakfast",
    "date": "2021-05-06",
    "content": "Eric has hinted he may talk more about tube traps in particular whilst sharing more info about his new studio build in Vermont.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "840120821489729536",
    "author": "oaklandmatt",
    "date": "2021-05-07",
    "content": "@Davi Juno has shared the full specs for the bass traps, which he also built for my studio after barefoot. we should pin it. @Slow Hand or Cian might have this too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860191855387213855",
    "author": "peterlabberton",
    "date": "2021-07-01",
    "content": "Ooo nice. I have a lead on some used tube traps/an attack wall and am debating going for it. So pricey! But it seems like quite possibly the best option short of doing construction, and since I’m going to be in a rental that’s not on the table. You’ve been happy with these? Worth the investment?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860227190457106452",
    "author": "chadwahlbrink",
    "date": "2021-07-01",
    "content": "I would be very curious to hear the unfuck guys' chat tube traps! I keep seeing Jon’s in pics and curious to hear his thoughts as well.\n\nThey have been great for me. I scored my whole set in 2 batches (16 tubes, 3 speaker stands) for roughly $4500 total - which is still pricey but a great “deal.” Also, they make my Apartment’s basement bedroom usable. \n\nThey lock you into a very specific aesthetic and ergonomic setup, which I have found interesting to navigate (placing a desk, can’t adjust speaker height, etc.).\n\nThey also sound great for tracking! I have used them while tracking drums, harp, vocals, and other things with excellent results.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860229256675459072",
    "author": "kidcutler",
    "date": "2021-07-01",
    "content": "Some of it seems to be alluding to the attack wall is the exact opposite of northward acoustics method of a reflective front wall, I am inclined to strongly entertain it as he is truly in a sonic league of his own",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860238451956776981",
    "author": "chadwahlbrink",
    "date": "2021-07-01",
    "content": "Yes, for sure! As a renter, work-from-home option, they are a dream. I think you could get better ergonomics and potentially better sound from other studio design options, but the flexibility is great. They are definitely not a magic bullet to get a “flat room” either and placement / quantity can affect things greatly. \n\nAndrew Maury was the one who inspired my initial purchase! He does fantastic work on them and was definitely a great resource as I was looking into them. He shared this video with Greg from Kush audio which was very convincing at the time  https://m.youtube.com/watch?v=P7pOA4eeuS0&t=72m13s\n\nI also have friends who have had good success building diy tube traps — which can be pretty affordable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860307501693665291",
    "author": "peterlabberton",
    "date": "2021-07-01",
    "content": "Now… are the tube traps/attack wall effective to the point where a layout like this would still be an optimal listening environment? Totally off-center mix position, but I think this would optimize my new room, instead of dividing the recording spaces on either side of the desk. (Upper right in case my drawing is as bad as I think it is!)",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "860581012073742347",
    "author": "chadwahlbrink",
    "date": "2021-07-02",
    "content": "@peterlabberton I’d say if you do go attack wall, @cian riordan is correct to say the mix set up will ultimately take up more space. My room is about 13x13, I think, and the attack wall takes up most of the usable space minus a storage area in the back. \n\nThe second drawing will probably be most accurate. Also, don’t feel like the attack wall is the “only” solution - especially if it’s a stretch financially. There are other options at multiple price ranges. It could be worth getting a consultation from someone once you get into the space.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "863130651574534185",
    "author": "peterlabberton",
    "date": "2021-07-09",
    "content": "My future setup. Will of course need to adapt as I get in the room and listen, but I'm excited *and* need to minimize downtime between studios, so I'm mapping stuff out as best I can so I can hit the ground running.\n\nI'm thinking I'll build some fiberglass/rockwool panels on stands (the four panels freestanding by the mix position) and mimic some of the idea behind the attack wall: kill reflections closer to the listening position rather than at the walls. This way I can keep the fireplace and windows from being covered up, and have some gobos to move around when needed for tracking. The small desk to the left of the mix position will be a rack for gear, the large rectangular thingy in the upper right will be an upright piano. I'll pack in some DIY tube traps around the monitors, and hang two 4'x2' panels I already own over the mix position. I'll also put two slightly smaller panels over the drums, and two more on the wall behind the drums. The french doors and the sliding doors to the closet behind the couch will have heavy curtains.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "865978127146680350",
    "author": "francoslate",
    "date": "2021-07-17",
    "content": "Hey Chad, curious if you can elaborate based on experience what work/treatment makes up the 25% Greg mentions in the video. I think I saw the attack wall only goes down to 110hz? Are you using yours with any additional bass trapping or other panels?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "866014136680710144",
    "author": "chadwahlbrink",
    "date": "2021-07-17",
    "content": "Hey 👋 \n\nSo honestly, I don’t have further bass trapping (and I should). I have the 16 9” tube traps and 3 13” speaker stand tube traps (that probably do dip a bit lower into the bass trapping realm), then I have a 4’ x 2’ x 4” cloud above me from ATC. Then just two wall-mounted ATC panels in the back. \n\nMy room has a bump at 85 Hz, but I have mostly learned to work around that! It’s not a big issue outside of some sustained bass notes. \n\nMy setup definitely could use some more treatment, but I’ve been waiting to move to a more permanent space. I also have a lot of listening time down here and mainly like the results!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "866014660091183144",
    "author": "chadwahlbrink",
    "date": "2021-07-17",
    "content": "I think Greg’s percentages mainly were made up, but I'd say outside of bass resonances, the tube traps do some amazing things for clarity and primarily spatial clarity.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "871760006767329352",
    "author": "aemaury",
    "date": "2021-08-02",
    "content": "hey everybody! was just poking around here. happy to jump in about my experience with the attack wall.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "871762306730696704",
    "author": "aemaury",
    "date": "2021-08-02",
    "content": "ive had a lucky streak finding Studio Traps on the used market in and around NYC over the course of 9 years now. i initially found a guy in miami who sold and freighted me 25 (!!) Studio Traps and a pair of the ASC Monitor Stands. that got me going and i have since bought even more. i have an attack wall going plus a few QSF (quick sound field) setups in various locations around the studio... drums, vocals, etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "871766133433327656",
    "author": "aemaury",
    "date": "2021-08-02",
    "content": "all that said, im open minded about the future and i might be enlightened to even better monitoring with a 'proper' room build one day. maybe the attack wall is a stepping stone in my journey... we'll see. but its been a decade using it now. i'll never regret the work and progress i made with it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "871811436106633247",
    "author": "peterlabberton",
    "date": "2021-08-02",
    "content": "@aemaury hey, thanks for all the attack wall wisdom! If you’ve been poking around above you may be privy to some of my waffling on whether to go for it or not. I just moved into a house and am moving my studio in here, too. With all the other moving and studio costs I’d kind of resigned myself to just using panels for the time being. But… I could maybe scrape together enough for like 6 or *maybe* 8 tube traps. With 3-4 on either side of the listening position, do you think that would even be worth it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "905165913811189792",
    "author": "Slow Hand",
    "date": "2021-11-02",
    "content": "Are those black panels in your 4th photo limp mass absorbers?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "905166367794286655",
    "author": "kylem",
    "date": "2021-11-02",
    "content": "Yes, those are limp mass absorbers. There are 9 total",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "939353635312250900",
    "author": "Slow Hand",
    "date": "2022-02-04",
    "content": "Those diffusers at the front look pretty cool. Like bookcases stacked with books.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "939355568152387634",
    "author": "Rollmottle",
    "date": "2022-02-04",
    "content": "I think they are? They're just covered with craft paper. There are services you can order \"decorative\" books in bulk by color etc. Assuming there's a great deal of bass trapping or resonators behind those.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "942313486464188426",
    "author": "Shadowherb",
    "date": "2022-02-12",
    "content": "from the research I've done, the whole \"acoustic fabric\" thing is snakeoil, all that matters is that the weave is loose enough that air passes through the membrane so it can interact with the absorption material behind it. when I built 12+ panels for my home studio I just went to the Walmart fabric section and did a \"breath test\", putting my hand behind the fabric and seeing if I could feel my breath through it. I think my panels work great and I payed $3-5/yd as opposed to some of the insane prices you find for fabric specifically designed for acoustic panels. aesthetics are obviously a factor, but those are my 2 cents!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "942436748946968656",
    "author": "Josh Bowman",
    "date": "2022-02-13",
    "content": "Sorry don’t have a definitive answer… I’d search gear space and see if Glen from gik has answered it before maybe?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982045343086690345",
    "author": "ehutton21",
    "date": "2022-06-02",
    "content": "anyone who’s built tube traps for an attack wall in your setups: was it an incredibly lengthy process, or could you knock it out with two other sets of hands in a day or two?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982284725781667840",
    "author": "jantrit",
    "date": "2022-06-03",
    "content": "It took me about a week to make 28 3ft traps for an attack wall. I did add some diffusion to them with mass loaded vinyl strips on half the surface  so it was a little more involved than the standard tubes. Well worth it though! Like @cian riordan said it’s gonna be itchy, long sleeves, jeans and a mask and gloves will be your friends. Also a cold shower when you’re done. It’ll close up your pores so the fibers can’t work as deep. The longest part of the process was using a jigsaw to cut the wooden caps for each end, this is absolutely needed for the traps to work properly and I’d recommend using a good quality construction adhesive like the gorilla stuff. Tried a bunch of diff ones and that was the only one that could get the job done.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982289849849610281",
    "author": "Will Melones",
    "date": "2022-06-03",
    "content": "Has anyone made tuned membrane absorbers? I’ve googled about for some simple direction, but it all seems over my head—as it should be. I’m particularly curious about how one would calculate the dimensions to target a specific frequency.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001929073091678318",
    "author": "ehutton21",
    "date": "2022-07-27",
    "content": "Got a couple primacoustic panels up for reflection treatment near where I track but nothing else in the room at all. I mix in cans with correction, but i can bust out a mix on speakers if need be. Working in the center of the long wall of my apartment lmao. I have a feeling my room curve would look obnoxious but idk.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036114132862238750",
    "author": "David Fuller",
    "date": "2022-10-29",
    "content": "Have to agree, diffusion in control rooms sounds weird in a profoundly not-good way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036147680289771550",
    "author": "NoahNeedleman",
    "date": "2022-10-29",
    "content": "This may be one of my beliefs that is objectively untrue, but I have a one room studio for production/mixing, absorption in the front and diffusion in the back, and honestly it’s my favorite place to listen to music, my mixes translate, and recording in here is a dream (as long as the sources aren’t too loud.)\nI was under the impression taming direct reflections was important, but all absorption leads to problems.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036150100197638164",
    "author": "Nomograph Mastering",
    "date": "2022-10-29",
    "content": "Your last statement is correct but it does automatically lead to diffusion",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036252791573839972",
    "author": "NoahNeedleman",
    "date": "2022-10-30",
    "content": "I’m sorry I may be misunderstanding you- what automatically leads to diffusion?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040727062249492480",
    "author": "JakeTB",
    "date": "2022-11-11",
    "content": "Not a show-your-setup, but not sure where else to post. I am moving my studio to a less-than-ideal room in our house. Trying to figure out the best allocation for the panels I already own to get up and running, and wanted to see if any of you smart folk have ideas or can poke some holes in my first draft. (Obviously @Nomograph Mastering feel free to abstain if this goes too far into “people pay me thousands for this service”.)\n\nI have:\n13- 24x48x4 panels\n1- 48x72x4 panel\n1- 36x36 panel\n\nIt’s a mostly square room (11ft4in walls) with an awkward closet and classic low residential ceiling. My thought here is to stack the 24x48 panels to create a \n6ft x 8ft x 4in wall on either side of the listening position, use the 4ftx6ft panel as a cloud centered about 30-32% into the room, and use the remaining 36x36 and 24x48 panel to cover what I can of the back wall.\n\nEventually I’d build a pair of gobos, store them in the closet for absorption when mixing, and bring them into the room when cutting a vocal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040736508233125948",
    "author": "popaganda.",
    "date": "2022-11-11",
    "content": "I’ve sort of created a soffit situation for my speakers which I’m really loving. Panel in between and a tube trap on either side. Don’t go buying tube traps…I got a couple before I knew any better",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040747764847485079",
    "author": "JakeTB",
    "date": "2022-11-11",
    "content": "Lol definitely no tube traps here. Just using what I have for now, I’ll build anything I need extra or buy it if it’s over my pay grade. 😉 but they will not be tube traps",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040749975157608500",
    "author": "chloe corley",
    "date": "2022-11-11",
    "content": "also makes sense since thats the reflection point",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040763296552337568",
    "author": "popaganda.",
    "date": "2022-11-11",
    "content": "It’s kinda building off of that concept. The speakers are still against the wall, so you get the cleaner low end phase from the wall, but you’re also putting the speakers in a fake absorbsion wall and hearing a more direct sound. Idk about the science, but it’s so nice for imaging. You can hear exactly where sounds are LCR. Kind of like the attack wall idea but with normal panels",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061386738024579152",
    "author": "Nomograph Mastering",
    "date": "2023-01-07",
    "content": "You need a good cloud, and significant (prefer 6”) absorption left and right, preferably with an air gap. I suggest freestanding Gobos left and right",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064910829931216967",
    "author": "ALXCPH",
    "date": "2023-01-17",
    "content": "Im about to do some studio cleanup and redecorating as i switch out my acoustic panels. What are you guys using for cable ties? Normal strips? Also any good strong Velcro recommendations?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064990483664875561",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "I have a Hilo goes AES to speakers and as my send/capture for the Massive Passive...you can't see it here but there is a rack under the screen where it sits. I have a side car off the side (the walls look pretty tight but they are actually the unf*ck mass loaded vinyl L things, so the room opens up more behind them). The sidecar is back from those...its got a apogee symphony taking the ins for my synths (also not really pictured -- just hangarounds from my production days for the fun of it sometimes), Hazelrigg VLC in there too.\n\nThere is sorta a whole room behind the listening position...its 30 feet long with a floating wall for absorption about 15 feet in so the studio is like 13x15 but acoustically its larger if that makes sense.\n\nI do use streamdeck...but mainly to switch quickly between the hot ref in Wavelab and my master. I've gotten deep into Applescript which essentially handles all of the other Wavelab processes...it's almost finished but my streamdeck will essentially just launch those applications to do what I need. So I'd say it's very useful, but the coding I've been able to do will render it sorta meaningless for me (though convienent, I use it for other things like navigating websites when doing client outreach, etc which is very handy and makes my workflow like an order of magnitude quicker).\n\nChair is hag capisco. I love it. Had a serious back injury when I was younger so I'm pretty dialed into having things be ergonomic and I find it's great. Actually kinda rather uncomfortable...in a good way. You can't really slouch. Took some getting used to but it's interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076958815301423204",
    "author": "ehutton21",
    "date": "2023-02-19",
    "content": "Becoming GIK’s favorite Sunday customer 🫡",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079129873001484403",
    "author": "ehutton21",
    "date": "2023-02-25",
    "content": "Can’t worry about a ceiling cloud if the ceiling is your front wall",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082087259374878802",
    "author": "BatMeckley",
    "date": "2023-03-05",
    "content": "What is it about the GiK soffit traps that you like so much over their standard trap?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082087581203828766",
    "author": "Nomograph Mastering",
    "date": "2023-03-05",
    "content": "They are stackable, off the shelf and have 17” deep of absorption. So for a renter if you have enough space left and right they can actually make a meaningful difference at low frequency. Which a regular 4” deep panel can’t",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082089256819884082",
    "author": "popaganda.",
    "date": "2023-03-05",
    "content": "Re: gik soffits - is there any benefit at all to putting some in front corners, or is it best if you just have a bunch along the walls",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082384619665621023",
    "author": "CK",
    "date": "2023-03-06",
    "content": "So I decided at the last minute not to buy the house I was supposed to close on next week.  It just did not feel right in my body. It was a major purchase and after lots of sleepless nights I decided that it was not the house and neighborhood I wanted to be in. We absolutely love our current little house my girlfriend owns, and we love this neighborhood in Nashville (Wedgewood Houston).  I was excited for the bigger studio room, but it is what it is, and I feel really great about this decision.\n\nWith that said, this means my current attic studio needs a major upgrade asap. I am ready to get to work. First thing I plan to do is either shave down this insulation so it is flat to the studs and cover with fabric (it is 6in deep), or remove it entirely on my workspace side and replace it with Roxul insulation. It is definitely quite dead sounding up here, but I am wondering if Roxul will outperform this spray foam for the type of absorption I need?  I imagine this is an easy yes, but I wanted to check here first before I dig it all out (not that hard). I only plan to dig out the studio side of the room. I am moving the monitors up against the wall, and considering making that front wall reflective with wood. My rear wall is 26ft behind me.  I was thinking of building a big ass bass trap for the rear of the room to put above and behind the water heater.  And of course, a Cloud above the mix position. The room is 8ft tall in center, and a long A Frame shape. I have had that green fabric covering the insulation currently.  I tore it down to take these pics.\n\nMy main questions is: Should I build upright gobos for my side reflections, or would just replacing the current roof walls with Roxul likely be good enough?  This room is not ideal, and I do not expect it to be perfect, just good enough. Thank you all. Sorry it is so damn messy as well.  It is getting a major purge and reorganization stat.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082390626089324556",
    "author": "sukhuno",
    "date": "2023-03-06",
    "content": "I kinda like the texture of the spray foam tbh",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082393993532411985",
    "author": "sukhuno",
    "date": "2023-03-06",
    "content": "Also interested in the best way to treat the rear wall of the room.. i'm assuming you want as much depth of absorption as possible for the low freqs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082419366873796659",
    "author": "Slow Hand",
    "date": "2023-03-06",
    "content": "Bold of you to leave all your gear in the room when you tore the foam out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082419631282737203",
    "author": "sethearnest",
    "date": "2023-03-06",
    "content": "That one pic is deceiving -- the gear wasn't under the foam's path to the ground",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082419736610095217",
    "author": "sethearnest",
    "date": "2023-03-06",
    "content": "It was all just open floor under the Great Foam Drop™",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082427593619419177",
    "author": "CK",
    "date": "2023-03-06",
    "content": "I think step 1 is cleaning up the spray foam and replacing certain areas with pink or rockwool insulation and getting the room cleaned out, and then taking a measurement and building from there. It sounds as if spray foam is not proper “treatment” and I can get a lot out of just replacing some of it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082779694627303555",
    "author": "ehutton21",
    "date": "2023-03-07",
    "content": "I was thinking I could build or purchase a cubby esque item that spans the 74 “ width of the couch to provide a height boost. I’d have back wall gobos spanning 8x6, but they’d maximize any coverage provided by the couch cause the absorption from the panels would start at ~34-36 inches.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084223532998873129",
    "author": "Chris Doms",
    "date": "2023-03-11",
    "content": "It’s getting better, that’s all I can really say right now. The image was better than I thought it would be in here to begin with. Definitely wanna experiment with speaker height and width a little more. We still have to finish gobos for the first reflections/rest of the room. Recording some stuff today and gonna see how it sounds back at my spot too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088268427879260201",
    "author": "jonmatteson",
    "date": "2023-03-22",
    "content": "Yes! Well a homemade one with foam but same sound. It’s my favorite guitar to write on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088710732754980904",
    "author": "ehutton21",
    "date": "2023-03-23",
    "content": "Hanging cloud panels as a one man team this evening",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088948168370171974",
    "author": "ehutton21",
    "date": "2023-03-24",
    "content": "Having a wild ADHD experience where I ordered my GIK panels for my pseudo-back wall in the completely wrong color 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094051434175152229",
    "author": "ehutton21",
    "date": "2023-04-07",
    "content": "I will say that with the price of those at retail, you could probably do some damage at GIK on go bos at reflection points",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094725177742475446",
    "author": "Gerhard Westphalen",
    "date": "2023-04-09",
    "content": "If you wanna get one, I’d suggest finding some pictures of what’s in them before you decide. It’s just one of their 6” woofers with a mic circuit and their velocity reducing material or whatever they call it which is just some foam in front of the woofer. A tad expensive for a tiny sub IMO",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095136290002976819",
    "author": "Rollmottle",
    "date": "2023-04-10",
    "content": "Ruairi says a resounding yes to this diffuser",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095409441161093252",
    "author": "Will Melones",
    "date": "2023-04-11",
    "content": "I asked for an expensive modern studio where a super famous mix engineer works.\n\nAI seems to have added a panel at the first reflection point 🥹",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1095837842925695156",
    "author": "ehutton21",
    "date": "2023-04-12",
    "content": "Question: for those side wall reflection points, if you‘be done the minimal effective dose 6x4’ of the monster gobos, is there any cue/rule of thumb for where they go similar to the cloud and where you want most of the absorber’s mass to be located?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104164683583328316",
    "author": "popaganda.",
    "date": "2023-05-05",
    "content": "When I say panels I’m talking about GIK style 2’x4’",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104173864168194208",
    "author": "Bryan DiMaio",
    "date": "2023-05-05",
    "content": "when you say right against, is it better to be right up on an absorber or to not even have the absorber and just go right up to the wall?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104224372157321277",
    "author": "cian riordan",
    "date": "2023-05-05",
    "content": "My experience lines up with this as well. I know unfuck have moved lots of ground in acoustics and have the results to back it up, but I always find the bare front wall with non-soffit speakers smears the center image a little more than when there’s a little bit of absorption back there. I don’t have a million examples, but enough to know that it’s not my preference.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105576923851145327",
    "author": "Rollmottle",
    "date": "2023-05-09",
    "content": "I think basic first principles still apply. Cloud, first reflections and back wall. I don't think you're screwed up against the window too much except for having to deal with the first reflections on either side of your speakers and therefore would have to obscure some of the windows. If it's less a critical listening space and more a creative space, then trying to control the room overall would be how i would approach it. i would still get a solid listening position nailed first.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105578224001482864",
    "author": "popaganda.",
    "date": "2023-05-09",
    "content": "I think flipping the room might work. Bay window in the back, then panels at first reflection and cloud",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105580134402105354",
    "author": "popaganda.",
    "date": "2023-05-09",
    "content": "Back wall is important, but less so than cloud and first reflections",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105591000497389629",
    "author": "Sean Rogan",
    "date": "2023-05-09",
    "content": "just to check first reflections you’re talking about the sides right ?? makes sense, just means i’ll have a panel against the door when i’m in there i guess",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106721809832882196",
    "author": "Nomograph Mastering",
    "date": "2023-05-12",
    "content": "Avoid panel plans from people like GIK etc, they are very sweet and the products can be great but their plans are dismal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106743753412186122",
    "author": "shaunobi",
    "date": "2023-05-12",
    "content": "All this talk about acoustics made me want to post a picture of my space. 400 sq ft. Free standing. Not perfect and many abortive acoustic treatment attempts in there while I worked through the Acoustics handbook but… all mine 😉",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106743863697231952",
    "author": "shaunobi",
    "date": "2023-05-12",
    "content": "Didn’t pay over $100 for any one of those damn tube traps. Been collecting them for years.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110420417220460584",
    "author": "cian riordan",
    "date": "2023-05-22",
    "content": "Then you’re stoked. You’ve got some big dimensions to work with. Would highly recommend membranes as a means to control low end… they’ve worked amazingly in my spot. Basic first reflection/cloud theory you can read all about in this server, just do a search.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110426396460851240",
    "author": "Nomograph Mastering",
    "date": "2023-05-22",
    "content": "So obviously we want to treat the ceiling but getting mineral wool thick enough to be effective at 70Hz is not easy, and will take too much space",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110427531666001990",
    "author": "Nomograph Mastering",
    "date": "2023-05-22",
    "content": "A membrane is the obvious answer but again space is the issue, the membrane only takes care of stuff up to say 120Hz and then we still need 6\" of mineral wool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116460891236470794",
    "author": "Bryan DiMaio",
    "date": "2023-06-08",
    "content": "Haha I’m not against your setup, just was poking the bear so to speak regarding his general aversion to tube traps",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116524986946039919",
    "author": "shaunobi",
    "date": "2023-06-08",
    "content": "I remember being sold tube traps long ago in a Bruce Swedien article... Michael Jackson recorded with them in a big square on a sound stage, like 15 or 17 of them or something. I was like \"well damn those vocals sound GREAT\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116527120370368613",
    "author": "Gerhard Westphalen",
    "date": "2023-06-08",
    "content": "DIY tube trap guides. I get a lot of “maybe I should build these”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116527271063322745",
    "author": "shaunobi",
    "date": "2023-06-08",
    "content": "For your design work, what acoustic treatment manufacturer(s) do you work with?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116527603721982053",
    "author": "shaunobi",
    "date": "2023-06-08",
    "content": "oh man I found this tube trap stuff and I totally know an ME that uses these things!! They look identical including the size!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122975369528615068",
    "author": "Rob Domos",
    "date": "2023-06-26",
    "content": "Great question. I built some 14” absorbers with the fluffy stuff and it looks so ugly from having an irregular shape that I have to keep them behind a thin curtain.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1127681529380864031",
    "author": "joshbonanno",
    "date": "2023-07-09",
    "content": "hi there, not sure the best channel to ask this, but i am gearing up to build a large amount of acoustic panels and looking for the best place to buy (along with type) of fabric for the panels. previously i have just gone the walmart/joann route but something tells me there has to be a better place/resource online to buy decent qualiity fabric in bulk.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128078232151928853",
    "author": "Rollmottle",
    "date": "2023-07-10",
    "content": "gonna have to wait until they perfect the plasma screen/absorber combo and have my screen floating in thin air between the speakers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138845893173456938",
    "author": "Zack Hames",
    "date": "2023-08-09",
    "content": "Basically just starting the process with @Gerhard Westphalen slowly but surely. (Slow on my end!) double layers of rockwool safe n sound in the ceiling to start.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140013475276542094",
    "author": "jonmatteson",
    "date": "2023-08-12",
    "content": "nice!\ndid you attach anything to the backs or just open rockwool?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141103412163915926",
    "author": "Zack Hames",
    "date": "2023-08-15",
    "content": "Well. Better. But I’m just hearing all the issues a lot clearer is how it feels. \n\nThe walls are made of ICF block (concrete poured into styrofoam). So the low end does NOT leave the room. The two metal beams vibrate and have a metallic ring. TONS of weird phase shit. Like horrible modal stuff I can really pinpoint. \n\nAlso like, a 1khz tone sounds out of phase sitting in front…but if move L or R in either direction it gets 10x louder. I’m at a horrid starting point is how it feels but @Gerhard Westphalen will straighten me out.\n\nThis did a lot though. Before every bit of low end resonated like an 808.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141105970009878579",
    "author": "Zack Hames",
    "date": "2023-08-15",
    "content": "Oh yes wearing a mask, gloves, long sleeves, etc. fuck not doing that even with the rigid fiberglass",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1148384266091253941",
    "author": "Slow Hand",
    "date": "2023-09-04",
    "content": "I prefer the soundstage and diffusion properties of a nice moose head.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153747428806238310",
    "author": "itMIGHTbeNICK",
    "date": "2023-09-19",
    "content": "This is my humble home setup in the corner of my bedroom. There’s nothing glamorous here. While I’m still building out the room downstairs and things have been at a hault due to some financial difficulties I won’t get into. I’m doing most of my work right here these days if I can’t get studio time at my buddys space. I’m incredibly proud of the mixes and masters I’ve been able to do in this little corner. I set up some gobos and tube traps I have in the closet when I’m getting deep into the mix and it’s all been working out as best as it can for the situation at hand.\nNS10’s have the cap mod. \n\nWhen I need to track my guitar amps I completely isolate them with long cables and treatment directly in my closet or I will close off the bathroom and treat them in there as well as capture the natural reflection in our bathroom. My wife and kids are so incredibly sensitive and generous to me during this time to even let me still be able to work and make this happen while the studio build is on hold and we’re having to make things work.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1164250775128645735",
    "author": "Nacho Sotelo",
    "date": "2023-10-18",
    "content": "They have a foam lining on the inside and they are snug enough to hold them in place",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1165360124689395847",
    "author": "Nomograph Mastering",
    "date": "2023-10-21",
    "content": "I would recommend removing the tweeter plates from the result 6 and losing the auralex foam pads",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1165375742343917599",
    "author": "conor // wbotm",
    "date": "2023-10-21",
    "content": "Have heard to lose the foam pads on here before but what's the why in it again? Not a stable/solid enough surface?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1165383431736279160",
    "author": "Tim O’Sullivan",
    "date": "2023-10-21",
    "content": "Those are the primacoustic ones at least haha. Mostly using them cause I had them, and to get a little extra height and to make space for the baby genelecs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167891156630241280",
    "author": "Nomograph Mastering",
    "date": "2023-10-28",
    "content": "Look for innovations like\n- midiverb\n- zero acoustic treatment\n- a little jar of desiccant inside the window to stop it fogging up\n- soundcraft spirit board",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167907122995003412",
    "author": "peterlabberton",
    "date": "2023-10-28",
    "content": "Sadly I have no pictures of my earliest setup. It was a crappy free Craigslist desk in a totally unfinished garage in Berkeley. Ran the length of the house, one car wide. I had tiny little m-audio speakers propped up on old textbooks, and I was so psyched when I got like four little 1’x1’ squares of auralex foam. Put one square each on the the wall to the left and right of me. Room = treated!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172191268084916335",
    "author": "Zack Hames",
    "date": "2023-11-09",
    "content": "Hey All, Question about studio doors:\n\nI desperately need to install some doors for *some* form of sound isolation. I know there's a lot more that goes into it than just doors, my room is literally concrete so the doors are by and large the weakest link.\n\nI have the ability to do double doors with an air gap. Does anyone have recommendations that aren't incredibly expensive for doors or types of doors i should use for this? I am planning exterior door so it's all sealed with weatherstripping and the Threshold, etc. \n\nAre basic exterior Fiberglass doors, if doubled with an airlock / gap, enough to be decent? I'd love to not spend thousands and thousands on doors.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190792820190093312",
    "author": "Gerhard Westphalen",
    "date": "2023-12-30",
    "content": "Keep in mind speakers can get damaged even if you don't see it. I shouldn't mention any specifics but I once had a speaker shipped with pretty decent packaging (double boxed, foam etc) which UPS managed to drop so hard the woofer's motor tore entirely off. It wasn't even some cheap stamped frame. High end pretty heavy duty (metal) frame. Yours might not get damaged to that extreme but could get cracked and have problems later on. Shipping speakers that are large enough to have real weight to them but not heavy enough that you need a pallet is risky business. Almost guaranteed to get tossed off a truck",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191954816142946355",
    "author": "hyanrarvey",
    "date": "2024-01-02",
    "content": "606 is not what I would call dead 60’s dead room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209909797256962161",
    "author": "Nomograph Mastering",
    "date": "2024-02-21",
    "content": "Overall looks beautiful and the daylight is a big win. The narrowness of the room will be a challenge (1st and 2nd room modes on the width will be pretty squirelly)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209911245243678720",
    "author": "esquinalee",
    "date": "2024-02-21",
    "content": "Thanks so much for this Ruairi!  I’m not sure of the width measurement just yet but hoping that’ll be manageable with some thick first reflection treatment.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211365238188802078",
    "author": "Zack Hames",
    "date": "2024-02-25",
    "content": "NGL the wood on his walls was partially my inspo. I was like “huh I don’t hate that. Let’s do it!” Better than the god damn water damaged styrofoam I was staring at",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1224425826729332860",
    "author": "kylem",
    "date": "2024-04-01",
    "content": "It’s fabric! Hiding some big limp mass absorbers behind. Front wall is drywall, then fabric, then plywood I stained coffee brown",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232403561954934896",
    "author": "Zack Hames",
    "date": "2024-04-23",
    "content": "Hey all;\n\nI am working on some membrane absorbers per a plan devised by @Gerhard Westphalen. I am trying to source some Acrylic/PMMA sheets, and I was wondering if anyone had some tricks as to where to look to get some that aren't insanely expensive. I will eventually bite the bullet if I have to but thought i'd see if anyone had any tips for finding this material for cheaper.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1235324675584688128",
    "author": "Deleted User",
    "date": "2024-05-01",
    "content": "Doing DIY acoustic treatment got me interested in Carpentry",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245787823349567538",
    "author": "Lee Rouse",
    "date": "2024-05-30",
    "content": "This was before I did proper bass trapping and added the cloud . Also had the room flipped 90°",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1245854135799251014",
    "author": "Lee Rouse",
    "date": "2024-05-30",
    "content": "I have listened a fair bit without it but didn’t measure without it yet since adding more bass trapping and rotating the room 90°",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246165732530720850",
    "author": "Lee Rouse",
    "date": "2024-05-31",
    "content": "I did try it like this before I got the extra bass trapping in but the only issue is there’s a window behind the left speaker that I’d probably need to temporarily close up or something for it to be truly bare back there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267365563554992160",
    "author": "EliHeathMusic",
    "date": "2024-07-28",
    "content": "Thanks everyone! Okay so they are 73\" by 33\" and 9\" deep and I double framed them with 1/2 inch plywood (interior structural frame that I stretched the fabric onto and an exterior trim frame with nicer looking wood). Cost roughly $215 per panel and I built them over about 3 afternoons.\n\nMaterials for two panels:\n(1) half inch 4 by 8 sheet of rough framing plywood (plus some extra scraps I had to complete the bracing)\n(1) half inch 4 by 8 sheet of nicer looking trim plywood\n(1) 6 foot long 1”x1” square dowel to brace corners\n(1) 8 foot 2 by 4 for the base \n(8) locking 2” caster wheels \n(2) bags of Rockwool safe n sound (47”x15.25”x3”)\n(1) can of Behr wood stain (I used a water based version in the “mission oak” color)\n(9) yards of fabric at least 40 inches wide (I had leftover Guilford of Maine Sona fabric in the cream color and did the backs with stuff I got at Joann Fabric \n(1) pack of 5/16 inch staples for fabric\n\n1”, 1.5” and 2.5” screws. I used about (120) of the 1” ones for most of the framing and trim pieces, (24) of the 1.5” to attach the trapazoid supports at the bottom and (12) 2.5” ones to attach the 2 by 4s to the panels",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267835069511503955",
    "author": "Chad Rodgers",
    "date": "2024-07-30",
    "content": "Would anyone be willing to lend a quick second opinion please on treatment for my home writing / production space please? I’ve had some recommendations from GIK, based upon measurements and pictures, but I figured it’d be wise to see what others have to say too. Thanks!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267838861665636426",
    "author": "masteredbyjack",
    "date": "2024-07-30",
    "content": "From my experience GIK will probably lead you down the wrong route -- probably need to post some pics here to let the braintrust weigh in (I'm not a person qualified to be giving advice, but it would have been a shame if I rolled with GIK instread of unf*ck knowing what I know now)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1268344968133607474",
    "author": "Zack Hames",
    "date": "2024-07-31",
    "content": "Anyone have some inexpensive/ quick and dirty ways to mellow out the sympathetic vibration of this ductwork? \n\nDoesn’t need to be permanent solution, just wanted to see if anyone had any slick easy solutions. I’m thinking of how to just put foam or something all over it",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1270069028282695761",
    "author": "Zack Hames",
    "date": "2024-08-05",
    "content": "I mean, I literally wrapped a blanket around and zip tied it to mine. \n\nYou could probably use the circular insulation stuff or foam",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278569911316385875",
    "author": "Zack Hames",
    "date": "2024-08-28",
    "content": "If you do big low end absorption in there, I’d say def give yourself the option for reflective surfaces alongside it. I think it would be sick to have a nice even low end room but with a lot of reflective surfaces on top.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280171694543208569",
    "author": "Johnny I",
    "date": "2024-09-02",
    "content": "One follow up on this...any benefit to a \"scatter plate diffuser\" on the face of the recording position cloud? Would this benefit the natural sound of the instruments/voice, while still providing the benefits of the cloud over the position? Or just go fully absorptive?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287551703889215510",
    "author": "Will Pragnell",
    "date": "2024-09-22",
    "content": "plus the wider desk was flirting with adding a reflection point in the flight path, i think (hard to be sure since I don't quite have my speaker / listening triangle figured out yet)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315133249135050854",
    "author": "Chase H",
    "date": "2024-12-07",
    "content": "They are membrane absorbers, that target a specific frequency.\n\nThere’s many people here knowledgeable about acoustics that can actually go in detail on how they work, I am not one of them though.\n\nYou can search the server as well for prior convos on it.\n\nHighly suggest you hire Gerhard to design a build for you if you’re working on one though, super Reasonable pricing and insanely helpful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315384763439386714",
    "author": "Nomograph Mastering",
    "date": "2024-12-08",
    "content": "The size of the box, the character of the vinyl (thickness etc), the size/depth of the box and the insulation position/density etc determine the frequency, Q, and damping of the absorber",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352062314278555670",
    "author": "Will Melones",
    "date": "2025-03-19",
    "content": "Wow, you have me thinking about acoustically and visually semi-transparent fabric. Backlit absorbers that look like windows would be a basement game changer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352084253231546550",
    "author": "Will Melones",
    "date": "2025-03-19",
    "content": "Yeah I’m thinking it would have to be twice as deep. Wonder how much silver spray paint would affect the porosity of rockwool.\n\nhttps://www.amazon.com/dp/B0CQNV9XNP\n\nI just put up these 4-foot shop lights, and they’re like weed garden bright. Could definitely use some diffusion.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374109838698876928",
    "author": "Zack Hames",
    "date": "2025-05-19",
    "content": "I've got some studio door questions!\n\n1. Is this foam stuff adequate for sealing or do I need to go with weatherstripping? My friend helping me build these said the weatherstripping was making things weird to get the doors lined up and close correctly; maybe something we can address.\n\n2. On the outside of the door, where there will be trim, are there any special actions I need to take to get as good of a seal and block as much sound as possible? I.E. Fill in any holes with wood or foam or what, then put up trim over it?\n\n-There will be two sets of doors at the end of this\n-My good buddy is young but talented at this stuff, so he's being very cool with doing weird stuff like this!",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1374325804049236049",
    "author": "Brian Reynolds",
    "date": "2025-05-20",
    "content": "Unless Im seeing this incorrectly.  It doesnt look like the door is square or level. So the weatherstipping and or getting to door to close flush, is always going to be a challenge.  Cedar shims and a gap area should of been used to level off the door before securing it. Nothing is ever perfectly square, the door, the wood, the ground. So you need allowances with doors. Youll never notice the corner of a wall meeting slighlty out of plum. But a door always shows it. You can see how the top of the door isn't running level from right to left with the image your finger is pointing at the hole. #2 You can add any expanding insulation foam, or clear caulk to fill those small slots. Once covered in trim though. I doubt much sound if any is going to make through the trim and through those small holes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382758672714698936",
    "author": "Bryan DiMaio",
    "date": "2025-06-12",
    "content": "iirc hard front wall is just \"don't take up space with absorbers since the SBIR you're trying to mitigate will be worse because of the distance you're adding\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385112091144359956",
    "author": "Eric Martin",
    "date": "2025-06-18",
    "content": "from being a dead room to an echo chamber, pretty quick, from nothing to drywall, FOREVER",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447365493316124754",
    "author": "Gerhard Westphalen",
    "date": "2025-12-07",
    "content": "I’ve never done framed membrane absorbers since getting that all airtight would be difficult. Especially with different tuning frequencies etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447365630381654166",
    "author": "Gerhard Westphalen",
    "date": "2025-12-07",
    "content": "So the way I design rooms is with standalone membrane absorbers and then the rest gets framed in front",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447365758551068862",
    "author": "Gerhard Westphalen",
    "date": "2025-12-07",
    "content": "I think Northward Acoustics might do the membrane absorbers in framing but I’m not sure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1451921471197937736",
    "author": "hyanrarvey",
    "date": "2025-12-20",
    "content": "I’d lay plywood down and slide the console down btw or long wide foam blocks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]