[
  {
    "id": "1222948481044320377",
    "author": "popaganda.",
    "date": "2024-03-28",
    "content": "I’m really loving the Stryfecta on the console sends",
    "reactions": 15,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1446191139198865448",
    "author": "Zack Hames",
    "date": "2025-12-04",
    "content": "Building the final panels for my @Gerhard Westphalen room before I move the console in!",
    "reactions": 15,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1286452259349200960",
    "author": "cian riordan",
    "date": "2024-09-19",
    "content": "Nothing speeds up a writing camp like half an old analog console.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1111412850477510787",
    "author": "cian riordan",
    "date": "2023-05-25",
    "content": "Yeah this place doesn’t suck. Cool console too.",
    "reactions": 13,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1184188633343864844",
    "author": "nachomaquieira",
    "date": "2023-12-12",
    "content": "Tracking drums+bass. Loving the SSL4000 preamps+eqs, and also using the obsidian, vari-mu and 11776's +some Neve 1064 preamp+ pultecs for the bass. Great rock sounds!",
    "reactions": 13,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1067590314627440801",
    "author": "Zack Hames",
    "date": "2023-01-24",
    "content": "New studio build in prog. Trident 24 console.",
    "reactions": 12,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "1264254802196430962",
    "author": "Eric Martin",
    "date": "2024-07-20",
    "content": "last listen in the old space and now I want to through away my $4000 desk",
    "reactions": 11,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "900404505118658570",
    "author": "bobby k",
    "date": "2021-10-20",
    "content": "new mixing desk i built after selling my output platform. noticeably better, plus feels good to get that money back (this cost me under $100).",
    "reactions": 9,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1021774470194671636",
    "author": "cian riordan",
    "date": "2022-09-20",
    "content": "Studio A for 2 days. Very sick recording room. Adobe brick makes for a really beefy room sound with no splatty high end. Pretty good players too. Neotek consoles aren’t my favorite, but it did the job. 9/10, would record here again. No Steve sightings unfortunately.",
    "reactions": 9,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1109903073809277069",
    "author": "chrissorem",
    "date": "2023-05-21",
    "content": "I heard that console was made by Scientologist and you must be level 4 to get the schematics",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086002311807123577",
    "author": "BatMeckley",
    "date": "2023-03-16",
    "content": "You clearly have put in many years so hopefully the measuring and the protractor gives you that extra push to get to where you’re hoping to go 🤍.\n\nJust trying to put context in here for the people that haven’t. None of the mixes in the mix off we had on the forum earlier hinged on the  single digit adjustments of the angle of the toe in of the speakers. It’s important to spend our times wisely on the things that matter most.\n\nVirtually every kid I know that started on a $4000 guitar is less of a player than the kid that started on a squire. There’s something to learning the skills and then upgrading the tools.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1458157670895849666",
    "author": "GaspardMurph",
    "date": "2026-01-06",
    "content": "No no I’m very happy here on the console cuck chair",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1458165050031341805",
    "author": "cian riordan",
    "date": "2026-01-06",
    "content": "You mean compared to trying to support your 40 year old analog console yourself in your basement with a bunch of nerds on a discord forum? I'll bet.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982709586026962984",
    "author": "peterlabberton",
    "date": "2022-06-04",
    "content": "So far I’m using the S1 to:\n\na) have hands on control when mixing drums, as I’ve got a handful of parallel compression and distortion auxes. I’ve made it work with a keyboard and mouse, but being able to have one hand on an audio track fader and the other on the return of a parallel effect is great.\n\nb) setup VCAs for my whole mix and, once I’ve got things in a good spot, close all the pro tools windows so I’m more focused on just listening, and play the mix back and write automation.\n\nThese are both just things I’ve missed about working on a console, and I’m glad to be able to reincorporate them into my workflow.\n\nAnd to put the EQ on, I sent my main PT output to a virtual output, and have the EQ on there in Console, assigned to the monitors.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137032344579100791",
    "author": "Deleted User",
    "date": "2023-08-04",
    "content": "Sharkbite in Oakland yesterday DaKing console is very fun to work on 🎚️🎚️🎚️",
    "reactions": 6,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1195495192019619890",
    "author": "nachomaquieira",
    "date": "2024-01-12",
    "content": "Trying out the new chain a bit, I'm using the Fusion with a vari-mu based on a modified Altec 436 inserted for adding some color when needed. At the end, there's a Stam Audio unit based on the SSL4000, and so far, I'm satisfied. I was considering selling the vari-mu and getting an EQ to see if I can have more working options.",
    "reactions": 6,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1256022477843464233",
    "author": "cian riordan",
    "date": "2024-06-27",
    "content": "Damn, these mics are awesome. I think I’m going to buy the snare and Tom ones. So much rejection but incredible sound just flat into the console.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1413932001102397460",
    "author": "hyanrarvey",
    "date": "2025-09-06",
    "content": "Atc’s behind the console on the lil robot stands",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1428215374880440320",
    "author": "cian riordan",
    "date": "2025-10-15",
    "content": "I wish there was a Zillow for consoles so we could see what they sold for and when.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061168741473325076",
    "author": "cian riordan",
    "date": "2023-01-06",
    "content": "Side screen was the bane of my console existence.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168260030966026371",
    "author": "Gerhard Westphalen",
    "date": "2023-10-29",
    "content": "This was my first setup in 2010. All based around the Clavinova. I wanted one since I was 6 or so and then my parents parent promised to get it once I finished a certain level of the royal conservatory. Managed to record into it and then get that off into a computer. Eventually got a laptop and interface. Was a Presonus firewire one and my laptop wasn't happy with that. I remember many months of getting PCMCIA cards to try to et it to work without dropouts but never did and eventually got a computer from Rain Computers (anyone remember them?) with an old RME PCI interface",
    "reactions": 4,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1181435274018963487",
    "author": "Nomograph Mastering",
    "date": "2023-12-04",
    "content": "I’ve heard those vintage consoles sound great but often have issues where certain channels don’t get recorded",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428856786705842347",
    "author": "cian riordan",
    "date": "2025-10-17",
    "content": "I had it this way with the UTA console. Could build up a mix on the desk then just right click and commit all the console channels and it’s all in the box",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1451657040484372530",
    "author": "cian riordan",
    "date": "2025-12-19",
    "content": "My advice for moving consoles would be pull all the channels and any backplane boards if you can. Take the legs off or separate the top frame from bottom. Wrap the empty top frame in packing blankets if you can. And just get more guys than you think you need and do it very slow.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457499989659095111",
    "author": "Ross Fortune",
    "date": "2026-01-04",
    "content": "Gonna have to get rid of that console if you want to address the desk reflections though",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1233629153702445106",
    "author": "youngteam",
    "date": "2024-04-26",
    "content": "How are you liking the chroma console / what duties ya got it runnin?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1286454744574988309",
    "author": "peterlabberton",
    "date": "2024-09-19",
    "content": "Put this together with @Chad Rodgers’s rig above and you’ve got yerself a whole ass console!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1286455850642444309",
    "author": "cian riordan",
    "date": "2024-09-19",
    "content": "I mean of course... that's the reasonable way to use it! Like you're going to be stemming things out onto a console during a writing session. But don't get me wrong -- in a world where I'm doing ANY kind of recording, I will always opt for a console over not having one.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428801854116204706",
    "author": "Tim O’Sullivan",
    "date": "2025-10-17",
    "content": "Hell yes. Makes me happy to see more consoles getting installed! Congrats",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109886841051684914",
    "author": "BatMeckley",
    "date": "2023-05-21",
    "content": "Omg if that’s the console from OceanWay B I cut so many records on that thing. Such a bizarre yet beautiful sounding piece of kit. Radiohead loved it so much they took it with em when they were done 😂.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161886692844781670",
    "author": "Rollmottle",
    "date": "2023-10-11",
    "content": "https://reverb.com/item/63177246-opamp-labs-12-channel-custom-recording-console-white-red",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1162171148059021403",
    "author": "James Redfern",
    "date": "2023-10-12",
    "content": "Those faders remind me of those old Langevin consoles lol",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1165349679794503690",
    "author": "Tim O’Sullivan",
    "date": "2023-10-21",
    "content": "New Mac Studio equals new monitor and no more staring at a tiny laptop screen. Tried to get it out of the way of the glass and the speakers as much as possible, but tricky with how tall my console is.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1233672435631390731",
    "author": "herbie",
    "date": "2024-04-26",
    "content": "i have the chroma console on my board and the character & texture section alone is sooo worth it on it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256662064911614002",
    "author": "cian riordan",
    "date": "2024-06-29",
    "content": "Also just a disclaimer to all of that -- I'm pretty sure I could wire a copper frying pan into that console and it would come out sounding good.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428763054174109750",
    "author": "chrissorem",
    "date": "2025-10-17",
    "content": "I was an inch away from buying a 4000 last year.  Nothing beats the real deal and having it in front of you and mixing with your screen off. I hope you have the best mixes to come ahead of you!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428764800695144549",
    "author": "Zack Hames",
    "date": "2025-10-17",
    "content": "That's badass. They really are workhorses and when you actually get your hands on one it's easy to understand why they were so popular. They're so flexible and easy to use and they sound good. Super intuitive console.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1451724529532403733",
    "author": "Slow Hand",
    "date": "2025-12-19",
    "content": "👆What Chris said. Just grease up that console and the doorway and then let it slide, bebe.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452425948380266678",
    "author": "Kian",
    "date": "2025-12-21",
    "content": "He’s training us offshore to carry consoles down flights of stairs",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1458900461972361286",
    "author": "Zack Hames",
    "date": "2026-01-08",
    "content": "Thank you!!\n\nI will say - I got a good deal on this relative to a typical console buying experience. 30k for a console that I had spent two years using already, was fully functional (as fully functional as any vintage console) and it came with all the wiring and snakes and DL’s, and spare parts. And a local sale. \n\nI’m not sure I would’ve gone this route if it was more risky.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "847982526026481675",
    "author": "Zack Hames",
    "date": "2021-05-28",
    "content": "Trident 90 - really great, flexible 4 band EQ, good clean preamps. I used UTA, great river, summit, and amek pres for all this stuff though. Wanted transformer and tube as much as I could.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047375097792561222",
    "author": "cian riordan",
    "date": "2022-11-29",
    "content": "Full setup:\nKick Bat: Sony ECM50\nKick Out 1: 47fet\nKick Out 2: Audix DX\nSnr: 441\nToms: U87s\nOH Mono: U47\nOHs: U67\nRMs: RCA 44s\n\nAll going through the Neve 34128’s. It’s really just a trial run for the new console but was fun to do an all-out splurge with the nice microphones. Nothing making up for my shitty playing tho 😛",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101619721834594405",
    "author": "Tim O’Sullivan",
    "date": "2023-04-28",
    "content": "I love it. I don’t mix on it, and I use an Audient Nero for center section shit. But nice to have a fader to grab, and some utility eq’s. I mostly use my outboard pre’s and those all have little labs attenuators before the console so I have a ton of control over the headroom. I also use it to buss stuff down like kick mics and guitar amps to keep track counts down.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181352302792167444",
    "author": "lystell",
    "date": "2023-12-04",
    "content": "I’m having a hard time deciding of which side of the console I wanna be. Looks like ton of fun either way.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181436284447768688",
    "author": "Rollmottle",
    "date": "2023-12-04",
    "content": "\"ahh, sorry bro...this console's so old, the channel the snare mic you wanted must've been out.\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428191946903654540",
    "author": "Zack Hames",
    "date": "2025-10-15",
    "content": "Details: \n40 channels\nTransformer Preamps (82E01)\nE series Brown EQ’s\n6k so it has the ABC bussing\nHas the updated Atomic PSU\n\nAllegedly this console was from NBC Burbank and was used to mix Days Of Our Lives and Fresh Prince Of Bel-air.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428431042859241613",
    "author": "Zack Hames",
    "date": "2025-10-16",
    "content": "I feel very handcuffed and slowed down when I go from console to computer during tracking especially",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428762032186064956",
    "author": "Zack Hames",
    "date": "2025-10-17",
    "content": "Real talk, I DID NOT like SSL plugins of any kind until I used this console and heard what it can actually do. I still think the hardware absolutely crushes every plugin version (I really can't describe why either, it's just better) BUT having the perspective of the hardware experience allows me to use the plugins and chase what i know I want it to do much much easier.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428817322516414504",
    "author": "onanisland",
    "date": "2025-10-17",
    "content": "This massive 5 meters x 4 cloud was designed for a console which never happend 😂",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1452154031119142912",
    "author": "Mike Tierney",
    "date": "2025-12-20",
    "content": "I would also say, mover-movers and piano movers both know HOW to move big stuff better than your 8 strongest friends. I’ve moved a few consoles and oftentimes it’s not the strongest lot of people as much as it’s the people that have maneuvered big awkward shit around corners every day for the past ten years. I would still lean heavily in favor of hiring professionals over finding Matt Rad sized friends",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457506425344364862",
    "author": "cian riordan",
    "date": "2026-01-04",
    "content": "Just stash em behind hte console up aginst the back wall",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457513695931273369",
    "author": "cian riordan",
    "date": "2026-01-04",
    "content": "I doubt it on something like an SSL. On the old shitty OpAmp consoles, I could definitely see the plug-in amps transformers falling out the bottom.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982702198926508062",
    "author": "peterlabberton",
    "date": "2022-06-04",
    "content": "This is the kind of nerdy tweaky shit I think this discord will appreciate: got my lil S1 control surface a few days ago, and used setting it up as an excuse to also play around with the arrangement of my tiny desk, and add some EQ to my monitors.\n\nTried the S1 behind my keyboard (too deep and potential for more reflections), and off to my left (weird neck craning all day), and landed here for now. Then busted out a mirror and angled my desk to avoid any reflections from the monitors at the listening position. Shot the room again and popped this EQ on the output in UAD Console (it’s finally good for something!!), and am very pleased with the new arrangement. 🎉\n\nRuairi might have a fit with this EQ curve, but I’m ABing it in and out and it’s definitely helpful, until I get my act together and build some membranes!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "989990198299467786",
    "author": "Calvin Lauber",
    "date": "2022-06-24",
    "content": "Memphis Magnetic, super badass Sphere console that’s in great shape. They have a nice collection of AEA and RCA ribbon mics. Always appreciate tracking up here 🙂",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1053687054015402076",
    "author": "hyanrarvey",
    "date": "2022-12-17",
    "content": "Might put the amphions in the ssl room, but were also looking to sell both consoles",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054488956688941076",
    "author": "NoahNeedleman",
    "date": "2022-12-19",
    "content": "Speaking of consoles. Anyone hip to Otari?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1061375274287120544",
    "author": "Zack Hames",
    "date": "2023-01-07",
    "content": "I’ve never liked how bedrooms sound for this reason (not to mention all the other reasons) but I’ve never not had a rug at an at home situation. Maybe because I share recording and mixing in the same space - maybe it wouldn’t be so bad. All the good studios I’ve worked at have just been hard floors but also big ass consoles.\n\nHmm. Worth experimenting with. Thanks everyone.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067590570966536343",
    "author": "Zack Hames",
    "date": "2023-01-24",
    "content": "Made some decisions about machine room/racks today, putting the floor and then the console in soon!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067619545252110377",
    "author": "David Fuller",
    "date": "2023-01-24",
    "content": "He went with the Trident after all that?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067633465601826937",
    "author": "Zack Hames",
    "date": "2023-01-24",
    "content": "We already *have* the trident, is a big part of it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067639475385147402",
    "author": "Zack Hames",
    "date": "2023-01-24",
    "content": "Yes actually. To replace our studio A console (trident 90)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090353281819226222",
    "author": "Zack Hames",
    "date": "2023-03-28",
    "content": "Been listening and working in this room today for the first time since 2014; honestly sounds pretty amazing. Idk about perfect but it’s definitely a great room and the speakers aren’t bad. Lots of nice things about them, very immersive. Only thing is the monitoring is going through a Neve 8816 Summing Mixer as the monitor controller and I’m not convinced it’s super clean/transparent.",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1094414833149018173",
    "author": "Zack Hames",
    "date": "2023-04-08",
    "content": "Hahah maybe someday man fr. This trident is def not on that level but it’s also just sitting here. We will see what happens. We just need the room up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101618037876076645",
    "author": "Eric Martin",
    "date": "2023-04-28",
    "content": "I had one of those soundcraft ghosts at one point for a hot minute",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106683746553446501",
    "author": "cian riordan",
    "date": "2023-05-12",
    "content": "If you're buying, I would absolutely work with some engineers to replace that post with a beam to support whats above it. That'll free you up in the room to do whats necessary to make it sound good. Working around that fucking pole will drive you MAD. There's a friend that built out an insane Atmos studio here in town, UTA console, Meyer Bluehorns -- but there's a post like that just in the middle right by the listening position and it is such a bummer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129458448992583820",
    "author": "Deleted User",
    "date": "2023-07-14",
    "content": "That’s also very cool. It’s kind of like those plastic sliding thing people put on the fader area of studios with consoles",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136684868915433512",
    "author": "cian riordan",
    "date": "2023-08-03",
    "content": "You right! Looks like it was mixed at OW then some stems run though his console and C2 at home. Still, they spent 4 weeks mixing in B.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141848429337780364",
    "author": "Iwan Morgan",
    "date": "2023-08-17",
    "content": "I dig it all, but especially the stereo lighting. PS what’s the small console to the side?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151558052512792666",
    "author": "Josh",
    "date": "2023-09-13",
    "content": "But I’m excited to check out the consoles because we didn’t have those back home.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161917590789169212",
    "author": "BatMeckley",
    "date": "2023-10-11",
    "content": "They should have had you stand next to it in the reverb listing so the console looked bigger and more impressive.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167891156630241280",
    "author": "Nomograph Mastering",
    "date": "2023-10-28",
    "content": "Look for innovations like\n- midiverb\n- zero acoustic treatment\n- a little jar of desiccant inside the window to stop it fogging up\n- soundcraft spirit board",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180915019760803880",
    "author": "montrose recording",
    "date": "2023-12-03",
    "content": "the ohio players console from paragon recording",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180917018694795458",
    "author": "hyanrarvey",
    "date": "2023-12-03",
    "content": "So it goes 1. Mic lines /\n2. More mic lines\n3. Out board gear\n4. More outboard \n5. Interface outs\n6. Console line ins\n7. Mic/line switch outputs\n8.equalizer inputs \n9. Console insert send / returns\n10. Direct outs\n11.interface IN \n12 blank\n13 blank \n14. Console center section\n15. Aux sends",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181388662999625809",
    "author": "NoahNeedleman",
    "date": "2023-12-04",
    "content": "There was a time when I would’ve only wanted to be on the other side of that glass. Then when I would’ve enjoyed both. When I saw that pic I only thought about the merits or demerits of working on a console as a producer/engineer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181436155951059077",
    "author": "cian riordan",
    "date": "2023-12-04",
    "content": "And you can push the channels more musically on a neve… the tridents fall apart a little sooner",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181436475431202857",
    "author": "Nomograph Mastering",
    "date": "2023-12-04",
    "content": "Console dropped out the extra 4 bars in the bridge too, and spliced it together. Crazy old thing!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182050945044054157",
    "author": "montrose recording",
    "date": "2023-12-06",
    "content": "console goes below it.  inspired by both lack of space and old school control rooms where the outboard was up high.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1192258878935678986",
    "author": "cian riordan",
    "date": "2024-01-03",
    "content": "All going into the lovely 8028 at East West studio 2",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1192281627297071155",
    "author": "cian riordan",
    "date": "2024-01-03",
    "content": "Zero compression. I might light up an auxillary mic with console distortion, but when it's film score stuff I tend to be pretty conservative as it's going to go through more channel than I'm used to (read: I'm not mixing).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1192281696192704513",
    "author": "cian riordan",
    "date": "2024-01-03",
    "content": "I'll monitor with some compression on the console to make sure things aren't boring",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1192303672378523649",
    "author": "cian riordan",
    "date": "2024-01-03",
    "content": "This was my 44s into LA3as with no GR, just diming the outputs into the line inputs of an MCi console",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237106502343593984",
    "author": "sethmanchester",
    "date": "2024-05-06",
    "content": "It’s Jim Eno’s console… really beautiful mashup",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256710544476606565",
    "author": "montrose recording",
    "date": "2024-06-29",
    "content": "or “Unlike the filters in your DAW or console, these settings affect Snare Mic’s entire sonic spectrum. “",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256713426403594320",
    "author": "hyanrarvey",
    "date": "2024-06-29",
    "content": "DUDE LITERALLY OR EVERYONES CLIPPING THRU A CONSOLE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1309621334958936144",
    "author": "SoundsLikeJoe",
    "date": "2024-11-22",
    "content": "I can't say enough good things about A32 tbh.  The converters are VERY good with no discernable difference between A32 and the RME UFX+  ...  but it's my mixer bridge more than modular.  The modular routes to an old Apogee, and can then MADI into the mixer (if you wanted to get real tweaky with EQ or use compressors).  \n\nAs far as levels go...    the A32 does something I had no experienced with other converters, and I love it.  You can adjust the sensitivy of the analog input...  Here's a better explanation from the manual\n\n> The analog inputs of the A32 DANTE can each be set to different\n> sensitivities. You can choose between three reference levels: +4dBu,\n> +13dBu and +20dBu. Using the DSP, you can additionally set the\n> reference levels from -8dBu to +20dBu in 1 dB steps. The DSP always\n> calculates the optimum configuration. For example, if you set +12dBu,\n> the analog reference will be set to +13dBu and the signal will be\n> attenuated by 1dB.\n\nThat would work magic with eurorack levels.  I use it sometimes so that I can overdrive the Trident and keep the channel direct outputs under the limiter's clipping stage. Helps when you want to be abusive in analgo but not worry about converters clipping.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1309706873691308042",
    "author": "popaganda.",
    "date": "2024-11-22",
    "content": "I need to open it up and do a deep clean/maybe replace some things. But I know it’s not the right console long term, so thinking about figuring out how to upgrade instead of pouring energy into it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428177322036695124",
    "author": "Zack Hames",
    "date": "2025-10-15",
    "content": "Honestly for a console these are not that hard to tech.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428802532536225792",
    "author": "thegreatcarsoni",
    "date": "2025-10-17",
    "content": "Dammit guys you’re making these consoles sound too good, I can feel the itch already",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1451642433099268168",
    "author": "Zack Hames",
    "date": "2025-12-19",
    "content": "So, I will be needing to move my SSL 40 channel E series console down these stairs. \n\nPrevious owner said to get a moving company to move it down the stairs - I think that’s the move, but wanted to inquire here with what anyone else has done in this scenario, or any other tips.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1451921471197937736",
    "author": "hyanrarvey",
    "date": "2025-12-20",
    "content": "I’d lay plywood down and slide the console down btw or long wide foam blocks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452072347774357667",
    "author": "Zack Hames",
    "date": "2025-12-20",
    "content": "Consoles 9’ long\nIt’ll fit through the door; it’s under 32” without the legs",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1452089411679289434",
    "author": "BatMeckley",
    "date": "2025-12-20",
    "content": "Also saving a couple bucks on movers to safely transport what once was a console worth well into the 6 figure range seems short sighted",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457505667681357868",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "Yeah I haven’t ran the DL snakes yet, I have to address a +18 volt issue the console isn’t seeing. I’ll fix that tonight and then start running everything. \n\nIt is not super convenient having the patchbay on the right and the interfaces and outboard on the left; but the right side there’s a door that goes to a booth, right where I’d want stuff. \n\nI *may* put the interfaces on the right side in the corner. We will see",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457507921930883196",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "I’m not sure what I’m gonna do long term. I like them on the meter bridge, at least in the old studio, because they’re closer to my ears that way. In the old studio I experimented having them on stands behind the desk but it put the speakers weirdly far and that room didn’t carry the sound well. \n\nI may do cinder block stands behind the console if I like how they sound in that position then I can put my ns10’s on the meter bridge stands",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457509757639459027",
    "author": "cian riordan",
    "date": "2026-01-04",
    "content": "When you're done hemhoragging money on your install, I'd suggest sound anchors to hold the speakers. They will give you more flexibility over cinder blocks, allow you to lever the speakers over the console if you like, and will decouple them from the desk so you're not feeling the low end through your fingers/hands.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457510190160154786",
    "author": "cian riordan",
    "date": "2026-01-04",
    "content": "Also something I'll often do on large consoles when I'm in bigger studios, I'll just drag the NS-10s to the left side of the console while I'm getting drum sounds (CH1 = Kick, Ch2 = SNR, etc). I find myself making the most critical phase/EQ decisions there to begin with, might as well have a separate little sweetspot for it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457511160344608850",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "I’m glad to hear the sound anchors will do that - that was my long term goal in my mind because, like you said, you can put them OVER the console a bit. And it’ll be worth it. \n\nThanks for the suggestions dude - I’ve got a lot to learn and figure out. I’ll take all the help I can get.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457512851844497432",
    "author": "BatMeckley",
    "date": "2026-01-04",
    "content": "Never thought about this: does having big ass speakers on the meter bridge hurt the lifespan of the console because of the vibrations through the direct coupling? Are we slowly detaching ic’s?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457588554442997760",
    "author": "Nomograph Mastering",
    "date": "2026-01-04",
    "content": "But if I was to suspect something being faulty after a move it would be console first and Atomic second",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457588848673554664",
    "author": "Nomograph Mastering",
    "date": "2026-01-04",
    "content": "Does your console\nHave a power switch per bucket?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457606963264356465",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "This happened one day before the move unfortunately. We were sort of hoping the move would “fix” it, thinking it was some sort of weird thing that physically happened when cleaning up around the console",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457607210283700349",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "And what’s weird, is the previous owner just turned it on one day, and a bunch of the “cut” lights were on, and wouldn’t turn off. Then he noticed that the +18 volt light wasn’t on at the top of the console:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457607636383174811",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "We looked around in the console and couldn’t find anything amiss that was obvious from where the power goes in",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457607741244833802",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "again, certainly could be anywhere in the console that something is wrong",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457908743072387172",
    "author": "Nomograph Mastering",
    "date": "2026-01-05",
    "content": "Can you bring up a bucket at a time and isolate the issue in the  console",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]