[
  {
    "id": "1361548600299094147",
    "author": "cian riordan",
    "date": "2025-04-14",
    "content": "Glutinous double drum setup with captain @oaklandmatt today.",
    "reactions": 31,
    "attachments": 5,
    "is_pinned": false
  },
  {
    "id": "1377683291695612054",
    "author": "LAPhill",
    "date": "2025-05-29",
    "content": "Shout out to @Tim O’Sullivan for not only finally solving my hum issues, but dialing in the workflow in my room to a whole other level. He wired up all my pedals, synths, and preamps to a couple of patch bays so I can throw signal all around the room in any order (complete with right-angle cables so I can use them with the desk doors closed). He also built MIDI lines to send clock from my DAW to the pedals and we upgraded the room to Mio MIDI-over-Ethernet units. Several other creature comforts that allow me to think less, like routing a headphone connection underneath the right side of my desk instead of the left where my interface is, adding a second one by the piano, and ready-to-go cables for guitars, synths and microphones already plugged in where they need to be.\n\nI'm going to run out of reasons not to call this studio \"done\" soon.",
    "reactions": 31,
    "attachments": 5,
    "is_pinned": false
  },
  {
    "id": "1383688771161161748",
    "author": "herbie",
    "date": "2025-06-14",
    "content": "it was an arduous journey hanging these curtains up but they did the job perfectly! PRO TIP: do NOT use the given anchors they give you, they’re horrible. i used qualihome drywall anchors from home depot i found lying around from a previous mirror hanging job. \n\nthanks so much to @jordanmcleod_io for helping me out and @thegreatcarsoni & @Zakhiggins for the suggestions!! it’s honestly insane how open it makes the room feel. next up is a lamp shade to cover the right floor lamp so it won’t blind me anymore :kek:",
    "reactions": 20,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1294096946465738863",
    "author": "chrissorem",
    "date": "2024-10-10",
    "content": "New mini drum kit in the house. This thing is so rad",
    "reactions": 19,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1410863383938465832",
    "author": "Skyler Young",
    "date": "2025-08-28",
    "content": "Got to sample 10 synths at a time today 🥹",
    "reactions": 19,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1215754954900504637",
    "author": "NoahNeedleman",
    "date": "2024-03-08",
    "content": "Get you a friend who roasts his own coffee and chats about all the things you care about with you. (Photo: @sethearnest telling me how to fix my shitty snare.)",
    "reactions": 18,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1243756408584015872",
    "author": "chrissorem",
    "date": "2024-05-24",
    "content": "Reporting back with the best yet use of my Adam’s.  I was struggling with a very poky and transient heavy  acoustic guitar. I tried a bunch of shit that left me feeling unsatisfied. Finally I tried re-amping the  acoustics through the  Adam’s and the 44 went into a dbx 160 into the ATR 102. Moving onward",
    "reactions": 17,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1354844536492523520",
    "author": "Adam Thein",
    "date": "2025-03-27",
    "content": "Final form (for now) for an upcoming tour keyboard rig",
    "reactions": 17,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "808469914457341984",
    "author": "Eric Martin",
    "date": "2021-02-08",
    "content": "got my basement setup, tracking guitars today",
    "reactions": 16,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1152281619319758900",
    "author": "tomtom",
    "date": "2023-09-15",
    "content": "Cut guitars w the Jedi master himself yesterday… 👂 👂 👂",
    "reactions": 15,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1216207082311778304",
    "author": "James Redfern",
    "date": "2024-03-09",
    "content": "Had fun tracking piano today. 1958 Yamaha U3. Stereo Coles 4038’s, EV635a and a Copperphone down below, PZM room mic on the floor",
    "reactions": 15,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1221969041023959211",
    "author": "peterlabberton",
    "date": "2024-03-25",
    "content": "Tracked drums at the new/temporary spot for the first time over the weekend. Kinda hilarious setup—no kick (adding live drums to dense programmed tracks, so just went with the sampled kicks to avoid shoes in the dryer world), and short a pair of good mics for overheads so did mid side. Actually came out pretty great, and absolutely blew up the snare mic in parallel through my Moog on a track for super distorted huge-ness. 🤘🏻",
    "reactions": 15,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1332012952676728974",
    "author": "bobby k",
    "date": "2025-01-23",
    "content": "Have a Frankenstein kit of different pieces that play well together. Kind of accumulated through Craigslist over the years. Decided to strip it down and stain it all to match my sugar percussion snare. Very happy with the results! (Last photo is the best “before” photo I could find)",
    "reactions": 15,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "1286452259349200960",
    "author": "cian riordan",
    "date": "2024-09-19",
    "content": "Nothing speeds up a writing camp like half an old analog console.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350285821365715054",
    "author": "peterlabberton",
    "date": "2025-03-14",
    "content": "Studio (/house/adu) build update. Walls partly framed, the thing is coming together! Second photo shows the small living room on the left and the studio on the right. Gonna have a little upright piano in the living room and tielines between the rooms. Third photo is looking into the studio. Psyched. Simultaneously feels like it’s coming along super quick, and also now that I can really see it I’m getting really impatient to have it all done.",
    "reactions": 14,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1068682849525440563",
    "author": "Barbara",
    "date": "2023-01-27",
    "content": "Though I'd just share this here: the first mic I've ever held and set up in my life (and I was scared as hell the first time it was handed to me at a microphones' class). \n\nI find it beautiful and today I got to use it, on a session, recording a Fazioli grand piano. \n\nI've used this one right here a few times since that class, but today I just got really nostalgic about it! 🥲",
    "reactions": 12,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1086210634116497429",
    "author": "BatMeckley",
    "date": "2023-03-17",
    "content": "I had the great Nels Cline from Wilco hike his guitar AND amp up 60 plus steps to play guitar in my apartment on a record that wasn’t going to be nearly as big as anything else he does. \n\nThe whole time he couldn’t have been more stoked to do it. Made it feel like we were doing him a favor to let him play on the record. I think a lot of the time talent and stoke go hand in hand. Their joy for the instrument gave them the drive to be good at it and the love for the process ensured they were eminently hireable.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095808042047635576",
    "author": "NoahNeedleman",
    "date": "2023-04-12",
    "content": "Starting a little blues project with a buddy, decided we were gonna start with the songs he’s been playing his whole life. Had @BatMeckley’s voice in my head talking about using polar patterns to minimize phase issues. \n017 on vocal, m160 on guitar, 960s in x/y up high. Minimal phase issues, can go hifi or oldfi and both sound convincing.",
    "reactions": 10,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1179557728365068428",
    "author": "cian riordan",
    "date": "2023-11-29",
    "content": "Follow up to #trackpad-talk… I finally got the little thing to join the keyboard and Magic Trackpad… it works really well and feels really solid. It’s actually nice to have the trackball as well… sometimes I find detailed mouse editing moves are quicker on the ball than with the slight lag on the Bluetooth trackpad.",
    "reactions": 10,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1267788842606530610",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-07-30",
    "content": "Me & my bandmate have really been enjoying this tiny songwriting airbnb setup\n\nSm7dB with the MVX2U plug-in interface, Loog mini electric (kid guitar really, but works great for our purposes) with a iRig Pro HD 2 interface velcro’d to the back lol",
    "reactions": 10,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1164757800149323836",
    "author": "Eric Martin",
    "date": "2023-10-19",
    "content": "my piano tracking room for the next two weeks",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1214608596474794004",
    "author": "BatMeckley",
    "date": "2024-03-05",
    "content": "I think the whole “same DI from pro tools” strategy for things like microphones and amps is really overrated and misses the point about how humans make music.  I’ve long said re-amping is good only as an effect, because how an amp responds will change how a player plays. \n\nFor that same reason, I like just doing a couple of takes for each mic with the singer. Sure they might sing differently… but isn’t that part of the point? I’m interested in which microphone brings out the best in the singer and is inspiring to use. If I want specs I can look at a frequency plot.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1024775104837730445",
    "author": "ehutton21",
    "date": "2022-09-28",
    "content": "So, to update this: spent most of my time being a runner and doing runner things. We had an issue with an inadequate scented candle, so to target we went. Had to find a nice vegan friendly restaurant open at 11:30 PM which was a fun task. The engineer who ran the session is one of the few I’m chill with, so he very briefly introduced me to swizz as “Evan, the runner who makes some dope synth pop” (alicia was warming up, but swizz was real down to earth and nice. very focused) and i actually got to catch a couple glimpses of what they were doing in the studio when I wasn’t calling restaurants and polling my vegan friends for food recs. We actually spent more time communicating with engineers out East to get files fixed and communicating with a personal assistant of some kind who stopped by before to make sure things were going smoothly. \n\nAll that to say what little I did actually see was sick. Swizz goes crazyyyy on an MPC, man. Wow. That was fun to hear.\n\nAlso @cian riordan was right. I’ve never heard our nearfields work that hard like ever. It was belligerently loud. Fletcher-Munson be damned lmao. I’m sure they fired up the bigger shit when I left (unfortunately running does not pay the bills, or anyone really).",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086002311807123577",
    "author": "BatMeckley",
    "date": "2023-03-16",
    "content": "You clearly have put in many years so hopefully the measuring and the protractor gives you that extra push to get to where you’re hoping to go 🤍.\n\nJust trying to put context in here for the people that haven’t. None of the mixes in the mix off we had on the forum earlier hinged on the  single digit adjustments of the angle of the toe in of the speakers. It’s important to spend our times wisely on the things that matter most.\n\nVirtually every kid I know that started on a $4000 guitar is less of a player than the kid that started on a squire. There’s something to learning the skills and then upgrading the tools.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094300186043486305",
    "author": "LAPhill",
    "date": "2023-04-08",
    "content": "Are these the same friends that stuff girlfriends in kick drums?",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376250012027322388",
    "author": "chrissorem",
    "date": "2025-05-25",
    "content": "Looks great, one helpful tip. Try turning that keyboard 90 degrees. Let me know",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1381446825739026492",
    "author": "Nick Stetina",
    "date": "2025-06-08",
    "content": "Not a typical #show-your-setup share, but I’m finally on the other side of this outdoor speaker set up. Floating custom mounts that are invisible from the head of the table, which is both listening position and where I try to eat every meal when it’s nice out here in Chicagoland. Kind of crazy how good these OSD 8\" Outdoor speakers sound with a cheap Fosi amp off Amazon. A kid is definitely gonna run into these someday cause they’re mounted so low, but for every other temperate day of the year I’m gonna be having a good time.",
    "reactions": 8,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "982709586026962984",
    "author": "peterlabberton",
    "date": "2022-06-04",
    "content": "So far I’m using the S1 to:\n\na) have hands on control when mixing drums, as I’ve got a handful of parallel compression and distortion auxes. I’ve made it work with a keyboard and mouse, but being able to have one hand on an audio track fader and the other on the return of a parallel effect is great.\n\nb) setup VCAs for my whole mix and, once I’ve got things in a good spot, close all the pro tools windows so I’m more focused on just listening, and play the mix back and write automation.\n\nThese are both just things I’ve missed about working on a console, and I’m glad to be able to reincorporate them into my workflow.\n\nAnd to put the EQ on, I sent my main PT output to a virtual output, and have the EQ on there in Console, assigned to the monitors.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1046249094970085586",
    "author": "itaylerner",
    "date": "2022-11-26",
    "content": "I’ve heard this preamp is super transparent 🤓",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1055549085907685407",
    "author": "cian riordan",
    "date": "2022-12-22",
    "content": "Prolly gonna just use the kemper then, looks like",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164564503657185320",
    "author": "Ross Fortune",
    "date": "2023-10-19",
    "content": "Note rear speakers ziptied to speaker stands ziptied to synth racks, just like the pros.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1439872465882058822",
    "author": "Paris / Blue Butler Studios",
    "date": "2025-11-16",
    "content": "Jazz trio today (no headphones) trying some new things, really liking my schoeps mk41’s on snare.\n\nAlso found a new sweet spot for piano with the R44’s super close where the strings are pegged to the soundboard away from the hammers",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "843603300157751297",
    "author": "Ian",
    "date": "2021-05-16",
    "content": "Finally built a shelf for my midi keyboard and now it's officially done 🙂 at least till I get hardware synths",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1036814457566937129",
    "author": "peterlabberton",
    "date": "2022-10-31",
    "content": "Tracking toms today, just set these suckers up right by my mix position so I didn’t have to share a screen/run across the room all day. Chandler mic multed to my Moog Grandmother, getting distorted there, and then that gets multed and sent to a delay pedal with spring reverb, all recorded separate. And the stereo ribbons in for some extra space. Always fun to make the most out of repurposing the gear I have while tracking drums! (Or tracking whatever else!)",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1079437271792619540",
    "author": "BatMeckley",
    "date": "2023-02-26",
    "content": "I would agree with this, for the same reason that I (and phil x, van halen, a ton of other guitarists) love guitars with just a single bridge pickup, because the strings don’t have the magnetic pull of a neck pickup “weighing them down”. Just makes a difference.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128396140866457753",
    "author": "Eric Martin",
    "date": "2023-07-11",
    "content": "I had an architectural drafting class (on paper) in High School always thought I’d be an architect as a kid until the guitar came and took over my life. That’s come in handy in the last 2 weeks.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237921450304864276",
    "author": "NoahNeedleman",
    "date": "2024-05-08",
    "content": "Obligatory “snare sounds like shit” joke",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256022477843464233",
    "author": "cian riordan",
    "date": "2024-06-27",
    "content": "Damn, these mics are awesome. I think I’m going to buy the snare and Tom ones. So much rejection but incredible sound just flat into the console.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256661815421833257",
    "author": "cian riordan",
    "date": "2024-06-29",
    "content": "The Lautens -- they're really awesome. I'm going to get a set (snare + 2 toms) and just have those as go to mics. The rejection is truly good, the base EQ curve on the snare mic is often what I'm trying to shoehorn with EQ anyways. Really well designed. When I can post some clips I will.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361734659117154668",
    "author": "hyanrarvey",
    "date": "2025-04-15",
    "content": "@cian riordan  see I know how to use other ribbons on guitars",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1372783415375564901",
    "author": "Slow Hand",
    "date": "2025-05-15",
    "content": "So are we just going to ignore that outrageously large kick drum? What’s the story there?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377312409357783080",
    "author": "chrissorem",
    "date": "2025-05-28",
    "content": "I was using them for resonance. The  kick drum he’s actually playing is behind the big boys",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382830788630020106",
    "author": "BatMeckley",
    "date": "2025-06-12",
    "content": "Careful with this… in my vocal booth I have a big tapestries that covers an entire wall, thin, that looks like stars against a black sky. Thinking I was super clever, I ran and led light curtain (essentially just Xmas lights) behind it, to make the stars light up. Looks awesome. \n\nThe light curtain shows up as hum and noise in both the Telefunken mic AND the guitar amps. Damn it all.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472400391185371241",
    "author": "chris_donlin",
    "date": "2026-02-14",
    "content": "Ended going with two shop carts! Finally will have my pedals off the ground and within reach. Gotta play around with where everything else is gonna go for the left cart",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "808869630285971526",
    "author": "hendrick",
    "date": "2021-02-09",
    "content": "this is my first and only guitar. i got it last month 😅",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "841417808574676992",
    "author": "cian riordan",
    "date": "2021-05-10",
    "content": "If you're doing vocals on hardwood or tile floor, rugs are great for nabbing first reflections off the floor. Most of what is bouncing back into the microphone is in that slappy high end area and will likely sound bad. With a guitar cab, the microphone will sit quite a bit lower to the ground -- so in theory this idea is even more useful. However, program-material depending, its likely whatever is coming out of the speaker is going to drastically overpower what gets slapped up from the floor. If there's a rug around I'll typically use it for these situations.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029150051534119033",
    "author": "masteredbyjack",
    "date": "2022-10-10",
    "content": "Final note on the back wall (Ruairi feel free to tell me if I’m wrong). Dividing the space with a wall like that essentially makes the back wall anechoic and uses the “other room” as a chamber to let low end that makes it though bounce around, lose energy, and be refiltered as it renters the room so it doesn’t make it back to listening position. There is much more to it of course. It also catches stray reflections, etc so they don’t make it back to listening.\n\nKeep in mind my room is designed to sound as good as possible in the listening position for mastering so reflections that help it feel fun/good for clients on a sofa aren’t helpful to me! \n\nSynths are around because I like to continually remind myself how difficult finishing a record is and I find staying connected to playing makes me make much more musical mastering decisions!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036872684996399105",
    "author": "NoahNeedleman",
    "date": "2022-10-31",
    "content": "I run my prophet with my midi controller at my desk. That way I can quantize performances for arps and such and then it’s like having 4 hands, recording the audio while the midi triggers and I can twist knobs and cause chaos for that love performance feeling.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064572951573319680",
    "author": "BatMeckley",
    "date": "2023-01-16",
    "content": "True, but I’d rather risk that than have TSA rifling through all my mics/drives/computer everything else. I’ve literally opened pelicans to see TSA had dismantled my entire pedal board, cables unplugged, pedals all off the board banging into each other. Nightmare.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087701239065759814",
    "author": "philbarnes",
    "date": "2023-03-21",
    "content": "I think the \"Impossible Germany\" part and tone will forever live in my head as a pinnacle guitar moment for me.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094035559862771763",
    "author": "Rollmottle",
    "date": "2023-04-07",
    "content": "i have no dog in this fight. i could give a fuck about NS-10's. BUT, i don't believe there is an agreed on objective set of criteria that defines what good is, especially as it relates to pursuits that are inherently subjective. speakers, guitars, outboard, movies, art, video games, whatever....",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095136327927877732",
    "author": "cian riordan",
    "date": "2023-04-10",
    "content": "If only there would be a way to inject the “clink” of the bottles on every kick drum into the printed mix.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108932922255343739",
    "author": "Andy Lawson",
    "date": "2023-05-18",
    "content": "so got back to working this week.. the room is feeling better for sure, and that choked feeling has now gone.. (and i can actually feel a kick drum for the first time). have included a sweep so you can see where it's at so far, but really need to get the back wall built sooner than later.. @Gerhard Westphalen has been an absolute dream to deal with, i've pestered and asked way to many question that have all been met with way to timely (does the man sleep?)and helpful responses.",
    "reactions": 4,
    "attachments": 9,
    "is_pinned": false
  },
  {
    "id": "1145883041995178026",
    "author": "BatMeckley",
    "date": "2023-08-28",
    "content": "Best vocal compressor they make. Hands down. A very not straight forward piece of gear. The coarse and the fine gain knobs on the preamp act more like the two channels of a Marshall plexi. \n\nWill 💯 be my new travel rig. And at home I’ve already think that I like using it as a hardware insert backwards, as in going in to the comp first and THEN into the pre and eq.\n\nVery immediately satisfied. This is how getting gear should feel like",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171613925511532554",
    "author": "BatMeckley",
    "date": "2023-11-07",
    "content": "Very very cool studio. Lots of guitars in absurd tunings and an upright piano. Comfy couch on a back wall with at least a foot of treatment. Room sounds (and looks) gorgeous, even without the pmc’s on. Two of my fav guitar pedals on the desk within arms reach. Lots of natural light, chair has the flip up arms which is key for a guitar player. Literally on the same block as one of my fav stores/galleries. Lots to like about this place. \n\nI’m always inspired by rooms clearly made for someone specific. I hate the all things to all people approach, which usually mean “great at nothing specific”. This room is a great reflection of @LAPhill. \n\nFun fact: no monitor controller. Neat.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172237994271453204",
    "author": "BatMeckley",
    "date": "2023-11-09",
    "content": "Having a proper vocal booth for Vox and guitar cabs was life changing for me. Being able to make decisions on the way in by hearing what’s actually being recorded and not the sound in the room (without having to use headphones) is the single biggest luxury of my spot. \n\nI’m sure a guy like EV or Cian had enough miles at barefoot to go “whelp, this is not what I’m hearing right NOW, but when the guitarist stops playing I know it’ll sound like THIS” but that kind of guessing game always bummed me out.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181434980707094529",
    "author": "cian riordan",
    "date": "2023-12-04",
    "content": "Drummer requested a snare under mic today. I feel violated.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352421843159486495",
    "author": "Eric Martin",
    "date": "2025-03-20",
    "content": "from the height of those cymbals I’d guess the drummer was 60+",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457510494800842918",
    "author": "cian riordan",
    "date": "2026-01-04",
    "content": "might not have enough room with the PMCs there, but worth experimenting with if you find yourself in the same situation. Always tough trying to dial in a snare sound and you're just getting blasted by the diffraction of one side on the left speaker",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469863022712590553",
    "author": "SoundsLikeJoe",
    "date": "2026-02-07",
    "content": "Mic kit = Schoeps MS as main and MK2 pair as Outriggers. C414 to spot winds. AT4050 spot on brass.    A few DPA spots on harp, piano, perc.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808479365754257418",
    "author": "dumlords",
    "date": "2021-02-08",
    "content": "Current setup and also a couple of my favorite guitars.  Peavey T40, Dan Armstrong lucite model, 60s Hagstrom III and a 60s Yamaha SA15.  I need more mics and preamps y’all!!",
    "reactions": 3,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "808926799856795738",
    "author": "Preston Lull",
    "date": "2021-02-09",
    "content": "Make sure to find a good luthier and get it set up well! Get it intonated (saddles, and nut height so you’re not pulling the strings out of tune in the first positions) and get the neck adjusted and action set. \nget it feeling GOOD to play.\n#1 reason people don’t continue with guitar is that the setup on their guitar is wonky and they never even knew, they thought it was just hard to play",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808928634164871238",
    "author": "Preston Lull",
    "date": "2021-02-09",
    "content": "A lot of factory made guitars have fretboards of varying quality (maybe it’ll have subtle warps and waves in the wood up and down the neck) - if you’re having issues with playability beyond just getting a set-up maybe get the frets dressed and leveled out,\nLong story short, if it doesn’t feel or sound good, you can always find a luthier (usually in a guitar repair shop) to help you out",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1047241729314652190",
    "author": "peterlabberton",
    "date": "2022-11-29",
    "content": "My buddy Gabriel Shepard (who was making records with Cake when I was listening to said records in middle school) went to some audio school in SF in the 90s where he was told to *never* use condensers on drums. Glad to see you are a true rebel. Better put some swanky ass condenser on the snare to continue the theme.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064591099466874961",
    "author": "BatMeckley",
    "date": "2023-01-16",
    "content": "You’re only allowed two of those three items, and the front closet guitar check is not guaranteed.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129456374271721584",
    "author": "LAPhill",
    "date": "2023-07-14",
    "content": "The problem with a drawer is that the MIDI keyboard is either too low, or the computer keyboard is too high. Drawers almost always have some bounce to them too, which drives me nuts when playing.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171872173745512539",
    "author": "BatMeckley",
    "date": "2023-11-08",
    "content": "Looking good. Get wraps for those guitars so the strings don’t ring sympathetically",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199455970749853726",
    "author": "peterlabberton",
    "date": "2024-01-23",
    "content": "Past: not the first, but the earliest photo I can find. The days after I got my Focals but before my Soundanchors arrived. Really set up for success here.\n\nPresent: Kubrick/insane asylum/Severance mashup. \n\nFuture: @Gerhard Westphalen hard at work here—though I have to apologize: I am gonna try and squeeze a drum kit in.",
    "reactions": 3,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1199715192125263964",
    "author": "chrissorem",
    "date": "2024-01-24",
    "content": "And if you don’t have a trombone an amp can get a similar vibe",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1312262023538544650",
    "author": "Bryan DiMaio",
    "date": "2024-11-29",
    "content": "we gotta get you a sad lamp or something lol",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411049008264253552",
    "author": "Skyler Young",
    "date": "2025-08-29",
    "content": "Yes! Highly recommend renting their studio if you’re ever looking to get access to some vintage synths",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452089627312914535",
    "author": "Rollmottle",
    "date": "2025-12-20",
    "content": "I’d maybe call piano movers before I called mover movers. Either way I’m calling someone.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808416340972273684",
    "author": "joe iadanza",
    "date": "2021-02-08",
    "content": "Super simple home setup. The speakers are there but I don’t use them because they are terrible and the room isn’t treated. I mix in headphones for now. \n\nAnd a few of my babies... My Martin 000-18E Retro with two guitars I built and finished myself with lots of tasty boutique hardware and pickups.",
    "reactions": 2,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "808710017535574046",
    "author": "Eric Martin",
    "date": "2021-02-09",
    "content": "I think 20 guitars in my studio, but, I’m also in an indie rock band and I’m the guitar player ¯\\_(ツ)_/¯",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808851381741289532",
    "author": "Eric Martin",
    "date": "2021-02-09",
    "content": "someone said “surprised to see so many guitars”",
    "reactions": 2,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "808868167492960296",
    "author": "oaklandmatt",
    "date": "2021-02-09",
    "content": "FG-110! it was my dad's from the 70s. it was the first guitar i learned to play on!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860583403928551455",
    "author": "Zack Hames",
    "date": "2021-07-02",
    "content": "Love mono Coles. I like putting it behind the drummer kind of by their left shoulder pointing at the snare/kick if there’s room - may lose the rejection you’d be achieving overhead if that’s a concern. Can’t really go wrong with a Coles on the kit. Any go-to processing you’re doing for this?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031671334360584315",
    "author": "NoahNeedleman",
    "date": "2022-10-17",
    "content": "I’ll show this to my guitar tech. We’ll see if he’s game.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036852454706389002",
    "author": "Deleted User",
    "date": "2022-10-31",
    "content": "ms-20 is a probably more accessible option price-wise. I really hate owning analog synths even though I love the way they sound. Especially prophet and oberheim They take up space and not always immediately accessible especially I'm outside. Soft synths serve me better for my workflow but I'd love to have the workflow of ITB and sonic quality and tactile experience of analog synths.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068061744443949106",
    "author": "jonmatteson",
    "date": "2023-01-25",
    "content": "Maybe first week of Feb? Would be good to have a bunch of stands, be able to try vocals, acoustic guitar, and drums if possible so your spot might be perfect",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072285451509051442",
    "author": "peterlabberton",
    "date": "2023-02-06",
    "content": "I got a little keyboard tray standing desk thingy for like $60 on Amazon and it's honestly perfect... FYI",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086058040123465868",
    "author": "sethearnest",
    "date": "2023-03-16",
    "content": "(For real. No, Christian Henson, I don’t want to hear your finger nail on that one D note for all of you piano samples. )",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109243543249231943",
    "author": "Zack Hames",
    "date": "2023-05-19",
    "content": "I’m using a piece of wood wrapped in a quilt on top of a keyboard stand. It’s hilariously perfect for me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1120787152574357645",
    "author": "shaunobi",
    "date": "2023-06-20",
    "content": "Oh man... I built a Banjumbo with a friend's dad maybe 20 years ago. Kick drum as the resonator. You'd hit a note, not hear much, but a window two rooms away would go CRAZY. (He was a banjo maker)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128398336525864981",
    "author": "jantrit",
    "date": "2023-07-11",
    "content": "@Eric Martin congrats! Can’t wait to see this develop and start to take shape. Storage for stuff is also an important consideration! Space for drum kits, guitars, cables and other bits and pieces.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129446118208581753",
    "author": "GaspardMurph",
    "date": "2023-07-14",
    "content": "I thought I’d share my setup here ! I love my space here but I am starting to feel like I’ve hoarded myself into a corner. Too much stuff accumulated that I don’t need / use.\nHere is my plan to make more room, if anyone has an opinion, please shoot 🙂\n- condense all the rack gear into one of the rack cabinets, there a ton of stuff that is just in there and not being used (nor is it patched in)\n- Rhodes is going to my house, I think it will get more use as a practice / songwriting tool in my home.\n- Mellotron goes where Rhodes was, so I can store my tape echoes on the drawer cabinet\n- Smaller desk: I need to find the right one or have one built but I really only need my prophet, mouse and keyboard.\n- Would also be a good opportunity to improve speaker placement\n\nThe room is smaller than it looks in the pictures, it’s 161 sq feet. About 14.9’ long, 11.9’ wide and 7.6’ high. It’s a floating room design and there is acoustic treatment behind the fabric walls (no idea what though)",
    "reactions": 2,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "1138875241989414962",
    "author": "Slow Hand",
    "date": "2023-08-09",
    "content": "Imagine being rich enough to own that house but still having to rely on that janky keyboard stand setup beneath the desk.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172240767268438096",
    "author": "BatMeckley",
    "date": "2023-11-09",
    "content": "In all seriousness engineers much better than I do it ALL the time. Most rooms there’s a pretty good amount of bleed and a good engineer knows how to separate what they’re hearing from what’s actually being recorded. It was just important to me when I bought a place that I didn’t have to. \n\nIn my mind that’s one of the biggest selling points of digital guitar modeling is that what you hear is what you actually get, for better or worse.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182486808018288751",
    "author": "peterlabberton",
    "date": "2023-12-07",
    "content": "Somewhere out there is a warehouse with thousands or orphaned kick drums and rack toms just pining for their long lost floor tom siblings",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1193367456610263190",
    "author": "Will Melones",
    "date": "2024-01-06",
    "content": "No big desk, real nice desk, mini baby prophet?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195959922081407066",
    "author": "popaganda.",
    "date": "2024-01-13",
    "content": "Another plus of having the synths on the side…..if it’s a banger sometimes you gotta stand up.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196359618956374029",
    "author": "EliHeathMusic",
    "date": "2024-01-14",
    "content": "Haven't spent a ton of time here so I don't have the most experience with this particular setup yet. I do mostly production and session work as a bassist (and some mixing) and a big part of my motivation to treat this room and improve my monitoring has been to try to get to a point where I can confidently make better critical decisions early in the arranging/recording process. With that said I have enough limitations here (room size, work flow needs, etc) that having all of my keyboards in an ideal listening position has been a relatively low priority. I do have a headphone extension cable that can reach most places in the room and do a fair amount of work like that. Also recently switched to a wireless keyboard and mouse which has nothing to do with listening but has been extremely nice for being able to record myself in different parts of the room.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203167877922947103",
    "author": "hyanrarvey",
    "date": "2024-02-02",
    "content": "9/10 only cause the guitar amp is not in the new photo",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217608418798600342",
    "author": "cian riordan",
    "date": "2024-03-13",
    "content": "No, it’s definitely the B52 on kick drum doing that.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230663346160926752",
    "author": "Edward Rivera",
    "date": "2024-04-18",
    "content": "if you aren’t plugging guitars into ampex’s then what are you doing with your life",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230887669870100552",
    "author": "Zack Hames",
    "date": "2024-04-19",
    "content": "It's what the beta 52 kick drum recording called for.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243950762128572447",
    "author": "chrissorem",
    "date": "2024-05-25",
    "content": "Honestly it must be a combination of a shitty guitar bright strings with the wrong pick and a probably a mxl pencil condenser into a mbox then re-amping it through an iPhone gen1",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255918625580253355",
    "author": "JakeTB",
    "date": "2024-06-27",
    "content": "It’s a super rare gefell thing, it’s a tube mic with 8 capsules, intended for sound reinforcement on moving sources. Mostly gets used at podiums by parliaments, the pope, etc.\n\nIt’s been a fun wildcard mic, trying it sideways on ensembles today, acoustic guitar tomorrow!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278490654401368117",
    "author": "Nomograph Mastering",
    "date": "2024-08-28",
    "content": "If you want a perfectly controlled room then use your control room to track (say for a pristine acoustic guitar)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290068035536687265",
    "author": "jonmatteson",
    "date": "2024-09-29",
    "content": "Thanks! It a k&m keyboard stand with some plywood on top. Holds exactly what I need and nothing more and has lots of legroom underneath! This is the stand: https://www.sweetwater.com/store/detail/OmegaStd--k-and-m-omega-table-style-keyboard-stand-black?mrkgadid=&mrkgcl=28&mrkgen=&mrkgbflag=&mrkgcat=&acctid=21700000001645388&dskeywordid=92700080454169968&lid=92700080454169968&ds_s_kwgid=58700008743176700&ds_s_inventory_feed_id=97700000007215323&dsproductgroupid=2309085294402&product_id=OmegaStd&prodctry=US&prodlang=en&channel=online&storeid=&device=m&network=g&matchtype=&adpos=largenumber&locationid=9112892&creative=705256640101&targetid=pla-2309085294402&campaignid=21453452330&awsearchcpc=1&gad_source=1&gbraid=0AAAAAD_RQYnv2nzPUANHl76bpCU3d-TlQ&gclid=EAIaIQobChMIxPq6gJHpiAMV9yutBh1h1CFFEAQYBCABEgJz2fD_BwE&gclsrc=aw.ds",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293988475690942537",
    "author": "Slow Hand",
    "date": "2024-10-10",
    "content": "Y'all don't have rocker foot pedals for boost and frequency?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1296564285530705950",
    "author": "montrose recording",
    "date": "2024-10-17",
    "content": "processing live instruments and also creating synth vibes for daily jams",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336122102260174928",
    "author": "Eric Martin",
    "date": "2025-02-03",
    "content": "I think the only pedals that don’t really work on JC is boost because they’re just too clean for a boost to do the thing unless you’re boosting INTO another dirt",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354931642443104418",
    "author": "herbie",
    "date": "2025-03-27",
    "content": "command space on the laptop, 3 in the studio with full keyboard 😛",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362582625868447764",
    "author": "Nomograph Mastering",
    "date": "2025-04-17",
    "content": "I wanna see the platform shoes that go with this pedal board",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377704881170939956",
    "author": "LAPhill",
    "date": "2025-05-29",
    "content": "No, it’s angled to blow past them. If anything, the piano gets hit more. But the tuning of everything in here stays surprisingly stable.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461035994189926562",
    "author": "eliotpeace",
    "date": "2026-01-14",
    "content": "state of my pedalboard. my fav iteration so far!",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "808408208623665152",
    "author": "oaklandmatt",
    "date": "2021-02-08",
    "content": "@everyone let's see some pics of yalls setups! mix stations, mic'ing setups, full studio pics, favorite guitars, whatever!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808819564258525264",
    "author": "Zack Hames",
    "date": "2021-02-09",
    "content": "Think NIN Trent Reznor single note noise synth leads",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808871225828704256",
    "author": "Eric Martin",
    "date": "2021-02-09",
    "content": "When my band was super active I was working a day job 40 hours a week and playing 150 shows a year, I bought a lot of guitars during that time, not a lot since though",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808874346872307773",
    "author": "oaklandmatt",
    "date": "2021-02-09",
    "content": "yeah true. scales, classic songs. also, there are simple versions of complicated songs. most of my favorite songs are ones that a beginner guitar player could sit down and plays. even if it's not the exact right chords",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "819664297713860648",
    "author": "Eric Martin",
    "date": "2021-03-11",
    "content": "Super Reverb is one of my favorite amps, but dang loud AF. The Supreme/1600 is a rad amp too, pretty similar to the comet.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "847981385356279848",
    "author": "peterlabberton",
    "date": "2021-05-28",
    "content": "**also also I did love it on electric guitar",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860589807788884011",
    "author": "Eric Martin",
    "date": "2021-07-02",
    "content": "running my Coles with a cloudlifter into the UKsound 1173, it’s a classic rock setup Drums Guitar Bass, and the lead singer plays Wurli/Violin/Acoustic/Electric depending on the songs",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "932356212761190440",
    "author": "Chris Doms",
    "date": "2022-01-16",
    "content": "Yo what’s up! Been following you on IG for a little. I was demoing A7xs and they were distorting on a lot of material that I know is not distorted LOL. Taylor Swift’s pianos do not clip 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "943330517225451621",
    "author": "Michelia x Alba 玉蘭花",
    "date": "2022-02-15",
    "content": "@hendrick this is approximately what I had set up \nnot *exactly* complete off axis from one another because of the positioning but it gets the job done ..\nAlso these are just for some drafts we’re working on when we go to the final studio prints were going to record acoustic guitar with one other mic.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1031671195583643659",
    "author": "BatMeckley",
    "date": "2022-10-17",
    "content": "Leave your guitar in the trailer all day then run it into the hottest part of the venue and throw open the case. Instant Relic.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1048638555011944498",
    "author": "oaklandmatt",
    "date": "2022-12-03",
    "content": "Fits in the laptop backpack and works fine! Not much to say about it other than that really 🤷. It's really just to have a basic keyboard available with some velocity. I don't use it for much else",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061387758410674248",
    "author": "Nomograph Mastering",
    "date": "2023-01-07",
    "content": "Keyboards can generally be to one side. We’re focused on dealing with first reflections, it trying to bracket the whole area with soft stuff",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064478519951896626",
    "author": "jonmatteson",
    "date": "2023-01-16",
    "content": "Get some good cases and check the guitars!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064619892772458606",
    "author": "popaganda.",
    "date": "2023-01-16",
    "content": "I’d be on team check the guitar, but 1615 is too big for overhead.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068080242662588458",
    "author": "youngteam",
    "date": "2023-01-26",
    "content": "Can bring some old mics and a nice gefell small diaphragm to this if I can play guitar a bit.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068281333291438080",
    "author": "GaspardMurph",
    "date": "2023-01-26",
    "content": "It’s good, I always did it that way - I think I’m also not a fan of super wide drums. (Also no cymbales were used on this track, only kick snare and HH",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068281646815658034",
    "author": "GaspardMurph",
    "date": "2023-01-26",
    "content": "I got a wonderful snare sound - used a contact mic for the first time, great results. I’ll post a clip soon 🙂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068300063933218927",
    "author": "cian riordan",
    "date": "2023-01-26",
    "content": "Cymbals are back, baby! Downtempo, mushy indie bullshit is out!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068363420769996910",
    "author": "Deleted User",
    "date": "2023-01-26",
    "content": "I don’t really play drum kits but I really like the tone of paiste cymbals for bright cymbals and (especially) rides",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071633024472596551",
    "author": "jantrit",
    "date": "2023-02-04",
    "content": "Yup that’s the one! They’re real sleepers, sound great on piano and horns, toms too.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072377813992218715",
    "author": "BatMeckley",
    "date": "2023-02-06",
    "content": "I just balance my keyboard on top of Cians mom’s head. Easy enough.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094058977286959165",
    "author": "Gerhard Westphalen",
    "date": "2023-04-07",
    "content": "The ideal speaker is an infinitely small point with no SPL limits or distortion. Obviously that’s not possible so you do what you can and try to approach that in your idea of the best way to do so (assuming you’re trying to design a normal speaker and not something like a guitar amp)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101619721834594405",
    "author": "Tim O’Sullivan",
    "date": "2023-04-28",
    "content": "I love it. I don’t mix on it, and I use an Audient Nero for center section shit. But nice to have a fader to grab, and some utility eq’s. I mostly use my outboard pre’s and those all have little labs attenuators before the console so I have a ton of control over the headroom. I also use it to buss stuff down like kick mics and guitar amps to keep track counts down.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109308611756302416",
    "author": "Zack Hames",
    "date": "2023-05-19",
    "content": "Well shucks that makes me feel good. Guitar dudes unite!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1111651629654102096",
    "author": "youngteam",
    "date": "2023-05-26",
    "content": "Seeing people double up on smaller desks one for monitor and one for keyboard was eye opening to me. I could never get speakers and desk in the place I wanted and always compromised. It will be good to have my monitor behind the plane of my speakers again",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129456959893024798",
    "author": "Adam Thein",
    "date": "2023-07-14",
    "content": "I now have this funny image of you mastering a track and adding a shreddy moog lead to something lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129457441747243170",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "Feel like I try not to show off the actual keyboard because people will think I do everything (I don’t) and I only want to do mastering at the highest levels but for some reason today just felt like showing haha\n\nAnd honestly staying connected to the music I think helps me master better, even just like 20-30 min a week or so",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129458220780498944",
    "author": "LAPhill",
    "date": "2023-07-14",
    "content": "The one thing I'd like to add one day is an idea stolen from Danny Elfman - he has a sliding plastic bit that goes over part of the MIDI keyboard, so he can put his computer mouse/keyboard right on top when he doesn't need the keys, then either remove it or slide it out of the way when performing.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143066827497410580",
    "author": "Slow Hand",
    "date": "2023-08-20",
    "content": "Those guitar cases are pretty sturdy and aren't a bad choice. They're probably good to go as long as your movers aren't maniacs.\n\nIn the case of your studio equipment, just use common sense when packing your gear. Whatever box you're packing your possessions in, it should be sturdy enough to withstand another box of the same size and weight stacked on top of it without sustaining any damage.\n\nIf something is fragile then label it with some painters tape that says \"fragile\" on it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1147189858276745416",
    "author": "cy (sigh)",
    "date": "2023-09-01",
    "content": "is the deer playing keys? or tuning the piano?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1149794270115532922",
    "author": "chrissorem",
    "date": "2023-09-08",
    "content": "Cello in center I prefer it this way but so do they. Viola on the right",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1149795268083068938",
    "author": "chrissorem",
    "date": "2023-09-08",
    "content": "They aren’t playing any unisons so not sure why the violins are together but it feels balanced",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1163230706332344390",
    "author": "chrissorem",
    "date": "2023-10-15",
    "content": "Nice! I’ve used the ear trumpets upright bass mic and loved that",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167939122225238037",
    "author": "Ross Fortune",
    "date": "2023-10-28",
    "content": "My first rig was a Boss BR8 digital 8 track, that wrote to Zip disk. Monitored on a Sony hifi.\n\nIt only had two inputs, so I Frankensteined two mic cables together somehow and used one channel for kick and snare (D112 and sm57). \n\nI had zero idea of how to mic a drum kit, and no internet or other way to find out. I wore over ear noise defenders, and just stuffed a pound shop karaoke mic under the head band, which would obviously move as I did - true drummer perspective",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1179590969927155822",
    "author": "Nacho Sotelo",
    "date": "2023-11-29",
    "content": "I know some people that use it like that, on the left of the keyboard just for scrolling",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181436284447768688",
    "author": "Rollmottle",
    "date": "2023-12-04",
    "content": "\"ahh, sorry bro...this console's so old, the channel the snare mic you wanted must've been out.\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1184201791957647453",
    "author": "nachomaquieira",
    "date": "2023-12-12",
    "content": "Didn't use the PCM70 (even though I love it!), but I did rock a bit the 224 and used a lot a Roland RE-201 Space Echo for some snare and trash sends!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185323562798678086",
    "author": "Will Melones",
    "date": "2023-12-15",
    "content": "Two clouds? Two *keyboards?* I thought you were the real thing…\n\n(/s)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191945347988193310",
    "author": "cian riordan",
    "date": "2024-01-02",
    "content": "A good punchy picture of the main kit elements without the low end taking over. Great for getting 100-150hZ on the kick and the fundamental of the snare. You can also use the nulls on the mic to try and blind out cymbal bleed.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199523557554782329",
    "author": "Joao Brandao",
    "date": "2024-01-23",
    "content": "Haha! It was a fun session. Tuba running through a bunch of guitar pedals as well.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203168083045515344",
    "author": "hyanrarvey",
    "date": "2024-02-02",
    "content": "One of chris g’s rack has a mesa boogie sticker on it so it’s basically a guitar amp at that point",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1215530747473952799",
    "author": "Garth Tim",
    "date": "2024-03-07",
    "content": "not enough RGB or modular synths that you have no idea how to use. 4/10",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218703708108623872",
    "author": "cian riordan",
    "date": "2024-03-16",
    "content": "BK5a on crotch. Nice, never tried that… I’ve mostly used them on guitar amps. How great is that room sound?!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223679518204760138",
    "author": "James Redfern",
    "date": "2024-03-30",
    "content": "Great! I mostly find it useful for getting a cool midrange “splat” for the snare. How much I isolate the snare in the mix depends on the track!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256709031951597568",
    "author": "cian riordan",
    "date": "2024-06-29",
    "content": "My bud Sam Pura lost his shit over it: https://gearspace.com/board/product-alerts-older-than-2-months/1413899-lauten-audio-releases-snare-mic-purpose-built-fet-condenser-3.html",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270068857238847569",
    "author": "Zack Hames",
    "date": "2024-08-05",
    "content": "It’s my fav instrument next to guitar. I adore it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293989401893933098",
    "author": "peterlabberton",
    "date": "2024-10-10",
    "content": "I don’t wanna derail the jokes here, but: I’ve got a good friend who had his delay pedal modded to have the feedback and time controlled by foot pedals so he could do delay feedback/etc. live on stage—it was pretty sick.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1316935811547267132",
    "author": "Paris / Blue Butler Studios",
    "date": "2024-12-12",
    "content": "Not 100% sure on it yet, I know I love it for trumpet, bass & guitar cab/high spl sources. I'll have to sit down and do some A/B'ing for kick since I've only used it on today's session.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337483225529974916",
    "author": "BatMeckley",
    "date": "2025-02-07",
    "content": "$6k in pedals. Shoe box laptop stand. Priorities in CHECK. \nNo notes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352422823850807426",
    "author": "herbie",
    "date": "2025-03-20",
    "content": "hahaha no he’s younger than me. he loves those high cymbals",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352438274349600809",
    "author": "herbie",
    "date": "2025-03-20",
    "content": "you know surprisingly the cymbals aren’t completely demolishing the overhead mics either somehow",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355227303461916872",
    "author": "NoahNeedleman",
    "date": "2025-03-28",
    "content": "Nope. Bottom right on a keyboard with a num pad",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362459540515197048",
    "author": "hyanrarvey",
    "date": "2025-04-17",
    "content": "That’s just how shit looks when ur constantly changing guitar pedals lmao",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362573112507367515",
    "author": "Beck Nebel",
    "date": "2025-04-17",
    "content": "I made fun of people who had them… like dog why do you need a $300 buffer. But you turn it on and flip up the first switch and your guitar sounds hyperreal- instantly better. It feels like what people chase with “transparent overdrives” where they are adding almost no grit or gain to the signal but trying to get a better clean tone. It’s amazing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1364553877533495327",
    "author": "Brian Reynolds",
    "date": "2025-04-23",
    "content": "I'm usually just setting it to the bpm of the song. But its fun to move it around. When I say it feels different. I'm talking about Chase Bliss pedals such as Reverse mode C, which has tap tempo. There's just a consistency and intensity to the repeats that isnt there on tap tempo. Idk why? And then the others without tap, like Lossy Or Onward. The feel change is dramatic how much more in sync and vibe the pedals feel with the track. It's got a ton of preset slots for predetermined tempos",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407459561555628164",
    "author": "chrissorem",
    "date": "2025-08-19",
    "content": "Yeah one is a 26”and had one tunning/ resonant note and the the other is 28” providing different notes.  When I record drums I’ll generally have a lot of mics out and some other sound fx going at all times and as we work on a new song, I’ll have them play a take down usually a verse and chorus and I’ll stop and spend 5 minutes getting a vibe and that will inform me if I need to change a kick or snare and a resonator ect. A few of the songs I only used one resonator and kept it in the middle and and for sure one I  used both and  panned them out.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1426567547331018904",
    "author": "SoundsLikeJoe",
    "date": "2025-10-11",
    "content": "Not sure what you mean?  ...   the amount of signal is proportional to the decibel level of the source more than the preamp gain setting, and full orchestra is a loud beast.  Each channel is set so that FFF dynamics (barely) don't clip the preamp and the mix at unity and loud full orchestra is kissing into a brickwall limiter at -1db.  It might push the loudest peaks at 3-6db in reduction. But the RMS is all over the place. Final mix probably close to -20 LUFS program average.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440443358118936697",
    "author": "chrissorem",
    "date": "2025-11-18",
    "content": "This is where I mic  Pianos, right on the bridge the most even tone to me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452154031119142912",
    "author": "Mike Tierney",
    "date": "2025-12-20",
    "content": "I would also say, mover-movers and piano movers both know HOW to move big stuff better than your 8 strongest friends. I’ve moved a few consoles and oftentimes it’s not the strongest lot of people as much as it’s the people that have maneuvered big awkward shit around corners every day for the past ten years. I would still lean heavily in favor of hiring professionals over finding Matt Rad sized friends",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457513695931273369",
    "author": "cian riordan",
    "date": "2026-01-04",
    "content": "I doubt it on something like an SSL. On the old shitty OpAmp consoles, I could definitely see the plug-in amps transformers falling out the bottom.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469067111027704009",
    "author": "Eric Martin",
    "date": "2026-02-05",
    "content": "I definitely wouldn’t make them square if it’s for amps, weird sounding shit happens IMO in square amp iso rooms",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808412506711392306",
    "author": "Lucci Rossi",
    "date": "2021-02-08",
    "content": "Fave gear is my Danemann upright piano, Overstayer 8755DM and SOMA Lyra 🤓",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808416655310061638",
    "author": "oaklandmatt",
    "date": "2021-02-08",
    "content": "what's the keyboard on top of the piano on the left?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808419093765292092",
    "author": "Seanhmusic",
    "date": "2021-02-08",
    "content": "Stock. But that's a practice amp with 15yo tubes. I'm a Bogner guy for the most part... And for recordings. If you zoom in, you'll see my Kemper. 95% of my electrics go through that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808508116508737547",
    "author": "hendrick",
    "date": "2021-02-08",
    "content": "i truly never expected yall to have so many guitars 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808819339083907082",
    "author": "Zack Hames",
    "date": "2021-02-09",
    "content": "First synth that truly inspired me and felt like an instrument. I played in a noise pop/ industrial band and just played this through a 4x12 with a reverb and delay pedal and it was so exciting and performative, almost like guitar or drums. There’s obviously so much complex patching you can do but my favorite trick was to run the noise generator through the one of the oscillators so it would shape and modulate the noise rather than simply give you PSSSHHHH on top of a square wave. I’ll send the exact patching later, it’s quite simple.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808819739614904320",
    "author": "oaklandmatt",
    "date": "2021-02-09",
    "content": "filters are so intense too. different than any other synth i've ever heard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808820136479293471",
    "author": "Zack Hames",
    "date": "2021-02-09",
    "content": "Yeah, the way that thing distorts internally is magic. Also another thing that helped me with synths in general is treating it LIKE a guitar. A lot of synths are recorded direct, and that’s usually the intent, but guitars are almost never recorded direct completely clean with 0 effects or tone shaping. Running synths through pedals and amps and FX really opens the world for anyone struggling with “synth production”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808826845034053642",
    "author": "Slow Hand",
    "date": "2021-02-09",
    "content": "Also maaaybe keep a HPF handy if you try feedback tricks on other gear. I believe I once burnt out a solid state bass amp because I overloaded it with infrasonic frequencies.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808842804985987122",
    "author": "TALLL",
    "date": "2021-02-09",
    "content": "I have a MS-20 and I am always so bad with all the patching. Have you ever tried putting a guitar through the ms20? It's really fun",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808844302100594708",
    "author": "TALLL",
    "date": "2021-02-09",
    "content": "or maybe just microphone to preamp to ms20",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808862480053960787",
    "author": "Eric Martin",
    "date": "2021-02-09",
    "content": "When you have a sound in your head that’s a very specific guitar, this is fine to have. They’re mostly budget friendly instruments acquired used also.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808870205731110912",
    "author": "hendrick",
    "date": "2021-02-09",
    "content": "my instruments are the sax and the flute and some piano but after all this time i decided to give guitar a shot 🤷🏽‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808944368873373716",
    "author": "Seanhmusic",
    "date": "2021-02-09",
    "content": "Duuuude! Yamaha Pacifica was my first guitar ever! 🤘🏼🤘🏼",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808945339011956796",
    "author": "oaklandmatt",
    "date": "2021-02-09",
    "content": "@hendrick def good to educate yourself on the construction of the instrument! learning how to set it up and adjust things will just connect you to the instrument more too because you'll want to play it every time you tweak something. if a proper luthier is too pricey (or hard to find where you are) even just taking it to a guitar shop where someone can help you get the intonation and action really solid will be great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "812707064722882601",
    "author": "Zack Hames",
    "date": "2021-02-20",
    "content": "Clouds above the drums were a game changer for me! Not as fancy as a drumbrella but took all drum recording up a notch. What size are those gold kick drums?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "815431604327415829",
    "author": "Rollmottle",
    "date": "2021-02-27",
    "content": "Sick guitar! Maybe lay down some copper tape in that cavity for RF shielding. Worked wonders on quieting down all my guitars.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "815435658607853608",
    "author": "Slow Hand",
    "date": "2021-02-27",
    "content": "Did this help with any single-coil guitars for you? Mine are picking up a lot of noise from my computer and I fear shielding the cavity won’t be sufficient to block all of the RF noise because the pickup magnets are outside of that protection.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "815618793832710174",
    "author": "Zakhiggins",
    "date": "2021-02-28",
    "content": "If you have a strat or a tele and want to eliminate noise while still having a single coil, you should check out the Fender noiseless pickups, they sound incredible too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "815666289795268698",
    "author": "Eric Martin",
    "date": "2021-02-28",
    "content": "anyone curious about what that guitar sounds like it’s all over the first two St. Vincent records",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "815826946725773354",
    "author": "oaklandmatt",
    "date": "2021-02-28",
    "content": "@cian riordan been working with Annie a ton. would be dope to get some insight on her current guitar game",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "819662431826608198",
    "author": "Eric Martin",
    "date": "2021-03-11",
    "content": "is that the comet? that’s on my list for guitar amps",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "819664008021147660",
    "author": "Eric Martin",
    "date": "2021-03-11",
    "content": "I hesitated so hard on the comet because it was a PCB amp selling for $1500 new, which was IMO too much, especially when there are so many turret board builders out there building amps for $1500 and the repair-ability of PCB is way low for a previously touring guitar player like myself.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "819665361116332083",
    "author": "Josh",
    "date": "2021-03-11",
    "content": "My friend has a capped out bass man it’s literally the best amp I’ve ever heard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "819774742277914624",
    "author": "David Fuller",
    "date": "2021-03-11",
    "content": "no pics atm, but man - I loooove my KSR Juno",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "840120821489729536",
    "author": "oaklandmatt",
    "date": "2021-05-07",
    "content": "@Davi Juno has shared the full specs for the bass traps, which he also built for my studio after barefoot. we should pin it. @Slow Hand or Cian might have this too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "841415941182193704",
    "author": "Zack Hames",
    "date": "2021-05-10",
    "content": "Looks great to me, but I have a general question this picture inspired:\n\nDo you feel like having a underneath rug helps dramatically in recordings? Say for a vocal like above or a guitar cab in a room. Would you insist on a rug underneath or not?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842956429366263810",
    "author": "Eric Martin",
    "date": "2021-05-14",
    "content": "this was the first year that I started tracking guitars ITB with a Helix, because recall",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "843204106469638164",
    "author": "Zack Hames",
    "date": "2021-05-15",
    "content": "Preach on Helix. I need to try the neural DSP stuff though, heard a lot of great things.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "843219368971075584",
    "author": "oaklandmatt",
    "date": "2021-05-15",
    "content": "the archetype cory wong is great for clean and slightly broken up guitar. it's not that it sounds way better than other amp modelers, it's just simple and the vast majority of options sound great. workflow is tremendously important for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "845765979640168466",
    "author": "Eric Martin",
    "date": "2021-05-22",
    "content": "I’m with you fender deluxe is a holy grail amp, 12” speakers in Princeton’s feel like I should just have a deluxe, but that tremolo is soo much better in a Princeton, something about the circuit is different but I forget what it is",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "847966391034445824",
    "author": "Zack Hames",
    "date": "2021-05-28",
    "content": "P.S. forgot my snare stand for my rack Tom, so 2 floor toms was the answer!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851621142887661598",
    "author": "peterlabberton",
    "date": "2021-06-07",
    "content": "It’s not the worlds most incredible blow your socks off amp, but it’s nice, and hey, now I own at least *one* guitar amp! With a fun history to boot.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "853049759286951937",
    "author": "Eric Martin",
    "date": "2021-06-11",
    "content": "that’s the spot for single mic-ing a drum kit too, it’s the most balanced if you only had “one” mic and wanted a “natural” sound",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "853051273707913216",
    "author": "Zack Hames",
    "date": "2021-06-11",
    "content": "Totally. I’ve been digging a mic in that same type of position but behind the drums so the cymbals are less loud. (Mostly Coles or m160)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "863130651574534185",
    "author": "peterlabberton",
    "date": "2021-07-09",
    "content": "My future setup. Will of course need to adapt as I get in the room and listen, but I'm excited *and* need to minimize downtime between studios, so I'm mapping stuff out as best I can so I can hit the ground running.\n\nI'm thinking I'll build some fiberglass/rockwool panels on stands (the four panels freestanding by the mix position) and mimic some of the idea behind the attack wall: kill reflections closer to the listening position rather than at the walls. This way I can keep the fireplace and windows from being covered up, and have some gobos to move around when needed for tracking. The small desk to the left of the mix position will be a rack for gear, the large rectangular thingy in the upper right will be an upright piano. I'll pack in some DIY tube traps around the monitors, and hang two 4'x2' panels I already own over the mix position. I'll also put two slightly smaller panels over the drums, and two more on the wall behind the drums. The french doors and the sliding doors to the closet behind the couch will have heavy curtains.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "877675926018744371",
    "author": "Eric Martin",
    "date": "2021-08-18",
    "content": "I can’t decide if this is “too phasey” or just the right amount, it’s wide, but not too wide, has a hole for the vocals and collapses down to mono okay, anyone else have success with a similar piano mic setup?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "901145823906267136",
    "author": "cian riordan",
    "date": "2021-10-22",
    "content": "Not sure if I can do the full Jesse Ray Ernster, monitor on the floor, keyboard on the lap thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "908152981696954429",
    "author": "hendrick",
    "date": "2021-11-10",
    "content": "did some drilling for the first time ever today 🔫 now i have more room with the guitars on the wall",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "917136523768504350",
    "author": "Eric Martin",
    "date": "2021-12-05",
    "content": "I’ve been using the MP on everything since I got it, makes Bass sound incredible, cleaned up an acoustic guitar really nice, just overall one of the greatest tools I have.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "917536609463840798",
    "author": "oaklandmatt",
    "date": "2021-12-06",
    "content": "the piano and the microphone together are 185 years old. which still kinda blows my mind",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "960189521503346769",
    "author": "Maxim",
    "date": "2022-04-03",
    "content": "I’d wholeheartedly recommend the Focal Clear MG. Out of the box they were my favorite in the 1-1.5k price range. I tested the HEDDs, Airpod Max, Audeze LCD-X and own the M50s and HD650s. \n\nI was looking for the headphone that gave me the best assortment of detail, fun, space, and „translation“ to speakers out of the box (without extra eq or another amp to power it outside of my UAD interface). \n\nFor my taste the Focals fit that perfectly. Even hooked up to my laptop directly the sound was extremely fun, detailed and useful in making decisions. \n\nAlso the look, comfort, travel case and extra pads are a nice touch. Only negative for me was the cable being a bit too short in a recording/moving around in a studio setting. But I wouldn’t use them for that anyways. \n\nAirPod Max (with noise canceling) would probably be second. They just lack the finer details and deep bass for me. \n\nThen the LCD-x (they are technically better than the Airpods but I wouldn’t prefer the LCDs in a real world setting. Only in the studio with some eq added).\n\nHEDDs I so heavily disliked it wasn’t even funny. The UAD Interface can’t power them properly and they just sounded like a crappy and weird set of nearfield speakers playing from either side of your ear. Can’t even explain it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982702198926508062",
    "author": "peterlabberton",
    "date": "2022-06-04",
    "content": "This is the kind of nerdy tweaky shit I think this discord will appreciate: got my lil S1 control surface a few days ago, and used setting it up as an excuse to also play around with the arrangement of my tiny desk, and add some EQ to my monitors.\n\nTried the S1 behind my keyboard (too deep and potential for more reflections), and off to my left (weird neck craning all day), and landed here for now. Then busted out a mirror and angled my desk to avoid any reflections from the monitors at the listening position. Shot the room again and popped this EQ on the output in UAD Console (it’s finally good for something!!), and am very pleased with the new arrangement. 🎉\n\nRuairi might have a fit with this EQ curve, but I’m ABing it in and out and it’s definitely helpful, until I get my act together and build some membranes!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "985594856833425408",
    "author": "ryount",
    "date": "2022-06-12",
    "content": "I wanted to snag a fairchild knob for the extra-ness of it, but snagged this one from an old crown amp in a gear graveyard. Kinda wild how much better it feels than the tiny dangerous one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987508629697613824",
    "author": "ehutton21",
    "date": "2022-06-17",
    "content": "Me everytime the guitarist dude walks over where I just mopped: “dude I’m getting a gnarly drum bleed on the guitar mic”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001918254069067806",
    "author": "youngteam",
    "date": "2022-07-27",
    "content": "it's okay i track guitar in here and am not mixing big hip hop records",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001929784948957284",
    "author": "Will Melones",
    "date": "2022-07-27",
    "content": "I used to have a null narrow and deep enough that the low E string on a guitar would all but vanish. That had to goooo. But yeah, I feel like every room has to have a lil notch down there to some degree",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1003846470040035348",
    "author": "NoahNeedleman",
    "date": "2022-08-01",
    "content": "The Downlighting in the cloud would have me feeling like Uncle Fester, but honestly that room is set up so much like mine… minus about $50k in outboard, plus about $15k in acoustic guitars 🤪 @BatMeckley would never say it to you, but I’ll say it for him: Big Boy Shit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1003852401771565187",
    "author": "1ggy",
    "date": "2022-08-01",
    "content": "@cian riordan where do you hide the midi keyboard in that room?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1010049332726206514",
    "author": "Kendal",
    "date": "2022-08-18",
    "content": "Love the Pacifica. Highly underrated, IMO. It has won many shootouts on acoustic guitar, even over my BAEs and Undertone.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029152273210822716",
    "author": "masteredbyjack",
    "date": "2022-10-10",
    "content": "Appreciate it! Most of them (near listening position and on back wall) are actually the felt stuff wrapped in woven art blankets so no reflections!\n\nThe back wall catches the reflections from the fireplace and the canvas over the piano plus any from keyboards/etc since they are behind my listening position for mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029492718134636595",
    "author": "Rollmottle",
    "date": "2022-10-11",
    "content": "all my own stuff and not a lot lately since i've focused on mastering, but yeah! synths, modular, guitars, bakery etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033069913209847898",
    "author": "Will Melones",
    "date": "2022-10-21",
    "content": "Ended up with a lot of sizzly cymbals, but the bass came out pretty solid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035035485799731292",
    "author": "cian riordan",
    "date": "2022-10-26",
    "content": "will usually set the mono oh to where I like it, then try and get the other two's capsules equidistant from snare head -- factoring in which L/R elements I want them focused on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035388726748139610",
    "author": "cian riordan",
    "date": "2022-10-27",
    "content": "So here’s the roundup on my dumb drum thing. This is a scrappy little experiment on my part to see if I can get a convincing drum sound in my little drum room. Before starting this, I had the idea in my mind that if a room is good for mixing, it must be good for recording! *Insert Game Show Buzzer* I ran into many of the things I didn’t like about the Barefoot Studio B Live room — and those things were exaggerated by a factor of 10. First of all, my room is very dead by design. It treats me great in mixing, but made for a real challenge when trying to get *some* sort of drum personality. I was also working with a pretty shitty old premier kit that hadn’t seen the light of day in half a decade. Shitty cymbals, very quickly tuned heads — I wasn’t setting myself up for success… but whatever.\n\nThe setup was a little ridiculous (minus a few utilitarian pieces):\nKick: Beta 52 -> Scully 280\nSnare: SM57 -> Scully 280\nOH Mono: Coles 4038 -> Ampex 351 -> 1176 (not compressing, just to trim gain before ‘tools)\nOH L/R: U67s -> UTA pre (thanks Matt!)\nKick Room: U47 -> UTA Pre (again…)\n\nThis is where I ended up, without mixing, and with some quick playing and utility EQ/balancing. No compression except a limiter to bring up the level. While the actual drums themselves don’t sound amazing, I really struggled with getting any sort of energy out of the drums… it all just got sucked out. \n\nHere are the results if you care (don’t judge my shitty playing)\n\nI think if it do this again I would:\n1) Have a better sounding kit. Turns out, shit in.. shit out. I knew this. We all know this. But here I am.\n2) Maybe put some sheets of plywood around to create some surface in the room. Just give it some life.\n3) Not use the Scully. It’s so hard to get them to not sound distorty… I just don’t have enough pres on hand to have clean path for everything. Mix studio living.\n\nSo it goes…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035391712094343208",
    "author": "David Fuller",
    "date": "2022-10-27",
    "content": "The snare totally sounds like a drum machine",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035393606996992030",
    "author": "Nomograph Mastering",
    "date": "2022-10-27",
    "content": "I used to do it with drums and delays in the PA, or some guitar amps",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036832852953813062",
    "author": "Deleted User",
    "date": "2022-10-31",
    "content": "Interesting, are you are using the moog as a processor to get distortion?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036840048169070652",
    "author": "peterlabberton",
    "date": "2022-10-31",
    "content": "I’ve done it a couple ways. Most aggressive is to patch the output of the mixer back into one of the mixer channels, then use that to drive it. Or you can just crank the main output of the whole synth, which is what I did.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036850717207580712",
    "author": "Deleted User",
    "date": "2022-10-31",
    "content": "Ahh that makes sense, if there is an amp - you can distort them. I'd love to try this one day.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036915987053826068",
    "author": "Deleted User",
    "date": "2022-11-01",
    "content": "I would definitely consider desktop synths and hook it up to midi. Takes less space and also somewhat portable as well. Roland has been putting out some cool desktop synths for pretty low price and DSI has some too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040330732314308648",
    "author": "mixedbywong_my",
    "date": "2022-11-10",
    "content": "Think it’s called the POD farm or something . The bean pod even now does sounds better than NI Guitar Rig imho.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047379629423472690",
    "author": "cian riordan",
    "date": "2022-11-29",
    "content": "Absolutely. David Gibson out here mic'ing full drumsets w/ SM57s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1060799596349112340",
    "author": "cian riordan",
    "date": "2023-01-05",
    "content": "Sorry, realized I never responded. Trap kit as in just kick, snare, & hat. The super flyer kit, but with bottom heads on the toms (for better or worse).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061387345527586856",
    "author": "Zack Hames",
    "date": "2023-01-07",
    "content": "How do you address this when you need shit on either side of you? (Racks, keyboards, amps, etc). \n\nI see a lot of the unfuck rooms and they've got these massive gobos on either side of the mix position, but then the rooms are super super minimal mix or mastering rooms (or the photos show that).\n\nDo you put the panels as far as you can get away with and then put the stuff in front of them? Do they need to be straight or can they be angled or is that worthless? (Rauri, if this falls under your teach a man to fish/wanting a fish category, feel free to tell me to (un)fuck off)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062212772038971422",
    "author": "Rollmottle",
    "date": "2023-01-09",
    "content": "Similar move in Equilibrium with a keyboard modifier",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062217484566011924",
    "author": "Deleted User",
    "date": "2023-01-09",
    "content": "that’s just a wrist pad that comes attached to the keyboard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062217819242106982",
    "author": "Deleted User",
    "date": "2023-01-09",
    "content": "I used to go to a hand therapist and she recommended that I put the keyboard and mouse slightly above the lap height, so it’s on a little drawer thing you pull out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062218761870000138",
    "author": "Deleted User",
    "date": "2023-01-09",
    "content": "the keyboard is actually not as wild as it looks. you type with two hands anyways 🤷‍♂️ the only thing odd about this keyboard is how function key is where the option key is supposed to be",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064337787098251375",
    "author": "Eric Martin",
    "date": "2023-01-15",
    "content": "tough part this time is deciding to check guitars or mobile studio, guitars aren’t worth as much, but also more difficult to protect",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064542011274821703",
    "author": "David Fuller",
    "date": "2023-01-16",
    "content": "Guitars are a million times more likely to get broken",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064575109291053056",
    "author": "Eric Martin",
    "date": "2023-01-16",
    "content": "that’s a risk, I feel like this stuff under the scanners looks less suspecting than a pedalboard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064590695832236164",
    "author": "Deleted User",
    "date": "2023-01-16",
    "content": "don’t airlines also usually let you keep guitars in the closet separate from carry ons? Backpack can go under the seat, pelican case with important stuff can be stored overhead and guitar can go in the closet",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064629612929355877",
    "author": "Eric Martin",
    "date": "2023-01-16",
    "content": "I can check the guitar, and the 1615 with some stuff in a carry on, but was just looking to keep it all in one case for less to carry",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064990483664875561",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "I have a Hilo goes AES to speakers and as my send/capture for the Massive Passive...you can't see it here but there is a rack under the screen where it sits. I have a side car off the side (the walls look pretty tight but they are actually the unf*ck mass loaded vinyl L things, so the room opens up more behind them). The sidecar is back from those...its got a apogee symphony taking the ins for my synths (also not really pictured -- just hangarounds from my production days for the fun of it sometimes), Hazelrigg VLC in there too.\n\nThere is sorta a whole room behind the listening position...its 30 feet long with a floating wall for absorption about 15 feet in so the studio is like 13x15 but acoustically its larger if that makes sense.\n\nI do use streamdeck...but mainly to switch quickly between the hot ref in Wavelab and my master. I've gotten deep into Applescript which essentially handles all of the other Wavelab processes...it's almost finished but my streamdeck will essentially just launch those applications to do what I need. So I'd say it's very useful, but the coding I've been able to do will render it sorta meaningless for me (though convienent, I use it for other things like navigating websites when doing client outreach, etc which is very handy and makes my workflow like an order of magnitude quicker).\n\nChair is hag capisco. I love it. Had a serious back injury when I was younger so I'm pretty dialed into having things be ergonomic and I find it's great. Actually kinda rather uncomfortable...in a good way. You can't really slouch. Took some getting used to but it's interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068058361498701824",
    "author": "BatMeckley",
    "date": "2023-01-25",
    "content": "It’s why I got my Josephson c705. It’s pretty close to that vibe. \n\nDoug used them on guitar amps and anyone who worked with him bought like 3, and there’s not a ton around.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068299741496082502",
    "author": "peterlabberton",
    "date": "2023-01-26",
    "content": "Wait you actually want to hear the cymbals?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068304204805976134",
    "author": "ALXCPH",
    "date": "2023-01-26",
    "content": "Just started on a track with someone, and it has mad cymbals! Lfg! Big ride going hard!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068369270410592316",
    "author": "Deleted User",
    "date": "2023-01-26",
    "content": "I just found out how much cymbals cost, I expected like 100-200 per one cymbal but it was double that… It’s pretty wild",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068370460707930232",
    "author": "Deleted User",
    "date": "2023-01-26",
    "content": "as a guitarist, I can’t imagine spending 500+ something to beat on it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068905265698709614",
    "author": "Adam Thein",
    "date": "2023-01-28",
    "content": "Whoa that keyboard cover - is that labeled for PT shortcuts?  I need that!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069336078085017682",
    "author": "Zakhiggins",
    "date": "2023-01-29",
    "content": "The rack one wasn't used, actually sounds great on snare with the pad attachment and in cardioid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071621083138113586",
    "author": "Calvin Lauber",
    "date": "2023-02-04",
    "content": "You referring to the black inside kick mic? It’s a Beyer 740. Never used one but sounds really cool. And a trusty 201 on the snare 🤠",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072283847695286345",
    "author": "Eric Martin",
    "date": "2023-02-06",
    "content": "I had one of those Guitar Center desks and like 3 rack cases full of rack mount stuff, the Plan A got my into almost half the footprint",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1074084003986014359",
    "author": "popthetrunk",
    "date": "2023-02-11",
    "content": "Looks awesome, are you using the CL 1B as a line amp at the end, driving the dragon, or not at all etc?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077315329019084902",
    "author": "bennythetweet",
    "date": "2023-02-20",
    "content": "I'm literally on a 4' wide, 12\" deep Pine stair tread on a keyboard stand rn, and I like it. 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079126108320051262",
    "author": "Slow Hand",
    "date": "2023-02-25",
    "content": "Speaking of extreme measures for audio, would a stringed instrument sustain/resonate better in zero gravity? In other words, would your acoustic guitar sound better in space, all else equal?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086038446923063306",
    "author": "ALXCPH",
    "date": "2023-03-16",
    "content": "I remember Jon talking on a talk where he said the producers had burried all the finger and string noise on a guitar or bass, and one of the first things he did was bring it up, because it just made things more vibey for the song. Making those decisions of pretty vs ugly is tough.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088268082792906773",
    "author": "hank01564",
    "date": "2023-03-22",
    "content": "Beautiful room! But also is that rubber bridge guitar off to the side? 👀",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088268427879260201",
    "author": "jonmatteson",
    "date": "2023-03-22",
    "content": "Yes! Well a homemade one with foam but same sound. It’s my favorite guitar to write on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091402696650666004",
    "author": "BatMeckley",
    "date": "2023-03-31",
    "content": "The pmc’s sound really great in there now. Very impressed with the magic. The room significantly better than the first time I heard it, and it was good the first time. Sounds like the PMC 6-2 just fundamentally have a “impress the guitar center kids” high lift that anybody serious immediately shelves out of them. (Though I’m not sure how everybody missed the noise the track lighting makes.)\n\nI REALLY wanted to see the adjustments you made to the speakers but the cat 5 cabling was screwed up at the time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091441567304257647",
    "author": "masteredbyjack",
    "date": "2023-03-31",
    "content": "Very interesting, you are in the exact opposite camp then!\nOr course rooms, treatments, etc are different for everyone\n\nSuch a taste based thing...either of the options or their combos (high shelf attenuation on/off, sub boost on/off) were in the \"fine\" category. But I like loads of lows, suppose that's why I like Castelli stuff haha\n\nTo be fair though, I just picked the one that felt right up front and never have thought about it again",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094034573777719426",
    "author": "BatMeckley",
    "date": "2023-04-07",
    "content": "It’s like saying an old Martin guitar is objectively bad because it doesn’t have 24 frets and an evertune. I think this an important example of missing the point entirely.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094046940670464010",
    "author": "austenballard",
    "date": "2023-04-07",
    "content": "Yeah, you're just measuring by different standards\n\nI mean, objectively my thinline tele is a terrible guitar if I'm using a les paul as my ideal measuring stick",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095118106080333877",
    "author": "cian riordan",
    "date": "2023-04-10",
    "content": "Tiny little synthesizer for a tiny little plane. Makes perfect sense.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1098769900178264095",
    "author": "Rob Domos",
    "date": "2023-04-20",
    "content": "True. You said amphions are the worst offenders which makes a ton of sense with the hard edges and the tweeter being equidistant from 3 sides. For monitors with  rounder edges and less symmetrical tweeter placement I’m sure the differences would be less dramatic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104174566642819212",
    "author": "Nomograph Mastering",
    "date": "2023-05-05",
    "content": "Like the fact that your guitar should have strings",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108381755070750830",
    "author": "youngteam",
    "date": "2023-05-17",
    "content": "Was playing around with a mood mk1 last night. Wish I could demo all the chase bliss pedals at once",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109144369535135744",
    "author": "jmlongmusic",
    "date": "2023-05-19",
    "content": "Hey everyone! I’m new to the community - really enjoying it so far. This will be a long post asking for some studio build advice — I hope that’s ok. Please just let me know if there’s a better thread for this sort of thing. \n\nI’d be extremely grateful for any feedback! Here’s some info: \n\n- I am currently moving my home studio to this basement space that is about 400 SQ feet. Concrete floor and walls except for the front wall shown in this picture - that is drywall as it separates the rest of the basement. \n\n- The ceiling joists are exposed and are about 7.5” deep. \n\n- My primary function for this room will be mixing, but I will also be doing smaller overdubs like piano and vocals. \n\nCurrently, after painting the walls and floor, my plan is as follows: \n- Stuff the ceiling joists with insulation — probably Safe N Sound… thoughts on that choice? \n\n- Cover the joists with fabric from Gilford of Maine. \n\n- Figure out how to drill into concrete 😂 Then put panels everywhere. Most of my panels are about 4” thick and are comprised of the safe n sound insulation. \n- Put some big rugs down but also leave a bit of the concrete exposed if possible cuz I like the look. Haha \n\n- My monitoring set up is NS10M’s (don’t laugh) with an Avantone CLA-100 amp and a PreSonus T10 sub. I’ve got an Apollo 8 Duo and Apollo Twin X Quad. \n\nThat concludes my plan so far. Am I on the right track? 😳 \n\nI really appreciate any feedback you’re willing to give. 🙏",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1109202441678889012",
    "author": "youngteam",
    "date": "2023-05-19",
    "content": "hi folks - as I eagerly wait for my kh310s to get here next week I'm thinking about what changes I could make in my studio for low cost.\n\ntl;dr: what smalls desks are people using? I'm thinking one for computer screen and one for keyboard, mouse, streamdeck etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109204536331096064",
    "author": "youngteam",
    "date": "2023-05-19",
    "content": "i gotta head out to a guitar lesson but I'll check back in later to see peoples thoughts. thanks!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109204734692298752",
    "author": "masteredbyjack",
    "date": "2023-05-19",
    "content": "This one will have a tiny 37 key QBK fatar midi keyboard mounted under it (for my hobby/play music interests unrelated to mastering just to stay in touch with the art) but it’s actually very sweet if you’re producing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109211332332503041",
    "author": "peterlabberton",
    "date": "2023-05-19",
    "content": "@youngteam I have a cheapo Amazon keyboard rolling desk thing, brand is Mind Reader. Nothing glamorous but it works great.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109228780037341344",
    "author": "masteredbyjack",
    "date": "2023-05-19",
    "content": "Long winding path of many iterations, but it is a cut down sorta design of my current one (same woodworker). Basically made him a 3d render of the first one, then this is sorta a simpler version of that. Actually the one pictured is on the market i believe (it was accidentally made like 2 inches too narrow to fit the keyboard)\n\nLong story short I designed it and the woodworker built it for me (he is very good!)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109863655903862784",
    "author": "Ross Fortune",
    "date": "2023-05-21",
    "content": "Right, but I have the DSP EQ working away on the PMC 6, and there is fractional latency while tracking. It’s noticeable, but still workable (though I’ll switch to the NS10s while I’m playing guitar for instance). \n\nWith the Kiis though, it was almost like a deliberate 1/16th slap type thing. Unusable as a tracking monitor.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110414369298329710",
    "author": "Johnny I",
    "date": "2023-05-22",
    "content": "Thanks Jack and Cian! Mainly as a creative space to work on personal projects. Composition, arranging, overdubs (guitars, bass. synths, etc), mixing.  I saw your setup Jack, and it looks awesome. Did you also build out a basement?\n\nSeparation from upstairs isn’t an issue at this time. So the main goal would be to get the acoustics to work.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112189673641619597",
    "author": "LAPhill",
    "date": "2023-05-27",
    "content": "Many composers choose to work with what's called \"articulation per track.\" As in, violins long, violins short, violins pizz, violins trem, etc. etc. etc., so it adds up quickly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112194338781413456",
    "author": "LAPhill",
    "date": "2023-05-27",
    "content": "I'll usually map things out with a piano track or a full strings track, maybe a few other instruments as I go (i.e. I know this is going to be a flute melody), but it's all part of the same template",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112936214631297165",
    "author": "ehutton21",
    "date": "2023-05-29",
    "content": "Thank you 🙏 Only question I have is how much I should be watching heat and ventilation re: the unit. I realized my UA runs pretty hot and I’m sure support to service the preamp would be possible should I need it, but was curious if any other owners have had to pay mind to rack position/temperature during longer sessions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116117544961585265",
    "author": "LAPhill",
    "date": "2023-06-07",
    "content": "Okay, but someone get these guys a place to put their keyboard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129450662971854869",
    "author": "GaspardMurph",
    "date": "2023-07-14",
    "content": "I fantasize about extreme downsizing also. Love the idea of the northward desk - the price point is a bit high for me and I don’t think I can have my prophet in front. I can’t really work like I do without a midi keyboard in front of me :(((",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129452911559188571",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "For those interested in the tiny desk/midi thing (and want to do it premium) — had a 37 key fatar keyboard midi controller built into my desk, purely for hobby reasons, I never use it mastering but I like to touch keys every so often to stay connected with the creative side of the process. Slides in on accuride slides and is beastly sturdy, does not move at all when played.\n\nAnd since it can be attached to the slides from the side of the keyboard, you can get it right up to the bottom of the desk, you’d never know it was there (and since all day every day is mastering for me that’s very important in my case!)",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1129455496601022494",
    "author": "Deleted User",
    "date": "2023-07-14",
    "content": "this is my setup- it’s not ideal, I gotta move my keyboard every time I play the drum pads or play with faders. I could probably get wider keyboard drawer, but haven’t managed to find one that would fit 49 keys.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1129455918329893006",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "Yep this is the best in your case!! Do you find it's more important to have the keyboard there vs a drawer? I'm assuming since you're composing the computer keyboard/mouse ergonomics aren't ** the #1 concern?\n\nAlso do you have the doepfer one with weighted keys built in?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129456667491319919",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "In my case this was able to be solved (keyboard is synth keys so lighter), and the specific keyboard is literally only like 1.5 inches under the desk so legs easily clear. There is no drawer under the keyboard. Accuride slides...literally no bounce. But I very much doubt that would be possible with the type of setup you require",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129456857015136326",
    "author": "LAPhill",
    "date": "2023-07-14",
    "content": "Anyone who's not putting their keyboard off to the side is winning in my book.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129457720722997411",
    "author": "Deleted User",
    "date": "2023-07-14",
    "content": "I have 49 keys on the desk, and 88 keys hammer action on the side for more piano playing.\n\n“where to place the keyboard in a studio” is a huge rabbit hole. I still don’t quite feel comfortable with this setup. I used to have both on the side, but I hated having my arm out to the sides",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1131438945427787888",
    "author": "austenballard",
    "date": "2023-07-19",
    "content": "very late to the keyboard on desk thing but I wrapped two bricks in duct tape, velcro’d them to the bottom of my controller and it was just enough space to be able to slide the typing keyboard underneath",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1131439043897466971",
    "author": "austenballard",
    "date": "2023-07-19",
    "content": "later on got sick of that, built a dedicated slide-out keyboard shelf",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1131439338295677090",
    "author": "austenballard",
    "date": "2023-07-19",
    "content": "currently working on a very mobile setup in my girlfriend’s living room with the controller right behind the typing keyboard. I’m running the keyboard’s cord under the controller which is elevated on some prescription bottle caps taped to the bottom",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1131439479408840766",
    "author": "austenballard",
    "date": "2023-07-19",
    "content": "I have done many other jerry rigged keyboard alignments\n\n AMA lmfao",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1131443451834138694",
    "author": "LAPhill",
    "date": "2023-07-19",
    "content": "I'd suggest a bluetooth keyboard to avoid that cord, but you've built a delicate house of cards there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143061535053320272",
    "author": "Deleted User",
    "date": "2023-08-20",
    "content": "I’m worried about my guitars and keyboard- Should I let the movers pack them or should I do it myself?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143062254544244801",
    "author": "Deleted User",
    "date": "2023-08-20",
    "content": "https://www.uhaul.com/Tips/Packing/How-To-Pack-A-Guitar-for-Shipping-OR-Moving-21560/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143064713048096768",
    "author": "Deleted User",
    "date": "2023-08-20",
    "content": "I’ve only got these ones. closest thing I got to a hard case is the acoustic guitar case on the left. \n\nSo do you think hard case wins over packing method above?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1143107133496381541",
    "author": "Edward Rivera",
    "date": "2023-08-21",
    "content": "I heard Adam Jones *still* leaves his guitar in his backseat without a case",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1149793431141502997",
    "author": "Will Melones",
    "date": "2023-09-08",
    "content": "Oooh center cello? Are the violins spread, or is that Big Violin on the cello side?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1149794859910176908",
    "author": "Will Melones",
    "date": "2023-09-08",
    "content": "Sounds like it’d be a preferable balance, I’d like to try it. Gotta keep the violins together for intonation?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153747428806238310",
    "author": "itMIGHTbeNICK",
    "date": "2023-09-19",
    "content": "This is my humble home setup in the corner of my bedroom. There’s nothing glamorous here. While I’m still building out the room downstairs and things have been at a hault due to some financial difficulties I won’t get into. I’m doing most of my work right here these days if I can’t get studio time at my buddys space. I’m incredibly proud of the mixes and masters I’ve been able to do in this little corner. I set up some gobos and tube traps I have in the closet when I’m getting deep into the mix and it’s all been working out as best as it can for the situation at hand.\nNS10’s have the cap mod. \n\nWhen I need to track my guitar amps I completely isolate them with long cables and treatment directly in my closet or I will close off the bathroom and treat them in there as well as capture the natural reflection in our bathroom. My wife and kids are so incredibly sensitive and generous to me during this time to even let me still be able to work and make this happen while the studio build is on hold and we’re having to make things work.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1158544316508164147",
    "author": "Zack Hames",
    "date": "2023-10-02",
    "content": "Are you destroying one of the top snare mics? And what are you using the crotch mic for? Just vibe?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1165968262639661116",
    "author": "Deleted User",
    "date": "2023-10-23",
    "content": "Just gotta put some defenders over it and you got you FOH wiring safe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167935377462534214",
    "author": "Nomograph Mastering",
    "date": "2023-10-28",
    "content": "I should have added it was in a damp coalshed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167938270794088538",
    "author": "Eric Martin",
    "date": "2023-10-28",
    "content": "if I’m honest, at the time they went up over the drum kit because I hadn’t used them in years and had just inherited them from my dad and thought I should give them a whirl before doing anything with them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168203823580446811",
    "author": "chrissorem",
    "date": "2023-10-29",
    "content": "I’ve mostly used them in live sound on electric guitars and drum over heads. They always did the trick. In the studio I’ve only used them on Tom’s and they worked",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171629243495628841",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-07",
    "content": "I stand corrected. Turns out I am the weird one. Just seeing that thing makes my hand cramp up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171631125173641246",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-07",
    "content": "Just regular keyboards and mice for me. My hands can't do trackpads for very long either. *Today I learned my hands are bad",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171976005632675840",
    "author": "BatMeckley",
    "date": "2023-11-08",
    "content": "Yup. All the time. On a plane or train not so much. But whenever I get to where I’m going it comes out. \n\nThings like the keyboard and especially the trackpad get so much mileage on em that I find it much easier to replace a Magic Trackpad than get my MBPro fixed.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172230781234585630",
    "author": "Zack Hames",
    "date": "2023-11-09",
    "content": "Yeah, isolation between things is pretty easy to manage even with just gobos. The booths at the studio are great.\n\nYeah, I'm trying to be able to have an amp in another room and play out of my monitors in the control room and have it be reasonably isolated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1173437193310707844",
    "author": "NoahNeedleman",
    "date": "2023-11-12",
    "content": "I’ll be sending you midi to run through that juno soon",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178837055820791818",
    "author": "NoahNeedleman",
    "date": "2023-11-27",
    "content": "Pulled the aux guitars outta the stand to vacuum and they just looked real pretty",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187440195814039663",
    "author": "LAPhill",
    "date": "2023-12-21",
    "content": "Pipe organs walked so synths could run. There's no sound like it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191923404878643210",
    "author": "chrissorem",
    "date": "2024-01-02",
    "content": "Actually the band wanted an intimate  feeling, so I had the whole  band set up within inches of the kick drum. It’s an EDM thang",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1192342195479523379",
    "author": "CMC",
    "date": "2024-01-03",
    "content": "Do they still have all those Sony c55s? If yeah, you ever try em out on a drum? I’ve heard they can sound sweet on snare.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1193758463428399134",
    "author": "Tim O’Sullivan",
    "date": "2024-01-07",
    "content": "I made a stupid little guitar tuner swivel mount for my control room out of scrap.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1193758743918297129",
    "author": "Tim O’Sullivan",
    "date": "2024-01-07",
    "content": "It’s wired to the patch bay. So i can quickly send anything to it. Keep ending up with guitarists sitting on my right though, so i wanted to be able to turn it towards them without a loud distracting Velcro rip sound.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194145064713211924",
    "author": "cian riordan",
    "date": "2024-01-08",
    "content": "Blue light, pop studio on the streets, lava-lamp LFG vibes in the sheets.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195921125977378937",
    "author": "masteredbyjack",
    "date": "2024-01-13",
    "content": "Agreed, looks very cool (also @David Fuller congrats on the new speaks!)\n\n\nQuestion for @EliHeathMusic (or anyone else with a similar setup)…when your synths are way outside the sweet spot like that…are you still able to effectively dial in sounds without going back and forth? Or do you pop into the listening sweet spot every so often when creating to make sure the sounds sit where you want?\n\nAfter working in my current monitoring, I honestly think it would be a huge weapon when arranging to be able to sculpt things really accurately for the arrangement in the sound design stage (of course I only master but just curious)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195956670325608449",
    "author": "NoahNeedleman",
    "date": "2024-01-13",
    "content": "Also, my synths are outside the sweet spot and almost always end up less happy with the sound when I move back to LP. The stereo fx especially. I recently started bringing my headphones with me and I’m more inspired and am able to work quicker",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195957790909399081",
    "author": "popaganda.",
    "date": "2024-01-13",
    "content": "If I’m being honest I don’t love working on synth parts on the side either. It’s honestly an annoying trade-off. I’ve spent the last few days at some studios with big spaceship desks and two screens and keyboards on the desk. It’s so luxurious in a way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203167942561497128",
    "author": "hyanrarvey",
    "date": "2024-02-02",
    "content": "Amps are cool who doesn’t love a wall of guitar amps",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210712419077328946",
    "author": "James Redfern",
    "date": "2024-02-23",
    "content": "Do you happen to use a synth/midi controller as well? If so, have you added a tray underneath or do you keep it on top?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211758626725699697",
    "author": "NoahNeedleman",
    "date": "2024-02-26",
    "content": "Nobody keying in on that $12 Amazon guitar pickup?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1215418227492921484",
    "author": "Zack Hames",
    "date": "2024-03-07",
    "content": "+100 for several coles\n+100 for old drums\n-2 for 421 on Toms\n-0 for not enough kick drum mics, you’re about  4 short \n\n(Any negative comments are a joke, looks sick AF!!)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220411354700316882",
    "author": "sethmanchester",
    "date": "2024-03-21",
    "content": "Tbh I don’t love it or even like it but it came to me this way and the amp is great at a lot of things.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220413506998763690",
    "author": "sethmanchester",
    "date": "2024-03-21",
    "content": "Ha, nothing too crazy, mostly old Fenders, Traynors and Ampegs around here. Lots of weird, fun shit comes thru the door though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221588880718041098",
    "author": "Jonathan Arnold",
    "date": "2024-03-24",
    "content": "What are the PMC 6 doing differently to do ATCs for you? Do you think the PMCs sound too hyped as you compared it to the Airpods.\nI am considering to get 6s also to play my electric guitar through them additionally to mix on them. do you think they work for this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221817770124120265",
    "author": "Jonathan Arnold",
    "date": "2024-03-25",
    "content": "@BatMeckley  What are the PMC 6 doing differently to do ATCs for you? Do you think the PMCs sound too hyped as you compared it to the Airpods.\nI am considering to get 6s also to play my electric guitar through them additionally to mix on them. do you think they work for this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221997229372604517",
    "author": "BatMeckley",
    "date": "2024-03-25",
    "content": "Honestly? Yeah. I found back before I was working in “pro” studios or had minimal inputs we’d actually do that a lot, just program the kick because a sampled kick was better than a shitty kick recorded shitty in a shitty room, and allowed for easier processing of snares and toms. (And then cymbals would often be another pass)\n\nIt requires a good drummer to get the feeling right but you gotta do what ya gotta do",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221999934526591036",
    "author": "peterlabberton",
    "date": "2024-03-25",
    "content": "Yeah, getting cymbals separate is great. I started tracking stuff a lot in layers during covid lockdown, just cuz I had the time and wanted to experiment. Super fun to be able to process a drum kit really heavily when you have that level of control.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1228166201268633632",
    "author": "omarakrouche",
    "date": "2024-04-11",
    "content": "Hey, what keyboard tray are you using here?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1234772348876619848",
    "author": "Berlin",
    "date": "2024-04-30",
    "content": "sans amp is sick as fuck. i have weathered the storm of ridicule since the 90s, just like my doc martens.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1234866896726265898",
    "author": "cian riordan",
    "date": "2024-04-30",
    "content": "It’s a pretty big part of the tone shaping, I find. Especially on transient stuff like snares and drums",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1234888223285579850",
    "author": "hyanrarvey",
    "date": "2024-04-30",
    "content": "I found that sans amp Leeds and I am in love",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237507225262493776",
    "author": "Ross Fortune",
    "date": "2024-05-07",
    "content": "Love the Prophet under the desk. Thinking maybe flip my Prophet 08 desktop module and the M-Audio keyboard that’s under the desk now, replace them with a Prophet 6 or a Take 5…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1238003250301767773",
    "author": "stewart_hidalgo",
    "date": "2024-05-08",
    "content": "I love having the synth in front of me like that and I can use it as a basic midi control.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1238111481623478354",
    "author": "Edward Rivera",
    "date": "2024-05-09",
    "content": "It’s the most amazing thing. Can make any analog synth sound",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242552207413346367",
    "author": "Zeuswayn3",
    "date": "2024-05-21",
    "content": "My roommate just moved out of the house I’m renting in Weho. I’m thinking about moving my studio from the upstairs to the smaller downstairs room. Although the upstairs has more space, managing the temperature has been almost impossible. When the ac is off, you have very little time to record before it gets uncomfortably warm in there. My landlord (who is also an engineer) put in a swamp cooler that was meant for a bigger room in an attempt to manage the temp. Unfortunately, I think this bigger AC creates more humidity as it’s filling up a smaller room than it is supposed to. I got a dehumidifier but it’s not sufficient. \nThat being said, the room I’m considering moving to downstairs has a door that connects to our two-way bathroom with our shower. Would I be better off finding a way to seal the downstairs door that connects to the bathroom and manage the humidity in the bathroom OR should I see if I can manage a better AC/ de humidifier situation upstairs. Any thoughts are welcome - I’ll create a thread as well to not spam the channel. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243948317063249952",
    "author": "chrissorem",
    "date": "2024-05-25",
    "content": "Haha although the dbx 160 did do a little lifting.. I’m not even sure I know how to record an acoustic guitar that sounded so pokey … not that I want to",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243965997879132180",
    "author": "montrose recording",
    "date": "2024-05-25",
    "content": "micing every string on an acoustic guitar and or micing every lug on drums seem like a good starting point",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256704941238648944",
    "author": "hyanrarvey",
    "date": "2024-06-29",
    "content": "The snare mic is, idk if the Tom’s have the same thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256710544476606565",
    "author": "montrose recording",
    "date": "2024-06-29",
    "content": "or “Unlike the filters in your DAW or console, these settings affect Snare Mic’s entire sonic spectrum. “",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1268312595350294662",
    "author": "Tim O’Sullivan",
    "date": "2024-07-31",
    "content": "Your friend has shared a link to a Home Depot product they think you would be interested in seeing.\n\n\n\nhttps://www.homedepot.com/p/Klein-Tools-Premium-Synthetic-Clear-Lubricant-1-Quart-51028/100660159",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278569685335670845",
    "author": "Zack Hames",
    "date": "2024-08-28",
    "content": "Having some character without headaches is the move (like if you have ceiling reflections, they pretty much make everything worse such as cymbals and vocals)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278580194524790784",
    "author": "Eric Martin",
    "date": "2024-08-28",
    "content": "so far, the drums I’ve recorded have sounded amazing, nothing trashy or problematic in the OH, and no crazy flutter from the cymbals, mostly just great sounding drums, with a killer room if I want it, want further away? The mic goes in the completely drywall zero treatment hallway",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278697362650300459",
    "author": "Johnny I",
    "date": "2024-08-29",
    "content": "Adding a cloud to the rear of my room where I track piano, acoustic guitar and vocals. As far as placement over the sources/mics, is there a rule of thumb like mix position (I.e. halfway point between monitors and listening position)?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1288869707130081280",
    "author": "Bryan DiMaio",
    "date": "2024-09-26",
    "content": "also a lamp clipped onto my desk to bias light the monitor",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1294070683344699423",
    "author": "Slow Hand",
    "date": "2024-10-10",
    "content": "Yup! They're very similar in that regard, but still different. You can generally think of RM as the fast version of tremolo (volume modulation), in the way that FM synthesis is the fast version of vibrato (pitch modulation). Both techniques generate side bands through modulation rates that are in the audible range (> 20 Hz).\n\nThe difference between RM and tremolo is that tremolo is a uni-polar modulation and ring modulation is bipolar, which will generate different side bands. I'm a little fuzzy on the math of it these days, but if I remember correctly RM will generate negative side bands which are reflected at 0 Hz and start to travel back up the spectrum, whereas with AM they disappear when they get to 0 Hz.\n\nPop 'em in a frequency analyzer and watch the side bands go! Especially the RM. It's pretty informative.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1294071080062947338",
    "author": "Slow Hand",
    "date": "2024-10-10",
    "content": "Y'all are awakening parts of my brain that have been dormant for over fifteen years. I forgot I knew this shit! Someone ask me more questions about audio synthesis.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1294526335481413665",
    "author": "BatMeckley",
    "date": "2024-10-11",
    "content": "To be fair this started with a joke about how small you are and how it makes sense you’d have a tiny drum kit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1296528597250609285",
    "author": "chrissorem",
    "date": "2024-10-17",
    "content": "Are you using the Modular for fx or synth ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1309632211401576569",
    "author": "Will Pragnell",
    "date": "2024-11-22",
    "content": "Haha yeah I recently realised i’d been doing modular for a similar amount of time. Started with a 48hp mono synth configuration and swore that’s all i needed… now i’m up to a 15U monster spaceship thing 😬",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336050710416195735",
    "author": "SawyerM",
    "date": "2025-02-03",
    "content": "Aren't you worried it's a little crowded? You have a lot of redundant pedals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336061671096979619",
    "author": "Zack Hames",
    "date": "2025-02-03",
    "content": "It may it may not be true, that Boss pedals are all tested + designed through jazz\nChorus amps. \n\n(Roland owns boss, so maybe there’s something there)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336092432122646590",
    "author": "Josh",
    "date": "2025-02-03",
    "content": "Sorry for derailing the thread with my dumb pedalboard meme. I’m extremely jealous of the exposed brick. Are you planning on keeping it somewhat visible?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337971084007440414",
    "author": "Eric Martin",
    "date": "2025-02-08",
    "content": "don’t fret, the 635 is cool as hell, but I’m still in the D190E honeymoon phase, using it everywhere still, but it def replaced 635 on the center drum kit mic, the sausage/wurst/crotch which was where I used the 635 the most besides bass amp, which is the best place for it for me, now",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337973461049409567",
    "author": "Eric Martin",
    "date": "2025-02-08",
    "content": "it’s just a different character, I was used to the 635 as a crotch mic and the D190E feels a little more focused and less broad if that makes sense, the Tom’s pop more, vs having cymbals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340462815433199699",
    "author": "hyanrarvey",
    "date": "2025-02-15",
    "content": "David bendeth has em as his rooms and then kick and snare parallel and vocal parallel. Just awesome",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342177574784335944",
    "author": "Iwan Morgan",
    "date": "2025-02-20",
    "content": "Nice few days tracking this piano again.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342384845699026984",
    "author": "Nomograph Mastering",
    "date": "2025-02-20",
    "content": "Topping D90SE into A90D headphone amp is the best I’ve heard for headphones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361749338971308135",
    "author": "Chase H",
    "date": "2025-04-15",
    "content": "I have  the snare mic and love it (it’s great on guitar cabs too). \nI want to own more of their stuff. What do you have?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362434670733557811",
    "author": "Bryan DiMaio",
    "date": "2025-04-17",
    "content": "now you're gonna have the guitarnet thinking paper towels add tone to the klon",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362493918155112568",
    "author": "NoahNeedleman",
    "date": "2025-04-17",
    "content": "I’ve been tryna have a “pedal board” for 20 years. All I have is a stack of pedals & cables",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362568033670922242",
    "author": "Beck Nebel",
    "date": "2025-04-17",
    "content": "I’ll join in - here’s my lil set up I just started goin on (helps to have a studio mate who is a guitar gear YouTuber)",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1362584980194332905",
    "author": "Beck Nebel",
    "date": "2025-04-17",
    "content": "Is nice to have in one place and not have to pull stuff out when I think of it - which is what I did for years, and then didn’t end up using pedals at all",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362877904375251137",
    "author": "Eric Martin",
    "date": "2025-04-18",
    "content": "my pedals that aren’t part of a gigging board",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1363167170606927982",
    "author": "Abel Koshy",
    "date": "2025-04-19",
    "content": "My setup for this weekend. Coles on my OH and 441s on my snare bottoms!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1364550243621929000",
    "author": "Brian Reynolds",
    "date": "2025-04-23",
    "content": "Love it, wish I got it sooner. It even creates a different feel on pedals that are already tap tempo. Very fun",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1367501980855173270",
    "author": "Sam Segarra",
    "date": "2025-05-01",
    "content": "Sick. I'm often wishing delay pedals had 8th or quarter note swing. Would be sick to have a real analog delay with a drag and swing knob",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376260456943058944",
    "author": "An Hero",
    "date": "2025-05-25",
    "content": "takes up too much space and I don't use it often enough to justify having it front and center. mainly use it during sound design, so i don't need to activate my keyboard midi controller",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377311390632640562",
    "author": "hyanrarvey",
    "date": "2025-05-28",
    "content": "Never seen double kick drum with out the holes so cool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377319945179893863",
    "author": "chrissorem",
    "date": "2025-05-28",
    "content": "They got highly excited and blown up. Honestly it was the he biggest sounding drum kit I might have ever made",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377701053931458662",
    "author": "BatMeckley",
    "date": "2025-05-29",
    "content": "Do you worry about the ac blowing right on top of the guitars?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382493633508413520",
    "author": "louisvie",
    "date": "2025-06-11",
    "content": "You got a favorite brand for guitars ? lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382515853496418376",
    "author": "sethmanchester",
    "date": "2025-06-11",
    "content": "Always wanted to hate Diezel’s becauze of how they look but goddamn this is maybe the most articulate amp I’ve ever heard.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1387104389981802657",
    "author": "Gerhard Westphalen",
    "date": "2025-06-24",
    "content": "I get a lot of questions where people have moved their speakers by 2\" or installed a lamp at the back of the room and want to know if we need to recalibrate... the answer is almost always no",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407396053912911892",
    "author": "M J",
    "date": "2025-08-19",
    "content": "Looks sick, that a zephyr Ludwig snare bottom right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410968130691399731",
    "author": "Brian Reynolds",
    "date": "2025-08-29",
    "content": "https://tenor.com/view/busy-fifidonia-playing-piano-ocupado-gif-15153912",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411064168655618188",
    "author": "youngteam",
    "date": "2025-08-29",
    "content": "Badass! I imagine it’s easier to get clean recordings there than vintage synth museum (which I love)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440465458099785809",
    "author": "chrissorem",
    "date": "2025-11-18",
    "content": "Nice I never had great luck with 44s on piano but the pianos have a lot to do with that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440488530597117963",
    "author": "chrissorem",
    "date": "2025-11-18",
    "content": "I often use Jz bh-1 or c12’s if it’s a really bright piano, I’ll often use  ribbons",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441547713891270656",
    "author": "NoahNeedleman",
    "date": "2025-11-21",
    "content": "Didn’t mean to post three pics of the keyboards but whatever",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452094194075172886",
    "author": "Zack Hames",
    "date": "2025-12-20",
    "content": "Piano movers have been the people I’ve been trying to reach out to for sure. \n\nAnd yes, genuinely, BIG people will make this happen more than…well @BatMeckley said it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461055184162783346",
    "author": "Sam Segarra",
    "date": "2026-01-14",
    "content": "Naw I just meant both input and output buffers from 29 pedals plus the lehle. I assume with a lot of pedals it can be necessary.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469064165531320544",
    "author": "Zack Hames",
    "date": "2026-02-05",
    "content": "It’s more for amp isolations realistically and I’m just working with the space that’s already sort of laid out. That’s a great suggestion though thank you!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]