[
  {
    "id": "1340075731367235605",
    "author": "jordanmcleod_io",
    "date": "2025-02-14",
    "content": "Thanks!! I’ve got it pretty simple over here. Desktop interface/monitor controller is the MT48, and my MacBook is sitting in the storage gap of my desk acting as the second screen. And I’ve got a little 16U rack off to the side holding some gear for production related stuff.",
    "reactions": 6,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1171613925511532554",
    "author": "BatMeckley",
    "date": "2023-11-07",
    "content": "Very very cool studio. Lots of guitars in absurd tunings and an upright piano. Comfy couch on a back wall with at least a foot of treatment. Room sounds (and looks) gorgeous, even without the pmc’s on. Two of my fav guitar pedals on the desk within arms reach. Lots of natural light, chair has the flip up arms which is key for a guitar player. Literally on the same block as one of my fav stores/galleries. Lots to like about this place. \n\nI’m always inspired by rooms clearly made for someone specific. I hate the all things to all people approach, which usually mean “great at nothing specific”. This room is a great reflection of @LAPhill. \n\nFun fact: no monitor controller. Neat.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094600264218062960",
    "author": "Andy Lawson",
    "date": "2023-04-09",
    "content": "Ah gotcha, I’m not sure re ns-10. Haven’t had them up for a while as my monitor controller died a while back and I just ended up on the kii’s. If I move my seat back 2 meters I can feel punch 🤛",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101619721834594405",
    "author": "Tim O’Sullivan",
    "date": "2023-04-28",
    "content": "I love it. I don’t mix on it, and I use an Audient Nero for center section shit. But nice to have a fader to grab, and some utility eq’s. I mostly use my outboard pre’s and those all have little labs attenuators before the console so I have a ton of control over the headroom. I also use it to buss stuff down like kick mics and guitar amps to keep track counts down.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029415674591838278",
    "author": "Nomograph Mastering",
    "date": "2022-10-11",
    "content": "We’re missing Dave’s custom monitor controller that it usually feeds, it’s on the bench for some love",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029449318958125136",
    "author": "Johnny I",
    "date": "2022-10-11",
    "content": "Awesome, seems like a no brainer. As for a monitor controller anything else to look at besides the Grace 905 Analog?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029458714102612018",
    "author": "ALXCPH",
    "date": "2022-10-11",
    "content": "A studio I worked at had the 2400 audio imperium monitor controllers, and they are by far my favs I’ve worked with. Albeit a little pricey",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029492470028976159",
    "author": "Johnny I",
    "date": "2022-10-11",
    "content": "Not even sure I’ll need a monitor controller with the topping; might just stick to one pair of speakers and control volume on the topping. Thoughts on connecting direct?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090353281819226222",
    "author": "Zack Hames",
    "date": "2023-03-28",
    "content": "Been listening and working in this room today for the first time since 2014; honestly sounds pretty amazing. Idk about perfect but it’s definitely a great room and the speakers aren’t bad. Lots of nice things about them, very immersive. Only thing is the monitoring is going through a Neve 8816 Summing Mixer as the monitor controller and I’m not convinced it’s super clean/transparent.",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1171615626612199575",
    "author": "Rollmottle",
    "date": "2023-11-07",
    "content": "No monitor controller…just fixed at one level?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1251268422172409896",
    "author": "Deleted User",
    "date": "2024-06-14",
    "content": "Yes! Set flat. I’m also not using a monitor controller. AES to the speaker. Output controlled at the Master fader from Pro Tools. So I have nothing in between the speaker and everything is completely zeroed out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]