[
  {
    "id": "1428109492112982199",
    "author": "Zack Hames",
    "date": "2025-10-15",
    "content": "It’s official - I am now the proud owner of this SSL 6040 E.",
    "reactions": 52,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1377683291695612054",
    "author": "LAPhill",
    "date": "2025-05-29",
    "content": "Shout out to @Tim O’Sullivan for not only finally solving my hum issues, but dialing in the workflow in my room to a whole other level. He wired up all my pedals, synths, and preamps to a couple of patch bays so I can throw signal all around the room in any order (complete with right-angle cables so I can use them with the desk doors closed). He also built MIDI lines to send clock from my DAW to the pedals and we upgraded the room to Mio MIDI-over-Ethernet units. Several other creature comforts that allow me to think less, like routing a headphone connection underneath the right side of my desk instead of the left where my interface is, adding a second one by the piano, and ready-to-go cables for guitars, synths and microphones already plugged in where they need to be.\n\nI'm going to run out of reasons not to call this studio \"done\" soon.",
    "reactions": 31,
    "attachments": 5,
    "is_pinned": false
  },
  {
    "id": "1016692659756212286",
    "author": "P.K. Stephan",
    "date": "2022-09-06",
    "content": "Hey guys! I am new to the community and happy to have finally taken the jump into the discord after being an avid listener since the beginning.\n\nJust finished building my studio about half a year ago. I run a hybrid setup where everything is always connected and ready to go. All recording paths are accessed via an XLR patch-bay. Mixbus/Mastering gear is controlled by a Dangerous Liaison. Conversion is done via MADI and AES/EBU. Headphone CUE’s are analog and via AVB. I like having everything connected and mic’ed up because I notice that I only use the stuff that I can access quickly while producing/mixing. I went through a lot of trial and error building and working in this studio (been in this location for 1.5 years) so if anyone needs any input I would be happy to help!",
    "reactions": 30,
    "attachments": 5,
    "is_pinned": false
  },
  {
    "id": "1240423254418653214",
    "author": "cian riordan",
    "date": "2024-05-15",
    "content": "I feel like you're gonna wanna put up a cloud above the listening position. And maybe some side gobos. Maybe some behind you too. Also maybe a rack for all the gear. Have you thought of speaker stands for the ADAMs? You know there are better speakers than ADAMs? People really like the Kalis. Do you ever worry about resonances off the rubbermade table? Also whats that ribbon mic pointing at? looks like its just setup in the middle, doing nothing. You should try two mics on the congas... I hear Neumann mics are good for this. Also make sure that ceiling fan is off, could create wierd flutters. Cool studio though, bet it sounds great.",
    "reactions": 26,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277008827065176084",
    "author": "James Redfern",
    "date": "2024-08-24",
    "content": "Tracking a string quartet for an indie-pop record today at @Zach Hughes spot! Great low key studio, and Zach is so easy to work with",
    "reactions": 22,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1012349758565777479",
    "author": "Deleted User",
    "date": "2022-08-25",
    "content": "Never done tweaking or adding but done for now enjoying working in here 🤙🏽👏🏽",
    "reactions": 20,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1014583959994237029",
    "author": "kidcutler",
    "date": "2022-08-31",
    "content": "Neighbor is clearing out his barn, gave me the go ahead to start tracking here 😈",
    "reactions": 19,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1003820665297707008",
    "author": "cian riordan",
    "date": "2022-08-01",
    "content": "Started the day wanting to setup a turntable, ended up decluttering the whole room. @Tyler Graham got his first taste of how much fun troubleshooting a patchbay can be.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086216927736762368",
    "author": "ehutton21",
    "date": "2023-03-17",
    "content": "I don’t think any of the polishing and gear was directly responsible for that, but it offered a level of quality and fidelity that made working feel effortless. There was no wasted time. And the idea of emotional transparency was very much abound: voice memos got played, reference tracks and favorite new ear worm songs got exchanged and the vibe was locked in without much fuss.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116111268986748969",
    "author": "popaganda.",
    "date": "2023-06-07",
    "content": "Tracking w @jantrit today…big vibes in here!",
    "reactions": 17,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1230663111980351539",
    "author": "Zack Hames",
    "date": "2024-04-18",
    "content": "Got a new rack! Much happier with this setup",
    "reactions": 17,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1262926532087648327",
    "author": "Eric Martin",
    "date": "2024-07-16",
    "content": "I have a tracking session tomorrow in here, PUMPED",
    "reactions": 17,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "808469914457341984",
    "author": "Eric Martin",
    "date": "2021-02-08",
    "content": "got my basement setup, tracking guitars today",
    "reactions": 16,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1312253428600148022",
    "author": "nachomaquieira",
    "date": "2024-11-29",
    "content": "Today was a great day. New monitors and new side rack arrived❤️ so so so happy. And this discord has been super informative to make this decisions! No more big desk, moved to side rack, and PMC 6s. So greateful to all of you people here sharing your experience and insight🙏🏽",
    "reactions": 16,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1047956009295032330",
    "author": "Slow Hand",
    "date": "2022-12-01",
    "content": "On Her Majesty's Secret Shortcuts\nLatency Never Dies\nFor Your Eyes Only\nFrom WeTransfer With Love\nThe Man With the Golden Ear",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216207082311778304",
    "author": "James Redfern",
    "date": "2024-03-09",
    "content": "Had fun tracking piano today. 1958 Yamaha U3. Stereo Coles 4038’s, EV635a and a Copperphone down below, PZM room mic on the floor",
    "reactions": 15,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1221969041023959211",
    "author": "peterlabberton",
    "date": "2024-03-25",
    "content": "Tracked drums at the new/temporary spot for the first time over the weekend. Kinda hilarious setup—no kick (adding live drums to dense programmed tracks, so just went with the sampled kicks to avoid shoes in the dryer world), and short a pair of good mics for overheads so did mid side. Actually came out pretty great, and absolutely blew up the snare mic in parallel through my Moog on a track for super distorted huge-ness. 🤘🏻",
    "reactions": 15,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1461641891996242119",
    "author": "sethmanchester",
    "date": "2026-01-16",
    "content": "Day 5 of tracking at Cenzo Townsend’s Decoy and fully loving it. Shout out to @sinaigimenez for the rec",
    "reactions": 15,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "997593814954946631",
    "author": "jordanmcleod_io",
    "date": "2022-07-15",
    "content": "hard to fit it all in one pic! my “day job” is transferring old tape reels for the purpose of archiving and potentially releasing unreleased music from artist. from mono 1/4” up to 24 track 2”. also transfer anything from cardboard acetate disc from the 1930s to DATs, DA-88s, cassettes and everything in between.",
    "reactions": 14,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1048355880174891099",
    "author": "cian riordan",
    "date": "2022-12-02",
    "content": "Are you aware how much lag you’re encountering w the Bluetooth trackball?",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064301404715483137",
    "author": "popaganda.",
    "date": "2023-01-15",
    "content": "Showing off my rack because I got rid of all the bullshit I don’t need and now it’s just solid essentials.",
    "reactions": 14,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1175943166482972733",
    "author": "Adam Thein",
    "date": "2023-11-19",
    "content": "Grabbed a tiny loveseat and swapped out my massive 14u grundorf rack with this Etsy special 6u side by side to save some floor space.  Feeling a little less cramped in here!",
    "reactions": 14,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1285164471131701250",
    "author": "Chad Rodgers",
    "date": "2024-09-16",
    "content": "Working from my mate’s WIP space for the next few days (North Shields, UK). Waldo’s going to be keeping me company whilst I have fun with the SSL desk and BG2.",
    "reactions": 14,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1369471418269438062",
    "author": "Tyler Graham",
    "date": "2025-05-06",
    "content": "$600 to track some guys jazz record… pay day!",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082084277421871160",
    "author": "oaklandmatt",
    "date": "2023-03-05",
    "content": "Vocal comping on the plane. Trackball and numeric pad for the editing. Brad Pitt being hot in the background for the inspiration to greatness.",
    "reactions": 13,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1139572325545672714",
    "author": "Adam Thein",
    "date": "2023-08-11",
    "content": "My buddy came over last night that lives around the corner and we lost track of time listening to music for 3 hours.  The whole time I wasn’t thinking about the room or the speakers or frequencies, we were just lost in the songs and the productions and the arrangements, jumping around genres and eras and hearing all the huge contrasts in things and man I haven’t felt this sort of draw to just listening to music in a LONG time, and I’m stoked to get to work within a frame of reference like this.  I hope the feeling doesn’t fade but right now it’s really special.  Get your room sorted out folks that is worth every penny",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1184188633343864844",
    "author": "nachomaquieira",
    "date": "2023-12-12",
    "content": "Tracking drums+bass. Loving the SSL4000 preamps+eqs, and also using the obsidian, vari-mu and 11776's +some Neve 1064 preamp+ pultecs for the bass. Great rock sounds!",
    "reactions": 13,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1245886058772566056",
    "author": "SoundsLikeJoe",
    "date": "2024-05-30",
    "content": "Change over is complete.  Have one more patchbay for the inserts on order...  but the rest is done and ready to start tracking.  Busy schedule in June already. This is going to be a fun setup to work with.  Time to re-open.",
    "reactions": 12,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1457155400716521615",
    "author": "Zack Hames",
    "date": "2026-01-03",
    "content": "Progress for now - gonna go party then come back and get the faders and meters on 🔥 \n\nThanks everyone for all the advice and support through this! \n\nThe coolest thing about today was how many friends I had who took time to help or be a part of this. Genuinely I have a community in my city and I will never take it for granted again.",
    "reactions": 12,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1035038678357131274",
    "author": "David Fuller",
    "date": "2022-10-26",
    "content": "let's be honest, gentlemen: bashing your head on a latch lake counterweight is a rite of passage for anyone who tracks anything ever.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073534809130946623",
    "author": "peterlabberton",
    "date": "2023-02-10",
    "content": "Babysitting/demoing an EQ and compressor that my dear friend Raphael Peterson designed and built (@oaklandmatt Raphael of Dizzy Balloon!). Bottom two are the same stereo compressor: diode bridge with some special other thing going on in the circuit that I can’t remember at the moment. Attack and release work kind of like the UnFairchild—the “speed” control sets the general range, and then you can fine tune. Top is a Pultec inspired tube EQ with a unique mid band: instead of selecting the frequency and Q, you select the bottom range of the band and the top range of the band with the “corner” controls. You can also turn it into a low or high shelf with the “curve” control. It can do really bold moves; I think he said it can boost up to 20dB, at least on certain bands, and just playing around it can do a lot. I’ve only just given them a rough run through but they are so far very very cool! (Plus I love the hand written controls.)",
    "reactions": 11,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1320562042461229168",
    "author": "Chase H",
    "date": "2024-12-22",
    "content": "Finished with my Gerhard build (still need to add a couple clouds to the back half of the room where more tracking happens, but that will be a while).\n\nTo say the  change is massive is an understatement. When I get more time soon I’ll post some pictures of the build and a write up ( if it’s not just pointlessly clogging this channel and people are interested)\n\nIf anyone is serious about getting their room in a much better position and hasn’t spent years studying acoustics I highly suggest hitting up @Gerhard Westphalen",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341584266697637948",
    "author": "Eric Martin",
    "date": "2025-02-18",
    "content": "things are really coming together, just a few things left to tidy up, and some decor lights because I didn’t plan that as well as I could have.\n\nTranslation is better than ever - on Saturday I met a collaborator to discuss finishing a record that’s been in the works for the last year. She works at a Donut shop, we had a coffee and listened to the record in front of all the customers in the shop on the PA -apparently she does this often as we’ve been working on it- and I felt like the record was mostly done and I haven’t even started mixing yet, just tracking mixes.",
    "reactions": 11,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1071604196878581841",
    "author": "Calvin Lauber",
    "date": "2023-02-04",
    "content": "At Altamira sound tracking some drums over the weekend, such a sick spot",
    "reactions": 10,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1179557728365068428",
    "author": "cian riordan",
    "date": "2023-11-29",
    "content": "Follow up to #trackpad-talk… I finally got the little thing to join the keyboard and Magic Trackpad… it works really well and feels really solid. It’s actually nice to have the trackball as well… sometimes I find detailed mouse editing moves are quicker on the ball than with the slight lag on the Bluetooth trackpad.",
    "reactions": 10,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1185271066701086730",
    "author": "Rollmottle",
    "date": "2023-12-15",
    "content": "You’re never gonna make it in this business with only 4 speakers.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366242328812982316",
    "author": "chrissorem",
    "date": "2025-04-27",
    "content": "iPhone 13 > electro voice 635> xlr>1073> retro 176. Making hits",
    "reactions": 10,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "873788497113260042",
    "author": "jantrit",
    "date": "2021-08-07",
    "content": "Here’s my home built attack wall! This thing is just amazing, changed my mixing life absolutely. Came to be when I was looking for a portable solution, working in this rented space. I didn’t want to invest in a proper build out and loose the space so everything here can be packed up and moved if need be (well it’s a bit more complex now that I’ve filled the space over the last year and a half haha) but it would still be possible to move the whole rig if need be. These are some older shots, been tweaking the space since then and I’m very very happy with the results. Never heard these a7x’s as clear and I’ve been using them for the last 11 years in 6 different rooms. Looking at getting something with a little more power for the room soon!",
    "reactions": 9,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "917457909636550718",
    "author": "Eric Martin",
    "date": "2021-12-06",
    "content": "What’s the saying?\n\nA man with a watch always knows what time it is, a man with two watches is never quite sure.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164757800149323836",
    "author": "Eric Martin",
    "date": "2023-10-19",
    "content": "my piano tracking room for the next two weeks",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1172653469782528040",
    "author": "Bryan DiMaio",
    "date": "2023-11-10",
    "content": "No way! Tube Tech made a clone of the Warm Audio WA1B??",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182050302518640742",
    "author": "peterlabberton",
    "date": "2023-12-06",
    "content": "Still likely many, *many* months away from breaking ground on this project, but just got the first round of plans for what will eventually be my super badass amazing sounding mix room. Will be living in this ADU in my backyard and working in “bedroom 2”. The financial justification for this whole odyssey is that we’ll have a finished 2 bedroom legal unit at the end of it all if and when we sell/rent this spot out, hence the basic design as a “bedroom”. @Gerhard Westphalen is helping and I’m super excited to eventually get everything dialed. @cian riordan had the great idea of including tie lines to the living room space, which I’ll def be doing for tracking flexibility. I’ll also, per Gerhard’s recommendation, be covering up those two little alcoves next to the windows so the front wall is all flush (these weird cutouts for the windows are required for property line setback/emergency escape reasons, but there’s nothing but a fence and our neighbor’s yard on the other side, so whatever).",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1182050440729333821",
    "author": "montrose recording",
    "date": "2023-12-06",
    "content": "first gear installed in the new space.  wild hanging rack (back half of room)  looking to fill that slot with a MAS if anyone has one theyre trying to sell!",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1196138420670578848",
    "author": "Nacho Sotelo",
    "date": "2024-01-14",
    "content": "Tracking here today, Valenzo Studios in México City",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1311824514820214836",
    "author": "onanisland",
    "date": "2024-11-28",
    "content": "found an old picture of v1 (during the build) in another discord, I'm still minimalistic though not much to see tbh unless I'm tracking. Just got nostalgic, having read today so many people building their rooms. I wish you all the best on your journey to having your rooms sounding as good as they can! It's a tough endavour but totally worth it in the end. ❤️\n\nWhat I'm most proud of, is the fact that all the rooms were built by myself & a friend. Didn't hire any construction crew. 😄 I'm hoping this can inspire some of you who are in the process.",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1019657655716950047",
    "author": "cian riordan",
    "date": "2022-09-14",
    "content": "how i feel mixing the LWMR collab track w/ stock plugins",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1024775104837730445",
    "author": "ehutton21",
    "date": "2022-09-28",
    "content": "So, to update this: spent most of my time being a runner and doing runner things. We had an issue with an inadequate scented candle, so to target we went. Had to find a nice vegan friendly restaurant open at 11:30 PM which was a fun task. The engineer who ran the session is one of the few I’m chill with, so he very briefly introduced me to swizz as “Evan, the runner who makes some dope synth pop” (alicia was warming up, but swizz was real down to earth and nice. very focused) and i actually got to catch a couple glimpses of what they were doing in the studio when I wasn’t calling restaurants and polling my vegan friends for food recs. We actually spent more time communicating with engineers out East to get files fixed and communicating with a personal assistant of some kind who stopped by before to make sure things were going smoothly. \n\nAll that to say what little I did actually see was sick. Swizz goes crazyyyy on an MPC, man. Wow. That was fun to hear.\n\nAlso @cian riordan was right. I’ve never heard our nearfields work that hard like ever. It was belligerently loud. Fletcher-Munson be damned lmao. I’m sure they fired up the bigger shit when I left (unfortunately running does not pay the bills, or anyone really).",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237103741765685419",
    "author": "sethmanchester",
    "date": "2024-05-06",
    "content": "24 channels of 1064s and a bucket of 24 channels from Leon Russell’s API today 😅",
    "reactions": 8,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "982709586026962984",
    "author": "peterlabberton",
    "date": "2022-06-04",
    "content": "So far I’m using the S1 to:\n\na) have hands on control when mixing drums, as I’ve got a handful of parallel compression and distortion auxes. I’ve made it work with a keyboard and mouse, but being able to have one hand on an audio track fader and the other on the return of a parallel effect is great.\n\nb) setup VCAs for my whole mix and, once I’ve got things in a good spot, close all the pro tools windows so I’m more focused on just listening, and play the mix back and write automation.\n\nThese are both just things I’ve missed about working on a console, and I’m glad to be able to reincorporate them into my workflow.\n\nAnd to put the EQ on, I sent my main PT output to a virtual output, and have the EQ on there in Console, assigned to the monitors.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993810258122256435",
    "author": "Shadowherb",
    "date": "2022-07-05",
    "content": "one-mic drum sound with Willow River mic (Royer 121 clone), Gates mic amp, Dyna-Mite compressor",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1046249094970085586",
    "author": "itaylerner",
    "date": "2022-11-26",
    "content": "I’ve heard this preamp is super transparent 🤓",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1086079476204589117",
    "author": "popaganda.",
    "date": "2023-03-16",
    "content": "Also if you’ve never seen a killer cut a record you really need to",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1133776595044274326",
    "author": "chrissorem",
    "date": "2023-07-26",
    "content": "It was a fun session but a bit crazy too! I got the whole band patched in mics up literally 2 mins before they did a take. No getting sounds and tweaking shit, juts throw it up and go. Hit record and then Ross Hogarth calls and says he’s at the front door so while the first take was tracking I ran to the other door to let him in. My eyes were sweating",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171568935326453820",
    "author": "cian riordan",
    "date": "2023-11-07",
    "content": "Keep that outboard locked up... I wouldn't trust him either.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172016416619233350",
    "author": "Slow Hand",
    "date": "2023-11-08",
    "content": "I’m a huge trackpad advocate. I hear everyone discussing wrist problems with their mice and trackballs and keep wondering when y’all are gonna catch on. I’m exclusively laptop trackpad and couldn’t be happier.\n\nAnywho, to your last point, if the trackpad ever starts to feel loose or loses it’s “pop” I’ve been able to remove the back plate on my laptop and re-tension the trackpad with a small phillips-head. Super easy.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301260674877493268",
    "author": "sethmanchester",
    "date": "2024-10-30",
    "content": "Really enjoying day three of tracking with this ol’ buddy. Just makes you think differently and commit more… always a nice reminder",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1428759871574249526",
    "author": "chrissorem",
    "date": "2025-10-17",
    "content": "It’s going to be like using the ssl channel strip on every track!",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030959472136437850",
    "author": "ryount",
    "date": "2022-10-15",
    "content": "I’ve gone through a few iterations of the screen/desk tweak, kinda settled on this sound anchor cart. I do wonder if the rack behind it makes much of a difference. Hard to A/B because it kinda involves re-wiring everything.",
    "reactions": 6,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1103595592699088966",
    "author": "stefanmacc",
    "date": "2023-05-04",
    "content": "Looks like it went “MARVELOUSLY WELL” 😂 … curious how you like those little labs la2a comps ?",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106781019941638224",
    "author": "Andy Lawson",
    "date": "2023-05-12",
    "content": "Update. Got Covid this week so had to cancel my tracking. Kept going with the re build stage 2 when I had the energy. Got all the main clouds built and up. A bit of Jiggery pokery still needed to make them look flush but want to be able to adjust height for the moment. Putting clouds up by yourself is one hell of a job!!!!!! Had another listen (my ears are pretty messed up right now as the Covid has moved into more of a head colds now) and it is a massive change. Imagining is massively different, vocals also floating in the middle like I haven’t heard before. Defo more presence in the lows 100hz or so. Haven’t run a sweep yet as I want to hear it with my ears working first (otherwise it will cloud my thoughts). I’m mixing all next week so I’ll get a chance to listen see how it translate etc",
    "reactions": 6,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "1164564503657185320",
    "author": "Ross Fortune",
    "date": "2023-10-19",
    "content": "Note rear speakers ziptied to speaker stands ziptied to synth racks, just like the pros.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171956566484865054",
    "author": "cian riordan",
    "date": "2023-11-08",
    "content": "I dusted off my Magic Trackpad and have been using it since the conversation yesterday and I have to say, my wrist feels alot fucking better.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179959679942660106",
    "author": "john",
    "date": "2023-11-30",
    "content": "All i'm saying is Kuk harrell and Ayo juan uses the trackball for the computer",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182456881369841684",
    "author": "Skyler Young",
    "date": "2023-12-07",
    "content": "I used to be an engineer employed by a big producer. During sessions people would just grab food when they weren’t needed but obviously I was always needed. So I would never eat for like 12 hours every day and would always feel like fainting by the time I got off. Basically never had two hands free long enough to open my energy bars. One day the producer was like “you don’t really eat much do you?”Closest I ever came to bursting into tears in a session",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195904893672751254",
    "author": "cian riordan",
    "date": "2024-01-13",
    "content": "Fun to see a lot of the hivemind reductions here come to fruition in various forms. The cinder block stands for the baby Gennies buys you a drink whenever we meet.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1227305801371353099",
    "author": "hyanrarvey",
    "date": "2024-04-09",
    "content": "The real flex is every rack gear cian owns is like 4+ u",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340075731367235605",
    "author": "jordanmcleod_io",
    "date": "2025-02-14",
    "content": "Thanks!! I’ve got it pretty simple over here. Desktop interface/monitor controller is the MT48, and my MacBook is sitting in the storage gap of my desk acting as the second screen. And I’ve got a little 16U rack off to the side holding some gear for production related stuff.",
    "reactions": 6,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "809643304958165053",
    "author": "oaklandmatt",
    "date": "2021-02-11",
    "content": "i compress. sometimes a lot. often with compressors. everyone is accepted here.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "823674766451540009",
    "author": "peterlabberton",
    "date": "2021-03-22",
    "content": "My lil studio in full tracking/mess mode 🙂",
    "reactions": 5,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1036814457566937129",
    "author": "peterlabberton",
    "date": "2022-10-31",
    "content": "Tracking toms today, just set these suckers up right by my mix position so I didn’t have to share a screen/run across the room all day. Chandler mic multed to my Moog Grandmother, getting distorted there, and then that gets multed and sent to a delay pedal with spring reverb, all recorded separate. And the stereo ribbons in for some extra space. Always fun to make the most out of repurposing the gear I have while tracking drums! (Or tracking whatever else!)",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1046196441019846696",
    "author": "Zakhiggins",
    "date": "2022-11-26",
    "content": "Hahaha its actually on a working farm in the Dublin mountains, you'd never know it was a studio from outside",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1072388042196799488",
    "author": "Slow Hand",
    "date": "2023-02-06",
    "content": "Still disappointed we never got to see him mount a mattress above the mix position.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095117379207442532",
    "author": "BatMeckley",
    "date": "2023-04-10",
    "content": "It’s a longer conversation than for discord, but for me it’s become irreplaceable. (I’ve got the field). I’ve been at this so long I find often that muscle memory kicks in and I reach for the same boring shit.  You don’t drive an op1 like a bus, you ride it like a wave, and as such it’s constantly taking me places I wouldn’t have normally gone. Also, as I’ve tried to be more mobile, it just does so many different things well enough that it solves a ton of problems. Like the other day I had Ryan from State Champs over and the power went out and we used the built in mic and four track to basically compose and track a good 75% of the tune before the lights went on.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1163087613339631616",
    "author": "Josh",
    "date": "2023-10-15",
    "content": "Put this in gear talk like a dummy. This is the church gig today. It’s the MD’s rack so I haven’t yet encountered a church purchased CL 1b but I’ll keep searching.",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1182486107334647939",
    "author": "cian riordan",
    "date": "2023-12-07",
    "content": "LIfe goal is to someday have a live room big enough to have a video track just always available",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1247436091959541841",
    "author": "peterlabberton",
    "date": "2024-06-03",
    "content": "Okay I have a crazy notion that I want you all to roast me for: I spent a week in a dingy windowless studio last month and felt so productive and loved it. Admittedly a lot of it was putting on my old tracking engineer hat and getting to hang with a band and make a record that way (my fav), but it had me wondering whether I might want to get some kind of super window blackout option so I can get the cozy cave vibe if I want. Bright and clean is neat, but what about warm and cozy and focused?! Shut out that pesky outside world!",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370058570418098328",
    "author": "Bryan DiMaio",
    "date": "2025-05-08",
    "content": "everyone here is building themselves into their own windowless, padded rooms so.... it tracks",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428238844238495877",
    "author": "Zack Hames",
    "date": "2025-10-15",
    "content": "Assuming it doesn’t break on me quickly, I think it’ll be worth it.\n\nIm dedicating 2026 to time management and speed. This will be at my home studio and I won’t be going between 2 studios constantly. I’ll be able to really set up shop 100% and just work. All of my instruments, amps, outboard gear, mics, living in ONE place that is a a staircase away from my bed.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984948540155494430",
    "author": "ehutton21",
    "date": "2022-06-10",
    "content": "narrator: it was at this point, in patchbay maintenance, that our hero knew he would not leave on Friday before 5:00 PM",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1000916713803624601",
    "author": "youngteam",
    "date": "2022-07-24",
    "content": "degen tracking / production ||bed||room with a lovely null at 80hz",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1024524604116586506",
    "author": "cian riordan",
    "date": "2022-09-27",
    "content": "Fun story, I got to hang with Stu White w/ Matt R. last year and he was talking about how he used to be AK's engineer... I was so enamored because I'm a HUGE SB fan and he kept talking about when he worked with him in NYC, it would be PUNISHINGLY loud in the studio with him. Like, everyone likes things loud, but Stu full on was like I would never be in a studio with him again without ear protection",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029415918113144872",
    "author": "Nomograph Mastering",
    "date": "2022-10-11",
    "content": "Ssshhhh about the Topping tho, I’m happy for the competition to be using Dangerous and Mytek and other nonsense 🙂",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072250856763830362",
    "author": "Calvin Lauber",
    "date": "2023-02-06",
    "content": "Vocal mic shootout today between Josephson C725, vintage AKG C12 , Josephson C716. All going into Neve 1272 pres and 1176. The 725 and C12 were both very strong contenders but we leaned C12 for their voice.",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1085984228744904824",
    "author": "JakeTB",
    "date": "2023-03-16",
    "content": "Setting up your speakers and panels, if you have the time, seems like the one place to lean into that OCD. Spend half a day getting it right and then *never ever think about it again*",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086013351269769228",
    "author": "Will Melones",
    "date": "2023-03-16",
    "content": "It's also important to remember that your studio is in your living room, and how DARE you use the devil's math to make it look decent for yourself and those you live with. You're probably one of these lunatics who uses a bubble level to hang pictures! ...Not everybody breaks out in hives at the sight of numbers. Some might even major in corporate finance. More power to you for doing it the way you wanted. I honestly never even considered this an \"impacting the quality of work\" thing, but more of a \"do it right because you can\" thing.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086051613950623775",
    "author": "LAPhill",
    "date": "2023-03-16",
    "content": "Something that's worked pretty well for me is to not worry about fret noise, squeaks, finger buzz, etc., until it pulls you out of the song. As in, don't go surgically cleaning up your tracks until you hear them in context and see if something is poking out in a bad way. Humanity is almost always a good thing in a record and removing all those little imperceptible things can make a performance feel lifeless. And if that's what you want, maybe just use samples?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088249875470237848",
    "author": "jonmatteson",
    "date": "2023-03-22",
    "content": "I’ve never had much treatment before and it is incredible how much better the imaging is and how much more apparent balance decisions are. Can’t imagine how much clearer things are in a “perfect” room!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088969137860120637",
    "author": "Chris Doms",
    "date": "2023-03-24",
    "content": "You’re on some other shit dude I love what you’re doing. Got to hear a sneak peak followed by some of your other tracks, really cool bold stuff",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089228281401851994",
    "author": "BatMeckley",
    "date": "2023-03-25",
    "content": "I brought cian a db meter that also flashes a red sad face whenever he mixes. As a gift.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094035559862771763",
    "author": "Rollmottle",
    "date": "2023-04-07",
    "content": "i have no dog in this fight. i could give a fuck about NS-10's. BUT, i don't believe there is an agreed on objective set of criteria that defines what good is, especially as it relates to pursuits that are inherently subjective. speakers, guitars, outboard, movies, art, video games, whatever....",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094037373794385940",
    "author": "popaganda.",
    "date": "2023-04-07",
    "content": "Can I interject and steer the convo in a direction that might help some of the lurkers? I tried to throw ns10s into the mix a few years ago and they really confused me. But I can't deny that my heros made great shit on them. There seem to be 2 common denominators I've seen for ns10 people. Either you came up in big studios and they were always there as a reliable reference and you learned them over time. In this context part of the sound of the ns10 is actually the desk reflection. Or you learned from a mentor who worked on them and picked up all the voodoo tricks that helped make them translate. Anybody who had a real mentor likely understands ns10s because they were ubiquitous to genX and before. I'm trying to understand if there's any use to a 25 year old now who's never been in a big studio or had a mentor and wants to do good work. I was the first to discourage someone from getting them yesterday in monitoring. Was my take wrong?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107114255817383977",
    "author": "arjunrao",
    "date": "2023-05-13",
    "content": "Been tracking drums for the past few weeks in my room - things are feeling pretty great even though the spot is small",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1109203575185346642",
    "author": "masteredbyjack",
    "date": "2023-05-19",
    "content": "This is my new one that’s getting finished up now! Had a woodworker build it. But I bet there are similar small things around that don’t have the rack if you don’t want it or need it\n\nHave seen people have success with some small Amazon rolling ones, maybe I’m crazy but I noticed something pretty cool like that in an @Edsel Holden IG story",
    "reactions": 4,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1109876984198205471",
    "author": "Ross Fortune",
    "date": "2023-05-21",
    "content": "The very one @hyanrarvey \n\nIt’s a gold Dalcon, formerly at Ocean Way I believe? I’ve hazy memories of but I think Beck - Seachange was tracked on it, maybe mixed too. In Rainbows as well? Don’t hold me to any of that",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116134585852497920",
    "author": "popaganda.",
    "date": "2023-06-07",
    "content": "I think Ruairi will like that we’re all tracking vibes in a room together",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139555619968401458",
    "author": "chrissorem",
    "date": "2023-08-11",
    "content": "I just found these photos of my studio build. I promised my self I’ll never drywall again. 60,000 lbs of drywall and the photo on the right is 3ft of bass trap hangers a total of 21 hangers at the back of the control room and then of course the echo chamber behind that 🙂  anyway to anyone working on their build out keep it  up! Soon you will be working in that room and you’ll forget about this madness",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1145883041995178026",
    "author": "BatMeckley",
    "date": "2023-08-28",
    "content": "Best vocal compressor they make. Hands down. A very not straight forward piece of gear. The coarse and the fine gain knobs on the preamp act more like the two channels of a Marshall plexi. \n\nWill 💯 be my new travel rig. And at home I’ve already think that I like using it as a hardware insert backwards, as in going in to the comp first and THEN into the pre and eq.\n\nVery immediately satisfied. This is how getting gear should feel like",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1149787754079723619",
    "author": "Nomograph Mastering",
    "date": "2023-09-08",
    "content": "I’ll never forget the time I mixed up string day and G string day",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168260030966026371",
    "author": "Gerhard Westphalen",
    "date": "2023-10-29",
    "content": "This was my first setup in 2010. All based around the Clavinova. I wanted one since I was 6 or so and then my parents parent promised to get it once I finished a certain level of the royal conservatory. Managed to record into it and then get that off into a computer. Eventually got a laptop and interface. Was a Presonus firewire one and my laptop wasn't happy with that. I remember many months of getting PCMCIA cards to try to et it to work without dropouts but never did and eventually got a computer from Rain Computers (anyone remember them?) with an old RME PCI interface",
    "reactions": 4,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1182396477826420786",
    "author": "cian riordan",
    "date": "2023-12-07",
    "content": "Especially tracking sessions when you know the next 8-18 hours of your life are going to be completely out of your control.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186577237856751739",
    "author": "Barbara",
    "date": "2023-12-18",
    "content": "I only have good things to say about the umt70... I'd say it's different than the m930, I would even risk to say that it's more.... exciting.... but I'm not sure if that is the word I'm looking for (forgive me, it's 7am and I haven't had my coffee yet). Either way, usually, I tend to use the m930 whenever I'm going for a more straightforward approach, it works 99% of the time. The umt70, doesn't always work, but it does a really good job in sources where the midrange could be a problem for me, in some context.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341458868915671081",
    "author": "Rob Domos",
    "date": "2025-02-18",
    "content": "Fuck I like Neves more than APIs do you think it’s worth starting over?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352647568202403901",
    "author": "herbie",
    "date": "2025-03-21",
    "content": "i usually leave the live room door open to the kitchenette/main lobby area and throw a stereo pair of the crown pzm boundary mics on the floor there. they’re usually going through the distressors for that too. the kitchenette has some nice tall ceilings for a cool room sound",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1378931388975153183",
    "author": "Zack Hames",
    "date": "2025-06-01",
    "content": "Think I’m passing on the Harrison MR2 54 channel and going for the SSL 6040 E, it should be reasonable for my home studio",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428762162356162833",
    "author": "Zack Hames",
    "date": "2025-10-17",
    "content": "I still haven't found a plugin that does the SSL Bus Comp as well as the real one either.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461896228597010584",
    "author": "chrissorem",
    "date": "2026-01-16",
    "content": "Never sold a thing in my life except my soul",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808479365754257418",
    "author": "dumlords",
    "date": "2021-02-08",
    "content": "Current setup and also a couple of my favorite guitars.  Peavey T40, Dan Armstrong lucite model, 60s Hagstrom III and a 60s Yamaha SA15.  I need more mics and preamps y’all!!",
    "reactions": 3,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "808926799856795738",
    "author": "Preston Lull",
    "date": "2021-02-09",
    "content": "Make sure to find a good luthier and get it set up well! Get it intonated (saddles, and nut height so you’re not pulling the strings out of tune in the first positions) and get the neck adjusted and action set. \nget it feeling GOOD to play.\n#1 reason people don’t continue with guitar is that the setup on their guitar is wonky and they never even knew, they thought it was just hard to play",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "809941962059808768",
    "author": "Eric Martin",
    "date": "2021-02-12",
    "content": "I do all sorts of audio related things, compression is a tool, but you know, sometimes when an inexperienced builder uses a hammer they leave a dent in the wood around the nail that they're trying to use to secure something, that's what a compressor can do.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047241729314652190",
    "author": "peterlabberton",
    "date": "2022-11-29",
    "content": "My buddy Gabriel Shepard (who was making records with Cake when I was listening to said records in middle school) went to some audio school in SF in the 90s where he was told to *never* use condensers on drums. Glad to see you are a true rebel. Better put some swanky ass condenser on the snare to continue the theme.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062150540911448084",
    "author": "cian riordan",
    "date": "2023-01-09",
    "content": "Pretty sure i have carpal tunnel from the combination of wrapping cables and using a trackball.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085977979684929727",
    "author": "ALXCPH",
    "date": "2023-03-16",
    "content": "I think it just comes down to getting work done despite the gear not because of it. \n\nGear is great, gear is fun, gear is informative Anyone should buy as much gear as it takes to fill ones desire as long as it doesnt get in the way of doing the work. \n\nSpending a few hours Changing things around to make what ever work you are doing easier is never a bad thing. \n\nAs long as we arent neglecting our passion because of some false belief that our desk is too Big or our monitors have the wrong logo on it, i Think well all be just fine.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086098950559371334",
    "author": "LAPhill",
    "date": "2023-03-16",
    "content": "Even if you have. Watching the top dogs work will never not be inspiring or a big chance to learn.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107037793579966586",
    "author": "Gerhard Westphalen",
    "date": "2023-05-13",
    "content": "As someone who never used headphones outside of travelling, the pros made me start using earbuds around the house",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116563349539401780",
    "author": "David Fuller",
    "date": "2023-06-08",
    "content": "Joining the tiny desk gang soon! Just bought one of those 1 rack wide Zaors.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128406877122863185",
    "author": "LAPhill",
    "date": "2023-07-11",
    "content": "@Eric Martin probably a little (or a lot) out of your budget, but my old boss had this really ingenius gobo setup. He had a system of floor-to-ceiling sliding panels on a track that could divide up the room in all sorts of configurations, making nearly completely isolated rooms-within-rooms. You can see it in this video at 4:30: https://youtu.be/7YnGlhEFoDA?t=267",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156705095627583518",
    "author": "NoahNeedleman",
    "date": "2023-09-27",
    "content": "Christmas Tracks all delivered by end of August 🙌🏻",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172230121164394527",
    "author": "Nomograph Mastering",
    "date": "2023-11-09",
    "content": "This is similar to my experience, people get hung up on it and think it’s necessary or even essential. But having spent the money they realize the isolation inspectors never show up and the clients care more about the Wi-Fi and coffee",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199521440555348008",
    "author": "BatMeckley",
    "date": "2024-01-23",
    "content": "I long for the day I can say I’m a guy you can count on if you need to track a drum and tuba improv. That’s just rad.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1235321642104782930",
    "author": "masteredbyjack",
    "date": "2024-05-01",
    "content": "I'm being serious -- people who are resourceful, creative, and can write and communicate effectively I think is something that can never go wrong, and is not all that common to have together in a single human",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277324406305062953",
    "author": "chrissorem",
    "date": "2024-08-25",
    "content": "Installed a second AC system yesterday so I can run a single AC for the control room and not have to cool the rest of the studio when not in use( mixing days).  This a picture of the crawl  space where the  AC mufflers live, I hope I never have to go up there again but this might be interesting for some to see",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1284629295129563216",
    "author": "Ed Sokolowski",
    "date": "2024-09-14",
    "content": "grabbed the dangerous source controller as a quick fix for something 1 rack space deep. and despite having a new £17 pot, L and R are still 1.5dB out of balance 🤦🏻‍♂️",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410373861496721428",
    "author": "jantrit",
    "date": "2025-08-27",
    "content": "Large latchlake fan here, yeah they’re pricy but every single one of those big ultimate stands I know of in the wild have at least one part broken. \n\nThe latchlakes have never failed me, even a bunch that have spent their lives being beat by students at a school!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428346749411655892",
    "author": "Zack Hames",
    "date": "2025-10-16",
    "content": "40 channels of ssl eq, comp, and gates are going to be far more useful than many other things. I genuinely love this eq. SSL Plugins don’t come close enough imo.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469367127470375139",
    "author": "hyanrarvey",
    "date": "2026-02-06",
    "content": "Don’t use em anymore now on the lil ex machinas but every single thing on the ssl works perfect now",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "832623585415790624",
    "author": "Eric Martin",
    "date": "2021-04-16",
    "content": "I’ve used it on vocals all the time.\n\nIt has the harmonic Neve character that you’d expect. The 1176 is a nice thing to have right there in the same box, but I don’t love that there isn’t a separate output for the pre and input for the comp, it makes dialing in the amount of harmonic character and compression interdependent.\n\nThe overall output control is noisy if the dual isn’t set perfectly in this one spot, which is also annoying, I’m saving to upgrade to a pair of Great Rivers and another distressor instead of the 1173.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "843206377619062784",
    "author": "Eric Martin",
    "date": "2021-05-15",
    "content": "expanded my rack recently adding a pair of Great River pres that I got at really good price",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "886610227724693544",
    "author": "Zack Hames",
    "date": "2021-09-12",
    "content": "On my honeymoon in Disney world, Aerosmith ride. There was also a neumann U87 just chillin. Cracked me up",
    "reactions": 2,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "922638909509365788",
    "author": "Eric Martin",
    "date": "2021-12-20",
    "content": "finally got the patchbay up and running and the grounds troubleshot for low noise, half-normalled and ready for a session",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "959884791497490442",
    "author": "oaklandmatt",
    "date": "2022-04-02",
    "content": "i actually don't use it 😂 i bring it because when i plug it into someone else system, some people hate the trackball",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984925340524744764",
    "author": "ehutton21",
    "date": "2022-06-10",
    "content": "today’s view: courtesy of studio A needing the patchbay cleaned",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1028762925319598140",
    "author": "Rollmottle",
    "date": "2022-10-09",
    "content": "Shoutout to the front-facing plugs on the kick plate of the rack",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047274864219795566",
    "author": "peterlabberton",
    "date": "2022-11-29",
    "content": "Apparently he went to this school, was told to never use condensers on drums, landed an assistant gig at a studio in SF, and his first session was assisting Mark Needham, who used *only* condensers on drums.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1049437007182569522",
    "author": "Slow Hand",
    "date": "2022-12-05",
    "content": "Oh man. Great cases are money well spent if you can float it. I've never regretted spending the extra up-front for quality cases.\n\nThat said, maybe you shouldn't have sprung for the solid gold suitcase with matching toothbrush travel caddy. The weight alone is gonna kill you on baggage fees.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062272147378155541",
    "author": "cian riordan",
    "date": "2023-01-09",
    "content": "Top left toggles input and top right toggles on pre/post roll. Super handy for tracking and punching.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067912703307428000",
    "author": "peterlabberton",
    "date": "2023-01-25",
    "content": "I think it’s great! I’m by nature hesitant to make unequivocal recommendations unless I’ve really had a chance to do real side by side comparisons, and in truth I don’t do *tons* of vocals here. Have had it for maybe a year and a half, tracked vocals with maybe 3-5 singers with it. I like it because it’s very flexible without leaning on any DSP wizardry, which was a selling point when I was shopping around for a quality mic that could cover a lot of bases. Really love it as a center drum overhead. Have used it in the B mode on a dimed bass cab and it did great. Would love to put it up to a couple classics and have a good singer shoot them all out to feel like have a better sense of it, but my metric in this room and situation is: does it do the job? And so far 9/10 it does.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068044491623252020",
    "author": "peterlabberton",
    "date": "2023-01-25",
    "content": "Huh. I really thought they’d ballooned up to the, I dunno, $5k-$10k range. When I saw what C37As were going for a few years ago I decided I’d never personally own any vintage mics I really love.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086021569006010408",
    "author": "ALXCPH",
    "date": "2023-03-16",
    "content": "The Way i like to balance these things is to devide my time. When i have more work i focus on that and forget everything i know about perfect setups and the correct Way to do stuff and try to work from instinct. When i have less work thats when i like to dig and explore/optimise. \n\nI def Think the two mindsets can coexist as long as one is conscious about it. \nI love optimising because it makes the creative/work time much easier and instinctual because it helps me trust those instincts. But I would never let doubts stop me doing work and getting over some finish line.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086028249030733834",
    "author": "austenballard",
    "date": "2023-03-16",
    "content": "I just want to chime in with what I think is an important distinction that I felt a little called out by with the references to my templating... \n\nI like to be prepared, and most of my getting-in-the-weeds happens when I have the time to work on preparing things that will make life easier in the future. Again, I cannot stress enough that I'm talking about **getting things out of the way so actual creative work can happen**.\n\nI think what you're describing @ALXCPH IS perfectionism. Worrying about minutiae when something else is supposed to be happening. Interrupting flow. Would anyone argue with me if I said that that's never a good thing?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088968703196004362",
    "author": "Slow Hand",
    "date": "2023-03-24",
    "content": "Haha for real? Glad to hear it. I sent Anthony a track to master recently. Guess you got a sneak peak.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090440389367967744",
    "author": "Zack Hames",
    "date": "2023-03-28",
    "content": "@Rollmottle @Bonati12461 yep. Legacy Audio Aeris. I have no idea what their reputation is and I’ve never heard other tower speakers other than obviously worse ones. I’d love if anyone had insight or opinions.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094044785565765744",
    "author": "LAPhill",
    "date": "2023-04-07",
    "content": "I don’t know man, there’s got to be a little bit of faith in people to consider the source. If I see Cian talking about how he loves them for tracking, that means something to me. Gerhard saying the speaker is bad doesn’t mean it’s not useful, as he’s said many times here.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094639879478071376",
    "author": "John Freyermuth",
    "date": "2023-04-09",
    "content": "Tracking and mixing ringing and delay create huge issues.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1096200167893508166",
    "author": "Jeremy Klein",
    "date": "2023-04-13",
    "content": "that ssl interface needs to get more love. It sounds really good and is super cheap",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1098736168629182534",
    "author": "Rob Domos",
    "date": "2023-04-20",
    "content": "Feels like I’m hearing songs for the first time. Like I’ve listened to this is America probably close to a hundred times and I never knew young thug was doing adlibs on it. One listen with the towels and I’m like “yo is that young thug?” Look in the credits and it is",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112937418325233805",
    "author": "cian riordan",
    "date": "2023-05-29",
    "content": "I've never sweat it. It's full of thermistors that shut it down should it ever get too hot -- but I've stacked them plenty for years without issue. The manual said something about spacing them apart but that's also a CYA for UTA.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116597508248977448",
    "author": "masteredbyjack",
    "date": "2023-06-08",
    "content": "Nah, I love the natural wood (never would guess by looking at my spot 😂)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129446118208581753",
    "author": "GaspardMurph",
    "date": "2023-07-14",
    "content": "I thought I’d share my setup here ! I love my space here but I am starting to feel like I’ve hoarded myself into a corner. Too much stuff accumulated that I don’t need / use.\nHere is my plan to make more room, if anyone has an opinion, please shoot 🙂\n- condense all the rack gear into one of the rack cabinets, there a ton of stuff that is just in there and not being used (nor is it patched in)\n- Rhodes is going to my house, I think it will get more use as a practice / songwriting tool in my home.\n- Mellotron goes where Rhodes was, so I can store my tape echoes on the drawer cabinet\n- Smaller desk: I need to find the right one or have one built but I really only need my prophet, mouse and keyboard.\n- Would also be a good opportunity to improve speaker placement\n\nThe room is smaller than it looks in the pictures, it’s 161 sq feet. About 14.9’ long, 11.9’ wide and 7.6’ high. It’s a floating room design and there is acoustic treatment behind the fabric walls (no idea what though)",
    "reactions": 2,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "1129454330982957056",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "I dare not open the racks hahaha. The rats nest here is just hidden. It took a bit of time, everything labeled very nicely, etc which I find worth it to walk into the studio everyday and not see most of the cables!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1133777546064965782",
    "author": "chrissorem",
    "date": "2023-07-26",
    "content": "He’s executive producer on this record, he wanted Niko Bolis to mix the track but luckily lobos said no and I’m mixing it. I will he’s stoping by today to hear the mix. He was also very kind to me! I’ll tell him you said what up!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136448721127735417",
    "author": "rileybrewer",
    "date": "2023-08-02",
    "content": "recently moved states in aus, transformation of a garden shed to \"studio\" is almost complete (although i guess its never complete😂)",
    "reactions": 2,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1138846785977188504",
    "author": "Bryan DiMaio",
    "date": "2023-08-09",
    "content": "I hate that I watched this on AirPods and my phone decided to spatialize it and track my head lmao",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151557965170606140",
    "author": "Josh",
    "date": "2023-09-13",
    "content": "To be fair I’m in Atlanta so it’s more like “ayo I can patch in a u87, 1073, and Cl 1b” and I’m already baseline 😭",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167903055522574357",
    "author": "peterlabberton",
    "date": "2023-10-28",
    "content": "From left to right: early accounting techniques, high end interface and preamps, well thought out monitor placement (and choice), bed to the right for room treatment",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171964429273935892",
    "author": "BatMeckley",
    "date": "2023-11-08",
    "content": "I like ergonomically having the Magic Trackpad. It’s Bluetooth, battery lasts forever, and you can do more with it. Plus it takes up virtually no space in your bag. Worthy investment",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179634620594139146",
    "author": "Slow Hand",
    "date": "2023-11-29",
    "content": "They’re so good. I’ve still got an iPhone 8 with the home button and whenever I power down my phone (and the haptics turn off) I like to press the (now inert) home button and marvel at how it doesn’t move because it’s not an actual mechanical button.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180946176145637488",
    "author": "BatMeckley",
    "date": "2023-12-03",
    "content": "I like full color too, easier on the eye. I tend to assign colors to different things, ie the api’s are api blue, the UTA or gold, and then the ins and outs are darker and lighter versions of those colors.  Tends to help me navigate it a little quicker.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181435868922261594",
    "author": "cian riordan",
    "date": "2023-12-04",
    "content": "It sounds more open than any 80 series neve I’ve tracked on… especially with the EQs… the additive high end is much silkier.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182486808018288751",
    "author": "peterlabberton",
    "date": "2023-12-07",
    "content": "Somewhere out there is a warehouse with thousands or orphaned kick drums and rack toms just pining for their long lost floor tom siblings",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195954940888232006",
    "author": "popaganda.",
    "date": "2024-01-13",
    "content": "And I also think there’s something to be gained by hearing the track from the side or in other parts of the room",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210731569455697920",
    "author": "NoahNeedleman",
    "date": "2024-02-23",
    "content": "Full tears hit me by song 3 or 4, and song 5 my ear was drawn to things I’d never noticed in a song that’s in my “vibe check” playlist.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214033625671274546",
    "author": "montrose recording",
    "date": "2024-03-03",
    "content": "i use my tape machines all the time - using repro head calibrated hardware insert delay compensation allows you to hear repro in context so you can hit the tape just like u wanna - i end up commiting things back in all the time",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218183200237420645",
    "author": "montrose recording",
    "date": "2024-03-15",
    "content": "whenever ive had them in a room ive track thru them.  but printed non fairchilded tracks as well for safety. 🤷🏼‍♂️",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220429085961097316",
    "author": "cian riordan",
    "date": "2024-03-21",
    "content": "It's a long term babysit from a friend. A 12-ch line mixer (no mic pres). Similar topography to the one Annie got a few years ago and I've fallen in love with the sound after making the last record on it. For a design that gets a lot of hate (ICs, etc), it sure sounds good. Also just really fucking cool to have a quick way to submix things down, incorporate outboard, effects, and print a stereo sound. Didn't fully realize how useful it would be in a mix context.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1259628040317833236",
    "author": "Matt Huber",
    "date": "2024-07-07",
    "content": "Your “don’t” was all the encouragement I need to never do it 😂",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278490654401368117",
    "author": "Nomograph Mastering",
    "date": "2024-08-28",
    "content": "If you want a perfectly controlled room then use your control room to track (say for a pristine acoustic guitar)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1316534680664805467",
    "author": "montrose recording",
    "date": "2024-12-11",
    "content": "last two days of live band tracking.  bass drums eg acg and vocal live",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341456629752922243",
    "author": "Chase H",
    "date": "2025-02-18",
    "content": "The yellow insulation has more of a API tone, the Pink sounds more neveish in the low mids",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1349180248805347458",
    "author": "Bryan DiMaio",
    "date": "2025-03-11",
    "content": "It’s one of those things you put in your rack if you need to weigh it down, but it also can power speakers which is a neat side effect!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428342645729792062",
    "author": "Josh Bowman",
    "date": "2025-10-16",
    "content": "Wow that seems cheap. People are paying that much for a few compressors these days, I’d rather have a 6k than a few  unfairchilds or whatever. Excited for you!!!!!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428856555431792750",
    "author": "cian riordan",
    "date": "2025-10-17",
    "content": "Setup the patchbay so each channel is normalled to PT inserts.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461413475854188657",
    "author": "Jorge Vivo",
    "date": "2026-01-15",
    "content": "Fair question, I bought them for some small events that I randomly do in town because it’s the most requested PA. I brought them into the control room for fun, thinking they wouldn’t work and when I turned them on I could not believe how insanely good they sound towards the back of the room. I never had mains before but I guess I do now! Just for clients, I can’t work on them from the sweet spot nor have any interest in blasting music so loud",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469500754304958689",
    "author": "peterlabberton",
    "date": "2026-02-06",
    "content": "Yeah what the fuck? I go away from here for one year and @Zack Hames gets a dang ol ssl in his basement?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "819665381622808617",
    "author": "dumlords",
    "date": "2021-03-11",
    "content": "I remember the first time I used a super reverb was at this studio in Queens and when we started tracking I was like “why does anyone own other amps?” Haha",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "847982526026481675",
    "author": "Zack Hames",
    "date": "2021-05-28",
    "content": "Trident 90 - really great, flexible 4 band EQ, good clean preamps. I used UTA, great river, summit, and amek pres for all this stuff though. Wanted transformer and tube as much as I could.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "922682193791291402",
    "author": "Eric Martin",
    "date": "2021-12-20",
    "content": "It was my first outboard compressor, I like it, it’s hard to strew up compression with that thing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "932320001547972659",
    "author": "bennythetweet",
    "date": "2022-01-16",
    "content": "Stoked to add that compressor with the four big white knobs (FYI - good name for a business doc) to my little setup. Heard it’s decent. 😂 so far just running some things parallel through it and it’s lovely.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "973294150021677176",
    "author": "peterlabberton",
    "date": "2022-05-09",
    "content": "Oooo sorry. I thought you said I could just drop by whenever.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029611815358963813",
    "author": "Slow Hand",
    "date": "2022-10-11",
    "content": "Looks like the green gem light from a Shadow Hills compressor to me.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047375097792561222",
    "author": "cian riordan",
    "date": "2022-11-29",
    "content": "Full setup:\nKick Bat: Sony ECM50\nKick Out 1: 47fet\nKick Out 2: Audix DX\nSnr: 441\nToms: U87s\nOH Mono: U47\nOHs: U67\nRMs: RCA 44s\n\nAll going through the Neve 34128’s. It’s really just a trial run for the new console but was fun to do an all-out splurge with the nice microphones. Nothing making up for my shitty playing tho 😛",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047389265836912660",
    "author": "peterlabberton",
    "date": "2022-11-29",
    "content": "White Lotus is killer. Never seen Ted Lasso, but I did get some free cookies from Go Get Em as part of some promo thing once so it’s okay in my book.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1049136106660167720",
    "author": "BatMeckley",
    "date": "2022-12-04",
    "content": "Also the 2 wheel ones don’t roll away, and take uneven pavement better. Nothing says “I actually need and use good luggage” like B&R",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050811048816562298",
    "author": "AlexL",
    "date": "2022-12-09",
    "content": "THANK YOU BOTH. Just ordered her the Cabin in matte green. She flies 2 times a month and works in fashion. So I'm sure she'd like the \"brand cache\" as you said. I would have NEVER thought of that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061387758410674248",
    "author": "Nomograph Mastering",
    "date": "2023-01-07",
    "content": "Keyboards can generally be to one side. We’re focused on dealing with first reflections, it trying to bracket the whole area with soft stuff",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061822683983138867",
    "author": "ALXCPH",
    "date": "2023-01-08",
    "content": "I thought the rack version was the original?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067878559823184013",
    "author": "CK",
    "date": "2023-01-25",
    "content": "I am about a month out from building out my new studio in a house I just bought. I am going to do my best to plan out as much as I can now, but also leave a ton of wiggle room and wait until I am actually in the room to listen and measure. It is not a large room. I think it is 14x15. I will be there next week to take proper measurements. I already know it will be difficult to find a sweet spot that also works with me doing all my tracking and drum recording in here, as I do a lot of full-stack producing where I play most everything. Space is going to be tight, but I have worked out of much smaller spaces. I am starting to budget out the project of what my acoustics will likely cost me.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067908232749776916",
    "author": "peterlabberton",
    "date": "2023-01-25",
    "content": "Kevin Durant would come to my old spot in Oakland sometimes (though we never crossed paths) and one of our interns got a photo of him standing on a chair next to Kevin, roughly equal in height with that lil boost.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068281333291438080",
    "author": "GaspardMurph",
    "date": "2023-01-26",
    "content": "It’s good, I always did it that way - I think I’m also not a fan of super wide drums. (Also no cymbales were used on this track, only kick snare and HH",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071617842170048573",
    "author": "Rollmottle",
    "date": "2023-02-04",
    "content": "never seen em oriented like that. looks real nice.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072254979089387603",
    "author": "Calvin Lauber",
    "date": "2023-02-06",
    "content": "The 725 sounded really great. Polished and crispy without being harsh in the top end and a pleasing saturation overall. If it was a more pop leaning track or even just a song with more going on it would have been the winner. The AKG was a litttle warmer and smoother in comparison while having that same saturation characteristic which we were digging on this folk-ish track. The 716 was a bit dull next to those two probably because it’s missing the tube mojo.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072255470926041148",
    "author": "Calvin Lauber",
    "date": "2023-02-06",
    "content": "Kinda working with some limitations in this room we have 4 channels of 1272, and 2 Brent Averill APi style pre’s which I tried first but sorta dug the open-ness of the 1272 more. if it was a different genre I think I probably would have stuck with the API style pre. But if there was a TG in here I’d have been all over it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072256096921714758",
    "author": "BatMeckley",
    "date": "2023-02-06",
    "content": "Yeah I’ve never been a big api guy on vocals, love them for most other things. Use whatever works!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072283079433015446",
    "author": "David Fuller",
    "date": "2023-02-06",
    "content": "God forbid you want your outboard in an ergonomically useful place lmao",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088970376446492723",
    "author": "Slow Hand",
    "date": "2023-03-24",
    "content": "Why thank you. You're welcome to swing by whenever you'd like, if you ever feel like hearing more.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091410705686732842",
    "author": "Ross Fortune",
    "date": "2023-03-31",
    "content": "Whenever I go back I’m stunned by how green the green is. It’s wild.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093677550443700295",
    "author": "Zakhiggins",
    "date": "2023-04-06",
    "content": "I have surfed there, but I wouldn't recommend it, it's quite dangerous and there's some pretty gnarly rocks hidden underneath - whatever way the sand bank is makes it not a very long ride either, and you can't really travel sideways with the cliffs. However there's a spot down the road (Inch reefs or Inch beach) that has world class surf, and world class views while you are surfing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094039755076935690",
    "author": "Rob Domos",
    "date": "2023-04-07",
    "content": "To be clear, he never advocated for $3k IECs",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094045382775930901",
    "author": "BatMeckley",
    "date": "2023-04-07",
    "content": "💯 agree, largely because rauari has built up an unfuckwithable track record and steers away from hyperbole. Which again, is kinda the point here. Because someone new to the forum might not understand the vast difference in qualification here.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094052243210244107",
    "author": "austenballard",
    "date": "2023-04-07",
    "content": "I will pay any price to never have to worry about headphones again",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101619721834594405",
    "author": "Tim O’Sullivan",
    "date": "2023-04-28",
    "content": "I love it. I don’t mix on it, and I use an Audient Nero for center section shit. But nice to have a fader to grab, and some utility eq’s. I mostly use my outboard pre’s and those all have little labs attenuators before the console so I have a ton of control over the headroom. I also use it to buss stuff down like kick mics and guitar amps to keep track counts down.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104175140234866768",
    "author": "Bryan DiMaio",
    "date": "2023-05-05",
    "content": "Oh yeah, I can nerd out about all sorts of things (though never at the cost of the vibe of a mix)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107043475150606436",
    "author": "Nomograph Mastering",
    "date": "2023-05-13",
    "content": "Still finding this to be the case. I think they tried to squeeze a little too much juice out. Having rocked them daily now for months I think the pro 2 sound better than 1 which already sounded great, but the noise cancelling can do weird phasey stuff i never experienced on various sets of Pro 1s",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108962702497419304",
    "author": "Rollmottle",
    "date": "2023-05-18",
    "content": "Lol. Never heard the Kii’s so not sure! I ran them without any EQ for months and was fine but this definitely feels better.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109879575833497613",
    "author": "Ross Fortune",
    "date": "2023-05-21",
    "content": "😂 dude, it’s fucked that nerds like us remember to the decimal point the latency stats of anything at all, let alone multiple sets of speakers. I will now store that 1ms figure in the Rain Man part of my brain, alongside the fader settings of most of the significant tracks in the last mix I did. They will stay there for approximately 3 weeks",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1111651629654102096",
    "author": "youngteam",
    "date": "2023-05-26",
    "content": "Seeing people double up on smaller desks one for monitor and one for keyboard was eye opening to me. I could never get speakers and desk in the place I wanted and always compromised. It will be good to have my monitor behind the plane of my speakers again",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112189771964493856",
    "author": "LAPhill",
    "date": "2023-05-27",
    "content": "For me, I don't do that, and use Expression Maps (think keyswitches) to keep my track count down, but I still have around 1000",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112189860585930792",
    "author": "LAPhill",
    "date": "2023-05-27",
    "content": "if I did articulations per track, I'd be probably more like 5000+, and that's too much even for me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112191555546140763",
    "author": "LAPhill",
    "date": "2023-05-27",
    "content": "Okay, I just opened my template to check. Current empty template sits at 1509 tracks",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112192635654910002",
    "author": "LAPhill",
    "date": "2023-05-27",
    "content": "Well, the MIDI portion of that is around 1000 tracks. On a big orchestral extravaganza, probably in the vicinity of 300 maybe? But then I'll also be adding a lot of things that aren't part of the standard template. The thing is, which 300 tracks I'm using vary a lot. At least once a year, I do an audit of things and take out anything I haven't used.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113055722914185276",
    "author": "Bryan DiMaio",
    "date": "2023-05-30",
    "content": "I had a client who had some pretty bad thermal issues with the Apollo being racked on another Apollo so eventually we put a 1U ventilation panel in his rack between the two",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116522029135433829",
    "author": "popaganda.",
    "date": "2023-06-08",
    "content": "By the way, this mf @jantrit  knows how to get sounds. Raw tracks coming off the floor sounded so good",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129448437000192020",
    "author": "cian riordan",
    "date": "2023-07-14",
    "content": "All for the decluttering. I'm about to do a round of that in my room. I have a Wurli I'm going to put smoewhere in the house where it'll get played. I have a big credenza that I'm looking to simplify and break down into a few smaller racks. I'm even thinking about buying one of those giant open server racks to just put everything in the back corner of the room... one tall ass 42U rack... out of the way until I need it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129453684628127804",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "It is flush with front of speakers per Ruairi advice. 32 inch! I’d say it’s like a couple feet in front of me?\n\nIt’s “stand is a couple gator racks handing all the studio cabling",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129456959893024798",
    "author": "Adam Thein",
    "date": "2023-07-14",
    "content": "I now have this funny image of you mastering a track and adding a shreddy moog lead to something lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1131679341017825311",
    "author": "Felix Byrne",
    "date": "2023-07-20",
    "content": "not sure abt the atmos install but ik dale builds most all of his racks/desks/speaker stands etc himself",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138849237019406397",
    "author": "Joshua Riley",
    "date": "2023-08-09",
    "content": "Always think I’m going deaf in one ear when it’s on head tracking and then I realize 🤣",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139642383319957574",
    "author": "popaganda.",
    "date": "2023-08-11",
    "content": "I remember seeing Bon Iver in 2019. When he played stacks I was gutted…like uncontrollably sobbing making noise couldn’t catch my breath. I’ve wept a lot to music before but never like that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156923422715158561",
    "author": "joshbonanno",
    "date": "2023-09-28",
    "content": "hermitage boys. you have a track record of finding your neighbors haha.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167939122225238037",
    "author": "Ross Fortune",
    "date": "2023-10-28",
    "content": "My first rig was a Boss BR8 digital 8 track, that wrote to Zip disk. Monitored on a Sony hifi.\n\nIt only had two inputs, so I Frankensteined two mic cables together somehow and used one channel for kick and snare (D112 and sm57). \n\nI had zero idea of how to mic a drum kit, and no internet or other way to find out. I wore over ear noise defenders, and just stuffed a pound shop karaoke mic under the head band, which would obviously move as I did - true drummer perspective",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1167940409897521202",
    "author": "Nomograph Mastering",
    "date": "2023-10-28",
    "content": "The cassette in my 4 track was driven by a horse with a piece of string",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171624605484597308",
    "author": "cian riordan",
    "date": "2023-11-07",
    "content": "I alternate between this and a trackball... when once starts hurting I switch to the other hah",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172124959775141949",
    "author": "Bryan DiMaio",
    "date": "2023-11-09",
    "content": "You guys aren’t using the trackpad surface of a Steam Controller in trackball mode as your primary input? Weird",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172220611846746112",
    "author": "Adam Thein",
    "date": "2023-11-09",
    "content": "also there's a lot of visual stimulus in a studio tracking, same concept as getting fooled by UIs while mixing IMO",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178341732853764126",
    "author": "Josh",
    "date": "2023-11-26",
    "content": "My dad has two old reel to reel 8 tracks I wanna incorporate into my setup one day. He cut his demos on it when he was my age so it’s only fair I do the same.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179589950732251237",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-29",
    "content": "I've never been able to reliably use any trackpads but the apple ones unfortunately. They just seem inconceivably far ahead there",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179660093302775918",
    "author": "Rollmottle",
    "date": "2023-11-29",
    "content": "another fun fact, the magic trackpad and the macbook trackpads are glass",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183131701497569280",
    "author": "Deleted User",
    "date": "2023-12-09",
    "content": "Never did the 1 to 1 comparison, but getting off the shelf speaker stands for those speakers would have been very expensive",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1184522648902959244",
    "author": "chrissorem",
    "date": "2023-12-13",
    "content": "Oh hmm. I haven’t gone out of my way to secure anything but I also don’t  really have many heavy things above head height. But if you can strap or secure racks or speakers it’s not a bad idea.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203168083045515344",
    "author": "hyanrarvey",
    "date": "2024-02-02",
    "content": "One of chris g’s rack has a mesa boogie sticker on it so it’s basically a guitar amp at that point",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218018690155548712",
    "author": "peterlabberton",
    "date": "2024-03-14",
    "content": "I would track through it gently on certain sources back at 25th St., and it’s great when it’s great. But for the money—wtf!?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218703708108623872",
    "author": "cian riordan",
    "date": "2024-03-16",
    "content": "BK5a on crotch. Nice, never tried that… I’ve mostly used them on guitar amps. How great is that room sound?!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223679518204760138",
    "author": "James Redfern",
    "date": "2024-03-30",
    "content": "Great! I mostly find it useful for getting a cool midrange “splat” for the snare. How much I isolate the snare in the mix depends on the track!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1235324712037384200",
    "author": "Slow Hand",
    "date": "2024-05-01",
    "content": "Philip Glass was a plumber until he was 40. Never a bad time to start.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237558672884895836",
    "author": "Eric Martin",
    "date": "2024-05-07",
    "content": "I do like having the controls of analog gear in front of me when I’m tracking",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1238124466249142362",
    "author": "Ross Fortune",
    "date": "2024-05-09",
    "content": "Dope. Never thought of digging out presets for Diva - I do it with serum via Splice all the time",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243805898640457769",
    "author": "peterlabberton",
    "date": "2024-05-24",
    "content": "This is the most elaborate way I’ve ever seen to avoid using a compressor. Castelli would be proud.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1260515946687365213",
    "author": "Ross Fortune",
    "date": "2024-07-10",
    "content": "Don’t mind me @bobby k , just going to wholesale lift your entire studio vibe. Didn’t think I’d like black walls, but they’re great with the cosiness you have going on. \n\nI got to the stage in my room where everything was in and functional, then I just started working and never stopped. It’s sorely in need of some love in the aesthetics department and this is great inspiration.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280340882801037343",
    "author": "stewart_hidalgo",
    "date": "2024-09-02",
    "content": "They used an L bracket. I have a low ceiling so needed them as flush as possible.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1288865892960305162",
    "author": "Josh",
    "date": "2024-09-26",
    "content": "Also I never thought an orange wall like that would go so hard. Makes it feel nice and warm.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1294050583057272852",
    "author": "Nomograph Mastering",
    "date": "2024-10-10",
    "content": "Remind me never to take a flight with Peter ... \"But how?!\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318632798197645312",
    "author": "Zach Hughes",
    "date": "2024-12-17",
    "content": "I’ve found trim screws work really well for panels especially when using thinner plywoods that can break with larger screws. Technically for drywall but I’ve never had an issue with them. They also make pilot holes less necessary though still maybe a good idea. https://www.homedepot.com/p/Grip-Rite-6-x-2-1-4-in-Phosphate-Coated-Square-Drive-Flat-Undercut-Trim-Head-Drywall-Screws-1-lb-Box-214STHDW1/100154569",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1322343362308603914",
    "author": "popaganda.",
    "date": "2024-12-27",
    "content": "im just cleaning all the pots and faders. its crackle city",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340409775917105273",
    "author": "chrissorem",
    "date": "2025-02-15",
    "content": "Also much easier to hit a stud then with brackets you are limited to the physical location",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342886540745117818",
    "author": "Brian Reynolds",
    "date": "2025-02-22",
    "content": "I knew you were, about 20 seconds after sending the message I realized what was going on with me. And needed to step away before I could communicate clearly. A wise man once said hold the things loosely, it's the people that matter. What was upsetting me was, that the collective concern was with safety and security of the cloud and the gear. And not with the human and their mindset who was going to work on an elevated surface or ladder. As someone whose father fall from a ladder. Altered my life for the better part of a decade. And will alter every step my father takes forever. The most important thing once elevated surfaces, tools, and suspended weight get involved. Is that the people come down alright. Clouds can be remade. Gear can be rebought. Money can hear remade. But when a human body breaks. It never goes back together the same way. I'm sensitive around this topic.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1364553877533495327",
    "author": "Brian Reynolds",
    "date": "2025-04-23",
    "content": "I'm usually just setting it to the bpm of the song. But its fun to move it around. When I say it feels different. I'm talking about Chase Bliss pedals such as Reverse mode C, which has tap tempo. There's just a consistency and intensity to the repeats that isnt there on tap tempo. Idk why? And then the others without tap, like Lossy Or Onward. The feel change is dramatic how much more in sync and vibe the pedals feel with the track. It's got a ton of preset slots for predetermined tempos",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376637680577806357",
    "author": "Nomograph Mastering",
    "date": "2025-05-26",
    "content": "Pro tip - Angle your racks to stop\nVagrants (drummers)  sleeping on them",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376730383261110323",
    "author": "cian riordan",
    "date": "2025-05-26",
    "content": "There's surely an effect... especially if its asymetrical in the room. But I have a 3 bay rack to my left side... its out of the flightpath, and doesn't seem to mess with the overall image and balance of the monitoring.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376741406340808734",
    "author": "Matt Huber",
    "date": "2025-05-26",
    "content": "Very simple indeed. I initially overthought it - I have gotten so obsessive about getting things symmetrical in my room. \n\nFollowing your line of questioning, it doesn’t seem that a low rack that’s not in the direct line between me and my monitors would end up having a significant impact on response / imaging.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376743267877519520",
    "author": "Nomograph Mastering",
    "date": "2025-05-26",
    "content": "Think about where the reflection goes in Atmos … assuming you have a wide speaker right behind the rack. And think about how directional your speakers are (or any speakers) at various frequencies",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376950738197942302",
    "author": "Matt Huber",
    "date": "2025-05-27",
    "content": "Seems like most of the reflections off of the rack’s top would be reflecting below my ears. The closer it gets to the midway point between listening position and the speaker, the more direct the path would be to my ears",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382905519999815793",
    "author": "Abel Koshy",
    "date": "2025-06-12",
    "content": "I realized an artists song had a lot of low mids in his vocals that I never heard before. Everything feels so revealing.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417292988870168629",
    "author": "BatMeckley",
    "date": "2025-09-15",
    "content": "For my uses? Probably the shelford. Incredibly well built, very flexible, sounds great. The Lakeside is a really great pre, I want one, but it’s got a sound to the point that I’m convinced that it’s doing more than just a pre. Also the knob situation is fucking STUPID. The aurora is great. Good neve. Compressor a bit tricky, but… \n\nThe lakeside and aurora both have a density in the low mids that give them a weight I’d ultimately try and eq out of a finished mix. Shelford just sounds done to me.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1426567547331018904",
    "author": "SoundsLikeJoe",
    "date": "2025-10-11",
    "content": "Not sure what you mean?  ...   the amount of signal is proportional to the decibel level of the source more than the preamp gain setting, and full orchestra is a loud beast.  Each channel is set so that FFF dynamics (barely) don't clip the preamp and the mix at unity and loud full orchestra is kissing into a brickwall limiter at -1db.  It might push the loudest peaks at 3-6db in reduction. But the RMS is all over the place. Final mix probably close to -20 LUFS program average.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428176838768984075",
    "author": "Zack Hames",
    "date": "2025-10-15",
    "content": "And yeah, patchbay and all cabling included. Will likely be getting the hd I/O and stuff on the cheap too",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428191946903654540",
    "author": "Zack Hames",
    "date": "2025-10-15",
    "content": "Details: \n40 channels\nTransformer Preamps (82E01)\nE series Brown EQ’s\n6k so it has the ABC bussing\nHas the updated Atomic PSU\n\nAllegedly this console was from NBC Burbank and was used to mix Days Of Our Lives and Fresh Prince Of Bel-air.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428431042859241613",
    "author": "Zack Hames",
    "date": "2025-10-16",
    "content": "I feel very handcuffed and slowed down when I go from console to computer during tracking especially",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428762032186064956",
    "author": "Zack Hames",
    "date": "2025-10-17",
    "content": "Real talk, I DID NOT like SSL plugins of any kind until I used this console and heard what it can actually do. I still think the hardware absolutely crushes every plugin version (I really can't describe why either, it's just better) BUT having the perspective of the hardware experience allows me to use the plugins and chase what i know I want it to do much much easier.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428817322516414504",
    "author": "onanisland",
    "date": "2025-10-17",
    "content": "This massive 5 meters x 4 cloud was designed for a console which never happend 😂",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1429163514777309245",
    "author": "cian riordan",
    "date": "2025-10-18",
    "content": "Yep. So if you pull up insert 1 on PT. The outputs of PT normalled to the line in on SSL and the direct out of that channel normalled to the corresponding input in PT",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461911944591310878",
    "author": "James Cronier",
    "date": "2026-01-16",
    "content": "It’s the best drawer of budget LDCs. The good cheap AT stuff, a good warm audio 47 from back when the QC was tighter (afaik), shure KSM32.\n\nThe 57 drawer is my fav…there is one very, very broken 57. The rest are out in use.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461916095396184225",
    "author": "Nomograph Mastering",
    "date": "2026-01-16",
    "content": "https://tenor.com/view/salt-bae-salt-nusret-g%C3%B6k%C3%A7e-shades-gif-17662394",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463301117956849937",
    "author": "aliberger",
    "date": "2026-01-20",
    "content": "was never able to get a good critical listening setup going around it but yes - tradeoffs! lately i have an area with flat surface for fun production stuff, work mostly in headphones there, and then a separate zone with a tiny desk and the proper listening area",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808473385100247070",
    "author": "AV",
    "date": "2021-02-08",
    "content": "Not super big tbh, just looking for a space where I can fit my desk and track vocals.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808508116508737547",
    "author": "hendrick",
    "date": "2021-02-08",
    "content": "i truly never expected yall to have so many guitars 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808820136479293471",
    "author": "Zack Hames",
    "date": "2021-02-09",
    "content": "Yeah, the way that thing distorts internally is magic. Also another thing that helped me with synths in general is treating it LIKE a guitar. A lot of synths are recorded direct, and that’s usually the intent, but guitars are almost never recorded direct completely clean with 0 effects or tone shaping. Running synths through pedals and amps and FX really opens the world for anyone struggling with “synth production”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808844302100594708",
    "author": "TALLL",
    "date": "2021-02-09",
    "content": "or maybe just microphone to preamp to ms20",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808845043913457665",
    "author": "cian riordan",
    "date": "2021-02-09",
    "content": "Man this is one of my favorite records. I never get tired of listening to it. It's the perfect thing to listen to on an airplane to block out the madness.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808848208804577311",
    "author": "oaklandmatt",
    "date": "2021-02-09",
    "content": "yeah the CV tracking is really cool! i honestly haven't found a good place in a song for it yet, but i've enjoyed it the few times i've done it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808875031261085757",
    "author": "hendrick",
    "date": "2021-02-09",
    "content": "i never thought of that! this week i'll start picking out songs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "809619729589338152",
    "author": "NoahNeedleman",
    "date": "2021-02-11",
    "content": "Oooh. I thought compressors were persona non grata around here... but that’s sexy as hell.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "811662762445897789",
    "author": "TALLL",
    "date": "2021-02-17",
    "content": "I have never seen Genelecs in wood like that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "819665717485764629",
    "author": "Josh",
    "date": "2021-03-11",
    "content": "I’ve never played through one! My dad has always had plexis so I’m sorta partial to the bassman/jtm/plexi designs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "819666317614645319",
    "author": "dumlords",
    "date": "2021-03-11",
    "content": "A plexi was always my holy grail I never got.   I did have one of those traynor YBAs or whatever they’re called for a while which was in that realm circuit wise I believe but it actually caught on fire during a session 😂😂😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "820836743645233162",
    "author": "Josh",
    "date": "2021-03-14",
    "content": "Assuming I can even hear them because dababy is back and I was just about to track vocals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835951024535633981",
    "author": "Slow Hand",
    "date": "2021-04-25",
    "content": "I've tracked down Art Noxon's patents for the different tube traps, but I'm unclear on how to interpret them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "840285821164847134",
    "author": "Slow Hand",
    "date": "2021-05-07",
    "content": "You've got it. I'm going to post them momentarily in the 'Monitoring Talk' channel, so that they're easier to track down in the future.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842956429366263810",
    "author": "Eric Martin",
    "date": "2021-05-14",
    "content": "this was the first year that I started tracking guitars ITB with a Helix, because recall",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "845757737354919948",
    "author": "Zack Hames",
    "date": "2021-05-22",
    "content": "Most do - they’ve been putting out “special” “limited” editions with various 12” speakers - sometimes like a Cannabis Rex 12”. It sounds very full range with the 12”. Shocking amount of low end!\n\nI’ve always wanted to really sit down with a Deluxe, they always sound incredible live whenever I hear them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "847966391034445824",
    "author": "Zack Hames",
    "date": "2021-05-28",
    "content": "P.S. forgot my snare stand for my rack Tom, so 2 floor toms was the answer!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "847967599006580757",
    "author": "David Fuller",
    "date": "2021-05-28",
    "content": "~~SSL board?~~ Okay clearly not, not sure what I'm looking at",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860227190457106452",
    "author": "chadwahlbrink",
    "date": "2021-07-01",
    "content": "I would be very curious to hear the unfuck guys' chat tube traps! I keep seeing Jon’s in pics and curious to hear his thoughts as well.\n\nThey have been great for me. I scored my whole set in 2 batches (16 tubes, 3 speaker stands) for roughly $4500 total - which is still pricey but a great “deal.” Also, they make my Apartment’s basement bedroom usable. \n\nThey lock you into a very specific aesthetic and ergonomic setup, which I have found interesting to navigate (placing a desk, can’t adjust speaker height, etc.).\n\nThey also sound great for tracking! I have used them while tracking drums, harp, vocals, and other things with excellent results.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "863130651574534185",
    "author": "peterlabberton",
    "date": "2021-07-09",
    "content": "My future setup. Will of course need to adapt as I get in the room and listen, but I'm excited *and* need to minimize downtime between studios, so I'm mapping stuff out as best I can so I can hit the ground running.\n\nI'm thinking I'll build some fiberglass/rockwool panels on stands (the four panels freestanding by the mix position) and mimic some of the idea behind the attack wall: kill reflections closer to the listening position rather than at the walls. This way I can keep the fireplace and windows from being covered up, and have some gobos to move around when needed for tracking. The small desk to the left of the mix position will be a rack for gear, the large rectangular thingy in the upper right will be an upright piano. I'll pack in some DIY tube traps around the monitors, and hang two 4'x2' panels I already own over the mix position. I'll also put two slightly smaller panels over the drums, and two more on the wall behind the drums. The french doors and the sliding doors to the closet behind the couch will have heavy curtains.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "871766133433327656",
    "author": "aemaury",
    "date": "2021-08-02",
    "content": "all that said, im open minded about the future and i might be enlightened to even better monitoring with a 'proper' room build one day. maybe the attack wall is a stepping stone in my journey... we'll see. but its been a decade using it now. i'll never regret the work and progress i made with it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "904007737988501504",
    "author": "Felix Byrne",
    "date": "2021-10-30",
    "content": "there’s no way in hell they put an outboard rack in animal crossing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "916917555078246481",
    "author": "Eric Martin",
    "date": "2021-12-04",
    "content": "I’ve been using the Massive Passive on everything, tracking mixing mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "917131955752017930",
    "author": "bobby k",
    "date": "2021-12-05",
    "content": "My MP is also my baby, tracking mixing bussing, it rules on everything",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "917136194477907978",
    "author": "Eric Martin",
    "date": "2021-12-05",
    "content": "that little EQ is an Art dual 15 Band Graphic EQ, I only use it on Tom’s to clean up the midrange when tracking, otherwise I never use it. I’m planning on replacing it with a ELYSIA Xfilter, maag EQ or a API 5500 sometime next year",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "917193309242400808",
    "author": "bobby k",
    "date": "2021-12-05",
    "content": "it's a dream piece of gear. got mine for like 3,800 which seems like a solid strike of good luck. i used to use the plugin all the time. my go-to vocal chain for tracking is neve portico pre into a massive passive single channel, or if i'm going for a really saturated sound, both channels in serial. Usually do cuts on the first channel and boosts on the second. man, the possibilities with these things are endless. Do you ever feel like it warms up the mix buss TOO much? i tend to do a trim -6 and trim +6 on either side of it, which helps.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "917205212794613850",
    "author": "Eric Martin",
    "date": "2021-12-05",
    "content": "it’s too new for me to know, I tried it on a Metal band and it didn’t really work.\n\nMy new go-to tracking chain is my Great River MP2NV > Tube Tech LCA2B > MSMP maybe swap the Tube Tech and MP but so far rules.\n\nTop end is magic, wide band boosting 27k while cutting with the LoPass at 18k is magic to me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "922199289978028072",
    "author": "Rob Domos",
    "date": "2021-12-19",
    "content": "Does anyone have any suggestions on how to mount half-rack devices into my rack spaces? It's one of those slanty racks where the gear is hanging diagonal to the floor.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "922222925417971712",
    "author": "Rob Domos",
    "date": "2021-12-19",
    "content": "My topping and Lewitt gear don’t even have rack ears so I’m not sure how adaptors would work",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "922401746767212594",
    "author": "jonmatteson",
    "date": "2021-12-20",
    "content": "I would get a rack shelf and dual lock the units to it. You could also try drilling through the shelf and use the existing screws to mount throughs the shelf. https://www.bhphotovideo.com/c/product/944635-REG/startech_cabshelf1u_1_ru_7_depth.html",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "934572359778721852",
    "author": "hyanrarvey",
    "date": "2022-01-22",
    "content": "Also running the m80 through an 1176 as a pre dimmed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "959806367336661022",
    "author": "chadwahlbrink",
    "date": "2022-04-02",
    "content": "Track pad for scrolling? Mouse for everything else? \n\nThat’s how I roll. Growing up on laptops, I could never let go of track pad scroll gestures.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "985594856833425408",
    "author": "ryount",
    "date": "2022-06-12",
    "content": "I wanted to snag a fairchild knob for the extra-ness of it, but snagged this one from an old crown amp in a gear graveyard. Kinda wild how much better it feels than the tiny dangerous one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "989990198299467786",
    "author": "Calvin Lauber",
    "date": "2022-06-24",
    "content": "Memphis Magnetic, super badass Sphere console that’s in great shape. They have a nice collection of AEA and RCA ribbon mics. Always appreciate tracking up here 🙂",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "991195076548116531",
    "author": "Slow Hand",
    "date": "2022-06-27",
    "content": "I got to spend the day tracking in a different Massenburg designed room. We were at Earth Wind and Fire's old recording complex. It was nowhere near as fancy as that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001918254069067806",
    "author": "youngteam",
    "date": "2022-07-27",
    "content": "it's okay i track guitar in here and am not mixing big hip hop records",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001929073091678318",
    "author": "ehutton21",
    "date": "2022-07-27",
    "content": "Got a couple primacoustic panels up for reflection treatment near where I track but nothing else in the room at all. I mix in cans with correction, but i can bust out a mix on speakers if need be. Working in the center of the long wall of my apartment lmao. I have a feeling my room curve would look obnoxious but idk.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001968556667314278",
    "author": "youngteam",
    "date": "2022-07-27",
    "content": "bc it's good enough for tracking (for me)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1003846470040035348",
    "author": "NoahNeedleman",
    "date": "2022-08-01",
    "content": "The Downlighting in the cloud would have me feeling like Uncle Fester, but honestly that room is set up so much like mine… minus about $50k in outboard, plus about $15k in acoustic guitars 🤪 @BatMeckley would never say it to you, but I’ll say it for him: Big Boy Shit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1010049332726206514",
    "author": "Kendal",
    "date": "2022-08-18",
    "content": "Love the Pacifica. Highly underrated, IMO. It has won many shootouts on acoustic guitar, even over my BAEs and Undertone.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1021172189770301570",
    "author": "TheBlur",
    "date": "2022-09-18",
    "content": "I think sometimes. Only outboard gear I really use is compression socks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1022946433902575747",
    "author": "cuba1956",
    "date": "2022-09-23",
    "content": "When I got a multitrack tape deck, I've found and bought a 2\" tape recorded at EA to see how it's done — level-wise, bleed, processing, etc. Albini is my personal hero.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1024531541482803270",
    "author": "ehutton21",
    "date": "2022-09-27",
    "content": "I tried a bottle of Dunkin’ cappuccino one time, and I vaguely remember not hating it, but I’ve never successfully re-experienced that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028796487720771584",
    "author": "ALXCPH",
    "date": "2022-10-09",
    "content": "I just assumed as much insulation material would help dampen the container. Never imagined I’d build a hard wall",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028801755095498833",
    "author": "ALXCPH",
    "date": "2022-10-09",
    "content": "It was never meant to be a mastering studio. But I like it to be as optimised as possible.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029614569443840041",
    "author": "Nomograph Mastering",
    "date": "2022-10-11",
    "content": "But many people taking shots at audiophiles have never heard Anything  good. Ever",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035388726748139610",
    "author": "cian riordan",
    "date": "2022-10-27",
    "content": "So here’s the roundup on my dumb drum thing. This is a scrappy little experiment on my part to see if I can get a convincing drum sound in my little drum room. Before starting this, I had the idea in my mind that if a room is good for mixing, it must be good for recording! *Insert Game Show Buzzer* I ran into many of the things I didn’t like about the Barefoot Studio B Live room — and those things were exaggerated by a factor of 10. First of all, my room is very dead by design. It treats me great in mixing, but made for a real challenge when trying to get *some* sort of drum personality. I was also working with a pretty shitty old premier kit that hadn’t seen the light of day in half a decade. Shitty cymbals, very quickly tuned heads — I wasn’t setting myself up for success… but whatever.\n\nThe setup was a little ridiculous (minus a few utilitarian pieces):\nKick: Beta 52 -> Scully 280\nSnare: SM57 -> Scully 280\nOH Mono: Coles 4038 -> Ampex 351 -> 1176 (not compressing, just to trim gain before ‘tools)\nOH L/R: U67s -> UTA pre (thanks Matt!)\nKick Room: U47 -> UTA Pre (again…)\n\nThis is where I ended up, without mixing, and with some quick playing and utility EQ/balancing. No compression except a limiter to bring up the level. While the actual drums themselves don’t sound amazing, I really struggled with getting any sort of energy out of the drums… it all just got sucked out. \n\nHere are the results if you care (don’t judge my shitty playing)\n\nI think if it do this again I would:\n1) Have a better sounding kit. Turns out, shit in.. shit out. I knew this. We all know this. But here I am.\n2) Maybe put some sheets of plywood around to create some surface in the room. Just give it some life.\n3) Not use the Scully. It’s so hard to get them to not sound distorty… I just don’t have enough pres on hand to have clean path for everything. Mix studio living.\n\nSo it goes…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035394008664518656",
    "author": "cian riordan",
    "date": "2022-10-27",
    "content": "Its honestly a great idea. I've never done it in the moment, worth a shot next time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035521233791496234",
    "author": "The Lemon Chef",
    "date": "2022-10-28",
    "content": "Eric also announced a 500 series UTA eq which is great. The mpeq-1 units are impossible to get. Only one on reverb is used for 2x retail.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036046817638498314",
    "author": "GaspardMurph",
    "date": "2022-10-29",
    "content": "Like if I play a click track loudly, I can hear them slapback",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047375239790723092",
    "author": "David Fuller",
    "date": "2022-11-29",
    "content": "Never tried that I should give it a shot next time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1048114041043820545",
    "author": "CK",
    "date": "2022-12-01",
    "content": "I like working in one large room. Does not need to be a control room, tracking room, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1049110099832090694",
    "author": "oaklandmatt",
    "date": "2022-12-04",
    "content": "@1ggy I chose this because I wanted maximum room (2 wheels and not 4) and some flexibility (strong material with some give) for a carry on. I always do carry on, never check.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053687054015402076",
    "author": "hyanrarvey",
    "date": "2022-12-17",
    "content": "Might put the amphions in the ssl room, but were also looking to sell both consoles",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1060799596349112340",
    "author": "cian riordan",
    "date": "2023-01-05",
    "content": "Sorry, realized I never responded. Trap kit as in just kick, snare, & hat. The super flyer kit, but with bottom heads on the toms (for better or worse).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061140605838823524",
    "author": "Eric Martin",
    "date": "2023-01-06",
    "content": "I don’t love my side-saddle computer for mixing, but tracking and mastering its significantly better, and I’m getting used to taking notes in the sweet spot listening down to an entire record like I would with a master and going back to do those specific mix notes vs doing the thing in the moment.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061304775020384306",
    "author": "Eric Martin",
    "date": "2023-01-07",
    "content": "definitely benefits my mastering and tracking work, I can’t say it benefits my mixing work",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061375274287120544",
    "author": "Zack Hames",
    "date": "2023-01-07",
    "content": "I’ve never liked how bedrooms sound for this reason (not to mention all the other reasons) but I’ve never not had a rug at an at home situation. Maybe because I share recording and mixing in the same space - maybe it wouldn’t be so bad. All the good studios I’ve worked at have just been hard floors but also big ass consoles.\n\nHmm. Worth experimenting with. Thanks everyone.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061381558197571604",
    "author": "ALXCPH",
    "date": "2023-01-07",
    "content": "Oh yeah? That big of a diff? I never liked the wheels on my Herman Miller. But my back loves the chair. Never thought about switching em out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061387345527586856",
    "author": "Zack Hames",
    "date": "2023-01-07",
    "content": "How do you address this when you need shit on either side of you? (Racks, keyboards, amps, etc). \n\nI see a lot of the unfuck rooms and they've got these massive gobos on either side of the mix position, but then the rooms are super super minimal mix or mastering rooms (or the photos show that).\n\nDo you put the panels as far as you can get away with and then put the stuff in front of them? Do they need to be straight or can they be angled or is that worthless? (Rauri, if this falls under your teach a man to fish/wanting a fish category, feel free to tell me to (un)fuck off)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061387474112364625",
    "author": "Nomograph Mastering",
    "date": "2023-01-07",
    "content": "Shit goes inside Gobos or in small low racks either side of you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061387684494442606",
    "author": "Zack Hames",
    "date": "2023-01-07",
    "content": "Cool. I've seen the low angled racks, those are suuuuper cool. So could you have the gobos relatively  \"FAR\" since they're pretty big/thick/deep?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061714753086566591",
    "author": "NoahNeedleman",
    "date": "2023-01-08",
    "content": "Im saying that conversation should have been had before tracking day.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061835119293378641",
    "author": "Zack Hames",
    "date": "2023-01-08",
    "content": "Its not set up at all, I JUST threw it in that rack. \n\nTbh I don’t mind it with the mix at 100% wet! At 4:1, slow attack, i like how it grabs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062211349947613254",
    "author": "cian riordan",
    "date": "2023-01-09",
    "content": "I’m on the Magic Mouse now for mixing. Switch back to the trackball for tracking because of the added buttons.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062213213204263035",
    "author": "cian riordan",
    "date": "2023-01-09",
    "content": "I find scrolling to be much smoother on MM than anything else I’ve used. Also talking with doctors, mice are better for wrist pain because they’re macro movements while trackballs are twitch micro movements. Not for everyone, but it’s working great for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062214124181930024",
    "author": "Deleted User",
    "date": "2023-01-09",
    "content": "Ohh yes. I hate trackballs. But I switched to vertical mouse and it’s alleviated finger and wrist fatigues a lot.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062215660068933694",
    "author": "Deleted User",
    "date": "2023-01-09",
    "content": "Lol 😂  When I used to use MM, I never charged and used it at the same time. I don’t think you can even if the charger was elsewhere. I might be wrong",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062216592303341569",
    "author": "Zack Hames",
    "date": "2023-01-09",
    "content": "What do you use the extra buttons for while tracking?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062349928296349717",
    "author": "ryount",
    "date": "2023-01-10",
    "content": "I do top left as left arrow, top right as right arrow. Let’s you really quickly jump to the beginning or end of a clip/selection for fades - changed the game for tracking. Bottom two buttons together is input monitoring.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064247759756087316",
    "author": "CK",
    "date": "2023-01-15",
    "content": "i tried a vertical mouse for a day, and it hurt my brain.  But this thread is making me reconsider. I love my trackball, but I still have some forearm pain.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064953101297139803",
    "author": "Slow Hand",
    "date": "2023-01-17",
    "content": "These things are worth their weight in gold. You can never have enough of them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064990483664875561",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "I have a Hilo goes AES to speakers and as my send/capture for the Massive Passive...you can't see it here but there is a rack under the screen where it sits. I have a side car off the side (the walls look pretty tight but they are actually the unf*ck mass loaded vinyl L things, so the room opens up more behind them). The sidecar is back from those...its got a apogee symphony taking the ins for my synths (also not really pictured -- just hangarounds from my production days for the fun of it sometimes), Hazelrigg VLC in there too.\n\nThere is sorta a whole room behind the listening position...its 30 feet long with a floating wall for absorption about 15 feet in so the studio is like 13x15 but acoustically its larger if that makes sense.\n\nI do use streamdeck...but mainly to switch quickly between the hot ref in Wavelab and my master. I've gotten deep into Applescript which essentially handles all of the other Wavelab processes...it's almost finished but my streamdeck will essentially just launch those applications to do what I need. So I'd say it's very useful, but the coding I've been able to do will render it sorta meaningless for me (though convienent, I use it for other things like navigating websites when doing client outreach, etc which is very handy and makes my workflow like an order of magnitude quicker).\n\nChair is hag capisco. I love it. Had a serious back injury when I was younger so I'm pretty dialed into having things be ergonomic and I find it's great. Actually kinda rather uncomfortable...in a good way. You can't really slouch. Took some getting used to but it's interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064991864916279357",
    "author": "ALXCPH",
    "date": "2023-01-17",
    "content": "Thanks for the detailed response. Appreciate it. \n\nCan’t wait to see how you get your tiny desk going. I recent went tiny desk(damn this discord) and while I actually hear a difference, getting it to look clean with all the cables and such has been a bit of a hassle! If you are staying with the same rack behind your screen screen system would you mind taking a picture from a different angle so that it’s visible? What kind of rack is it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064992965258395789",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "Let me know if that vid works! I also have some power strips mounted under the desk that won’t have a home in the new one, but they’ll just get shoved into the rack under the screen",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1064993643984846858",
    "author": "ALXCPH",
    "date": "2023-01-17",
    "content": "This makes so much more sense for my brain now 😅 thanks for that! Good idea using the rack as a monitor and interface stand.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065708433657049130",
    "author": "hyanrarvey",
    "date": "2023-01-19",
    "content": "I just love when the only thing that matters is the record and we’re recording and the world could be on fire wwiii outside and i’d never know",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067506492770635896",
    "author": "BatMeckley",
    "date": "2023-01-24",
    "content": "Yeah I’m pretty much never serious. If people haven’t figured that out theyre going to be shocked to find out that I actually enjoy hanging out with Cian in real life.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067590570966536343",
    "author": "Zack Hames",
    "date": "2023-01-24",
    "content": "Made some decisions about machine room/racks today, putting the floor and then the console in soon!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067697694329552946",
    "author": "ehutton21",
    "date": "2023-01-24",
    "content": "I know one of the boxes does 1176 compression",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067853635196829826",
    "author": "masteredbyjack",
    "date": "2023-01-25",
    "content": "Excited to check this...been building something similar. Right now it will take in all my project info, use that to create the file structure, upsample my originals using RX, create an entry in my Google Sheet project tracking app, create an invoice for the project with all the naming/pricing, then create, move the files into, and prep/save the Wavelab session for me.\n\nIt also copies all the project info into Wavelab and there is another script that names all the tracks/sets up the render too. All from that one data entry point in the beginning (mine is currently just an Applescript since it's still being worked on).\n\nYou gave me the initial idea, Nathan Dantzler at the Hit Lab gave me the idea to tie it all into the business backend.\n\nThank you so much, it's actually unbelievable how efficient it is, and there is only one possible point of failure for naming/QC which is easy to check.\n\nExcited to see what your app does, I'm sure I'll grab a cool idea or two from it!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067909505163215049",
    "author": "peterlabberton",
    "date": "2023-01-25",
    "content": "Yes! Ha. My very first outboard pre. Barely gets used but handy in a pinch.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068041609792467045",
    "author": "peterlabberton",
    "date": "2023-01-25",
    "content": "Oooo does that fall in the (remotely) $3k category these days?! (If so, I wanna track one down. If it’s got a brass capsule.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068265145471615006",
    "author": "jantrit",
    "date": "2023-01-26",
    "content": "Interesting! I can only really speak to this 414 variant, never heard any of their other stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068304204805976134",
    "author": "ALXCPH",
    "date": "2023-01-26",
    "content": "Just started on a track with someone, and it has mad cymbals! Lfg! Big ride going hard!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069336078085017682",
    "author": "Zakhiggins",
    "date": "2023-01-29",
    "content": "The rack one wasn't used, actually sounds great on snare with the pad attachment and in cardioid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071621083138113586",
    "author": "Calvin Lauber",
    "date": "2023-02-04",
    "content": "You referring to the black inside kick mic? It’s a Beyer 740. Never used one but sounds really cool. And a trusty 201 on the snare 🤠",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072283847695286345",
    "author": "Eric Martin",
    "date": "2023-02-06",
    "content": "I had one of those Guitar Center desks and like 3 rack cases full of rack mount stuff, the Plan A got my into almost half the footprint",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073536037600645130",
    "author": "peterlabberton",
    "date": "2023-02-10",
    "content": "Mainly I’ve just been mashing drums through the compressor and having fun mangling stuff, but I think it will be nice for more subtle uses as well 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1074081527236919396",
    "author": "Will Melones",
    "date": "2023-02-11",
    "content": "Wowww I’ve never seen a closeup of the graphics on that bad boy, but that is kinda luxe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1074093116832886795",
    "author": "sukhuno",
    "date": "2023-02-11",
    "content": "It’s all for tracking, I’m ABing them right now and the difference is not = to the price difference of the 2 units. Like the cl1b sounds a bit more in your face but only  like fractionally better than the dragon",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1074096875713609759",
    "author": "popthetrunk",
    "date": "2023-02-11",
    "content": "Oh I’m talking tracking as well, but I assumed you were running them into each other, and was curious about what was doing the heavy lifting. \n\nI haven’t used a dragon in a while, but that and a tube tech are very different sounding to me, almost not comparable. If it doesn’t sound worth it to you, you kinda already know",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077364700385390592",
    "author": "David Fuller",
    "date": "2023-02-20",
    "content": "If you need your outboard in front of you: Zaor, Jamracks, Sterling Modular all have stuff. It ain't cheap. \n\nIf you don't: literally any small computer table will work.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082137913762009178",
    "author": "jantrit",
    "date": "2023-03-05",
    "content": "It’s a real game changer, especially when you’re using clips and track in a thick wall system, where you have absolutely zero chance of finding track with a stud finder",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085349638325932196",
    "author": "ehutton21",
    "date": "2023-03-14",
    "content": "RAB rack. I wanted a gatorworks one but those were on back order till like late April 😵‍💫",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086007447380037753",
    "author": "ehutton21",
    "date": "2023-03-16",
    "content": "A rabbithole (from hell) I will never go down!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086028930248605696",
    "author": "ALXCPH",
    "date": "2023-03-16",
    "content": "For me it’s a journey of learning when to be a perfectionist and when not to be. I’ve gotten to a point now, that when I’m in creative mode, I just want to get broad strokes down, and then when there is time(if that happens) that is the time to go hard on details or retracking or whatever the task is.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086029257165242478",
    "author": "ALXCPH",
    "date": "2023-03-16",
    "content": "I Think its hard to let go being a perfectionist because of how quick everything moves. We are never sure if we get to see that project file again before it’s going into the world.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088211804154495026",
    "author": "LAPhill",
    "date": "2023-03-22",
    "content": "Congrats! Don't discount sound transference when deciding where to setup. Shared walls/floors/ceilings. Tracking a quiet part when footsteps go by can ruin a take, but hearing 808s through the wall when your partner is trying to sleep can ruin a marriage.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088213071123714178",
    "author": "Zack Hames",
    "date": "2023-03-22",
    "content": "@hyanrarvey yep, that whole room will be gutted, the garage is right above it and has a crack in the garage floor. not a big one. and there is rust only on the middle, RIGHT where the crack is....so again. I think this was just 18 years of dripping",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088256216599384144",
    "author": "Slow Hand",
    "date": "2023-03-22",
    "content": "Hell yeah. Never run from the truth when you're confronted by it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090353281819226222",
    "author": "Zack Hames",
    "date": "2023-03-28",
    "content": "Been listening and working in this room today for the first time since 2014; honestly sounds pretty amazing. Idk about perfect but it’s definitely a great room and the speakers aren’t bad. Lots of nice things about them, very immersive. Only thing is the monitoring is going through a Neve 8816 Summing Mixer as the monitor controller and I’m not convinced it’s super clean/transparent.",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1091402696650666004",
    "author": "BatMeckley",
    "date": "2023-03-31",
    "content": "The pmc’s sound really great in there now. Very impressed with the magic. The room significantly better than the first time I heard it, and it was good the first time. Sounds like the PMC 6-2 just fundamentally have a “impress the guitar center kids” high lift that anybody serious immediately shelves out of them. (Though I’m not sure how everybody missed the noise the track lighting makes.)\n\nI REALLY wanted to see the adjustments you made to the speakers but the cat 5 cabling was screwed up at the time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091413018295947436",
    "author": "Nomograph Mastering",
    "date": "2023-03-31",
    "content": "Yep, I’ve never set up a 6-2 without some attenuation of HF",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091441567304257647",
    "author": "masteredbyjack",
    "date": "2023-03-31",
    "content": "Very interesting, you are in the exact opposite camp then!\nOr course rooms, treatments, etc are different for everyone\n\nSuch a taste based thing...either of the options or their combos (high shelf attenuation on/off, sub boost on/off) were in the \"fine\" category. But I like loads of lows, suppose that's why I like Castelli stuff haha\n\nTo be fair though, I just picked the one that felt right up front and never have thought about it again",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093961924414275775",
    "author": "lystell",
    "date": "2023-04-07",
    "content": "Huh! How about that. The whole cinder block business is kinda different over here. Need to dig a little bit deeper.\nStill doing the NS10 on the side thing? Appreciate it? Not sure if I’ll do that or bring mine to a friends studio where I usually track stuff.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093973230651457647",
    "author": "Jeremy Klein",
    "date": "2023-04-07",
    "content": "disclosure: i have never heard an NS-10 in my life",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093998534191239219",
    "author": "cian riordan",
    "date": "2023-04-07",
    "content": "I actually never did it once the last set of speakers was finished being tuned. Likely to do another round with these new monitors and will try and get some results up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094023701734895737",
    "author": "Gerhard Westphalen",
    "date": "2023-04-07",
    "content": "I’m not saying it’s wrong to use them but they’re literally bad speakers that were never designed correctly. It’s like if you disconnected the tweeter on your speakers. Sure, someone could find that useful and work with it but it wouldn’t be a “good” speaker",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094031439521132625",
    "author": "Gerhard Westphalen",
    "date": "2023-04-07",
    "content": "Good luck convincing anyone NS10s are objectively good speakers. NS10s were never released as some bizarre speaker for mixing on. They’re bookshelves for home use. Try convincing anyone they’re the right choice for your home stereo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094036230678790235",
    "author": "Gerhard Westphalen",
    "date": "2023-04-07",
    "content": "I never said it was the frequency response that is to blame for this. I just said the frequency response is representative of the problems there. If you EQ a speaker to match that it won’t sound like an NS10 cause you won’t have all of the problems from their crossover",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094413786787614822",
    "author": "hyanrarvey",
    "date": "2023-04-08",
    "content": "Oh nice dude you got the rack in the wall situation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094414693973635122",
    "author": "Zack Hames",
    "date": "2023-04-08",
    "content": "Im going to just rack my UTA’s and Ampex 351’s and my slate dragon and mark my territory",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094636035780116480",
    "author": "John Freyermuth",
    "date": "2023-04-09",
    "content": "Also want to point out that I have found them very useful for tracking dates and frequently bring them with me. Great for drums in iso booths.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094721916058734632",
    "author": "Andy Lawson",
    "date": "2023-04-09",
    "content": "Will hit @Gerhard Westphalen  up. Thanks. I guess it is a square at the root. So room simulation will help me find a good spot, never thought to try as of all the angles in there. Re the kii’s,  maybe not the most punchy but I can feel them in other spots in the room, so just extracting some of that would be a good start. I measured flat but always have a -3db from 7.5k on the kii control",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094728853492080741",
    "author": "Gerhard Westphalen",
    "date": "2023-04-09",
    "content": "I've played around with placing subs around the room to optimize things that way and that was also never great. I certainly don't subscribe to the home theatre approach (largely developed by Geddes IIRC) of crossing everything to bass management at 80Hz and then having 4 or more subs positioned optimally around the room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095388666941157466",
    "author": "NoahNeedleman",
    "date": "2023-04-11",
    "content": "Ok so whenever I change anything in my room the imaging is the first thing I notice. Did you move your speakers at all?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097731094499037225",
    "author": "jantrit",
    "date": "2023-04-17",
    "content": "Thanks! It’s funny I was never a burgundy in the studio type of dude but I ended up going that direction when I built this spot out and it fits quite nicely with the white walls/ wooden floors/ green plants!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099826763032436756",
    "author": "Deleted User",
    "date": "2023-04-23",
    "content": "Lol I mean we still can make it happen, we got a projector installed there. You’ll never get a better sounding porn experience",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103735917568598057",
    "author": "Tim O’Sullivan",
    "date": "2023-05-04",
    "content": "I love them, use them on overheads, drum rooms or vocals a ton. Nothing like an LA2A at all.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104217523248963654",
    "author": "Josh Bowman",
    "date": "2023-05-05",
    "content": "I still havent found this to sound right to me... i tried it in my last room and this new room and really gave it a spin for a few months, but whenever i put more panels on the front wall/behind the speakers i like how the (small) rooms im using sound more than a totally front bare wall. The middle panel does help but still sounds worse to me in here than having two 2x4 panels on the front. Would putting the panels not behind the speakers but still covering a little more of the front wall be a potential compromise for having the speakers right on the wall while still sounding \"right\" to me? Or does that still defeat the purpose of the \"No treatment on the front wall\" rule?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104230374017601546",
    "author": "Josh Bowman",
    "date": "2023-05-05",
    "content": "Its likely totally just personal preference from hearing speakers like this for 8+ years in a row.. but whenever i take the treatment off the front wall i just feel like im hearing the wall/small room early reflections more and it make me feel less connected to whats coming out of the speakers than when i do have some treatment up there. Its really hard to a/b directly but i've tried a few times and thats the conclusion i've drawn. Im excited to make it out to LA again soon to check out some high end rooms and see what im missing out on. Happy to have my mind changed.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106800483001192488",
    "author": "Andy Lawson",
    "date": "2023-05-12",
    "content": "Also any advice on cable management would be greatly appreciated ,the front of my room is now all open and I’ve never really had to think about making that side of the room look good (it’s always been hidden by gear",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107037081001263244",
    "author": "Rollmottle",
    "date": "2023-05-13",
    "content": "Oh man those were awful. Really never understood those. Boomtown",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107037398950498415",
    "author": "Gerhard Westphalen",
    "date": "2023-05-13",
    "content": "I’ve seen some people like the pros and hate the maxes but I’ve never heard the maxes. I do like the pros",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107044849359798313",
    "author": "ALXCPH",
    "date": "2023-05-13",
    "content": "Assuming the music is never listened to anywhere else I guess it’s kinda right. Just not very realistic 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107430725856284832",
    "author": "Rob Domos",
    "date": "2023-05-14",
    "content": "Looking now, it’s entirely possible I heard the Manny 100s and thought they were the manny 500s. I just head “the manny headphones” and didn’t like them and never thought of them again. Didn’t realize there was a distinction",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108960130537619457",
    "author": "Andy Lawson",
    "date": "2023-05-18",
    "content": "yeah i think they fit the bill for me.. will i need subs with the atc's? probs when we are tracking.. i have a pair of yamaha cheap subs, so can at least try that out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109144369535135744",
    "author": "jmlongmusic",
    "date": "2023-05-19",
    "content": "Hey everyone! I’m new to the community - really enjoying it so far. This will be a long post asking for some studio build advice — I hope that’s ok. Please just let me know if there’s a better thread for this sort of thing. \n\nI’d be extremely grateful for any feedback! Here’s some info: \n\n- I am currently moving my home studio to this basement space that is about 400 SQ feet. Concrete floor and walls except for the front wall shown in this picture - that is drywall as it separates the rest of the basement. \n\n- The ceiling joists are exposed and are about 7.5” deep. \n\n- My primary function for this room will be mixing, but I will also be doing smaller overdubs like piano and vocals. \n\nCurrently, after painting the walls and floor, my plan is as follows: \n- Stuff the ceiling joists with insulation — probably Safe N Sound… thoughts on that choice? \n\n- Cover the joists with fabric from Gilford of Maine. \n\n- Figure out how to drill into concrete 😂 Then put panels everywhere. Most of my panels are about 4” thick and are comprised of the safe n sound insulation. \n- Put some big rugs down but also leave a bit of the concrete exposed if possible cuz I like the look. Haha \n\n- My monitoring set up is NS10M’s (don’t laugh) with an Avantone CLA-100 amp and a PreSonus T10 sub. I’ve got an Apollo 8 Duo and Apollo Twin X Quad. \n\nThat concludes my plan so far. Am I on the right track? 😳 \n\nI really appreciate any feedback you’re willing to give. 🙏",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1109204106725314570",
    "author": "youngteam",
    "date": "2023-05-19",
    "content": "this looks great! congrats on this man. eventually a bespoke piece with rack space would be ideal for sure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109293399024091198",
    "author": "peterlabberton",
    "date": "2023-05-19",
    "content": "But I never installed that silly side thingy at the bottom",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109863655903862784",
    "author": "Ross Fortune",
    "date": "2023-05-21",
    "content": "Right, but I have the DSP EQ working away on the PMC 6, and there is fractional latency while tracking. It’s noticeable, but still workable (though I’ll switch to the NS10s while I’m playing guitar for instance). \n\nWith the Kiis though, it was almost like a deliberate 1/16th slap type thing. Unusable as a tracking monitor.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109877494045225042",
    "author": "Ross Fortune",
    "date": "2023-05-21",
    "content": "Hard to compare with the whomping EQ curve I have going on the PMC, and was just tracking vocals over temp instrumentals with remote attendees this morning so not ideal conditions to critique.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109879201110171790",
    "author": "Ross Fortune",
    "date": "2023-05-21",
    "content": "Nope. When I say low(ish) end I’m talking more 100Hz, but it was notable that flipping in the Kiis didn’t seem to extend that so noticeably. Tracking to rough instrumentals though, so the info might just not have been there. Had a lot to set up so minimal time acclimatising",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112171954082951169",
    "author": "Gerhard Westphalen",
    "date": "2023-05-27",
    "content": "Are those older PCs? I managed to get rid of my slaves with my last PC build and it could run my >1000 track template (mostly Spitfire). Don’t see too many people running slaves anymore. There’s only one studio I do tech work for that’s still using a slave but even then, it’s just a single PC so that VEP isn’t running on their Mac DAW",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112187295957790771",
    "author": "Nomograph Mastering",
    "date": "2023-05-27",
    "content": "If you haven’t got up close experience of how demanding these templates are it’s hard to imagine. My homie/old studio mate is a trailer composer for Marvel/Nolan level movies. Intense deadlines with a 1300 track template",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112188738567688213",
    "author": "Gerhard Westphalen",
    "date": "2023-05-27",
    "content": "I know someone who literally had a duplicate rig in the room next door for this. Eventually tore it down since it never got used",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112189228982485042",
    "author": "Gerhard Westphalen",
    "date": "2023-05-27",
    "content": "Yeah and home setups but I’ve never seen anyone else who had an entire system that sat unused other than maybe HZ",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112189342388064267",
    "author": "Rollmottle",
    "date": "2023-05-27",
    "content": "Can somebody enlighten an ignoramus like me what goes in to a 1300 track template?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112189673641619597",
    "author": "LAPhill",
    "date": "2023-05-27",
    "content": "Many composers choose to work with what's called \"articulation per track.\" As in, violins long, violins short, violins pizz, violins trem, etc. etc. etc., so it adds up quickly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112190543296995439",
    "author": "Rollmottle",
    "date": "2023-05-27",
    "content": "Wild scene. Me over here with a 3 track template 😎",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112194338781413456",
    "author": "LAPhill",
    "date": "2023-05-27",
    "content": "I'll usually map things out with a piano track or a full strings track, maybe a few other instruments as I go (i.e. I know this is going to be a flute melody), but it's all part of the same template",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112936214631297165",
    "author": "ehutton21",
    "date": "2023-05-29",
    "content": "Thank you 🙏 Only question I have is how much I should be watching heat and ventilation re: the unit. I realized my UA runs pretty hot and I’m sure support to service the preamp would be possible should I need it, but was curious if any other owners have had to pay mind to rack position/temperature during longer sessions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121838342619799692",
    "author": "Eric Martin",
    "date": "2023-06-23",
    "content": "I always do that for live shows, but when writing a record/ tracking it makes sense to flow everything that way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122181440411537429",
    "author": "JakeTB",
    "date": "2023-06-24",
    "content": "My favorites as well. Mixed a couple Martin rigs recently that also impressed me at a lower price bracket.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1127604602825621625",
    "author": "Josh",
    "date": "2023-07-09",
    "content": "I get a 500 series rack of pres and EQs, other side of the desk is a 2A, MC77, Distressor, Audioscape G Comp, and a Fatso.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128040413798866984",
    "author": "Josh",
    "date": "2023-07-10",
    "content": "It’s awesome. I love it. It’s super easy to fly around. Routing is good enough for anything you’d need like. Don’t particularly like how you can only have one track sent to a plug-in insert. But I’m getting by",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128431183076802680",
    "author": "Eric Martin",
    "date": "2023-07-11",
    "content": "Primary goal is a place to Master, Mix, and Track records not in my house where sound isolation isn’t easily possible, current basement has 6’2” clearance in some places so doing a buildout seemed like a fools errand.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129448209211736095",
    "author": "Bryan DiMaio",
    "date": "2023-07-14",
    "content": "And to me it doesn't look too cluttered but if you wanna downsize rack gear I guess you could figure out what's most important to your workflow and then store the other units elsewhere for a while, if you don't end up pulling some of them back out then it'll be a good starting point to figure out what to keep?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129452911559188571",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "For those interested in the tiny desk/midi thing (and want to do it premium) — had a 37 key fatar keyboard midi controller built into my desk, purely for hobby reasons, I never use it mastering but I like to touch keys every so often to stay connected with the creative side of the process. Slides in on accuride slides and is beastly sturdy, does not move at all when played.\n\nAnd since it can be attached to the slides from the side of the keyboard, you can get it right up to the bottom of the desk, you’d never know it was there (and since all day every day is mastering for me that’s very important in my case!)",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1129454992160469094",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "I could never find the solution I needed, everything took up too much room which would raise the desk for my mastering, which is really all that matters, so just designed it and had it built.\n\nIt’s overkill but I just wanted to do it once right and be done",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129455613471101118",
    "author": "Deleted User",
    "date": "2023-07-14",
    "content": "I believe it’s a worthwhile investment. Get it right once and never look back!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129457204391579709",
    "author": "Adam Thein",
    "date": "2023-07-14",
    "content": "the amount of times I sneak a little sub into a track is more than I should",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132142830903631985",
    "author": "Nomograph Mastering",
    "date": "2023-07-21",
    "content": "I’m dangerously close to picking up a pair for home",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1133527086544466081",
    "author": "chrissorem",
    "date": "2023-07-25",
    "content": "Thanks! I’ve never used altec M11’s as overheads! Holy shit!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136685214026973296",
    "author": "cian riordan",
    "date": "2023-08-03",
    "content": "https://www.soundonsound.com/people/inside-track-alabama-shakes-sound-color?amp",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143063683027718215",
    "author": "Slow Hand",
    "date": "2023-08-20",
    "content": "On another note, I own several bins like this that I pull out whenever I move. I've owned them for a decade now:  https://www.homedepot.com/p/HDX-12-Gal-Commercial-Flip-Top-Storage-Tote-in-Gray-206202/313792518",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1145875665808261171",
    "author": "Eric Martin",
    "date": "2023-08-28",
    "content": "I almost bought one of those last year, ended up with a AMS Neve 1073DPX, interested to hear your opinion on this specific piece of kit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1145892881861722162",
    "author": "Eric Martin",
    "date": "2023-08-28",
    "content": "I use the waves channel strip a lot and assumed this would be a great thing, it’s on my wish list",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1145916780938789014",
    "author": "BatMeckley",
    "date": "2023-08-28",
    "content": "Opto. Big part of why I asked for them to send me one. On a big opto compressor kick as I’ve discovered most vari-mu comps aren’t for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1146958505320923206",
    "author": "Deleted User",
    "date": "2023-08-31",
    "content": "lawsuit incoming when the rack falls from the overhead cabinet",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151358182447403048",
    "author": "Eric Martin",
    "date": "2023-09-12",
    "content": "literally patching with the patchbay, pulling up mics with the big Westlake’s live",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152310141589409874",
    "author": "jantrit",
    "date": "2023-09-15",
    "content": "What’s bottom of the right most rack in that picture? OG vt2?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152332807604015124",
    "author": "jantrit",
    "date": "2023-09-15",
    "content": "Largest contact size in a rack able connector.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152995671146774608",
    "author": "chrissorem",
    "date": "2023-09-17",
    "content": "I dig a royer but never heard a Mojave I loved. Strangely there are a couple one off mics David made that are supposedly Mojave’s but they sound better. One is at Rancho de luna",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153747428806238310",
    "author": "itMIGHTbeNICK",
    "date": "2023-09-19",
    "content": "This is my humble home setup in the corner of my bedroom. There’s nothing glamorous here. While I’m still building out the room downstairs and things have been at a hault due to some financial difficulties I won’t get into. I’m doing most of my work right here these days if I can’t get studio time at my buddys space. I’m incredibly proud of the mixes and masters I’ve been able to do in this little corner. I set up some gobos and tube traps I have in the closet when I’m getting deep into the mix and it’s all been working out as best as it can for the situation at hand.\nNS10’s have the cap mod. \n\nWhen I need to track my guitar amps I completely isolate them with long cables and treatment directly in my closet or I will close off the bathroom and treat them in there as well as capture the natural reflection in our bathroom. My wife and kids are so incredibly sensitive and generous to me during this time to even let me still be able to work and make this happen while the studio build is on hold and we’re having to make things work.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1156705334468018216",
    "author": "LAPhill",
    "date": "2023-09-27",
    "content": "At least my Halloween tracks are delivered",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161807097290305566",
    "author": "cian riordan",
    "date": "2023-10-11",
    "content": "Great question and I'm not quite sure yet. It's not a permanent fixture so I don't know how deep I want to get into integrating it in the patchbay. All the channels have direct outs, and there's two very different flavors of mix bus on it. I might quickly rig it up and see if there's any real sonic value (as a mixer) before I go nuts with dilaing it in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1163096933729042512",
    "author": "Josh",
    "date": "2023-10-15",
    "content": "I’ll let him know you think he has a rockin rack",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1166600200635302009",
    "author": "montrose recording",
    "date": "2023-10-24",
    "content": "regarding converter to patchbay wiring - is a bunch of 8 ch db25s better than 32ch snake cable with 4 db25s per end - organization wise ?  they’re really short runs in the same rack…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167929125042933780",
    "author": "Nomograph Mastering",
    "date": "2023-10-28",
    "content": "Man, first setup ever was a Yamaha MT4X cassette 4 track, and an SM58",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167935481913290772",
    "author": "LAPhill",
    "date": "2023-10-28",
    "content": "First setup was M-Audio BX5s, original MBox, tracking bands through a Mackie board and no idea what I was doing. I remember having an all-in-one drum mic kit from Audix that probably cost $99",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167984382401847306",
    "author": "cian riordan",
    "date": "2023-10-28",
    "content": "Like, if I’m at a big studio and there are other mics… there’s never a point where I’m reaching for one. But again, take em over a rode or a royer any day.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168204692963213442",
    "author": "chrissorem",
    "date": "2023-10-29",
    "content": "Never tried it but I’ll take@your word for it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168250378840707154",
    "author": "Will Melones",
    "date": "2023-10-29",
    "content": "And a behringer mixer, probably just for the looks. There’s probably a graphic EQ back there from my parents’ home AV system that I never could get integrated",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169261031395164161",
    "author": "cy (sigh)",
    "date": "2023-11-01",
    "content": "prickle pear in English \n\ntuna in Spanish. it's very common in Mexico and also very refreshing. \n\nwould never try that though 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171631125173641246",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-07",
    "content": "Just regular keyboards and mice for me. My hands can't do trackpads for very long either. *Today I learned my hands are bad",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171631634076934245",
    "author": "Rollmottle",
    "date": "2023-11-07",
    "content": "I’m so much faster on the track pad than the Magic Mouse, but haven’t tried it in the studio context. I should give it a go.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171635488638124163",
    "author": "Eric Martin",
    "date": "2023-11-07",
    "content": "I find the click on the trackpad is what kills my wrist, something about the pressure that I can’t get used to",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171851014064840704",
    "author": "Eric Martin",
    "date": "2023-11-08",
    "content": "Magic Mouse & Tracking set as fast as it will go is how I roll",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171876233416552539",
    "author": "NoahNeedleman",
    "date": "2023-11-08",
    "content": "It’s so wild when you start to get things really dialed, issues you never realized were there become glaring.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171888119168118795",
    "author": "joshbonanno",
    "date": "2023-11-08",
    "content": "truly! mainly because in the grand scheme, they were likely never \"issues\" to begin with, but yes. been a journey.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171959295676518490",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-08",
    "content": "Awesome. I’m trying out trackpading on my new macbook since yesterday, if I can make it work as fast, travel setup will have 1 less thing which I love.\n\nWhat do you use magic mouse/trackpad for that trumps a mouse? Is it mainly navigation?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171965109032210543",
    "author": "cian riordan",
    "date": "2023-11-08",
    "content": "Are you using it in lieu of your macbook trackpad when you travel?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171976005632675840",
    "author": "BatMeckley",
    "date": "2023-11-08",
    "content": "Yup. All the time. On a plane or train not so much. But whenever I get to where I’m going it comes out. \n\nThings like the keyboard and especially the trackpad get so much mileage on em that I find it much easier to replace a Magic Trackpad than get my MBPro fixed.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172042411837501440",
    "author": "Garth Tim",
    "date": "2023-11-08",
    "content": "trackpads are too slow for me. i pretty much max out my mouse speed lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172082059259420783",
    "author": "Edward Rivera",
    "date": "2023-11-08",
    "content": "Same. While not a fader, it's way closr to that feeling than a ball of god forbid a mouse. Also it's good to be closer to the keys. \n\nPlus tap-to-click adds to the longevity of the trackpad and reduces wrist strain",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172125070890647622",
    "author": "Edward Rivera",
    "date": "2023-11-09",
    "content": "Im using remote mouse to use my phone as a track pad",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172213255133999186",
    "author": "hyanrarvey",
    "date": "2023-11-09",
    "content": "Been to a lot a lot a lot a lot of studios where I’ve tracked drums believing I had gods gift to drum engineering omly to find out the drum room bleed was really what I was hearing LMAO",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172219818829697044",
    "author": "hyanrarvey",
    "date": "2023-11-09",
    "content": "It’s never like I get home and it’s sounds terrible",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172220132681060503",
    "author": "Eric Martin",
    "date": "2023-11-09",
    "content": "I literally feel the drums while track king",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172222221423480954",
    "author": "hyanrarvey",
    "date": "2023-11-09",
    "content": "My ears being shot from tracking drums for 12 hours is probably not helping either",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172224772684398704",
    "author": "hyanrarvey",
    "date": "2023-11-09",
    "content": "Its a lot of things but it’s never the weed hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172229656150282332",
    "author": "cian riordan",
    "date": "2023-11-09",
    "content": "Barefoot didn't have the best isolation being such an old studio. We had a decent sized iso booth next to the A control room that was this really cool, tubby sounding room. But it was only separated by a cheap, chincy glass door -- so whenever you'd do drums in there it was always a bit of a guessing game how it really sounded. But it was worth it for the character of the room. I remember when I first started building studios I was so obsessed with trying to get the best isolation... now I'd almost prefer a big open studio with clear sightlines and just use baffles or gobos to do spot isolation on mics.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172241531348979823",
    "author": "hyanrarvey",
    "date": "2023-11-09",
    "content": "When I was younger it was like we could track at my place but you said your parents have a giant 2 story house in the woods?! With a massive living room and stone fireplace?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172627497825873990",
    "author": "Nomograph Mastering",
    "date": "2023-11-10",
    "content": "I made a boundary peak/dip calc in google sheets that is very helpful when trying to track what’s modal and what’s boundary interference",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172654795551678464",
    "author": "Josh",
    "date": "2023-11-10",
    "content": "hahahaha yeah, probably worst than WA1B, needs 3 rack space",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175574976070439022",
    "author": "montrose recording",
    "date": "2023-11-18",
    "content": "also check out this patchbay/converter rack my buddy made - stoked about it!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179557795696218152",
    "author": "cian riordan",
    "date": "2023-11-29",
    "content": "(Yes I know I should get a black trackpad…)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179565782229864468",
    "author": "Bryan DiMaio",
    "date": "2023-11-29",
    "content": "Is the palm rejection on the external trackpad as good as on the laptops?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179577910953267371",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-29",
    "content": "Looks cool, didn’t know that existed! I went full trackpad since the last convo and am loving it. As you said, navigation is so much easier!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179586630890307654",
    "author": "Will Melones",
    "date": "2023-11-29",
    "content": "Is it dumb to have a trackpad just for scrolling and a mouse for cursor action?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179586975754358826",
    "author": "Will Melones",
    "date": "2023-11-29",
    "content": "And if clicking were a non-issue, would a cheap, off-brand trackpad be tolerable?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179590202117853235",
    "author": "Will Melones",
    "date": "2023-11-29",
    "content": "Like so many things Apple. I believe it. I never like them on PC laptops (and scrolling is part of the reason, now that I’m thinking about it).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179616920677384212",
    "author": "Rollmottle",
    "date": "2023-11-29",
    "content": "Also, me, a dummy, didn’t realize the trackpads have no moving parts. That’s how convincing the haptics are.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179668182424887356",
    "author": "Will Melones",
    "date": "2023-11-29",
    "content": "Is that recent? I remember around 2018 trying to use one on my lap, and I couldn’t click because the feet on the bottom front were the buttons. It was a disappointing feel compared to a MacBook trackpad where I was used to clicking anywhere on the surface.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179829717810032782",
    "author": "john",
    "date": "2023-11-30",
    "content": "Did you know that Kuk Harrell and Ayo Juan uses the trackball mouse for the computer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179963687935672522",
    "author": "cian riordan",
    "date": "2023-11-30",
    "content": "But more often than not, it's a U87 -> UTA Pre -> an 1176.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180912542567112754",
    "author": "montrose recording",
    "date": "2023-12-03",
    "content": "heyall - in the middle of trying to properly format and label my new redco patchbays and curious if anyone can post a snap of their bay for some context.  i feel like im a little in the weeds and some examples would be v helpful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180915684276969623",
    "author": "Deleted User",
    "date": "2023-12-03",
    "content": "https://www.dropbox.com/scl/fi/1uk14lcsbx4qgtqv1zwm6/Patchbay-Layout-v5.numbers?rlkey=84ix2snd6hxrippphb5pimivq&dl=0",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180917018694795458",
    "author": "hyanrarvey",
    "date": "2023-12-03",
    "content": "So it goes 1. Mic lines /\n2. More mic lines\n3. Out board gear\n4. More outboard \n5. Interface outs\n6. Console line ins\n7. Mic/line switch outputs\n8.equalizer inputs \n9. Console insert send / returns\n10. Direct outs\n11.interface IN \n12 blank\n13 blank \n14. Console center section\n15. Aux sends",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180951166683725935",
    "author": "hyanrarvey",
    "date": "2023-12-03",
    "content": "https://traceaudio.com/collections/patchbay-labels",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181436006726115419",
    "author": "cian riordan",
    "date": "2023-12-04",
    "content": "But you miss the midrange solidity of the neve",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181436155951059077",
    "author": "cian riordan",
    "date": "2023-12-04",
    "content": "And you can push the channels more musically on a neve… the tridents fall apart a little sooner",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182050945044054157",
    "author": "montrose recording",
    "date": "2023-12-06",
    "content": "console goes below it.  inspired by both lack of space and old school control rooms where the outboard was up high.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182101244228157570",
    "author": "montrose recording",
    "date": "2023-12-06",
    "content": "ssl bus comp i made years back.  sounds good!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182433357662015589",
    "author": "peterlabberton",
    "date": "2023-12-07",
    "content": "There's a lot of things I miss about daily tracking engineer life but that's not one of them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182461706178412564",
    "author": "Skyler Young",
    "date": "2023-12-07",
    "content": "I met an engineer randomly this weekend who worked at the same studio I did after me. I’ve never had such an immediate trauma bond",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186546029475139675",
    "author": "peterlabberton",
    "date": "2023-12-18",
    "content": "I’d go with nice vintage U87s… but the cost vs utility (for me) equation might not add up. And I’ve never loved 414s besides old brass capsule 414 EBs… so 🤷🏻‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186615119791271957",
    "author": "Barbara",
    "date": "2023-12-19",
    "content": "I'd like to try a um70, but never got my hands on one of those...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187441562603495504",
    "author": "chrissorem",
    "date": "2023-12-21",
    "content": "It’s not always easy to put a pipe organ in a track but when it does you’re right nothing like it!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187443621687988224",
    "author": "chrissorem",
    "date": "2023-12-21",
    "content": "Damn I’m coming over for a reading. You’re intuitively right. I recorded it on a neve vr60 clocked to a Big Ben.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187444488860348427",
    "author": "Will Melones",
    "date": "2023-12-21",
    "content": "And they had a Neve VR hangin around, or you brought one from home?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190792820190093312",
    "author": "Gerhard Westphalen",
    "date": "2023-12-30",
    "content": "Keep in mind speakers can get damaged even if you don't see it. I shouldn't mention any specifics but I once had a speaker shipped with pretty decent packaging (double boxed, foam etc) which UPS managed to drop so hard the woofer's motor tore entirely off. It wasn't even some cheap stamped frame. High end pretty heavy duty (metal) frame. Yours might not get damaged to that extreme but could get cracked and have problems later on. Shipping speakers that are large enough to have real weight to them but not heavy enough that you need a pallet is risky business. Almost guaranteed to get tossed off a truck",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1192282301174927470",
    "author": "cian riordan",
    "date": "2024-01-03",
    "content": "Example of the former: https://open.spotify.com/track/0ZQVoMioqDeca9zN3iONat?si=adb263518cf842c7",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1192282332690919484",
    "author": "hyanrarvey",
    "date": "2024-01-03",
    "content": "When I was at iiwi I got to use the la2a on the rca77 full dimed on both sends and it was such a cool vibe especially with that giant room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195954366977425479",
    "author": "popaganda.",
    "date": "2024-01-13",
    "content": "Put everything perfectly between my speakers when I track?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1198061689388683264",
    "author": "Eric Martin",
    "date": "2024-01-19",
    "content": "I was gonna leave it like that, tracking drums tomorrow, we’ll hear how soundproof it is 😆",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210714870513664062",
    "author": "James Redfern",
    "date": "2024-02-23",
    "content": "Right on, I think the sit/stand element makes a ton of sense. Whenever I’m working in other peoples rooms, it’s so uncomfortable because of my size and at my spot I’m kinda tired of having the controller on the desk. I’ll definitely check out the options mentioned so far!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210731677178142720",
    "author": "NoahNeedleman",
    "date": "2024-02-23",
    "content": "I could never work on 6-2s, but I get the hype.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210744040644026368",
    "author": "cian riordan",
    "date": "2024-02-23",
    "content": "I've been tracking in a studio with ATC 25s and now I'm reconsidering my statements on not wanting to record/produce through the PMCs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214029197601800242",
    "author": "rileybrewer",
    "date": "2024-03-03",
    "content": "Curious how much action the reel to reel sees? I’ve been eyeing a 4 track 👀",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214358783455658005",
    "author": "cian riordan",
    "date": "2024-03-04",
    "content": "Your pop filter thoughts were mind opening, curious if a vocal vet like yourself has opinions on shock mounts. I rarely have thought about them — I just use what’s on the mic. Most of my vocal tracking I do with a U87 with no shock mount and have never had issues. I’ll take my answers off the air.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218017361496375367",
    "author": "cian riordan",
    "date": "2024-03-14",
    "content": "Can I ask if you're using them? Anytime I'm in a big studio that has one, I'm always reluctant to track through it. They've always just had weird shit going on or are too fast, too bright, too harsh, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218018403030139011",
    "author": "cian riordan",
    "date": "2024-03-14",
    "content": "Give me one in a mix room that's dialed and some time to fanagle it, they're just simply wonderful. But comitting to one while tracking is... extreme. I'm not George Martin, and I don't live at Abbey Road.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218203950441037844",
    "author": "Josh Bowman",
    "date": "2024-03-15",
    "content": "What do you use em on? Tbh at least for these specific ones (I’ve never used other ones) I never really love them? I mean they’re cool, but, dunno that they’re what I’m looking for in a tracking comp on a lot of sources.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218625554648137808",
    "author": "Matt Huber",
    "date": "2024-03-16",
    "content": "How do you feel like the Studio does heat-wise in a closed rack?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218627092464275496",
    "author": "cian riordan",
    "date": "2024-03-16",
    "content": "About 12 hrs in and so far, so good. The rack has vents and a fan to move air so I imagine it’ll be Ok.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218708878343143575",
    "author": "montrose recording",
    "date": "2024-03-16",
    "content": "the air cooled racks in the control room is pretty slick tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1219737500252110878",
    "author": "Zack Hames",
    "date": "2024-03-19",
    "content": "For real though, you could use all 57's through that Neve and it would be bonkers. have fun @cian riordan",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220202112689111140",
    "author": "hyanrarvey",
    "date": "2024-03-20",
    "content": "The stilletto is like the best 800 it’s so weird cause you’d never think",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220428053952335934",
    "author": "cian riordan",
    "date": "2024-03-21",
    "content": "Yeah, clocking great! Now I have enough I/O to be able to send to all 12 channels of the Neve.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220428604723433583",
    "author": "Zack Hames",
    "date": "2024-03-21",
    "content": "@cian riordan when did you get that neve??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220466843001819257",
    "author": "cian riordan",
    "date": "2024-03-21",
    "content": "The HDMI/usb thing is smart. I did this at a studio I helped design and had a little kart in the tracking room for recording myself.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1220468699358564353",
    "author": "peterlabberton",
    "date": "2024-03-21",
    "content": "Filed firmly in the \"know how to use, have never ever thought about how they're designed/built\" category",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220505176750821396",
    "author": "LAPhill",
    "date": "2024-03-21",
    "content": "I'll say I'm firmly in the big conduit in the wall with an open hole camp. A perfectly labelled and wired patchbay is beautiful until you want to get in there and change things. About a year ago, I swapped a lot of gear between my writing room and machine room, which would have been an expensive nightmare if I couldn't just pull all sorts of different cables for v2.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220601206121037875",
    "author": "Calvin Lauber",
    "date": "2024-03-21",
    "content": "What were your general feelings on the twotwo6s vs the 6s? I love my twotwo6s man but all the 6s I’ve heard sound killer too. Never been able to AB",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221606115536535682",
    "author": "chrissorem",
    "date": "2024-03-24",
    "content": "I haven’t recently never heard them my room so I have zero options but I liked them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221999934526591036",
    "author": "peterlabberton",
    "date": "2024-03-25",
    "content": "Yeah, getting cymbals separate is great. I started tracking stuff a lot in layers during covid lockdown, just cuz I had the time and wanted to experiment. Super fun to be able to process a drum kit really heavily when you have that level of control.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1228798565611077753",
    "author": "matthewrederburg",
    "date": "2024-04-13",
    "content": "That rack should kick out enough heat for the bearded dragon. Good thinking.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230700381244362833",
    "author": "Zeuswayn3",
    "date": "2024-04-18",
    "content": "Sick rack! Curious what your thoughts are on the scully pres and the lex pcm80",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1233072335209365525",
    "author": "Charlie Deane \"Hypn0.iRL\"",
    "date": "2024-04-25",
    "content": "That’s the thing, the projects never end haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1234809498179473489",
    "author": "Ross Fortune",
    "date": "2024-04-30",
    "content": "The presence knob has never done anything on mine (like, nothing happens when I turn it). I’m still getting tones I like, but occasionally I remember and think about getting it fixed. Am I missing a whole world of flava?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1235331597905952859",
    "author": "Deleted User",
    "date": "2024-05-01",
    "content": "But I’m not doing another bachelors. Never again haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1235355559390220449",
    "author": "Deleted User",
    "date": "2024-05-01",
    "content": "I’ve never done sales but the fact that I will get paid the same regardless of how hard I work doesn’t make sense to me. No bonuses were ever given in any of retail jobs I’ve had. I was never the hardest worker so it was obvious I was not going to get it but man, I’ve had some really hard working coworkers and in fact some of them were getting paid less than me. \n\nI mean, sure yeah be a professional and do what you’re paid to do with a sense of responsibility. But the fact that there is no incentive nor upper mobility (strictly financially speaking because sometimes managerial role is a $2 raise in hourly wage which is a $4k raise in salary) is what gets me really hesitant in doing a part time job. The only jobs available as part time position I see myself being able to do is retail, restaurant isn’t for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244350473679405188",
    "author": "joshbonanno",
    "date": "2024-05-26",
    "content": "ive got cheap amazon bulbs...i think they are treatlife or lepro brand...software is pretty janky for sure but thats only really been a problem in the setup phase for me...connecting and syncing etc... once theyre sync-ed they work fine. never had issues with flickering or noise or anything...i will say though, i will most likely upgrade to hue in the future as i add more bulbs throughout the house and desire a little more robust \"home automation\" type of system.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247591662058864785",
    "author": "Zach Hughes",
    "date": "2024-06-04",
    "content": "I've been going down this rabbit hole recently. I purchased and have started using a phone lock box. Kinda hardcore. Not gonna be necessary for everyone. There's also a program called freedom (probably similar to focus app mentioned) I just got and will be experimenting with. Have a program called flux that changes the color hue of my screen as the day progresses to make it easier on the eyes. I think blue light earlier in the day and yellow ish light later in the day? Some science I don't really understand behind that. There's a huberman lab out there somewhere about it. I backlit my screen display with blue leds as well. Honestly one of the best things when I actually stick to it is trying to never sit for longer than an hour. Even just a 5 minute stand up walk around helps me immensely. Related I drink a ton of water and forces me to get up to go to the bathroom more often.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256001364811583529",
    "author": "alex stinson",
    "date": "2024-06-27",
    "content": "Is it a single output? I’ve never seen one of these in the wild. How does it sound?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270069514046013460",
    "author": "Zack Hames",
    "date": "2024-08-05",
    "content": "But I’ve never been one for clean aesthetic (if you couldn’t tell)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1271185916723073036",
    "author": "Chase H",
    "date": "2024-08-08",
    "content": "Closing on this house on the 9th of September.\n\nThinking the carpet side will be the control room and the hardwood side a tracking room (purposed mostly for drums).\n\nIt’s super early days obviously but would love to hear how you guys would tackle this. After closing I’ll make some blueprints of the basement space itself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1271188660120715264",
    "author": "cian riordan",
    "date": "2024-08-08",
    "content": "Do you need to have isolated spaces? Would be amazing if you opened it up to one big space… would likely sound better for both tracking and mixing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1271191671781982269",
    "author": "cian riordan",
    "date": "2024-08-08",
    "content": "If you’re mostly tracking live bands, then there’s lots of good reasons to have isolated spaces. If you’re mostly doing production and mixing, then there’s lots of merit to having a bigger, open space. It’s more conducive to collaboration and might offer some more sonic flexibility vs. walling the place off.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1271192086749642793",
    "author": "Chase H",
    "date": "2024-08-08",
    "content": "Most of the tracking of live bands will be to get takes to comp together with individual overdubbed parts.\n\nMost of the music (besides the Gypsy Jazz and bluegrass) will be produced and heavily comped music",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1271194379008213004",
    "author": "Chase H",
    "date": "2024-08-08",
    "content": "I could open the space and build rolling gobos and have hung clouds for a dedicated drum spot if i opened  up the space for mixing and tracking  at the same time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278471657832583219",
    "author": "cian riordan",
    "date": "2024-08-28",
    "content": "You're not going to do membranes, etc in a tracking room are you?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278697362650300459",
    "author": "Johnny I",
    "date": "2024-08-29",
    "content": "Adding a cloud to the rear of my room where I track piano, acoustic guitar and vocals. As far as placement over the sources/mics, is there a rule of thumb like mix position (I.e. halfway point between monitors and listening position)?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287551302762758248",
    "author": "Will Pragnell",
    "date": "2024-09-22",
    "content": "nice, i think i'm gonna go for one. have had a wider desk on order for a while but still time to cancel... this way i won't have as much empty rack space tempting me to buy outboard i don't need 😄",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287886807135948893",
    "author": "bobby k",
    "date": "2024-09-23",
    "content": "there's a very sad hazelrigg VLC sized hole in my outboard rack",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293970311682723840",
    "author": "audioanthem",
    "date": "2024-10-10",
    "content": "Wanted to throw this in as a honorable mention if you don’t have a crazy amount of rack gear  I think is 8u , they can make them in different woods as well",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1301321065485828148",
    "author": "Eric Martin",
    "date": "2024-10-30",
    "content": "love the commitment of tracking stuff to tape",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301564725343027240",
    "author": "Joey O’Gorman",
    "date": "2024-10-31",
    "content": "Would love to use tape. Did my degree thesis and an EP on trying to emulate the limitations of 60’s 4-track recording. Committing drum mics to one track on the spot etc. “Limitations benefit creativity” angle",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1309615742324441168",
    "author": "Will Pragnell",
    "date": "2024-11-22",
    "content": "How do you like the Ferrofish A32? I've been eying up the A32 pro. Big part of my use case would be for recording eurorack... do you happen to use those together, and is so, how does the A32 cope with hot eurorack levels?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1309621334958936144",
    "author": "SoundsLikeJoe",
    "date": "2024-11-22",
    "content": "I can't say enough good things about A32 tbh.  The converters are VERY good with no discernable difference between A32 and the RME UFX+  ...  but it's my mixer bridge more than modular.  The modular routes to an old Apogee, and can then MADI into the mixer (if you wanted to get real tweaky with EQ or use compressors).  \n\nAs far as levels go...    the A32 does something I had no experienced with other converters, and I love it.  You can adjust the sensitivy of the analog input...  Here's a better explanation from the manual\n\n> The analog inputs of the A32 DANTE can each be set to different\n> sensitivities. You can choose between three reference levels: +4dBu,\n> +13dBu and +20dBu. Using the DSP, you can additionally set the\n> reference levels from -8dBu to +20dBu in 1 dB steps. The DSP always\n> calculates the optimum configuration. For example, if you set +12dBu,\n> the analog reference will be set to +13dBu and the signal will be\n> attenuated by 1dB.\n\nThat would work magic with eurorack levels.  I use it sometimes so that I can overdrive the Trident and keep the channel direct outputs under the limiter's clipping stage. Helps when you want to be abusive in analgo but not worry about converters clipping.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1309623014572294184",
    "author": "SoundsLikeJoe",
    "date": "2024-11-22",
    "content": "That rig has been a slow evolution of the last 10yrs (gasp, didn't expect that). Here's a closer look for any module folk, sans all the cables.  https://modulargrid.net/e/racks/view/1948346",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1316454797859098726",
    "author": "chris_donlin",
    "date": "2024-12-11",
    "content": "I'm a big lavazza drinker - gran aroma, pre-ground - and it's pretty wild how different it tastes from my roomates drip machine vs my areopress. As i've gotten more into coffee the past year or so, it's been interesting seeing how the \"sum of parts\" concept applies to other things, especially music cus that's what we do. Grind size, time of brew, temperature of water, brew method, etc. Used to not buy into it, but they certainly affect the outcome. Mic, placement, preamp, quality of the source, etc. are all important too!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340070029139644447",
    "author": "Josh Bowman",
    "date": "2025-02-14",
    "content": "Room looks sweeet!! What are you doing for computer/interface housing? I'm currently transitioning to the monitor on the wall tiny desk setup and trying to decide on cabinet/rack etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340080699939749900",
    "author": "onanisland",
    "date": "2025-02-14",
    "content": "That is smart indeed! You can also have a second screen attached with leg back of the desk, tilted to ur preference (works with minimal desks too) and keep your macbook on a floor rack or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340375646408282122",
    "author": "cian riordan",
    "date": "2025-02-15",
    "content": "Wow never though about this. So simple, so smart.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340462167975002285",
    "author": "hyanrarvey",
    "date": "2025-02-15",
    "content": "Limiter and expander are mid but good god that compressor",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340478480768307292",
    "author": "hyanrarvey",
    "date": "2025-02-15",
    "content": "Just using the compressor or everything?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340483814165581886",
    "author": "montrose recording",
    "date": "2025-02-15",
    "content": "just the compressor mostly.  couple times the limiter too!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341169460698152961",
    "author": "Brian Reynolds",
    "date": "2025-02-17",
    "content": "Something to thing about. As someone who worked with and around lifetime carpenters. Who build and renovate homes directly on the Atlantic Ocean. They look at oversecured structures. The way most here look at over processed tracks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341456464858054718",
    "author": "Chase H",
    "date": "2025-02-18",
    "content": "The 1/2lb was the most nerve wracking for me to work with, my traps are 8ft tall and I ripped up some of it pretty quick.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342177574784335944",
    "author": "Iwan Morgan",
    "date": "2025-02-20",
    "content": "Nice few days tracking this piano again.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342307089200185436",
    "author": "Beck Nebel",
    "date": "2025-02-20",
    "content": "Hahaha because I shouldn’t ever betray my beautiful apollo?? Or because the rabbit hole you enter once you’ve crossed over the Apollo line is a never ending pit of despair?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1349133030626820127",
    "author": "Brian Reynolds",
    "date": "2025-03-11",
    "content": "I've never seen that subkick thing. How does it work? How does it sound? Is it just for recording purposes?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360676676761157855",
    "author": "chrissorem",
    "date": "2025-04-12",
    "content": "I’ve never hear drums sound the way Jay makes drums sound.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366530355670286346",
    "author": "wcalebparker",
    "date": "2025-04-28",
    "content": "Please let us know exactly how the 1073 gets to the 176. Are you doing it wirelessly? If so, what models.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374325804049236049",
    "author": "Brian Reynolds",
    "date": "2025-05-20",
    "content": "Unless Im seeing this incorrectly.  It doesnt look like the door is square or level. So the weatherstipping and or getting to door to close flush, is always going to be a challenge.  Cedar shims and a gap area should of been used to level off the door before securing it. Nothing is ever perfectly square, the door, the wood, the ground. So you need allowances with doors. Youll never notice the corner of a wall meeting slighlty out of plum. But a door always shows it. You can see how the top of the door isn't running level from right to left with the image your finger is pointing at the hole. #2 You can add any expanding insulation foam, or clear caulk to fill those small slots. Once covered in trim though. I doubt much sound if any is going to make through the trim and through those small holes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376715067717845066",
    "author": "Matt Huber",
    "date": "2025-05-26",
    "content": "Quick question for the gang — \n\nHow much does placing a low rack to the side of your mix position (within arms reach) affect acoustics? Significant? Negligible?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376943038978588682",
    "author": "Nomograph Mastering",
    "date": "2025-05-27",
    "content": "Kinda but not quite. Model a speaker above you rack. If the rack is close what frequencies illuminate it and where do the reflections go? Of the rack is say halfway between you at the Atmos speaker that’s a different situation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376948262686162975",
    "author": "Matt Huber",
    "date": "2025-05-27",
    "content": "Ahhhhh would it mostly be hitting the back of the rack?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376949768689025054",
    "author": "Nomograph Mastering",
    "date": "2025-05-27",
    "content": "A sound coming from above a rack at a steep incoming angle reflects where at what angle?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376988779255955601",
    "author": "manyonline",
    "date": "2025-05-27",
    "content": "is this something custom or did you buy it somewhere? I'm in the market for something similar but a little shorter. To me the Jamracks 12 Pod is the perfect size / shape but it's kinda hideous w their huge logo on the side.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377041648168468622",
    "author": "chris_donlin",
    "date": "2025-05-27",
    "content": "I bought it used off of marketplace. They're fairly common, i forget the brand though. There's a ton of cool racks like the Jamrack on Etsy. Work checking out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377311390632640562",
    "author": "hyanrarvey",
    "date": "2025-05-28",
    "content": "Never seen double kick drum with out the holes so cool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382607974429626398",
    "author": "herbie",
    "date": "2025-06-11",
    "content": "yeah i never knew why thats such a big thing for slat walls haha, everything i see for them has acoustic in the name at least once. do you have a pic of them in your room? would love to see it!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382759350237663256",
    "author": "Bryan DiMaio",
    "date": "2025-06-12",
    "content": "If it's thick enough or absorptive enough to unevenly attenuate frequencies I can see why someone might not want to do that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382933261621137418",
    "author": "Brodie Stewart",
    "date": "2025-06-12",
    "content": "Woah, never heard of him, and now I'm obsessed! Thanks dude!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383859730174181548",
    "author": "herbie",
    "date": "2025-06-15",
    "content": "it’s kinda jank though, it doesn’t like to stay up so whenever i put weight on it it sinks to the lowest position every time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383861053368307734",
    "author": "herbie",
    "date": "2025-06-15",
    "content": "i would never trust that to ever work properly lmao",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387087917838766082",
    "author": "thegreatcarsoni",
    "date": "2025-06-24",
    "content": "Sold a good amount of gear recently and managed to fit what was left in my one rack which feels good",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1408870404696707224",
    "author": "Nate",
    "date": "2025-08-23",
    "content": "could never get canopener to work for me. messed with the fq response too much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410087969192415353",
    "author": "Abel Koshy",
    "date": "2025-08-26",
    "content": "I need to… but lowkey might get one of those tri boom stands with wheels… what’s everyone’s thoughts on those? I usually store everything in a closet and haul things in and out since I mix more and rarely track unless I need to",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417286847767380039",
    "author": "NoahNeedleman",
    "date": "2025-09-15",
    "content": "Could make a record with any of them. \n\nLakeside is the most colorful. Shelford & Aurora are different flavors of Neve (and I’m a Neve guy.)\n\nAurora High shelf is very effective; crushes the 1073D high end.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428762428719497317",
    "author": "Zack Hames",
    "date": "2025-10-17",
    "content": "which this all befuddles me, because I don't think of either of these things as being complex circuits or anything. \nI will say, a lot of the plugins do a pretty good job of the channel compressor, which I love the threshold all the way trick and then increase the ratio knob to determine compression. has a really nice punch to it for close mics on drums.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429152865603031050",
    "author": "Zack Hames",
    "date": "2025-10-18",
    "content": "Just to clarify -  like hardware Insert I/O?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430665926671470642",
    "author": "cian riordan",
    "date": "2025-10-22",
    "content": "https://www.walkingpad.com/products/w1b-foldable-exercise-bike?variant=46079820955905&country=US&currency=USD&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&gad_source=1&gad_campaignid=22483119305&gclid=CjwKCAjwgeLHBhBuEiwAL5gNEerFpCpX6238-VlAQpgAMthdxYOaiHS513Ex9BaE43LoYJucqz4-xBoCOxkQAvD_BwE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440465458099785809",
    "author": "chrissorem",
    "date": "2025-11-18",
    "content": "Nice I never had great luck with 44s on piano but the pianos have a lot to do with that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447365493316124754",
    "author": "Gerhard Westphalen",
    "date": "2025-12-07",
    "content": "I’ve never done framed membrane absorbers since getting that all airtight would be difficult. Especially with different tuning frequencies etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1451642433099268168",
    "author": "Zack Hames",
    "date": "2025-12-19",
    "content": "So, I will be needing to move my SSL 40 channel E series console down these stairs. \n\nPrevious owner said to get a moving company to move it down the stairs - I think that’s the move, but wanted to inquire here with what anyone else has done in this scenario, or any other tips.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457505667681357868",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "Yeah I haven’t ran the DL snakes yet, I have to address a +18 volt issue the console isn’t seeing. I’ll fix that tonight and then start running everything. \n\nIt is not super convenient having the patchbay on the right and the interfaces and outboard on the left; but the right side there’s a door that goes to a booth, right where I’d want stuff. \n\nI *may* put the interfaces on the right side in the corner. We will see",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457506963666501867",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "Yeah, totally. This rack set up is mega temporary, I’m gonna spend tonight and tomorrow arranging it as best as I can with the racks I have. \n\nI got a big half finished 3 slotted rack table thing, I need to put rack rails and a top on it and it’ll be pretty great I think.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457507267686432928",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "Trying to get the interfaces, computer, outboard, patch bay, all in convenient places, is gonna be a whole thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457512851844497432",
    "author": "BatMeckley",
    "date": "2026-01-04",
    "content": "Never thought about this: does having big ass speakers on the meter bridge hurt the lifespan of the console because of the vibrations through the direct coupling? Are we slowly detaching ic’s?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457578047984111709",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "So…the atomic power supply for the SSL seems to not be working properly! \n\nWhen we measure the voltage coming out of the pins on the connector cable (or the connector on the PSU itself) the voltage doesn’t seem to hold, it’s like it keeps dropping slowly to 0 over and over. \n\nSo, gonna take it to one of the techs in town, seems way out of my scope unfortunately.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1458102878777381045",
    "author": "hyanrarvey",
    "date": "2026-01-06",
    "content": "Time to read that ssl manual I gotta find it again",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461043638141194241",
    "author": "eliotpeace",
    "date": "2026-01-14",
    "content": "assuming you’re referring to the condor as a buffer? i guess there are a few. i like it near the end of a chain for surgical tone shaping. rarely using its preamp/gain",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463099796398149644",
    "author": "shoolace",
    "date": "2026-01-20",
    "content": "I’m not a big fan of the “producer studio desks” I personally think they give off weird spaceship vibes.\n\nBeen wanting a larger desk to work from… found this dinning table on Facebook marketplace for $75. Reaching out to a woodworking friend for some rack mounts matching the wood stain 😎\n\nAnyone else just set up on dining room tables? Or am I crazy",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1470979896753917952",
    "author": "chris_donlin",
    "date": "2026-02-10",
    "content": "Just a table for racks of gear, it will sit between my monitors",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]