[
  {
    "id": "1339361334755852309",
    "author": "peterlabberton",
    "date": "2025-02-12",
    "content": "Long time LWMR discord-ers may remember that I’m building a studio (/small lil house), and at long last, we’ve broken ground! Or maybe more accurately, broken a bunch of dry wall and shitty drop ceiling panels. Fucking psyched. Studio room will be in the far corner from this perspective, with tielines to the (small) living room, and a full on @Gerhard Westphalen build.",
    "reactions": 35,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1016692659756212286",
    "author": "P.K. Stephan",
    "date": "2022-09-06",
    "content": "Hey guys! I am new to the community and happy to have finally taken the jump into the discord after being an avid listener since the beginning.\n\nJust finished building my studio about half a year ago. I run a hybrid setup where everything is always connected and ready to go. All recording paths are accessed via an XLR patch-bay. Mixbus/Mastering gear is controlled by a Dangerous Liaison. Conversion is done via MADI and AES/EBU. Headphone CUE’s are analog and via AVB. I like having everything connected and mic’ed up because I notice that I only use the stuff that I can access quickly while producing/mixing. I went through a lot of trial and error building and working in this studio (been in this location for 1.5 years) so if anyone needs any input I would be happy to help!",
    "reactions": 30,
    "attachments": 5,
    "is_pinned": false
  },
  {
    "id": "1186396052992049162",
    "author": "Eric Martin",
    "date": "2023-12-18",
    "content": "almost 6 months in bureaucratic limbo, today I finally got approval to start construction on my studio.",
    "reactions": 30,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1253400615669727324",
    "author": "Eric Martin",
    "date": "2024-06-20",
    "content": "nearing the finish line of the very difficult part of building a studio from exterior concrete block and a roof into a finished space",
    "reactions": 24,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1128386238961958972",
    "author": "Eric Martin",
    "date": "2023-07-11",
    "content": "This will be my new setup after some construction",
    "reactions": 23,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1230279869997252708",
    "author": "Eric Martin",
    "date": "2024-04-17",
    "content": "my new space is looking more like a control room",
    "reactions": 23,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1263999077343825970",
    "author": "Eric Martin",
    "date": "2024-07-19",
    "content": "I’m not even 1/3 into the construction of a @Gerhard Westphalen design and it’s significantly better than my previous/current situation.",
    "reactions": 23,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1446632666937163788",
    "author": "bobby k",
    "date": "2025-12-05",
    "content": "Not much to show yet but my studio is technically in a half converted double garage. Scored this bad boy for $200 today (new is like $1.7k). Double paned, gas insulated, all the bells and whistles. Need to find one more for the other side. Got someone I’m trading production for construction to help out. Gonna be my front wall, sun on my face type shit.",
    "reactions": 22,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1172898983195193404",
    "author": "denimes",
    "date": "2023-11-11",
    "content": "Here’s some construction pics and measurements of my home studio I recently finished. Still need to do some final EQ correction to get rid of the bump at ~200Hz and flatten the midrange area. Overall I couldn’t be more thrilled with how it turned out. I designed the room with multilayer absorption all around. 1ft thick side walls, 2.5ft thick rear, and 6in ceiling (wish I had more ceiling height!) Monitors are our custom 3 way mains with hypex amps.",
    "reactions": 20,
    "attachments": 7,
    "is_pinned": false
  },
  {
    "id": "1266662262693691526",
    "author": "EliHeathMusic",
    "date": "2024-07-27",
    "content": "I have a small room with a closet on the back wall and had been a little stumped trying to figure out how to treat it. @Rob Domos suggested that I use wheels and I ended up designing and building these. It's been a huge improvement sonically and still gives me access to the closet and a lot of flexibility (I can pull them into the room for a better air gap if I'm mixing or push them against the wall if I need more space). If anyone is interested in plans/materials I'd be happy to share.",
    "reactions": 19,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1469461766894387339",
    "author": "peterlabberton",
    "date": "2026-02-06",
    "content": "So. Permits and construction take a long ass time! Finally FINALLY nearing the finish line. Just need to turn this pile of rockwool into a studio. Everything is itchy.",
    "reactions": 19,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1341445273561333760",
    "author": "Rob Domos",
    "date": "2025-02-18",
    "content": "@Zakhiggins and I getting our hands dirty on the studio build",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171870859741380609",
    "author": "joshbonanno",
    "date": "2023-11-08",
    "content": "still need to hang a few panels in the back of the room, work on some aesthetic stuff for the back wall etc...but been working in here and its a dream. major shouts to @Gerhard Westphalen for helping devise a plan and all the non-discord homies who helped with the renovation and build of all these monster panels. i will do a more in depth look at things with all the nerdy graphs eventually, but just took a fresh pic and was feeling grateful for how far it has come so far.",
    "reactions": 15,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1177298799132168263",
    "author": "hyanrarvey",
    "date": "2023-11-23",
    "content": "Just got done wiring and testing all these bad boys. Very happy all of em work and sound phenomonal",
    "reactions": 15,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1126955376378646679",
    "author": "David Fuller",
    "date": "2023-07-07",
    "content": "Excuse the mess, still under construction",
    "reactions": 13,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1205702999591100487",
    "author": "Eric Martin",
    "date": "2024-02-09",
    "content": "@Gerhard Westphalen designing my current dream control room",
    "reactions": 13,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1067590314627440801",
    "author": "Zack Hames",
    "date": "2023-01-24",
    "content": "New studio build in prog. Trident 24 console.",
    "reactions": 12,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "1107519037891674162",
    "author": "jantrit",
    "date": "2023-05-14",
    "content": "The new control room set up! I’ve been set up as an all in one room studio until very recently. At the start of April I took over the room next door and knocked a window and door through. The new smaller room became the control room and the old larger space became entirely the live room.",
    "reactions": 12,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1451348024742904020",
    "author": "Chase H",
    "date": "2025-12-18",
    "content": "This is my old Gerhard Build that a flood destroyed back in August. Got a lot of work done in there, loved how it sounded (the detail was overwhelming for months) and clients loved being in there. \n\nNot pictured is way more clouds, I’m not big on taking photos.\n\nIf anyone’s considering hiring Gerhard to design their room I can’t suggest him enough!\n\nSom pictures are post Flood to show the membranes at the back \n\nRoom was \n Length 26.10 ft\nWidth 23.3 ft\nHeight varied but was around 7.6 ft tall\n\nBack wall was were membranes of varying MLV density and then 1ft of pink fluffy in front of them.\n\nI miss the old studio and am working on building the next one in a rental that’s across the country from where this studio was at. Right after the flood got a job offer I couldn’t refuse so me and my wife are about to start up the next studio build here 🙂",
    "reactions": 12,
    "attachments": 10,
    "is_pinned": false
  },
  {
    "id": "1212074950828236830",
    "author": "thegreatcarsoni",
    "date": "2024-02-27",
    "content": "My new room is getting closer to being done! Figuring out the logistical layout of the space right now but we got wiring done the other day. Temp desk, no speakers, no gear, no rugs, need more lights, but really close!",
    "reactions": 11,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1223050005313490944",
    "author": "Nick Stetina",
    "date": "2024-03-28",
    "content": "Studio build in 60 seconds. Wrapped this up a few years ago, but I love a good before/after video myself and figured I’d share this with my fellow audio nerds here. Designed and tuned by Jeff Hedback, I was just the grunt 👷🏻‍♂️",
    "reactions": 11,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1372774744407019583",
    "author": "Eric Martin",
    "date": "2025-05-15",
    "content": "finally installed the last of the clouds for my control room, can not believe how much that changed the low end response of the room and tightened up the entire room as a listening sweet spot.",
    "reactions": 11,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1029148122108141628",
    "author": "masteredbyjack",
    "date": "2022-10-10",
    "content": "Okay here we go…\n\n@ALXCPH found a couple on my camera roll. Excuse quality, one is when I showed my parents the studio for first time. Couple (long) notes…I’m sure @Nomograph Mastering can expand if he chooses:\n\nUnf*ck designed the room. Ruairi you are incredible at this and I’m very grateful. The subtleties in the trade offs when designing a room are something I urge everyone to consider deeply as I learned when working with them!\n\n1. Studio is built in my basement…13 feet long x 30 wide x 8 tall (including treatment). Back wall divides it length wise and makes the studio part 12x15 approx.\n\n2. All treatment is built in…entire ceiling is stuffed with 9 inch pink fluffy, couple inch rockwool in the walls, tuned mass loaded vinyl behind the “housings” to L and R of listening position. Back wall is 6 inches of safe n sound in a frame built of 2x8s (by contractor) with a 24” door. It’s standing by friction just slid tight to ceiling. Quite precise measuring required to do that and make it sturdy so a door can open well\n\n3. Since I get asked a lot…the wall finishes are acoustic felt board. Went that direction because install was way better than a fabric wall (they are firm and can be cut with an exacto knife). Also they are absorptive with no reflections…caveats apply if that’s good for a given space though (rather than the acoustically transparent fabric).\n\n5. @BatMeckley can confirm hard front wall was farrrr superior for me. I had a soft one (felt) against Ruairi advice since I preferred the aesthetic lol, but room was too dead. Uncomfortable. When I switched I could hear much more depth and energy but everything still as crisp and clear. Highly recommend! \n\nHope this helps some people on here. FYI we started my room from concrete block, bare bones so could frame things to hold treatment needed.\n\nWill circle back with some better pics when I’m home. This community has helped me greatly.\n\nCheers friends!",
    "reactions": 9,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1311824514820214836",
    "author": "onanisland",
    "date": "2024-11-28",
    "content": "found an old picture of v1 (during the build) in another discord, I'm still minimalistic though not much to see tbh unless I'm tracking. Just got nostalgic, having read today so many people building their rooms. I wish you all the best on your journey to having your rooms sounding as good as they can! It's a tough endavour but totally worth it in the end. ❤️\n\nWhat I'm most proud of, is the fact that all the rooms were built by myself & a friend. Didn't hire any construction crew. 😄 I'm hoping this can inspire some of you who are in the process.",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1255546948690247724",
    "author": "Eric Martin",
    "date": "2024-06-26",
    "content": "70 Yards of fabric headed my way to treat my control room.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128404575351742524",
    "author": "chrissorem",
    "date": "2023-07-11",
    "content": "@Eric Martin  I just found these photos from when I built my studio, there is light on the other side of the tunnel! Congrats have fun!",
    "reactions": 7,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1030959472136437850",
    "author": "ryount",
    "date": "2022-10-15",
    "content": "I’ve gone through a few iterations of the screen/desk tweak, kinda settled on this sound anchor cart. I do wonder if the rack behind it makes much of a difference. Hard to A/B because it kinda involves re-wiring everything.",
    "reactions": 6,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1096861984034672781",
    "author": "Zack Hames",
    "date": "2023-04-15",
    "content": "Hey guys I just started a thread about my new studio space I will be working on! Would love anyones advice and thoughts on construction, acoustics, planning, and making a creative space",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182486107334647939",
    "author": "cian riordan",
    "date": "2023-12-07",
    "content": "LIfe goal is to someday have a live room big enough to have a video track just always available",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1256648089414926346",
    "author": "Deleted User",
    "date": "2024-06-29",
    "content": "Small changes. Stacked a couple of soffits at the first reflection points. brought them up against the wall. The thinner panels (7”) still have the air gap. The extra space is mentally freeing. Also my son listening to as it was for the 100000000000 time 👍",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1382830788630020106",
    "author": "BatMeckley",
    "date": "2025-06-12",
    "content": "Careful with this… in my vocal booth I have a big tapestries that covers an entire wall, thin, that looks like stars against a black sky. Thinking I was super clever, I ran and led light curtain (essentially just Xmas lights) behind it, to make the stars light up. Looks awesome. \n\nThe light curtain shows up as hum and noise in both the Telefunken mic AND the guitar amps. Damn it all.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012512601592307792",
    "author": "Deleted User",
    "date": "2022-08-25",
    "content": "By studio build 3 or 4 you realize there are more colors than black and red all GIK got lazy didn’t want to do anything other than hang them up 🤣🤣",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139555619968401458",
    "author": "chrissorem",
    "date": "2023-08-11",
    "content": "I just found these photos of my studio build. I promised my self I’ll never drywall again. 60,000 lbs of drywall and the photo on the right is 3ft of bass trap hangers a total of 21 hangers at the back of the control room and then of course the echo chamber behind that 🙂  anyway to anyone working on their build out keep it  up! Soon you will be working in that room and you’ll forget about this madness",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172237994271453204",
    "author": "BatMeckley",
    "date": "2023-11-09",
    "content": "Having a proper vocal booth for Vox and guitar cabs was life changing for me. Being able to make decisions on the way in by hearing what’s actually being recorded and not the sound in the room (without having to use headphones) is the single biggest luxury of my spot. \n\nI’m sure a guy like EV or Cian had enough miles at barefoot to go “whelp, this is not what I’m hearing right NOW, but when the guitarist stops playing I know it’ll sound like THIS” but that kind of guessing game always bummed me out.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352647568202403901",
    "author": "herbie",
    "date": "2025-03-21",
    "content": "i usually leave the live room door open to the kitchenette/main lobby area and throw a stereo pair of the crown pzm boundary mics on the floor there. they’re usually going through the distressors for that too. the kitchenette has some nice tall ceilings for a cool room sound",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1463645917742764207",
    "author": "chrissorem",
    "date": "2026-01-21",
    "content": "Use 3 inch PVC pipe for conduit leave a pull  line in your conduit",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029970550216470598",
    "author": "cian riordan",
    "date": "2022-10-12",
    "content": "Do you have another control room setup somewhere that isn't in an echo chamber?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106718923581304922",
    "author": "LAPhill",
    "date": "2023-05-12",
    "content": "@Zack Hames there are tiers to this. It'll be harder to suss out the quality of designers and contractors where you are, but get into studios there that are well-built and find out who did them. Decide what's most important to you (isolation? room response? vibe?) and allocate your resources from there. Do you really need that hardwood flooring, or would a laminate suffice? I cut corners on a few aspects of my studio, most of which turned out to be fine, but I'm now paying the price for something that likely could've been avoided had I spent more up front. \n\nI have colleagues that went with fancy architects/big name studio designers and spent twice as much as I did and had worse results. So price does not always equate to the final product.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107519629556994098",
    "author": "Nomograph Mastering",
    "date": "2023-05-14",
    "content": "@jantrit’s one weird trick to solve condensation in control room windows",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128079071801266206",
    "author": "LAPhill",
    "date": "2023-07-10",
    "content": "I’m talking more conduits and places you’re going to run cable. I’ve been in studios where you couldn’t get another cable through the pipe to save your life, especially with the connectors attached",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277324406305062953",
    "author": "chrissorem",
    "date": "2024-08-25",
    "content": "Installed a second AC system yesterday so I can run a single AC for the control room and not have to cool the rest of the studio when not in use( mixing days).  This a picture of the crawl  space where the  AC mufflers live, I hope I never have to go up there again but this might be interesting for some to see",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1278496493535367188",
    "author": "Nomograph Mastering",
    "date": "2024-08-28",
    "content": "@Eric Martin the low ceiling in the live room is your enemy. I would do whatever I could to delete the ceiling acoustically. After that it would be assembling a collection of absorbent and reflective things and start playing (big sheets of Ply leaned at angles can tell you a lot)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385015980178018354",
    "author": "peterlabberton",
    "date": "2025-06-18",
    "content": "Big vocal booth just transformed into an echo chamber. Get at me for all your reverb needs.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "905138463853142056",
    "author": "kylem",
    "date": "2021-11-02",
    "content": "hey guys - sorry for not doing as I promised and posting pictures of the buildout progress. I was working at warp speed - I basically haven't looked up until today. I started october 4th and wrapped (except for hvac and moulding) sunday. Unfuck guys came by to tune me up yesterday. It's sounding sooooo so good. Here are some pics....",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061828268610830406",
    "author": "CHCarrollMastering",
    "date": "2023-01-08",
    "content": "Here’s our other room with a “live room” it’s just an over sized vocal booth.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1069352863437946950",
    "author": "Shadowherb",
    "date": "2023-01-29",
    "content": "just got a pre-behringer Midas Venice and integrated it into my control room 👍🏻",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1088211167366893660",
    "author": "cian riordan",
    "date": "2023-03-22",
    "content": "Looks like you have space for a live room, control room, AND a kill room!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135659756342751372",
    "author": "Zack Hames",
    "date": "2023-07-31",
    "content": "Quick and dirty threw together my setup in the “control room”. Long story short a session came up for a friends band to do a live video, we did the recording in this room in the basement, they helped me throw up some absorption in the ceiling as fast as possible and we went for it. Now I’m listening in this room for mixing. Excited to take it further with @Gerhard Westphalen",
    "reactions": 2,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1172206722304196629",
    "author": "LAPhill",
    "date": "2023-11-09",
    "content": "Solid core doors, and add a drop-seal so there's no air gap at the bottom.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172410907104649226",
    "author": "jantrit",
    "date": "2023-11-09",
    "content": "Also fuck yeah studio builds, that shit is exciting",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1229937160333819905",
    "author": "Eric Martin",
    "date": "2024-04-16",
    "content": "actually at my in-progress studio build today and it’s raining a lot and I’m seeing multiple leaks in the roof, good thing I DIDNT finish sooner",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267932999417069568",
    "author": "Felix Byrne",
    "date": "2024-07-30",
    "content": "fuck haha\ni can hear the power supplies and computer crying from the machine room",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1271193440146690169",
    "author": "masteredbyjack",
    "date": "2024-08-08",
    "content": "I put in so many outlets during my build we ended up covering 3 of them when the mass loaded vinyl enclosures went up ha",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278490654401368117",
    "author": "Nomograph Mastering",
    "date": "2024-08-28",
    "content": "If you want a perfectly controlled room then use your control room to track (say for a pristine acoustic guitar)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315068533209825301",
    "author": "Chase H",
    "date": "2024-12-07",
    "content": "Got these two done, running to the store for more insulation…\n\n\nI’m a bit nervous the insulation shifted when I was moving them and that the MLV is unable to move as freely as it can.\n\nWhen I tap it I see the vibrations ripple across it, that’s the only way I thought to test it.\n\nIf ANY of the insulation moved and is touching the membrane will these be totally ineffective?",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1315115487692193823",
    "author": "cian riordan",
    "date": "2024-12-07",
    "content": "I just used staples to attach the MLV directly to the box. MLV is tough as hell, not much to worry about in that department.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382871199591305287",
    "author": "onanisland",
    "date": "2025-06-12",
    "content": "Both electrical & audio cables are in seperate conduits but together wherever one goes the other goes too as I rember my layout",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1458900461972361286",
    "author": "Zack Hames",
    "date": "2026-01-08",
    "content": "Thank you!!\n\nI will say - I got a good deal on this relative to a typical console buying experience. 30k for a console that I had spent two years using already, was fully functional (as fully functional as any vintage console) and it came with all the wiring and snakes and DL’s, and spare parts. And a local sale. \n\nI’m not sure I would’ve gone this route if it was more risky.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460752689615994900",
    "author": "thegreatcarsoni",
    "date": "2026-01-13",
    "content": "I use 2 PTZ Optics studio cams mounted up in the corner of each room, since my live room is downstairs from the control room. I sent active HDMI through the floor along with all the other cables so when we do sessions with someone downstairs, I switch my big monitor to show direct feed from the live room cam. And vice versa for the control room. You can configure them over IP but there's no latency issues since I'm viewing in real time with HDMI. And I can use camera audio coming out of TV speakers if i don't feel like setting up a talkback mic downstairs.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461413475854188657",
    "author": "Jorge Vivo",
    "date": "2026-01-15",
    "content": "Fair question, I bought them for some small events that I randomly do in town because it’s the most requested PA. I brought them into the control room for fun, thinking they wouldn’t work and when I turned them on I could not believe how insanely good they sound towards the back of the room. I never had mains before but I guess I do now! Just for clients, I can’t work on them from the sweet spot nor have any interest in blasting music so loud",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461458534704087100",
    "author": "Tim O’Sullivan",
    "date": "2026-01-15",
    "content": "He wanted all the mic lines to be combo jacks so he could plugin XLR or trs anywhere.\n\nBays are dsub and panel size was a concern so I used solder dsubs on the control room passthrough panels. \n\nAlso whole cue system is on Ethercons and I made him a bunch of ethercon cables with the nice stuff that lays like mic cables.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860233119989497886",
    "author": "cian riordan",
    "date": "2021-07-01",
    "content": "I think the attack wall solves the problem for people that can't build their room from scratch. As someone that just built a studio, building fake walls with insulation & membranes tucked behind aint cheap. And it's permanent. Having tube traps (or the ASC pressure traps, or whatever they are) are not a panacea -- but rather a scalable, portable method of getting an untreated room in the ballpark. I've found with tube traps that more is not necessarily better and you just don't know till you get in there and shoot it. My friend Andrew Maury raves about his. He's gets amazing results and he loves moving around his setup every few months just because he likes tweaking... and the attack wall allows him to do this. So -- if you're building a studio from the ground up, there are absolutely better options. But if you're hopping around from space to space and don't feel like spending $10-15k on framing, fabric, rockwool, & building limp mass membranes... these are a terrific option.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "905166319387803758",
    "author": "kylem",
    "date": "2021-11-02",
    "content": "It was great man. I chose not to hire a contractor - I have a friend who does construction supervision. He just wrapped the new apple store, so I was able to hire a lot of his workers. I had a drywaller, framer and electrician. Everything else I did myself and / or with the help of one of the workers. I just really can't believe how accurate the room is without doing anything. The design that they handed over to me was totally dialed in as far as where the treatment in the walls went and the dimensions of the LMA's",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982329995114450944",
    "author": "Will Melones",
    "date": "2022-06-03",
    "content": "Amazing, thank you for this! I can wrap my head around calculating the length of the waveform, but I’m really interested in checking out these apps. They sound like a convenient tool.\n\nApplying that to the building specs as you said is the complicated part. Like I can’t assume the same square footage of mass loaded vinyl or MDF is going to vibrate at 80 Hz regardless of thickness and composition, etc. Was just wondering if anyone had build anything in their own studios other than velocity absorbers.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088213058154942485",
    "author": "LAPhill",
    "date": "2023-03-22",
    "content": "@Zack Hames on the plus side, if you've got to do major renovations anyway, might as well build out a baller studio",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106722155640668241",
    "author": "Nomograph Mastering",
    "date": "2023-05-12",
    "content": "Getting the room dimensions right, and doing the basics with the best LF treatment G-Man can muster at the budget would be key",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113055722914185276",
    "author": "Bryan DiMaio",
    "date": "2023-05-30",
    "content": "I had a client who had some pretty bad thermal issues with the Apollo being racked on another Apollo so eventually we put a 1U ventilation panel in his rack between the two",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113168073189490809",
    "author": "stefanmacc",
    "date": "2023-05-30",
    "content": "Had to fisheye to fit that whole live room in frame ! Looks awesome",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128393491769200641",
    "author": "chrissorem",
    "date": "2023-07-11",
    "content": "Run conduit to all the rooms so you can change cables in the future if needed. I made this mistake with my security cameras and I wish I would have put them in conduit",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152020123138412614",
    "author": "jantrit",
    "date": "2023-09-14",
    "content": "Yup! Single pane of 1/2” laminated. And that’s already better iso than the wall it’s in. Maybe one day we would strip the drywall off one side and do a more proper double wall but for now this is gonna be a good compromise of cost vs benefit.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172204484248735775",
    "author": "NoahNeedleman",
    "date": "2023-11-09",
    "content": "Patio Door 72-in x 80-in Low-e Argon White Vinyl Sliding Universal Double Patio Door https://www.lowes.com/pd/ReliaBilt-Clear-Glass-White-Vinyl-Universal-Reversible-Double-Door-Sliding-Patio-Door-Common-72-in-x-80-in-Actual-70-75-in-x-79-5-in/1000102947\n\nA pair of these, you’ll have 3 air gaps stacked up. It’ll likely be the best isolation you’ve got in the whole place.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225584694373122108",
    "author": "Tim O’Sullivan",
    "date": "2024-04-04",
    "content": "No headphones, signer in the control room",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247406623811440691",
    "author": "peterlabberton",
    "date": "2024-06-03",
    "content": "I have ideas, b/c this sort of stuff has been bugging me big time, but I'm holding off until I can start the real studio build.\n\nThe one thing I do have, and like, is the Hue lightbulbs folks were talking about recently. I don't fuck with the colors, but it's nice having dimmable lights all over, even on lamps and whatnot.\n\nOne thing I have not figured out is the computer monitor. It has to be too far away for good ergonomics (we all know this), but a cannot stand the screen really low thing—I crane my neck over instinctively and get *wild* headaches/neck pain. But where I have it now, I also crane my neck closer since it feels too far away. I've always hated big TVs for computer monitors in studios, too, but I'm debating going that route in the next spot and having big ass type like a true grandpa. Anyway, didn't mean to hijack!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267840054647324714",
    "author": "Chad Rodgers",
    "date": "2024-07-30",
    "content": "That’s good to know @masteredbyjack!\n\nIgnore the mess lol. This is basically what I’m working with in my home setup in a converted attic. It’s quite a long space which this picture doesn’t really illustrate.\n\nRoom dimensions:\nW 3.3m x L 6m x H 2.3m",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1267858990109556870",
    "author": "Spencer Broschard",
    "date": "2024-07-30",
    "content": "I highly recommend music city acoustics, they’ll do a free consult based on your room dimensions \n\nhttps://www.musiccityacoustics.com/",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315126451993055324",
    "author": "Chase H",
    "date": "2024-12-07",
    "content": "I had no difficulties attaching the MLV, I laid it out on the frame and then attached the top Frame.\nThen lifted it up and let the MLV hang down naturally and then attached the side and bottom external frames",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387914278526521444",
    "author": "Ross Fortune",
    "date": "2025-06-26",
    "content": "Thanks! Yep, one of them sits on top of a cloud facing straight up. The diffusing effect definitely helps sell the illusion. The other faces straight down and just brighten the place up a lot. \n\nI’m considering another on the other side of the room which is currently more cosy/vibe lighty.\n\nThanks to @spectrummasters who confirmed I would not blow myself up by wiring a light into a wall plug 🔌",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1426047099228655697",
    "author": "cian riordan",
    "date": "2025-10-09",
    "content": "I think the live room is a good size, but coulda made the control just a tad bigger.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428480782741274756",
    "author": "Zack Hames",
    "date": "2025-10-16",
    "content": "Honestly I am excited to move it and set it up so I can be a bit more intimately knowledgeable about every little piece of it.\nI wasn't able to be around for the two days they spent wiring it up at the current studio, so I didn't get to be involved",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447336124652716215",
    "author": "Edsel Holden",
    "date": "2025-12-07",
    "content": "Those were actually prolly heavier than Gerard panels bc I foolishly used construction lumber for those. \n\n@chris_donlin if you use ripped plywood they aren’t too bad. You can also build them as cubes and stack them if better. \n\nThe membranes g man specs tho, with MDF and MLV, are heavy as fuck.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469054493206249728",
    "author": "Eric Martin",
    "date": "2026-02-05",
    "content": "the isolation is only going to be as good as your doors best not fuss too much and just get as much isolation as cheap and space saving as possible IMO.\n\nI see a lot of sliding glass door iso booths but I think they sound terrible, great for sight lines but they splashy if you want to have drums in there",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808945339011956796",
    "author": "oaklandmatt",
    "date": "2021-02-09",
    "content": "@hendrick def good to educate yourself on the construction of the instrument! learning how to set it up and adjust things will just connect you to the instrument more too because you'll want to play it every time you tweak something. if a proper luthier is too pricey (or hard to find where you are) even just taking it to a guitar shop where someone can help you get the intonation and action really solid will be great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "840119682690056208",
    "author": "skinnybreakfast",
    "date": "2021-05-06",
    "content": "Eric has hinted he may talk more about tube traps in particular whilst sharing more info about his new studio build in Vermont.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860191855387213855",
    "author": "peterlabberton",
    "date": "2021-07-01",
    "content": "Ooo nice. I have a lead on some used tube traps/an attack wall and am debating going for it. So pricey! But it seems like quite possibly the best option short of doing construction, and since I’m going to be in a rental that’s not on the table. You’ve been happy with these? Worth the investment?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860238451956776981",
    "author": "chadwahlbrink",
    "date": "2021-07-01",
    "content": "Yes, for sure! As a renter, work-from-home option, they are a dream. I think you could get better ergonomics and potentially better sound from other studio design options, but the flexibility is great. They are definitely not a magic bullet to get a “flat room” either and placement / quantity can affect things greatly. \n\nAndrew Maury was the one who inspired my initial purchase! He does fantastic work on them and was definitely a great resource as I was looking into them. He shared this video with Greg from Kush audio which was very convincing at the time  https://m.youtube.com/watch?v=P7pOA4eeuS0&t=72m13s\n\nI also have friends who have had good success building diy tube traps — which can be pretty affordable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "905242975058165820",
    "author": "h3x",
    "date": "2021-11-02",
    "content": "Yo! Anyone got cool lighting suggestions? Building a studio soon and want a vibey setup thats not just oversaturated rgb. I def want a balance between neutral and colored",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "955393556326019072",
    "author": "herbie",
    "date": "2022-03-21",
    "content": "@Rollmottle right on! yeah i’ve got the ultimate support ms-90s at the moment and they’re pretty solid with the decoupling. took a look on home depot and didn’t realize how cheap cinderblocks are. actually kinda wish i went with the cinderblocks to save some money and i like the aesthetic of them haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982284725781667840",
    "author": "jantrit",
    "date": "2022-06-03",
    "content": "It took me about a week to make 28 3ft traps for an attack wall. I did add some diffusion to them with mass loaded vinyl strips on half the surface  so it was a little more involved than the standard tubes. Well worth it though! Like @cian riordan said it’s gonna be itchy, long sleeves, jeans and a mask and gloves will be your friends. Also a cold shower when you’re done. It’ll close up your pores so the fibers can’t work as deep. The longest part of the process was using a jigsaw to cut the wooden caps for each end, this is absolutely needed for the traps to work properly and I’d recommend using a good quality construction adhesive like the gorilla stuff. Tried a bunch of diff ones and that was the only one that could get the job done.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028718908368240720",
    "author": "ALXCPH",
    "date": "2022-10-09",
    "content": "Re wiring the studio. Not my favourite past time 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028761436484288542",
    "author": "hyanrarvey",
    "date": "2022-10-09",
    "content": "Like i have my ex machinas and my amphions in the live room in boxes from when i mived here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035388726748139610",
    "author": "cian riordan",
    "date": "2022-10-27",
    "content": "So here’s the roundup on my dumb drum thing. This is a scrappy little experiment on my part to see if I can get a convincing drum sound in my little drum room. Before starting this, I had the idea in my mind that if a room is good for mixing, it must be good for recording! *Insert Game Show Buzzer* I ran into many of the things I didn’t like about the Barefoot Studio B Live room — and those things were exaggerated by a factor of 10. First of all, my room is very dead by design. It treats me great in mixing, but made for a real challenge when trying to get *some* sort of drum personality. I was also working with a pretty shitty old premier kit that hadn’t seen the light of day in half a decade. Shitty cymbals, very quickly tuned heads — I wasn’t setting myself up for success… but whatever.\n\nThe setup was a little ridiculous (minus a few utilitarian pieces):\nKick: Beta 52 -> Scully 280\nSnare: SM57 -> Scully 280\nOH Mono: Coles 4038 -> Ampex 351 -> 1176 (not compressing, just to trim gain before ‘tools)\nOH L/R: U67s -> UTA pre (thanks Matt!)\nKick Room: U47 -> UTA Pre (again…)\n\nThis is where I ended up, without mixing, and with some quick playing and utility EQ/balancing. No compression except a limiter to bring up the level. While the actual drums themselves don’t sound amazing, I really struggled with getting any sort of energy out of the drums… it all just got sucked out. \n\nHere are the results if you care (don’t judge my shitty playing)\n\nI think if it do this again I would:\n1) Have a better sounding kit. Turns out, shit in.. shit out. I knew this. We all know this. But here I am.\n2) Maybe put some sheets of plywood around to create some surface in the room. Just give it some life.\n3) Not use the Scully. It’s so hard to get them to not sound distorty… I just don’t have enough pres on hand to have clean path for everything. Mix studio living.\n\nSo it goes…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035393017290436628",
    "author": "Nomograph Mastering",
    "date": "2022-10-27",
    "content": "Like the old PA in live room thing, but less dramatic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036066722429534209",
    "author": "Nomograph Mastering",
    "date": "2022-10-29",
    "content": "I’m not a diffusor fan, almost ever in control rooms. It’s clear here your acoustician was channeling Northward but without understanding the why (the soft front wall tells us that). But where they are should be pretty benign if they actually directly over your head",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036114132862238750",
    "author": "David Fuller",
    "date": "2022-10-29",
    "content": "Have to agree, diffusion in control rooms sounds weird in a profoundly not-good way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1048114041043820545",
    "author": "CK",
    "date": "2022-12-01",
    "content": "I like working in one large room. Does not need to be a control room, tracking room, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053743953201070190",
    "author": "hyanrarvey",
    "date": "2022-12-17",
    "content": "About to deep clean rhe live room today woo",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1061386738024579152",
    "author": "Nomograph Mastering",
    "date": "2023-01-07",
    "content": "You need a good cloud, and significant (prefer 6”) absorption left and right, preferably with an air gap. I suggest freestanding Gobos left and right",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064990483664875561",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "I have a Hilo goes AES to speakers and as my send/capture for the Massive Passive...you can't see it here but there is a rack under the screen where it sits. I have a side car off the side (the walls look pretty tight but they are actually the unf*ck mass loaded vinyl L things, so the room opens up more behind them). The sidecar is back from those...its got a apogee symphony taking the ins for my synths (also not really pictured -- just hangarounds from my production days for the fun of it sometimes), Hazelrigg VLC in there too.\n\nThere is sorta a whole room behind the listening position...its 30 feet long with a floating wall for absorption about 15 feet in so the studio is like 13x15 but acoustically its larger if that makes sense.\n\nI do use streamdeck...but mainly to switch quickly between the hot ref in Wavelab and my master. I've gotten deep into Applescript which essentially handles all of the other Wavelab processes...it's almost finished but my streamdeck will essentially just launch those applications to do what I need. So I'd say it's very useful, but the coding I've been able to do will render it sorta meaningless for me (though convienent, I use it for other things like navigating websites when doing client outreach, etc which is very handy and makes my workflow like an order of magnitude quicker).\n\nChair is hag capisco. I love it. Had a serious back injury when I was younger so I'm pretty dialed into having things be ergonomic and I find it's great. Actually kinda rather uncomfortable...in a good way. You can't really slouch. Took some getting used to but it's interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067545770078777404",
    "author": "ehutton21",
    "date": "2023-01-24",
    "content": "Air gap + inflated mattress = ultimate cloud treatment",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067590570966536343",
    "author": "Zack Hames",
    "date": "2023-01-24",
    "content": "Made some decisions about machine room/racks today, putting the floor and then the console in soon!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082087911102619698",
    "author": "BatMeckley",
    "date": "2023-03-05",
    "content": "Cool cool. Wasn’t sure if there was something else about the construction. Also, mine certainly don’t feel like they stuffed the 17” full",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088211472649306192",
    "author": "Zack Hames",
    "date": "2023-03-22",
    "content": "I might go for control room in the bigger space and actually a recording space in the kill room - because it's below a suspended garage, could be the most isolated. if i really want drums in the big room I'll do it. But the windows and high ceiling for mixing...I think i'd rather have.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088212182476537886",
    "author": "LAPhill",
    "date": "2023-03-22",
    "content": "In all seriousness, a good friend of mine is finishing his studio build in a garage that shares a wall with his kid's bedroom. He's spent way more than he ever intended trying to isolate that wall, and at the end of the day it's still far from perfect.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088213435684233267",
    "author": "LAPhill",
    "date": "2023-03-22",
    "content": "Take a lot of pictures when you're in there. I'd say if all possible, bring a studio designer with you to suss out any particular problem areas, but if it's tomorrow that's not likely to happen. Measurements and pictures!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088213604106522755",
    "author": "Zack Hames",
    "date": "2023-03-22",
    "content": "@LAPhill not a lot of good studio designers here in KC (that I know of anyway!) but I will def bet taking pics and measurements. Keep the good advice coming!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088213695483613306",
    "author": "Zack Hames",
    "date": "2023-03-22",
    "content": "my boss at the studio I work at honestly is a fantastic studio builder...just fucking rock solid.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094414452004241458",
    "author": "Zack Hames",
    "date": "2023-04-08",
    "content": "Excited to get the new live room made, going to be cool. We are going to try for a more relaxed vibe in this space. The studio A is very “posh” and professional, hoping to make this space more vibey.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094636035780116480",
    "author": "John Freyermuth",
    "date": "2023-04-09",
    "content": "Also want to point out that I have found them very useful for tracking dates and frequently bring them with me. Great for drums in iso booths.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097687409623314542",
    "author": "jantrit",
    "date": "2023-04-17",
    "content": "Taken over the space next door and turning my all in one room setup into a control room and live room situation. The current room will remain the live room and the new room will be the control room. The big boy is for above the new mix position  and the two smaller ones will be over the sofa. 8’x6’ x6”  and two half that size.\nThe ceilings are pretty tall here, awesome from drums, not so good for hanging things 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104164548807753819",
    "author": "popaganda.",
    "date": "2023-05-05",
    "content": "And then maybe 3 panels per side starting at the front wall, again 4” or 6” with an air gap….or free-standing gobos.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104174541267292282",
    "author": "Bryan DiMaio",
    "date": "2023-05-05",
    "content": "Pretty new to studio design, and I hear conflicting things everywhere so I'm equally sad at the state of general advice in the industry",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106733802644066415",
    "author": "peterlabberton",
    "date": "2023-05-12",
    "content": "@Nomograph Mastering maybe you don't feel comfortable sharing, or maybe there's not really \"a number\", but do you guys have a threshold at this point where you decide to take on a studio build or pass?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107520660034564116",
    "author": "jantrit",
    "date": "2023-05-14",
    "content": "Now the secrets out hahah. This will stay a one pain situation for now.  Given the single piece of glass will def give me more isolation than the existing wall. Maybe one day down the road I’ll strip the sheet rock off of one side and do a proper double wall and add another piece of glass. But until then this will get us that little bit more isolation than being in the same room ( and a whole heck of a lot more space)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109144369535135744",
    "author": "jmlongmusic",
    "date": "2023-05-19",
    "content": "Hey everyone! I’m new to the community - really enjoying it so far. This will be a long post asking for some studio build advice — I hope that’s ok. Please just let me know if there’s a better thread for this sort of thing. \n\nI’d be extremely grateful for any feedback! Here’s some info: \n\n- I am currently moving my home studio to this basement space that is about 400 SQ feet. Concrete floor and walls except for the front wall shown in this picture - that is drywall as it separates the rest of the basement. \n\n- The ceiling joists are exposed and are about 7.5” deep. \n\n- My primary function for this room will be mixing, but I will also be doing smaller overdubs like piano and vocals. \n\nCurrently, after painting the walls and floor, my plan is as follows: \n- Stuff the ceiling joists with insulation — probably Safe N Sound… thoughts on that choice? \n\n- Cover the joists with fabric from Gilford of Maine. \n\n- Figure out how to drill into concrete 😂 Then put panels everywhere. Most of my panels are about 4” thick and are comprised of the safe n sound insulation. \n- Put some big rugs down but also leave a bit of the concrete exposed if possible cuz I like the look. Haha \n\n- My monitoring set up is NS10M’s (don’t laugh) with an Avantone CLA-100 amp and a PreSonus T10 sub. I’ve got an Apollo 8 Duo and Apollo Twin X Quad. \n\nThat concludes my plan so far. Am I on the right track? 😳 \n\nI really appreciate any feedback you’re willing to give. 🙏",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1112936214631297165",
    "author": "ehutton21",
    "date": "2023-05-29",
    "content": "Thank you 🙏 Only question I have is how much I should be watching heat and ventilation re: the unit. I realized my UA runs pretty hot and I’m sure support to service the preamp would be possible should I need it, but was curious if any other owners have had to pay mind to rack position/temperature during longer sessions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116525771457044491",
    "author": "shaunobi",
    "date": "2023-06-08",
    "content": "Been reading that studio design book from Philip btw. Great, but light on actual construction details.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122584304283824190",
    "author": "tomtom",
    "date": "2023-06-25",
    "content": "There is about a 20” air gap.. will that not provide much?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128833481217146890",
    "author": "Rollmottle",
    "date": "2023-07-12",
    "content": "they're office phone call booths. they usually are soundproof so could work as vocal booths lol. maybe a little dead tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128834301128089610",
    "author": "Skyler Young",
    "date": "2023-07-12",
    "content": "Oh intresting! Yeah I was wondering when you’d ever need three vocal booths - I guess for voice over stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136754943978651659",
    "author": "Gerhard Westphalen",
    "date": "2023-08-03",
    "content": "Got tired of having constant problems so I just found what was the best possible printer. After ironing out some retraction settings it’s been great although yesterday I had a wire break which was quite the hassle to troubleshoot and fix. Wire just broke cleanly in one of the wiring harnesses. Probably from all of the motion. Now I’m worried about other wires breaking",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137037366452817991",
    "author": "Deleted User",
    "date": "2023-08-04",
    "content": "Yea really awesome live room and mic collection",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138905728564858983",
    "author": "Joshua Riley",
    "date": "2023-08-09",
    "content": "Appreciate the insight! The big gobo style panels I made in my old room were 6’ x 4’ and 8” thick. Would they still be effective if you placed them with an air gap or right against the boundary is best?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150237731075661855",
    "author": "Rollmottle",
    "date": "2023-09-09",
    "content": "On first listen, the center image definitely jumped out as more defined. They were about a quarter inch out from each other before. They are now within sixteenths from the walls and within .5° level. Precision not easy with Sound Anchors and old construction!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153747428806238310",
    "author": "itMIGHTbeNICK",
    "date": "2023-09-19",
    "content": "This is my humble home setup in the corner of my bedroom. There’s nothing glamorous here. While I’m still building out the room downstairs and things have been at a hault due to some financial difficulties I won’t get into. I’m doing most of my work right here these days if I can’t get studio time at my buddys space. I’m incredibly proud of the mixes and masters I’ve been able to do in this little corner. I set up some gobos and tube traps I have in the closet when I’m getting deep into the mix and it’s all been working out as best as it can for the situation at hand.\nNS10’s have the cap mod. \n\nWhen I need to track my guitar amps I completely isolate them with long cables and treatment directly in my closet or I will close off the bathroom and treat them in there as well as capture the natural reflection in our bathroom. My wife and kids are so incredibly sensitive and generous to me during this time to even let me still be able to work and make this happen while the studio build is on hold and we’re having to make things work.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1165968262639661116",
    "author": "Deleted User",
    "date": "2023-10-23",
    "content": "Just gotta put some defenders over it and you got you FOH wiring safe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1166600200635302009",
    "author": "montrose recording",
    "date": "2023-10-24",
    "content": "regarding converter to patchbay wiring - is a bunch of 8 ch db25s better than 32ch snake cable with 4 db25s per end - organization wise ?  they’re really short runs in the same rack…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172191268084916335",
    "author": "Zack Hames",
    "date": "2023-11-09",
    "content": "Hey All, Question about studio doors:\n\nI desperately need to install some doors for *some* form of sound isolation. I know there's a lot more that goes into it than just doors, my room is literally concrete so the doors are by and large the weakest link.\n\nI have the ability to do double doors with an air gap. Does anyone have recommendations that aren't incredibly expensive for doors or types of doors i should use for this? I am planning exterior door so it's all sealed with weatherstripping and the Threshold, etc. \n\nAre basic exterior Fiberglass doors, if doubled with an airlock / gap, enough to be decent? I'd love to not spend thousands and thousands on doors.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172192836230324254",
    "author": "hyanrarvey",
    "date": "2023-11-09",
    "content": "Yeah if you can make an air gap that definitely helps",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172219628806750208",
    "author": "Eric Martin",
    "date": "2023-11-09",
    "content": "I think you’re saying that while recording you’re hearing the distance bleed in the control room thinking your drum sounds were more roomy, and live sounding that they really were and a YOU didn’t listen back without the drummer playing?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172229656150282332",
    "author": "cian riordan",
    "date": "2023-11-09",
    "content": "Barefoot didn't have the best isolation being such an old studio. We had a decent sized iso booth next to the A control room that was this really cool, tubby sounding room. But it was only separated by a cheap, chincy glass door -- so whenever you'd do drums in there it was always a bit of a guessing game how it really sounded. But it was worth it for the character of the room. I remember when I first started building studios I was so obsessed with trying to get the best isolation... now I'd almost prefer a big open studio with clear sightlines and just use baffles or gobos to do spot isolation on mics.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172230517668720770",
    "author": "hyanrarvey",
    "date": "2023-11-09",
    "content": "Oh I am talking about bleed from the live room into the controll room not like isolating instruments",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172230781234585630",
    "author": "Zack Hames",
    "date": "2023-11-09",
    "content": "Yeah, isolation between things is pretty easy to manage even with just gobos. The booths at the studio are great.\n\nYeah, I'm trying to be able to have an amp in another room and play out of my monitors in the control room and have it be reasonably isolated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182050945044054157",
    "author": "montrose recording",
    "date": "2023-12-06",
    "content": "console goes below it.  inspired by both lack of space and old school control rooms where the outboard was up high.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182499324928729188",
    "author": "Deleted User",
    "date": "2023-12-07",
    "content": "that would be so dope. big live room is always the dream",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183148178304934041",
    "author": "Eric Martin",
    "date": "2023-12-09",
    "content": "I was thinking about the speakers on cinderblocks thing and wondering if that would couple your speakers to the floor if you aren’t on a slab and are on maybe not the best construction where the floor has flex, would the cinderblocks actually sound worse by coupling low end to a resonant membrane(floor)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1193758463428399134",
    "author": "Tim O’Sullivan",
    "date": "2024-01-07",
    "content": "I made a stupid little guitar tuner swivel mount for my control room out of scrap.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218708878343143575",
    "author": "montrose recording",
    "date": "2024-03-16",
    "content": "the air cooled racks in the control room is pretty slick tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220026411373563914",
    "author": "sethmanchester",
    "date": "2024-03-20",
    "content": "Seem cool and overbuild, but hard for me to really have an opinion about it because it’s just integrated into this dude’s setup. But once we get into mixing I’ll probably bring it into the control room…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220467089278505131",
    "author": "Eric Martin",
    "date": "2024-03-21",
    "content": "exactly what I’m doing, because the bulk of my time is recording a band that I’m in and it would just be weird to be in the control room when they’re all in here main room for a rehearsal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220468552620835027",
    "author": "peterlabberton",
    "date": "2024-03-21",
    "content": "I'm gonna be bugging the group on panels and wiring (for a simpler build!) as soon as I *finally* get rolling :/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220505176750821396",
    "author": "LAPhill",
    "date": "2024-03-21",
    "content": "I'll say I'm firmly in the big conduit in the wall with an open hole camp. A perfectly labelled and wired patchbay is beautiful until you want to get in there and change things. About a year ago, I swapped a lot of gear between my writing room and machine room, which would have been an expensive nightmare if I couldn't just pull all sorts of different cables for v2.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220506100965838868",
    "author": "cian riordan",
    "date": "2024-03-21",
    "content": "(I think having a panel & a conduit are the right move)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220506438078828704",
    "author": "LAPhill",
    "date": "2024-03-21",
    "content": "In my machine room, it's just an open hole though, because it's ~4\" diameter and no one's looking at it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221877775611203624",
    "author": "cian riordan",
    "date": "2024-03-25",
    "content": "I had to put on a new roof before I started construction a few years ago and incoporating the skylights was a really great decision.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232515291733299271",
    "author": "masteredbyjack",
    "date": "2024-04-23",
    "content": "@Eric Martin is the control room going to have drywall as well? Or are you going with some type of fabric wall",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246147830830334004",
    "author": "cian riordan",
    "date": "2024-05-31",
    "content": "When I built my studio, the Unf*ck guys really wanted a bare, hard front wall. I was skeptical so I framed the front and gave my self the option to make it soft if needed. I ended up putting a 2 ft wide strip across the front of roxul behind the speakers. I put up some plywood to A/B it when I was finalizing the room and found the imaging to be tighter with a little bit of soft stuff behind the speakers. Now granted, the soft stuff is flush with the wall so the speakers are still as far back as you can go. But just food for thought. I was in another room recently that had great treatment, similar speakers, but a fully bare front wall and I definitely heard a less defined stereo image. Just my experience and preference.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247414038422491136",
    "author": "peterlabberton",
    "date": "2024-06-03",
    "content": "K, still procrastinating, and this one could get pricey, but: I'm going to try to soundproof as much as possible between the studio and the rest of the house. I keep odd hours, and when my girlfriend gets home at the time of day when normal people get home, I'm sometimes (read: often) right in the middle of the most productive part of my day. If I hear her making dinner or whatever, I'm almost certainly gonna use that as an excuse for a break, and ALSO I will be self-conscious that she's out there hearing me looping a weird part of the song I'm working on—and it all just takes me out of the moment. So I'm planning on getting double solid wood doors to the studio, and doing whatever I can in the construction phase to soundproof at a decent level (sadly without going SUPER deep on this, as that's out of the budget!).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267926620581138543",
    "author": "Tim O’Sullivan",
    "date": "2024-07-30",
    "content": "Most of the low voltage wiring is in the ceiling. Spent most of my time there haha.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1268308508588380202",
    "author": "Eric Martin",
    "date": "2024-07-31",
    "content": "Any advice on Neutrik Ethercon CAT6a plugs?\n\nso far, it’s easily the most difficult thing I’ve encountered building my studio outside of the government permitting process",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270068880362176679",
    "author": "chris_donlin",
    "date": "2024-08-05",
    "content": "I’ve got these two metals poles in my room, somewhat hollow I think, they ring when I do percussive stuff. Anyone have a nice looking suggestion for covering them? Thought about mass loaded vinyl",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1271185916723073036",
    "author": "Chase H",
    "date": "2024-08-08",
    "content": "Closing on this house on the 9th of September.\n\nThinking the carpet side will be the control room and the hardwood side a tracking room (purposed mostly for drums).\n\nIt’s super early days obviously but would love to hear how you guys would tackle this. After closing I’ll make some blueprints of the basement space itself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278474399024152640",
    "author": "cian riordan",
    "date": "2024-08-28",
    "content": "Control rooms are a different story, obviously.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278569417202077757",
    "author": "Zack Hames",
    "date": "2024-08-28",
    "content": "I’ve been playing drums in my @Gerhard Westphalen control room and while it’s interesting and fun, it doesn’t sound “cool” for more than trying to replicate drum machines",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278569514686087303",
    "author": "Zack Hames",
    "date": "2024-08-28",
    "content": "Your live room* should offer something no other studio can, or works for your usual work.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278836323675017246",
    "author": "Johnny I",
    "date": "2024-08-29",
    "content": "Recommended cloud height for 10 foot ceilings? Could do a 6” air gap (6” cloud) or get some chains and hang lower.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1311336189856448595",
    "author": "Chase H",
    "date": "2024-11-27",
    "content": "@Jesse Ray morning! Saw you respond to me  on your YouTube comment that you destroyed some MLV trying to attach it.\n\nI’m attaching mine next week. Do you mind sharing how you destroyed some MLV so hopefully I can avoid making the same mistake?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315008963426652230",
    "author": "Chase H",
    "date": "2024-12-07",
    "content": "Any tips on making sure my MLV doesn’t sag into the frame when I stand it up? \n\nI know @Gerhard Westphalen stressed to me to not stretch the MLV",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1315096798280290324",
    "author": "Will Pragnell",
    "date": "2024-12-07",
    "content": "The last part that I haven't done yet are some MLV membrane traps similar to yours. @Chase H How did you find attaching the MLV and screwing the frame on top? I've read some things about people tearing and destroying MLV so am a bit nervous?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1316534257711321199",
    "author": "montrose recording",
    "date": "2024-12-11",
    "content": "ya the outdoor vocal booth is really working lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318547288540581929",
    "author": "Chase H",
    "date": "2024-12-17",
    "content": "My membranes were designed as 3/4 MDF Frames  with MLV as the Membrane and I used these.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1318592143086059530",
    "author": "audioanthem",
    "date": "2024-12-17",
    "content": "Thanks guys , I’m not a construction guy at all  so just figuring out the small stuff you need for gerhards plan is driving me nuts  , my wife and watches diy stuff in tik tok/instagram the gets up and go bulid it lol she’s lapping me in diy so I figured I need to get my shit together 😅😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340161983466700840",
    "author": "Zakhiggins",
    "date": "2025-02-14",
    "content": "How is everyone mounting their panels on the side walls? I wanna find some solution that gives me a nice 6 inch air gap. I could always just mount it on to 6 inch blocks of wood, but looking for something a bit neater that I could just grab at home depot or something, cant seem to find anything suitable online",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1343018976585715783",
    "author": "Rob Domos",
    "date": "2025-02-22",
    "content": "My 1/2lb MLV is perfectly smooth but the 1 lb MLV I have rn has these deep creases. Will it impact performance? Do I need to go out and buy not used stuff?",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1348839371427549185",
    "author": "Gerhard Westphalen",
    "date": "2025-03-10",
    "content": "More treatment needed in some spots and getting the best results requires non rectangular geometry. Isolation wasn’t too big of a priority and is great (can’t hear most cars driving by at all if you’re sitting in silence with your eyes closed) but was also very compromised by the outer “shell” being the exterior/weather shell. Speaker decoupling also didn’t go well and lots to still work out there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350696099278753865",
    "author": "Paris / Blue Butler Studios",
    "date": "2025-03-15",
    "content": "Did some organization in the control room & picked up some of the remaining suede panels from @itaylerner",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350696260499410957",
    "author": "Paris / Blue Butler Studios",
    "date": "2025-03-15",
    "content": "Difficult to treat a control room that’s only 11 feet wide but it’s getting there!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1380690433579028610",
    "author": "peterlabberton",
    "date": "2025-06-06",
    "content": "Honestly though I’ve got a bangin’ dead (and spacious!) vocal booth for another few days if anyone wants to spit some bars out in the valley. Not responsible for any resulting respiratory issues.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382871004103053424",
    "author": "onanisland",
    "date": "2025-06-12",
    "content": "I installed seperate conduits for electricital wiring for audio path, havent had any issues in 6 years",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1422415597899350016",
    "author": "BatMeckley",
    "date": "2025-09-29",
    "content": "Cutting drums in a vocal booth is akin to making prison wine in a toilet.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447337181021606070",
    "author": "Gerhard Westphalen",
    "date": "2025-12-07",
    "content": "Even 4’ x 4’ is quite a bit. We almost couldn’t lift them up onto the other 8’ ones in my studio build",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457509757639459027",
    "author": "cian riordan",
    "date": "2026-01-04",
    "content": "When you're done hemhoragging money on your install, I'd suggest sound anchors to hold the speakers. They will give you more flexibility over cinder blocks, allow you to lever the speakers over the console if you like, and will decouple them from the desk so you're not feeling the low end through your fingers/hands.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460692746661531772",
    "author": "Zack Hames",
    "date": "2026-01-13",
    "content": "I want to do a video screen system at my new studio; just a simple 1 camera in the control room and 1 camera in the live room for now. Does anyone have any advice on this? I’d like it to be low latency if possible. \n\nThinking barefoot recording style - @Tim O’Sullivan @cian riordan",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463566403889270907",
    "author": "Zack Hames",
    "date": "2026-01-21",
    "content": "Any general advice / rule of thumb on running audio lines via conduit from control room to live room? \n\nIt’ll be 40 channels XLR and a couple Ethernet at least.\n\nI need to wire up a snake into my live room for a session this weekend, but I really haven’t gotten that far into construction. I’d like to not have to do it twice if possible.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463581624460513320",
    "author": "Zack Hames",
    "date": "2026-01-21",
    "content": "I think about cat6, I know lots folks crushing with that. \n\nThing is, I have all the wiring, snakes, cabling already. So I suppose the advantage would be that it takes up less space/easier to run.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463581725786636298",
    "author": "Zack Hames",
    "date": "2026-01-21",
    "content": "Should I run it all in 1 big ass conduit if it’s all going to the same place?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469049289635397895",
    "author": "Zack Hames",
    "date": "2026-02-05",
    "content": "Alright so I’ve got some sessions coming up quick AF and I am wanting to build out these isolation booths. \n\nIs there any generic build template for decent isolation and generally okay sound? \n\nI know room inside a room is ideal; would like, \nplywood+drywall+2x6 w/ roxul\n\nAir gap\n\n something slightly different for second wall (one more or one less layer?)\n\nIs this a good starting point? I need something quick and easy at this point",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469067583272517653",
    "author": "Zack Hames",
    "date": "2026-02-05",
    "content": "Ones an unfinished storage room that is a weird shape and the other is an unfinished area attached to my control room; I should be able to do slight angles etc or whatever",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469067881919676436",
    "author": "Eric Martin",
    "date": "2026-02-05",
    "content": "insulate both sides, the there will be an air gap, and do 2x4’s because it’s cheaper",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]