[
  {
    "id": "1340525568931921970",
    "author": "Gerhard Westphalen",
    "date": "2025-02-15",
    "content": "New speakers going up. Will calibrate in the next few days",
    "reactions": 64
  },
  {
    "id": "1428109492112982199",
    "author": "Zack Hames",
    "date": "2025-10-15",
    "content": "It’s official - I am now the proud owner of this SSL 6040 E.",
    "reactions": 52
  },
  {
    "id": "1199038421822353458",
    "author": "chrissorem",
    "date": "2024-01-22",
    "content": "This weeks setup! And  vocal sound is a 44 into a speaker in the echo chamber miced through a trombone. No auto tune in headphones",
    "reactions": 37
  },
  {
    "id": "1253753970086907975",
    "author": "Eric Martin",
    "date": "2024-06-21",
    "content": "I passed all my department of safety inspections today and can now officially occupy my studio, now to build the treatment and move equipment in, so much more to do",
    "reactions": 37
  },
  {
    "id": "1339361334755852309",
    "author": "peterlabberton",
    "date": "2025-02-12",
    "content": "Long time LWMR discord-ers may remember that I’m building a studio (/small lil house), and at long last, we’ve broken ground! Or maybe more accurately, broken a bunch of dry wall and shitty drop ceiling panels. Fucking psyched. Studio room will be in the far corner from this perspective, with tielines to the (small) living room, and a full on @Gerhard Westphalen build.",
    "reactions": 35
  },
  {
    "id": "1428258341452517376",
    "author": "cian riordan",
    "date": "2025-10-15",
    "content": "Damn dawg. That’s a deal and a half. I’m sure theres a lot of people in your life saying you’re crazy for making that decision but I’ll happily be the voice of support. Times are changing fast in this world of record making and you just flew a “I’m not fucking around” flag high above the horizon for everyone to see. Excited to see what comes of this.",
    "reactions": 35
  },
  {
    "id": "1458314989952696392",
    "author": "Zack Hames",
    "date": "2026-01-06",
    "content": "And we are live!!!! She’s a beaut. Thanks everyone for going on this ride with me. Now onto literally everything else!",
    "reactions": 35
  },
  {
    "id": "1253412277231681618",
    "author": "Josh",
    "date": "2024-06-20",
    "content": "2 years of not having my own space to work. It’s a good fuckin day boys",
    "reactions": 33
  },
  {
    "id": "1089951111529635931",
    "author": "Barbara",
    "date": "2023-03-27",
    "content": "Hanging out in the mastering room today, watching @Clara Araújo do her magic",
    "reactions": 32
  },
  {
    "id": "1306284386538356797",
    "author": "popaganda.",
    "date": "2024-11-13",
    "content": "I don’t feel like any of these pictures fully capture the vibe yet, but here’s my new room",
    "reactions": 32
  },
  {
    "id": "1389413466506395729",
    "author": "tomtom",
    "date": "2025-06-30",
    "content": "Photo sucks, but I thought you’d all appreciate a dog w some Fleas",
    "reactions": 32
  },
  {
    "id": "1231405922144878593",
    "author": "Eric Martin",
    "date": "2024-04-20",
    "content": "lots done on the new build today, first layer of drywall is started, 150 sheets of 4*8 got delivered I’m exhausted",
    "reactions": 31
  },
  {
    "id": "1361548600299094147",
    "author": "cian riordan",
    "date": "2025-04-14",
    "content": "Glutinous double drum setup with captain @oaklandmatt today.",
    "reactions": 31
  },
  {
    "id": "1377683291695612054",
    "author": "LAPhill",
    "date": "2025-05-29",
    "content": "Shout out to @Tim O’Sullivan for not only finally solving my hum issues, but dialing in the workflow in my room to a whole other level. He wired up all my pedals, synths, and preamps to a couple of patch bays so I can throw signal all around the room in any order (complete with right-angle cables so I can use them with the desk doors closed). He also built MIDI lines to send clock from my DAW to the pedals and we upgraded the room to Mio MIDI-over-Ethernet units. Several other creature comforts that allow me to think less, like routing a headphone connection underneath the right side of my desk instead of the left where my interface is, adding a second one by the piano, and ready-to-go cables for guitars, synths and microphones already plugged in where they need to be.\n\nI'm going to run out of reasons not to call this studio \"done\" soon.",
    "reactions": 31
  },
  {
    "id": "1016692659756212286",
    "author": "P.K. Stephan",
    "date": "2022-09-06",
    "content": "Hey guys! I am new to the community and happy to have finally taken the jump into the discord after being an avid listener since the beginning.\n\nJust finished building my studio about half a year ago. I run a hybrid setup where everything is always connected and ready to go. All recording paths are accessed via an XLR patch-bay. Mixbus/Mastering gear is controlled by a Dangerous Liaison. Conversion is done via MADI and AES/EBU. Headphone CUE’s are analog and via AVB. I like having everything connected and mic’ed up because I notice that I only use the stuff that I can access quickly while producing/mixing. I went through a lot of trial and error building and working in this studio (been in this location for 1.5 years) so if anyone needs any input I would be happy to help!",
    "reactions": 30
  },
  {
    "id": "1046742094762475602",
    "author": "GaspardMurph",
    "date": "2022-11-28",
    "content": "Working out of here for the next two days 🙂",
    "reactions": 30
  },
  {
    "id": "1133794246168690759",
    "author": "Nomograph Mastering",
    "date": "2023-07-26",
    "content": "Not sure everyone knows this but @chrissorem won a Grammy for engineering the last Lobos record Native Sons!",
    "reactions": 30
  },
  {
    "id": "1178438151618965575",
    "author": "bobby k",
    "date": "2023-11-26",
    "content": "Still got a load of work to do (namely back wall, and proper stands) but been working since April and pretty damn proud so far. @Gerhard Westphalen  did a fantastic job helping me strategize everything. Last pic is from Zillow before we closed.",
    "reactions": 30
  },
  {
    "id": "1186396052992049162",
    "author": "Eric Martin",
    "date": "2023-12-18",
    "content": "almost 6 months in bureaucratic limbo, today I finally got approval to start construction on my studio.",
    "reactions": 30
  },
  {
    "id": "1449506925858394182",
    "author": "Jasper Boogaard",
    "date": "2025-12-13",
    "content": "Just installed the clouds of my @Gerhard Westphalen design 🙂 gonna spend the evening listening and recalibrating my ears but the low end feels so much tighter without having even started with the back wall",
    "reactions": 30
  },
  {
    "id": "1075594580122144798",
    "author": "noahc",
    "date": "2023-02-15",
    "content": "Recently unf*cked mixing/production room in hawaii. Plz hit me up when y’all need a getaway!",
    "reactions": 29
  },
  {
    "id": "1088585541672513606",
    "author": "cian riordan",
    "date": "2023-03-23",
    "content": "Dropped by @BatMeckley’s today and he was just catching up on some new hot tips",
    "reactions": 29
  },
  {
    "id": "1129491620799201300",
    "author": "Eric Martin",
    "date": "2023-07-14",
    "content": "While y’all fantasize about extreme downsizing, I’m upsizing, closed on the purchase of this building today.",
    "reactions": 29
  },
  {
    "id": "1204593918444838912",
    "author": "cian riordan",
    "date": "2024-02-06",
    "content": "The man brings me coffee just for an opportunity to shame my parents for smoking during pregnancy.",
    "reactions": 29
  },
  {
    "id": "1088198371354869851",
    "author": "Zack Hames",
    "date": "2023-03-22",
    "content": "So, just bought a house (!!!) and am closing April 7th. Gonna need the Discord think tank to help me build out this basement!",
    "reactions": 28
  },
  {
    "id": "1234576550461050910",
    "author": "cian riordan",
    "date": "2024-04-29",
    "content": "One pedal to rule them all. Made the girl permanent.",
    "reactions": 28
  },
  {
    "id": "1437219408006217800",
    "author": "kylem",
    "date": "2025-11-09",
    "content": "Electric company is cutting the power to our house tomorrow to work on something. Wife and I both need to work and I can’t exactly just pick up and go somewhere else. This truck is insane! Powering my whole rig + our home internet and wife’s setup + our fridge. Estimated 6 days with this setup of battery power. I love technology!! Makes me want to go mix a record in the middle of nowhere",
    "reactions": 28
  },
  {
    "id": "1139312711990251644",
    "author": "Adam Thein",
    "date": "2023-08-10",
    "content": "I’m so tired but the final panel went up today!  Thank you to @Gerhard Westphalen for the design help.\n\nAnd more broadly I wouldn’t have ever found my way to this result without being on this server.  Thank you to everyone who contributes so much here.\n\nAnd now to learn how to mix!",
    "reactions": 27
  },
  {
    "id": "1436162727516311572",
    "author": "Berlin",
    "date": "2025-11-06",
    "content": "got @spiderplus1 & @Slow Hand in the house today",
    "reactions": 27
  },
  {
    "id": "1225057128952107059",
    "author": "Iwan Morgan",
    "date": "2024-04-03",
    "content": "Not my setup but, quite a setup. Underground cave live venue in Lanzarote a couple of weeks back",
    "reactions": 26
  },
  {
    "id": "1228118332046049371",
    "author": "Calvin Lauber",
    "date": "2024-04-11",
    "content": "We moved up to nashville a few weeks ago, got my new spot all set up as of a few days ago. Just started firing off mixes again and it’s totally my fav space yet. Feels so good. Thanks @Gerhard Westphalen for your help with this !",
    "reactions": 26
  },
  {
    "id": "1240423254418653214",
    "author": "cian riordan",
    "date": "2024-05-15",
    "content": "I feel like you're gonna wanna put up a cloud above the listening position. And maybe some side gobos. Maybe some behind you too. Also maybe a rack for all the gear. Have you thought of speaker stands for the ADAMs? You know there are better speakers than ADAMs? People really like the Kalis. Do you ever worry about resonances off the rubbermade table? Also whats that ribbon mic pointing at? looks like its just setup in the middle, doing nothing. You should try two mics on the congas... I hear Neumann mics are good for this. Also make sure that ceiling fan is off, could create wierd flutters. Cool studio though, bet it sounds great.",
    "reactions": 26
  },
  {
    "id": "1248809432360681534",
    "author": "Eric Martin",
    "date": "2024-06-07",
    "content": "it’s a silly amount of light, moving along, inspections next week",
    "reactions": 26
  },
  {
    "id": "1256490785831125004",
    "author": "cian riordan",
    "date": "2024-06-28",
    "content": "Carla Azar on a Trixon kit today. Recording drums is my happy place and I’m feeling very lucky to do it with amazing people in very cool\nrooms.",
    "reactions": 26
  },
  {
    "id": "1286901385362669640",
    "author": "bobby k",
    "date": "2024-09-20",
    "content": "Sheesh, I love Facebook marketplace. Got a crazy deal on this couch for the studio, and was able to sell my old one to cover it. cc: @NoahNeedleman",
    "reactions": 26
  },
  {
    "id": "1192669918194323556",
    "author": "oaklandmatt",
    "date": "2024-01-04",
    "content": "Temporary Santa Barbara set up for the next few days",
    "reactions": 25
  },
  {
    "id": "1348856296492892234",
    "author": "itaylerner",
    "date": "2025-03-10",
    "content": "My finished room, with the same signature Gerhard panels picked up from the man in Oliver himself! 😅 mostly for writing / vocal recording, definitely did not build the speakers myself",
    "reactions": 25
  },
  {
    "id": "1366779452490514473",
    "author": "nachomaquieira",
    "date": "2025-04-29",
    "content": "Just moved in! Been listening tons of music and settling into this new spot I’ll be in till the end of the year. Brought a couple panels on stands and trying to figure out a way to hang a cloud without making any holes in the ceiling. Sounds pretty decent tho, and the view’s dreamy. Can’t wait to make a ton of music here",
    "reactions": 25
  },
  {
    "id": "1088240607266353152",
    "author": "jonmatteson",
    "date": "2023-03-22",
    "content": "We are feeling much nicer in here now!\nA huge thank you to the discord acoustics team for the guidance. I’m really excited to make tons of music in here this year!",
    "reactions": 24
  },
  {
    "id": "1221873307792572456",
    "author": "cian riordan",
    "date": "2024-03-25",
    "content": "Tidied up the cables @Bryan DiMaio. Good shout on the Alex wrapping stuff. I got the longest thunderbolt cable Apple sells and still it’s barely reaching that display, alas.",
    "reactions": 24
  },
  {
    "id": "1223366406146359306",
    "author": "kylem",
    "date": "2024-03-29",
    "content": "Obligatory I have a visitor shot @JakeTB",
    "reactions": 24
  },
  {
    "id": "1227078434031665293",
    "author": "Rollmottle",
    "date": "2024-04-08",
    "content": "@cian riordan Not totally happy with the DOF on some of these so gonna have to come back for a more dialed set of snaps, but here's a few that turned out ok!",
    "reactions": 24
  },
  {
    "id": "1228795541735866500",
    "author": "chrissorem",
    "date": "2024-04-13",
    "content": "@Deleted User  in da house today helping out. Currently keeping watch on the bearded dragon 🐉",
    "reactions": 24
  },
  {
    "id": "1253400615669727324",
    "author": "Eric Martin",
    "date": "2024-06-20",
    "content": "nearing the finish line of the very difficult part of building a studio from exterior concrete block and a roof into a finished space",
    "reactions": 24
  },
  {
    "id": "1369797924732538890",
    "author": "Ross Fortune",
    "date": "2025-05-07",
    "content": "New room starting to take shape with the help of the one and only @Gerhard Westphalen",
    "reactions": 24
  },
  {
    "id": "1377851468132122635",
    "author": "chrissorem",
    "date": "2025-05-29",
    "content": "Was working on the song today with the reso bass drums.",
    "reactions": 24
  },
  {
    "id": "1094096737595031582",
    "author": "spiderplus1",
    "date": "2023-04-07",
    "content": "Hey @cian riordan my Philly rig circa 2012",
    "reactions": 23
  },
  {
    "id": "1128386238961958972",
    "author": "Eric Martin",
    "date": "2023-07-11",
    "content": "This will be my new setup after some construction",
    "reactions": 23
  },
  {
    "id": "1230279869997252708",
    "author": "Eric Martin",
    "date": "2024-04-17",
    "content": "my new space is looking more like a control room",
    "reactions": 23
  },
  {
    "id": "1263999077343825970",
    "author": "Eric Martin",
    "date": "2024-07-19",
    "content": "I’m not even 1/3 into the construction of a @Gerhard Westphalen design and it’s significantly better than my previous/current situation.",
    "reactions": 23
  }
]