[
  {
    "id": "1175675497343090729",
    "author": "NoahNeedleman",
    "date": "2023-11-18",
    "content": "Ok Long Post alert, but touches on a few things we harp on around here. \n\nSo my little bro is in town- we made dinner for one of his oldest friends who just moved to town with his wife. He’s a fantastic mandolin player and his wife is a singer/songwriter. \n\nOf course I did the ol’ studio walk through, listening to all the tunes on the ear calibration playlist, then let them play some of their own favs. Of course they’re blown away and have never heard music like this etc. \n\nBut to drive the point home I show them a song @Rollmottle and I turned around in just over 24 hours. “The reason for the speakers & treatment etc is so we can make decisions quickly blah blah blah.”  I pull up the session and we listen through and they’re loving it- but I’m noticing it doesn’t have the 3D thing that all the other music we’ve been listening to has. \n\nThen I show them the mastered version. An mp3. It’s louder and better sounding and all, until the first BGV stack hits… then it’s IMMERSIVE. We listened to the whole thing again just to enjoy the magic and notice all the ways the master improved it. So far beyond zapping resonances and making it loud, @Rollmottle made it sound… important. Made *me* sound like a good mixer. \n\nIt was heavier lifting for him cause I didn’t have the benefit of time for fresh ears or to detail the vocal the way I normally would. Also had the good fortune of having @Ross Fortune on speed dial and on GMT to give it a listen at 5am PST. \n\nI’d you’re curious, or dubious, I’ll DM files so you can hear what I’m talking about. \n\nTL;DR: monitoring matters, fresh perspective matters. Don’t produce mix *and* master your own shit.",
    "reactions": 29,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280297755243446385",
    "author": "Ross Fortune",
    "date": "2024-09-02",
    "content": "I met Nile a few years ago when my boss had a writing session with him at Abbey Road studio 1. I set up a rig to continue editing vocals for a Hot Chip album in one booth, while they worked away self contained in the main control room. \n\nNile had been a huge influence on my old band, and Hot Chip had been part of the soundtrack to my college years. Weird working on one on headphones while watching the other grooving away on The Hitmaker through the glass. \n\nIt was a real “this is pretty cool” moment.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1096653669845454888",
    "author": "cian riordan",
    "date": "2023-04-14",
    "content": "I saw Brian Lucey hitting on the Burl rep. Saw Bainz and Teezio get swarmed by fans. Saw Beckley get a “I saw you on LWMR” moment. Tried to objectively listen to speakers and headphones in a 96dB convention hall (lol). Heavy hang with Will from Neural DSP. Had a great boozy lunch with Kyle, Spider, Wheres-waldo-Tyler, and Beckley. Saw some guitars that bent in half for fitting under airplane seats. There’s an in ear monitor that has 21 drivers now. Finally met Chris Gehringer IRL. Overall, great first NAMM experience. 10/10. Would not go again.",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1427409629754687598",
    "author": "bobby k",
    "date": "2025-10-13",
    "content": "mixing a rock record today and monitoring around 65-70db (or in headphones) on acount of this lil fella being in the room. really interesting challenge when i'm used to bumpin. maybe i should do this more.",
    "reactions": 13,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1471670578292330576",
    "author": "Zach Hughes",
    "date": "2026-02-12",
    "content": "Coincidentally I was exploring a similar idea this morning. I'm on a David Bohm kick and was reading his book 'On Dialogue' and recently finished his 'On Creativity' (would highly recommend both).\n\nIn 'On Dialogue' he gives an example I think can be repurposed here. Imagine a song being presented to us. An external signal. When it reaches us it makes contact with what Bohm calls the \"whole movement of thought\". The thinking and feeling apparatus within us is activated. Thoughts and 'felts' are said to be fundamentally created from memory. Upon contact a 're-presentation' is created where the activity of our thought and feeling reforms the event internally. The 'net presentation' is the fused result. 'Mis-representation' occurs when we mistake the 'net presentation' for the original.\n\nI was thinking on all this and how it might connect to your comment from yesterday, \"I told Jon that I don't think he's ever brought more to an album, but also left less of his fingerprints on it\".\n\nBohm brings up Michael Polanyi's idea of tacit knowledge. This is the always running in the background implicit structure we attend to music from, which makes 're-presentation' possible. This includes nostalgia for records we love, perceptual training, bodily memory, tolerance for brightness, etc... Implied here is that this is something you cannot turn off but can cultivate greater awareness off in disciplined participation with art. Polanyi says we attend from subsidiaries to a focal whole. If you start attending to your own sonic fingerprint as the focal object, the structure may collapse. So perhaps Jon was able to integrate a remarkable tacit contribution while being sensitive to the pre-existing structure and coherence of the whole. Maybe coherence and truth have similar meanings here?\n\nDownstream of the artist's origination maybe 'truth' in record making is deep tacit integration, suspending egoic domination, and sensitivity to the internal structure / coherence of the original whole.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1074469799763128350",
    "author": "cian riordan",
    "date": "2023-02-12",
    "content": "Eventually I caught the hang of things. I started to study the rhythms of the sessions, what order people would file in every morning. I knew the singer liked coffee one way, another guy did something else… I’d start to have that stuff ready. Instead of chumming it up with the band trying to fend off boredom while Eric was mid task, I stuck around on the couch… watching patiently. Those were the moments where he would start looping me into what he was doing, explaining his techniques. Before I knew it, I could start anticipating what he would need next. Someone mentions trying some vocals on a thing? I immediately got going on setting up a mic, getting headphones, even starting to dial in a mix on the headphone box. Percussion? Grab the trunk of junk and start laying out potential options. Once I started actually being useful, I’d be given real tasks. “Hey, do you think you could try doing a preliminary comp of this vocal?” I had been in the room for all the vocal takes, heard the discussion about approach and vibe, even made the singers coffee the right way… why not? That evolved into being trusted with recording stuff in the second studio… we were always running behind, and having me chip away at guitar tracking or re-amping was really useful. Years of this and we were a well oiled machine. I’d get looped into pre-production phone calls and meetings, he would start asking my opinion on things.. drum sounds, microphone choices.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133446099114393681",
    "author": "cian riordan",
    "date": "2023-07-25",
    "content": "First time I pulled an all nighter with EV was when he was mixing a Slash live album (Made in Stoke). We had to mix in 5.1 so we had NS10s setup around the console on old tape boxes and had everything up on the console. It was just under 2 hrs of music and we each took an end of the console and were just going at it with Flying Faders... I think thats where I really learned about the power of automation. How much more effective it is just to turn something up or down for a second as opposed to trying to compress/EQ/or saturate your way out of a problem.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230060329493594152",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-17",
    "content": "Same! I thought this song sounded bad but then I heard it with Sonarworks room correction and I was floored https://youtu.be/iq_d8VSM0nw?si=vgik9MmWGkGsuBPs",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "935024600214016010",
    "author": "oaklandmatt",
    "date": "2022-01-23",
    "content": "cian's thing is #1 for me. \n\nbeyond that, the basic-but-important things like water, snacks, comfortable places to sit, nice lighting/ vibe, clean, smells good.\n\nalso, i get regular feedback on how good the vocals sound in the headphones. when a singer gets on the mic and it's already sounding finished and clear, that's a level of comfort that is beyond everything else listed above. good chain, working headphones, quick options in your template for tune, verb, delay, distortion, etc. be ready for all comers and make it sound amazing from the getgo",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1097548439530774579",
    "author": "Nomograph Mastering",
    "date": "2023-04-17",
    "content": "“Bro do you even calibrate your baby?”",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280906038438137998",
    "author": "Nomograph Mastering",
    "date": "2024-09-04",
    "content": "To close out the topic for me before I start the work day, I really do hope that this gets solved. Rooms, speakers etc are an expensive pain in the ass. Yes, I love the dedicated church like spaces but not if access inhibits making great art and connection, I care about that much more \n\nSo bring on a fully realized headphone system and I’d be the first to Master bangers overlooking Laguna Beach",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "870396269888167996",
    "author": "Zakhiggins",
    "date": "2021-07-29",
    "content": "Found a cheap flight and went to Morocco on a whim for the last 2 weeks. Didn't bring anything music related, not even headphones. Came back home and spotted exactly the problems that I was stressing over with some songs I was working on.\nFeel really inspired to make music. \nMoral of the story is breaks can be really good lol",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1108594806109782078",
    "author": "LAPhill",
    "date": "2023-05-17",
    "content": "Little PSA here: If at all possible, have backups at your studio of any mission-critical gear. Spare keyboard and mouse, MIDI keyboard, monitor, headphones or speakers, cables, etc. etc... Doesn't have to be as good as your main axe, but something that will do in a pinch. Especially if you don't live close to a Guitar Center/Best Buy that you can run into in an emergency.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147690330490163320",
    "author": "jantrit",
    "date": "2023-09-02",
    "content": "I’m going  fail to properly put this into words but the ability to extrapolate and have an understanding of the learning process/ be driven to take that journey. One example would be this, someone comes in fresh expecting you to spoon feed them the knowledge, that’s not super helpful. But someone comes in and can say, “oh that’s a Patchbay, can you show me how it works”. You can teach those people anything. The desire and hunger to learn on their own and the ability to acquire knowledge for themselves has been a huge divide I’ve noticed in the intern/ college community.  \n\nOne time we were setting up a session and I was explaining to our intern my thoughts about which headphones we’d give to each station. (This pair has better bass, we’ll give them to the bass player. These are open back we’ll give them to the horn section so they can blend better) The very next session without having to mention it, she had placed the same headphones in the same places AND ALSO she then took that info and made a the judgement that we’d give the nicest most comfy pair to the vocalist. That’s what I mean about extrapolation.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1466518181391634465",
    "author": "bobby k",
    "date": "2026-01-29",
    "content": "Well folks I had to clear my entire week and I’ve started pushing next week’s sessions too. Day 5 of living off a generator and headphones, I smell like gasoline in a very sexy way. Ice is melting and the city is mostly open but there are still a LOT of neighborhoods waiting on power here in Nashville, which will likely continue into February",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1471682625423806678",
    "author": "Nomograph Mastering",
    "date": "2026-02-12",
    "content": "Ruairi - what if potato was happy?\nZach - We attend from subsidiaries to a focal whole",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017181375260008491",
    "author": "BatMeckley",
    "date": "2022-09-07",
    "content": "I’ve been really trying to enjoy the atmos mixes because I love that my friends are getting work off it, and any excuse to have more Castelli and less Cian in the headphones… but I’m still voting stereo.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1027403562474549288",
    "author": "Rollmottle",
    "date": "2022-10-05",
    "content": "exaggerated bass and wild highs could be symptom of a lot of headphone use",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058489564525764830",
    "author": "cian riordan",
    "date": "2022-12-30",
    "content": "I go back and forth. I finally got a decent turntable setup in the studio… calibrated, aligned, etc… and it was very interesting listening to analog and digital back to back. Most records I prefer the clarity and depth of digital, but there were a few (mostly from the 80s) where the analog pressing surpassed the digital. I still think the medium is a net positive in terms of music enjoyment and the collective industry, but I’ve moved beyond touting it as some sort of superior listening format. It’s just not. I remember mastering several records with Doug Sax and he would always joke with me saying, “you know there’s a better medium, right? Sounds better, is cheaper, etc”. Despite being the master, he understood how it’s evolved and had a sense of humor about it.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1278382839704064042",
    "author": "Rollmottle",
    "date": "2024-08-28",
    "content": "In ears...headphones...monitors...whatever it takes to get the performance the artist is after",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1466552430421344317",
    "author": "cian riordan",
    "date": "2026-01-29",
    "content": "I'm starting to mix on headphones now so i'm good with my 50 mA spikes",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1003313008665169950",
    "author": "gatewoodsensei",
    "date": "2022-07-31",
    "content": "Made it all the way the my session and left my headphones in the lyft 🥹",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017157052415619223",
    "author": "Slow Hand",
    "date": "2022-09-07",
    "content": "Stereo. I tried out some Atmos headphone mixes at an Apple store kiosk a while ago because I was curious. I can't say that it had much of an effect on me. Maybe I need to live with them for longer and get used to it.\n\nLast week was the first time that I was able to sit in front of an Atmos setup that was meant for music (aka: not in a movie theater) and really get the full musical experience. In fact, I got to sit in front of *three* different Atmos rigs in three different (treated) rooms that evening and two of them were undoubtedly set up as good as they could have possibly been (One was a PMC showroom and the other built and tuned with their input). While the speakers themselves were impressive and very capable, the actual experience felt pretty disjointed. There was a pronounced feeling of phasi-ness that I didn't like.\n\nIt was great hearing these records on a rig that probably cost $250k, but my big takeaway was that they felt disjointed and odd. Even when sitting in the sweet spot.\n\nPerhaps my opinion will change with more exposure, but I'm not yet convinced that it's worth the time and effort. I will add, though, that half the mixes we heard were up-mixed from old stereo recordings with minimal track counts and only two of them were modern productions.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078127163309559888",
    "author": "jonmatteson",
    "date": "2023-02-22",
    "content": "Honestly signal flow and gain staging would be great topics to cover. I work with so many younger artists who record themselves and constantly clip their converters because they “can’t hear themselves in their headphone mix unless I turn it up that high”",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1154483045068443862",
    "author": "JakeTB",
    "date": "2023-09-21",
    "content": "I tried to refrain until I got 4 “hey how’s that headphone adaptor treating you?” voicemails one week",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282905243658489982",
    "author": "Rollmottle",
    "date": "2024-09-09",
    "content": "Is that like a community cupping but for headphones",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1313925419644354661",
    "author": "oaklandmatt",
    "date": "2024-12-04",
    "content": "I honestly think you should sit with great headphones and listen to the album front to back. Try and absorb it like a complete art project with your full attention. He has spoken about deliberately creating something that you can't quite grab onto immediately, an album that exists in a liminal space between contemporary and vintage, between lofi and hi res, between genres.\n\nIf you sit with the album and listen with the understanding that everything you hear and experience is a choice from a single artist (rather than the multitude of collaborators for most contemporary albums), I think you can enjoy it a lot.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1316422420009193633",
    "author": "hyanrarvey",
    "date": "2024-12-11",
    "content": "Probably great and predictable cause ns10s",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1428812327112933446",
    "author": "cian riordan",
    "date": "2025-10-17",
    "content": "The sanest way I’ve found is have audiomovers and everyone listening on headphones. Then have zoom or FaceTime in addition. I’ll have the conversation audio come out of my displays speakers and use open backed headphones so I can hear the mix and the clients and nobody is getting the feed from my speakers.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017217649912074260",
    "author": "gatewoodsensei",
    "date": "2022-09-07",
    "content": "Honestly. Unless you have a room dedicated to that in your house, I don’t think the average consumer will give a damn. I think the experience has to improve on a headphones first.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1093241250083250226",
    "author": "sethearnest",
    "date": "2023-04-05",
    "content": "NS10s are the natural enemy of these birds",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125240906904252417",
    "author": "Bryan DiMaio",
    "date": "2023-07-02",
    "content": "Quick everyone hide their sonarworks",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134171158997110864",
    "author": "Jonathan Jetter",
    "date": "2023-07-27",
    "content": "I embrace the occasional lack of focus. I don't necessarily have to work a long full day to stay on track. I do have to stay sufficiently attuned to when I'm in the zone to do my best work. And then a few hours of hard work in that zone is often more productive than many hours of my B+ game. I let my mind wander when it wanders. I go for walks, or watch Netflix, or read. And then when I know I can do good work, I buckle down and do it. If I was ever missing deadlines, I'd recalibrate. But I'm not, so I don't.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1146122719360987237",
    "author": "Nomograph Mastering",
    "date": "2023-08-29",
    "content": "Remember dogmas only work when I say them, no Focals mkay",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1176573789023252520",
    "author": "chrissorem",
    "date": "2023-11-21",
    "content": "Always horrible  if I listen straight from the studio to car the night of the mix, but generally helpful if I wait to listen in the car in the morning . My brain needs to acclimate after listening in my room all day. But I always do a print of work in progress to hear on my drive in and usually the  moves are pretty apparent and I can get there quicker with night of rest. I never listen to music critically on headphones. For me it’s the studio or the car.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1248759420666777602",
    "author": "Rob Domos",
    "date": "2024-06-07",
    "content": "So I enjoyed how they sounded but started getting migraines regularly which had never been a problem in my life before. I looked into whether there was any data showing that increased emf exposure near the head was correlated to increase in migraines and it turns out there is data on this and there is a correlation. I took 2 days off from the maxes and the migraines subsided completely. \n\nMaybe strapping a small computer to one’s brain 9 hours a day is a bit much? I’d still use them for short bursts but will use dumber headphones 99% of the time",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1248764487948046368",
    "author": "Rollmottle",
    "date": "2024-06-07",
    "content": "i don't know that i'd jump to the migraines being caused by the EMF emitted by the Airpods over the simple physical pressure of the headphones causing them",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1282905896367951873",
    "author": "Nomograph Mastering",
    "date": "2024-09-09",
    "content": "\"I always like to check my Masters on ACME Brand Headphones\"",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1342256365170593844",
    "author": "Nomograph Mastering",
    "date": "2025-02-20",
    "content": "I think those headphones were the clearest ever experience i’ve had of “people hear headphones differently”",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843995066485833759",
    "author": "Slow Hand",
    "date": "2021-05-17",
    "content": "I'm reading the (lively) discussion on Hacker News about Apple's announcement today and many people are pointing out that the bluetooth codec that Apple is using in their Airpods Pro and Airpods Max are incapable of supporting hi-res audio. So it seems that any audio benefits users are expecting are unlikely to be supported by the current generation of Apple headphones: https://news.ycombinator.com/item?id=27182946",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "846607213874380820",
    "author": "Zack Hames",
    "date": "2021-05-24",
    "content": "I went to help a fellow engineer buddy record some drums today at his studio, and it made me think of something Jon Castelli said on the Conversations or LWMR podcast - he challenged the idea of being out of your comfort zone to grow, and look at the Benefits of the comfort zone.\n\nMy buddy is a great engineer and great drummer in a great and, so all great things. But his setup was just incredibly different than mine; he uses Studio One, I use pro tools (he’s also used to Pro tools and recently bailed on it). He’s using a combo of Antelope Discrete 8 and an Audient ASP880 and some good outboard pres (Vintech and Summit audio). His monitoring killed me, some small dynaudios which sounded okay and some ProAc’s. He had some decent mics. I brought my 8 Channels of UTA and a bunch of mics and was there just to put our heads together, and I was going mostly press record so he could drum for his bands record.\n\nAnyway, we spent about 4+ hours trouble shooting Studio One, his computer, and the interfaces -eventually finding out one of his AD/DA channels was so messed up it sounded like a ribbon mic when it was a condenser. A lot of his mic stands and cables were really junky - he didn’t have enough of the basics on his own.\n\nSo many things were just not working as I would expect - my UTA preamps were set at much lower gains than I do at my studio because of his gear. I’m basically ear-blind because of the monitoring, even with headphones, and I’m working in Studio One so I can barely focus on the sound. And he used a normal Apple mouse, I use a trackball. \n\nIm trying not to complain, but it just blew my mind how much of an uphill battle recording can be just because of simple things being so taxing. We spent about an hour of the 6 hours I was there tracking one song. The rest was setup. It made me realize why we put so much work into making our process simple and getting gear that is effective and reliable.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "866451224291442698",
    "author": "chadwahlbrink",
    "date": "2021-07-18",
    "content": "This Black Fridays hottest deal: \n\nSerban Ghenea's \"five dollar headphones bought at a truck stop gas station in the middle of a tropical storm in rural Florida\" Waves NX headphone system \n\n- $29",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1018241320243961956",
    "author": "BatMeckley",
    "date": "2022-09-10",
    "content": "Stuck on a plane for the next 2 hours. I don’t know if you guys knew this, but when you get on a commercial flight, behind that first curtain? THERES A WHOLE NOTHER SECTION OF SEATS!! Theyre like all crammed together! In light of this, if anyone has any questions they need answers too Ive got not much else to do than break in these headphones and rest my chin on my knees. Kinda like an AMA",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1027411789304037386",
    "author": "NoahNeedleman",
    "date": "2022-10-05",
    "content": "So many headphones are super forgiving in the low end and super present in the highs. Goes back to @peterlabberton’s thought on monitoring.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1077822019955077130",
    "author": "Rollmottle",
    "date": "2023-02-21",
    "content": "One too many Focals dissed",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1096601628095819776",
    "author": "LAPhill",
    "date": "2023-04-14",
    "content": "As long as you don't talk to him about NS-10s",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102332436228079656",
    "author": "chrissorem",
    "date": "2023-04-30",
    "content": "@peterlabberton  I agree, it seems the type rooms have a lot to do with wether people track together or 1 by 1. I’m lucky that most the tracking done at my place is done live often no click and often no headphones if appropriate. What’s amazing is how fast things go when tracking together",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1239643610543296512",
    "author": "BatMeckley",
    "date": "2024-05-13",
    "content": "Headphones onstage always a bold choice. He walked so the dude from linkin park and Mayer with dead and co could run.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1239645117653057708",
    "author": "Rollmottle",
    "date": "2024-05-13",
    "content": "Jankiest fucking dollar-store headphones too! Those 3 part harmonies were LOCKED though. Incredible performance and show.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "832992375064100914",
    "author": "cian riordan",
    "date": "2021-04-17",
    "content": "Good experience? Yes! Good results? Pretty hit or miss. For things other than vocals, not being able to truly hear sounds isolated through studio monitors is definitely a detriment. But the vibe of having everyone in one big space is great. A trade off but sometimes a worthwhile one.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "944711153555214396",
    "author": "Maxim",
    "date": "2022-02-19",
    "content": "Yeah I was considering going with the 16inch just cause of reduced thermal throttling anyways but since I got rid of my studio monitor it’s the way to go for me. Considering delivery issues I’ll get the 16gb and if it isn’t working I’ll return and wait I guess. March 8 they’re supposed to release the new Mac Mini too 🤙",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1022723477939167272",
    "author": "BatMeckley",
    "date": "2022-09-22",
    "content": "OR you could do the JJP trick that made him millions where you super gate the top snare mic to just a pop, then bus that signal out to an auratone pointed right on top of a black beauty snare in an iso booth with a mic on the bottom of that snare to get perfectly clean snare bottom sounds without all the bleed from the other drums. #DarkAgeSampleReplacing",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1038286694354530337",
    "author": "Eric Martin",
    "date": "2022-11-04",
    "content": "I have one Sonos speaker and 3 sonos connects setup with studio monitors throughout my house, for a while I had one of them connected to an output of the studio so that I could both listen to the studio playback throughout the house and listen to the sonos playback in the studio, cool shit having time aligned speakers throughout the house",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1064041485017829437",
    "author": "ehutton21",
    "date": "2023-01-14",
    "content": "I’m reading this on a throne of 3k microphones as I bump oldies hip hop through focal monitors while I smoke a blunt and talk about how the industry has a button and when they press it you go viral",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078133835721605192",
    "author": "JakeTB",
    "date": "2023-02-22",
    "content": "Transient, memorable experiences that get them excited about creating is what generates interest and learning. Get them messing around in a DAW, hearing their own voice through crazy effects, and creating something they can show their friends. Anything deeper than microphone->interface->computer->headphones/speakers is going to to get completely tuned out in the beginning of a program like that. Once they’re excited, they’ll dive deeper themselves.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1082424681774186519",
    "author": "Nomograph Mastering",
    "date": "2023-03-06",
    "content": "First question is \"Are you sure it's in the recording and not in your mix bus/DAC/headphones/Speakers\"?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138591599010517133",
    "author": "Bryan DiMaio",
    "date": "2023-08-08",
    "content": "Dan Worrall has a good video about it actually, he describes it more as a palate cleanser to recalibrate your ears every now and then",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138631260886016153",
    "author": "cian riordan",
    "date": "2023-08-08",
    "content": "This is what the inside of Beckley's headphones look like.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1149496014428979231",
    "author": "BatMeckley",
    "date": "2023-09-07",
    "content": "Yeah. He actually bought a 7 million dollar mansion. And for the first few years it was just mattresses and pro tools rigs. Meanwhile he was the most successful writer/producer of that era, but no plaques on the walls, no Ferrari, just little genelecs, some Mackies, a pre, a compressor, and a ProTools rig in every room of the house. And a mattress for when you needed to nap. Hits were made.\n\n(Then one day I was over at the house and it had been decorated finally and Diplo was like “that’s a rad sconce, is that from restoration hardware?”  and Luke was like “nah, 6th century china” (or something like that).  The sconce cost more than my car at the time 🤣)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1159694816972644392",
    "author": "jantrit",
    "date": "2023-10-05",
    "content": "@hyanrarvey @Eric Martin  you’re all welcome too! \nEdit to say it really is a lot of fun! Just got a pair of ns10’s would love to try the ns10 still in the box subkick thing. If east coast folks fancied it I’d love to host a hang, can bring in a drummer and we’ll have some fun trying weird shit",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1176988446632460329",
    "author": "Adam Thein",
    "date": "2023-11-22",
    "content": "Topping gets a lot of love on the server - they have a lot of options for DACs and combination DAC/headphone amps.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1186035786609602611",
    "author": "David Fuller",
    "date": "2023-12-17",
    "content": "Never in my life have I been so glad to have headphones as I am when there's a crying baby on a flight lol",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1229941571764355122",
    "author": "Adam Thein",
    "date": "2024-04-16",
    "content": "Well I did terribly on this while cooking chicken in the kitchen in headphones lol",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230272458943107126",
    "author": "David Fuller",
    "date": "2024-04-17",
    "content": "it was really funny how much better his mixes got when he got off those Focals",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1257468481520013464",
    "author": "Bryan DiMaio",
    "date": "2024-07-01",
    "content": "legend has it that every time someone says sonarworks ruairi gets a headache",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1292941899161800826",
    "author": "Nomograph Mastering",
    "date": "2024-10-07",
    "content": "Standardizing sonarworks on the worlds most popular interfaces",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1311863760847110225",
    "author": "Nomograph Mastering",
    "date": "2024-11-28",
    "content": "One pair sounds and behaves like maxes we love, the other sound like $15 headphones, the noise cancelling doesn’t work right, the  button tones have weird lag etc",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1415908769249890427",
    "author": "cian riordan",
    "date": "2025-09-11",
    "content": "Same. Nothing does the kick, snare, vocal hat trick like the ns10s",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828350569050537985",
    "author": "Slow Hand",
    "date": "2021-04-04",
    "content": "@Dodgy One reason for the specific listening levels that are being mentioned are because of what are called Fletcher-Munson Curves. The gist of it is that we (humans) hear a balance of frequencies differently depending on how loud or how soft the sound is. This affects our ability to accurately judge what the actual balance of a record's frequencies are and make good decisions about a mix. These researchers (Fletcher and Munson) did a lot of research and came up with a chart that shows how our perception of sound changes depending on how loud a sound is. The general takeaway from looking at these results is that we perceive sound as closest to neutral/flat when listening around 80dB and thus it is the least compromised level to listen at.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "835211535495331842",
    "author": "peterlabberton",
    "date": "2021-04-23",
    "content": "Personally, I don't really bother taking these kinds of notes while tracking. If I'm producing something myself, I prefer to just keep moving and try something, then move on as quickly as possible. If it needs to be redone for some reason, I'll just cook up a sound again and not get too hung up on whether it's identical or not—chances are if we're revisiting it, things could be improved anyway. If I'm engineering for someone else, I'll defer to them, but these are usually situations where things are even *more* time-sensitive (i.e. we're renting an expensive studio), and the situation is very unlikely to be recreated anyway. I was very lucky to have subbed in for @cian riordan with St. Vincent for a couple months in the early stages of this new record—nothing was documented (unless I grabbed a quick photo to cover my own ass), it was all just trying stuff, and if it worked it worked, if not, move on and forget it! Mixing is another story—in the (increasingly) rare instance when I'm mixing on a console, I'll figure out some way of recalling for that particular project. This is usually more or less @Rollmottle's method, except I go even more jank-ass and just scribble song names on a post-it and hold it in front of a piece of gear like a mugshot. Anything on the console is either stored in the console automation, or, like the most recent project I mixed on a console, I'll just calibrate all the faders and run stuff through it, but really *mix* in Pro Tools still. 🤷🏻‍♂️",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "846937636321099776",
    "author": "cian riordan",
    "date": "2021-05-25",
    "content": "This was the nice thing about using NS10s as my main monitor... almost all studios had them and with the lack of low end, they don't interact too much with the room so I could at least shape midrange on them.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "860819774295506975",
    "author": "ALXCPH",
    "date": "2021-07-03",
    "content": "I can only agree with what’s been said. I did the same last time I was on tour. Also sometimes simpler = better. 100 elements might work nicely in your favourite headphones but with a live system. Usually only the necessities and maby a few ear candy stuff is enough. You don’t really need 13 different synths playing the same part! Also if you are playing and inside venue that has a little bit of size to it, you don’t need as much reverb, cuz it happens naturally. If you don’t know what sound system they are running or have any contact to the sound guy, just make sure it at least sounds somewhat good in mono, just to be safe. Also make sure the backing tracks have “room” for the live instrumentalist! That way the sound guy can turn it up without drowning out the band. 🙂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "866443170292432929",
    "author": "Josh",
    "date": "2021-07-18",
    "content": "Coming back to say that for the last hour I’ve only thought about how Serban is telepathically mixing songs because he just knows it’ll sound great on the five dollar headphones I bought at a truck stop gas station in the middle of a tropical storm in rural Florida.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "867843162206240770",
    "author": "Deleted User",
    "date": "2021-07-22",
    "content": "I’m wondering how airpod max implements this. It looks like they are using hrtf type of filtering to do this, and I tested it out today at apple store. A lot of results were still a bit disappointing but some of the tracks that were mixed for atmos sounded pretty good. but still, on headphones- i preferred stereo mixes. It might have to do with the fact that they were louder too. But I would really love to have real atmos experience inside the speakers",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "997990121615921153",
    "author": "Jeremy Klein",
    "date": "2022-07-16",
    "content": "psa: if you have a Mix With The Masters account, you get a ton of amazing plugins for free, for example the Arousor.\n\nYesterday they just added a huge IK Multimedia bundle which includes Amplitude and the entire T-Racks collection of plugins.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1086782294045491240",
    "author": "Nomograph Mastering",
    "date": "2023-03-18",
    "content": "If you don’t know what it is, put on your headphones, listen first and then google the story after",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124404403596710012",
    "author": "bobby k",
    "date": "2023-06-30",
    "content": "i think in the same line with scheduling in learning is a non-optional listening period every morning. stuff i’m familiar with, stuff i’m working on, and stuff that is new and hopefully inspiring. important calibration time!!!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1141547320836620338",
    "author": "Adam Thein",
    "date": "2023-08-16",
    "content": "Been meaning to try and get back into a bit of gaming now that I have a separate space for work from where my PC is, and bought a Logitech headset figuring it couldn't be too bad and just something easy to plug in and get some basic audio and mic going on my computer.\n\nWow it sounds so bad, both the headphones and mic.  Definitely a good reminder of how good we have it over here in pro audio land!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1143389829581783090",
    "author": "NoahNeedleman",
    "date": "2023-08-21",
    "content": "All in good time! \nI’ve got a buddy with NS10s in his tubes and he makes my fav records.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147923119605022781",
    "author": "Zakhiggins",
    "date": "2023-09-03",
    "content": "What mastering really is, is someone with far more experience and reps than you in a highly calibrated room making sure your mix is definitely finished. If you’re just starting out, you probably don’t need it. If you’re looking for that last 5-10%, you probably do. Sometimes they don’t need to do anything other than tell you it’s done (which in my opinion is worth it) and sometimes they have to be more heavy handed. What they actually do (if they’re good) will likely be different every time. It’s about getting the song over the line, and whatever it takes to do that.\nYou can get plenty of great mastering engineers for 100 dollars or less. Reach out to some peeps on this discord and they’d be happy to help I’m sure",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1176980928078299176",
    "author": "Nomograph Mastering",
    "date": "2023-11-22",
    "content": "Welcome!\n\nGive us a little more info here. -Are these the only options easily available to you? \n- do you have a budget ceiling?\n- are you sure you’ll never need to record?\n- do you need a headphone output?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182943643900837909",
    "author": "spectrummasters",
    "date": "2023-12-08",
    "content": "13 . (Headphone vote)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230059889527754783",
    "author": "popaganda.",
    "date": "2024-04-17",
    "content": "It’s a constant reality for me DJing. Some records sound awesome coming out of QSCs in a room full of people and just plain weird on headphones or PMCs",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230060779907321957",
    "author": "Deleted User",
    "date": "2024-04-17",
    "content": "What if the secret to it is using sonarworks to mix in a “club” or “venues” ?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235223777600737331",
    "author": "Josh",
    "date": "2024-05-01",
    "content": "For now. Like if we’re talking just get a space to produce music, yeah I would. Get better headphones instead for the time being. Then you’re mobile too.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1248755254254637228",
    "author": "Nomograph Mastering",
    "date": "2024-06-07",
    "content": "Nah man, headphones are personal",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1249094366811787264",
    "author": "Rollmottle",
    "date": "2024-06-08",
    "content": "https://www.safesleevecases.com/products/anti-radiation-air-tube-headphones-with-microphone",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1257463024739029092",
    "author": "Josh",
    "date": "2024-07-01",
    "content": "Update it worked. I can’t wait to spend this security deposit on sonarworks",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1282885236778074265",
    "author": "Will Pragnell",
    "date": "2024-09-09",
    "content": "They're probably as good as the best closed back headphones I've used, but I still prefer open backed headphones when I'm at home or somewhere quiet",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282895153576804472",
    "author": "Nomograph Mastering",
    "date": "2024-09-09",
    "content": "Headphones are necessarily very personal, much more so than speakers.\n\nBut I've heard most of the focals and all of the Audeze and choose Maxes over all of them. Never heard the Neumanns",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1283415789315293287",
    "author": "Iwan Morgan",
    "date": "2024-09-11",
    "content": "Do you mean that headphones lack feel, so it’s difficult to get the emotion in the work while mixing? I think it’s a different kind of feel. I’ll look for the chest/bass check when listening on speakers but I want to be transported by the atmosphere and connection when listening on headphones. Some of the most formative experiences for me were listening via headphones and I try and remember those fomative feelings when checking on headphones - cassette dubs of Fabio and Grooverider on radio 1 back in the day, Spike’s mixes of Massive Attack and Mad Professor versions, my dad’s vinyl of Dark Side of the Moon etc etc",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1286460580915314688",
    "author": "Adam Thein",
    "date": "2024-09-19",
    "content": "Found this\n\n“I took the head off a snare drum and started whacking it with a wooden ruler, recording it through a Shure 57 microphone,” he says. “As I did that, I started twisting the hell out of the [API 550] EQ around 1 kHz on it, to the point where it was starting to sound more like a crash. I blended that with a snare I found in the Linn itself, which was a 12-bit machine, so it sounded pretty edgy to start with.” But the coup de grace for the sound was when Z pumped the processed and blended sample through an Auratone speaker set upside down atop another snare drum, which rattled the metal snares and gave the result some ambience and even more high end. The whole thing was limited slightly and then sent to a track on a roll of Ampex 456 running on a Studer A800 at 15 ips. Only a slight amount of reverb was added to the track later on.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293645616383004723",
    "author": "Berlin",
    "date": "2024-10-09",
    "content": "Generally speaking, we all love ours. Not sure about any complications because of android, but I would assume it should just work like any other bluetooth speaker/headphones.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1316422333115662377",
    "author": "NoahNeedleman",
    "date": "2024-12-11",
    "content": "@conor // wbotm how those ns-10s sounding?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1370055398245011467",
    "author": "LAPhill",
    "date": "2025-05-08",
    "content": "Works fine on PC. I don't have Android but I can't imagine there would be any issues, they're just bluetooth headphones.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1458883109993971722",
    "author": "thegreatcarsoni",
    "date": "2026-01-08",
    "content": "For sure, i think that balance is what I feel like i'm actively juggling. And it's sometimes tough to judge, because what may feel like shit work to me has often gotten approved very enthusiastically. And stuff I thought I was nailing was actually falling short. All part of calibrating and learning.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "811839416682676294",
    "author": "rae",
    "date": "2021-02-17",
    "content": "Haven’t tried tidal but I only use streaming (Spotify) for when I’m out and about. I buy CDs and Vinyl records which of course have album credits and imo better sound quality than streaming  from a $50 pair of Apple earbuds and I can always just plug my headphones into my turntable or CD player to really dig into a track. I don’t know too much about tidal except for that it’s better payment rates for those involved in the tracks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "824769510464421939",
    "author": "hendrick",
    "date": "2021-03-25",
    "content": "i tried the demo for Sienna and didn’t like it tbh... i A/B’d with sonarworks (with and without CanOpener) and the sound is wildly different when they’re both supposed to be flat. who’s lying? i think AA and plus im more used to sw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "826177428065222717",
    "author": "Zack Hames",
    "date": "2021-03-29",
    "content": "I’m not sure this helps from a practical sense, but I’ve listened to a lot of records and also my own mixes, in bed at night in total darkness with headphones, and everything feels SO FAST compared to when I’m sitting and mixing or listening in other situations. This has no real technical perspective, just something I’ve experienced consistently",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "827283186148311121",
    "author": "Dodgy",
    "date": "2021-04-01",
    "content": "They were talking about headphones in one of the episodes, what are your opinions on them? I have a pair of sure SRH1440s and I find them very useful for doing detailed adjustments especially in a room like min that isn't ideal for mixing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "828449517052887080",
    "author": "Eric Martin",
    "date": "2021-04-04",
    "content": "late to this, but if your room is small 78db is gonna be better because the room can’t handle more. There are calibration standards out there AES support a a few and it would be wise to learn them, they all correlate to the meter reading on a db meter = a reading on the meters in the DAW.\n\nMake 78db c weighted = -12db and you will have a loud dynamic pop mix that gets you enough headroom for the mastering engineer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "838000204099223582",
    "author": "Zakhiggins",
    "date": "2021-05-01",
    "content": "Not sure if this is the right place to ask - but can anyone here reccomend me a pair of Bluetooth headphones that don't sound like ass and won't fall off my head when I'm running around?\nMostly just for fun listening or for having another reference point for mixes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "838061683128795137",
    "author": "alecdibell2",
    "date": "2021-05-01",
    "content": "@Rollmottle have you used the pros against wired apple headphones? I noticed a bump in quality when i went from og airpods back to wired apple earbuds",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "838068228466540584",
    "author": "mixedbywong_my",
    "date": "2021-05-01",
    "content": "I’ve used the Sony xm2s before and they’re quite decent . There’s definitely that bass up sound that Sony’s are quite famous for in their prosumer cans. But noise cancellation is ace . But they get sweaty after a bit. Not for actual running but maybe walking in the city ? Chilling at a coffee shop? 😅 I believe they’re now at the 4th version of the cans . https://www.techradar.com/sg/reviews/sony-wh-1000xm4-wireless-headphones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "841992160378486815",
    "author": "Deleted User",
    "date": "2021-05-12",
    "content": "Hey, does anyone have a UAD Interface and know how I can hear Sound through my headphones ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "843970857659662405",
    "author": "Slow Hand",
    "date": "2021-05-17",
    "content": "I wonder what the end goal for Apple is. I've got so many questions: Why is it important for Apple Music to support spatial audio? What does spatial audio within headphones do that stereo cannot? Does Dolby Atmos fold down to their spatial audio algorithm in a satisfying way? How many records are actually gonna be mixed for Atmos?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843971502545960990",
    "author": "Slow Hand",
    "date": "2021-05-17",
    "content": "I could see spatial audio being good for video games, but I guess I don't yet understand what it offers that you can't already do with stereo headphones and the listener's HRTF.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843977821546348594",
    "author": "Slow Hand",
    "date": "2021-05-17",
    "content": "I agree. Atmos is such a high barrier to entry that it's unlikely to be any kind of standard outside of movie theaters and audio obsessives. For that reason I feel like Apple are more interested in the benefits that it must bring to their headphone experience. At least two of their Airpod models already support it. I just don't see the benefit yet.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "844188559145828382",
    "author": "Josh Bowman",
    "date": "2021-05-18",
    "content": "Have you guys tried spacial audio with the AirPod pros on the Apple TV app from the phone (the only place it works right now)? I thought the headphones weren’t on and the sound was coming out of my phone in the room the first time I tried it. Sounds crazy (pretty neat!). Not sure if it would make music more enjoyable but it seems Serban and Jon hanes have already been doing atmos versions of some of their major label releases for a while now… curious to see how it translates! I saw Josh gudwin built an atmos room too, and Greg wells was talking about it… so seems it’s already happened. I’d imagine the budget is higher/extra on those versions for the mix?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "846963456040763403",
    "author": "Eric Martin",
    "date": "2021-05-25",
    "content": "WeTransfer, I send via gmail sometimes if that’s easy for the client, some of my clients are evaluating on shit headphones and Bluetooth speakers so I’m not crazy worried about the quality of data compression when they’re listening on those types of speakers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "847109657105530910",
    "author": "Zack Hames",
    "date": "2021-05-26",
    "content": "Interesting, I did MP3 on Dropbox until the quality dropped, switched to WAV and it comparable to when I used to do MP3.\n\nThe only reason I send WAV before final payment is because the stream quality is so bad and I have no idea how they’re going to listen to the audio. Lots of them listen on phones or headphones straight from Dropbox app.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "847680506471645214",
    "author": "Eric Martin",
    "date": "2021-05-27",
    "content": "that’s a Bob Katz thing, it’s what they do in film calibration except it’s -23 and kept there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "852441507231039498",
    "author": "mixedbywong_my",
    "date": "2021-06-09",
    "content": "Anyone dabbled with mixing in headphones for Dolby Atmos music yet ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "852535350937255936",
    "author": "kidcutler",
    "date": "2021-06-10",
    "content": "You have to be approved to do it with a full speaker array, they come to your spot & certify you. Don’t think they’ll be approving headphones just yet.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "852940618078224444",
    "author": "karlemilhald",
    "date": "2021-06-11",
    "content": "Hey everyone. What are Your impressions on the Dolby Atmos-spacial/headphone version on Apple Music? The mixes obviously vary in quality, but two main problems I notice in all the songs I've heard are 1) A roomy/chourusy sound, which is not a creative choise, but rather seems like an algorithm, which ruins 'in your face vocals' imh. 2) Missing the glue. - These songs may sound amazing on speakers, but from a consumer standpoint, I believe that the binaural Atmos for headphones is gonna be the way 99.9 people are gonna listen. Thoughts??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "852940781252771880",
    "author": "David Fuller",
    "date": "2021-06-11",
    "content": "surround in headphones is always going to be a bit of a mess",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "852940890875101214",
    "author": "David Fuller",
    "date": "2021-06-11",
    "content": "it relies on spatial cues which, spoiler, headphones can't do",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "852966279735148554",
    "author": "karlemilhald",
    "date": "2021-06-11",
    "content": "Exactly. There are a lot of songs that have a lot of problems. Bob Marley - Is This Love sounds beautiful to me, but that seems to be an exception (and it still gets at bit of that washy sound). i would imagine these mixes are mixed for a proper Atmos setup, but how many of people listening are really gonna have that? I believe in the Atmos format for headphones for that reason. But i think it would require mixing engineers to mix with headphones in mind if that washy/roomy sound should disappear",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "867509494086762525",
    "author": "noahc",
    "date": "2021-07-21",
    "content": "Just Listening on stereo focal studio monitors… the 360RA version seems to sound a little better to me even on here. Is this because Castelli touched this version or a side effect of this mix process? Or am I trippin 🤣",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "887819276122198016",
    "author": "cian riordan",
    "date": "2021-09-15",
    "content": "Always. Will never use a vocal booth unless the isolation is necessary... would much rather switch to headphones in the control room.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "914993957266677820",
    "author": "Zakhiggins",
    "date": "2021-11-29",
    "content": "Like Matt said, just on whatever u listen to music on the most. For me that's car speakers and a cheap pair of Bluetooth headphones that I use when gymming/running",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "982690489889337349",
    "author": "ehutton21",
    "date": "2022-06-04",
    "content": "not amongst the NAMM goers but outside the neve 88 2i2 interface, i’ve peeped a few things. \n\nauratone has a revamped mixcube release that comes in collaboration with bettermaker  \n\noeksound seems to have something coming up maybe? i saw a “soothe live” plug-in a la gulfoss live",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "982920796815114260",
    "author": "rse",
    "date": "2022-06-05",
    "content": "They're active right? Those new mixcubes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "989759031172276254",
    "author": "JNinothemc",
    "date": "2022-06-23",
    "content": "Monitoring with Genelecs and Mackiesa",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "998022776277446756",
    "author": "Jeremy Klein",
    "date": "2022-07-16",
    "content": "Actually, here I'll just post all the plugins you get:\n\n```\nAcustica Audio Cream\nEmpirical Labs Inc. Arousor\nPSP Twin-L\niZotope Neutron Elements\nKlevgrand DAW Cassette\nNugen SEQ-ST\nSamples from Mars\nPulsar Echorec\nCelemony Melodyne Essential\nArturia Eternity Delay\nDenise God Mode\nAudiothings Valves\nArturia Tape Mello-Fi\nIK Multimedia Studio Max 3 SE\n```",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "998601137412395068",
    "author": "Zack Hames",
    "date": "2022-07-18",
    "content": "Yes, precisely. It lasted me almost a decade and was still a good monitoring setup and headphone system. Lots of I/O, didn't sound too bad. I ran that with my MOTU 16A, then I finally dropped the focusrite because I was sick of dealing with the software and I wanted a simpler rig.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "999409202286047394",
    "author": "ehutton21",
    "date": "2022-07-20",
    "content": "I just know how the dudes gonna listen to it. If he’s not got his headphones he’s gonna blast it on a phone speaker",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017214798565490740",
    "author": "Adam Thein",
    "date": "2022-09-07",
    "content": "I'm all for 3d headphone mixes for video games and VR, I've just never felt like it makes music consumption any better to me.  I've yet to experience Atmos outside a movie theater though for music so maybe that's where the great experience is.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017358560344154163",
    "author": "Zakhiggins",
    "date": "2022-09-08",
    "content": "Unless we get *massive* headphones with like 4 speakers in each ear, atmos probably won't work in headphones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1018241639103332462",
    "author": "1ggy",
    "date": "2022-09-10",
    "content": "What headphones did you get?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1031787309911257098",
    "author": "XLII",
    "date": "2022-10-17",
    "content": "Hi everyone, I'm new to this server, I'm a producer / artist based in Tokyo. Might be a weird question to ask, but I'm wondering if there's anybody here that's basically gotten rid of their studio in favour of working portably >> laptop + headphones or similar and had better results working that way. The reason I'm asking is because I have a nice studio in central Tokyo, but somehow seem to struggle getting in the flow there as opposed to cafes or other studios. Any nomad producers engineers in the house?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1031791834789326898",
    "author": "XLII",
    "date": "2022-10-17",
    "content": "Thank you! @oaklandmatt Would be super interested to hear your experience and what setup / headphones you work on etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1031868329385791518",
    "author": "oaklandmatt",
    "date": "2022-10-18",
    "content": "it's great to be mobile and move everywhere. i do keep my vintage 87 with me at all times, so i have a solid vocal chain anywhere (apollo x preamp is more than good enough with the 87). the challenge is headphones, and i haven't found a solution that replaces speakers. i've tried some different open back headphones (grados, focal clear mg) but they don't have the \"oomph\" that i get from speakers. the imaging and clarity is better than my ath m50x headphones i always have, but the lack of big bass and the annoyance of open back (can't really use in public, on planes, etc) make them not really useful to me.\n\nother than that i have a new M1 mac and can run full ableton and pro tools sessions simultaneously no problem. i can fit an apollo twin x and all the necessary cables, external keyboard, trackball, etc in a backpack. works great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1031869894230282362",
    "author": "XLII",
    "date": "2022-10-18",
    "content": "Great, yeah, that sounds very similar to the setup I'm thinking of. I use RME in the studio and have an 87 paired with an avalon preamp that I enjoy the sound of, but thought buying an Apollo would be a great portable compromise, cos I hear they have passable pres. That combined with either LCD-X or Focal Clear MG Pro for quiet environments and HD25 for everything else. I'm a huge fan of portability and minimalism, so although I have quite a bit of gear in the studio, it's all powered by 1 MBP, 1 iLok and 1 SSD. Which is always with me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1044716240448520353",
    "author": "Calvin Lauber",
    "date": "2022-11-22",
    "content": "Is there another set of speakers or headphones to check if the issue is consistent there? It kinda sounds like a bad tweeter with it only being in one speaker. Also possible check any patches/cables going from monitor section to the speakers. If you flip the L and R pans of the master bus does the issue stay in the same speaker or pan?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060728204924555325",
    "author": "cian riordan",
    "date": "2023-01-05",
    "content": "Swap dem NS10's L/R. (Edit: erg, maybe not. They're so high up. I've found them to sound better with the tweeter hi, rather than low. Most people who have the upright versions, and try to use them horizontally, forget to swap sides)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1060760096373751818",
    "author": "RyanLipman",
    "date": "2023-01-05",
    "content": "Not as much, but definitely prefer off to the side now like Cian’s picture. Less about doing a lot of mixing on them and more about a different perspective near the end, not that it has to be ns10s AT ALL.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060820964276961292",
    "author": "Nomograph Mastering",
    "date": "2023-01-05",
    "content": "Everything from PZMs stuck on either side of scrap wood, to mini omnis taped to headphones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1060843326980509736",
    "author": "jonmatteson",
    "date": "2023-01-06",
    "content": "I feel like binaural recording is a fun way to play with space especially in headphones. I’d like to get something that’s not 9k to do something similar since ortf doesn’t account for the skull in between.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1067976703097442395",
    "author": "ALXCPH",
    "date": "2023-01-25",
    "content": "Outputs 😅\n\nMonitors, headphone, stereo out for headphone splitter, stereo out for  consumer speaker for ref",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1068154209033277541",
    "author": "spectrummasters",
    "date": "2023-01-26",
    "content": "I’m interested ruari, I think this is a great convo about how we can spoil records by trying to make them correct , I fully agree . So do you have a way / a ritual of calibrating other properties of a mix (than sonics ) for your own consistency and what are these properties ? Simply put , apart from the spectral content , I use the feel physically of the music , I use subs for this reason . I’m interested if you have a mental checklist for other aspects of a mix as well",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078713359878324244",
    "author": "Zack Hames",
    "date": "2023-02-24",
    "content": "It’s the lighting, the headphone mix, the direction they’re facing in the room.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1083357626101936128",
    "author": "Deleted User",
    "date": "2023-03-09",
    "content": "https://www.perfectcircuit.com/accessories/cable-organizers.html\n\nhttps://www.sweetwater.com/store/detail/RCH1--rock-n-roller-rch1-multi-cart-cable-headphone-hanger",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1084874912835051591",
    "author": "mixedbywong_my",
    "date": "2023-03-13",
    "content": "Also sidenote ... the headphone out/dac out of the m1 pro laptop.... wow . pretty tight for a laptop. there's actually quite good soundstaging and headroom when used with my sennheiser HD650 cans. working remotely as my wife is at a postpartum care centre for 28days .",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1086753565692923904",
    "author": "Nomograph Mastering",
    "date": "2023-03-18",
    "content": "To keep it somewhat on topic for the discord. An example of an inventive structure. For a YouTube influencer she will get many more clicks if she positions herself with something like “everything you know about subwoofers is wrong”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093232946493796474",
    "author": "chadwahlbrink",
    "date": "2023-04-05",
    "content": "https://youtu.be/3wB3BKHmxZ4 - listen to this recording of a cassowary from around 0:45 to 1:05 - you need some headphones or a sub to experience it in full effect.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1094313684597231717",
    "author": "josephmossbridge",
    "date": "2023-04-08",
    "content": "Basically I can’t turn up my headphones to a volume over 75db",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1098769863377428681",
    "author": "cian riordan",
    "date": "2023-04-20",
    "content": "In fairness, back in my gluttonous barefoot days… I’d have a Fet, a dynamic, 2x NS10s, and a kick/snare. Wouldn’t always use them come mix, but nice to have options.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1100517478842511462",
    "author": "Nomograph Mastering",
    "date": "2023-04-25",
    "content": "People making IRs with Genelec 1030 etc makes no sense",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1103003815143284736",
    "author": "Ross Fortune",
    "date": "2023-05-02",
    "content": "I have literally no idea 😂 The session was 2016/17, so whatever came out around then? My two memories are my little nest in the dead booth, and 40 of their fans coming down to do gang vocals. Lotta headphones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105990241434746880",
    "author": "LAPhill",
    "date": "2023-05-10",
    "content": "This hurts my brain so much. Like.. does this person never listen back to what they've bounced? Then it would be double-Sonarworks'd. And if they can't tell that the bounce at the point sounds vastly different than what they've been listening to.. we have bigger problems",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105991758288015462",
    "author": "Rob Domos",
    "date": "2023-05-10",
    "content": "He’s sending clients the sonarworks curve in real time, in their space",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105993600636043296",
    "author": "Rob Domos",
    "date": "2023-05-10",
    "content": "The issue is, I think the clients are giving him notes in real time while listening to the sonarworks curve, meaning the sonarworks one may actually be more balanced at the end of the day 😬",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1118657283778424962",
    "author": "Nomograph Mastering",
    "date": "2023-06-14",
    "content": "Not  beloved, never played with it myself, but apparently required more maintenance and calibration than the normal VCA based system",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1123736551646564382",
    "author": "Rollmottle",
    "date": "2023-06-28",
    "content": "I've said this here somewhere before, but every dope looking Youtube and IG studio i see, my reaction is always, \"damn, great looking studio...shame about the <Barefoots, Adams, Focals, etc > tho\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1123736749915508797",
    "author": "Josh",
    "date": "2023-06-28",
    "content": "Meanwhile I’m solely working on headphones until I move like I actually have an ounce of reason to judge 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124406079137263728",
    "author": "cian riordan",
    "date": "2023-06-30",
    "content": "Interesting! So you basically rifle through reference tracks first thing to get calibrated?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1137094439920218212",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-08-04",
    "content": "Huh that‘s the one place it should feel great to listen to probably… I luv it on headphones and speakers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1138609497343008828",
    "author": "Nomograph Mastering",
    "date": "2023-08-08",
    "content": "The sound of me hissing at Sonarworks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151165844433408060",
    "author": "bobby k",
    "date": "2023-09-12",
    "content": "100p, i think that's a practice nathan encourages a lot. ears work slightly different each day, good to \"re-calibrate\" with familiar stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1153777356729765980",
    "author": "Edward Rivera",
    "date": "2023-09-19",
    "content": "And also a phone app ! Super useful when I forgot my headphones one day. Could at least do edits on the AirPods",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1153802333696835614",
    "author": "Iwan Morgan",
    "date": "2023-09-19",
    "content": "This is all really useful to hear, thanks for raising it @peterlabberton the thing i’ve hated about doing this is having to work in headphones, and i’ve never fully worked the comms side out so that it’s not a headache/distracting for clients.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1153803425750978590",
    "author": "Ross Fortune",
    "date": "2023-09-19",
    "content": "(On speakers, no headphones required - except for clients)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1154491557928509482",
    "author": "Josh",
    "date": "2023-09-21",
    "content": "I just ask him how I should build my next studio and laugh when he recommends Focal and a bunch of other stuff I’d never get.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1154535483624394874",
    "author": "Josh",
    "date": "2023-09-21",
    "content": "Meanwhile Sweetwater called me to see if I had any questions about headphone splitter cables. @musicbydru was there to witness that one 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1154788587037016117",
    "author": "Rollmottle",
    "date": "2023-09-22",
    "content": "Can't tell what size they are, but they're Genelecs in their flush mount kit. From this series: https://www.genelec.com/theones",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1156626691746189322",
    "author": "Nomograph Mastering",
    "date": "2023-09-27",
    "content": "Spider was baffled or even frustrated why I wouldn’t call out certain things and to me it was all about likelihood of change being possible. So if for example we knew that someone was gonna be stuck on Amphions for another few years then aside from saying something “there’s low hanging fruit there when you can make a move” I would focus on things we *could* change - flip the layout, delete Sonarworks etc etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165717017693790239",
    "author": "river",
    "date": "2023-10-22",
    "content": "New Linus tech tips video, they setup audio for Linus' front room. I quite like his videos and it was fun watching them calibrate the setup and their new audio engineer is cool. He complements Linus on his ability to hear",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1167674136731074620",
    "author": "cian riordan",
    "date": "2023-10-27",
    "content": "its enough of a distance to turn a nearfield into a mid-field. Last session I did on one the NS10s were so far away they were useless, ended up just getting them off the bridge and used the mains instead.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1176986742893584424",
    "author": "SujalMixes",
    "date": "2023-11-22",
    "content": "-These 2 come in my budget I'll try if I can push the budget,but I won't be able to invest in Any rack unit for now because of Portability\n\n-I do record but not in my Setup,i book studios\n\n-Yes I definitely need a headphone output",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1176989856375783464",
    "author": "Nomograph Mastering",
    "date": "2023-11-22",
    "content": "That sounds great, and has a great headphone amp",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1177040879463190639",
    "author": "owengineered",
    "date": "2023-11-22",
    "content": "You’ve piqued my interest. Is it a particular model you’re referring to ? And would you consider the headphone amp to be good ? Potentially interested in making a similar upgrade to @SujalMixes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1177050462734794912",
    "author": "Gerhard Westphalen",
    "date": "2023-11-22",
    "content": "The Z8. Not sure about the headphone amp",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1180274059708207184",
    "author": "hyanrarvey",
    "date": "2023-12-01",
    "content": "That could get bad if he was on focals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1184987162622562325",
    "author": "oaklandmatt",
    "date": "2023-12-14",
    "content": "I need urgent London help! \n\nI need a decently sized studio monitor and interface at a building in London Fields *tomorrow*. I need it before 2:30 but only need it for a half hour.\n\nI'm looking at a building that is offering to help build me a studio. I want to test how much the room leaks to determine how much construction would be necessary.\n\nTomorrow before 3 is the only window between me and the owner before I leave town.\n\nAnyone in the neighborhood willing to pop over? Or anything around there from which I could borrow or rent or buy/return?\n\nThank you in advance for any help!\n\n Can anyone lend a studio monitor with decent",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1215365048420270160",
    "author": "BatMeckley",
    "date": "2024-03-07",
    "content": "Have you considered switching to NS-10s?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1229964245131853845",
    "author": "SoundsLikeJoe",
    "date": "2024-04-16",
    "content": "My score on the gamer headphones by the couch... \nFun game.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230210379515433040",
    "author": "Matt Huber",
    "date": "2024-04-17",
    "content": "Any quick opinions on Fathom vs ATC sub w/ ATC midfields? Pretty hotly debated amongst ATC users, curious to know your opinion given that I’m sure you’ve integrated both.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230598360172462100",
    "author": "spectrummasters",
    "date": "2024-04-18",
    "content": "Welllllll , post content discussions : I’ll be nodding off to the Jesse ray ernster thing . From meeting the client , to comparing the ref , mixing on ns10s only and going over client revisions",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1232083660241375332",
    "author": "Chase H",
    "date": "2024-04-22",
    "content": "Would I be banned for photoshopping Adam Audio monitors into everyone’s studio pics?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235183001957040128",
    "author": "river",
    "date": "2024-05-01",
    "content": "Not studio monitors I mean a display",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235223228025278525",
    "author": "Josh",
    "date": "2024-05-01",
    "content": "Idk I did 90% of my work this past year on Neumann headphones and a laptop on my couch. \n\nGet the kalis for $800 \nGet an SM7dB for $500\nGet a couple stands for $100\nGet a duet for $650\nGet a good set of headphones for $650\nAbleton suite $750 \n\nSo like $3500ish?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235225737972416543",
    "author": "Josh",
    "date": "2024-05-01",
    "content": "Missed the mixing part, but my headphones angle doesn’t change.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235226570965385246",
    "author": "NoahNeedleman",
    "date": "2024-05-01",
    "content": "I mean my road rig is an Apollo, a midi keyboard, an sm7 and a pair of headphones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235432223382048798",
    "author": "Zack Hames",
    "date": "2024-05-01",
    "content": "The other thing I did a long time ago was just make a playlist of as many Eric Valentine records and Listen to it constantly to sort of calibrate my ears:\n\nhttps://spotify.link/HG0NoUHdgJb",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1246684523073114143",
    "author": "NoahNeedleman",
    "date": "2024-06-01",
    "content": "Headphones required:\n\nhttps://www.tiktok.com/t/ZTLvHeBho/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1248899949945684028",
    "author": "spectrummasters",
    "date": "2024-06-08",
    "content": "This is an experience that is increasingly meta for the human race on  🌍 . The manufacture and consumption of electricity has been exponentially increasing . It’s only really been since the 1900s that mass consumption of electricity began . Suffice to say the electromagnetism of our planet has been changing enormously and will continue to do so . Those tin foil hats might not be such a bad idea with those headphones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1249094060526927873",
    "author": "Berlin",
    "date": "2024-06-08",
    "content": "@Rob Domos @Rollmottle let’s not forget our conversation re: tube headphones.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1250486525729177652",
    "author": "chris_donlin",
    "date": "2024-06-12",
    "content": "Had a session yesterday where I hooked up to an RME, headphones and airpods are only playing out of the right channel since. Sound prefs and audio midi setup on my mac are showing the sound is balanced from L to R. anybody experience this before? Sound is stereo on the external macbook speakers, just not headphones/airpods",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263526422035693733",
    "author": "spectrummasters",
    "date": "2024-07-18",
    "content": "Really great to hear dialogue about how the music feels on your body as an important aspect of mixing . Coming out of club music  and intending for all our tracks to reach PA systems rather than headphones , feel is everything .Thanks for the share",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267624551186174025",
    "author": "Bryan DiMaio",
    "date": "2024-07-29",
    "content": "At AES when they were like \"oh we can totally calibrate an Atmos system\" they were just running Sphere lmao",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267639013523591329",
    "author": "Bryan DiMaio",
    "date": "2024-07-29",
    "content": "I’ve used it in a pinch but can’t rely on it to be completely bulletproof like native interface stuff from Lynx or RME is. I just use the features on my interface but may move to one of the newer RME or Metric Halo boxes due to *where* in the signal chain you can put your calibration/crossovers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267642332023619584",
    "author": "Bryan DiMaio",
    "date": "2024-07-29",
    "content": "I recently put in a ticket with them and they said bass management for up to four subwoofers was coming in the next few weeks but I’ll have to give it a proper sniff test before saying it works well. The new RME stuff can do all this in its sleep though so it’s an interesting contender",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1269462251794993182",
    "author": "Jonathan Jetter",
    "date": "2024-08-03",
    "content": "Granted my whole calibration for all that may be skewed, given where I live.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1278378783627284550",
    "author": "lystell",
    "date": "2024-08-28",
    "content": "I just saw a couple of clips of Amy Allen performing live. It looked like she was wearing headphones and I first thought - smart! Then I thought, what does the audience feel about this. Any thoughts?\nI haven't been to a concert where the artist whore headphones so I can't really say for myself. I guess it kinda depends on what kind of concert it is.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1278379238332039249",
    "author": "Edward Rivera",
    "date": "2024-08-28",
    "content": "Guitarist of linkin park performed with headphones, nobody seemed to mind",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1278444537156472914",
    "author": "lystell",
    "date": "2024-08-28",
    "content": "I apparently don't see as much live music as I should. I don't think I would mind the headphone thing either. Just not used to it. \nI DO know though, that I would prefer a headphone-live-show, rather than a show built on more choreography than music.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1278625908659326999",
    "author": "jonmatteson",
    "date": "2024-08-29",
    "content": "A lot of artists are wearing headphones right now as well as sitting while performing. They are mostly copying frank ocean live performances where he was using noise isolating headphones over his in ears to get more isolation from the pa but they just like the look and the studio on stage vibe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1278688992610619432",
    "author": "NoahNeedleman",
    "date": "2024-08-29",
    "content": "Plus IEMs have way more isolation than over ear headphones.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1278766783523983412",
    "author": "conor // wbotm",
    "date": "2024-08-29",
    "content": "Bon Iver possibly pipped Frank to the post in 2016... Bon Iver rocking a pair of straight Audio Technica M50xs while Frank has an odd pair of Vic Firth drumming headphones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1280527104202506373",
    "author": "Nomograph Mastering",
    "date": "2024-09-03",
    "content": "I can revise, QC etc on headphones but almost impossible to do a new master on headphones. Sadly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280678520506417162",
    "author": "Nomograph Mastering",
    "date": "2024-09-03",
    "content": "Too much to get into but I’ve hinted at all the components here before and pointed to research too. Right now we have all the headphone companies focussed on just one aspect of the experience, driver design. Imagine 10 car companies all making better and better engines but no one ever thinks to upgrade the transmissions, brakes, wheels etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280680719429144587",
    "author": "Bryan DiMaio",
    "date": "2024-09-03",
    "content": "Mostly folks working with headphones.com (Blaine Lacrosse, Griffin Silver) but a couple of them have designed their own headphones. DMS and Auribus Acoustics mainly. They’re really into both the research side of things and the “how does all of this work together to make something that sounds good”\nThe research they’ve been getting into has been helping to chart a good way forward. Especially now with preference bounds around a target rather than strict adherence to it since everyone’s head and preferences are different.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280681309076848682",
    "author": "Bryan DiMaio",
    "date": "2024-09-03",
    "content": "Tuning a headphone is more than altering the driver and any EQ, it’s the whole housing/cup as well",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280681562345701487",
    "author": "Nomograph Mastering",
    "date": "2024-09-03",
    "content": "But you can’t mix or master at a high level on headphones reliably",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280681979402260483",
    "author": "Bryan DiMaio",
    "date": "2024-09-03",
    "content": "Yeah I’m not big into mixing on headphones but have been interested in the developments just in case",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280682414821212182",
    "author": "Nomograph Mastering",
    "date": "2024-09-03",
    "content": "I’m as convinced as I was 5 years ago that we’ll mostly be mixing on $5k to $10k headphones in a decade",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280683046575669320",
    "author": "Bryan DiMaio",
    "date": "2024-09-03",
    "content": "VSX seems weird to me because it’s a closed back system and that’s inherently seal-dependent (among other problems with most closed back headphones)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280683687490355310",
    "author": "Nomograph Mastering",
    "date": "2024-09-03",
    "content": "Instead of me saying no no no, ask yourself *why don’t headphones translate today?* and what would be the total addressable market if they did?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280856460322144358",
    "author": "Iwan Morgan",
    "date": "2024-09-04",
    "content": "Glenn Schick is doing it solely on headphones apparently, I always thought he was an outlier and I know he still does big records although I can't vouch for the sonics of them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1280902266429378652",
    "author": "Nomograph Mastering",
    "date": "2024-09-04",
    "content": "The only thing anyone ever notes about Glenn is that he works on headphones\n\nHis work may be great but in the thousands of times I’ve gone “wow that sounds great” and checked the tidal credits it’s never once led to his name. Randy, Chris, Ted, Athens etc many times over\n\n(But again as I always say he could I’m sure legitimately say the same thing about me. So I’m not trying to project status, just observing that he’s often held up as an example of why we *can* work on headphones but no one seems to know his actual work)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280902958292406364",
    "author": "Nomograph Mastering",
    "date": "2024-09-04",
    "content": "I’ve mastered plenty of work done in headphones and it can be fine, the more synthetic the genre the easier it is to do. But vocal placement, low end relationships, imaging always feel less than 100%",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1282841546181443636",
    "author": "Andy Lawson",
    "date": "2024-09-09",
    "content": "Max’s are so nailed on for me. Been looking for a pair of headphones for 15 years. Finally found some. I wouldn’t be upgrading even if they were all new and whizz bang. About to do my first flight with them, curious re noise reduction..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282883196941373470",
    "author": "itaylerner",
    "date": "2024-09-09",
    "content": "Do we feel like Apple Headphones > Focal, Audeze, Neumann, etc...?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282885450293317633",
    "author": "Will Pragnell",
    "date": "2024-09-09",
    "content": "To be fair I also haven't used many super nice closed back headphones, now that I think about it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282886583149920307",
    "author": "itaylerner",
    "date": "2024-09-09",
    "content": "Makes sense. I know we've had lots of headphone discussions in here so I get that it's all flawed / relative etc etc. Regardless, super impressive that apple's (pricey, albeit) consumer headphones compete and potentially beat out top pro audio  companies that are dedicated to headphones and charging 4x +",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282887212387799141",
    "author": "Will Pragnell",
    "date": "2024-09-09",
    "content": "\"good enough\" is an odd term because acutally there are lots of things you can do just fine on pretty bad headphones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282895437669339158",
    "author": "Bryan DiMaio",
    "date": "2024-09-09",
    "content": "Oddly I wasn’t a fan of the Neumann headphones but the Sennheiser HD600 has been my pal for a while when I need to use headphones (although they do lack some low end)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1282895451762331699",
    "author": "Nomograph Mastering",
    "date": "2024-09-09",
    "content": "I haven't heard a headphone I'd rather work on. But hoping I get to hear the Dan Clark stuff soon.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1282908796317859912",
    "author": "Nomograph Mastering",
    "date": "2024-09-09",
    "content": "Seriously though I don't actually use headphones day to day in the studio but I'd like to hear what the good open backs from DCA are like",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1282957387623301133",
    "author": "Nick Stetina",
    "date": "2024-09-09",
    "content": "Gonna have to add Meze Elite’s to “try” list if Dan Clark’s are in the running. Headphones are super personal, as you suggested, but it feels like I’ve tried them all and Meze isn’t involved in the conversation enough, imo.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1283000860879622206",
    "author": "Nick Stetina",
    "date": "2024-09-10",
    "content": "Headphones seem even more divisive than speakers though. One man’s dog shit is another’s end game. I’ve read some mastering engineer’s who adore the HEDDphone, but for me, I’ve never returned a pair so quickly 😬",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1283012709654331435",
    "author": "spectrummasters",
    "date": "2024-09-10",
    "content": "I just spent a month abroad prepping / basic balancing /eqing mixes on earbuds . I forbade myself from doing anything to the low end at all until I got back to my speakers . It worked out well . I’m v happy with the headphone decisions . However , I judge my low end  entirely by feel in the room though , the physical stimulation I feel guides me . A while back we discussed here in reference to a podcast I believe  ruairi posted , about using feel in mixing . I’m interested if anyone here has a particular vision about how one can compensate for or say goodbye to that specific aspect of sound (the feel ) and how useful it is in record making . I think of drums and bass particularly in terms of the frequency ranges and how the transients feel on my ears / chest / belly etc for the different parts. Any vision on how headphones mixing : mastering can satisfy this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1283459325242769470",
    "author": "spectrummasters",
    "date": "2024-09-11",
    "content": "What great work you referenced there , I fully agree about fab and groove on headphones . That was me at uni lol ! I’m with you . \n\nI think what I’m wondering about is …..with our modern lifestyles I totally get how the consumer is listening mostly by headphones now . And we as music makers are freed up enormously by working in headphones . I think rod waves album got a Grammy and was mixed on headphones iirc, perhaps it was a number 1 . Anyhoo , so I’m not contesting the movement to headphone mixing , I’m wondering for those who intend to or are doing all their work on headphones …..how will you know how it feels in air ? As one day , the artist will perform it live . I come from club and sound system culture , so the ultimate destination is a wall of speaker boxes …..and in the end music has to be re inforced for public performance . How do we know we ve got that balance right if we don’t use speakers ? (Honest question )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1292945233834676418",
    "author": "Chase H",
    "date": "2024-10-07",
    "content": "Just remembered Google can auto translate haha.\nSo the updates are auto gain, sonarworks, updated D/A and ability to bypass the preamps",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1312111479947788408",
    "author": "Nomograph Mastering",
    "date": "2024-11-29",
    "content": "Many reports online of counterfeit goods being shipped by Amazon themselves. Strings I’ll survive, but headphones I won’t so it’s Apple only for me. And happy to pay a premium or miss sales for that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1312115468940869734",
    "author": "Josh Bowman",
    "date": "2024-11-29",
    "content": "No fuss returns on headphones is also hard to beat",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1316746654547705917",
    "author": "conor // wbotm",
    "date": "2024-12-12",
    "content": "insane to say that was my first time hearing ns10s lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1337878913308819556",
    "author": "samvalentine",
    "date": "2025-02-08",
    "content": "Hey, I’m not sure where to post this exactly, but I had an interesting experience the other day that I’d like to share with the group and hopefully get some perspective on.\n\nI was touching up a track with a producer friend at the end of a writing session. Vocals and guitar recorded over a 2track beat. I typically throw a Waves L2 on my master, just to bring up the level for the rough bounce, never doing much more than a dB or two of gain reduction. In this case I had the threshold of the L2 set at -3.4. The producer said try -3.5, then back to -3.4, then -3.5… flipping back and forth seeing what he liked more. I couldn’t hear a difference. (I should say that we weren’t in a well treated room, working on some mid sized genelecs. It’s a  setup neither of us is super familiar with.) He decided -3.4 was better and I was in disbelief that he could even hear a difference. I asked if I could do a blind test to see if he could tell which setting was which. He closed his eyes and I switched back and forth a bunch of times before landing on a setting, and he called it correct three times in a row. He said he could hear something in the kick drum but couldn’t explain more than that.\nI need a sanity check. I know my ears aren’t hall of fame, but I’m still in disbelief that he was able to tell a .1dB difference in volume on the limiter.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1342258169510105180",
    "author": "Iwan Morgan",
    "date": "2025-02-20",
    "content": "@Nomograph Mastering am I hallucinating or did you share a link in the past few months of a custom made lightning>analogue headphone cable? Been snagging the short apple one all week.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1342359199774150776",
    "author": "BatMeckley",
    "date": "2025-02-20",
    "content": "I love em (the mm500s). Not a big max fan. Wish they weren’t expensive. And closed back. And portable. But alas, here we are. I tried about a dozen different headphones, didn’t look at the price until after. I just needed something that worked for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1351062413721735250",
    "author": "thegreatcarsoni",
    "date": "2025-03-16",
    "content": "My anker charger has a hard shell case with a zip pocket for the wall adapter but it’s big enough to hold ALL the dongle-like things. So everything always goes in there- USB type adapters, ilok, headphone adapters, etc..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1353853639084474478",
    "author": "Rollmottle",
    "date": "2025-03-24",
    "content": "3.5mm to USB-C is only if you want to use them with a regular headphone jack.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1370057287661654128",
    "author": "LAPhill",
    "date": "2025-05-08",
    "content": "The noise cancelling is built into the headphones (i.e. you can use it even when not connected to anything). Quality would be up to your Bluetooth drivers, but I doubt they're that different. I haven't A/B'd though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1378793017661460540",
    "author": "David Fuller",
    "date": "2025-06-01",
    "content": "Fwiw for me with speakers I found it very enlightening to go and listen to a ton; I'm at the point with my ears that I was able to pick out whether or not speakers worked for me in about 5 minutes of reference listening. But I've also suddenly been doing audio for 16 years and I've stepped on a ton of auditory rakes in that time (two sets of Focals, a set of Adams, and a set of Barefoots), so I know what does and doesn't work for me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1390007894153498776",
    "author": "Bryan DiMaio",
    "date": "2025-07-02",
    "content": "if possible, when using the VME stuff do it on the same pair of headphones you were measured on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1390018907850539109",
    "author": "Nomograph Mastering",
    "date": "2025-07-02",
    "content": "But what I’ve seen for stereo is that they are using IR impulses to measure your room with mics in your ear, then measuring again with their headphones, and using convolution (using loosely) to match",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1390032566786199562",
    "author": "andrew_yv",
    "date": "2025-07-02",
    "content": "Sony set me up with it for Mike’s BH room in both stereo and atmos. It’s the first spatialization tech that has impressed me. Not sure how quickly I would reach for it in stereo, but I can confidently pre-mix things in atmos with it, and with some loss of detail, it really does sound like *those speakers in that room through my ears*\n\nProcess is pretty cool and elegant. They put electret mics in your ears, record IR sweeps of each speaker in your room through them, then put headphones on, record IR sweeps of those, then have some sort of sum/difference algo that translates it all.\n\nWhen you get measured, go for relatively high SPL sweeps. We tried it at a few different levels and at lower levels, the result was pretty unimpressive. You can also go too high and distort, but worth trying a couple times if they’re game, which I’m 100% sure they will be for you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1394361220328591371",
    "author": "cian riordan",
    "date": "2025-07-14",
    "content": "Foamies all the way here. I've just gotten used to how they sound over 20+ years of wearing them playing & listening to music. Like a good set of studio monitors -- you gotta acclimate to them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394420737984561163",
    "author": "Gabriel Tyranny",
    "date": "2025-07-14",
    "content": "Anything too deep into ‘audiophile’ territory feels most useful as fun fact research, rather than part of making music, for me.\n\nWhen I was a kid I LIVED my music to get through hard times, listening to great artists on shitty headphones and cassettes - In that vein, I believe the energy of the creation trumps whatever sonic difference DAWs have, meaning whatever allows the creator to tap into that inspiration is what’s most important in the end, and my DAWs are best for me simply cus they remove points of friction in how my brain goes through its creative process.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1397628890813436106",
    "author": "Dereck Blackburn",
    "date": "2025-07-23",
    "content": "If you are not too far from Acton, Massachusetts, there is also very good studio Wondersmith audio. Dan Fox is the proprietor there. He has Neumann 310s with matching subwoofers.  I was just there yesterday, although I’m not sure if his availability.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1454733543145209899",
    "author": "junothemix",
    "date": "2025-12-27",
    "content": "is there a specific channel that we post for like, sound treatment, monitoring measurements etc? i have an interesting room and measurement i got from sonarworks reading today i'd love to review with others!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1461165654953689108",
    "author": "cian riordan",
    "date": "2026-01-14",
    "content": "In fairness, the 'whole new format' will almost 99% be consumed in... stereo headphones.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1463793561664229518",
    "author": "Gerhard Westphalen",
    "date": "2026-01-21",
    "content": "(When calibrating speakers e.g. on an Atmos system you don’t use full range)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1466528546880229600",
    "author": "Matt Huber",
    "date": "2026-01-29",
    "content": "One more question in terms of making sure I get a large enough generator - is the running wattage of a studio monitor the same as the wattage rating of the amps?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  }
]