[
  {
    "id": "1223053869605720164",
    "author": "JakeTB",
    "date": "2024-03-28",
    "content": "Hey all. Just wanted to say how much I appreciate this community and attest to the quality of conversation here.\n\nI put in my resignation notice at the day job today, and will be transitioning to music full-time in May. I genuinely don’t believe I could have done it without this place. You all challenge me in the best ways, and have helped me grow tremendously as a person and a professional.\n\nI still don’t have it all sorted out, and I’m still fervently pursuing mentorship in any form I can find, but for now the work is paying the bills; something I thought I’d never be able to say.\n\nThank you all for being generous with your hard-earned wisdom. It really does make a difference.\n\n(Sorry, got a bit sappy there 😅)",
    "reactions": 58,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407192665476567090",
    "author": "Zakhiggins",
    "date": "2025-08-18",
    "content": "I've had certain partners that are easier to deal with than others with this kind of thing for sure, and being with someone who actually understands these things really helps, but at the end of the day no one wants to be with someone who's grinding 100% of the time. There's more to life than that, and whats the point of being in a relationship if you never see the other person. I also get the working in music/freelance lifestyle, and sometimes its hard to even want to do fun things outside of it when you're so focused on this thing that really excites you that also is your livelyhood.\n\nIts such a hard thing to get right and in my experience with certain partners, its been an ongoing arguement, even in the past when i've had salary jobs and a very predictable schedule. So i'm not sure it goes away by making your life more regimented. I think the only answer here is being super open and radically honest about everything. \n\nIn my experience, letting your partner know when you've been asked to do something before you've agreed to it, makes them feel like they're a part of the thought process behind the work and less like they're just observing you living your life from the outside. Even if you were always gonna say yes to it anyway, at least they feel like they have some control and are on the same team as you. IME you just gotta go out of your way to make them feel like they're doing it all with you. They feel closer to you in a situation where they could just as easily feel like they're being pushed away. I'm not sure what way you've went about it, thats just my experience. If you're living with your partner you kinda have to see yourselves as the same person working toward the same thing, as opposed to two individuals with their own lives.\n\nAlso going out of your way to be spontaneous and do something fun and/or stupid like you're teenagers when things arent as busy goes a long way when things are.",
    "reactions": 23,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1336265716332236832",
    "author": "NoahNeedleman",
    "date": "2025-02-04",
    "content": "Ok Tl;dr- where you are matters as much as who you are. \n\nI’m also from a small town, moved to LA trying to get famous and got my ass handed to me by artists who were better looking & more talented and yet were still struggling to be seen. But I kept at it because I’m tenacious, (read: delusional, as all artists must be.)\n\nI was able to work *for* some of those artists cause I had a diverse skillset, and I was full time music after about 4 years, by the time I was 26. Doing gigs at hotels and playing guitar or recording for other people, teaching guitar, leading music at churches, all the while pouring evening last ounce of money & energy into my artist career, until my last real artist project broke up the week we were supposed to sign our first record deal. I was 36. \n\nThat’s when I moved to Nashville and really gave myself over to music directing and producing and writing for other artists. I did it as a consolation while I regrouped to find my next thing, but for some reason, when I made the move all the sudden my whole career made sense to me. \n\nAs it turns out, my real joy comes not from the sound of my own voice, but from helping others find theirs. When I acquiesced to that very real, very culturally counterintuitive calling, I thrived. \n\nAll the sudden I was playing music with and for a bunch of my heroes, and all my friends who were artists starting getting famous. And (shocker) I was really glad I wasn’t one of them. \n\nI always thought that my calling was to help people feel less alone in the world, and that the music I made was the vehicle for that calling. In the end, it turns out it was the relationships i built through music that were the real vehicle.  \n\nIt took me a long time to figure out who I was, and the cities I was in played a huge role in that story. Nashville built its whole industry on people who want to *help* artists, not just *be* artists. \n\nI miss LA every day but I’m in the right place. So, my friend, where is the right place for you?",
    "reactions": 21,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1099020958393716796",
    "author": "cian riordan",
    "date": "2023-04-21",
    "content": "Lots of great advice here. Depending on your relationship, and no matter what you do to try and help, just be sure to set boundaries for yourself as well.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134649562745798737",
    "author": "NoahNeedleman",
    "date": "2023-07-28",
    "content": "Loving your job 80% of the time is a phenomenal, compared to the general public. \n\nOne thing I’m amazed by working with Cian & Rollmottle is their endless capacity for positivity during a project. No matter how shitty my delivery or communication, they approach things with a smile and a sense of humor. I’ve literally never heard either of them complain. I thought commiserating about shitty aspects of a gig was a part of professionalism, but they have me rethinking things. \n\nIn my own projects, when I approach clients with patience and curiosity, I find that not only are they happier faster, I’m happier the whole time. It’s SO MUCH EASIER to say “let’s try it” than to say “here’s why that’s not a good idea.” I find I learn a lot that way too. \n\nIn any case, going back in to fix or add only bugs me when I think I’m supposed to be done. If I can stay open, then opening a session feels a lot easier. \n\nSo I guess my advice is: you might have fewer problem clients if you try to remember they’re not problems to solve, they’re people to serve.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1074469821690945577",
    "author": "cian riordan",
    "date": "2023-02-12",
    "content": "The take-way from all this blibber blabber is that I went in expecting to be trusted immediately. I wanted to show off… to establish ‘status’ as Ruairi put it. But it took years of patiently learning the ropes at the highest level to be trusted by the folks in the highest circles. I look back upon that now and I’m still amazed that I was paid to do that. It was essentially like a paid college degree in making records.\n\nSo now when I go into studios with a big client, I see the assistant through those eyes. I’m kind but communicative. If they can hang in the back and figure out how I work, anticipate breaks — get the menu book ready — know that we’re going to change gears — start setting up for that — then they get looped in. They get my running commentary on what techniques I’m doing. They get the inside baseball… “I wish they fired this fucking drummer”. \n\nI agree with Ruairi that this type of coming up through the ranks is a loss for up and comers. It was tried and true way to make people understand the ins and outs of studio technique, etiquette, professionalism. I’m glad I got to ride one of the last waves of it. I wouldn’t be here making records at this level if it weren’t for the opportunities I had at the bottom levels of the industry.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1108790103062614057",
    "author": "Rollmottle",
    "date": "2023-05-18",
    "content": "Really tough and big question. Some broad thoughts: Expectations are unrealistic. Definition of success is probably flawed. If what you're doing is not having the desired outcome, then it demands a reexamination of what you're doing or what outcome you're aiming for. For some, that can be catastrophic because the worldview they've built, all hinges on everything lining up perfectly. In reality, that is a moonshot mostly out of their control and they need to reset expectations about timing and outcomes. If this person hasn't shored up the fundamental needs of their family or relationship or finances, then it stands to reason they aren't grounded in their reality and for me, would call into question whether they actually have put in their best efforts (best efforts to me would include integrating these factors into my equation and making sure my pursuits aren't the source of added strife for myself or others).",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1192359851880362015",
    "author": "Slow Hand",
    "date": "2024-01-03",
    "content": "It's been my experience on many occasions that successfully overcoming a tough initial misunderstanding with someone at the very beginning can be a fantastic start to a long relationship full of care and respect.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1274107314454138900",
    "author": "Ross Fortune",
    "date": "2024-08-16",
    "content": "I only wish the Discord existed a decade ago, and that I’d found it then.\n\nThe individuals who make up this community have been unreasonably generous and patient both with me specifically and with sharing their knowledge more generally, and it’s hard to express what a profound impact that’s had on my relationship with making music, the business around it, and with myself.\n\nYou all rock.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058495409401626685",
    "author": "BatMeckley",
    "date": "2022-12-30",
    "content": "ALSO: we tend to enjoy things more when we’ve put some effort and care into them. The effort and care of removing a record from the sleeve. The delicacy of dropping the needle just right, we’re now invested in it, and we enjoy that. \nWhich actually lends me to my second life theory: The Pistachio Complex. TPC states that more often than not the joy we derive from something has a directly proportional relationship to the work we put into it. I had this realization when I was 10 at a vending machine that had shelled pistachios, and they weren’t nearly as good as when you had to put in the cuticle busting effort myself.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1159156548367552715",
    "author": "Zach Hughes",
    "date": "2023-10-04",
    "content": "Story time. Last night me and my gf saw Janelle Monáe on her age of pleasure tour at the Ryman here in Nashville. While she was making her entrance on stage something weird happened to the sound. Loud pop, clicking, and then no signal, but seemed like the in-ears / on stage monitoring were still working. Her and the band played through the entire first song while everyone in the audience was just looking around confused. Many heads turning to the sound board. Eventually the crowd started a 'we can't hear you' chant and Janelle and the band realized what was going on. They all calmly walked off stage. Took maybe ten minutes for it all to get sorted with the sound. Then Janelle and her band proceeded to come back out redo the entire intro / first song and give maybe the greatest live performance I've ever witnessed. The show ended with a double encore. It felt like such an amazing example of class and professionalism. I got the sense that she decided, after walking off the stage the first time, that not a single person in the audience will remember this show being anything but amazing and it was. Truly undeniable. If anyone here has a chance to catch any of the remaining shows on her tour, I could not recommend it enough. 🤘",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1156607218045689986",
    "author": "LAPhill",
    "date": "2023-09-27",
    "content": "Maybe unpopular opinion, but if you have the time and you believe in the band, it could be worth doing them a favor, saving the day and looking like a hero. One freebie/discount could bring you their next album and referrals for more work",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1198278066762436608",
    "author": "chrissorem",
    "date": "2024-01-20",
    "content": "When I was In 3rd grade  I tripped a girl that I had a crush on and she fell and broke her leg .  As you can imagine that relationship didn’t work out",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1274039439244660908",
    "author": "jonmatteson",
    "date": "2024-08-16",
    "content": "This place feels like the coolest coffee shop in town where you always run into cool people that have similar interest. It’s been so fun to learn from everyone and their individual experiences and I am really grateful for the relationships that I’ve gotten to forge in real life through this community",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1317552323580395540",
    "author": "Slow Hand",
    "date": "2024-12-14",
    "content": "This feeling intersects with two thoughts that have been at the forefront of my mind for the last year:\n\n1) Everyone wants to be happy, but no one wants to be satisfied with what they have.\n\n2) What have you done to let go of your old identity so that a new one can grow?\n\nThe first is a reminder for gratitude and a mantra of sorts that tells me that I'm enough and that I have enough. To tamp down runaway desire and appreciate what is in front of me.\n\nThe second is a call to identify my inhibiting beliefs and behaviors. To strip away the aspects that are no longer helpful or that burden me. To let go.\n\nThinking on it now, one prevents me from being ruled by the future and the second un-tethers me from the past. \n\nIf our goal is to become unstuck and discover a new direction we can open a lot of doors by examining our relationships with the future and the past.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1337930787433218119",
    "author": "NoahNeedleman",
    "date": "2025-02-08",
    "content": "Another quick story, I was streaming a production/mix with my old boss / mentor / producer Jon Kaplan, thinking I was close and just wanting an outside ear. \n\nDuring the first chorus, Kaplan goes “solo the kit… flip the phase on the mono room and dip 400hz in that mic.”\n\nHe didn’t even ask if there *was* a mono room mic. \n\nAnd I kid you not, all the sudden the snare jumped like 4db in the mix. I muted the claps I was using to bolster 2 & 4 and the mix was done. \n\nThat was one of the most virtuousic moments of listening I’ve ever witnesssed.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069675534948253728",
    "author": "TheBlur",
    "date": "2023-01-30",
    "content": "I live in southern Oregon. Small town USA. We have an insane studio 4 blocks from my house and a town of 40,000 people to test music on.\n\nGary Mallaber from the Steve Miller Band told me, “if you can fill the house where you’re from, you can do it anywhere. \n\nI’ve been making records and scoring films remote for years now. But have to hustle and make appearances often. Networking  can be done online, but make sure to be in person to solidify your relationships",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1336375885455949874",
    "author": "Chase H",
    "date": "2025-02-04",
    "content": "@franc.castillejos \nI’m in Milwaukee which is by no means an LA or a Nashville.\n\nI’m getting closer to being able to go full time mixing and doing some recording/producing in this small town by honestly just going out to shows of artist I enjoy and networking with them on a personal level, not even bringing up me mixing or recording for them.\n\nFulltime will  mean different things to different people but to me that means being able to support myself, my future wife (I get married in May) and our future children being able to stay at home full time without my wife having to work.\n\nI haven’t worked on anything big but I love Music and being able to be in service of someone else putting out their vision.\n\nI was close to moving to Nashville last year as I have a good amount of connects but for my life it wasn’t the right thing,\n\nThis may not be worth much because I’m by no means a heavy hitter engineer like some of the people here but maybe it’s a good idea for you  to DEFINE what success is to you, and then work backwards from there.\n\nWherever you end up I’m sure there will be a community of artists that you gel with and over time can work with and help them present their art",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1381830875494486106",
    "author": "bobby k",
    "date": "2025-06-09",
    "content": "Been pondering..a few thoughts:\n-prioritizing health & productivity are not mutually exclusive, in fact they are easily aligned. A shorter work day that began with a workout is almost always more fruitful than a longer day grinding away\n-not everything needs to be said with words, not everything needs to be a conversation. body language, silence, or taking initiative on a task all do a lot on their own. \n-deep breaths and letting the emotions process and pass before responding almost always yields a better interaction, in business and in relationships\n-nobody really needs to know how hard you worked.\n-you’re not Superman, there will be things left unfinished each day (music/work, house projects/house chores). Having a system of prioritizing helps foster peace with the unfinished stuff",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1108841445302992997",
    "author": "Slow Hand",
    "date": "2023-05-18",
    "content": "Yes. If you ever encounter someone who is giving you clear, honest feedback about something *and* is qualified to do so keep them close. That can apply to creative work, relationships, or other collaborations. I highly value those people when I meet them.\n\nThe feedback may painful to hear, but if it is constructive and presented in the right spirit it is worth it's weight in gold. We want to run *towards* that. The closer that we can get to tightening the feedback loop between our actions and their consequences the better off we'll all be.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1218708666216353802",
    "author": "Slow Hand",
    "date": "2024-03-16",
    "content": "Fun question! I hate to complicate an already nuanced premise at the outset, but when I observe my own choices and think of each category I see myself living both sides of all three spectrums, but in different domains:\n\n**For example:** I could be short-term in career objectives and overt achievement and long-term oriented in relationships and satisfaction. Cutting edge in creative pursuits, but classics in my personal taste. Specialist in my mode of expression, and generalist in my interests.\n\nThe more I subdivide and examine the question the more I find exceptions to everything. I am steeped in knowledge, but I seek wisdom above most things, which some philosophies would consider contradictory.\n\nThis Anais Nin quote comes to mind:\n\n> \"We do not grow absolutely, chronologically. We grow sometimes in one dimension, and not in another, unevenly. We grow partially. We are relative. We are mature in one realm, childish in another. The past, present, and future mingle and pull us backward, forward, or fix us in the present. We are made of layers, cells, constellations.\"\n\nI think people are extremely lopsided and unbalanced when you start to drill down into their psyches, and that's wonderful! \n\nFor the sake of refining this question and narrowing the scope, should we confine these three axis to only record making? Or do we want to approach it in a holistic sense?",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1304853924523544586",
    "author": "BatMeckley",
    "date": "2024-11-09",
    "content": "“Hey man, we’re grateful that someone with such a passion for audio and such a large audience has decided to join our discord. Welcome!”\n\nIt’s kinda like when your friend forces you to go to their open mic “man you really sounded like you up there! You had that whole acoustic guitar strumming/ mic thing goin on! I’m proud of you!”",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1313232966251450458",
    "author": "chrissorem",
    "date": "2024-12-02",
    "content": "My relationship to things I don’t understand is the common denominator to my entirety of existence and it’s  dived into two categories. To care or not to care.  There are many things in don’t understand and don’t care to understand. The things I care to understand, are like a looking into an infinite microscope and every experience allows me to zoom in a degree closer to comprehension.  My approach to this is simple, to remind myself to keep open minded and question everything.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1315866594286633030",
    "author": "BatMeckley",
    "date": "2024-12-09",
    "content": "Please. PLEASE. Can everyone stop trying to do the mk.gee thing? It’s a testament to how brilliant that guy is and how unique he is, but I’m getting five refs a week from people that have just discovered artists that have discovered mk.gee. \n\nIt reminds me when I went to open mic comedy nights in LA and 6 of the 8 acts were clearly trying to do Mitch Hedberg, but without any of the brilliance and originality that made Mitch, Mitch.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1400116597791916032",
    "author": "Brian Reynolds",
    "date": "2025-07-30",
    "content": "They're called open mics, and the success rate is just as low",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1115688746277404773",
    "author": "Bryan DiMaio",
    "date": "2023-06-06",
    "content": "word of mouth is a powerful thing",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1137503335763693628",
    "author": "Edward Rivera",
    "date": "2023-08-05",
    "content": "The Buddhists and Stoics were onto something. If you're too focused on the future, and not on what's in front of you, you're telling yourself that the present isn't good enough, that it isn't sufficient. And if you're relationship to anything presently - be it the current project, your current job, your current relationship or current living situation - then it's already been corrupted and you're in for a shit time.  *if only this was Grammy shit, if only this was hitsville, I'll work hard my ass off that shit comes along*",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147734304273748068",
    "author": "rileybrewer",
    "date": "2023-09-02",
    "content": "^This! Nice to have app to scroll when some distraction is needed that doesn't leave a bad taste!  😅\n\nEven without engaging, being able to read conversation between peers with bags more experience is 👌.  Rich discussion, on topics that can be hard to find a platform for!\n\nAs a young  producer without a \"mentor\" or many local peers. Big thanks!",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1207011282176311326",
    "author": "NoahNeedleman",
    "date": "2024-02-13",
    "content": "Just reread the welcome message after @Adam Thein posted it, and forgot that Matt called this place a “decentralized mentor.” Love it!",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1464125107487379570",
    "author": "spectrummasters",
    "date": "2026-01-22",
    "content": "This completely resonates with me. The business of music doesn’t sit as well with me as the business of construction. There’s a camaraderie and kinship in physical labour on construction projects, and an embodied intelligence in that world that offsets the subjective and (for me) atomised work of hours alone mixing.\n\nWhen I’m doing construction work, I’m also free to think objectively and from a distance about my audio engineering work.\n\nMost of all, something changes for me when I’m being paid for musical “work” that I’m not entirely happy with. I’ve discussed this privately with a few folks here, and it seems the relationship between music and its commodification is problematic for more than a few of us. Simply put, it’s sometimes less enjoyable — though equally amazing — being paid for a passion.\n\nI couldn’t recommend a construction or skilled trade career enough. It’s incredibly flexible and offers a tonic to music careers: you know you can walk onto a site tomorrow and get paid quickly and well. It’s always going to be around, and in my case, the certifications allow me to consider migrating to most economies globally as a skilled worker.\n\nConstruction allows me to be my own patron for my musical endeavours, and that feels really good.\n\nI’d love to see a bigger debate here about how working in the upper echelons of the music industry feels long term — challenges, payoffs, economics, job security, retirement, healthcare, family life versus work life, and a world where socialising is networking.\n\nConstruction is a simpler engagement: competency, find a solution, do the work, go home.\n\nI came across @cian riordan discussing becoming a fireman on Conversations, and much of what you said, Cian, is exactly what I get from construction.\n\nI love how for you, though — instead of the firehouse bell calling, it was multiple Grammys!",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1072665744942317599",
    "author": "cian riordan",
    "date": "2023-02-07",
    "content": "I don't think the Grammys does anything for art or creativity. I think it's good for the music business to have a night on primetime television, it can be good for the recipients (especially those with their names not on the album cover), and the organization creates networking and learning opportunities for up and comers. But no, I don't see any net benefit for the art. I would go on record and say little to no effort during the production process is spent talking about 'going for grammys'... or whatever.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134657260702929038",
    "author": "LAPhill",
    "date": "2023-07-28",
    "content": "This. And just to add, if you've overcommitted, make a graceful exit. Refer the client to someone you trust, don't leave them in the lurch and chances are your professional relationship, and reputation, will be fine.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1137498140174454807",
    "author": "Nomograph Mastering",
    "date": "2023-08-05",
    "content": "People often believe they just need to find that one great artist that will propel them out of the local scene. And while it’s possible, and true in a way, what they really need to do is commit fully to the project in front of them",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1168405948646305802",
    "author": "Nomograph Mastering",
    "date": "2023-10-29",
    "content": "I would definitely advise finding your Mastering Engineer via a referral from someone (or many people) you trust rather than via a portal like Sound Better or EngineEars",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1191794318642528377",
    "author": "Chris Doms",
    "date": "2024-01-02",
    "content": "I think what’s holding me back in the music making life right now is school and my own lack of experience in the business. The time commitment in and out of the classroom between 6 classes makes it almost impossible for me to be able to adhere to anyone else’s schedules, whether that be as a freelancer or assistant. I like to think a smart trusted friend would agree but I’d also wanna know if there’s anything else they’re seeing. \n\nI wanna use my time in school to give back this year. Even though I can’t do music full time I’ve been freelancing. While I wanna scale up after school, a lot of the people I’ve worked with are coming back now because they feel they can’t go to another engineer where we’re at and \nget the same quality/experience they’re getting from me, and they can’t afford to go to bigger studios/engineers either. I’ve also had a lot of people make comments about how much they like my rooms vs other studios they’ve worked in. \n\nSo while I’m in school I wanna offer my rooms to other people who are serious about their music so they can take their stuff to a level they’re happy with and is pro sounding enough. It really bums me out when I see people in the local scene who are super good, passionate, and hardworking when it comes to creating their music met with roadblocks caused by bad rooms, poor engineering, and economics. \n\nIf anyone wants to chime in with ideas, I’m thinking of offering a free session to students at my university to come record with me/just letting friends I trust into my spaces to use while I’m in class or whatever",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1201241213878157442",
    "author": "NoahNeedleman",
    "date": "2024-01-28",
    "content": "I do think we’re most of us overly aware of our self-perceived weakness, but, there are different ways to clothe them. \n\nThere’s reps, of course, finding the proper gurus, of course, but for me, a lot of the solutions for my weaknesses are found in community. I’m not great at A but I know 3 people who are. I’m decent at B but have no interest in it, however I know 2 other people who love it *and* are great at it. \n\nSo my self-perceived weaknesses  ultimately led me to one of my actual strengths- culture & community building.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1273989531221102634",
    "author": "Josh Bowman",
    "date": "2024-08-16",
    "content": "This place has replaced almost all other audio/engineering internet content viewing for me. I learn something every week.\n\nInsights into how others do business, foster relationships, hearing about other peoples work ethic, passion, and innovation/techniques is so motivating.  And having some referees that will step in and pull things back to the “why” when we get into the plug-in/gear weeds too far is always appreciated.\n\nHugeeeee accomplishment to keep this place on the rails for this long with this many people. Thanks for creating it!!!!",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1464100459852861726",
    "author": "LAPhill",
    "date": "2026-01-22",
    "content": "With any passion that becomes a career, a certain amount of the mystique is bound to wear off once you become one of the magic makers. To use your analogy, dating a new girl feels different than a year in, vs. being married, vs. having a family. It's absolutely normal for the type of love you have for music to evolve over time and repetition.\n\nI kind of doubt that earning money from music is the root cause of your feelings. But it might be affecting how you encounter music. If it's all feeling too ordinary, then break the ordinary. Go listen to live music that's far away from anything you touch. Pick up an instrument you don't know how to play and get in a room with some friends and enjoy being bad, but exploring music like a child. \n\nThe \"quitting\" thing often feels like something often born out of rough working experiences, or perhaps just too mundane. Bills have to get paid (burgers gotta get flipped) but perhaps you can balance those gigs with things that challenge and excite you, even if they're not particularly lucrative. \n\ntl;dr I think we all go through phases of questioning if the career is worth it, if not questioning our relationship with music itself, but in my experience, almost everyone comes out the other side after a bit of a mental reset.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1074468848687906947",
    "author": "austenballard",
    "date": "2023-02-12",
    "content": "Don't sell yourself short. I've learned more, philosophically speaking, from reading and listening to your thoughts here and on the podcasts than I had otherwise in years. I'm sure I'm not the only one.\n\nI swear to god I'm not just trying to gas you up. This goes for all of you more experienced heads in here. There is good that will come of espousing high standards and upholding professionalism.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1148406981548314668",
    "author": "Slow Hand",
    "date": "2023-09-04",
    "content": "Last thing on the role of humor. I had an epiphany last year with my then-girlfriend. We'd been having a reoccurring friction in our relationship where she thought that I wasn't taking things seriously enough. Not everything, mind you, but there were certain scenarios where my humor was dismaying to her.\n\nEventually, what we discovered by accident one evening when exploring our personal values was that we both had very different understandings about the role and purpose of humor.\n\nTo me humor is a playground for creativity, trying things out, and testing ideas. It's play. To her, humor was something that she had come to know as a defense mechanism for defusing tense situations. She was very explicit about that.\n\nAs a result of these unvoiced beliefs there were moments where I was being playful and she would interpret it as me changing the subject or downplaying something. She thought I was being defensive. This difference in beliefs was hidden to both of us and it was leading us into frustration because we thought we had the same understanding of what something was.\n\nI'm rambling a bit at this point, but It's always a huge relief when you manage to uncover the unspoken assumptions that you or another person are holding.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240359846084218920",
    "author": "Slow Hand",
    "date": "2024-05-15",
    "content": "I like this sentiment. If our relationships with other people are the most important things in our lives and the work can be a means to get there, then I think that’s a wonderful alignment and way to move through the world.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1308800432956772373",
    "author": "cy (sigh)",
    "date": "2024-11-20",
    "content": "best bet is to find an artist who self mixes or a  mixing engineer that's starting out and build the relationship from there.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1312894301327327243",
    "author": "NoahNeedleman",
    "date": "2024-12-01",
    "content": "Excellent q to ruminate on. \n\nI think I’ve spent so much time in my life faking it, I have a pretty developed sense of what is knowable with time, what is not needful to know, and what is unknowable for myself. \n\nI learned way too late in life that humility is knowing who you are, and who you are not. I spent so long trying to distinguish myself, and not long enough trying to decode myself…. \n\nAll of that to say I what I don’t know so vastly outweighs what I do know, my relationship to it is very easy.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1381365348195897364",
    "author": "lystell",
    "date": "2025-06-08",
    "content": "Maybe not what you had in mind, but having done lots of cowrites in rooms with people I don’t know as well as with people I know already, have definitely made me a better listener in my private relationships.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "839141204574339102",
    "author": "joebegalla",
    "date": "2021-05-04",
    "content": "A couple of years ago, I got really into making fresh pasta. I have a reputation for making the best pasta, which honestly has helped me get more clients hahah. Back in college I threw these “pasta parties” where I would just make pound after pound of pasta and then I’d DJ while everyone ate it. I ended up working with a lot of the people I met at those parties. If your new hobby involves cooking, might unexpectedly land you more work hahah.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1022721786493816893",
    "author": "NoahNeedleman",
    "date": "2022-09-22",
    "content": "Wait. Flipping the phase and adjusting phase relationships are squares and rectangles.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058482256664088647",
    "author": "NoahNeedleman",
    "date": "2022-12-30",
    "content": "After some introspection, I think my intentions for the next year are echoes of most of yours. \n\nMost of my life has been traveling to play music. I’m retiring from full time Road dogging to MD and produce for more artists. But I’d like to take advantage of the time to go see people I love and foster my relationships outside of a work context.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1081279840671502417",
    "author": "Will Melones",
    "date": "2023-03-03",
    "content": "“Analog” switch to toggle 1dB authenticity gain. “Noise” switch to ruin your mix and sully your reputation.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1137585228811075594",
    "author": "masteredbyjack",
    "date": "2023-08-05",
    "content": "Catching up here, not sure how relevant but my best friend runs a very successful video business he built from scratch, is a mentor in a way (though he knows 0 about music).\n\nOne of his most enduring quotes to me is: “What you’re getting paid today is for your work a year ago (or x years, it can work for any duration)”\n\nEssentially, crush everything in front of you and the money/growth will come with time, it takes time to catch up. But you have to fully, and totally, commit in an industry such as this to really do it. And it probably will feel like you’re giving much more than you’re getting in the moment, but in the end it balances\n\nThen again, the age old Ruairi-ism of thinking about the ambition matters too. Mine is almost maximally high, it is how I am. Someone who wants to make a comfortable living and work on records every day would maybe make very different moves or sacrifices based on this (neither is right or wrong)",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1212875704018931823",
    "author": "LAPhill",
    "date": "2024-02-29",
    "content": "Context is everything, there is no one-size-fits-all here. The relationship you have with the artist will dictate how much leeway you have. Some might love that you swing for the fences and try wild things, and it might scare the pants off of others. But, in general, folks ere on the side of being conservative, whereas a few bold decisions might be welcomed. And if it's a spectacular miss, that's what version 2 and the undo button are for.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240774468373188619",
    "author": "Berlin",
    "date": "2024-05-16",
    "content": "Would be a nice note to pass along to the cutting engineer if you have a relationship with them.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1242185492179587073",
    "author": "Will Melones",
    "date": "2024-05-20",
    "content": "If you have a good relationship with your neighbors, you can make it happen. I know more than a few drummers in NYC studio apartments making it work. Townhouse is your castle",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266916858825801780",
    "author": "Pio",
    "date": "2024-07-27",
    "content": "One thing I’ve liked about entering into the world of music, during the last decade, has been that social media has kind of made the world… bigger for me?\n\nI love my local scene in Dublin and in Ireland. I’m proud of what we can do, what a lot of fantastic artists of all different kinds are doing from here. At the same time, I see the possibility of complacency, and how quick we are to presume that the lack of opportunities we perceive are due to how tough the industry is… rather than the other possibility. When I look on social media, the pure talent and skill on display across the world can be crippling to see, if you look at it through a kind of despair-ready lens. But I’ve found that it can actually be really powerful in a positive way too - i feel its challenged me to work to become better at my craft. To seek to perform not at a local level, but as a part of a global scene, and I feel that’s been really healthy for me.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1268958327648293007",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-08-02",
    "content": "Don’t wanna derail the convo but I always wonder what this kinda thing means when people say it.\n\nA lot of tech ppl and successful entertainers get/build these “work harder than everyone else” reputations. I know plenty of people who work absolutely insane hours, it’s not really that unique. The implication that the most successful people work the hardest feels part of a toxic culture really.\n\nNot coming after you or anyone in particular, just something I’ve been noticing/concerned about",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1336227036947025952",
    "author": "SawyerM",
    "date": "2025-02-03",
    "content": "I'm going to talk as someone who got their start in a small town in Southern Canada where there was only really a small music scene. \nWhen I got started I sought out anything anyone was doing with music. Not even with the idea that I was looking for clients but just because I wanted to ingrain myself into the local scene. Music is really tight knit and positive relationships do more than a resume ever could. \nLooking to the question of finding clients to elevate your career. It's a question I have difficulty finding an answer to how I found those types of relationships. The only thing concrete that I can think of is finding the people who match your work ethic. Find the artist who is hungry for success and is working every day on their craft. Because they are in the same spot as you, they are looking for the engineer who will elevate their career and their music. If you have spent the time honing your craft they will see that and you will have a much greater chance of creating a strong relationship and elevating each other.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1381403352235118633",
    "author": "Skyler Young",
    "date": "2025-06-08",
    "content": "If it feels right it is right. \n\nI used to think I needed the perfect plug-in chain and presets that my favorite mixer used for something to sound good. But when I tried that I was stunned that it didn’t seem right. It took me ages to realize that whatever makes the music feel better is better, no need to over intellectualize it. It doesn’t matter if x mixer used it, if it doesn’t feel right it’s not right. \n\nI had to learn to apply this to personal relationships. Sometimes relationships (romantic and non-romantic) seem perfect on paper but when you consistently feel worse after spending time with someone it doesn’t matter if you can’t intellectualize it, they are not the people you should be around anymore. If it feels good to be around someone it is good to be around them. If it doesn’t feel good them it’s not good to be around them. Simple as that - stop trying to overthink it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1461765760409141391",
    "author": "Zack Hames",
    "date": "2026-01-16",
    "content": "Much easier to build a relationship organically, go to their shows, ask them about their music, be around. Then they become comfortable around you. Most bands / musicians are very precious about their art and want someone they absolutely trust to work on it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "831268078452604928",
    "author": "cian riordan",
    "date": "2021-04-12",
    "content": "That's super fair given the circumstances of... *gestures to everything around us*. I'm lucky to be a full-time working mixer/engineer. I'm not in the stratosphere in terms of accreditation, but I'm comfortably making a healthy living, am married, have a child, and own a house. If I relied on big breaks, I'd be absolutely nowhere. 99% of my success has come from rubbing shoulders with the right people and finding opportunity that way. A night out drinking with friends leads to meeting other people who you stay in touch with. Pretty soon they'll need help with something and then off you go, that leads to the next. 75% of what I work on is smaller potatoes... most of it will never get heard, but it pays most of my salary. And the 25% of work I have that makes it through the filters has all come through connections I've made through smaller gigs. Networking is really key. And if you're a social person, it's even better as it'll help offset the time spent alone in a soundproof room, pulling your hair out over a stupid kick drum sound.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "850080251588509716",
    "author": "Zack Hames",
    "date": "2021-06-03",
    "content": "That’s rough. Sometimes offering a replacement can help. You know, hey I can’t take this any for X Y or Z, this person has help you finish this out if you want. \n\nDepending on your relationship, you could also just be brutally honest. Sometimes it’s a learning experience for them that they need.\n\nAlso what a bummer that tuning would take that long. A few hours redoing it vs months of back and forth seems like it should be obvious alternative but not every project has that luxury.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1042201006575976578",
    "author": "peterlabberton",
    "date": "2022-11-15",
    "content": "In my experience it’s very difficult to make real money from internet randos hiring you. I’ve only very recently started getting real work from my website/SoundBetter, and it took some real credits to establish, well, credibility before anyone would reach out to me. If you’re just getting started, your best best is in person hanging and networking in your scene.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058268018297286666",
    "author": "Zack Hames",
    "date": "2022-12-29",
    "content": "I talked about this the other day but my ad work greatly increased my quality in my record making sonically and In regards to professionalism",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1074462192524591175",
    "author": "austenballard",
    "date": "2023-02-12",
    "content": "That's literally the best anecdote about professionalism I've ever read. Shout out @BatMeckley",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1094375969613164567",
    "author": "LAPhill",
    "date": "2023-04-08",
    "content": "Man, that's a beautiful sentiment. Reminds me of when people immigrate here and study to become citizens. They have a much deeper understanding of this place, and a different relationship with it, than many people born here.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1097625193960177717",
    "author": "Nomograph Mastering",
    "date": "2023-04-17",
    "content": "Agree, onstage we pretty much paid for a show and within reason deserve professionalism",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120382216162254918",
    "author": "shaunobi",
    "date": "2023-06-19",
    "content": "What about subbing in \"professionalism\" for \"day job\"? I'm a professional, and I take weekends off, because IME that's what long-lived professionals do.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1158500112922857562",
    "author": "Nomograph Mastering",
    "date": "2023-10-02",
    "content": "And referrals come from being good and trusted and chill",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1192567261098152066",
    "author": "BatMeckley",
    "date": "2024-01-04",
    "content": "That’s the trick. Our industry has really shown time and time again that for truly exceptional artists, every one is willing to have a short memory and look the other way if there’s great art/great money to be made (we’ve all seen the Rihanna / Chris Brown pictures, right?). \n\nAt the same time, reputations exist, and everyone is doing the math of “is the juice worth the squeeze”? If a band or an artist has been middling for ten years and worked with solid people, I’m going to be really sure that I know what the bottleneck to success is for them and that I have a set of skills the other people didn’t to be able to fix them.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1313008571469795439",
    "author": "Zach Hughes",
    "date": "2024-12-01",
    "content": "My relationship with things I do not understand is usually conditional on whether those things have antagonized me, wowed me, or are necessary to contend with for my work. One or all are enough to fuel my curiosity and engage the pursuit!\n\nI’m stealing this line from Arcane season 2: “there is no joy in perfection only the end of pursuit”. That stuck with me. From such a great moment in the show. 🤐\n\nAt present if I have chosen pursuit I then find the people, organizations, and institutions that have been honored most for their contributions to the thing I don’t understand. Not because they “know” and I don’t but because they are further along in the pursuit. I follow the breadcrumbs they have left, meet other fellow travelers, and maybe catch up enough to some to say hi. 👋 \n\nI am a willing and / or disgruntled object pushed into motion by that which I don’t understand and I am also intentionally searching for what is precious to me.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1356703594371354705",
    "author": "LAPhill",
    "date": "2025-04-01",
    "content": "I work with a lot of session musicians, many of them the best of the best, and not once has their rate not had some wiggle room. Musicians want to play, and want to build relationships, so I’d be surprised if even these guys’ rates are non negotiable.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1387491506822316083",
    "author": "masteredbyjack",
    "date": "2025-06-25",
    "content": "Honestly? I'd tell the producer that the artist wants it that way -- send him the updated master so he can hear (off CC) and tell him what's up. Not his song. We work for the artists.\n\nWould sending producer the new master cause him to get into it with the artist? Feels like something they should resolve, not you (for the good of their relationship and the project).\n\nDo it all nicely of course (saying that for others reading) but you know how to do that",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1471557705885028530",
    "author": "oaklandmatt",
    "date": "2026-02-12",
    "content": "Outside of one's own subjective experience, I don't believe in this sort of truth as you describe. Not being able to hear something any other way is beautiful, but completely separate from truth. Unless you're reappropriating the word \"truth\" to mean \"my own personal relationship with the supernatural,\" in which case we're having a theological discussion.\n\nArt is uniquely beautiful because it combines changing cultural and technological factors and deep human truths. There is no \"the way it's supposed to be\" in art. It's subjective and ineffable.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1471572529821908993",
    "author": "spectrummasters",
    "date": "2026-02-12",
    "content": "As a concept , I think “truth “ is a tricky thing to pin down . It can’t really exist without its relationship to time . Truth changes with time . Imho. \n\nThat said , I fully believe music contains archetypes , sacred geometries and of course waves themselves ,…..that are essentially the cosmos breathing and manifesting . That maths , physics and music all relate to each other , that natures forms , in patterns like the golden ratio to be found in a fern , or an excellent arrangement of a song , that sound and light energy all share phenomena ….these things , the patterns , the scales , the ratios and then the ancestral mind and genetic memory , the ancient truths , instincts , symbolic folklore and intuitions ….as Blake called it …..our imaginations being the direct experience of nature itself ….\n\nWhen someone taps into that and writes something that speaks from and aligns those realms …..\n\nWhatever the message is , that’s what hits ….its an undeniable connection that we share as humans and brought into communion by the music . \nFor good and bad \n\nThat shout example s a good one Ruairi\n\nAnd also everybody wants to rule the world . \n\nThe arpeggio signals something universal as much as the lyrics \n\nIt’s a timeless voice that music unlocks inside us all . \n\nThat’s my take on “truth “ in a song . And like Cian said , it gives me a profound feeling. It’s so exciting and thank goodness for music . It’s such a magic gift",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "808488289786396682",
    "author": "Slow Hand",
    "date": "2021-02-08",
    "content": "Well, it's hard to say what's best without a more holistic understanding of who you are and your circumstances, so I’m reluctant to offer any hard suggestions. Making a career in the music industry is what engineers would call a \"wicked\" problem. It's not something that has a repeatable solution, and what works for someone rarely works the same way for the next person.\n\nThat said, I see that you’re from Boston. I lived there for seven years, and the talent pool in that city is tremendous. I think if you found yourself back home in Boston it would be a worthwhile investment to integrate yourself into the scene of young musicians that are centered around the schools in the Back Bay like Berklee, NEC, and Boston Conservatory. There are some immensely talented, diverse, and creative people from all around the world based at those institutions and they all exist within 8 blocks of each other. It’s rare to have such a concentration of driven musicians all mingling amongst each other. This is a massive resource that you can tap into. They're *all* trying to make something great and explore what's possible.\n\nIt's a unique opportunity to discover collaborators, build relationships, earn experience in your craft, and build strong connections for the future as you grow alongside these people. On top of that, Boston has numerous recording studios where you can intern and assist. There’s a lot of experience to be gained working in a studio that simply won’t be taught to you in a recording program. Supplement that practical experience with hard work, and some book learning and you can do very well for yourself.\n\nThere’s more that I’m not touching-on, but I think if you ended up back in Boston it not be as much as a trade-off as you may think.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "810230169373245461",
    "author": "oaklandmatt",
    "date": "2021-02-13",
    "content": "agree w @1ggy. it's probably a good idea to make it to a music hub at some point, but w covid and things locked down, LA and London both lack the usual networking possibilities. i'd stay put for now, save money or upgrade your system if it will really level you up. you def don't want to \"wait\" in the sense of not doing anything. of course you should work and get better and do all you can there, but making a big move to a big city is not nearly going to be as fruitful as it was pre covid. hopefully that changes soon!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "820086962672631838",
    "author": "peterlabberton",
    "date": "2021-03-12",
    "content": "In my experience, if I’m mixing and not also producing, there’s almost always (maybe just always always?) someone who can act as a tie breaker. The producer, lead singer/songwriter, guitar dude who is clearly leading the charge creatively, a manager, etc. etc. who you can turn to in order to give definitive direction... maybe during covid this is more difficult as I feel that often can become clear organically in the room.\n\nIf it’s truly a situation where there are contradictory/unproductive notes coming in, maybe either a) tell them they need to decide amongst themselves and then give you a clear list of notes, or b) take the lead yourself and really push for what you feel serves the song best/explain why the sax can’t be 10x louder than the lead vocal? Which option is best I’d say depends on your relationship with them, how much of a lead you want to take creatively, how confident you are in making the right choices for this song, etc. etc.\n\nAt least that’s what I’d do. 🤷🏻‍♂️ @cian riordan might have better advise for these situations!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "895038152941654038",
    "author": "alecdibell2",
    "date": "2021-10-05",
    "content": "But at the same time, none of the engineers I know are succesful because of social media. They all worked in studios 12 hours a day coming up, met a ton of people and made quality work. Their names would spread from their credits and referrals. I know we’re in a different age now, but not so sure how influential instagram would be in getting me more bookings. Other than being credited on artists’ posts if I work on their music",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060701615172100146",
    "author": "Nomograph Mastering",
    "date": "2023-01-05",
    "content": "My relationship with Mastering, Acoustics and being out in the world is all changing right now. It remains to be seen where it all lands, for now I'm having fun here and feel like I can help a bit",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067616622724001843",
    "author": "Will Melones",
    "date": "2023-01-24",
    "content": "I used to work for another store in the guitar center corporation, and GC’s turnover was worse than McDonalds’. This was when GC was doing relatively well—only the second bankruptcy or so. Sales reps would start and make great commissions for the first 3 months and then lose their enthusiasm, and commission was ALL they were earning. Sick discount, no paycheck. So I understand the struggle, and it even caused me to appreciate Sweetwater’s dedication to customer relationships in the beginning. Hell, the store I worked for kept a binder of “lead sheets”. Oh, a customer mentioned interest in lessons, or renting a violin? Better take down their info and call them every week when business gets slow.\n\nBut like I also don’t want a plumber texting me back to follow up. It just feels lazy and unprofessional, and unlike email or a phone call it strips you of your ability to control the pace of the interaction.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1068239743197913108",
    "author": "spectrummasters",
    "date": "2023-01-26",
    "content": "I get more and more disciplined about saving different versions of the mix as I go along . I tend to push along like roadrunner in the old cartoons going off the cliff . I’m all good until I realise I’m not . I think for me it’s phase relationships I have to be careful of . I think this is where the life : the rub can be lost . I’ve been reaching for shelves before high passes in the low end for this reason . I’m going to try to stop going for sonics alone for a month or two consequent to this convo",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078670728376889434",
    "author": "ALXCPH",
    "date": "2023-02-24",
    "content": "Sometimes a reminder to actually remember and believe what they are singing can help bring a more convincing performance. But this stuff is so case by case, and yes some stuff is def reusable, but when working with an artist for a while you end up building a relationship and a unique language that gets your where you are going. That process just gets easier with experience.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1088890750177128538",
    "author": "Slow Hand",
    "date": "2023-03-24",
    "content": "It’s nice seeing Jaron repped here. He’s seemingly had his head on straight about our relationship with tech for a good long time now.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1128512594966229044",
    "author": "cian riordan",
    "date": "2023-07-11",
    "content": "In the same way I see childhood socialization, romantic relationships, friendships -- even structured education  -- I believe becoming a parent as a logical step in human development. It's the only way to unlock the next level of emotional development as a human.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1132792605827145760",
    "author": "Nomograph Mastering",
    "date": "2023-07-23",
    "content": "The “achievements” will fall away over time and you’ll hopefully be left with moments and memories and relationships you treasure",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1149434055809581058",
    "author": "Josh",
    "date": "2023-09-07",
    "content": "Might be a little soul crushing but he has a bigger advantage than all of us rn because of his age so it wouldn’t hurt to be a little blunt. Might get his butt in gear. But I’d basically frame it as it can’t be a career and won’t be a career until you build d the numbers. Being an artist is being a business owner. Except it’s more like owning a business that invests its money in slot machines. \n\nHis first step is gonna be writing 100 songs. Because they’re all gonna be not that great. I think it’s important to instill the idea of not being precious with your art early on because I think we all spent way too long on that one song when we were 18 and it was awful anyway. \n\nThen he needs to connect with other people with the same goals as him. Find or build a community. Play shows as often as possible and see how people react to your music. Save up the little bit of money for studio time. \n\nAfter doing that for like a year or two start recording and keep networking.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1154088932217192578",
    "author": "Nomograph Mastering",
    "date": "2023-09-20",
    "content": "That’s great to be clear on, there was no wrong answer. Then I guess the work of building your relationships and working partnerships continues. Sometimes doing it all yourself is the only way to get it done, but sometimes you might be able to get a budget for a master or a mix from someone who can level up the project",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165366662015500293",
    "author": "Nomograph Mastering",
    "date": "2023-10-21",
    "content": "Clear break point in the above is people who are busy and making a good living giving back, as opposed to someone for whom the YouTube channel is their job",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1201227200343588935",
    "author": "Josh",
    "date": "2024-01-28",
    "content": "It said if you and your significant other are going through a tough time farts can heal your relationship.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1213702521516982343",
    "author": "Deleted User",
    "date": "2024-03-02",
    "content": "I used to think that I knew what was wrong and just didn’t know how to fix it… But if I really knew what was wrong, I would have been able to fix it. Which made me realize if I don’t know how it’s wrong and why, I won’t be able to figure out what are things I could do to fix it. Which means I don’t know what is wrong with it. Anyone can tell when something’s not right, but knowing what exactly isn’t right comes with experience and practice. \n\nI think there is a difference between “I think there’s something wrong with X and I can’t really point out what it is. Could you have a listen and tell me what that might be?” or “I haven’t mixed it yet so if you can just give me feedback on the arrangement and vocal production that would be greatly appreciated” versus “it’s not mixed yet… so it’s going to sound like shit” \n\nOne of my mentors from the past said “people have no ability to imagine what it may sound like later when you fix XYZ and rerecord XYZ, so either show it to them after you’ve done what you were going to do or just don’t say nothing. it makes their first experience of listening whatever you’re presenting way worse and lame-r”",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1273804936412532860",
    "author": "Josh",
    "date": "2024-08-15",
    "content": "I could go on and on about all of the conversations that changed my perspective regarding business, relationships, work, art, even film. However, this discord allowed me to move to a completely different state and have a handful of people welcome me with open arms.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1281332682277654592",
    "author": "Berlin",
    "date": "2024-09-05",
    "content": "As mastering engineers, we get to frequently and rapidly witness the full spectrum of \"professionalism\" and at times I am left in awe in the lack communication and or even business bedside manner out here. I learn a new lesson on what not do nearly every day.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1352308596972585120",
    "author": "bobby k",
    "date": "2025-03-20",
    "content": "in my relationship there's always a push and pull with this, but now that i'm essentially our sole income, the case i always make when it's money on the line is \"i'm no longer doing this for me/my career/etc. i'm doing this for us and our grocery bills/mortgage/future blah blah blah\"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1362675733096431628",
    "author": "spectrummasters",
    "date": "2025-04-17",
    "content": "interesting...and in the spirit of good debate\n\ni really like the energy and the message ... i defo f with it....and think its helpful to think this way. Imho this vid would serve as a handy bedfellow to ruairis (fantastically eloquent) \"moving to LA piece\".  \nand yetttt, otoh for me....the need for people to consider grabbing attention and making a world for people to discover ....which he puts at 60% of the mission, is questionable. Questionable with regards to how we currently define art vs/and success.\nI think we're maybe in a chapter where our phone lenses offer us a portal to a global connection on the positive side, yet also a massive distraction from living life in the first person ....if my approach when im thinking about art is that once ive finished the creation, i now have to give the majority of my effort to making it grab peoples' attention.....i feel like that risks changing the intent.\nThis intent of course would be shaped by how one defines art vs/and success. \nIf the success of art is defined by its popularity (drake) i think this fellow's advice must be the MO....if the success is defined by a different metric , im not so sure its the right move to place so much weight on one's relationship with the external (the phone lens, the social media) and id weight it more on one's relationship with oneself , in spite of the world.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1381848540346581012",
    "author": "SawyerM",
    "date": "2025-06-09",
    "content": "Something that I have found helpful is assuming that someone is 100% correct. With engineering it has proved to be an incredible mindset to come into collaborations with. Outside of engineering it has led me to try and figure out the why of people’s viewpoints and it has noticeably strengthened my relationships.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1400113849428082718",
    "author": "Circul & Eas",
    "date": "2025-07-30",
    "content": "It does seem like this could be a real idea: tinder for artist  collab relationships. 🤔",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "832727159449190425",
    "author": "peterlabberton",
    "date": "2021-04-16",
    "content": "This is a totally unexamined thinking out loud thought, but: I feel like there’s often an inverse relationship between how fancy something looks and how good that studio sounds.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1027290817192280105",
    "author": "Rollmottle",
    "date": "2022-10-05",
    "content": "I would only let a known quantity into my space, not randos off the street. They have to earn that status by building an ongoing relationship first. It's all fuzzy of course, but somebody who I have no direct or indirect connection with wouldn't get the pass.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1037494386717634681",
    "author": "NoahNeedleman",
    "date": "2022-11-02",
    "content": "Great question. It’s different for every artist and often different every song. References for me are macro rather than micro- like kick/snr/vox relationships or overall dynamics etc. \nI went to Kacey Musgraves Slow Burn for a really long time. Shawn Everett is a fav.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1060297752657014905",
    "author": "Slow Hand",
    "date": "2023-01-04",
    "content": "I continually bring them up, but I think Autechre are miles ahead of everyone when it comes to this mode of composition. They're renowned for building their own Max/MSP patches that generate complex rhythm and timbre.\n\nThey're not simply building a patch and letting it run, nor are they sequencing every single note. They're controlling the parameters at a meta level and are steering their patches. They jam and improvise and capture then they edit it into something coherent if necessary.\n\nBut not always. Sometimes they get into the weeds and give it the expert painter's touch too. They've got a collaborative relationship with their tools.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069685019733409912",
    "author": "popaganda.",
    "date": "2023-01-30",
    "content": "Relationships, people, culture are what matters",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1093439410390970378",
    "author": "Ross Fortune",
    "date": "2023-04-06",
    "content": "Are they regular go-to verbs? Much modulation happening?\n\nIf the character suits and there aren’t existing IRs, could you make your own and use them for less important/forward elements (it’s easy)? \n\nObvs up to you to compare tradeoffs etc, but working under my old mentor, we abandoned his Rev7 in favour of Altiverb’s Rev7 4 second hall IR (that’s all we ever used). Saved a whole lotta time stemming.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124766867337257130",
    "author": "Ross Fortune",
    "date": "2023-07-01",
    "content": "In most instances, I feel I am fairly remunerated for my work at this stage. On the way to this point though, I did the grind and experienced the impact of that lifestyle on my mental and physical health, and on my personal life and relationships.\n\nI'd rather people coming up now wouldn't have to endure the shitness that can abound, and to that end I sourced thoughts from a bunch of engineers, assistants, producers, mixers, and studios in the UK at the end of last year.\n\nThe list below was assembled from those conversations, and details some basic working conditions for music technicians working on a day rate basis (runners, assistants, tape/PT ops, engineers - not mixers, MEs, producers, or songwriters) that would bring us more in line with what have long been established and taken for granted by clients and employers in the comparable industries of theatre and film.\n\nI'm not talking about bringing the industry to its knees here - just about establishing basic working conditions to safeguard the mental and physical health of our friends and colleagues.\n\nI recognise that there are conditions specific to our industry and the nature of our work that would make some of these points less than straightforward to establish, so I'd love to hear everyone's thoughts on the below - whether they're reasonable, actionable, etc.\n\nPick some holes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1129514356493779075",
    "author": "LAPhill",
    "date": "2023-07-14",
    "content": "Last point - this is a relationship-driven industry. If you have a long-standing relationship with a client and you really need to push something, you can talk honestly about it and they'll likely understand. But no one wants to feel like the less important artist.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1145716907048189953",
    "author": "cy (sigh)",
    "date": "2023-08-28",
    "content": "for what it's worth.  talent I think is often just how things are viewed from the outside. \n\nby the time I was in my last year of hs I was ort of the national volleyball team back home. \nI'm way shorter than the av player and didn't get picked for any  teams my first year (I was ass tbh) the following year and pretty much every year til my last I was defensive mvp in the state. \n\nyears later when I went back to Haiti post Uni. I joined one of my old clubs and the coach literally told eveyone they shouldn't take me as an example because my practice norms were insane and a few ppl in hs got hurt trying to train as much as I did. \n\nI did it to compensate for what I didn't have naturally but I was very much pushing my limits and setting new ones. most ppl  just said it was talent. the people who trained next to me would step in and say otherwise back then. \n\nalso been lucky enough to be raised ina very creatively focused family.  my dad is and archi and a painter (using just him cause of proximity but there are others). I've heard countless times how ppl say he's talented, and I get it. his work is insanely good. but my dad is the most disciplined person when it comes to practice /work ethic that I've seen in my life. \n\nonce he decides to practice something he is CONSTANT. man said he wanted to learn tai chi and practiced 2.5 years, every day. only exceptions were emergencies or health reasons. \n\nit also harkens back to how most ppl tend to compliment results not the work and that has a direct effect on how ppl perceive the relationship between the two. \nhuberman ep 133 goes deep into the why of this.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1158507268787155086",
    "author": "Rollmottle",
    "date": "2023-10-02",
    "content": "I think at my level, showing more volume of work is better than showing less.  At a certain point, it stops being useful or even manageable to keep track of, let alone consume as somebody who might be coming in cold off the street to hire me. Since this is a business that heavily relies on referrals and prior work, a credit list is really most useful for people coming in totally cold or maybe once or twice removed. So yeah, I think I agree with the idea that a comprehensive credit list matters less than we think it does. Would rather know you're not a dick and are philosophically aligned.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1208159529100116050",
    "author": "spectrummasters",
    "date": "2024-02-16",
    "content": "It’s so weird  to me how far towards removing ourselves from the process we are tending now, in manufacturing, in creative processes and in the experience of things . I think of ruairi and dales discussion about how all of this is a body in motion , if you stop your work....what of value are you left with ? .....the relationship s you built along the way. There’s something lost in palming off all these processes to an algorithm and not a human imho",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1212546594906578945",
    "author": "NoahNeedleman",
    "date": "2024-02-28",
    "content": "Do you think we all have to go through that journey? Maybe if we’re lucky we get through it quicker? Or do you think with the right mentorship we coulda skipped it altogether?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1232319889444966491",
    "author": "Charlie Deane \"Hypn0.iRL\"",
    "date": "2024-04-23",
    "content": "The smallest man in the world like cmon, it was a 3 month relationship. How scorn can you really be? I call bullshit.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1239636605028007997",
    "author": "Edward Rivera",
    "date": "2024-05-13",
    "content": "Idk. I know I’m surrounded by people above my pay grade, but some things believe it or not, are more important than music and I’d rather not micromanage peoples relationships for that _magic take, man_. Being hands off is wildly underrated",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1243615502794752100",
    "author": "Slow Hand",
    "date": "2024-05-24",
    "content": "So the producer of *Abstract* is (was?) the editor of *Wired* magazine and he and David Chang were doing a SXSW talk on their upcoming joint venture.\n\nI'd been intrigued by a 2016 feature that David published in *Wired* called *David Chang's Unified Theory of Deliciousness*. Silly name, but a stimulating read.\n\nIn the article David describes his epiphany about how popular flavor profiles in recipes re-occur across cultural boundaries. How a Chinese spicy pork sausage and rice cake has the same fundamental flavor profile as an Italian ceci e pepe and they share underlying structures that are expressed differently in their respective cultural incarnations. In math this would be called an isomorphism.\n\nWell this immediately rang to true to me because I'd observed the same thing in music. I thought about this article for a year. Finally I saw that they were giving a talk in a hotel showroom with 500 people in attendance and made it a point to attend.\n\nWhen the open mic was passed around I asked my prepared question, expressing my admiration for their insight and how it was applicable to other domains beyond food. I asked them if they'd had any additional insights on this phenomena since publishing the article.\n\nThey both looked to each other, didn't say a word, and then proceeded to ask for the next question 😕.\n\nTo this day I have no idea what happened.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1264284479699157003",
    "author": "Slow Hand",
    "date": "2024-07-20",
    "content": "I did enjoy it! At this point I don’t recall the finer points of the doc, so it sounds like I’m due for a revisit.\n\nI can’t comment on his relationship with worship music, but there’s a depth to the feel of his records that is rare and I appreciate that he’s not rushing the process on any of it. Every element of his records feel deeply aligned and purposeful.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1272205581796638812",
    "author": "Edward Rivera",
    "date": "2024-08-11",
    "content": "Really tough record to beat. 414s on the drum room ! Two early mentors of mine ended up mixing that Bush record I assume you’re talking about. Would have been interesting to hear a Steve cut of the album",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1287638464199917569",
    "author": "Rob Domos",
    "date": "2024-09-22",
    "content": "And the non judgmental relationship to quality",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1294402933324120084",
    "author": "spectrummasters",
    "date": "2024-10-11",
    "content": "It begs the question imho . Why even bother trying to be good at something if your approach is to disrespect the  greats in that thing . Say you get the chops , you get the gigs the accolades , the money . And you’re a complete tosser to people along the way . That’s just an L . Ruairi and dales JTFR comes back to me all the time . The pay off for all this is the relationships . I couldn’t agree more",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1295443828760772659",
    "author": "Rollmottle",
    "date": "2024-10-14",
    "content": "Going to rep Tailscale here.\n\nBeen investing in some infrastructure and future planning over here. The problem I was trying to solve was making my working drive available to me for when I’m away from my studio so I can continue to be responsive to clients at all times. \n\nTailscale allows you to create a secure, private VPN without having to have a networking PHD and compromising your network. Basically install the client on a device, 2-factor auth into the client and any other client you have installed on any device signed in with those same credentials are available to you as if you’re on the same local network, even if you’re on another network anywhere else in the world. It’s an actual game changer.\n\nFor a variety of reasons including keeping my mastering rig lean and clean and because the rig is not always on because I don’t want to run my HVAC 24/7, I sync a clone of my working drive from my mastering rig to a drive attached to an always-on Mac in my home network that has the Tailscale client authenticated. I’ve got screen share enabled on that Mac and now from any other device, I can sign into it and grab whatever I need from that clone drive. You can install the client on virtually any device including NAS’s and mobile phones so it opens up whole new avenues in how to think about availability of your data, traveling, 3rd party cloud vs. rolling your own, etc. Tons of possibilities. Really big fan. Love the future.\n\nhttps://tailscale.com/",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1301692206406701177",
    "author": "Will Pragnell",
    "date": "2024-10-31",
    "content": "i am deeply committed to this idea with my own writing / composition (thanks to a mentor really pushing me in that direction) and it has allowed me to find whole new directions and modes of expression that i would never have discovered otherwise. The idea that your opinion about something in the moment you’re working on it can’t always be trusted and doesn’t necessarily represent the true value of the thing doesn’t get talked about enough imho",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1312867463574192181",
    "author": "Will Pragnell",
    "date": "2024-12-01",
    "content": "How do you balance the need to understand something with curiosity or desire to understand something? Is this a friction for you? I often have to reign in my natural curiosity because I know that deeper understanding of <thing> isn't necessarily useful in the moment and likely won't help me achieve my goals any faster. Deeper understanding can often be what an old mentor of mine used to call a \"seductive distraction\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1318011172812881920",
    "author": "Rukie",
    "date": "2024-12-15",
    "content": "I have a weird relationship with the word Satisfaction. Why do I need to not be satisfied to evolve? What are some values of imperfection or point of failure in the space that I am currently in, that may be lost once I evolve? Can I cherish that? And how? \n\nIs it a curiosity and enthusiasm perhaps? Not dissatisfaction?\n\nAnother one is,\nis it a Dove or Mirage of Oasis that we could actually drink out of?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1329471680837451856",
    "author": "cy (sigh)",
    "date": "2025-01-16",
    "content": "1st thing I'd recommend is listening to the Tape Notes podcast. they interview the artists and producers to break down the processes and stories behind the tracks. \n\nI got quite a bit of confidence in that respect from listening to those . especially ppl  that come back multiple times. I don't even necessarily listen to everyone's music, I'm often more intwrested in their personal approaches - especially since lost are folk who we'd consider \"established\"  and what I found to be true for most of them is they split into 2 main camps with most of us dancing between them. \n\na) have 0 clue wtf they're going for a lot of the time. kind of going with the flow of whatever is happening /they're feeling in the moment. very similarly to people starting out or me. the approach can vary wildly and a whole concept can be born of something seemingly unimportant at any given moment. \n\nb) there's an outline that comes to mind early and might give some direction. whether that's thematically or sonically. how tightly they stick to this can vary a lot depending on the artist. \n\nI think there are many factors that come into play - how good and ready the team they have is might be one of the most important imo. that's both for the creative side and admin side. \n\nas far answering  your questions as a producer, it depends. \nsome artist I work with will literally dream up the whole production and I'm kind of facilitating and bringing it into the real world. others will come with loose ideas and others will show up with absolutely nothing and go off the feeling in the moment. some are more involved than others in the production\n\nyour relationship with them is probably the biggest factor in knowing how far you can push their creatively bounderies. \nsame artist that dreams up their production usually gives me free range to try whatever I want when the session is over and I've overhauled whole songs.  recently a post-punk ish artist picked up a video game ost /jazz fusion prod I was sketching",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1329474154860253358",
    "author": "markmaclure",
    "date": "2025-01-16",
    "content": "And yes the actual answer to these questions is of course “it depends”\n\nI would say my main strength as a producer is inspiring artists and and executing on their visions. I’m good at being  a chameleon. Lately though, with some of my more close clients I’ve been pushing back a little more with some good results. I agree it needs to be the right relationship. The more familiar and comfortable the artist the more I can challenge them in a good way",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1336228593310765100",
    "author": "franc.castillejos",
    "date": "2025-02-03",
    "content": "I agree—positive relationships and work ethic are everything. I’ve found that a lot of the best connections happen organically when you’re genuinely invested in the scene, not just looking for clients. The artists who are serious about their craft naturally gravitate toward people who share that mindset. Thanks so much, Sawyer! Lots of good things to think about !",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1387492659362271422",
    "author": "Edsel Holden",
    "date": "2025-06-25",
    "content": "That is tough. I have been on the master-er side of this a few times in similar ways and it always makes me feel so bad for the artist... they want what they want. I often feel the producers ego is ugly in these instances, but it is difficult, since often the work comes from the producer relationship No easy ways out as I see it. Cosign @masteredbyjack . I always feel like \"dude it's not your song, start your artist project if you want!\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "808901340406218832",
    "author": "Seanhmusic",
    "date": "2021-02-09",
    "content": "#2 @1ggy my personal recommendation is to work with music libraries. They're already connected to the music supervisors. They already have the relationship in place to get your songs placed and make you some money.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "808901474113028136",
    "author": "Seanhmusic",
    "date": "2021-02-09",
    "content": "Trying to cultivate those relationships is a full time job. In my opinion, we're better off writing and producing music rather than running after Music Supervisors.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "809790475061821516",
    "author": "Eric Martin",
    "date": "2021-02-12",
    "content": "The in-person seminar’s I feel like are what’s best about the service, I know a few people that have done then and the relationship building is where it’s at. I never did an in-person seminar, someday maybe.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "825806561314078750",
    "author": "Slow Hand",
    "date": "2021-03-28",
    "content": "For some people they will feel strange asking for what feels like a lot of money, but it really does help. I had a shy relationship with money for a long time and it only hindered me. You have to be able to explain to yourself and to others why it has to cost so much. You're a business owner and you have to account for A) overhead (studio, gear, business expenses) B) a liveable wage to earn C) you need money to make enough profit to put some in the bank for long-term goals and D) You are providing a service that doesn't always have a clear-cut point of completion. It will take as long as it needs to and sometimes your clients will come back weeks or months later and ask for something more. You need to budget for all of that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "827261772598738955",
    "author": "Dodgy",
    "date": "2021-04-01",
    "content": "I will admit I was jumping to copy him cause I finally found someone who really knows what they're doing llol  I'm starving for mentorship",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "829363002682769430",
    "author": "Zakhiggins",
    "date": "2021-04-07",
    "content": "On the topic of finding mix/mastering engineers, how do you guys go about finding one and building a relationship/sound with one?\nI consider myself mostly a producer/musician by default but I find myself mixing and mastering 90% of the stuff I produce, mostly because I haven't found a mixer yet that I like who I can actually afford.\nOf course there are some unbelievable mixers out there but sometimes I'm just not sure it's worth the investment vs what I can do myself for free.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "908157620987240579",
    "author": "oaklandmatt",
    "date": "2021-11-10",
    "content": "you're all good! we're all figuring it out together as we go ❤️\n\ni think the main goal is to help foster relationships and knowledge, and from there people will have lots of opportunity to learn and get feedback from people they know and trust, rather than just anonymous internet people",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "988508464374497332",
    "author": "Jodonny",
    "date": "2022-06-20",
    "content": "Something I’ve been thinking about lately: any wisdom on turning down production work while maintaining the relationship/not turning off the artist by making them feel like you don’t like their work?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1009192653390352474",
    "author": "Rollmottle",
    "date": "2022-08-16",
    "content": "and if you're curious, this is the current recommendation for state of the art in gigabit wireless mesh networking without costing $1000+. https://www.amazon.com/ASUS-Whole-Home-Tri-Band-ET8-Coverage/dp/B083Q45V1V/ref=sr_1_7?crid=3UBEU04480JRU&keywords=asus%2Brouter%2B6e&qid=1660680881&sprefix=asus%2Brouter%2B6%2Caps%2C185&sr=8-7&th=1",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1016103544337735793",
    "author": "ehutton21",
    "date": "2022-09-04",
    "content": "I think it’s important to remember the dollar today>dollar tomorrow point is true in the context of a choice between two deals/options that are on the table (but even then, you have to do the math to make sure! Just because you have a deal with $1500 now versus $4000 in a year doesn’t mean that you should take $1500 now, unless you need that kind of capital). To apply that logic to situations beyond the time value of money isn’t the whole picture: that law of economics only compares value, it doesn’t tell us that concentrating labor for short term gains yields the best possible business model. By that logic, there is an argument that everyone’s best business decision is to forego longterm relationship building, knowledge acquisition (which is like R&D for producers), and strictly focus on maximizing immediate sales (which could look like everyone hopping on beatstars, fiverr, and enginears) which would diminish resources like this very discord, and probably a lot of reputations too!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1022698927306322041",
    "author": "Will Melones",
    "date": "2022-09-22",
    "content": "I’m sure someone will prove me stupid. But I don’t see the relationship",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033154981831917668",
    "author": "ALXCPH",
    "date": "2022-10-21",
    "content": "They are easy to hate cuz they pull a lot of shit that ain’t right. But they are also the reason we can be here, talking from one end of the globe to the other and learn and make new friendships. So in a sense they are also kinda awesome. I would put “it’s complicated” in my relationship status with the tech bros on Facebook",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1042199447498674226",
    "author": "ALXCPH",
    "date": "2022-11-15",
    "content": "Having random people in your House that you dont know is always a Security risk. Not just hiphop. But the Music business has a lot of sketchy people. Only people o invite over are people i have long term relationships with and know very well 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1042202304138465414",
    "author": "Deleted User",
    "date": "2022-11-15",
    "content": "the thing about hiphop is you don’t get whole day booked most of the time. unless you can manage to have it booked all the time, or build a relationship where someone (producer) delegate sessions to you it’s a difficult business model",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1042484645813551114",
    "author": "Josh",
    "date": "2022-11-16",
    "content": "Especially now that I’m in a city with way more opportunity. Doing that in pittsburgh just felt like I was wasting my time. Considering getting on staff as an engineer just to expedite the networking and get back into the studio more often.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1044606787342573588",
    "author": "hyanrarvey",
    "date": "2022-11-22",
    "content": "Morbid topic: dude i swear the worst fucking thing about networking and meeting a bunch of people and getting to know artists is watching them all die",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058679446023962704",
    "author": "jonmatteson",
    "date": "2022-12-31",
    "content": "Congrats man! I got off the road in 2020 to pursue writing and producing and have been luckily been able to pay my bills doing MD work the past few years. It was such an improvement for my health, marriage, and relationship with music so I hope it is all of those things for you!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060488291708846080",
    "author": "spectrummasters",
    "date": "2023-01-05",
    "content": "Yes well said, having watched the vid posted in here last night, I’ve now got a flood of YT vids in my timeline about ChatBGT. I watched one late last night where Bret Weinstein was saying his concern is that currently, the technology is very impressive ...being based on likely outcomes derived from enormous probability calcs....but equally theres nothing intrinsic to the AI to stop it from being completely wrong (similarly to your point @Slow Hand , it cannot interpret its own findings(......so Weinstein was suggesting this is concerning technology because undoubtedly people will use these techs (behind close doors) to offer so called expert opinions publically, which to non experts may appear very impressive (he drew an analogy to the dissemination of inaccurate “science” during the pandemic ).....and so we increasingly become reliant on information/data that might be utterly flawed....but is beyond most of our expertise to spot it....he then went on to say his biggest concern is that we don’t understand human conciousness well enough yet to know that we haven’t just built a technology that is now in the process of developing its own conciousness (as infants we have no understanding of the relationships between objects....and language, then we develop sounds, attach them to words, attach words to our perception ,develop language...and begin to think and reflect etc etc )....he felt we might already now have created that process in AI.....i could see his concerns....at what point does Skynet become self-aware and go online? I reckon i can destroy robots with the way my 808s hit tho, I’m up for it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1061526614921461810",
    "author": "spectrummasters",
    "date": "2023-01-07",
    "content": "I understand . I’m forever discussing with a couple of my oldest friends who are also musicians , how grateful I am for my relationship with music . It has brought into my life every major relationship and places of pilgrimage / travel and keeps me sane and inspired in what seems like a pretty uncouth world at times out there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067882641644322846",
    "author": "Zack Hames",
    "date": "2023-01-25",
    "content": "Honestly, I take back what i said. You'll just have to play the long game. I feel like you guys are already on a path and have a reputation.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067886008563146852",
    "author": "hyanrarvey",
    "date": "2023-01-25",
    "content": "Word of mouth has always been my favorite way to market, its based on reputation and is discreet",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1074469016824991865",
    "author": "austenballard",
    "date": "2023-02-12",
    "content": "We **need** your voices espousing high standards and upholding professionalism.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1075782547612651560",
    "author": "hyanrarvey",
    "date": "2023-02-16",
    "content": "My whole family has been wiped out from cancer or damn near, when my dad got it due to the complexity of our relationship i just stopped caring, i let go of worrying, fear, the what ifs. And ironically the only treatment my family didn’t try to micromanage it.. he beat it twice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1076186042291454002",
    "author": "Josh",
    "date": "2023-02-17",
    "content": "I’m scared of making mom jokes because most of my friends either have bad relationships with their moms or they have some awful disease in which they deserve a break from the choice of comedy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1076186992670429275",
    "author": "Josh",
    "date": "2023-02-17",
    "content": "And that’s the story of how my relationship with mom jokes was fractured.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078659844464193686",
    "author": "ALXCPH",
    "date": "2023-02-24",
    "content": "at your level i wouldnt worry about singing teachers. What i would worry about is connecting your vocal chords to your ears and brain. technique and breathing isn't something to worry about just yet. A teacher/mentor can be great for guidance. But they can be expensive. A few lessons could def put you in a direction. I would start with ear training learning to hear melodies. Usually when people are unable to hit a note it has less to do with technique and more to do with their ability to decern pitch and notes. \n\nStarting out is always tough, but start by singing everyday, sing along to your favourite songs. also try and pull up a piano and press a key and then sing the note, then press another key and sing that note, this will teach you to actively target notes with your voice/ears. Learn to sing simple songs on your own without any backing tracks or music. Nursery rhymes are great, they are simple and a lot of people have them internalised. When you get some more confidance, try and have a static chord or note, and sing different notes on top of it and see how the different notes feel / sound and really internalise that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1082759284753961003",
    "author": "cian riordan",
    "date": "2023-03-07",
    "content": "Insight gives you A LOT of visual information that isn't really useful unless you know what you're looking for. I have two visual meters while I mix... a janky old Goldline RTA analyzer and a TC Electronics Clarity. The RTA is useful for quick visual cues of kick to snare balance, how subby something really is, or when I'm working out phase relationships between drum mics... I can quickly glance to help aid with decision making. It's not necessary for me to mix, but I've had it for 15 years and it helps me make certain technical decisions quicker. The Clarity is very useful for the loudness radar. I basically set a guide LUFS (in my case, I'm usually shooting for -9) and you get a great visual representation of where you're at over the course of the song. Its especially useful to avoid fader creep... where I might nail the dynamics and loudness in the earlier parts of the song, but might overlook the last chorus being significantly louder, and in some cases, more squashed than it needs to be. I'm also an LCR panning guy, and it has a 'balance-o-meter' feature that has a cool weighted algorithm for determining if your mix is leaning left or right.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1083274780234498088",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-03-08",
    "content": "I think he's coming from a place where we as an Producers/Engineers are many times hired because the artist for sure knows that what he want from us in his mix and he is sure that he'll get it from us because of the personal relationship that we have built overtime and that personal taste we have shared.\nSure AI is sure good for a headstart,no question about it and automation is good for repeating tasks but for niche work and for niche taste AI might fail to deliver.\nThat's what I think he meant.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1085040299409145876",
    "author": "Nomograph Mastering",
    "date": "2023-03-13",
    "content": "Lost a gig tonight, probably $5k of work for a fairly new A&R relationship on an artist that does 10s of millions of streams",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1091758328398491648",
    "author": "spectrummasters",
    "date": "2023-04-01",
    "content": "Ha ha thanks man, maybe you could be my enforcer. ..it makes me wonder if I’ve become a bit jaded about relationships in music....like personally, its massively rude...but professionally it feels like...oh ok, you’re a dick then? Cool...lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1092587471524593795",
    "author": "Zach Hughes",
    "date": "2023-04-03",
    "content": "A few topics to consider:\n- how to go about trying to establish the type of working relationship for example Jon has with Dale with a mastering engineer? most MEs I've worked with haven't seemed to keen to go deeper than email hand offs\n- i'd be curious to hear you guys riff on the compromises made to make records loud, what is given up to take a record from -10 to -8 to -6 LUFS\n- when is Unfuck Nashville coming????",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1093089067392053329",
    "author": "spectrummasters",
    "date": "2023-04-05",
    "content": "Just finishing up the live now . It’s so satisfying to listen to the spotlight being shone on the role that evolutionary biology plays in our perception . Thank you man . And the importance of our physical relationship to sound . I come from a world of outdoor free parties (soundsystems ). Which in America would be akin to something like burning man . My friends ran free party sound systems …..we rocked up to fields in the night and set up massive boxes .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093089295608324146",
    "author": "spectrummasters",
    "date": "2023-04-05",
    "content": "Our physical relationship to sound is key . Real  bass is felt in your abdomen , like a thunder clap in a storm . It’s primal and meant to be imo . The sound of a sound system from half a mile away in the night outside . That’s bass . That’s music . We seem to be somewhat obsessed with deconstructing all our evolutionary norms . For the sake of “new tech “ experience s. Your point about the hrtf profiles and the experience of anechoic chambers is so vital imo ruairi!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093091678610530364",
    "author": "spectrummasters",
    "date": "2023-04-05",
    "content": "As I said before when we were discussing AI , I feel we seem hell bent on deconstructing our own natural experience of life , (which is to say imo the nourishing relationship  we are blessed to be born into , ie . Nature )…..and hearing you bring this sort of thing into the atmos conversation is actually a relief imo ruairi . Keep going man !!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093283172915101726",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-04-05",
    "content": "On a serious note, There's one Question that I Would like to ask from the People of Discord(Specially those who have been in a long time Relationship/Marrage).\n\nThere's one thing which bugs me apart from making a carrier out of what I love and sustaining myself is would I ever will find a person (My Significant other) who'll actually understand my love and passion for music and would take interest in things that I love to do and wanna get better at.\n\nI come from Rishikesh,India where finding people who genuinely fuck with what I do is already less and usually who shows interest is usually showing it so that he can get my help in certain form.\n\n\n\nI'm 22 though and again I might be just overthinking or maybe I'm not but this is something that bugs me which leads to more over thinking which again leads to more questions where I'm like how will I know if this person is just not being nice and is actually interested in what I want to do for rest of my life,What if that person comes across and I Blow it off etc etc!\n\nSome Practical advice and mindframe to overcome this will definitely help!\nThanks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1093292930573287535",
    "author": "David Fuller",
    "date": "2023-04-05",
    "content": "can confirm, it's very nice to be in a relationship with someone who doesn't work in the same field as you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1100989826662146148",
    "author": "popaganda.",
    "date": "2023-04-26",
    "content": "I think taste can totally be developed. A lot of my musical taste comes from being shepherded into things by mentors over the years. In an era where mentorship is less there’s a real risk of your taste being determined by the algorithm or people around you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1102308239565148241",
    "author": "Nomograph Mastering",
    "date": "2023-04-30",
    "content": "Dried spaghetti, I bet you could add 10% more modern impact before the internal relationships started to fall apart. A modern record needs to be conceived differently from prepro",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1108809158653907109",
    "author": "Zach Hughes",
    "date": "2023-05-18",
    "content": "For me I think the answer is yes. These are inner circle people. Not a typical client relationship. I want to be encouraging to the folks who come into my orbit, but also want those encouragements to be based in reality. Perhaps there are poor frameworks to be interrogated that are simply no longer useful.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1115688497681023047",
    "author": "sarawls",
    "date": "2023-06-06",
    "content": "My mix mentor has never had a social media presence of any kind, no website, doesn't have a cell phone, and is constantly booked out months in advance and totally overworked and complaining about needing to set boundaries for his mental health.  And his career began in the age of social media.  He pulled a rabbit out of a hat.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1115697625560260719",
    "author": "LAPhill",
    "date": "2023-06-06",
    "content": "Where did the work come from in the beginning? Momentum/credits and word of mouth are probably more useful than social media once you hit a certain threshold, but you have to get to that point. Curious in this case what the early stages looked like.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119991802523570259",
    "author": "Bryan DiMaio",
    "date": "2023-06-18",
    "content": "I’m glad I took chances when I was younger. Being VERY chill on the invoice hounding in order to preserve some high level artist relationships was only something I could do in my early 20s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119998354018025492",
    "author": "bobby k",
    "date": "2023-06-18",
    "content": "his argument was basically that a “day job” in creative world is just the financial support behind what you actually want to be doing. that nobody actually wants to be at their day job. i just thought of it as language to define a structured relationship between work and income, whereas the areas of music outside of my income are more reserved for play and selfish pursuits.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121325969798606860",
    "author": "Rob Domos",
    "date": "2023-06-21",
    "content": "Tbh I don’t think he fully understands all of the terms he’s using here. Like he’s talking about Fourier transforms in representations while talking about how sound is affected in the same sentence in a way that reads like he’s just smashing buzzwords together without understanding their meaningful relationship to one another. That said, I did learn something with Q being proportional to rate of dissipation. that lines up with my experience and it’s great to see that there’s an explicit formula for it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1125136299934896289",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "I might be biased as a producer but there’s also not much value put into this kind of relationship as much anymore. Or more so the expectation of what the job entails is in smaller scope. Expectations of what producers do these days are often arrangers with computer skills that can make things sound good. \n\nAnd I think a lot of music nowadays don’t really hit you in the heart for that reason…\n\nOf course this is still how people make music in the higher level. I’m talking more as a person starting out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125166301099331675",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "Production is my gig but I’m not opposed to picking up engineering gigs to build relationships that would lead to more production gigs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1128415375042805924",
    "author": "peterlabberton",
    "date": "2023-07-11",
    "content": "Alright frens, seeking… wisdom? Advice? A gig? (Lol.)\n\nI’ve wanted to live in nyc my entire adult life and never have—it’s never made sense to do it career-wise and probably never really will. But every time I’m there I feel totally at home and happy and excited in a way I don’t anywhere else. I spent a summer there several years ago and always linger as long as I can whenever I can, have close friends there (not in music), end up there usually a couple times a year and relish it every time. I feel like I know it as well as is possible for never having been a resident.\n\nI know the music biz there is pretty much defunct (at least compared to LA), and I really *really* don’t want to repeat the emotional and financial ruin that I experienced moving to LA and restarting everything 6 yrs ago… but from a non-career perspective it’s where I want to be.\n\nAll that said, I’m in it to fucking win it in LA for my career—though with an eye for sure on getting to a point where I can relatively comfortably make that move.\n\nAny wisdom/experience on making a mid-career move like this from folks here? I’m 35 yrs old, some decent credits but not major traction yet, in a basically married but not actually married relationship with a school principal who is into the idea of a move there as well (though our finances are totally separate and I for sure need to earn!), no kids or desire/plan to have kids.\n\nAny benchmarks/goals that might be reasonable to aim for before seriously starting to make moves on this? I’d do it tomorrow if I could, but would also stay in LA for 5+ more years no prob to set things up properly. Even open to things like a podcast (/radio?/other audio prod) gig to help smooth the transition if that’s reasonable to find and lucrative enough—but what I’m really looking for is how to think of this as a full time freelance record maker. Or if someone on here secretly is hiring for staff gigs at Electric Lady, plz lmk 😉",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1128514392166764584",
    "author": "cian riordan",
    "date": "2023-07-11",
    "content": "Could I go on more vacations? Work later hours? Have more money for things? Absolutely. But the juice is worth the squeeze. And now that I know what its like, I could never envision a life without a child... without that relationship.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1128578454565167164",
    "author": "AJ",
    "date": "2023-07-11",
    "content": "I totally believe that this is their reasoning. It's also tough because we can't prove this transcendent experience would happen to the person in question. There are definitely parents who have not had this relationship with their kid, just as there are many (like yourself) who have. But as someone who hasn't taken that step, it merely reads as a gamble towards a \"payoff\". Which is why the conversation inevitably gets circular.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1128587115664515142",
    "author": "cian riordan",
    "date": "2023-07-12",
    "content": "Similar to people who don’t want to be in relationships because they’ve had bad experiences or because their life isn’t setup to accommodate it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1129860389006483476",
    "author": "Adam Thein",
    "date": "2023-07-15",
    "content": "Again it really depends on your relationship with these artists - but I also only take on maybe 3 production projects a year and can afford to move slowly since my bills are paid by mix work mostly.  I communicate that with the people I do production with early on.  Not sure how to balance it if everything is coming down to production especially knowing some of your other responsibilities outside music production - it’s gotta be a big challenge finding that balance!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133431631252820141",
    "author": "spectrummasters",
    "date": "2023-07-25",
    "content": "Any other top tips ? I’m finding that some of my usual tricks for the rap stuff doesn’t cut it for the bands stuff . Eg. Sometimes I’ll send something like a bass or kick stem through some outboard to sauce it up and blend back in as a patrallel (eg through my VOGs ) . This doesn’t seem to work the same way with the live stuff where there’s bleed and other phase relationships between the stems , unlike isolated sample based stems . The phase relationships seems to demand soooo much more care and delicacy",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134671852158066758",
    "author": "hyanrarvey",
    "date": "2023-07-28",
    "content": "One of my mentors gave me a huge one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138564374617927711",
    "author": "spectrummasters",
    "date": "2023-08-08",
    "content": "I hadn’t thought about how it could apply in interpersonal relationships",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1139269291607335032",
    "author": "Nomograph Mastering",
    "date": "2023-08-10",
    "content": "Jaxsta could monetize that, using their relationships to fix credits for smaller engineers etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1139444702408622142",
    "author": "AJ",
    "date": "2023-08-10",
    "content": "That makes sense to me though. I'm sure your relationship with your wife and kids brings happiness and satisfaction anyway. They don't seem like conflicting goals.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1142185176328306770",
    "author": "Rollmottle",
    "date": "2023-08-18",
    "content": "and pretty insidious if you don't have a healthy relationship with it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1142725192611803157",
    "author": "spectrummasters",
    "date": "2023-08-20",
    "content": "Yeah there’s defo the rebel without a cause / adolescent thing happening ….but how it’s channelled here in london is through fetishising violence alone . It’s v absurd . I agree about France . I love France for many reasons . I’ve been in France since I was born so many times and my dads house is just outside Montpelier on the coast . It’s beautiful and the French have a great family tradition ….but they also have a horrific relationship with their ex colonies and the communities that stemmed from migration to France from those ex colonies . The racism in France is brazen and bitter . England isn’t much better it’s just buried within bias as opposed to declared prejudice , which in some ways can be more insidious",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1142952594977849394",
    "author": "Nomograph Mastering",
    "date": "2023-08-20",
    "content": "Yes, Danish friends tell of a very strange relationship to success there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1142952966463176748",
    "author": "lystell",
    "date": "2023-08-20",
    "content": "Sweden has got a very complicated relationship to success as well",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1144275381621379222",
    "author": "Luke DeJaynes",
    "date": "2023-08-24",
    "content": "There's also something to be said for the rare cases when you can humbly, and kindly say \"I might not be the collaborator to get the results that will please everyone on this\".   That conversation ALWAYS sucks and stings a bit, but sometimes shows a confidence and maturity in what you do.  I've had to do this a couple of times, and though it feels like a bit of a failure, it's just acknowledging the reality of the entire situation, and perhaps saving a relationship.  But it's hard to know when to take that approach.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1147658742427566080",
    "author": "cian riordan",
    "date": "2023-09-02",
    "content": "Tough one. Most jobs in studios come from referrals and references. When I worked at Barefoot, I would literally just throw resumes away when people stuffed them in the mailbox.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147659954371707001",
    "author": "peterlabberton",
    "date": "2023-09-02",
    "content": "Yeah—in my experience as well it’s entirely personal connections and referrals. I did get my first internship by sending a thousand emails, but after that it was all word of mouth. The shitty thing if you’re looking to land a gig and just breaking in is that, the moment a job (or “job”) opens up, the studio manager is gonna know a dozen people personally who could do the gig and are hungry. Slim to no chance they’ll be digging through resumes of strangers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147660521605177404",
    "author": "NoahNeedleman",
    "date": "2023-09-02",
    "content": "Yeah but having a resume/website/one-sheet to give someone when the word-of-mouth referral hits is important",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147967534486798377",
    "author": "Nomograph Mastering",
    "date": "2023-09-03",
    "content": "For me, I would read purist ideas from the likes of Albini and being in a vacuum they sounded profound and true. I didn’t have a mentor or role model to say “STFU and dial up Large Hall 2, it’s what this song needs”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1156344384657301578",
    "author": "Erthrock",
    "date": "2023-09-26",
    "content": "Hello friend showed me this discord.\nI have a question.\n\nIm releasing an album, but as an artist It just dont sit right with me not being able to show all the art I have made for each song. Is there a method or way to drop an album with artworks for each track.\n\nThe album is an actual album with the same theme, but I want people to really feel my art, the main reason I got into music because Im able to express the feeling and what they are about.\n\nThank you for your time.\n\n(when networking ive heard stuff about waterfall being able to get 1 or 2 songs with different art but I dont understand what a waterfall is.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1156986529256853544",
    "author": "Bryan DiMaio",
    "date": "2023-09-28",
    "content": "BTOD sells refurbs and has a pretty high reputation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158500027375816704",
    "author": "Nomograph Mastering",
    "date": "2023-10-02",
    "content": "Referrals are everything",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158501603372965958",
    "author": "Nomograph Mastering",
    "date": "2023-10-02",
    "content": "Referrals or vetting are just handled differently",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158522356835303504",
    "author": "Josh Bowman",
    "date": "2023-10-02",
    "content": "Loving this conversation btw! As someone who doesnt have any big name credits outside of old assistant gigs, my thought process was always to pile on any songs i think sound good i've done to my spotify reel, and then hopefully when people in my local scene go through it, they recognize some buddies or artists they know in there and can reach out to ask about me- BUT as i start to bark up the label tree and try and find more work in that realm, i've become pretty self concious about the volume of unknowns on there and have been thinking about taking a new approach to pairing it down to only things with some following/accolades (even if its just local/canadian awards or noms), and/or songs i LOVE and not just things i think \"sound good\". Curious if anyone has any thoughts?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1158853662626549803",
    "author": "Nomograph Mastering",
    "date": "2023-10-03",
    "content": "For sure, even in mastering where there are no phase relationships to consider I’ve had it change things in ways I didn’t like. Can be powerful too, was just noting that it’s not a free lunch",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1164314143436836967",
    "author": "Slow Hand",
    "date": "2023-10-18",
    "content": "Was just going to chime in and say: My expressions tend to treat things like objects in space: touching, moving, action, inertia, cause and effect, texture, proximity, relationship to, etc.\n\nWhich is amusing to me, because I don't consider myself to be a very bodily-kinesthetic person. For now, I'm gonna point the finger at all of the Warner Bros/Looney Tunes cartoons that I ingested growing up. *Very* kinesthetic. That stuff is seared into my childhood brain.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165394037994442832",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-10-21",
    "content": "Re: Audio youtube, there's an implicit contradiction in reviewing anything from any company you want to maintain a good relationship with. Incentives are everything. You'll eventually be able to justify whatever your incentives dictate for you, so the \"reviews\" are just systematically unlikely to help anyone get a nuanced understanding",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1165396931569258526",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-10-21",
    "content": "A nuance: At the same time when Dan Worrall has the Waves affiliate links on a video showcasing Waves products, there's reason to consider even his incentives in that particular circumstance. Or his long-standing relationship with Fabfilter. Doesn't mean there's any ill will or that any products are bad, but incentives cloud literally everyone's output",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1165406229703696456",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-10-21",
    "content": "A lot of them are really good at social media, which somehow gives them credibility where there shouldn‘t really be any\nHaving lots of followers ≠ u know your shit regarding audio",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1177308770561433725",
    "author": "spectrummasters",
    "date": "2023-11-23",
    "content": "Random electrical science nerd one : revising about inductance and it’s effect on the phase relationship between current and voltage …..,I was reminded that when a signal goes through a transformer the voltage leads the current and there’s a phase shift of 90 degrees between them . Is this what we hear as the sound of transformers ? A 90 degree shift in the phase relationship between current and voltage ? Is this what mr neve understood and tinkered with ? One of these Days I’m going to discover how these electrons really  are able to carry “sound “ ….TBC",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1177341382898229418",
    "author": "spectrummasters",
    "date": "2023-11-23",
    "content": "Coming back on this ......\nThe bigger principles ...did you guys agree on what these will be ?\n\nI loved you and dales chat about this game being a body in motion ......and it’s the relationships along the way you built you ll remember forever",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182056582381568101",
    "author": "austenballard",
    "date": "2023-12-06",
    "content": "look, like\nI'm so inexpressibly grateful for this community, for its very existence, and for the knowledge I have personally gained from it\n\nAll I want to do is make sure I'm giving back in as equal measure as I can. Whether it's the community profile articles or a podcast or whatever, if it helps platform the really cool people we've got here and spread good knowledge and discourse on record making, I will do it out of a sense of obligation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1191787325345255425",
    "author": "Deleted User",
    "date": "2024-01-02",
    "content": "Interesting. I think young people might be starting to miss or crave the intimate experience of record shopping and having that kind of relationship with music. Even though we get all the music out there on spotify, it won’t really give that same experience of looking through store’s collection like it’s a treasure hunt. So perhaps it’s not too much of a hipster thing anymore",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1192560657204252805",
    "author": "BatMeckley",
    "date": "2024-01-04",
    "content": "Does the band have a reputation around town? I’m reminded of a band in the 2000s in la that were fantastic; sold out the sunset strip every time, MASSIVE producers did full albums for them on spec. And yet they still couldn’t land a deal, and what I kept hearing from A&R guys was that they’ve been around so long and hadn’t blown up there HAD to be a reason, that they just didn’t know. Everyone thought the other guy knew something they didn’t. There IS a certain toxicity to the project that keeps getting dropped. (Just giving perspective)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1192565924339929208",
    "author": "Zach Hughes",
    "date": "2024-01-04",
    "content": "That’s fascinating. The idea of some unsubstantiated fear of toxicity playing a factor. They’re solo artists I’m referring to. Been around town ten years or so. They’ve formed some great relationships in that span and are known around town in some circles but not selling out the Ryman or anything.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1200169717214748744",
    "author": "masteredbyjack",
    "date": "2024-01-25",
    "content": "Very cool (like Ruairi said Apple has had it for years), and I think there is actually a lot of amazing stuff Spotify could do if they leaned slightly more into the lane of social media, being a hub for listeners to connect with artists. I get why they wouldn't want to do that, but even something like the simple pre-save button there is nice, rather than having to do the 3rd party pre-save thing, which is always a headache from my experience!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1201209633663090758",
    "author": "NoahNeedleman",
    "date": "2024-01-28",
    "content": "The bedrock of community building amongst boys the world over",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1208505486094372884",
    "author": "Nomograph Mastering",
    "date": "2024-02-17",
    "content": "You can have zero work history, zero expertise, zero relationships and have a loving dedication to the craft",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1214651370263810120",
    "author": "David Fuller",
    "date": "2024-03-05",
    "content": "finishing dante certs... which mostly feels like a combo of advertising and networking but what do I know",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1218727034889703515",
    "author": "peterlabberton",
    "date": "2024-03-16",
    "content": "Just as a counter-point: what happens when that money and reputation for that success dries up, and the landscape has changed? As it will. I'd bet the more \"classics\" oriented approach is going to be more adaptable to whatever it is that's next.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219797877115715594",
    "author": "SoundsLikeJoe",
    "date": "2024-03-19",
    "content": "The national connection is real for playlist placement. My friend (who will remain unnamed) has landed on all the TOP playlists for instrumental music...  and it's largely a networking byproduct...  and he's closer to the source.  So WIN for him. That's life",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222080013713543239",
    "author": "spectrummasters",
    "date": "2024-03-26",
    "content": "It’s a bIt of everything to be fair . When we say “he “ , the relationship between the artist and their chosen recording engineer is going to go through a phase (s) of experimenting together on getting a sound . For example , my main artist and I discuss developing new settings and vocal sounds out of auto tune for each track . So we have sessions of just engineering his sound together",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1222080340164874260",
    "author": "spectrummasters",
    "date": "2024-03-26",
    "content": "This is pretty much the standard hip/hip and / or rnb artist / engineer relationship",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1225235333319491585",
    "author": "Slow Hand",
    "date": "2024-04-03",
    "content": "I find that I have a very kinesthetic and spatial relationship with music. Sounds are objects in space with weight, momentum, and depth. Musical gestures feel like they have cause and effect to me, if that makes any sense.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1225705018800472156",
    "author": "Deleted User",
    "date": "2024-04-05",
    "content": "I loved the analysis, I had thoughts about a few points he mentioned. \n\n1. Paradox of climbing up to the highest level\nCould Michael Jordan have become Michael Jordan if it wasn’t for the feeling of someone chasing behind him to become one of the greatest of all time? There is only one Michael Jordan, and can anyone else be that one and only without going through what he has put himself through? \n\n2. Acceptance vs Dissatisfaction\nI think the dilemma here is between satisfaction and acceptance vs beating. I don’t think one or the other is necessarily the answer, but I think a good place to be is finding acceptance in where I am right now while still beating on myself to keep on improving to the highest level I could be. \n\n3. Potential\nThis is a crazy concept to me. Who is anyone to evaluate someone’s ceiling of improvement? Spider defined the meaning of ‘potential’ perfectly in my opinion. Not his exact works but; one’s capable/willing range of adaptation. Did the professor in Whiplash really expand his students’ potential in this sense? \n\n4. Abusive Internal voice \nI love how he saw the professor as our internal voice. And it made perfect sense to why I was so obsessed with this movie and the character. He was myself to me all along. I went back and forth over and over on whether this relationship was worth it to either of them. I think perhaps limited to this particular two people, because they had common goals/interests and made it happen. \n\n5. Joy?\nI feel that this is the most simple and complex out of all things here. Can anyone NOT experience any frustration while trying to get better at something? If the answer is no, is there a way to better manage the frustration? \n\nPursuit vs Result, our brain works the most consistently when we look towards pursuit. Result feels good but not for long, but what if the result meant more than just the goal being achieved? What if the “result” portion leads to another pursuit after another?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1229317920069255241",
    "author": "oaklandmatt",
    "date": "2024-04-14",
    "content": "I wonder what the relationship is between the Coachella sound people and each artist's sound people. Maybe a #🏯livesound-talk question I dunno.\n\nPeople's vocals are sounding DRASTICALLY different. Bands generally sound like bands. Artist's playing to tracks (with or without the live gospel super drummer vibe on top) generally sounds the same and good. \n\nBut vocals are real dodgy for some of these performances. A real disconnect with the artists MD and what happened in the studio.\n\nCurious if anyone in this world knows more",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230295679562285108",
    "author": "hyanrarvey",
    "date": "2024-04-17",
    "content": "really depends on the relationship with the artist. i mean there's always that risk of losing them to someone with more of a name. you know the classic saying. whats the quickest way to not work on album no. 2? Have a hit with no .1",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230352450515632179",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "It’s really the heart of my question today - is influencing/tutorials to attract low quality clients that will leave you for someone cool as soon as they can a better career strategy than just going dark, woodshedding, maybe investing in a few key relationships and doing the work?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1232835310820528128",
    "author": "Slow Hand",
    "date": "2024-04-24",
    "content": "Matter of fact, how do y’all discover music these days, aside from word of mouth?\n\nIf y’all have sites, services, labels, or events that you rely on to discover new music I’d love to hear about them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1234960904886685797",
    "author": "spectrummasters",
    "date": "2024-04-30",
    "content": "I think it was bob marley who said you can have all the money in the world and not be a rich man . (Drake ) the wealth of a man is to be found in his relationships and the quality of those relationships (Kendrick ?)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1239153237949550713",
    "author": "spectrummasters",
    "date": "2024-05-12",
    "content": "I get the point albinos making though . Defo be wise to power exchange in relationships",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1239648736213209199",
    "author": "spectrummasters",
    "date": "2024-05-13",
    "content": "To the mods . If I may ask ….. do you have any top tips for managing your own emotions when dealing with challenging or disappointing relationships during projects ? The hardest part I find is mixing for others ….because I’m compelled to answer the phone when I may feel like I’m not on the same wavelength as them right now (for example )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1245483927208984778",
    "author": "Nomograph Mastering",
    "date": "2024-05-29",
    "content": "I could be wrong but I don't think I've ever heard the words \"Young\" and \"Mentor\" put togther, the assumption is always older/wiser/more connected mentor",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1258848865268797450",
    "author": "NoahNeedleman",
    "date": "2024-07-05",
    "content": "Well in Nashville, it’s Publishers. Majors have moved away from development, A&R have moved mostly into branding and DSP relationships. Publishers are the ones catching artists young & on the rise and developing them. I think mostly because the initial investment is much lower (think $25-$50k annually instead of hundreds of thousand to record & market albums, tour support, etc.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266963388798468156",
    "author": "spectrummasters",
    "date": "2024-07-27",
    "content": "….my thoughts move along the same line as Anthony pretty much . If I could nail down only one thing , something real and not a possible projection , I’d say the biggest difference is the modern mobile phone , post iPhone . The impact of the screen , and “the world in your pocket “ …….all your contacts , all the corporations , and your social credibility. I think the unknown weight of this blessing/curse  shapes the spiritual and psychological form of the  human currently",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268450862838317150",
    "author": "spectrummasters",
    "date": "2024-07-31",
    "content": "Perhaps he was fearful for his reputation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268453747638403182",
    "author": "Rob Domos",
    "date": "2024-07-31",
    "content": "Like this heuristic alone would dramatically improve the careers of countless people and the quality of records and relationships everywhere",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1269004490447781998",
    "author": "Nomograph Mastering",
    "date": "2024-08-02",
    "content": "That said my relationship to work is … questionable so",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1269953712009252907",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-08-05",
    "content": "Anyone doing LAAMP this year? I saw Serban is going to be one of the mentors",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1277659732693221436",
    "author": "Zach Hughes",
    "date": "2024-08-26",
    "content": "If you don't mind me asking, were the people who told you you were going to fail experts / higher-ups in the industry / had credibility to you or more laymen / outside the industry / non-credible folks? I'm not asking to be specific here or name names or anything. I'm just curious if they all had equal weight in forming the 'fuck you' attitude and motivation; all like fuel for the same fire.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1279933044005802026",
    "author": "Slow Hand",
    "date": "2024-09-01",
    "content": "It's funny how being in a loving relationship has the same qualities. Hopefully yours is just a little less adversarial.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280902958292406364",
    "author": "Nomograph Mastering",
    "date": "2024-09-04",
    "content": "I’ve mastered plenty of work done in headphones and it can be fine, the more synthetic the genre the easier it is to do. But vocal placement, low end relationships, imaging always feel less than 100%",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1287317711168213022",
    "author": "Nomograph Mastering",
    "date": "2024-09-22",
    "content": "I don't think I could talk here about my internal relationship with the idea of writing without it getting weird",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1287317750137749567",
    "author": "Nomograph Mastering",
    "date": "2024-09-22",
    "content": "But know that there's an internal relationship",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1294286417421271124",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-10-11",
    "content": "I'm Austrian and given how small the local scene is it wouldn't surprise me if I knew who he was lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1305320298790391869",
    "author": "Berlin",
    "date": "2024-11-10",
    "content": "Yesss Wesley Wolfe does it and he’s amazing. Also offering short run pressed vinyl as well. Long time friend and cutting engineer mentor.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1312863593166802957",
    "author": "Nomograph Mastering",
    "date": "2024-12-01",
    "content": "What is your relationship with things you do not understand?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1318007587383545876",
    "author": "Rukie",
    "date": "2024-12-15",
    "content": "And what that dove means for us personally, is what differentiates our directions. Not our relationship with the dove, whether we are hunting, or chasing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1318026146293747852",
    "author": "NoahNeedleman",
    "date": "2024-12-15",
    "content": "I think there’s a real benefit to understanding your relationship with success. Seems like you’re pretty clear on that and I for one applaud that. \n\nI do, however, wish I had the kind of money from making music that allowed me to fly across to the country for a week to work with an artist I believed in without needing to get paid for it.  Beckley does just that. I hope the work I do allows me to pay that forward.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1327720658922242201",
    "author": "Zach Hughes",
    "date": "2025-01-11",
    "content": "A few extra caveats to add to the credits convo from yesterday. I just checked with my distributor and they do not allow for the delineation between 'producer' and 'co-producer' or 'additional production'. 'Producer' is the only option and multiple producers can be listed. I also checked Spotify and it is the same there too. 'Producer' is shown but no field for 'additional production'.\n\nI agree with what others were alluding to in that it's worth considering how asking for revised credits impacts the relationship and that caution and being respectful towards and honoring the artist's story is valuable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1331066749000618024",
    "author": "youngteam",
    "date": "2025-01-20",
    "content": "you could get lucky submitting it to someone who's openly taking submissions (timbaland's livestream for example) but you're leaving a lot up to chance and competing against a lot of people.\n\nultimately what you're looking for is relationships with those people you think could do it justice. cold dms sometimes work, but not guaranteed. just think how many people are sending songs to these people?\n\ntry thinking of the specific person you want to get it to, then find out all the people they work with. you're going to have to start small and work your way up the ladder of impressing people.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1331086633935835227",
    "author": "Kamil",
    "date": "2025-01-20",
    "content": "Oh ok I see that makes a lot of sense I will make a list of the ones I’m thinking of and start doing the ground work with the networking",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1335904758069727273",
    "author": "Ed Sokolowski",
    "date": "2025-02-03",
    "content": "Haven’t been to Denmark St in years, I’m sure there was/is a few shops connected with the Harrison brothers that had a reputation for selling forged guitars as rare/celeb owned.\n\nSome cool stuff here:\n\nhttps://www.newkingsroadguitars.com/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1340200350711414854",
    "author": "Paris / Blue Butler Studios",
    "date": "2025-02-14",
    "content": "Leasing is great if it’s affordable, I definitely recommend Craigslist or word of mouth. Some of the larger studios up in Portland have such killer deals on leases down to $1/sqft/month, not sure about LA leasing either.\n\nAnother downside of leasing is landlord risk, I know a couple studios that closed after the owner sold the building & either rents were raised or the new owner wanted occupancy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1342281351025655858",
    "author": "Nomograph Mastering",
    "date": "2025-02-20",
    "content": "A couple of reminders for the gang\n\n- Watch out for Spoof email links from \"label execs\" , \"A&R\" etc. I've been targeted by a few over iMessage and a friend today got hit with a very plausible one from a big A&R we both work with. It's very unlikley that a new relationship will start with them linking you files right away so be careful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1342938100099186780",
    "author": "Bryan DiMaio",
    "date": "2025-02-22",
    "content": "As long as your private server and networking is secure, yeah you’re the only one selling your data (literally, $ for audio files)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1343533836348293142",
    "author": "spectrummasters",
    "date": "2025-02-24",
    "content": "Interesting . I like your point about the relationship between innovation and tech evolution , although I think it might be the reverse more often . In a way it’s a bit chicken egg really . \n\nI’ve got four young children from 2 to 15 , and they and their friends are my lens into how online life looks to the “youth “\n\nI have no prejudice against influencers or content creators and respect anyone making a good living that’s not exploitative , so hustle hard I say \n\nOn the other hand , I’m a bit of a fish out of water here as I’m v pro underground art and expression . My hometown brighton , had a plethora of graffiti spaces , buskers , and alt culture …..so it sort of gives me a very “in the street “perspective . Like I’m 💯 street culture , which is often the antipathy of online / social media . \n\nNot hating on others interests though and again , interested to learn a bit more about the online innovators  when you have a mo \n\nI",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1344091284188561438",
    "author": "Deleted User",
    "date": "2025-02-25",
    "content": "I mean I’m writing this after a year of trying to work on having more agency in my life, taking more care about my friendships, work relationships, organizing an event and I see that’s a crucial role to have people create and shape society around us. \nWhat I’m having a hard time with is describing it as a somehow inate quality of a person to have. There is school that should teach you to take agency of your education, there should be friends teaching you to take responsibility of your relationships etc. etc. but if you’re coming from a place where you maybe don’t have the possibility to learn that, how would you ever know?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1352276021843464233",
    "author": "SoundsLikeJoe",
    "date": "2025-03-20",
    "content": "Right?  I found the site through my site's referral stats.  So...  someone made the click through.  Very odd strategy to not proof the scrape and AI generated descriptions.  Also raises the question...   What's in it for them?  How are they using this to profit?   Not sure if there are any potential negative effects on the studios being listed...  but I wonder?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1352327354923614328",
    "author": "LAPhill",
    "date": "2025-03-20",
    "content": "I think I've also always worked a lot, and unpredictable hours at time, so the groundwork has been laid since the beginning. I imagine it could be more of an adjustment for a relationship if one is coming from a more stable schedule.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1356703384803082290",
    "author": "sinaigimenez",
    "date": "2025-04-01",
    "content": "Not according to Ilan's management 😐\nMaybe if I can reach him directly...\nHis brother Aaron (from Blink 182) used to help me a lot by doing some sort of mentoring. Maybe I should ask him, but I’m afraid of putting him in an uncomfortable position.\nThe music is really good (some NIN/Deftones vibes without copying). If you think of any drummer who could work, I’d love to hear it. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1381715951774470215",
    "author": "Gabriel Tyranny",
    "date": "2025-06-09",
    "content": "- Last quick note\n\nMy business mentor saw how guilty I felt when I took breaks from ‘working’ to process mental challenges / life. I thought he’d be disappointed with my monthly update, having mostly spent time in bed processing traumas and talking to my wife about hard topics, and he said “I’m proud of you for doing the REAL work.” \n\nHe didn’t elaborate, but I think I really get what he meant. I’ve appreciated that over these last months as I see saw between bursts of external and internal work. ❤️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1381888967397347469",
    "author": "thegreatcarsoni",
    "date": "2025-06-09",
    "content": "Like I love the sentiment here but it’s really hard to convince anyone to let someone with no reputation to speak of (me) spend a loving amount of time on recording",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1383560693495894018",
    "author": "Gabriel Tyranny",
    "date": "2025-06-14",
    "content": "For context, I’ve been doing all my networking and projects from Portland, OR, usually remote, and I’m looking to get as involved as I can and weighing my options for if moving to LA to be in-person has net positive return, or if it’s not needed in this day and age.\n\nI’d love anyone else’s input and opinions on this as well.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1388208694205874289",
    "author": "Slow Hand",
    "date": "2025-06-27",
    "content": "I was fortunate to have a good mentor in such things. We'd end up at unexpected parties and events, meet strangers, explore old factories and unused buildings, and get totally fucking turned around.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1390082316449222707",
    "author": "Gabriel Tyranny",
    "date": "2025-07-02",
    "content": "Yeah that makes sense. Thanks for the advice. The question is never ‘should I persist’ - Which is almost why I’m afraid. I feel like no matter what her and I are both locked in, and when someone else trusts me like that I want to be sure I can do my part in giving back in that dynamic.\n\nIt’s hard to weigh short term wins/losses vs long term wins/losses at this time cus I’m in the thick of it.\n\nWhen reflecting, I know I always did my best to communicate as honestly as I could in every moment, and was transparent about every decision and my thought processes along the way. I’ve had many wins, but going a long period without financial wins has made me question the judgement I have when navigating everything.\n\n“Winning” to me is a culmination of things that can be summed up as living authentically while positively contributing to the world and lives of others. It helps fight of the tendrils of negativity I feel coming from so many angles of the outside world, especially in the last decade.\n\nI don’t exactly know what I’m asking. Or want. I’m looking to process these feelings and synthesize them into a new level of awareness as I move forward with what I’ve learned being integrated into my subconscious.\n\nSometimes being around others, or hearing their experiences and takes, helps me get angles of things in a way that I can piece together for a rough draft of what will become the lesson that I carry with me moving forward, regarding this topic at this time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1393615989979086878",
    "author": "Will Melones",
    "date": "2025-07-12",
    "content": "I read this as \"lightning bowels\". Thought I had learned something new about Ryan's reputation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1415842710585212939",
    "author": "NoahNeedleman",
    "date": "2025-09-11",
    "content": "Checking vocal/snare relationship in them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1415906892223352842",
    "author": "cian riordan",
    "date": "2025-09-11",
    "content": "Underrated relationship",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1457766484628607158",
    "author": "Chad Rodgers",
    "date": "2026-01-05",
    "content": "Like many others have touched on here it’s a mix of the company I keep and the mindset I choose to adopt. I’ve been steadily steering myself back toward a clearly defined purpose (shaped with one of my mentors last year) which is ultimately centred on serving the people and communities that matter most to me. If I stay aligned with that, optimism will feel less like hope and more like a given, and I _at least_ know that the year ahead will be filled with the good stuff. That's how I think I'll stay positive.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1458881247152439358",
    "author": "thegreatcarsoni",
    "date": "2026-01-08",
    "content": "My studio is part of a little collective of 3 or 4 studios that work together, so in the case of the animation feature, that was recorded at my partner's studio and the edit got thrown to me. The mixing stuff I get is mostly referrals/friends. I'm not really approaching/actively seeking anything except my VO and some mixing stuff.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1458882655259984036",
    "author": "LAPhill",
    "date": "2026-01-08",
    "content": "There's a balance between saying yes to gigs that cause you to stretch and admitting when you're not ready for what they need. Requires some self-awareness about your skills, and also some sense of what they're looking for. In the long-run, it's probably better for your reputation to say \"I'm not the guy for this\" instead of being known as the guy who can't nail a gig, unless they know up front that it's not quite in your wheelhouse.\n\nOther folks might have better advice here, but I'd rather be known for what I do well than delivering mid results. Like I said.. it's a tough balance.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1464077920250232914",
    "author": "bobby k",
    "date": "2026-01-22",
    "content": "I think my question is more angled towards preserving the \"living and breathing\" of being a musician once you've already broken through on sustaining yourself financially. obviously we would think about quitting when we're struggling to break in, but what about when you're at cruising altitude and things are going well? it often feels like if a romantic relationship shifted into a business relationship and i sometimes wonder if I would connect deeper by removing the bottom line from the equation and being able to feel selfish with the act of making music again",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  }
]