[
  {
    "id": "1303146368117772330",
    "author": "BatMeckley",
    "date": "2024-11-04",
    "content": "Been working on this MPC Studio all day today, and was struck by how lucky I am to be a part of this server. Last night I had a question about an audio routing program and multiple people that are not on my payroll, they do not work for me or owe me anything, responded not just same day but within minutes with information that helped me get to where I was trying to go.\n\nSo many producers/writers/engineers/music makers/ dreamers are going to be better off, and way further along their paths, because of the wealth of knowledge and the generosity of the people on this discord, from the most seasoned mods to the newest noobs. And it’s entirely free. \n\nThanks @oaklandmatt for putting this thing together. There’s always something new to learn and this is a rad place to learn it.",
    "reactions": 36,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1294330171838431303",
    "author": "BatMeckley",
    "date": "2024-10-11",
    "content": "No. \nNo no. \nNo to the hell nah no. \nThis is why I keep telling people how important it is to develop their taste. \nAlex shares similar sonic traits with his Dad because he grew up listening to someone go, “Christ there’s so much wooliness in this vocal, we need to get it up to where the audience can hear the words” or “let’s cut some space HERE in the track so that THIS sits”. The whole secret is the WHY, not the fact that he gifted him a MH Channel strip license. \n\nI’ve been really into photography lately, and I’m constantly struck by how my professional photographer little brother constantly gets better results than i do on worse gear. And it’s because he knows what to look for in a photograph, and then it’s easy enough to work backwards from there. That’s the skill of the whole thing. And it’s such a strong parallel to watching the Machine Head collectors on gearspace or the $12k PRS blues lawyers on TGP wax poetic about gear while clearly having no idea what the gear is actually used for. \n\nFocus on the right things.",
    "reactions": 19,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1262605590446735370",
    "author": "bobby k",
    "date": "2024-07-15",
    "content": "In the midst of a kinda unique side quest at the moment - label pulls me in at an hourly rate with an artist (and good friend) that I’ve mixed for many times because the production sessions were such a mess that they felt like they couldn’t even finish the records until some light mixing and organization took place. Songs spread out between multiple project files, DAWs, laptops…vocals tracked to mp3s with the ~50ms delay thing…Some of these producers templates…brilliant stuff. Saw one vocal travel through maybe 7 or 8 auxes and hit probably 4 different rvox’s along the way. It was like a labyrinth of signal flow that was nearly impossible to follow (and once I deleted half the auxes and waves plugins, it started to come back to life). In short they’re having me un-mix it, hand it back for some more production, then do the final mixes later this year. A true testament to the importance of organization and more importantly minimalist, straight forward session files. I wonder how often this need comes up and how feasible it is to be involved ahead of the handoff as a mixer these days. And before you frown at me for griping, this is an absolutely incredible project, many insanely talented musicians I respect. Very right brained, free flowing group. So it felt cool to be able to play more of a part on the project as the more left brained participant and see the stress relief happen in real time.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1439649073853370479",
    "author": "bobby k",
    "date": "2025-11-16",
    "content": "Most of my years in music have felt like groundwork-laying years. Just because your credits playlist isn’t looking the way you’d like doesn’t mean that growth wasn’t happening. I would challenge you to reflect on where you started 2025 and where you are now and take inventory of what growth or lessons you experienced. \n\nThe most rewarding bits of this year for me wouldn’t make sense to post about. Paid off my first business loan. Improved the efficiency of signal flow in my studio. Learned to fix some gear. Stood up for myself in a hard conversation with some assholes trying to rip me off. Got out of the UAD ecosystem. \n\nNone of that I’m posting about or adding to a playlist, but it feels just as essential (or more) to my business than the songs that got released.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1337892523510861914",
    "author": "Nomograph Mastering",
    "date": "2025-02-08",
    "content": "I mean come work with me someday\n\nI’ll be able to guess the serial number on the amp used in the recording, but in the same session spend 10 minutes tweaking a bypassed EQ",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1095505244722577418",
    "author": "LAPhill",
    "date": "2023-04-11",
    "content": "I don't know why I didn't think of this sooner, but the closest parallel to the seismic shift of AI might be samples, even more so than things like digital recording or Pro Tools. When Hans Zimmer recorded an orchestra and started writing music with a DAW and showing clients mockups, nothing was ever the same. For a long time (even now!) the pencil-and-paper people griped about how it wasn't real composition. Orchestras feared that they would all be replaced by computers. But ultimately, everyone had to come to terms with the new world order and adapt. There was a period in the mid-90s through mid-late 2000s where orchestral writing was reduced to nothing more than long notes and short notes. All of the nuance was gone, because the tech couldn't handle it yet and people blamed the tech. Many mourned the loss of true orchestral writing, yearning for a by-gone era. \n\nBut eventually, people learned to harness these new tools and they met the technology on its own terms. People are doing wildly innovative things with samples now, we've moved completely past the era of \"can I make a convincing clarinet come out of my keyboard?\" Orchestras and live musicians have not been replaced. Sure, the process is different than it used to be, but that's how innovations work. All of us would be living very different lives without samples of drums, guitars, orchestras, synths, etc. There will be a generation coming up where AI is already a thing, they won't have ever lived in the before-times. Just like those here who've never cut to tape. It's okay.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "915125397715288114",
    "author": "bobby k",
    "date": "2021-11-29",
    "content": "this is kind of off topic, but my neighborhoods grocery store has had a slightly loose aux cable for the entire store’s music, so only the Side channel plays from what i can tell. it’s been that way at least six months, and all my audio engineer friends in the neighborhood riff about it. i’ll be grocery shopping and listening to the bgvs, synths and reverbs of some top 40 song. it’s hilarious and a bit off putting",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1107035745648136273",
    "author": "Nomograph Mastering",
    "date": "2023-05-13",
    "content": "The parallel of my wife realizing that Tim from Sweetwater is her new forever friend has also been very funny",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1234725286445322300",
    "author": "NoahNeedleman",
    "date": "2024-04-29",
    "content": "The Monday after I MD’d a headline show at stagecoach for 75,000 people, I was picking up dogshit in my backyard and unloading the dishwasher. \n\nI was on a tour bus writing with a big artist last weekend, came home Sunday to spread my wife’s mother’s ashes. \n\nThis life isn’t more glamorous than any other, we just have more eyes on us when we win, or lose.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1303417462343208990",
    "author": "Josh",
    "date": "2024-11-05",
    "content": "This a reminder to get pictures and serial numbers of all of your stuff. Had a customer call in hoping we might have serials on file and this man is out of luck on $20k worth of equipment.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1380550945384960080",
    "author": "Josh",
    "date": "2025-06-06",
    "content": "With how divisive literally everything is in our world. It’s beautiful watching the entirety of the music community come together to blatantly slander *insert big producer/mixer* when they launch some AI bullshit.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1028442148128948235",
    "author": "Nomograph Mastering",
    "date": "2022-10-08",
    "content": "The mix down industrial complex want you to believe that you and I (and our baller bus compressor) matter much more than we do",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158650014889938945",
    "author": "oaklandmatt",
    "date": "2023-10-02",
    "content": "Not sure how long you feel like you've been in this state, but it kinda sounds like you're describing the place just before it's your lyrics and arrangements on NMF. \n\nIt's hard to draw parallels because I came up pre streaming and there's just a lot more people making records. But I had my first 3-4 things that started getting attention get taken away from me by managers/ labels/ bigger producers/ bigger mixers. Once I got to that next level it was obvious why I wasn't the guy yet. But if you're working on things that are at some point getting out there in a real way, that's the place that most people are before they jump up. \n\nSome of it is opportunity, some of it is skillset, some of it is time management (if you're hustling, it helps to turn great shit around before everyone else), and some of it is just the intangibles that come from more reps. \n\nMy One Direction song came out 17 years after I first recorded the first band I was in. I'm not recommending anyone spend 17 years doing something all the time for no real money. But that's how it went for me.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1179581976798302348",
    "author": "kylem",
    "date": "2023-11-29",
    "content": "Just wait until you have a kid!! Wheels on the bus is my number 1 most played",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1110700028328149134",
    "author": "Nomograph Mastering",
    "date": "2023-05-23",
    "content": "2) Print your alt mixes at the same level, same analog bus processing and with the same timing as the main mix",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1387503254790869043",
    "author": "Nomograph Mastering",
    "date": "2025-06-25",
    "content": "AND ask yourself what message it sends to the “winning” party … yeah I’ll throw you under the bus if there’s a better opportunity later",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120739328507789464",
    "author": "Nomograph Mastering",
    "date": "2023-06-20",
    "content": "When we’re discussing the benefits of $250 clippers. In parallel. On kick drums. We have jumped the shark",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266891480413372487",
    "author": "Rollmottle",
    "date": "2024-07-27",
    "content": "I manage a team of younger folks in my day job and there are a ton of parallels with music. One of things that frustrates me to no end is the belief that there's a \"How to\" checklist for how to get good. The answer is there is no answer and it looks different for everybody. I can certainly tell you the principles and strategies for how you might get good. But you need to find your own way and do the work. And sometimes that is quite literally grinding until you break through. People don't like hearing that there really is no answer (and they think you're being a dick for telling them there isn't one...which is a whole other thing). I think the ubiquitous accessibility of information has trained a generation to expect answers to be a Google or one weird trick away.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067928272219938926",
    "author": "Zakhiggins",
    "date": "2023-01-25",
    "content": "Cla vocals bypassed on the master bus FTW",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1078127163309559888",
    "author": "jonmatteson",
    "date": "2023-02-22",
    "content": "Honestly signal flow and gain staging would be great topics to cover. I work with so many younger artists who record themselves and constantly clip their converters because they “can’t hear themselves in their headphone mix unless I turn it up that high”",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1120787404190654584",
    "author": "shaunobi",
    "date": "2023-06-20",
    "content": "\"Rips On Kick In Parallel\" --new tshirt",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1227778814747218041",
    "author": "LAPhill",
    "date": "2024-04-10",
    "content": "As long as it’s not Phill Boucher. Phil with one L is the serial farter of NYC (look it up)",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407755445527117854",
    "author": "hyanrarvey",
    "date": "2025-08-20",
    "content": "Yo speaking on what @Nomograph Mastering said a few days about staying cool…we have a producer in and so the whole room is a giant mess (like most studios are when they are locked out) and we sold an amp and we wanted to make profiles/name of it before it went out the door \n\nSo the patchbay is a huge mess and I hooked up all the routing and wasn’t getting signal and I started to lose my cool and got super frustrated, Rick calmed me down and we worked out what problem was (I forgot I was feeding the the amp from the di multed on the patchbay instead of feeding it from the converter to run tones..) and after I got cooled down it clicked on why I wasnmt getting signal.\n\n\n\nIt’s extremely difficult to not get frustrated when trouble shooting and not get overwhelmed by a full patchbay but if you just take a second and breathe/calm down and start reversing your signal flow you’ll find the culprit and move on\n\n\n\n\nLong story short as an engineer you gotta be the calmest one in the room",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1457085056496570482",
    "author": "Rollmottle",
    "date": "2026-01-03",
    "content": "Focusing on the things squarely within my control is the way I’ve learned to do it. Only I can choose where and how to focus my attention and energy. The \"world\" doesn't make me do or feel anything I don't choose to feel or do. This doesn’t mean tune out and become a cold-hearted sociopath. But we need to balance the inputs so we are maximally available to the pursuits and the community we will have an immediate impact on. The world doesn’t give a shit if I constantly bang on about <insert anything bad you can think of here>. But my wife or child or collaborator or co-worker certainly will. We have so much more control over our perceived realities than we give ourselves credit for. And it's our choice whether we indulge the negative.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1036663003363422249",
    "author": "itaylerner",
    "date": "2022-10-31",
    "content": "Yeah, some kind of “transfer to new machine” button would have saved me several hours of work when I got a new computer a couple months ago. I now have a running spreadsheet of all my plugins with serial numbers and any other pertinent information - highly recommend setting this up as you put everything together",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1153307523575709727",
    "author": "conor // wbotm",
    "date": "2023-09-18",
    "content": "glad it's getting its use, had been mulling over the wording of \"they don't know i'm in a discord server with the [insert credit] of this song\" for too long",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1176648270060212264",
    "author": "sixmissing",
    "date": "2023-11-21",
    "content": "Alright! Back with another update. Moved OWC 8M2 to Slot 3, installed a Blackmagic Decklink card, removed Ultrastudio from Thunderbolt and placed second monitor on its own Thunderbolt bus and wow...it's like it's a new machine. \n\nTruthfully, I'm feeling the lag within Davinci now that the Afterburner card is gone which is honestly surprising. But it's much preferrable to having PT/Ableton hang/crash.\n\nCan't thank you (and all that contributed) for your help. \n\nPool A allocation is 25% when it was previously 100% and Pool B is now 100% (with thunderbolt) when it was previously 200%. \n\nYeesh. Thanks again!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1183137414911373333",
    "author": "chrissorem",
    "date": "2023-12-09",
    "content": "Nice one @Gerhard Westphalen !  I’m just shocked my god particle soothe oxford inflator combo didn’t work. I better reverse the insert positions",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221217900145278976",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "Said another way - Spotify is fine for musical vibe checks, inspirations etc but once you get into “do I need another half dB at 16k on my mix bus EQ?” It will lead you astray",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1224335250281332857",
    "author": "spectrummasters",
    "date": "2024-04-01",
    "content": "I lost 40 mins of my life yesterday becoming increasingly anxious that my bus b summing box was broken . Turned out little man had just been playing with the panning switches 👌😂",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1257915820516966514",
    "author": "Rob Domos",
    "date": "2024-07-02",
    "content": "Btw: selling a 1959 Fairchild, serial number is 002. Only $8,000 cuz I need to move it quick",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1375534860298354738",
    "author": "Halliemmelton",
    "date": "2025-05-23",
    "content": "\"This week I actually spent way too long messing around with (insert obscure plugin) until I figured out I didn't really have a use for it, but it sure was fun!\"",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1430936974096732231",
    "author": "Rob Domos",
    "date": "2025-10-23",
    "content": "Think about the delta between what you thought making records would be like as a kid and the reality of what it’s like as an adult. Maybe you dreamed of shredding on guitar all day and now your reality is kind of that but even more so it’s declicking and rerunning bounce boss because of a routing issue. The same goes for every industry ever, making most things more expensive to produce and lower margin than you’d expect it to be",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "819803395333423154",
    "author": "Rollmottle",
    "date": "2021-03-11",
    "content": "I've been a software designer for almost 25 years and still do it. Been running a label, making/releasing music and doing mixing and mastering for that whole time as well. About 3 years ago it clicked that mastering is my thing and decided to spend the last few years dialing in my rig and room around mastering. The job has been able to subsidize what has turned into a parallel career. I have designs on having this be my full time gig at some point, but I'm taking it slow, honing my craft and building my client base and studio while the steady paycheck is there. It's nice to be able to do that without grinding to make ends meet. I realize that is a privileged position to be in so I am grateful. With COVID, I can also crank out masters while I WFH when there's downtime or I need a work break. Some weeks are harder than others from a workload standpoint, but mastering is part of my brain-therapy so I'm happy to take it all on.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "839275741374972014",
    "author": "cian riordan",
    "date": "2021-05-04",
    "content": "Did this for years when everyone had tower Mac Pros... just slide in my drive and easy peasy. Then when I got the trashcan I would just tote that around and plug in. Now laptops are so fast that you could just plug in that way. Trying to navigate software versions and licenses -- not to mention linking sample libraries --  on someone else's machine is a nightmare. Bringing your computer is always the easiest way. If you're in Pro Tools, do yourself a favor and export the studios I/O settings into a file before you power down and swap over. That's my hot take.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "998022885299998751",
    "author": "Jeremy Klein",
    "date": "2022-07-16",
    "content": "lmao, i have none of these tho because I gave my login to a friend and he downloaded all the plugins and used the serial codes 🤦‍♂️",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1032208007238516766",
    "author": "Nomograph Mastering",
    "date": "2022-10-19",
    "content": "I know I’m the exception but Man I listened to both the Spike and Nigel episodes and I just can’t get past the interviewer. He’s clearly a good bloke and deep music fan but the questions are so pedestrian and predictable. Asking Spike what mix bus compressor he uses is like asking Senna what he has for lunch, it’s so beside the heart of what makes him great",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063109896255578112",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-01-12",
    "content": "https://we.tl/t-EdolWcOTKS\nHey Guys!\nHere's a Template that I created for ableton to Replicate Pro Tools's Mix Workflow.\nit has all the necessary Busses, routing, plugins & Key Map/Midi Maps preloaded for metering and Mixing.\nYou can Go through and swap the routing, plugins & Key Map/Midi Map acc. to your taste & Workflow.\nHope this helps if you Don't vibe with Pro Tools and Looking for a Smart way to Mix on Ableton!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1104429597120020530",
    "author": "Rollmottle",
    "date": "2023-05-06",
    "content": "i can recommend the tool Figma if you really want to get into designing and visualizing how you want your site to be. it's free and simple and specifically built for designing digital interfaces. you can chuck all your screenshots and ideas on the canvas alongside your wireframes and actual design. you can even prototype it if you want. the learning curve is not high. i use it professionally daily for what it was made for, but i also use it for tons of other things like visualizing signal flow or gear layouts in the studio, mood-boarding, designing non-digital things like rooms and furniture layout, making memes 😂 , etc.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1146122048565948567",
    "author": "Nomograph Mastering",
    "date": "2023-08-29",
    "content": "Love this. But remember that sometimes the dangerous thing to do is the exact opposite, clipping the mix bus hard or whatever. I think we want to be as free as possible from Dogma like always compress, never compress, no mix bus, all the mix bus …",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1150520895706771577",
    "author": "jantrit",
    "date": "2023-09-10",
    "content": "Everything’s a tool here, might not be super flashy but it gets jobs done. Tried to pick a bunch of flavours as money allowed. And thanks! That’s my bass insert and drum parallel for mixing\n\nThat dbx is really something on bass!! Makes me seems like I know how to mix lol",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1160830549657665557",
    "author": "Bryan DiMaio",
    "date": "2023-10-08",
    "content": "I’ve been going to some museums in Spain, learning about art history from around the 1200’s to now and I see a lot of parallels in how styles of traditional art (paintings, sculptures, etc) change and how our mixing art changes. Really interesting stuff, and @BatMeckley made me start thinking about it more with his comment about guitar gear. We as a collective grow and evolve over time and go through cycles but there are fundamentals that still remain true. We want to capture the emotion and represent something that will best suit the song. Different production and mixing styles help accomplish that but it’s cool to see how things change over time. Anyways, that’s enough of my rambling 😂",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1194805683531554867",
    "author": "oaklandmatt",
    "date": "2024-01-10",
    "content": "Running the latest maxed out pro tools and ableton 11 on Sonoma. (I had a similar automatic update situation.)\n\nPro Tools type-to-search plugins when adding an insert isn't working for me. Other than that it's working smoothly.\n\nAbleton a bit slower and glitchy but hard to pinpoint the cause. I've done a lot of plugin removal troubleshooting and I can't confidently figure out what's happening. I'm only using VST3 where possible. Some VST2 and no AU. I'm assuming the 12 update will solve these issues.\n\nAuto-tune PRO continues to be  a glitchy pile of shit. Auto-tune artist has all this latency when recalled, even if it's on \"classic\" mode (which is low latency). In order to remove the latency, when opening an existing session, I have to open auto-tune, change the setting off classic and then back on. Then the latency returns to zero.\n\nA few other plugins just recently updated and work (Reaktor, some of the Neural DSP stuff). But that was for silicon native I think, not Sonoma.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230271829122351144",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "Nah, they're gonna hire the girl or guy who made dope shit when they have a budget. Not the girl or guy who taught them about parallel upward expansion",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "822590824172355636",
    "author": "cian riordan",
    "date": "2021-03-19",
    "content": "Again, thats where I'll use my ears. These days I'm using some combination of Ozone 9, Pro-L2, and K-Clip on the master. Somethings get goosed more than others during the mix -- often times taken out of the chain. Then when it's print time, I'll take 5 mins and peel back volume at various stages to see if anyone direction sounds better... typically just paying attention to low end transient detail. Sometimes it's just as simple as just pulling back the master fader, as that is pre-insert chain in Pro Tools.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "854754974025777172",
    "author": "Josh Bowman",
    "date": "2021-06-16",
    "content": "If your feeling lazy you can also throw the Downmixer plug-in on  the first insert slot, I do that and the flip one side of the phase to check if a track is actually mono or not before taking it from stereo to mono generally.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "943970204218712144",
    "author": "Adam Thein",
    "date": "2022-02-17",
    "content": "My main tip for using Live live is try and replace as many third party plugins as you possibly can with stock, freeze as much as you can, and most of the latency you experience is going to be coming from internal delay compensation vs I/O latency.  If you are able to optimize your sets as much as possible, you can probably get away with running everything without offloading DSP to a UAD system.  If you are already in that ecosystem by all means!\n\nI built a live set similar to what you have going based off of Daniel Mintseris Lynda (now LinkedIn Learning) videos that were amazingly helpful.  Also in my case I made samplers whenever possible of 3rd party synths if the patch didn't have a ton of modulation internally.  But yeah bottom line is keep an eye on your total device latency on groups (hovering over a group will display the total delay compensation/latency calculation in the Status Bar).\n\nIf you have any other questions for me feel free to DM!\n\nEdit: we used a rackmount X32 for in ears that also served double duty as the audio interface running 16 i/o at 48khz and were able to do it on a 2015 macbook with minimal latency",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1021992097533939722",
    "author": "Jeremy Klein",
    "date": "2022-09-20",
    "content": "i too use the same logic when deciding between bus and buss https://twitter.com/ChaseMit/status/1023749086028029953?s=20&t=N2GbaCI4OJ0dDoV6oAVfWQ",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1022723477939167272",
    "author": "BatMeckley",
    "date": "2022-09-22",
    "content": "OR you could do the JJP trick that made him millions where you super gate the top snare mic to just a pop, then bus that signal out to an auratone pointed right on top of a black beauty snare in an iso booth with a mic on the bottom of that snare to get perfectly clean snare bottom sounds without all the bleed from the other drums. #DarkAgeSampleReplacing",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1038534015474487366",
    "author": "chadwahlbrink",
    "date": "2022-11-05",
    "content": "We have a Sonos One, and I love it. It’s mono, but I feel like it’s the best “mono mix checker” I can access. The sound quality is way better than the Apple HomePod Mini’s we have in other rooms. The newer models work well with AirPlay. The thing that takes getting used to is that most Sonos speakers are not “Bluetooth” speakers, they are Wi-Fi, so they work under a different set of rules than most home speakers. That said, it’s nice because you can have music playing independently instead of just routing from your phone (no calls interrupting audio, etc.).\n\nMy parents have the Sonos soundbar and that also sounds great.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1047242760710791180",
    "author": "Will Melones",
    "date": "2022-11-29",
    "content": "Oh I’m just saying it would also be convenient to have all your mix bus plugins open on a little odd-shaped screen",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063157897221124127",
    "author": "Jeremy Klein",
    "date": "2023-01-12",
    "content": "saw a video where streaky said \"HERE IS AN INDUSTRY SECRET TRICK TO GET A WIDE STEREO IMAGE. 😯 💪  TAKE A MONO SOUND, INVERT THE STEREO IMAGE SO THE LEFT SIGNAL IS COMING OUT THE RIGHT, AND THE RIGHT OUT THE LEFT, AND SEND IT TO A REVERB BUS 🔥 \"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1067964877748043927",
    "author": "BatMeckley",
    "date": "2023-01-25",
    "content": "(I tend to not put mix bus stuff on til a bit later in the process. I like to get it feeling good first and then put it on and be wowed that it’s now better, and then have to change all my automation. Not terribly efficient but the heart wants what the heart wants.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101267262851264632",
    "author": "hyanrarvey",
    "date": "2023-04-27",
    "content": "I’ve used it in parallel on 808s for lolz",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1130171366772068362",
    "author": "BatMeckley",
    "date": "2023-07-16",
    "content": "Without question. And there’s much that can be gained from approaching the music business like a regular biz. Little things like, “deliver on time”, “respect bugdgets” “HAVE budgets” etc. that can really help you make and keep your money.\n\nIt’s just also a very specific market with very unique parameters and people, so how a software company is run won’t be a one to one parallel on how you should run a production career. A bit like a pet store owner outlining how to take care of a new puppy to a person that just bought a Canary. Definitely give it food and water, but there are some specifics that require a very different tact.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1153802879774228486",
    "author": "Ross Fortune",
    "date": "2023-09-19",
    "content": "I’ve been using a nice workflow for AirPod checks recently.\n\n1. Have an output from your monitor/output bus (I have it on a send in my template) to PT Bridge\n\n2. Open QuickTime and open a new audio recording (Cmd + shift + N). \n\n3. Select PT Bridge as the QuickTime audio input. Turn up the volume slider to monitor\n\n4. Select AirPods as system output \n\n\nHey presto. Works great, no need to stream to phone etc. Just have to remember to turn down that QuickTime volume slider when you flip back to speakers. Also I occasionally accidentally start QT audio recording with spacebar when meaning to hit play in Tools. No biggie 🤷🏻‍♂️",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1194803263481065505",
    "author": "JakeTB",
    "date": "2024-01-10",
    "content": "On Sonoma against my will here, everything running fine aside from a PT bug causing typed letters to appear out of order when searching for inserts/sends/io. Ableton 11, Logic, and Cubase 13 working fine as far as I’ve seen, no plugin issues either.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1239342079243714580",
    "author": "Josh Bowman",
    "date": "2024-05-12",
    "content": "Tbh it might have been pre Uber lol… 2013 I think? We cabbed and walked, and took a bus once or twice.\nEither way Uber would get hella expensive since it’s such a sprawl and a lot of the people I would wanna visit are so spread out in different locals and traffic can make things take a while. I’ve never regretted renting a car since then.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1322918803520360469",
    "author": "spectrummasters",
    "date": "2024-12-29",
    "content": "IIRC he goes into his philosophy: workflow here (and why he took everything off 2 bus ) https://www.soundonsound.com/techniques/stuart-white-recording-mixing-beyonce",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1456093045174046864",
    "author": "Rob Domos",
    "date": "2025-12-31",
    "content": "Coming back from the airport this week and I looked at the price differential and time differential between uber and public transit and I realized that the uber was nearly $2 per minute saved. I took the bus and told myself I was making $100/hr to sit there",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828898694736510997",
    "author": "peterlabberton",
    "date": "2021-04-06",
    "content": "Not quite as slick as the keyboard shortcut, but: before I had the monitor controller/loads of outputs, I’d route the “mix output” bus internally to an aux; I’d also make a “ref output” bus. Then assign the output of that aux to your monitors, and select whichever input to that channel you want (mix or ref).",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "865229284532551721",
    "author": "Josh",
    "date": "2021-07-15",
    "content": "I remember running tracks with reaper and the routing was unnecessarily hard",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "977328559381151804",
    "author": "gagsmile",
    "date": "2022-05-20",
    "content": "yeah i saw latest youtube video of Neek where he breaks down Chief Keef songs and he's actually  using a new M1 with izotop 4 on the master bus  (https://www.youtube.com/watch?v=eRXsYItPlXc&t=712s)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "977676037934702652",
    "author": "Nateonthetrack",
    "date": "2022-05-21",
    "content": "@ehutton21 lift 3 on drum bus https://open.spotify.com/track/2t8yVaLvJ0RenpXUIAC52d?si=8acccbdd5e814005",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1022722433804935218",
    "author": "BatMeckley",
    "date": "2022-09-22",
    "content": "The Doug mckean trick with e22s is you could get the phase damn near perfect cause you could have the top and bottom capsules parallel to the snare heads.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1062228572959408209",
    "author": "WitnesstheLight",
    "date": "2023-01-09",
    "content": "its way cheaper than audio movers thats for sure and it's integrated with the video chat.. just a simple plugin on the master bus and boom",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1068343581737242734",
    "author": "austenballard",
    "date": "2023-01-26",
    "content": "mfw running my reference playlist off Apple Music and losing my shit trying to figure out which part of the signal chain is broken because I'm hearing like 75% center\n\nSwapping cables feeding the monitors, swapping patch cables, switching cables coming out of the interface\n\n... it had detected more than 2 outs and automatically gone to Atmos mode",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1074492919995707514",
    "author": "David Fuller",
    "date": "2023-02-12",
    "content": "there isn't \"weird shit from [insert place here]\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1076577016050094134",
    "author": "austenballard",
    "date": "2023-02-18",
    "content": "I hope you do too\nI bet she has a cool trick for using a bong as an insert or something",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078130965706182678",
    "author": "ehutton21",
    "date": "2023-02-22",
    "content": "Piggy backing on a lot of the great thoughts in here and recalling my own musical education, I would say dividing the curriculum into a “listening” component and a “creating” component would be critical. In hindsight, it was incredibly formative for me that ear training practice and actual theoretical/sheet music knowledge always came alongside the practical element of sitting at keys and performing the pieces I was assigned that week.\n\nI like the idea of breaking down modern pop structure, I like the idea of covering signal flow a lot. I think you can teach and test signal flow in theory while allowing someone to practice their recording technique by mimicking the song structure of their favorite pop song. I’m not proposing that as an actual coursework suggestion (I doubt most would be ready for that week one) but just as a thought for course organization",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079258198684471446",
    "author": "Josh",
    "date": "2023-02-25",
    "content": "Aight I’m back after eating my body weight in KBBQ. \n\nAfter Matt recommended the Ed Sheeran doc I really took the whole “faucet” analogy to heart. I might have ADHD hyper fixations but I think it’s important to learn how to steer that sort of thing into a way that works in your favor. \n\nWhen I’m working on a song, I’m doing everything I can to fight that and work as fast as I possibly can to get a song done. It’s like, “work time” is strictly for working.  Once the song is done I can reflect on what I didn’t like about the raw vocal takes. What can I make better. Why did the artist have these types of revisions. And then figure that out and bother y’all about signal chains so I can change shit up for the next one. And then just rinse and repeat.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104816830012473394",
    "author": "spectrummasters",
    "date": "2023-05-07",
    "content": "Yes ruairi , I will do . I’m absolutely a man on a mission with this so I will happily share as my understanding grows . And thank you for your correcting my misunderstanding re the “ doubling “ part of my question . Ill review this also. \n\n@David Fuller thank you v much for taking the time to write and explain that . Particularly your explanation of tube and FET circuits . Really great thanks. I suppose in a sense, if we think of the signal flow from mic through analogue electrical circuits , back out to analogue at a listeners speaker......I’m fascinated with how sonic information and its identifying qualities (such as harmonic content of an instrument , and its pitch....and say for a vocalist for example .....how does the character of a consonant .....or a vowel...how is this encoded into an electrical circuit to then again be recreated into an identifiable analogue reproduction upon return to the world of sound waves ? How do we manipulate these harmonics in a controlled way electrically And how did we discover this ? It’s imho mind blowing ......\n\nto your point about the complexity of understanding distortion , I feel like maybe this is what I’m going to need to understand \n\n I need to find the answer in physics as to how can a voice be transmitted as an electron flow, then re rendered as a human voice again .....its  fascinating to think a voltage / current can carry the information that is someone’s voice and the emotion of a performance 🤷🏼‍♂️. Cosmic. I ve much to learn\n\nThank you all for your thoughts/insights/pointers",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121302026098331678",
    "author": "David Fuller",
    "date": "2023-06-21",
    "content": "OK let's start with the basics. \n\nA capacitor in series acts as a 6dB/oct high pass filter, with the corner frequency dependent on the value of the capacitor. In parallel, it acts as a low pass filter.  An inductor does the opposite of a capacitor - high pass in parallel, low pass in series. These, along with resistors, are the basic \"building blocks\" of a passive filter network.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133444663437697196",
    "author": "BatMeckley",
    "date": "2023-07-25",
    "content": "Very much so. Compression, if any, went from individual tracks to busses. Automation went up. Again, listen listen listen to what the mics are picking up. In my case there’s a lot of drums in the vocal mic. Gating caused unnatural volume jumps in cymbals. Had to really listen to the interaction between drum overheads and vocals, and used soothe on the vocals triggered sidechain via the overheads in a very very narrow range. Did wonders.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133456000645611611",
    "author": "peterlabberton",
    "date": "2023-07-25",
    "content": "The sans amp parallel remains a hit or miss move to me, but when it hits it really hits",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1146120619033899139",
    "author": "CK",
    "date": "2023-08-29",
    "content": "I finally got around to watching the Castelli mixes Kaien Cruz JFTR.  That mix is an incredible lesson in so many ways.  When Castelli convinces them to try and remove the mix bus and let it breathe, it was just amazing.  The whole track came to life. I have spent so much time obsessing over my mix buss, to now just delete everything on there.  No more \"safety net\".  Time to step up.\nI have also been obsessed with the new Kimbra album.  The mixes are INSANE.  And then of course I finally look and see.....Castelli did it.  And now that I understand his current view on letting the dynamics breathe, I get why it has that sound.  At least a major factor as to why.\nWhen they described it as feeling \"dangerous\", I realized how I often use my Mix Buss to feel \"safe\".",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1147596002912653323",
    "author": "popaganda.",
    "date": "2023-09-02",
    "content": "That parallel is interesting though, because in a way Woodstock 99 was kinda a death knell for rock music, and represented a different kind of danger/aggression to the original anti-establishment energy of rock. Is that the same energy we’re seeing with Travis and Carti etc…..A fuck it all burn it down energy?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1154022663078039672",
    "author": "Ross Fortune",
    "date": "2023-09-20",
    "content": "For sure. I’m on the move but will be back at the machine tmw. Essentially it’s a bunch of gates, sidechain compressors, and Muteomatics on the comms channels - the zoom feed comes into Tools and triggers a comp on the talkback mic so their voice gets priority, that kind of stuff. Took a few iterations to get right but now I don’t have to think about it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1174036623172849664",
    "author": "sixmissing",
    "date": "2023-11-14",
    "content": "Hey all, new to the group and don't want to come in with my hair on fire here, but I have been having some issues with my rig that I don't think I should be having - so I went hunting through some things in Utilities and saw this in my Expansion Slot Utility, yikes! I have a 2019 Mac Pro (afterburner installed) and am likely pushing too much on the TB bus - anyone have experience with something like this or would be up for talking me through some things to try? \n\nReally appreciate any insights! \n\n-TJ",
    "reactions": 1,
    "attachments": 2,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1184966177336868885",
    "author": "Nomograph Mastering",
    "date": "2023-12-14",
    "content": "And obvious test would be to connect it to your interface directly in an insert loop",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1207859941348605962",
    "author": "SoundsLikeJoe",
    "date": "2024-02-15",
    "content": "That's the best point and why this works!  Especially in mass/distributed.\n\nSo much more has been acquired beyond Rod S and the portfolio in mass will average out.....  assuming values and demand hold strong (or dont) for the assets. \n\nIt's interesting to watch, that's for sure. First time we're seeing how these assets age (insert copyright expiration considerations)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1253062245068574831",
    "author": "cy (sigh)",
    "date": "2024-06-19",
    "content": "used to happen a lot w my clients  til I told them to pause the audio when they write the comment if it's time coded. I found they often clicked again to make sure it was coded and that ended up moving the time. still happens occasionally but way less often. \n\nmight be good if the samply folks let ppl insert timecode manually too. using @0:35 or something like that",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1262813200911695953",
    "author": "spectrummasters",
    "date": "2024-07-16",
    "content": "So true lol It’s like waves h delay insert slap preset at 53%. She rides it out tho ,",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268667571561955430",
    "author": "Edward Rivera",
    "date": "2024-08-01",
    "content": "I totally get what you’re saying ! \n\nI started out with portraiture but wasn’t great with it…which is why i wasn’t a great vocal producer. The stuff I get commissioned for is in the style of street photography, which might be why I’m better at recognising a good take than trying to coax one. \n\nBut for me, overlaps in these crafts can really be extended to many others, and I don’t find the medium itself to be the parts of the Venn diagram that meet. So that’s why I wrote that I’m not a parallels type of person - I won’t naturally be drawn to those sorts of things to push me forward.\n\nWhat _was_ helpful was getting to know myself more and how I work. And that really informed / improved my other pursuits.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1273826561778516071",
    "author": "Robin.Z.V",
    "date": "2024-08-15",
    "content": "Thanks for the tip! I’ve associated this more with the 33609 from the GUI but haven’t used it on busses as I think of strips as direct insert only.  I have and love the 6060 CS and will def revisit this 👌",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1286463288380755998",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-09-19",
    "content": "Sidechaining the static noise from a ghettoblaster to the snare is genius",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1290201108827865190",
    "author": "spectrummasters",
    "date": "2024-09-29",
    "content": "There’s a tricky middle section in this song I’ve got here and my first thought now is ….listen to this middle section in context with the adjacent sections , try to find where it wants to bloom . And use the performance to get there . Six months ago it would have been “parallel everything “ , “clipper “ etc etc",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1305685441910935605",
    "author": "Bryan DiMaio",
    "date": "2024-11-11",
    "content": "Probably could do it by routing the individual app",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1311917774972518410",
    "author": "Josh",
    "date": "2024-11-28",
    "content": "Update: Reddit just saved me $70. Reddit is to my day to day life as this discord is to acoustics and signal chains.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407878032882143282",
    "author": "hyanrarvey",
    "date": "2025-08-20",
    "content": "HMU chandler inserts 5 bucks a track",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "808439390439211068",
    "author": "Zack Hames",
    "date": "2021-02-08",
    "content": "That makes total sense. Was bussing the harmonies to a mono bus with waves J37 with some Saturn and compression - got ish there but still felt too clear and clean. The one mic thing, didn’t think about that!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "816431063894720554",
    "author": "oaklandmatt",
    "date": "2021-03-02",
    "content": "parallel thinking of catchy names!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "822573468100591646",
    "author": "peterlabberton",
    "date": "2021-03-19",
    "content": "K, so, I’m not a mastering engineer, and I know that’s not exactly the focus of this group, but I’m curious to hear some of the most experienced folks on here (i.e. @cian riordan @oaklandmatt and I’m sure others I don’t know about!) chime in on loudness in 2021. For instance, I love love love Jaime by Brittany Howard, and Shawn is phenomenal (AND if shit sounds great who cares what the LUFS meter says), but it is loud as hell. With streaming theoretically leveling the playing field a bit, what are you guys looking for when you get a record mastered? Is there someone mastering right now who is just boldly NOT slamming a limiter and letting things breathe more? Do we care?\n\nI ask partly because, like I think many people, I incorporate a limiter on my mix bus to get things loud and be mixing “into” a mastering chain, and this has led me down a bit of a rabbit hole.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "827264828669820989",
    "author": "David Fuller",
    "date": "2021-04-01",
    "content": "In Pro Tools, a master fader track's... fader... is pre-insert, so you'd change any gain-staging into any plugins you're running on it. I'm not sure how it is everywhere else.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828870876735733761",
    "author": "dylannash",
    "date": "2021-04-05",
    "content": "What are some of your favourite elements of your prod/mix templates? I currently have a separate production/writing template and then another for mixing but I’m trying to hybridise and streamline them a little more to get faster results and hopefully focus on the song. Also, most of the songs I mix tend to be one’s I’ve written and produced as well, so hoping to cut down on session set-up time.\n\nSome of mine are an instant “duck bus”, which I picked up from Ian Kirkpatrick. It’s a pre-loaded aux with something like LFO Tool or shaper box on it, so you can quickly route and uniformly make things side chain.\n\nAnother quick workflow thing I love is having Pro Tools audio playlists with a bunch of reverse sweeps, impacts and other transition fx/ear candy hidden and ready to go in the session, so you can quickly try out a bunch. \n\nI also have the trim plugin added as the first and last plugin on every new track preset, as I use them to quickly manage the gain in and out of each track and so I don’t have to search for them constantly.\n\nOzone Spectral shaper on some music busses and as a replacement for Soothe on the mix bus has also been a real win (thanks Jon!) Although these sorta things aren’t turned on whilst writing as they have a ton of latency.\n\nKeen to hear what you all find useful!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "828971198402527302",
    "author": "Eric Martin",
    "date": "2021-04-06",
    "content": "I route my mix bus to a print bus and can use this as a ref A/B by toggling the input, then if I have a ruff mix or a ref I can choose the playlist of which one then I never process on a master, always mix bus process and print to the print bus, that way I can hear and SEE my mix getting printed in real-time as a check to make sure everything “looks” right as it sounds right",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "835200228147724328",
    "author": "Zack Hames",
    "date": "2021-04-23",
    "content": "That’s a really good idea. I almost never do, though. That said I’m not doing any analog 2 bus processing - so I’m only committing a sound here or there in the session.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "835215563198169148",
    "author": "Eric Martin",
    "date": "2021-04-23",
    "content": "I’ve been dialing in my initial reactions with outboard getting a sound and then when I get there I’ll commit the tracks with outboard and go from there, if it’s BUS processing I print in because I use those as A/B refs when doing revisions so I’m always printing to that Master Audio Track.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "835536810880925707",
    "author": "AlexLayne",
    "date": "2021-04-24",
    "content": "i use it on my master bus with my fusion or my drums with my SSL clone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "839982579959463976",
    "author": "kidcutler",
    "date": "2021-05-06",
    "content": "I have both & the classic clipper, I use Saturate on individual tracks & on my sub buses. The soft-hard slider is phenomenally efficient and allows you to push or pull grittier or less gritty when clients have that desire. I really like it. Classic clipper as the very last mix bus plugin has been going great. I enjoyed the standard clip oversampling but it kills my cpu so I rarely use it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "849325595443724288",
    "author": "Rollmottle",
    "date": "2021-06-01",
    "content": "just buy your tubes direct from manley. they do all the work to make sure you're getting the right one. for the massive passive, they ask for the serial number so they can give you the right tube for the precise rev of the product.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "854741550553628713",
    "author": "chris_donlin",
    "date": "2021-06-16",
    "content": "Disregard the difference in inserts. Obviously that will make them sound different haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "855095725541163058",
    "author": "ALXCPH",
    "date": "2021-06-17",
    "content": "Is it wide? Haven’t noticed. Only heard it in my car so far a few times. I wonder if it’s just the upper bass or also the subs. Guess I’ll have to analyse it when I get back into the studio! I actually remember Pensado talking about widening subs on a parallel track just slightly for some size. Guess I’ll have to try it right 😇  but I’m really not into the clap thing. And it doesn’t really sound intentional. I don’t understand why you wouldn’t want transients on the backbeat in a hip hop context. Doesn’t sound intentional but I also wonder how it would have been missed. So maby it is and my taste just doesn’t align 🐸",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "857389884703375371",
    "author": "David Fuller",
    "date": "2021-06-23",
    "content": "Yeah, my warm bus comp.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "857404433540841503",
    "author": "alecdibell2",
    "date": "2021-06-23",
    "content": "@David Fuller @David Fuller  i’m only getting a few db of reduction on my bus comp at 30ms attack and quick release, and a db on my soft clipper. Might try something more heavy handed on a mix I’m starting. Are you dialing in your threshold early in the process for the 8db? Or bringing in your comp later in the mix?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "861656937296953384",
    "author": "Slow Hand",
    "date": "2021-07-05",
    "content": "In interviews Aphex Twin has talked about how he's regularly switching up his gear, routing, layout, etc and giving himself multiple stations to work at that encourage different types of music. Sometimes only for a single track. It seems to be a big part of his process. So you're certainly not alone.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "865021438432247819",
    "author": "David Fuller",
    "date": "2021-07-14",
    "content": "the routing makes me want to fucking die",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "866634869755871232",
    "author": "frankieharper",
    "date": "2021-07-19",
    "content": "Alright guys, i’m currently mixing a track for which the reference I’m using is Jungle - Busy Earnin’ \n\nThe Jungle mix is very sparing in the low-lowmid department, it’s a big part of the sound- just out of interest really - when people are using reference tracks with a pretty bold characteristic such as this, do you ever hit the mix bus as a flying off point (big low shelf cut gets me way nearer to where I wanna end up) or take the time to process everything individually? \n\nNice one guys, this seems like a great community I’m glad I’ve stumbled across ✌️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "875720884227305572",
    "author": "isaac joel",
    "date": "2021-08-13",
    "content": "Depending on the version of Ableton there are limitations on how many send/return tracks you can have. However you can select multiple tracks and then right click and \"group\" them together to make a bus 😉",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "889930580525973534",
    "author": "mixedbywong_my",
    "date": "2021-09-21",
    "content": "Was working on the computer , when one of the plugins I wanted to remove from an insert crashed Cubase. After that , I force restart on the MacBook pro via the power button . When  the computer restarted ,  the desktop folders are missing and it’s still in the directory somewhere in the system drive but it was renamed to Desktop - MacBook Pro (originally it’d be only Desktop)\n\nThen the Finder kept freezing intermittently 🌈 ,  check activity monitor , shows “mds” & “mds_stores” taking up a lot of cpu for no reason (40-50%)\nI’ve restarted the MacBook twice and it seems to be the same.  \nMy only possible solution would be restoring a time machine backup . Do I need to deauthorise my ilok licenses before i restore the backup . \nHas anyone possibly encountered something like this before ? Really sucks when there’s few mixes happening at the same time  and this happens. 😢😢😢",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "908421860943876168",
    "author": "kc_kasey",
    "date": "2021-11-11",
    "content": "Serial # for mic - #100841 - just in case",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "943968760967094373",
    "author": "ALXCPH",
    "date": "2022-02-17",
    "content": "At the moment I have done all the basic midi, routing, macros and automation clips. If anyone is interested in the template just hit me up 🙂\n\nAlso any tips appreciated.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "976596297064787968",
    "author": "ehutton21",
    "date": "2022-05-18",
    "content": "i can’t lie, i used to live and die by what Jaycen said about processing and izotope 4, but when i’ve actually utilized izotope 9 for “tonal” sculpting at the 2 bus level, i’ve found it much more versatile and inventive than what he stated. i guess that’s classic “trust what you hear” type thinking but long story quite short, i think he’s a brilliant mixer but i take his techniques on a calculated level",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "976597676630097960",
    "author": "Maxim",
    "date": "2022-05-18",
    "content": "Yeah I’ve tried to integrate so many techniques other people use but I’ve always had the most success just keeping it simple and sticking to what I’ve come up with myself using my ears. That being said, I find his template routing to make a great starting point. And some things like not being a afraid to (generously) use a compressor to control a sound have helped me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "977327917799469116",
    "author": "cian riordan",
    "date": "2022-05-20",
    "content": "Pretty soon we're going to have side machines with 20 year old operating systems installed and lots of I/O so people can do roundtrips to it from their modern DAW to use old ass plugins.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "982690733976866856",
    "author": "ehutton21",
    "date": "2022-06-04",
    "content": "there’s also a very simple routing page for it up on their website which is interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "983390938758000721",
    "author": "blanco",
    "date": "2022-06-06",
    "content": "don’t do it bro! hahaha fight the urge. I like the 800 sound w/o boost. those sony’s so crunchy don’t need added bite imo. i prefer the signal go in raw and get processed in vox bus inside PT",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "998313357679542432",
    "author": "Jeremy Klein",
    "date": "2022-07-17",
    "content": "Oh I did not know that. All the plugins you get have one-off methods of authorization and serial codes so Im not sure how those plugin manufacturers would be able to keep track of your MWTM subscriber status. And the MWTM site doesnt say anything about plugins deactivating after your subscription is cancelled",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "998601137412395068",
    "author": "Zack Hames",
    "date": "2022-07-18",
    "content": "Yes, precisely. It lasted me almost a decade and was still a good monitoring setup and headphone system. Lots of I/O, didn't sound too bad. I ran that with my MOTU 16A, then I finally dropped the focusrite because I was sick of dealing with the software and I wanted a simpler rig.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "998673117805301760",
    "author": "Rollmottle",
    "date": "2022-07-18",
    "content": "Anybody have a wireless keyboard (the typing kind) they like? I'm looking to replace a 15 year old Logitech, mainly to not have to rely on the bulky combo USB/serial transmitter it came with. (This is the one I have now https://www.amazon.com/Logitech-967557-0403-Cordless-Desktop-S510/dp/B000AY2L3U)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1005545672340156548",
    "author": "Calvin Lauber",
    "date": "2022-08-06",
    "content": "And the master bus 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1005557640044232834",
    "author": "chadwahlbrink",
    "date": "2022-08-06",
    "content": "It was literally my first plugin in the mid 2000’s and I have used it ever since. \n\nHere’s Shawn talking about it on his mixbus for Alabama shakes \n\n> mastering track, with a complicated plug–in signal chain of UAD Studer A800, Waves Q10 EQ, PSP Vintage Warmer, Waves Linear Phase Multiband, UAD Precision Multiband EQ, Waves L3 Ultramaximizer and another Vintage Warmer, and below that a mix print track.\n\nRunning two instances on the master alone 😂 \n\nhttps://www.soundonsound.com/people/inside-track-alabama-shakes-sound-color?amp",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1007420757783093329",
    "author": "shamash",
    "date": "2022-08-11",
    "content": "If anyone wants to emulate windows from mac I know there’s a program called parallels that works kinda like a virtual box",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017214668944711761",
    "author": "1ggy",
    "date": "2022-09-07",
    "content": "Remove blu-ray and insert atmos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1021988970378317874",
    "author": "cian riordan",
    "date": "2022-09-20",
    "content": "Does anyone know how you actually spell 'bus' in the context of audio routing. Is it 'bus' or 'buss'? I just realized I've gone back and forth for almost 2 decades now and don't really have any rhyme or reason for why I name it one or the other, but I see both being used all the time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1021994487125389332",
    "author": "peterlabberton",
    "date": "2022-09-20",
    "content": "It would seem bus makes the most sense… so the question is where that extra “s” came from. And this is coming from someone who tends to go with “buss”. 🤷🏻‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1021999198075375697",
    "author": "Will Melones",
    "date": "2022-09-20",
    "content": "But if the plural of bus is buses, there seems to be even more support for one S",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1022013109042429962",
    "author": "NoahNeedleman",
    "date": "2022-09-20",
    "content": "Ok:\n“Buss” when talking about the Master (e.g. 2Buss) this helps me denote the the processing part, as opposed to an actual Master or just the fader portion etc… \n“Bus” when talking about any other aux routing situation. \nThis is likely arbitrary, but my brain is attached to it now ¯\\_(ツ)_/¯",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1025897754993635408",
    "author": "Slow Hand",
    "date": "2022-10-01",
    "content": "Clever. *And* it has parallel processing capabilites ala Ableton racks? My curiosity has been piqued.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1025901176480346173",
    "author": "ehutton21",
    "date": "2022-10-01",
    "content": "That’s def the ableton parallel processing idea. Love to see it being brought to other daws. I much prefer parallel tracks like in ableton to using sends a ton",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1025901349013032961",
    "author": "ALXCPH",
    "date": "2022-10-01",
    "content": "Parallel processing is might years a head in ableton",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1036654776932388884",
    "author": "Yoel",
    "date": "2022-10-31",
    "content": "What’s the smoothest way to transfer plugins from old laptop to a new one? \nI can’t find all my serial numbers and installers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1044583241409118239",
    "author": "karlemilhald",
    "date": "2022-11-22",
    "content": "I just bought Big Clipper, and I love it!! The way you can blend clipper/limiter is amazing to me. The EQ section (as far as I've read and experimented) is a sidechain ONLY for the limiter. Ex: if you'd pull down all low freq's, it would react to everything else, but the lows would still be there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1044716240448520353",
    "author": "Calvin Lauber",
    "date": "2022-11-22",
    "content": "Is there another set of speakers or headphones to check if the issue is consistent there? It kinda sounds like a bad tweeter with it only being in one speaker. Also possible check any patches/cables going from monitor section to the speakers. If you flip the L and R pans of the master bus does the issue stay in the same speaker or pan?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1047236347930353664",
    "author": "Will Melones",
    "date": "2022-11-29",
    "content": "Meters and mix bus plugins would be cool!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1056321884217675906",
    "author": "Deleted User",
    "date": "2022-12-24",
    "content": "but it was a cultural shock when the bus dropped me off in the middle of the road. lol 😂 almost got hit trying to get to the sidewalk",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1059511170949709944",
    "author": "spectrummasters",
    "date": "2023-01-02",
    "content": "Yeah my understanding is it’s their version of a soothe / gullfoss. I don’t like leaning on either of those to solve problems but I do use them for a little polish up on vocals and the music bus . I’ll be interested how the isotope one performs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067967723486859294",
    "author": "ALXCPH",
    "date": "2023-01-25",
    "content": "But it doesn’t have nearly as much I/O",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067971388448723026",
    "author": "ALXCPH",
    "date": "2023-01-25",
    "content": "Does UAD have a high pass & low pass on all its I/o within hearing range? Is that what some people are hearing and not liking?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070130515069378710",
    "author": "Rollmottle",
    "date": "2023-01-31",
    "content": "like Michael Scott having to insert \"that's what she said\" at every opportunity, no matter the context",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1074425867893227521",
    "author": "Ross Fortune",
    "date": "2023-02-12",
    "content": "That definitely comes into it, but in these instances it was right from the outset. Like the client would walk into the room and be like \"bitch, get me my aux cable\" (not actually, but they might as well).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1077026608529023046",
    "author": "gagsmile",
    "date": "2023-02-19",
    "content": "and all the preset sounds kinnda the same to me even tho they made like 3000 of them\n\nIm actually trying that dual shift thing and its pretty cool to be honest if you bus it at low level",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1088914724244181022",
    "author": "spectrummasters",
    "date": "2023-03-24",
    "content": "Hearing your voice in a MTWM episode asking Jaycen a question would feel like two parallel universes collide . I enjoyed your dale Becker interview also btw . 👍🏼you’re defo making cool content man",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1098330016607121489",
    "author": "noahc",
    "date": "2023-04-19",
    "content": "Thanks - Monterey 12.6.3      Glyph brand, Studio Raid TB. Serial number on bottom is half rubbed off…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1100999978199023626",
    "author": "Slow Hand",
    "date": "2023-04-26",
    "content": "I can't stop thinking about this idea of \"Why don't you play something that people actually like?\"\n\nI personally wrestle a lot with the idea of making music *for* other people. It's simply not very high on my list of priorities. I'd say I'm self-centered in how I approach making music. I'm out to make stuff that *I* want to hear. Things that aren't being represented elsewhere. Flavors I've never heard. I'm not aiming for a broad appeal, but I'm also not shying away from it. I'm just not much of a people pleaser in that regard. I'm in it for the discovery and the exploration and the pleasure of making something that excites me.\n\nI think often about that Steve Jobs sentiment of \"People don't know what they want until they see it.\" I think about that a lot. I trust that if I follow what feels good to *me* then I'll get something valuable out of it, and maybe it'll connect with others. If not, that's alright too. I'll know that I've made something that feels great.\n\nI sometimes worry about this because I've always felt that it puts me at odds with a lot of people out here trying to make excellent records. Sometimes our goals will align, but I just don't feel motivated by the need to appeal to a lot of people and that can also make us diverge.\n\nI guess what I'm trying to say is that there's a different kind of taste that I'm trying to cultivate. It's one that runs parallel to the kind of taste that is good at appealing to a large number of people. I feel as if I'm aiming at an entirely different goalpost from people playing the other game. I want to tickle people in a way that they didn't know they were capable of. That's what's thrilling to me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104920810671583232",
    "author": "Edward Rivera",
    "date": "2023-05-07",
    "content": "M'y 2015 is still in pristine condition. It just can't handle the plugins these days. Once a mix is near the end with fx routing and bus stuff, it starts to cough a lot. I should probably start printing more",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105586269741928518",
    "author": "spectrummasters",
    "date": "2023-05-09",
    "content": "Dope. I love this stuff man . It’s so illuminating gaining a deeper understanding of the tech we use ......I’m defo just scratching the surface at the moment but have a number of things in mind to research after this.......particularly who developed the tech/science used in the first microphone and then I’m going to sort of follow the signal chain from there ....",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1118580426525646978",
    "author": "Nomograph Mastering",
    "date": "2023-06-14",
    "content": "If I had to describe a trend it’s “even 2 bus analog is a PITA now, plugs are good enough”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1118658947226804284",
    "author": "Nomograph Mastering",
    "date": "2023-06-14",
    "content": "Channel and bus comps are very similar to older series (component and value swaps but the thrust is the same)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1118668105665757234",
    "author": "JakeTB",
    "date": "2023-06-14",
    "content": "While we're on the topic of famous bus compressors, what's the deal with the 33609 revisions? I've used one that blew my mind and a few that were underwhelming, and no idea which was which.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1118673339993559040",
    "author": "JakeTB",
    "date": "2023-06-14",
    "content": "Visited Vance Powell's spot once and he was using some model to great effect as well. But I didn't get to play with it or hear on other sources (his was parallel drum bus, I liked it on a piano and stereo acoustic) to see if it had the same vibe.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1119008336180957255",
    "author": "spectrummasters",
    "date": "2023-06-15",
    "content": "Good evening / good day to you ruairi . Just a quick one , I wanted to essentially thank you for sharing your appreciation of rx here as much as you have , making mention of your use of the spectral repair tool. I’ve been paying attention and taking notice and reflecting on what it is I’m trying to achieve with de Essers and Eq’s on mix elements  etc and this morning I just wasn’t getting the vibe I wanted from a vocal . It just wasn’t natural anymore . It felt perfectly bland . Your rx comments came to mind and I removed pretty much all the corrective inserts , opened up rx and between the magic tool (I found this good for the high end ) and the paintbrush (on the low end /plosives ) I pretty much sculpted the natural sound of the vocal all in rx , without any distractions. Just.....the sound ....of the vocal. Having finished and returning to the mix , it was everything I’d wanted with about a third of the plug in inserts. I’m a major convert to this upstream, approach . In this case it was a vocal but I’m intrigued to apply the principle on a master. The inspiration came from yourself. Thanks man .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120551575522390126",
    "author": "peterlabberton",
    "date": "2023-06-19",
    "content": "Into track spacer sidechained to white noise",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120734847997050921",
    "author": "bobby k",
    "date": "2023-06-20",
    "content": "gold clip = cool parallel kick drum sound. haven’t connected with it on the two bus though and confused about the hype. the roll out was almost as mockable as god particle. no disrespect to ryan or jaycen, they seem like great people and i bought their stuff nonetheless",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120737414420369419",
    "author": "hyanrarvey",
    "date": "2023-06-20",
    "content": "I could see it ripping in parallel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120786834503516271",
    "author": "bobby k",
    "date": "2023-06-20",
    "content": "been a bit buggy for me this year but still rips on kick in parallel.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120865238577860668",
    "author": "bobby k",
    "date": "2023-06-20",
    "content": "no wonder your flutes are always ripping. coulda sworn it was gold clip in parallel.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121310849580154991",
    "author": "David Fuller",
    "date": "2023-06-21",
    "content": "The last filter in the Pultec is the LF boost/cut. The low cut has its capacitor bank connected in series to the output; The low boost has them connected in parallel with the output, with the output going to ground. Both are again acting as very broad shelving filters, though with *slightly* different center frequencies - which is why the \"pultec LF trick\" exists",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1125095759579189379",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "I only agree halfway. \n\nWhat does more value mean in art? How can you be more valuable than to make better music? All of that is vague. \nWe all are working on being better, but not all of us are good. \n\nThose who aren’t good won’t make money- but I think those who are decent should make at least good part time income. \n\nHow good you are is only quantifiable with stream counts. One stream count isn’t more valuable than the other. There isn’t really a straight parallel in what it means to be valuable. \n\nA song that saved someone’s life from suicide is a one stream count, a song that you didn’t know was playing while the phone was muted is also one stream count. they are both worth $.00437. I’m not saying a song that saved life should make more money. But was that more valuable than a song streamed while the phone was muted? Clearly it is",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125096949717143582",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "well… that is my point. value’s not really parallel to the money",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125127620674212012",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "how our clients come up with money to pay us is important in order to stay sustainable. because we’re technically in a business of helping another business (artists or labels) make money. \n\nhuge part of our values are tied to our ability to make them money. so of course it matters. \n\nAnd our ability to make them money isn’t directly parallel to how good we are at what we do. If they made money, it’s probably because everyone in the team nailed it. But if it’s not making money- that’s not because we sucked at our job. \n\nWhich is why I started getting more involved in artist branding, I wish I could offer enough insights in building a fan base and marketing side of things. Because then I can really be more in control of the situation. \n\nbut even then- there’s not enough money in the market. there’s a long and steep valley of despair between climbing from bottom to top. I do think if there was more money in the pool, the valley of despair wouldn’t be that bad. and in order to pull more money in, crowdfunding could be one of the ways. I wish I can come up with more solutions…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125243092786745384",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "I don’t think they parallel… and no that’s not what I’m doing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1126938702476738620",
    "author": "Deleted User",
    "date": "2023-07-07",
    "content": "or when I want to sidechain lower frequency off of the mid band of another instrument. But ever since getting shaperbox 3, I use that for that purpose now since I can dial it in more precisely",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1126949968121442436",
    "author": "shaunobi",
    "date": "2023-07-07",
    "content": "Cool ideas @Deleted User - I side-chain but your whole \"unmask by triggering off HF for LF compression\" is great. I'll have to try that. (I sometimes sidechain Soothe with a similar thought in mind - frequency unmasking - but I'm not sure I like how it sounds and mostly undo it. This sounds a little more promising and is something new to try.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1128587518904905799",
    "author": "AJ",
    "date": "2023-07-12",
    "content": "In my life and circles, I've seen more of the folks who have had a rough go. Which just turns the conversation into anecdote vs anecdote... and it's why anecdotes tend to be viewed as a questionable source of evidence.\n\nI get your point though. There's no doubt that parenthood can be a truly enriching and unparalleled  experience. I'm truly glad that it has been like that for you, and sincerely wish that there was a guarantee (or evenhigh likelihood) of that bring replicated for every person. My issue has to do with saying that experience is the norm. Since we've established there's no clear way to quantify something like this, it's still a gamble at the end of the day. One that I can't fault anyone for taking one way or the other.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1128706430426431508",
    "author": "spectrummasters",
    "date": "2023-07-12",
    "content": "It does sound good , the old 5 k ssl shelf boost . I  think I tend to mix bright so I try to not use it too much And am  doing spectre etc . Oh btw re : your harmonics questions here , forgot to say I know people dog waves but nls is really handy , mixing up instances of the channel and bus versions and some little radiator really gets things cooking imho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133437495716102225",
    "author": "spectrummasters",
    "date": "2023-07-25",
    "content": "Riiiiiiiight, I get what you’re saying . It’s the boss , not me . I think I discovered this yesterday ......I re tracked the kick and snare tracks through my outboard bits and thought they sounded amazing .......brought them up in the session though and it was like , yeah ...well that’s fucked it lol! My ears said yes, the phase said no. I noticed cian mentioning he doesn’t use compression much on individual drums but uses parallels for comp and distortion and am following that approach now. What did you opt for in the end re : compression ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133450225432932372",
    "author": "spectrummasters",
    "date": "2023-07-25",
    "content": "Hi cian , I was looking at your mix template from lwmr for inspiration / guidance this morning and I was wondering what are your two sansamp buses offering you / used for as opposed to the distortion parallel , I’m not v familiar with using sansamp so I’m intrigued that you have two buses for it (please feel free to ignore if it’s asking you to giveaway too much of a personal technique )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1135140165950640178",
    "author": "spectrummasters",
    "date": "2023-07-30",
    "content": "So , I don’t really watch tv or anything just music related or science related docs . So (and I know it catches shade ) MWTM is my Netflix bro . Whether it’s downtime or I have a mix to do …..there’s so many great mixers on there , Shawn Everett , andy Wallace , tchad Blake , etc etc etc ….just hours of conversations I love to listen to about a song and what brought it to completion . Over the last year or two they’ve really stepped up the frequency of new content and the deals they have made with plug in companies and firms like samply and others , it nearly pays for itself to be fair . There’s a lot going for it imo , not least to mention …..it being a good consistent source from people who know their onions . Shawn Everett’s tape / match eq technique ….that jacquire king kick/bass vu meter balance thing , the andy Wallace ambient drum triggers ….schepps and his dual mono 1176 back bus 🚎 ….even al Schmitt in capitol mixing with no eq …..these have all been really inspirational ideas and convos I’ve seen from there . At this point they’ve got so much content on there bro ….and even the JJP don’t send me 48 kHz files convo 😂. What’s not to love",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1141826733755072573",
    "author": "cian riordan",
    "date": "2023-08-17",
    "content": "(I live in Pasadena and walk, bike, train, bus most places I need to go with ease, fwiw)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1141956677797679134",
    "author": "cian riordan",
    "date": "2023-08-17",
    "content": "Any Squarespace gurus in here? I'm looking to refresh my webpage and don't want to pull mine down while I work on it. What's the best avenue for building one in parallel and then switching it over to my domain when it's done?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1141959461708242967",
    "author": "peterlabberton",
    "date": "2023-08-17",
    "content": "I'm trying to find it but I seem to remember you can set different themes/templates for individual pages, too, if you're building something in parallel while things are live",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1150870738388127834",
    "author": "spectrummasters",
    "date": "2023-09-11",
    "content": "....I’m currently going into  another electrical engineering rabbit hole that’s got me learning the details of the routing of the old SSL 4000 desks (just by online docs and discussion ) and I have to say when it comes to signal flow , those SSL engineers were bloody clever .....With the whole in line thing and matrix and float etc etc .....it makes me realise how much of our daw s mixers and the routing options we have available ......we owe the concepts to the brain waves of electrical engineers in the 70s , they really thought shit through !!! TIP O my hat to the-electrical  engineers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151020019036196915",
    "author": "spectrummasters",
    "date": "2023-09-11",
    "content": "😂 interesting reactions gents . Re rhe caps…..one of my goals is to be able to read a schematic for one of these and understand the physics and electrical processes at work . IMHO they are like a maze of genius . I’m caught up in the concept that electrical engineers were tapped into musical needs and concepts so much that they made legacy mysical momentd possible ( Ye olde Phil Collins SSL LMC drums scenario etc ) . Decades later in the digital world of an instant studio in a box, it’s not really obvious that some super bright tech came up with the routing ideas and then created the electrical circuitry for it . And then these techs would sort of partner the recording / mix engineers in a sort of perfect marriage of art and science . Love it !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151292747882450995",
    "author": "Zakhiggins",
    "date": "2023-09-12",
    "content": "For this Melodyne into auto tune trick, do you ever just put melodyne as an insert in pro tools and put auto tune after it? I know you like to use Melodyne standalone, but could this work better as an insert? So you don’t have to keep figuring out the algorithm etc as you mentioned",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1151309838429736960",
    "author": "Deleted User",
    "date": "2023-09-12",
    "content": "that’s one thing I wish standalone would support. If I could audition it through some plugin inserts it would be dope",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1151548266090082445",
    "author": "Josh",
    "date": "2023-09-13",
    "content": "Yeah I’m basically there. Just curious because a few things like making a routing folder and routing the tracks to it is super convenient.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1152696973728698398",
    "author": "spectrummasters",
    "date": "2023-09-16",
    "content": "just to continue to create a landscape the sounds are happiening in, the bus verbs have pre-delay so its not over the attacks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1153773145933746216",
    "author": "samvalentine",
    "date": "2023-09-19",
    "content": "Did this recently with Zoom. You can route pro tools aux i/o as an output into zoom and select it as your audio source in zoom. Worked better than I expected honestly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1153803267785117696",
    "author": "Ross Fortune",
    "date": "2023-09-19",
    "content": "If you like, I can share a template that has all the comms routing set up that I’ve used with good results.\n\nI’ve even had it with two talkback mics - one at the back of the control room for a director, all worked smoothly.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1160755674452598854",
    "author": "hyanrarvey",
    "date": "2023-10-08",
    "content": "I do like trying to recreate classic amp settings and the whole entire signal chain to learn from",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1161482233639604324",
    "author": "markmaclure",
    "date": "2023-10-10",
    "content": "That is 100% the answer it’s just really tricky to implement. I suppose you could filter out everything above the fundamental of the bass/mix/whatever and build parallel harmonics off that fundamental, but it gets tricky adding them back in without it getting phasey. You would also have to be very specific about which harmonics you add back in so they don’t stick out too much. \n\nThis is super interesting to me because the fundamental that is perceived isn’t actually there! So it could have big potential for headroom/loudness if I could understand this better. \n\nHowever, I’m also hearing Ruari’s voice in my head asking me if this is worth the deep dive or if it’s just better to just use Rbass and get on with making songs haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1173130661561905152",
    "author": "alexstein",
    "date": "2023-11-11",
    "content": "Do you all think it would be possible for someone to design a platform similar to muso ai where you could manually insert all your credits with some sort of verification process to prove it’s your work? Also where the platform would count your streams from all possible DSPs and not just a select few?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1173332087709896807",
    "author": "spectrummasters",
    "date": "2023-11-12",
    "content": "Noiiice, I need one of those !!. I had my own mental overload in the current day job , Friday . I do routing all day then go home and do more routing in my daw ! (I clearly love working with signals lol)!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1176293855537148004",
    "author": "NoahNeedleman",
    "date": "2023-11-20",
    "content": "My nerdy ass loved NPR. give me RadioLab & Invisibilia & Serial all day long",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1184853944191692921",
    "author": "masteredbyjack",
    "date": "2023-12-14",
    "content": "Monterey...but I'm using a vitural input, it is some 3rd party thing (I think inject I/O?) I had installed when I set up my machine, I had used to get a handle on what levels streaming was playing back at (recording in the waveform from Apple, Spotify, etc) to study translation of masters. For the life of me can't remember how I set it up, just to say that it can work.\n\nQuicktime --> New Screen Recording --> Shift + Command + 5 gives you the options on the screen, select the virtual input that is getting your computer internal audio and roll. Quality *seems* worse on the recording to my ear, but I could be wrong",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1184934553182290051",
    "author": "chrisyonge",
    "date": "2023-12-14",
    "content": "Does anybody have a VT7 in here or experience with one? I bought one and am finding it slightly confusing, the Manley Vari-Mu I demoed can be inserted to my mix and I have 0 issues vs the Fearn tubes blow up way easier… I have to drop my mix like 10 db just to get the signal to pass through clean with gain at 0",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1184955507568558152",
    "author": "chrisyonge",
    "date": "2023-12-14",
    "content": "I’m inserting it on my 5060 Rupert neve console",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1184955641601728572",
    "author": "chrisyonge",
    "date": "2023-12-14",
    "content": "So it’s summing my mix and then I insert it in the chain on the console mix bus",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1184965526305374228",
    "author": "Nomograph Mastering",
    "date": "2023-12-14",
    "content": "With your wiring, or your power supply, or your gain structure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1184965798343753778",
    "author": "chrisyonge",
    "date": "2023-12-14",
    "content": "So when I insert it, it’s definitely being hit hard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1187590611621130362",
    "author": "Bryan DiMaio",
    "date": "2023-12-21",
    "content": "So macOS running parallels to run VMware to run leopard to run logic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1187804036632694905",
    "author": "Will Melones",
    "date": "2023-12-22",
    "content": "Yeah, that’s what you just don’t know until you try. Some might reference the serial number of the HDD. It’s less likely, but I’ve done this cloning process in a few different scenarios, and it’s never exactly plug n’ play. Just be ready for anything.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1206418104050257952",
    "author": "Rob Domos",
    "date": "2024-02-11",
    "content": "I once had an ilok die the day I bought it and then another one died a month into me having it. After both of those happened I swore off ilok for while and friends swore to me that they never had a problem and said it must be user error. \n\nAfter some reading, it turned out that there was an undisclosed problem with bus-powered hubs killing them and I had been connecting them with a bus powered hub, so I gave ilok one more go and connected it straight to my mac and I haven’t had a problem in years",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1206743238765973586",
    "author": "Nomograph Mastering",
    "date": "2024-02-12",
    "content": "A lunch this weekend brought to mind the parallels between servers and our various jobs as record makers\n\nA completely neutral and personality free server gets the job done, but doesn’t elevate the experience, doesn’t bring that warmth\n\nAt the other extreme some servers make it all about themselves, regaling you for 5 minutes with a personal anecdote while the entree goes cold\n\nAssuming competence at the job neither of these extremes seem optimal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221228068195274762",
    "author": "Calvin Lauber",
    "date": "2024-03-23",
    "content": "If you print your mix to a final stereo track, I will change the input of that track from whatever master bus output , to “MON L/R “ - which is the direct feed output of the Apollo. Then I mute that track and hit play on Apple Music (normalization off!) to print. I just record reference tracks straight in as part of the playlists of final mixes, that way when I’m in input mode I’m listening to my mix, and when I take it out I hear the reference. Instant A/B",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1228143956437500004",
    "author": "LAPhill",
    "date": "2024-04-11",
    "content": "Maybe there's some parallel to art history - One can appreciate a piece of art for whatever reason, but knowing the context in which it existed, or the backstory of the artist, can unearth much deeper connections.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1229143827835785388",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-14",
    "content": "Fascinating convo guys. Don't really wanna insert myself but re: this - could you give a few examples of real moments from old style icons that felt more real than what you'd see today? To make it a bit more concrete",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1229484600640667678",
    "author": "SoundsLikeJoe",
    "date": "2024-04-15",
    "content": "The early multitrack live setups from The Dead were famous for capturing live albums that had a great mix In that (and some other cases) bands were bringing a split sound team....  but those are ancient days. The digital FOH era has so much going on and is intertwined so tightly with the performers...   does make sense. There are so many more routing features now too...  FOH is probably sending a much larger iso multitrack count post-fader vs groups or mains.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1229487958000930926",
    "author": "JakeTB",
    "date": "2024-04-15",
    "content": "I’ve seen better results offloading broadcast to monitors or to post-fader FOH matrix. Neither are optimal (again, dedicated broadcast human best), but at least you have somebody dialing in your broadcast with care ahead of time who MD and team can interface with.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230220961295372408",
    "author": "Iwan Morgan",
    "date": "2024-04-17",
    "content": "How do you feel when a service you like and respect gives a platform to someone who is serially abusive? There’s always been dodgy people in rock n’ roll, i’m just trying to gauge my initial gut response of disgust. Am I being too over the top in this reaction or do we have the right to expect better from trusted outlets? Not naming right now, just trying to wonder on what is fair to expect these days.  Personally, it’s prompted me to take my business elsewhere.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230225340274573333",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "Serially abusive is a very vague term",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1231316082011144274",
    "author": "Nomograph Mastering",
    "date": "2024-04-20",
    "content": "There are some kinds of parallels with Madonna or U2 or precious global smashes but really she’s riding the cutting edge of fame, art and the global consciousness",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1231684510668689501",
    "author": "Nomograph Mastering",
    "date": "2024-04-21",
    "content": "But when I see MS EQ on a mixers bus I’m confused",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1231698821545721926",
    "author": "spectrummasters",
    "date": "2024-04-21",
    "content": "Compression , light g bus style",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1231717671012405308",
    "author": "Deleted User",
    "date": "2024-04-21",
    "content": "are you referring to how the compressor may be listening from a linked sidechain or it may not be?\n\njust curious how it’s not binary",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1233179220910407680",
    "author": "Josh",
    "date": "2024-04-25",
    "content": "That song was the soundtrack to my bus ride to 7th grade.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1238644734377988236",
    "author": "cian riordan",
    "date": "2024-05-10",
    "content": "Makes sense… he uses a lot of hardware inserts in his setup. HD interfaces are the only sane option in pro tools for doing this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1248642442056564851",
    "author": "Eric Martin",
    "date": "2024-06-07",
    "content": "like routing the output of a channel somewhere other than the main output, took me forever to actually figure that out and still have trouble with that if I go more than a week without using the software",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1260068868454482031",
    "author": "popthetrunk",
    "date": "2024-07-08",
    "content": "Like @Bryan DiMaio said, the MacOS scaling is great. In general you want more ppi(pixels per inch) for better quality, you can figure that from the screen size and resolution. I have a 57” 4k tv I’ve used as an aux display before at ~8’ that’s pretty good. The default scaling(HD) is fine for most audio work at that distance, but would probably go down a notch scaling wise for extended text/admin stuff or get a bigger tv. You need HDR on the tv and to enable in system prefs for it to look right with the scaling, otherwise it’s a bunch of banding and moire that’s really annoying ime.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1261558089153249371",
    "author": "JakeTB",
    "date": "2024-07-12",
    "content": "I've been reflecting on this in the mix world, especially with low-budget indie projects. Lately, I've had more and more success from deleting producers' 2-bus processing. Seems like the real work happens in the session, and things often get thrown on the master bus at the end as an afterthought",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1267572044187308204",
    "author": "Bryan DiMaio",
    "date": "2024-07-29",
    "content": "I have a stream deck + that I use with my Lynx, some of the MIDI routing on the stream deck side was weird but not terrible at the end of the day, and it's been pretty reliable",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267639013523591329",
    "author": "Bryan DiMaio",
    "date": "2024-07-29",
    "content": "I’ve used it in a pinch but can’t rely on it to be completely bulletproof like native interface stuff from Lynx or RME is. I just use the features on my interface but may move to one of the newer RME or Metric Halo boxes due to *where* in the signal chain you can put your calibration/crossovers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267641880028643401",
    "author": "Tristan",
    "date": "2024-07-29",
    "content": "That was certainly my first impression clicking about. I feel like it has a lot of promise, but was quite cumbersome to integrate and very clunky, I just think most software should be pretty intuitive to get going. I loved the idea of getting into it for the speaker management stuff, access to plugins etc. amazing on paper. I simply want to have 4 discrete paths to my ATC’s and stereo subs and it wouldn’t let me customize a simple 4ch layout to do that where it would enable bass management panels to handle crossovers. I had to select a 5.1 or 7.1.x channel at a minimum config then jerk around with routings to get it going places with crossover points. Feels like a missed opportunity. I think I’m gonna hit them, I do think it has legs.\n\nYour point about additional latency was also very well noticed. Really could be great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1268660889758990487",
    "author": "Edward Rivera",
    "date": "2024-08-01",
    "content": "Other than what Cian correctly pointed out, honestly no. I’m not a parallels kind of person. I think you can draw on principles and work ethics and allow them to take you places. I only started taking photos 7 years ago, so I’m still new, but photography and audio are nothing alike. The latter is invisible !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1273746381655507004",
    "author": "spectrummasters",
    "date": "2024-08-15",
    "content": "Also , Your parallel distortion set up for drums was such a game changer for me . (Thanks for sharing from me 2 )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1274425719732047873",
    "author": "Chad Rodgers",
    "date": "2024-08-17",
    "content": "Very simple setup via their app too. Throw it on the mix bus and it automatically routes the audio to the stream. \n\nI haven’t! Do you rate it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1281601865770995742",
    "author": "Josh",
    "date": "2024-09-06",
    "content": "I still don’t know how I feel about it. Happy to see them back. Feels more like coping/overcoming grief. Like when the ghost inside came back after their bus accident.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1283900353695191143",
    "author": "Nomograph Mastering",
    "date": "2024-09-12",
    "content": "Long before I had a car, like 30 years ago a buddy and I would bus to dingle for a night or two. Our favorite spot was a little pub called Hannie Agne’s. The Keg sat right under the bar and the pints were divine",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1284929022261985332",
    "author": "Zeuswayn3",
    "date": "2024-09-15",
    "content": "The parallel routing abilities on the helix are so cool.\n\nYou can have a crazy reverb chain with modulation and delay and then have that dry/ wet mapped to the expression pedal. I always liked their rotaries",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1293071775080382496",
    "author": "thegreatcarsoni",
    "date": "2024-10-07",
    "content": "You can also change the Audio MIDI Setup (on mac) output for the Apollo to a virtual channel pair that will pass system audio out without needing to change the UA routing. Then I like to set the output of my DAW to another virtual pair so I'm not always changing levels between spotify/youtube/whatever and Pro Tools.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1310502279538933872",
    "author": "thegreatcarsoni",
    "date": "2024-11-24",
    "content": "Forgive me if this is obvious, but are you printing either the grouped or separate stems through a final limiter on the mix bus, or just what precedes the limiter? I feel like id want the stems to add up to the final mix, but any dynamics work on the mix bus would yield a different result when processed individually as opposed to the full mix right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1310502565288349696",
    "author": "Oli J",
    "date": "2024-11-24",
    "content": "Mix bus yes, limiter no (for both).  Sometimes we have crazy stuff on the mix bus (echoboy or reverbs!) so gotta print through that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1311263792847523861",
    "author": "sinaigimenez",
    "date": "2024-11-27",
    "content": "Hey Oli, do you mix ITB or you use some hardware inserts for that? Thanks and congrats on the last albums you've been involved. Everything sounds fucking amazing!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1311289273646973030",
    "author": "Iwan Morgan",
    "date": "2024-11-27",
    "content": "I was kind of joking, as much as I love chatting about mix bus this KL record feels like the last thing that relies on mix bus colour or processing.  To me it's all about the artful balance @Oli J  has acheived and  the arrangements which allow space for the voclas with subtle reverbs setting vocals forwards or backwards in the mix.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1343529031206834268",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-02-24",
    "content": "Totally! Especially very true for people who don’t have building an audience in the job description.\n\nIn a parallel way if we broaden - content can be art, so let’s just make sure to not equate influencers with mixing influencers. \n\nBeing a newer medium that was more recently unlocked, there’s overall a lot more innovation and exciting things in the online content space than in music. It’s where the majority of  young innovative people are active",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1346585389670072420",
    "author": "Berlin",
    "date": "2025-03-04",
    "content": "Hey siri, play \"Cian's secret sauce master bus preset\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1382871123351572522",
    "author": "chrissorem",
    "date": "2025-06-12",
    "content": "He’s tapped into the parallel Discord",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394394458325258471",
    "author": "chrissorem",
    "date": "2025-07-14",
    "content": "I’d also say where I’m really hearing the differences when the bus is really pushed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394394627393458330",
    "author": "cian riordan",
    "date": "2025-07-14",
    "content": "as in, the plugs on your bus are being pushed? or you're clipping into the bus?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394394944109805568",
    "author": "chrissorem",
    "date": "2025-07-14",
    "content": "No, no plug-in just hitting the bus too hard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394716624346415114",
    "author": "chrissorem",
    "date": "2025-07-15",
    "content": "I’ve come to report back the sonic differences that we were hearing is  totally from the way the master bus was clipping in  logic everyone’s right, excuse the derailing, but maybe this is a helpful thing  for some people. It’s helpful for me for sure. have a great day making music.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407826251741135020",
    "author": "shaunobi",
    "date": "2025-08-20",
    "content": "Alright looks like a few “ifs” here, but there are several open-source model creators that we can use which will theoretically model dynamics. So, next steps will be to get three things working:\n1) NAM\n2) Proteus (cause maybe it sounds better)\n3) that OG plugin\n\nI’d recommend doing some kind of routing, even potentially out through a patchbay if necessary, and then “learning” the plugin. It doesn’t need to be on same computer though that would be simpler. \n\n@oaklandmatt were the settings on those plugins all different? Or did you kind of have a universal preset or three that you used?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407907111958220962",
    "author": "Bryan DiMaio",
    "date": "2025-08-20",
    "content": "also so far I think I'm only able to run the demo version of the plugin since it seems like around every 30 seconds it inserts some pink noise",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1437619266089385984",
    "author": "itaylerner",
    "date": "2025-11-10",
    "content": "I'm helping a friend set up a studio, he has a bunch of gear and a couple patchbays and I tasked myself with setting it all up! A fun challenge for me. This is my plan, I talked with him a lot about how he uses each piece of gear and I was really intentional about setup. I would love some advice, and also, I', wondering if there's something I am missing about gain staging or signal flow - is it as simple as just plugging in all the I/O?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1442969163546104032",
    "author": "bobby k",
    "date": "2025-11-25",
    "content": "anybody got a good system for planning out your signal flow in the studio? Like a google sheet template or anything of that nature to draw it out before I dive in. \n\ni've started the journey of pulling all my cables and outboard gear to update my signal flow and properly integrate new tools that i've swapped in this year. a daunting but worthwhile task.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  }
]