[
  {
    "id": "1381835030879535225",
    "author": "cian riordan",
    "date": "2025-06-09",
    "content": "Outside of the studio? This totally changed me. Seeing things through… start to finish. Caring about every step of the process. We’ve done so many home DIY projects… I’d be up late the night before planning, up early double checking. Staying afterward to make sure everything to put away and cleaned up. I care. Invaluable in building a home studio. I enjoy the results every day, even 5 years later I get a grin when I walk into that room.\n\nLearning to cook pizza? Figure out where you want be. I started doing this 2 years ago. I had no idea what I was doing. But I limited my variables, took things one step at a time. What kind of flour is best? Buy different ones. Try them. What hydration dough? Fuck if I know. Start with 60%… work up from there. How long to ferment? Etc Etc. I obsess over every step of this process. \n\nWhen I’m interested in something, I care about it. Nobody else has to, but I do. And I’ll go to bed at night, I’ll know that I’ve done the work to really know that it’s as good as it can be.",
    "reactions": 23,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1062501180942590094",
    "author": "Rollmottle",
    "date": "2023-01-10",
    "content": "this mf with a lint roller and a potato at his desk. that's the one weird trick.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147231504246775848",
    "author": "Josh",
    "date": "2023-09-01",
    "content": "And I told her that she’s the monitor against the front wall to my unusually small desk. The rest is history 🥹💕",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1215381438912790569",
    "author": "Slow Hand",
    "date": "2024-03-07",
    "content": "It sounds like you're using their browser site to navigate your files, correct? I hate to say it but that's clunky as hell and you may as well be using Google Drive at that point (No!). Using Dropbox in-browser to navigate should be a last resort.\n\nThe move here is to connect Dropbox with your desktop so that your Dropbox folder appears and functions like any other folder in your Finder window. It will be far far easier to manage your files this way because they now have all of the same navigation functionality as your local files. \n\nI understand your desire not to download everything from your DB to your local drive. That's an easy thing to control once you wrap your head around how selective sync works. Once you get DB set up on your desktop you can specify that nothing should be downloaded to your local drive unless you specify (online-only), but you will still be able to see all of the cloud files inside of your DB folder in the Finder.\n\nIf you decide you want to download a file to your local drive you can right-click on the file and tell it to download (make available offline). And if later you decide to remove it from your local drive and make it cloud-only you can select \"make online only\". It's pretty simple once you get up to speed on the workflow.",
    "reactions": 14,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1062507226255859833",
    "author": "sethearnest",
    "date": "2023-01-10",
    "content": "Want to be told what’s abnormal in your house/desk/car/studio that you’d forgotten about? Post a pic on the internet somewhere.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1198344831043375275",
    "author": "Rollmottle",
    "date": "2024-01-20",
    "content": "Saw my 13YO on the floor in his room under the desk. Walked in to see what he was doing…he was doing cable management on his PC rig :chefkiss: :chefkiss: :chefkiss: :chefkiss: :chefkiss:",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078911029884485733",
    "author": "BatMeckley",
    "date": "2023-02-24",
    "content": "I have multiple guitars in every room of my house lol. Inspiration is LAZY. It’s like the Mitch hedberg joke, “I sit in my hotel room bed and try to think of jokes. And if the pad of paper is over on the desk, I then try to convince myself my joke wasn’t funny”",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1060726517660909598",
    "author": "ryount",
    "date": "2023-01-05",
    "content": "we are all moved in! still don’t dig the desk but here we are.",
    "reactions": 8,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1266526355625873529",
    "author": "cian riordan",
    "date": "2024-07-26",
    "content": "Yeah, its usually multi-task city when I'm doing that. Watching YouTube Videos, fixing any wiring gremlins in the studio, playing guitar, making spreadsheets of how much $ I would make if I quit and got a real job, etc, etc.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1439440489937113170",
    "author": "Dereck Blackburn",
    "date": "2025-11-15",
    "content": "My 2c: from August 2024 to October 2025 I worked with an artist where they brought me bones of songs and we co-wrote an albums worth of work together. They moved from the city to central massachusetts and while the songs and mixes are about 80% done, they can't get above water time and travel wise to finish the project and its put on hold for next year. This is a big record for me as a producer and musician, and it sucks that I put so much time and effort into it but in the end, I hope waiting it out  and getting back to refocus in 2026 will be worth it. On the other hand, I get hired by a band, they are super intense and ambitious about recording, mixing, and releasing - the album comes out and they breakup in 3 months or theres a lineup change where the new drummer has a home studio and can record everything there and mix it then 6 months later I get a IG dm to bail them out becuase the drummer fucked the guitarists wife and the bass player and vocalist are just going to finish the record on their own with me.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "824111487088984084",
    "author": "cian riordan",
    "date": "2021-03-23",
    "content": "On this note, I'll say that I LOVE these drives. My workflow in the past has basically been to buy a new 1GB SSD drive every few projects. When I had my setup on a laptop, this allowed me to always have access to projects I was working on the go (printing stems on the couch while watching TV? Yes please). In addition to using these SSDs, I'd always keep local backups with 'Sync Folders Pro' -- RIP Sync X -- on a cheaper, larger capacity USB drive. Being an anxious data archiver, I also signed up for Backblaze a few years ago as a cloud solution in case my studio burns down. Its a really great service, but the caveat they have with your drives is you *can* back up externals, they just need to be connected to your computer every 30 days. So I bought this monster USB3 hub and just had all of these fucking SSDs connected to my computer whenever it was setup at my studio. It worked fine for a few years, but I ran out of space again a few weeks ago and decided to futureproof mysetup a little bit. I ended up getting a thunderbolt Drobo. That way, I could have redundant storage for archived projects (which also gets uploaded to backblaze) but without having 16 drives on my desktop. Now I just have two of those samsung SSDs -- one work, and one as a backup. They run lightning fast and I get to keep having local backups in case I fuck the dog moving files around after a few glasses of wine. Then, when I run out of space, I just offload onto the Drobo and it's locally redundant, and also backed up on the cloud. Thank you for coming to my TED talk.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1074474787251957860",
    "author": "LAPhill",
    "date": "2023-02-12",
    "content": "Given how much more work is done remotely or in home studios, I hope that we can all still find ways to give those opportunities to sit in the back of the room to the kids these days. It's not quite as easy as it used to be.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1257921620404863006",
    "author": "Bryan DiMaio",
    "date": "2024-07-02",
    "content": "I’ll give you $8,005 and you can buy yourself a matchbox to use as a desk",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293242166839083189",
    "author": "Rob Domos",
    "date": "2024-10-08",
    "content": "I have a scalding hot take that the “indie girl” voice isn’t a fad and came about because it’s the optimal way to sing for the medium. \n\nThink of how opera doesn’t sound like human speech. That alien sound came about because extremely loose muscles create far less sympathetic intermodulation which sounds cleaner. It’s the same as how a speaker makes your desk vibrate and create out of time interference pattern distortions. Muscle tension creates hard surfaces that do the same when singing and opera singers obsess over undoing this. This is a big reason why so many of your favorite vocalists are opioid and benzo addicts. It’s not just culture. Downers are performance enhancing here. (Please don’t get any ideas artists) \n\nThe modern pop voice is just maintaining that exaggerated opera looseness but with adaptations for the modern medium: English diphthongs instead of Latin ones, way less air in their lungs because the target is a foot from their mouth instead of 50 feet, and softened fricatives because a capsule right in front of the mouth harshly exaggerates fricatives. \n\nFrom a physics perspective it’s the perfectly optimized way to sing in 2024. You may not like it, but this is what peak performance sounds like",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093031361583005697",
    "author": "Zack Hames",
    "date": "2023-04-04",
    "content": "Are there any good resources or tips for wiring electrical for recording studios? I’ve done *some* but not from scratch and not without guidance. \n\nClosing on my new house (*!!!!!*) on Friday so I’m starting to mentally plan some of the home studio build, want to prepare.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119996208736387164",
    "author": "Nomograph Mastering",
    "date": "2023-06-18",
    "content": "I *need* desk man to process my health insurance claim",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345583748447473664",
    "author": "Nomograph Mastering",
    "date": "2025-03-01",
    "content": "75\" TV on wall so I can look up instead of hunching, and an adjustable height Northward desk",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1316207448360489091",
    "author": "Nomograph Mastering",
    "date": "2024-12-10",
    "content": "Nice, it’s for wiring the girls brains so I don’t want to find out a week in that Giles went hog  wild with soothe and replaced Ringo with BFD",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1344176826544816170",
    "author": "Rollmottle",
    "date": "2025-02-25",
    "content": "Some people will never realize their agency. That doesn’t mean they don’t have it. We all have it. The degree to which we build upon and leverage what we do have is our puzzle to solve.\n\nI’ve had countless conversations with lost folks who think success and the things they say they want just happen. It is VERY difficult to teach self determination to people who don’t inherently believe that taking direct action toward a goal makes things start to happen. A lot of people don't believe it can be that simple. This doesn't mean it's easy. It can be hard to overcome one’s wiring and circumstances. And sometimes people need to learn the hard way. But, outside of the extreme, everybody’s got the agency to make their desired outcomes happen. Some need to work at it harder than others. For some, it comes easier. And sadly some never realize that their outcomes are in their hands. But what a powerful realization it should be that the things we think we can’t do are often just ourselves telling us we can’t do them, when in fact we absolutely can.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "832727145322905640",
    "author": "Slow Hand",
    "date": "2021-04-16",
    "content": "Of all the studios I've worked in, my favorites are the ones that skew towards the home-y vibe. Lots of different couches and chairs to relax on. Variable lighting. Numerous stations and tables where everyone can go off, spread out, and work on their own stuff on the side. I know that's a luxury that requires a certain amount of space, but if the control room isn't set up like an arrow in which all stations are pointing forward towards the desk/speakers I find that's a big mental relief.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1009170737703162017",
    "author": "BatMeckley",
    "date": "2022-08-16",
    "content": "Back in my day I had to climb up the hill carting my desktop computer with crt screen to use dial up internet. In the snow. Barefoot, cause we used our shoes for toys. Had to whistle a perfect 2600hz tone just to connect.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1074437085735432202",
    "author": "LAPhill",
    "date": "2023-02-12",
    "content": "I've only worked at Abbey Road once. I was there for a week and it was palpable from the front-desk to the interns, assistants, musicians, engineer, everyone silently acknowledged their fortune to be working in such hallowed ground. It just made it really clear that every single person cared, and cared deeply. I'm sure not all studios in London are quite like that, but it's stuck with me.\n\nI've worked at all the scoring stages in town and many of the record studios and it's just different here. The closest I've come to experiencing that level of care and respect for the work being done was at Capital. This isn't a judgement about talent, but the demeanor. If an intern or assistant acts like they don't care or aren't as invested as everyone else in the room, it can bring down a session. Or at the very least, it starts to feel like they're in the way, not on your side. If an artist or engineer has mostly had that kind of experience, I can see defaulting to seeing the assistants as \"the help\" instead of an integral part of the team, deservedly so or not.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1284083459299475528",
    "author": "alex stinson",
    "date": "2024-09-13",
    "content": "https://www.elgato.com/us/en/p/stream-deck-studio \n\nnew rack mounted stream deck",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "826199653380128828",
    "author": "kidcutler",
    "date": "2021-03-29",
    "content": "Filtering does this sometimes, I like to filter a high hat (pretty modern productions come across my desk usually) all the way down til the song feels slower, the drop a ghost point there so I don’t go past it as I progress through the mix. Also why I don’t use compression as much, my clients don’t want me to change the speed lol",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "962167638073696306",
    "author": "NoahNeedleman",
    "date": "2022-04-08",
    "content": "I had to upgrade my OS, and did not migrate; I went full @cian riordan and duplicated my installs on the new computer so I could move seamlessly from home studio to the road. Long day of installs but it’s been working like charm",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067973918465474570",
    "author": "austenballard",
    "date": "2023-01-25",
    "content": "the Antelope Goliath was broken so I just hid the 2i2 behind the desk, patched it in like normal and nobody was any the wiser",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1068803617521410088",
    "author": "Rollmottle",
    "date": "2023-01-28",
    "content": "my downloads folder is mostly my own airdrops to myself. anything i actually need to save, i put on the desktop and deal with it from there. downloads is always a disposable repository for me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1081324017673310238",
    "author": "cian riordan",
    "date": "2023-03-03",
    "content": "I use google Remote Desktop. It’s free and super fast.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1118629801809424505",
    "author": "NoahNeedleman",
    "date": "2023-06-14",
    "content": "https://www.sweetwater.com/store/detail/SiXSSL--solid-state-logic-six-desktop-mixer",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119992365747294348",
    "author": "bobby k",
    "date": "2023-06-18",
    "content": "yea i try to steer clear of projecting misery onto others. i have a lot of friends in boring desk gigs that love their life. and i try not to be envious of them either for being pulled by something more stable. music brings me as much grief as it does joy",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1123735110135582812",
    "author": "Josh",
    "date": "2023-06-28",
    "content": "I found this cool YouTube channel where this dude tours home studios and y’all ruined me. The amount of times I say “oh that’s super sick wait why does he have A- 😷 ad- 🤢 Adams 🤮”",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1132122002258411560",
    "author": "BatMeckley",
    "date": "2023-07-21",
    "content": "I very very very much can hear the difference between original 19” rack gear and their 500 series compromise counter parts. Certain things are meant from the ground up with a 500 series format (api, etc) and they sound awesome. But I don’t like bae1073 500 version as much as the full size. They very much sound different to me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1218393048589930496",
    "author": "NoahNeedleman",
    "date": "2024-03-15",
    "content": "@Slow Hand’s patient walk through on how to use the desktop app came in useful today. \n\nSeems like I still have to right click to “only online” for each file but honestly the navigation saves enough time that that doesn’t bug me much.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1262733129072906281",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-07-16",
    "content": "She sounds good in her Tiny Desk concert. I'm imagining loads of a suboptimal circumstances/adrenaline here. Poor girl",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282982649400528906",
    "author": "Rob Domos",
    "date": "2024-09-10",
    "content": "I’m convinced that electrostats are the way if sonics are priority 1 and money is no object. When I first heard a pair it changed my understanding of what’s possible. It seemed like an order of magnitude drop in distortion from the next cleanest alternative. Like the monitoring equivalent of going from a 57 to a josephson, and flagship planars are the 57. \n\nI thought it would be an instapurchase and then I found out the amp I was listening on cost $20k and I didn’t have enough info to know how to recreate that experience for less so I just set it aside. \nMost electrostatic amps measure so poorly and so I’ve stopped looking, but I’m hoping one day a DCA Corina and an affordable comparable amp will show up on my desk inexplicably",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293349223525253172",
    "author": "Slow Hand",
    "date": "2024-10-08",
    "content": "I'll take a swing. It's 1/4 of the price of an OP-1, it's half the size of a Push, it's tightly integrated with Live, it's a standalone tool (if you desire), it's battery powered, and it's portable.\n\nThe biggest features for me are that it can fit on a desk without taking up massive real-estate and gives me the ability to play in drums, keys, *and* have 8 mappable encoders that are tightly synced with *Live*. For me it would replace drum pads, encoders, a tiny keyboard, and a *Launchpad* that would otherwise go on my desk. It's pretty damn elegant in that regard.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1351753859172663347",
    "author": "thegreatcarsoni",
    "date": "2025-03-18",
    "content": "I just saw that, I’ve been using a Hue tap but if I end up getting the stream deck I would definitely run my couple of settings on there. I was actually thinking of controlling a smart plug to turn my fridge and water dispenser off when I’m doing VO at the desk.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "860450306084962304",
    "author": "oaklandmatt",
    "date": "2021-07-02",
    "content": "yeah i use a wheel-less drum throne similar to what @peterlabberton uses. i guess a version with wheels could be a little better, but that shit is super comfortable so it doesn't bug me. my chair stays pretty stationary tbh. i also have two wheeled desk chairs which get use for keyboards and shit",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "877334199361732659",
    "author": "ALXCPH",
    "date": "2021-08-17",
    "content": "Anything he does is considered dope in my book. Only drummer of our generation that can make me dance with just a high hat playing straight 8th notes. You guys seen his tiny desk show. His amount of talent hurts my brain 🧠",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "944633520654020668",
    "author": "ALXCPH",
    "date": "2022-02-19",
    "content": "I can already imagine parents going into guitarcenter asking the people at the desk how their kid can get analog vocals 💀",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "944710545775394846",
    "author": "Adam Thein",
    "date": "2022-02-19",
    "content": "Just got this same spec also last weekend.  About a week in, it's definitely a little crowded for finishing work in my opinion but I'm use to working on a 1440p 24\" monitor.  I can always HDMI I figure if I need the extra real estate.\n\nThe only acustica plug I run regularly is Ruby 2 - seems to cause pretty drastic spikes on the CPU short term in Ableton (running rosetta mode and VST3 by the way) but then it levels out.  In general I've been super impressed with the performance vs my desktop.  I'd say for my mixes it runs maybe 80% as well on large projects (75+ tracks, lots of processing) which was more than I was expecting.  Smaller projects and productions and softsynths it absolutely chews through compared to my desktop.\n\nWas just trying out a little mix in Studio One just on the 14\" and it felt very cramped to me.  I think it'd be hard to completely mix at this resolution but again it probably has more to do with what I'm used to.  Would definitely recommend a separate display if you are going to be doing all your work on it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1002999463763247114",
    "author": "Will Melones",
    "date": "2022-07-30",
    "content": "My thinking exactly. My rig was pretty solid when I left it alone, but every once in a while I would have a part crap out and a lot of downtime troubleshooting. It finally got to a point in the middle of a project that it was rejecting random plugins and having trouble booting, and I needed stability. So I started drawing out a map of dongles and hubs that I’d need if I were to replace it, and now I’m up and running on a MacBook Pro that’s more powerful than my 4GHz desktop was.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1044349492608118867",
    "author": "sukhuno",
    "date": "2022-11-21",
    "content": "To mirror what Bradley said - the ability to use 1 cable for everything at my studio is invaluable. Especially if I have mobile sessions, I don’t have to worry about grabbing power cables or adaptors, etc. I just grab my laptop and drives and I’m good to go. And then when I wanna work at home , I plug in the one cable and I got everything (synths, interface, screen, drives, keyboard mouse). Also underrated benefit of the dock is how much cleaner cable management was under my desk when all the cables go to one place.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060729024474791977",
    "author": "ALXCPH",
    "date": "2023-01-05",
    "content": "Can’t make grammy winning records with a desk that big! Everyone knows that 🤓",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069052405146193971",
    "author": "Slow Hand",
    "date": "2023-01-28",
    "content": "One trick I do is to have every file I download go straight to my desktop. It forces me to file away or delete everything as I go.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1081335300585967637",
    "author": "popthetrunk",
    "date": "2023-03-03",
    "content": "Hmm. I know you can see that in the mobile app. Also has great implementation on mobile for controlling a desktop. I’m sure you could configure that, I don’t have any setup. There is 2 factor authorization when you install the streaming side. I can look into it later if you want",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1081683642230784131",
    "author": "BillyC",
    "date": "2023-03-04",
    "content": "Gotcha. I’m trying to talk myself out of buying a laptop atm but on the other hand, it’s hard to imagine a future where being chained to a desktop rig doesn’t put me in the minority",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1102335055243788360",
    "author": "BatMeckley",
    "date": "2023-04-30",
    "content": "Sohn made one of my favorite sounding records of the last two decades. There was this magic percussion bit that sounded like it came from the ceiling.  Most vertical mix ever. Asked him what the magic was and he said pens on the desk recorded with an sm7. ¯\\_(ツ)_/¯",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138626248130711644",
    "author": "Deleted User",
    "date": "2023-08-08",
    "content": "I switched to height adjustable desk so I can stand when I record guitars 🤙🤙",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1157677203434262629",
    "author": "Will Melones",
    "date": "2023-09-30",
    "content": "I’m getting sick of the Spotify experience getting worse with every app and desktop update and considering making the switch to Tidal or Apple. Family subscriptions are all the same price. Is it lonely over there?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1159584474955251823",
    "author": "gatewoodsensei",
    "date": "2023-10-05",
    "content": "Eh day’s going solid. Finished a last minute mix for one of the homies on the road and discovered i like working on my laptop more than sitting at my desk. Probably why i have back problems now.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1173332476786126998",
    "author": "Rollmottle",
    "date": "2023-11-12",
    "content": "i wish the wiring in my rack were this tidy",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1196924223462052012",
    "author": "Rollmottle",
    "date": "2024-01-16",
    "content": "compressed air, banging it on your desk to shake out all the garbage, nylon brush",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1265356211151175690",
    "author": "Robin.Z.V",
    "date": "2024-07-23",
    "content": "My first one was an HP desktop. 512gb and 8gb ram in 2002.\nMy parents weren’t happy to find Cool Edit and Fruity Loops on it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1342874517755793419",
    "author": "thegreatcarsoni",
    "date": "2025-02-22",
    "content": "That phrase makes me think you have a large presidential style mahogany desk in a smoky room, and you have people in suits bringing folders to you going “Sir, I think you need to see this…”. You look at it for a while, grimace, and say without looking them in the eye “I see. Alert the discord”",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1390022429132455997",
    "author": "Slow Hand",
    "date": "2025-07-02",
    "content": "Using the DB desktop client is huge. I looove the integration; so much that going back to using DB in the browser is unthinkable to me. Way too clunky and slow.\n\nI’ve also never had any issue with it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394734907665940492",
    "author": "kylem",
    "date": "2025-07-15",
    "content": "I love it for back up / syncing between my mobile and desktop rip. The file transer thing is doo doo",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1420428628461748245",
    "author": "Edward Rivera",
    "date": "2025-09-24",
    "content": "There’s something something zen about doing things manually, with less cleanup, less noise, less buttons, less things that go _beep_, less displays, less cords…\n\nI’m not going to sweep my entire house when I’ve got the Hoover to do it, but I don’t mind a little manual love on my desk situation",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1459732554889433179",
    "author": "Josh Bowman",
    "date": "2026-01-10",
    "content": "I’ve been on spark for desktop and iPhone for several years and like it way more than Apple mail.  Haven’t tried canary though.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "814601046713696257",
    "author": "TALLL",
    "date": "2021-02-25",
    "content": "Honestly I have found every chair has its downsides for me, what I have found helped me the most was a standing desk and to make sure to get up and move every 15-20 minutes which I know is tough for us because when you are making music or mixing you get in the zone but literally just standing up for 20 seconds and just moving or quick stretch helps",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "814601964511035454",
    "author": "cian riordan",
    "date": "2021-02-25",
    "content": "Agreed on the movement! Standing desks are tough as a mixer because the speakers are really focused for one spot.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "827234919171883008",
    "author": "kidcutler",
    "date": "2021-04-01",
    "content": "I also really wish “home studio” mics like the tlm line were made to suit home setups, hyper cardioid shure ksm 27 has been an interesting fix for a client",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "827324884786479144",
    "author": "Josh",
    "date": "2021-04-01",
    "content": "Yeah. Chris from the six figure home studio podcast made that program years ago, mentioned it on the podcast casually, and their fam base bullied him until he dropped it publicly. Apparently it works wonders. Same with Brian’s Filepass. It’s like Dropbox but lossless and you can incorporate pay walls and shit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "832738024521203793",
    "author": "Slow Hand",
    "date": "2021-04-16",
    "content": "Daniel Lanois' *Teatro* studio out near Oxnard was also like this, I believe. An old theater that was retrofitted with a studio setup. That seems like such a lovely idea. Having the band on a stage in a hall.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "841758773555363879",
    "author": "chris_donlin",
    "date": "2021-05-11",
    "content": "Anyone know any monitor stands that clip/clamp on to a desk? I’m looking into to getting a desk with adjustable height. I enjoy standing and working on stuff once in a while. Send links or whatever other thoughts y’all have on this potential setup",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "841782932283588619",
    "author": "mixedbywong_my",
    "date": "2021-05-11",
    "content": "https://www.amazon.com/Gator-Frameworks-Desktop-Monitor-Speaker/dp/B084HPVQBK here ya go 👌🏻",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "859860477780557834",
    "author": "Zack Hames",
    "date": "2021-06-30",
    "content": "I think Matt has a good point - if you get some physical exercise each day, even just 30 minutes (a walk, light yoga) I find sitting at a desk all day much easier, regardless of the chair. That said, some chairs are better than others. I care more about the comfort of the seat bottom than what the back is or isn’t. I haven’t figured out prescriptively what chairs work or don’t work, But a little exercise mitigates it dramatically",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "860585322177364009",
    "author": "chris_donlin",
    "date": "2021-07-02",
    "content": "Been using a standing desk the last month and it’s incredible. I got gator clamp on monitor stands so when I adjust the desk I don’t need to adjust the monitors. I stand about 85% of the time now. So much better than hunching over all day. Highly recommend!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "876837896265531463",
    "author": "escobarinthe80s",
    "date": "2021-08-16",
    "content": "Hey y’all! I’m an artist that enjoys making a variety of different types of music. I currently record myself at my own home studio set up and send it out to a couple local guys to mix (Boston area). Unfortunately I haven’t found someone that can mix the variety of different sounds out here. I’d love to get in contact with some of you to both get some tips on how I can improve my own recording set up and possibly work with some of you guys on these songs. I’d love to send some songs along to anyone interested in working! I’m a long time fan of LWMR but this is my first time in the discord.If this isn’t the appropriate place to post this type of stuff, please direct me to the proper one.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "879158905991749662",
    "author": "David Fuller",
    "date": "2021-08-22",
    "content": "IG's desktop site is notoriously terrible",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "885568744376631336",
    "author": "Zack Hames",
    "date": "2021-09-09",
    "content": "Basically it distorts and rattles. It’s actually relatively subtle when Listening to music, but once you compare 60hz sine wave on each one,  it’s obviously fucked up. The other one is crystal clear.\n\nIt literally landed on the driver onto the corner of my desk. I’m surprised it didn’t puncture it. A new driver seems like it would be the solution. Would love to  not ship",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "889930580525973534",
    "author": "mixedbywong_my",
    "date": "2021-09-21",
    "content": "Was working on the computer , when one of the plugins I wanted to remove from an insert crashed Cubase. After that , I force restart on the MacBook pro via the power button . When  the computer restarted ,  the desktop folders are missing and it’s still in the directory somewhere in the system drive but it was renamed to Desktop - MacBook Pro (originally it’d be only Desktop)\n\nThen the Finder kept freezing intermittently 🌈 ,  check activity monitor , shows “mds” & “mds_stores” taking up a lot of cpu for no reason (40-50%)\nI’ve restarted the MacBook twice and it seems to be the same.  \nMy only possible solution would be restoring a time machine backup . Do I need to deauthorise my ilok licenses before i restore the backup . \nHas anyone possibly encountered something like this before ? Really sucks when there’s few mixes happening at the same time  and this happens. 😢😢😢",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "890247453343907912",
    "author": "alecdibell2",
    "date": "2021-09-22",
    "content": "Going to be building a desk. Are the resonances between different kinds of wood worth considering when having the option to build from scratch? Or should I just go with whatever looks best",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "890772670113796138",
    "author": "peterlabberton",
    "date": "2021-09-23",
    "content": "Yeah I’m in the same boat as @Zack Hames, I can’t stand working on a laptop. Mainly it’s the keyboard, I’d need the number pad to work efficiently. The screen size is secondary but still would drive me crazy if I only had my 13” MacBook screen. A 15” would certainly be a lot better and maybe doable, but… desktop all the way. That said whatever works for you is great!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "892446955609935992",
    "author": "Eric Martin",
    "date": "2021-09-28",
    "content": "I’m coming to an impasse; I’m in a band that works a lot and I record our stuff, and I get a lot of work Mastering and Mixing. The more I do that the more I realize that the production and tracking are significantly more important than MIX/MSTR for the “success of the song”.\n\nI’d love to put my hands on outboard mastering gear but I have a few upgrades that I would like to do for my tracking situation(full live band tracking) and the costs are about the same for either, I get a little less work tracking but it’s like 40% Mastering 35% Tracking and 25% Mixing work.\n\nMost mixes I do all in the box and the little outboard I have helps shape the tracking upfront and doesn’t get used in Mastering, but does get used sometimes in mixing.\n\nI operate out of my home studio which provides low overhead, my “studio” is where my band rehearses and where I Mix and Master, I also bring bands in occasionally to track in my basement, but it a little tight.\n\nI wonder what y’all’s thoughts are, I love doing all these things but feel like, I’m just kinda stuck treading water and not swimming toward a destination.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "930194174580514816",
    "author": "Zack Hames",
    "date": "2022-01-10",
    "content": "Im trying to get rid of all of my extraneous and unused gear but it’s quite difficult. How do you finally convince yourself to get rid of all of the extra cables, unused pedals, drum hardware, old interfaces, rack gear you don’t touch - what’s everyone’s philosophy on moving on from old gear and optimizing your studio?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "942427513282498630",
    "author": "Adam Thein",
    "date": "2022-02-13",
    "content": "Not sure what channel this fit best in but I just added a laptop to my workflow and will probably be splitting some time between laptop and desktop work moving forward.  Does anyone have tips or a system they can share to make splitting time between computers as smooth as possible?  What complicates things is the laptop is a mac and the desktop is a PC.  Looking for a best practice for moving my samples around easily and file backups/file consistency.  I’m guessing either networked folders or external drives are the way forward here?  I’m trying to avoid having two copies of everything.  Big scope question so if you are willing to share your best practices please feel free to dm!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "942491189725265970",
    "author": "BillyC",
    "date": "2022-02-13",
    "content": "I figured that, but why not commit to the laptop then? As a frustrated desktop user myself I am beginning to think that immobile computers are kind of ridiculous in the year 2022",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "944714447618986014",
    "author": "Adam Thein",
    "date": "2022-02-19",
    "content": "Yeah at that point considering you are going to mostly use it at your desk maybe worth holding out for the refresh on Mac Mini",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "944724878857216050",
    "author": "Maxim",
    "date": "2022-02-19",
    "content": "Also what desktop do you have?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "951958844718854195",
    "author": "h3x",
    "date": "2022-03-11",
    "content": "Im gonna do some extensive cable management first then spray the shit out of it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "959880424186843147",
    "author": "Jeremy Klein",
    "date": "2022-04-02",
    "content": "does anyone here have a sit stand desk situation they are happy with?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "959928580962398279",
    "author": "Jeremy Klein",
    "date": "2022-04-02",
    "content": "Oh damn so thats your main desk? I really like the idea of something this small. Where do you put your interface, computer monitor, other knick knacks?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "960244699900285000",
    "author": "chris_donlin",
    "date": "2022-04-03",
    "content": "I got the frame works clamp on stands for my old sit/stand desk which worked great because when I raised the desk, the screen and monitors would just go up with me. Now that I have the mini rolling desk, I kind of had to sacrifice that aspect. I could just manually raise them though",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "960265912097853580",
    "author": "Rollmottle",
    "date": "2022-04-03",
    "content": "This is very specific to my setup because I am anti-screen-in-between-speakers, but I recently added an Uplift standing desk to my room and am a big fan.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "960640881373888592",
    "author": "Jeremy Klein",
    "date": "2022-04-04",
    "content": "Hey Chris, have you had problems with your knees or feet knocking against that little desk when you are sitting?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "960643369044963339",
    "author": "Jeremy Klein",
    "date": "2022-04-04",
    "content": "Wow that looks great in your space! Yeah, it's unfortunate that none of the standing desk manufacturers do a narrower desk",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "960655710163705946",
    "author": "Jeremy Klein",
    "date": "2022-04-04",
    "content": "Ohhh that's a good idea! \nJust from the picture it doesn't _look_ like the desk is too big. @kylem  why do you wish it was smaller?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "960661095863947354",
    "author": "kylem",
    "date": "2022-04-04",
    "content": "There's a reflection that comes off the desk. If it was smaller it would be a little be easier to deal with. I have a thick throw blanket that goes across the middle for now that seems to help.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "962790944552390666",
    "author": "alex_epton",
    "date": "2022-04-10",
    "content": "the PA bx-masterdesk is a good all in one sound-biggerator. but doesnt push as obviously into distortion. i kinda forgot about sausage. its been a while",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "963457183150931968",
    "author": "Adam Thein",
    "date": "2022-04-12",
    "content": "HG-2, SHMC, SVT-VR, their Focusrite console emu, masterdesk, and oberhausen for free?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "998673117805301760",
    "author": "Rollmottle",
    "date": "2022-07-18",
    "content": "Anybody have a wireless keyboard (the typing kind) they like? I'm looking to replace a 15 year old Logitech, mainly to not have to rely on the bulky combo USB/serial transmitter it came with. (This is the one I have now https://www.amazon.com/Logitech-967557-0403-Cordless-Desktop-S510/dp/B000AY2L3U)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1026870923174875197",
    "author": "Will Melones",
    "date": "2022-10-04",
    "content": "With the trackball I always feel the tendency to keep my hand in handshake position and roll it with my pinky anyway.\n\nBut maybe the biggest benefit to never leaving the house for the past two+ years has been not working at other people’s gigantic desks. My tabletop is *really* low, like elbows in my lap low. Someone taller than me wouldn’t be able to sit under it, but it’s very comfortable and relieves all the pinching and weird elbow/wrist contortions of a high work surface.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1027287017383538708",
    "author": "peterlabberton",
    "date": "2022-10-05",
    "content": "How do folks handle clients you don’t know asking to come over in person for, say, mix revisions? I honestly didn’t think much of this when I moved from a shared studio space to a home studio. The vast majority of my work has been through friends, and it’s only recently I’ve been regularly working with randos who hit me up for work. Have had a couple recently who wanted to do in person work, and while I’m sure it’s fine and I wouldn’t think twice if it was a commercial space, it just slightly wigs me out that it’s my house. I dunno, maybe I’m overthinking this, just curious people’s experiences and thoughts!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063237896364097606",
    "author": "CK",
    "date": "2023-01-12",
    "content": "Question.....as far as productivity and work-life balance....Home Studio or Studio space that is not at your home?  Other than the financial part (let's assume you can easily afford the \"not home\" space), would you prefer a space at home or a dope space you can go to every day?  I am currently confronted with this choice and am unsure which I want to commit to. I know there is nuance to everyones situation. I am just brainstorming and making pros and cons lists at the moment.  I have always had a home space, so this would be a different daily routine for me. I imagine most folks here work from home.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1067968596124389426",
    "author": "ehutton21",
    "date": "2023-01-25",
    "content": "A rackmount vs a desktop?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067968650394468353",
    "author": "ehutton21",
    "date": "2023-01-25",
    "content": "I though desktop UAD vs desktop apogee was the more apt comparison",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067972262424231956",
    "author": "austenballard",
    "date": "2023-01-25",
    "content": "The comparable unit for format/price here is actually the Ensemble, not the Symphony Desktop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069052632565551154",
    "author": "Nomograph Mastering",
    "date": "2023-01-28",
    "content": "Insane desktop clutter ensues",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079923245744132207",
    "author": "Josh Bowman",
    "date": "2023-02-27",
    "content": "Sorry, when i was there, there was a wow thing thats a little blue box, then a rack mount SRS thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1081325644186656908",
    "author": "LAPhill",
    "date": "2023-03-03",
    "content": "Yeah. I was using AnyDesk, and LogMeIn before that. Trying to find something where an assistant can grab files from my computer without interrupting me/needing me to do anything.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1081346457484935189",
    "author": "LAPhill",
    "date": "2023-03-03",
    "content": "Appreciate it. If you happen to notice if there's a notification on the desktop side when using the file access or screen sharing, I'd be curious. But don't go out of your way to look.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1081618912950636564",
    "author": "Calvin Lauber",
    "date": "2023-03-04",
    "content": "Remote Desktop was such a game changer to make mix tweaks while I was on the road last year. crazy it’s free and works as well as it does",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1081679726881538178",
    "author": "BillyC",
    "date": "2023-03-04",
    "content": "So Remote Desktop delivers audio as well?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1083429644574924871",
    "author": "Slow Hand",
    "date": "2023-03-09",
    "content": "I was talking to someone who was considering using a MIDI keyboard with the desktop Prophet and I encouraged them to spring for the keyboard version because the aftertouch feels great and adds expression they're not going to get with a cheap MIDI keyboard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1083909295512506409",
    "author": "ehutton21",
    "date": "2023-03-10",
    "content": "I’m thinking of hiding it by draping fabric off the edge of the desk",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1092626518078918676",
    "author": "thecoleyoung",
    "date": "2023-04-03",
    "content": "Curious.. are y’all putting your Mac computers to sleep or shutting them down at the end of the day? I’ve been in the same routine of putting my desktop iMac to sleep at the end of the day, as it’s old as shit and that was giving me the best performance the next day, but I just snagged a new Mac Studio. Curious if there’s any recommendations / best practices y’all have found!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1093033439546052628",
    "author": "Gerhard Westphalen",
    "date": "2023-04-04",
    "content": "Are you building out a room or trying to retrofit? There are a number of documents and articles about wiring things without any voodoo. I think Rane has something? Other than that there's not much to it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093069387990319114",
    "author": "Nomograph Mastering",
    "date": "2023-04-05",
    "content": "Culturally over here it’s totally different. In Ireland it was the same as the UK, taken very seriously. In the US everyone seems to have a go at wiring outlets and light fittings etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093117528621989928",
    "author": "Zack Hames",
    "date": "2023-04-05",
    "content": "Building out a room, whatever has to happen will happen. So I want to do it right but gotta save money where I can, and like raurí said, in the US, people wire up their own stuff all the time for better or worse. Electrical doesn’t really freak me out TBH and the few times I’ve been shocked suck but it was so mild at least when just running long conduit and wiring for lights and outlets. \n\nThanks @jantrit and Gerhard for the suggestions; I’m sure it won’t be too complicated but just wanted more than a google search to go off of!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1094340570043916338",
    "author": "spectrummasters",
    "date": "2023-04-08",
    "content": "And @popaganda. . I completely agree with you both . Re the heart. In the Netflix doc the defiant ones there’s a part where Dre has that up on the board in his home studio and is mixing it......it sounds incredible . I wondered if it would ever come out ,",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105152162109071410",
    "author": "Bryan DiMaio",
    "date": "2023-05-08",
    "content": "For context, I opened a session that I had started on my old rig (10700k desktop processor, it was close to maxing out) and duplicated all the tracks twice, and it didn't even care",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105240129293000904",
    "author": "Will Melones",
    "date": "2023-05-08",
    "content": "Wow, Spotify has managed yet again to make the desktop GUI *even worse*? What are they doin’ over there?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1118629526088450139",
    "author": "Bryan DiMaio",
    "date": "2023-06-14",
    "content": "Big Six is kind of that-ish, but also the XL Desk thing with 500 series maybe?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1118631133148622960",
    "author": "Bryan DiMaio",
    "date": "2023-06-14",
    "content": "https://vintageking.com/ssl-xl-desk-loaded?utm_campaign={PmaxSSLMDF}&gclid=CjwKCAjwyqWkBhBMEiwAp2yUFgf0_3ElBNz8P5skoEO0Ms531M5YXJjif8jO-aHog0f37BCF7ICtNxoC4_8QAvD_BwE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1118635089186791555",
    "author": "spectrummasters",
    "date": "2023-06-14",
    "content": "Feel like I read somewhere about how they were key components to the desk behaviour",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119529598451978331",
    "author": "spectrummasters",
    "date": "2023-06-17",
    "content": "I’m just currently trying to work out if i want to “show” backblaze two systems (the desktop and the laptop ) and pay for them both....or whether to just hook up the desktop set-up to back blaze and sort of dock my laptop SSD to the desktop and let it back up to backblaze from there......",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119530184270413854",
    "author": "spectrummasters",
    "date": "2023-06-17",
    "content": "I’m thinking that my time machine for the desktop, a daily back up drive for the desktop and then a cian style archive drive , on which ill also have laptop archive back ups (the laptop has its own time machine drive ) ......should be solid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119530702023704698",
    "author": "Edward Rivera",
    "date": "2023-06-17",
    "content": "If you're doing a Time Machine for your desktop, you kind of don't need another external for it, that's 2 copies, BB would be my third",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119991734752002090",
    "author": "hyanrarvey",
    "date": "2023-06-18",
    "content": "Like desk jobs and such",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119991877568045136",
    "author": "bobby k",
    "date": "2023-06-18",
    "content": "i cannot imagine what it’s like for people actually in the spotlight at these types of reunions or family affairs. i used to be envious of them getting the bulk of the attention and praise. but i can’t imagine how taxing that is in actual small talk. other people in traditional fields get to walk away from their desk at the end of the day, but almost nobody allows an artist/actor/celeb/etc that same luxury.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119993076434341968",
    "author": "cy (sigh)",
    "date": "2023-06-18",
    "content": "I think what Ryan might be getting at is that we can often find peace (emotionally, spiritual) through the  work we do, no matter what kind of struggles we might face in the gig and outside. and most desk jobs don't offer that priviledge  - often quite the opposite. \n\np.s. I've worked dozens of desk and retail jobs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1119995921787277312",
    "author": "Nomograph Mastering",
    "date": "2023-06-18",
    "content": "To react with “you’re just a corporate ho stuck behind a desk” is to be drawn into a low grade conversation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119996286951755776",
    "author": "Nomograph Mastering",
    "date": "2023-06-18",
    "content": "I *need* desk lady to manage my retirement savings",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119996381793362031",
    "author": "Nomograph Mastering",
    "date": "2023-06-18",
    "content": "I need desk people to answer my waves tech support query",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1123754598759419914",
    "author": "Rollmottle",
    "date": "2023-06-28",
    "content": "so many larger-than-aircraft carrier sized desks on that channel.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1125813136696553574",
    "author": "Iwan Morgan",
    "date": "2023-07-04",
    "content": "Not sure if this is the right channel, but for the first time I had a T7 go bad during a session yesterday. I think a weird power thing happened in the studio as the desk LEDs started flashing at the same time.  I can still mount the drive and managed to luckily grab the data from the morning’s tracking but it absolutely sucks when this happens. So glad I’ve been CC Cloning on each session recently. It may be a coincidence but the drive was formatted ExFat as the studio runs a PC. Anyone with more PC knowledge able to say if this would have an effect IE is MacOS Journalled more reliable than ExFat?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1127018085933654026",
    "author": "Edward Rivera",
    "date": "2023-07-07",
    "content": "Done with reddit. Had to switch to narwhal and even that's horrible. Desktop only with RES and old.reddit.com until that goes away",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1132094755858296993",
    "author": "shaunobi",
    "date": "2023-07-21",
    "content": "I'm almost all rack gear but I'm \"500 curious\" for space and DIY reasons. Built an OLA5 compressor and like it, adding a Lola pre as soon as I can build it, and will probably just buy a good EQ to round out a vocal strip.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1132096345226891325",
    "author": "shaunobi",
    "date": "2023-07-21",
    "content": "Totally, I hear that. Buddy owns an audio equipment company, I test stuff for him. Thought 500 series units would suck but (for well-designed units at least), they sound great to my ears. I thought they’d have no headroom but… seems to not be any more a problem than it is on crap rack gear 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1146874782273503342",
    "author": "Slow Hand",
    "date": "2023-08-31",
    "content": "Does anyone here host their personal music collection in the cloud? I've got a massive collection that could get more love, so I figure I should look into a solution for engaging with it more often.\n\nWhat I'm seeking is:\n1) My entire 500gb collection hosted in the cloud\n2) The ability to organize and catalog everything meticulously.\n3) A desktop and phone app that will allow me to stream any of it at will. Like using Spotify on your phone.\n4) Requires very little in the way of ongoing subscription costs.\n5) (Edit) Ideally it would be open-sourced or robust enough that if the developer closes the tools will still function.\n\nDoes anyone know of any options that satisfy most of those needs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147661468549005383",
    "author": "peterlabberton",
    "date": "2023-09-02",
    "content": "Totally. @georget113 I’d just try and meet as many people involved with the studio(s) you’re interested in. Go on a studio tour, you’re a producer who might need to book studio time, just want to get a lay of the land, oh by the way I’d love to help out if you guys ever need a hand, etc. etc..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1150870738388127834",
    "author": "spectrummasters",
    "date": "2023-09-11",
    "content": "....I’m currently going into  another electrical engineering rabbit hole that’s got me learning the details of the routing of the old SSL 4000 desks (just by online docs and discussion ) and I have to say when it comes to signal flow , those SSL engineers were bloody clever .....With the whole in line thing and matrix and float etc etc .....it makes me realise how much of our daw s mixers and the routing options we have available ......we owe the concepts to the brain waves of electrical engineers in the 70s , they really thought shit through !!! TIP O my hat to the-electrical  engineers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1150872080888369152",
    "author": "spectrummasters",
    "date": "2023-09-11",
    "content": "Watching Jess Jackson renovating his SSL desks on insta has been fun and if that’s ya thing , this a lovely 15 mins of audioelectronic  geekery https://youtu.be/xK5H1X2-D0E?si=__dnInCWu8puJCB-",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151546223359176806",
    "author": "BatMeckley",
    "date": "2023-09-13",
    "content": "Conway literally etched my mouse works settings in to my trackballs. Luckily I didn’t have to switch computers 3 times a day, but I do remember Luke always getting pissed cause the right click didn’t work the way he was expecting on the trackball. We basically compromised and had a mouse on the desk for him and my trackball for me. Worked out.\n\nI seem to remember Sean Everett being comically fast on the keyboard. Had every key command DIALED.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1159288535287861309",
    "author": "Nomograph Mastering",
    "date": "2023-10-04",
    "content": "Anyone here got BX Masterdesk and Pro Tools?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1178741505372983436",
    "author": "john",
    "date": "2023-11-27",
    "content": "I'm pretty sure that DJ Khaled uses the Apollo from UAD in his studio desk",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1182017257958813817",
    "author": "Adam Thein",
    "date": "2023-12-06",
    "content": "Looks like they added a new handy server-wide Threads tool in the desktop app of Discord.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182780902057709608",
    "author": "conor // wbotm",
    "date": "2023-12-08",
    "content": "hmmm heads up that when i updated TIDAL on my desktop it toggled back to normalise volume 😠",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1183210503019958332",
    "author": "Rollmottle",
    "date": "2023-12-09",
    "content": "tough for it to get worse, but somehow they managed it. the browser-based one on desktop is still not updated yet.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1184965526305374228",
    "author": "Nomograph Mastering",
    "date": "2023-12-14",
    "content": "With your wiring, or your power supply, or your gain structure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1184965785689538650",
    "author": "Nomograph Mastering",
    "date": "2023-12-14",
    "content": "There are errors in wiring that will only trip up certain pieces of gear, issues with common mode signal etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1186438498274770984",
    "author": "DAREZ",
    "date": "2023-12-18",
    "content": "Currently relocating my studio and parting ways with my Argosy desk.\nDebating between the smallest desk possible, with my 49-key MIDI keyboard on a stand beside me, or a desk that would accomodate it as well.\nI also have 2 Chase Bliss pedals that I would like to keep within arms reach\nWhat do you guys think? Links are welcome\n\nSeeking recommendations for a sidecar as well",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1186465340494975027",
    "author": "David Fuller",
    "date": "2023-12-18",
    "content": "So generally the goal is the smallest desk you can get away with",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1186479220231250050",
    "author": "DAREZ",
    "date": "2023-12-18",
    "content": "I think selling this Argosy desk is going to be a challenge though 😬",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1191514609618784336",
    "author": "samourai",
    "date": "2024-01-01",
    "content": "@Nomograph Masteringthanks for creating this groupe because it’s the only group or YouTube that have real responses and true responses not bullshit marketing or advice from home studios",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1215345094035640430",
    "author": "Rollmottle",
    "date": "2024-03-07",
    "content": "On desktop, I keep a shortcut directly to my container folder to bypass all their bullshit. On mobile, I skip their home screen and go directly to my File list. The UI on their web app is pure dogshit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1215346396186673182",
    "author": "Rollmottle",
    "date": "2024-03-07",
    "content": "Yeah, I only selectively sync a handful of folders on desktop. It's too much otherwise.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1216855039356833892",
    "author": "peterlabberton",
    "date": "2024-03-11",
    "content": "Having just bought my first place with my girlfriend, AND having listened to that Daily episode, I definitely think it can be awesome but isn’t *always* awesome. We were very close to backing out of the process, until we saw the place we got, and the determining factor for us was that it had an ADU, and was in our budget. There’s work (and money to sink into said work!) we need to do, but once we have a tenant in, even conservatively I think it will either cover our mortgage, or come close to it. (It’s very likely NOT going to cover tax and insurance, but that’s more than fine.) We also were in a really fantastic first time homeowners program, which allowed us to put only 2% down, and gave us a grant for another percentage point down. This is all helped IMMENSELY by my girlfriend both having a real deal grownup salaried job and having just about perfect credit. But it’s going to allow us to build wealth through the house, and allow me to build my studio space, AND if we ever want to leave LA, because our interest rate is comparatively great, we’d just keep it and rent both units.\n\nSo, TLDR, I don’t think it’s a slam dunk always great idea, but I think if you can finagle the situation to work for you, it can be really smart.\n\nAlso, my entire family on my mom’s side has been school teachers/librarians/pastors/professors (so doing fine but by no means rich), but my parents and their parents were both able to ride California real estate into a very comfortable place in retirement.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1218287056682225804",
    "author": "SoundsLikeJoe",
    "date": "2024-03-15",
    "content": "All this talk about how baller Samply is...  but MAC ONLY.  I understood that more in 2001, but in 2024? Anyone know if they have Win desktop client plans?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1218288679043465226",
    "author": "Karim",
    "date": "2024-03-15",
    "content": "Same functionality across web and “desktop” app",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1218306236303544442",
    "author": "Rollmottle",
    "date": "2024-03-15",
    "content": "Same idea as a desktop client wrapping a web app experience. Makes it easier to retrieve and access if you use it often. Clever shit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221218515105878177",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "Also remember that Spotify itself is a moving target - it can supply 3 different levels of normalization, 3 different file types (OGG/MP3/AAC) and multiple bit rates depending on settings/cellular bandwidth/mobile vs desktop vs embedded (car/smart tv)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221242525059125498",
    "author": "Adam Thein",
    "date": "2024-03-23",
    "content": "Using Apple Lossless with soundcheck off over here.  Also be careful you have Spatial turned off (I believe it is on by default even on desktop).  I’ll record a loopback into the daw if I want to be able to consistently check against the same section.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221892048546697306",
    "author": "Nomograph Mastering",
    "date": "2024-03-25",
    "content": "Need a recommendation for a beautiful, tactile, physical timer for music desk. Have and hate various software versions. Want a thing, that I can dial to 30 mins or whatever and have a non soul destroying sound when time is up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1231273647495446620",
    "author": "Berlin",
    "date": "2024-04-20",
    "content": "I think as a mastering engineer, who likes to play AnR when I feel inspired, if this one came across my desk, as a first time artist, I would be blown away and would want to share with anyone I could.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235182900056686622",
    "author": "river",
    "date": "2024-05-01",
    "content": "Build a PC, used office desktop, get some extra storage",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235226007506649099",
    "author": "hyanrarvey",
    "date": "2024-05-01",
    "content": "I feel like an Apollo, lauten, and kali monitors and I am pretty much good to go for a little home studio set up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1250507423941136425",
    "author": "popthetrunk",
    "date": "2024-06-12",
    "content": "I’ve done this a few times internationally and the best experience has been using a fine art crating service. I’d hit up Obsolete inc in Los Angeles and see if they can sort you out with a current crating contact. Concierge desks at Hotel Costes, Bowery Hotel, chateau marmont can be very helpful if you ask nicely and are upfront as a non guest.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1257361528630284439",
    "author": "montrose recording",
    "date": "2024-07-01",
    "content": "🤦‍♂️ i can see others reactions but it wont let me react.  maybe need to goto desktop?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1257361768913702962",
    "author": "Rollmottle",
    "date": "2024-07-01",
    "content": "yeah, it's working in desktop though. strange!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1257778828185436220",
    "author": "James Cronier",
    "date": "2024-07-02",
    "content": "It’s missing from desktop and mobile",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1262745777986469979",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-07-16",
    "content": "For what it‘s worth, I‘ve never heard of her before this. Now I‘ve checked out her stuff and I really like it so far. Listening to her tiny desk rn and it‘s beautiful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1265154256193851473",
    "author": "Robin.Z.V",
    "date": "2024-07-22",
    "content": "I looked up what this equates to compared to a Samsung flash drive - 7200RPM is the equivalent to 120-180 MB/s.\nI run my old silver WD desktop HD and my old behemoth LaCie with an eSata to USB3 cable sometimes and I thought that was pretty decent for old drives. It’s bananas.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1266443947132190794",
    "author": "Eric Martin",
    "date": "2024-07-26",
    "content": "control room is not even 1/2 finished, colors are changing and so are the lights, but I had to stop pushing work off to get this done so I’m working in there now and done with the home studio.\n\nI see “opening” officially by 8/12 which is my first non-artist project scheduled in the studio",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1270101537259257927",
    "author": "joshbonanno",
    "date": "2024-08-05",
    "content": "where would one begin to try and find a box (and packaging) the correct size to ship a standard 19\" rack mount piece of gear?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1275910290017620128",
    "author": "James Cronier",
    "date": "2024-08-21",
    "content": "Hey y’all, off topic question here: \n\nAnyone have NYC apartment hunting tips? Lease is up Sept 30th, and my last move was unexpected and terrible. I wanna  ahead of the curve here. Also insight on packing/moving the home studio would be great too\n\nThanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1275940536485937337",
    "author": "James Cronier",
    "date": "2024-08-21",
    "content": "Yeahhh and I have a home studio to deal with. I’m considering putting it all in storage ahead of time. I have a ton of uhaul storage vouchers through a live sound gig.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1278783394469253315",
    "author": "Rollmottle",
    "date": "2024-08-29",
    "content": "not sure...just double checked on mobile and desktop and all seems to be in order",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1284146060813537280",
    "author": "Will Melones",
    "date": "2024-09-13",
    "content": "I’d take a Sterling desk packed with steam decks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293217307614515241",
    "author": "Chase H",
    "date": "2024-10-08",
    "content": "Starting to think about options to go the tiny desk route once I get my drywall hung in my place and a wall demolished.\n\nTiny desk gang, what desks do yall suggest I check out?\n\nThe dangerfox solo looked cool but looks like I’d be leaning over to get my hands onto the desk to do work so that’s a no go",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1293217726684332167",
    "author": "Bryan DiMaio",
    "date": "2024-10-08",
    "content": "Uplift v2 (42x24 bamboo top) and low sidecar rack is what I'm on and I really dig it. I like the height adjustable aspect for cable management and an easy way to set the height precisely to my ergonomic height",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293217838068142121",
    "author": "Bryan DiMaio",
    "date": "2024-10-08",
    "content": "plus the desk itself is solid as shit and you can save some money if you buy from their clearance",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293217999842705532",
    "author": "masteredbyjack",
    "date": "2024-10-08",
    "content": "How tiny? And do you need actual rack space in the desk?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293218621236973600",
    "author": "Chase H",
    "date": "2024-10-08",
    "content": "I’d like some rack spaces but it’s not a must, can just keep using my little side car.\nIt’s funny I keep seeing your desk for sale on Facebook because your right across the lake :kek:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1293218851806380164",
    "author": "masteredbyjack",
    "date": "2024-10-08",
    "content": "Hilarious haha. I wouldn't say that's a tiny desk though. IMO just make something custom",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293324559994454056",
    "author": "Bryan DiMaio",
    "date": "2024-10-08",
    "content": "Lemme find a picture of the desk",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1299719232577208330",
    "author": "centonomic",
    "date": "2024-10-26",
    "content": "I highly recommend having multiple input devices all set up and ready to go flanking the keyboard. Most importantly two trackballs, trackpads or mice setup on both sides of the keyboard. Right now I’ve got an Expert on my left and a magic trackpad on my right along with a Nob controller. Also had a small wacom tablet set up as well sometimes. Might be difficult on some of these tiny desks though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1316856150788145242",
    "author": "Ross Fortune",
    "date": "2024-12-12",
    "content": "I'm trying to view a stack of tracks in Samply on iOS mobile app, but can't find the little version button. All working fine on desktop browser. Am I being thick?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1317700550854316064",
    "author": "tim adamson 🇦🇺",
    "date": "2024-12-14",
    "content": "Dude, I just found a studio tour vid and I'm blown away mainly by Chris's face",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1319687719609303120",
    "author": "Maxim",
    "date": "2024-12-20",
    "content": "On Desktop the app crashes 40% of the time for me too on playback",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1338686172221669490",
    "author": "itaylerner",
    "date": "2025-02-10",
    "content": "Any issues with plugging a power conditioner into a generic power strip?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1338703962093912075",
    "author": "itaylerner",
    "date": "2025-02-10",
    "content": "Cool, figured as much. Asking for a friend setting up his Home Studio. thanks fellas!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1340194834186502244",
    "author": "itaylerner",
    "date": "2025-02-14",
    "content": "Can’t speak on the LA part but I’ve had both a home studio and spaces I’ve leased and I really love getting work out of my house. I’m way more productive, it’s a lot better for my mental health, helps me be more present at work and at home. So many benefits tbh, I just take myself more seriously that way, and others do too. I just make sure I have enough of a rig at home that I can do simple prep work, revisions, alts etc at home.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1341430634869952614",
    "author": "Jonathan Jetter",
    "date": "2025-02-18",
    "content": "Anyone running into Dropbox issues just in the past week? Like, the desktop app on certain machines just won't sync up to the cloud, nor download locally.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1341431916619894834",
    "author": "Jonathan Jetter",
    "date": "2025-02-18",
    "content": "Working fine on my studio desktop and completely broken on my laptop. Same Mac OS, same Dropbox version, in the same room on the same Wifi.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1341439500487888999",
    "author": "NoahNeedleman",
    "date": "2025-02-18",
    "content": "I had super slow uploads last week. Ultimately replaced my router and it’s working great again. Desktop and webclient both",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1342763302316671000",
    "author": "Edward Rivera",
    "date": "2025-02-21",
    "content": "https://www.swisstransfer.com/en-gb\n\nthis came over my desk recently",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1360721856411205652",
    "author": "Rollmottle",
    "date": "2025-04-12",
    "content": "~~Yes, it's there but not in the desktop app.~~ oh, tidal, not Apple Music",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1390021610408247429",
    "author": "chrissorem",
    "date": "2025-07-02",
    "content": "Oh is that the desktop app?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1392279373754798080",
    "author": "Rollmottle",
    "date": "2025-07-08",
    "content": "happens to me all the time. i chalk it up to having multiple Discord sessions up across mobile and multiple desktops",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1393568250960412712",
    "author": "oaklandmatt",
    "date": "2025-07-12",
    "content": "The PMC showroom 😂😩.\n\nI've found london studios by and large to sound terrible. I would like to know if there are more places that actually have good sounding mains.\n\nIt feels to me like London hasn't had the home studio/ cloud/ membrane acoustics revolution that has happened in LA in the last decade.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394439390499049654",
    "author": "David Fuller",
    "date": "2025-07-14",
    "content": "I started in sonar home studio 6",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1447809461929508914",
    "author": "Slow Hand",
    "date": "2025-12-08",
    "content": "I just discovered that if you put two Macbooks in proximity with one another you can `Cmd+C` a folder or file on the 1st computer and then `Cmd+v` it *onto the desktop* of the 2nd computer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1452898956500533359",
    "author": "NoahNeedleman",
    "date": "2025-12-22",
    "content": "Is there actually such a thing as dirty power? Or did monster cables just incept us all into buying power conditioners in the 2010s?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1453026606074302555",
    "author": "hyanrarvey",
    "date": "2025-12-23",
    "content": "Power is extremely important and pretty over looked in most of the home studio builds",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1453056410991460612",
    "author": "Gerhard Westphalen",
    "date": "2025-12-23",
    "content": "Yes but your $200 power conditioner isn't going to fix it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1453061939440648393",
    "author": "hyanrarvey",
    "date": "2025-12-23",
    "content": "Nor is a 3000 dollar power conditioner",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1453062590828904529",
    "author": "SoundsLikeJoe",
    "date": "2025-12-23",
    "content": "Best thing I've ever done to fix dirty power was find a good electrician....   not just a dude with a truck, but someone willing to work with the problem.  We replaced/added a better earth rod to the box, and found a bad breaker.  Solved the worst of my dirty problems.  Having a 3000 dollar power conditioner at that point also helped some....   but that's like room correction.  Don't count on it. Fix the space first.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1458228842001993768",
    "author": "Berlin",
    "date": "2026-01-06",
    "content": "Samply desktop sync still in beta as well.. but IDK about all that. Will need to rewire my brain.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1459271925070299348",
    "author": "Slow Hand",
    "date": "2026-01-09",
    "content": "What's the strategy with aliases and forwarding?\n\nOn the whole I'm very happy with Gmail. In fact, the phone app works great. I'm very happy with it. However, I have so many accounts that it's cumbersome in a browser to open a window to check for updates on each account. I wish there was a consolidated viewer, or some sort of global indicator to show me my total number of new messages across all accounts.\n\nIdeally, Google would just make their own desktop app. Unfortunately desktop software is against their strategy these days. So we're unlikely to see that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1459273613889765658",
    "author": "Slow Hand",
    "date": "2026-01-09",
    "content": "I guess at the end of the day I'm looking for a more centralized experience while using Gmail on the desktop. The phone experience is great.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1459302887229227193",
    "author": "andrew_yv",
    "date": "2026-01-09",
    "content": "Spark is pretty good as both a desktop and iPhone email manager, though I did have occasional issues with it. But the main draw for me was that it would auto categorize emails into categories like promotional and newsletters, including non Gmail accounts. I’ve recently switched to Canary which is better in some ways and worse in others. I’d say both are worth looking into",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  }
]