[
  {
    "id": "1009815950876491887",
    "author": "NoahNeedleman",
    "date": "2022-08-18",
    "content": "Oh buddy do I get that. \n\nIt was a big realization for me that I’m an Enneagram 2, “The Helper.” I often find real purpose in helping others finish songs, but when I’m only creating for myself I don’t have that natural “why” like I do when I’m looking at someone else. \n\nI’ve embraced that for myself though. Even though I theoretically could be writing producing mixing shit for myself, I realize it’s just not that interesting for me, and way more fraught with things that don’t bring me joy. So I make sure that any “artist” type thing I do, any time I’m doing something for myself, I have someone else to work with and for and support. For me, “alone” just isn’t that fun. \n\nThat’s why I’m so active on the discord, not cause I like to share as much as I really orient myself in community. I don’t need or even love the sound of my own voice, but it makes more sense to me when I’m the context of others. \n\nI used to think that was a weakness, (thanks Ayn Rand,) but now I employ it thoughtfully and it’s a bit of a superpower. \n\nNot saying you should think of yourself this way, but the artists I know who are successful on a large scale are obsessed with themselves in a way I was never comfortable with. And thank God for artists like that, cause I find my purpose there. It takes all kinds!",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200603495351464108",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "I always tailor it to the artist in some way. It's a combination of making fresh ideas specifically for them and taking existing ideas that could work (sometimes reworking existing ideas). I never go into a session like an actual blind date where I don't know anything about them.\n\nThe challenge is always do I make something that sounds like what they've done, or do I make something that sounds like where they're going? That's impossible to answer. I've had success in major label POP artist sessions by having a 100 year old piano and specifically not playing tracks. Meaning, you never know if an artist is tired of doing the same shit. Because I have confidence in my skill as a producer, I'm happy to get an A+ ballad because I know I can turn it into whatever production I want. \"In The Name Of Love\" is my most successful example of this. It's an emotional 3 chord piano ballad that was produced into a festival EDM anthem. \n\nI've had the most success being prepared for all options. Mostly because that makes me flexible for what an artist is feeling that day, but also because the more stuff I make, the more music I'm making. If I prep for a session, I'm not working cold. The prep is also like a psychological and creative warm up for me. Prep makes me a better improviser.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990776963394326528",
    "author": "Slow Hand",
    "date": "2022-06-26",
    "content": "Depending on the kind of wall that you’re hitting with her, there are a few simple approaches that you can suggest that will get her thinking about the different dimensions of melody and how to play with it:\n\nA) Expansion - How long is the melody? It is a small fragment, or a full sentence? Stretch it out over a longer period of time. Sing it half as fast. Hold certain notes for emphasis.\n\nB) Diminution - Compress parts of the melody into faster runs. Make it shorter. Remove notes. Simplify the melody to its melodic essence.\n\nC) Repetition - Take a fragment of the melody and play it again. And again. And again.\n\nD) Modulation - Take a melodic idea and transpose it to different keys. The first movement of Beethoven’s 5th Symphony is built entirely off of a simple four-note motif. He got a lot of mileage from such a small element.\n\nE) Dynamics - Play with volume or intensity. Encourage her to go from soft to loud, or loud to soft. Accent certain notes for emphasis. This one is really powerful. For inspiration suggest that she try voicing her dynamics like a great horn player might. Get her to clip her notes very short or to make them “bloom” or be soft and round. Make them bark or be breathy.\n\nF) Be Another Instrument - Encourage her to try writing as another instrument with her voice. Sing a bass line. Sing a horn part. Sing percussively like Michael Jackson or James Brown would.\n\nG) Role Playing - Give her a character and a persona to inhabit. Make her sing the same thing as different personalities or people. Pick a melody and then make her sing it in the style of three singers that she’d know.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328101073243607061",
    "author": "Slow Hand",
    "date": "2025-01-12",
    "content": "Apropos of nothing, this is still one of the best $20 I’ve ever spent. \n\nJust lyrics and chords. I can crack it open at any time and start playing the songs that I know deep in my bones.\n\nSo much condensed songwriting goodness. I wish that this existed for more artists.",
    "reactions": 11,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "829370154273079346",
    "author": "Josh",
    "date": "2021-04-07",
    "content": "AYE WERE DOING THE SAME THING. Finally got a decent income stream in metal and said fuck thaaaattt and moved to pop. I’ve just been writing with friends, using those tracks to get with smaller artists, and pushing from there.\n\nAlso, to add to the cold call grind. There’s a really solid formula I’ve learned in marketing to get higher open rates, and my brother who’s launching a clothing brand just found out a really silly formula to get that even better. He’s getting clothes sent out to major label artists right now for free (aside from the cost of shipping and production) because he’s speaking the right language and sending clothes that people actually want. Same thing can be applied to songs. Might make a little outline and post it in here for everyone because it’s not only super important for the entry level grind, but it helps in day to day communication as well!!",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261743620416081920",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "I'll give a point by point analysis, cuz why not?\n\nFirst off, I love Irving Berlin. One of the greatest ever. White Christmas, God Bless America, Always, Cheek to Cheek. A master of the craft. \n\nThat being said, adhering to portions of this list could lead a songwriter in 2024 exactly in the wrong direction. Keep in mind two things: one, great artists are rarely great explainers of what makes them great. And two, his career ended in the late 1950s. This means his golden era was pre-Motown, pre-Beates, pre-television, etc.\n\nOk, my thoughts:\n\n1. This doesn't apply any more. He's speaking in relation to a time when music was more complicated. Music is MUCH simpler now. For example, White Christmas has a much larger vocal range than every Selena Gomez song. Also, 99% of songs today are recorded by someone writing it. It's much more important for the singer/songwriter to sing the song in their vocal range than to worry about some future audience. People rarely write songs and then hire a demo singer any more.\n\n2. (and 7 and 8) The best advice on here. Simplify. \"Kill your children.\" Remove things you love in order to make the song more concise.\n\n3. No. The culture changed, there are a million counter examples since Motown/Beatles. Sure, you can write a song without gender (\"you\"), but saying songs SHOULD be genderless is just wrong.\n\n4. Don't write frivolous songs? I'm all about authenticity and connecting emotionally to a song, but this is strangely phrased and doesn't seem very instructive. \n\n5. Every time I've seen people try and follow this, they write bad songs. As the great David Foster said \"There are only 12 notes and 26 letters, and Beethoven and Shakespeare already did it better than you.\" You're unlikely to find original chords, melodies, or words. The only original thing is your own life experience. Don't be \"original,\" be honest.\n\n6. Kinda. I guess I mostly stick to this. But also, there are thousands of great counterexamples after 1960.\n\n7, 8, 9. All great",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328022413983879199",
    "author": "Zakhiggins",
    "date": "2025-01-12",
    "content": "1. I do it first thing in the morning when I wake up before things like my phone ruin my brain for the day. \n\n2. Make it a routine. I make some time before i have to go anywhere every morning to try and create something. When your brain gets used to the idea that you're going to that place at the same time every day, once you go there then the ideas flow better with time.\n\n3. Understand it's ok to write something bad, with time good ones come. \n\n4. Understand that a song is never actually finished, it can only be abandoned wherever you chose to abandon it.\n\n4.5. Understand that it's ok to figure out what a song means after you write it.\n\n5. Understand that we're trying to make trees, not tables. (As in sometimes it's not healthy to keep refining something till it's too straight edge and the vitality is gone from it)\n\n6. Said it already but saying it again, don't check your phone before you write\n\n7. I don't always write lyrics. Sometimes i write a melody, sometimes a chord progression, sometimes lyrics. Every now and then i do a session of what i call Lego writing, where i try to see what lyrics i wrote before fit with what melody/chord progression etc. \n\n8. Oh and did i mention, it ruins my creativity to check my phone before i make anything? \n\nThis is what works for me, hope it helps you!",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983960359440384020",
    "author": "Slow Hand",
    "date": "2022-06-07",
    "content": "In this case spaced repetition is your friend. Choose an interval of time that you want to spend practicing a song (10 min, 15 min, 20 min) and practice Song #1 for that amount of time. Then - even if you're not proficient or haven't yet committed the song to memory - move on to practicing Song #2 and let the first song process and consolidate in your memory while you work on Song #2. \n\nWash, rinse, repeat until you go through the entire rotation of songs.  If some songs are significantly more difficult to learn or memorize then come back to them more often. The point is to constantly be checking back in on the songs that you're trying to learn just as you're on the threshold of forgetting them.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058037149146038312",
    "author": "NoahNeedleman",
    "date": "2022-12-29",
    "content": "I used to do a thing like that with a bunch of buddies in LA every September. \n\nIt started cause I wanted to practice using key changes or modal shifts as a songwriting technique, and so I had rules for myself:\n\n1) first idea that fits, wins. No agonizing over lyrics or Melodies or whatever, if it rhymes and makes some kind of sense, move on with it. \n2) first year: ever song needed a key change or modal shift. Second year: shifting or alt time signatures. Third year: some other esoteric tool I wanted to learn etc…\n3) the moment you’re done, record a voice memo and send it to someone. Mistakes and all. \n\nThe key for these rules was the make the quality of the songs less important than the act of writing. But damn if I didn’t get two or three real winners every year.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076571860617134141",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "This and one or two more parts\nWith chords and melody\nDo it daily for a year\nA great songwriter you'll be",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069408608732860527",
    "author": "austenballard",
    "date": "2023-01-29",
    "content": "So it seems like the format of #song-a-week with everyone doing a song every week is kind of difficult, not least because we all have a lot of other things going on, or get sick as I have, or what have you.\n\nI was wondering if we might switch it up to make participating easier and more practical. I've been binge-listening to Conversations and in one episode, someone suggested something that might be fun.\n\nIt's a game of telephone/Chinese whispers (is that name for it cancelled?) but with songs - so the first person in the chain writes a song, then the second person listens and rewrites it in their own style, and so on and so on. The key point being that if it's your turn to write, you only get to listen to the song before you ONCE before you write yours.\n\nI really like this idea, I think it'd be cool to see what ideas we get from each other, what stands out the most from each person's interpretation, and so on and so on.\n\nThoughts?",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880155087626981396",
    "author": "oaklandmatt",
    "date": "2021-08-25",
    "content": "yes and do it all the time. And write more acapella. Thats the most underrated shit. Truthfully, a lot of the best songs I've been a part of have been started as a lyric/melody combo before any chords were played.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261803179989798933",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "You're absolutely right that trying to copy existing hits rarely makes great songs. He's 100% correct on that point.\n\nI'm saying that songwriters often fall into the trap of trying to be \"original.\" They mistakenly think this means they should try to invent new phrases or not use \"generic\" words or try to do something \"interesting\" with the chords. Instead of doing the only original thing that is possible which is tell your story and express your taste. This is actually much more difficult to do because it's incredibly vulnerable.\n\nYou can compose fully original compositions this way. But it's also interesting how much groundbreaking music comes from direct appropriation of existing popular music. \n\nFrom folk music (\"Blowin In The Wind\" is a melody from another song) to hip hop (all of sampling) to producers and DJs making careers from remixes, playing around with current or past hits can also yield incredible new music.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880520432665645127",
    "author": "Josh",
    "date": "2021-08-26",
    "content": "Now that I think of it, the best songs I’ve written are when the melody and lyrics hit me while I’m still fucking with chords, and there’s nothing even in the DAW yet. Gonna spend the next few weeks hopping on voice notes now. Will update my findings.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178394854213034135",
    "author": "Rob Domos",
    "date": "2023-11-26",
    "content": "His stance against slant rhymes seems to be more about being in favor of things fitting very tightly together and having intentionality and form and structure. He and another friend of mine viewed slant rhymes as mostly a product of laziness, as if the writer couldn’t be bothered to find something that truly fit.  \n\nI countered referencing the hook to an Olivia Rodrigo song where every single rhyme is a slant rhyme, which IMO adds to the value of it because she’s trying to express how things don’t quite fit and how the thoughts in her mind are unresolved, and the rhyme scheme should reflect that to create a unified feeling. \n\nThe lyrics are:\n\nYou’ve got me thinking\nThat two plus two equals five \nAnd I’m the love of your life \nCause if rain don’t fall and sun don’t shine \nThen changing you is possible \nNo, Love is never logical \n\nHere she’s searching and grasping. She’s unresolved. She literally uses a metaphor of the math not adding up. Why would we then make the math add up phonetically? It would weaken the effect. \n\nAlan was meh on it. \n\nI also argued that hard rhymes can be like the phonetic equivalent of a classical Haydn V-I movement that has very little color or tension, and that slight rhymes can be like jazz chords and that adding a 7 and a sharp 11 on top of the tonic chord doesn’t mean you “failed to resolve”. Someone else at the table was like “well show me a truly great song built on slant rhymes and we’ll see. I’m open to it” and in my head I was like “I thought I just did” but they didn’t love it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287561324687134760",
    "author": "Slow Hand",
    "date": "2024-09-22",
    "content": "I think this is a good approach. Start by suggesting that you both do the writing with \"stripped down\" instruments like a piano or an acoustic guitar. Or at least an electric with no pedal board. Leave that at home. Something that will force you both to focus on the core song and not be diverted by sonic considerations. Those can all come later.\n\nThink of it like writing a lead sheet: Chords, melody, and lyrics. This is the heart of the song. Focus on getting that right and you'll unlock so much potential.",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "860535201440202792",
    "author": "Alessandra Morris",
    "date": "2021-07-02",
    "content": "it’s like an  intuitive thing i think. But like @oaklandmatt said, it kinda comes with time, practice and also messing up. I’ve found great hooks by making mistakes. Sometimes i just grab the idea for a hook from a portion of the top line that I already did, I just change it a bit, make loads of variants of that motive. Or just move around the key of the song and get a lot of options. You know what i mean? Its hard to explain by writing😂But its just trial and error tbh. Don’t think there is like a formula 🤷🏻‍♀️",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036208089847828491",
    "author": "rae",
    "date": "2022-10-30",
    "content": "Hi peeps, does anyone have any advice on writing chords for songs? I’ve always written lyrics with a melody and then given that to someone else so they can fill in the right chords but I really want to be able to do this myself but I struggle a lot with it so I was wondering how other people find the right chords for songs to match a pre existing melody? Thanks in advance! 🥰",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036266048229482537",
    "author": "Chris Doms",
    "date": "2022-10-30",
    "content": "Whatever key I’m writing in I’ll usually write out all the chords in that key first so I know what I can use.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205822535078256690",
    "author": "Deleted User",
    "date": "2024-02-10",
    "content": "One of the guitar teachers I had in college was a big Joni Mitchell fan. She told me that Joni Mitchell suffered from polio when she was a child, and after polio- chord shapes became difficult to play. So she started changing the guitar tuning to be able to play those chords. It’s really cool how she turned limitations into more creative possibilities. It’s a good reminder for “there’s always something to be explored”",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1208061627245793301",
    "author": "Zakhiggins",
    "date": "2024-02-16",
    "content": "I think my favourite thing about alternate tunings is actually not learning them. You can come up with some pretty unique stuff that you may not have otherwise thought of just by fooling around and not knowing what you’re doing. I get a similar effect off playing left hand guitars, or other string instruments that have different tuning to guitars. It’s like transporting myself back to when I was 14 and knew no music theory at all, trying to figure out how to play the chords and melodies that were in my head.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276580607148691633",
    "author": "LAPhill",
    "date": "2024-08-23",
    "content": "Biggest tip is to listen to other genres for inspiration. You can also try swapping one note in a chord so that it becomes less expected (i.e. G major becomes B minor with a halfstep move). Swap a couple of notes and step outside the key for a second (instead of E minor to C major, go E minor to C minor, or E minor to A major, or E minor to G# major, just by a couple of small adjustments).",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298339227267895297",
    "author": "Jack",
    "date": "2024-10-22",
    "content": "I guess a more musically relevant suggestion would be to instrument swap. I usually dive over to the piano from guitar and try figure out what I’ve been doing and something about the pre-amble of warming into the chords and voicings or whatever can often lead me to new harmonic ideas; especially nice having the left hand to add colour and movement to chord patterns.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "889949871602282549",
    "author": "Zack Hames",
    "date": "2021-09-21",
    "content": "I think communicating that through text is *incredibly* difficult. What i usually do is try to confirm by describing what they're talking about BACK to them while also using the correct terminology.\n\nI have a good friend / amazing writer who calls \"measures\" how many times a progression repeats.  So he will say something like \"just add another measure\" or \"have that layer fade halfway through that measure\" or something, and I just go \"wait, so you want it to repeat through the whole progression again or am I missing something?\" Just an example. Then later I may take an opportunity to explain that a measure is much smaller than the entire progression and try to explain the difference. He's incredible, amazing writer and has amazing ears but does not have any training or speaks with any technicality with almost anything in his life. It would be almost impossible to actually break those habits for him, he just doesn't care.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121196437380796486",
    "author": "Ross Fortune",
    "date": "2023-06-21",
    "content": "I’m never the artist in the writing sessions I’ve done, but I am a prepper, so sketching out a bunch of beats (might do 5-10, 1 of which will be decent) in the week preceding helps me go in feeling calm. That way I have total freedom to see what happens in the moment, secure in the knowledge that if nothing does, there’s at least a solid set of chords / sounds / a groove that we can use as a jumping off point.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121197362157715580",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": "You underestimate my ability to type with one hand and hammer chords with the other",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153374214586372137",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "And I’ll drop them into my Apple notes and listen to them a couple times a week and I actually realized a verse and a chorus I had where in the same key and fit together perfectly.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153390146163589270",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "Fred again said in some interview he likes to just make presets and drum kits and ableton devices when he isn’t in the mood to be creative and that’s been a major mood lately.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220668347700744222",
    "author": "Deleted User",
    "date": "2024-03-22",
    "content": "There may be two ways of approaching this\n\n1: Trying to make the better versions of ‘same type of songs‘.  I do this myself, using same moves that have worked before I can make a better version of the same type of song. \n\n2: Copy from style you are unfamiliar with. This can get you out of making ‘same type of songs’\n\nI think there are main four elements of musical habits: rhythm chords cadence/resolution tempo \n\nyou may find there are a few key things that you gravitate towards like your “home” in all four of those. You can explore outside of the patterns that you lean on in those four elements if you want to prioritize breaking out of some of the habitual choices.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275724524813553675",
    "author": "bookchild",
    "date": "2024-08-21",
    "content": "This has made me realise that I don’t write as many bridges as I thought I did - I’m not sure how I feel about that, but thanks for getting me thinking.\nWhere I have written bridges they seem to have a different pov/understanding than the song to that point. Maybe they also have a key change that reflects this. \nI can’t think of a time that I’ve added a bridge to a song. If I’m editing I’m more likely to take bits out (more clay is rarely the answer).  I think bridges have always felt necessary/natural when I got to that point. Maybe I’m not enthusiastic about another verse/chorus or maybe I just try another chord that make me go “oh”.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385766847168909353",
    "author": "Ross Fortune",
    "date": "2025-06-20",
    "content": "Ah, gotcha. I think. Yeah the way it typically comes together for me is good chords (even better if those chords have a good rhythm), then gibberish melody that might have some real words and phrases mixed in, then lyrics to those melodies. \n\nI know @oaklandmatt is a proponent of lyric first writing. I’d love to get better at that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399130324319076512",
    "author": "Ross Fortune",
    "date": "2025-07-27",
    "content": "What I’ve enjoyed about considering Ralph’s rules is that they’re making me think through a different lens about both the lyrics in songs I know and love, and the lyrics I’m writing and how they work in different contexts.\n\nThe character in Adele’s “Someone Like You” is a loser by Ralph’s definition. But if they weren’t, how would it change how I identify with them? How would I relate differently to their experiences? What emotions would I feel? How relevant would those chords and that melody be, if the sentiment changed? Would the song have legs at all?\n\nI can be a little more cognisant of how much salt I might add next time, and how much sugar I’ll need to  balance it out.\n\nLike when confronted with Jon’s no compression thing a few years back - a lot of us tried it, discovered it’s not an always/never dichotomy, but in doing so gained a deeper understanding of why and when and how hard we can use that flavour and to what effect.\n\nIt all sharpens the axe.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1406208393181663242",
    "author": "Ciweeeee🐢",
    "date": "2025-08-16",
    "content": "There's a wonderful album called Siftorde by Tidiane Thiam. Now it's all instrumental guitar but I'm pretty sure it's all in the same key and follows similar themes between tracks and it's beautiful!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471659259895746641",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "1. Write a song every day (or attempt) certainly you’ve heard of and likely tried this, but nothing beats reps.\n\n2. More technically, write out the structure (intro, verse, chorus, etc) of some of your favorite songs and mimic it exactly. Even as far as how many measures, or even dynamics (or tempo changes!)\n\n3. If you play an instrument, Learn “great” songs. And ideally sing with them. Playing the best songs in the world will seep into your writing and show you new ideas on chord movements, melodies, and the physicality of a great song.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472776139452977224",
    "author": "oaklandmatt",
    "date": "2026-02-15",
    "content": "As I'm sure you already know , there is no such thing as enough. It's like how perfection doesn't exist. \n\nIt may be easier to think of being a writer on a spectrum from hobbyist to full-time artist. The one end is the hobbyist who does it whenever they want and have time (other priorities take precedent). The other end is the artist who is compelled to do it and it has to turn it off in order to live a normal life.\n\nMost people here are somewhere in between. For most of us, the key is to do a combination of two things:\n\n1. Find every way possible at all times to joyfully write. Direct yourself toward it with how live. Write silly things for fun, have a guitar you like to play next to the place you always like to sit, write emotional things for catharsis, write with other people for the collaborative joy, sing in the shower, write on different instruments that feel inspiring, etc etc \n\n2. The harder part is developing habits and practices that keep you consistent. It's easy to write when it's fun. It's harder to write when it's not fun, and that's the time to make sure you're doing it. Daily practices, schedules, deadlines (self imposed or otherwise) are the best way to do this.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827584236134596648",
    "author": "Josh",
    "date": "2021-04-02",
    "content": "Okay first question. Best music theory resources? My theory is garbage 🗑 having come up in metalcore. My understanding of rhythms are great having come up in drum line with interest in drum corps, but anything else is just so hard for me to grasp. I’ve taken a few lessons and have the absolute basics down as far as keys/chord progressions, but I’m still very slow and need to get better.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827587312321429504",
    "author": "joebegalla",
    "date": "2021-04-02",
    "content": "This is probably going to be the most “music school” answer, but since you have the basics down, I’d pick up a Real Book and analyze the chord progressions of every tune. That really helped me take my basic knowledge and learn how to develop it and make my chord progressions and voicings more interesting. The jazz stuff in there can be complicated, but once you learn a little of how that harmony works, your command of chords and harmony in other genres is powerful.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827587584322175007",
    "author": "TALLL",
    "date": "2021-04-02",
    "content": "do you just keep doing the same progressions and you want to expand?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827587950774059019",
    "author": "Josh",
    "date": "2021-04-02",
    "content": "Correct. Like I can basically figure what key something is and that’s about it. Different chord voicings are very hard for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827588373564489728",
    "author": "David Fuller",
    "date": "2021-04-02",
    "content": "For more modern harmony I'd be looking at the Berklee harmony curriculum",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827588550539214868",
    "author": "TALLL",
    "date": "2021-04-02",
    "content": "it helps me try and get out of my common progressions and voicings",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827588585673850891",
    "author": "greghvnseb",
    "date": "2021-04-02",
    "content": "Best song writing material for beginners IMO is the Beatles catalog. Great progressions and great voicings, harmony, melody. Great resource",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827588899534012476",
    "author": "David Fuller",
    "date": "2021-04-02",
    "content": "It's been 6+ years since I took a harmony class but I still remember a lot of it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827592434095489034",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Yeah. This is a big part of how I came up and got some nuts and bolts songwriting chops. I wanna recommend this book right here: It's their entire song catalog as just lyrics, chord changes, and some chord diagrams for the guitar voicings. This is pound-for-pound some of the most information dense, yet simple, description of good songwriting that I would recommend. https://www.amazon.com/Beatles-Complete-Chord-Songbook/dp/0634022296",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827592933011619858",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "It's such a good way to just pick up your instrument and immediately start exploring some solid songs. It's best if you play guitar, but don't let that stop you. Anyone can use this once they know how to spell chords.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827632871279820881",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Ok. This is far from a comprehensive resource, but this Youtuber *Music With Miles* has some of the *best* harmonic theory tutorials/explanations I've ever seen. He's only got a handful of videos, but his pedagogy is outstanding. Just watch this video on modal interchange and tell me it doesn't make you want to immediately start playing with chords: https://www.youtube.com/watch?v=1dRA28cdt5c",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827635658511482910",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Let me ask a more direct question: What are you interested in learning? Do you just want to learn some diatonic cowboy chords that you can play on guitar and sing over? Do you want to learn jazz harmony? Does classical counterpoint interest you? Music theory is really broad and takes time to absorb before you can comfortably move on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827635837835149333",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Depending on what styles you're interested in you can probably disregard the more esoteric stuff, for example. Nobody is using Jacob Collier-style negative harmony or mirrored quartal stuff unless they're making avant classical or are a Herbie Hancock-grade improv virtuoso.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827636734870814720",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Ok. Let's start from the beginning. Do you know how to build a major/minor scale from a root note? Do you know how to spell chords (major, minor, seventh, diminished, augmented, suspended)? Do you know how to find the diatonic chords that are derived from a given major scale?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827637734603489320",
    "author": "Slow Hand",
    "date": "2021-04-02",
    "content": "Those are your basic building blocks. Once you can spell chords and know your major and minor triads without having to concentrate too hard it's gonna give you a lot of facility. As you're doing this, I'd reiterate what Matt and others are saying: start playing whatever songs you're interested in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827830288155279380",
    "author": "rae",
    "date": "2021-04-03",
    "content": "One of my favourite music education YouTube channels is: David Bennett Piano. This dude breaks down popular songs and focuses on elements such as the scale/mode used, key or time signature it is in etc.\nSupppppper interesting stuff \n\nhttps://youtube.com/c/DavidBennettPiano",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851462412610961458",
    "author": "Yago Ibars",
    "date": "2021-06-07",
    "content": "I've been having a thought on my songwriting I wanted to share here. As a songwriter I have this toolbox of melodic and harmonic approaches  that I can use to solve any problem when making a song, or to have direction to create another section. But recently I've been noticing that something that makes a huge impact on songs is how the different sections relate to the tempo of the track. I think this might not happen to people who write to a beat, but I think that when you are playing an instrument, tempo is so fluid that some parts of a song might \"feel\" good and others won't (at a same tempo). When all the sections flow well into another in terms of tempo (and probably how that affects to vocal delivery) it sucks you in as a listener and it is way more singable/enjoyable. And now I'm starting to see this as a priority more than which notes of the scale have more weight on the chorus and stuff like that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855592297282011197",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "If you write the entire song to nothing but a chord progression, you usually have to simplify the instrumental quite a lot to make room for the melody",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855595360926564372",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "And the instrumental is mostly just straight quarter notes and 8th notes following a chord progression",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "859937411597336597",
    "author": "antoniohannamusic",
    "date": "2021-06-30",
    "content": "Hey there, thanks for getting back to me so quickly! Yeah I can completely understand how you wouldn't want a channel of thumbs up, fire and goat emoji's that actually don't achieve anything tangible.\n\nI'm actually much more interested in the idea of a collab channel like, \"I have a song with an artist, here it is, get in touch if you want to hook up a writing session\"\n\nOne of the key things @oaklandmatt mentioned on here before is write as many songs as you can with as many people as you can, could be a super cool way to level people up & connect with a goal like \"help me finish this\" or something to that effect... don't know, just a thought 😄",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876219864585490433",
    "author": "Yago Ibars",
    "date": "2021-08-14",
    "content": "In my experience the sweet spot is somewhere in between both, as you guys have said. Melodically I tend to be like @Rob Domos and make everything as simple and predictable as possible, but sometimes it feels too easy and there is nothing that stands out. Lately my approach has been to use lyrics and chords to spice things up. For example, If I've got an idea for a lyric that I like, most times the metrics of it won't be incredibly predictable, and when I come up with a melody for it will be a bit more interesting than if I started out with the melody. Maybe then, for another section of the song I'll start with the melody and it'll be simpler. I think contrast is key. It really is an interesting topic!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "932672619298291732",
    "author": "bennythetweet",
    "date": "2022-01-17",
    "content": "The roman numerals represent scale degrees. Capitalized numerals are major chords (triads), lower case are minor. Key of C, “I” = C. “ii” = D minor. Etc. This shows common was to get to the 1 (or C or resolve the progression). So, I > iii > IV > V > I = C > E minor > F > G.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1005945644801851472",
    "author": "Will Melones",
    "date": "2022-08-07",
    "content": "I think it matters very little how classic they are. To me it’s those songs that you hear and something novel jumps out to you, like *whoa, what was that chord relationship, and why does it sound so soulful*, or *I keep noticing this similar melodic contour in songs that I like*. I enjoy picking through songs I liked in high school or childhood and trying to find the things that make them feel nostalgic. Or new songs that have a bit of a ‘classic’ quality that sets them apart.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1006295149522993204",
    "author": "ALXCPH",
    "date": "2022-08-08",
    "content": "That and open guitar chords with close intervals rubbing making it all über EMOtional 🥲",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034368091167150111",
    "author": "ehutton21",
    "date": "2022-10-25",
    "content": "Like honestly even just being a halfway decent friend and asking someone how they’re really doing, because you know they’ve got X situation going on and they’re normally in a much different mood, can be a pivot. Once the progressions are arranged and the key song ideas are fleshed out to everyone’s liking enough to lay down Vox, you’re pretty much just swapping visions for a mood and aesthetic and thinking about what you want people to hear from you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1046397869340504124",
    "author": "Ross Fortune",
    "date": "2022-11-27",
    "content": "Also discovered this Love On Top beating monster in that thread, with a whopping 22 key changes 😂 “Never Gonna Let You Go” by Sérgio Mendes (1983) https://open.spotify.com/track/5u8bqfaYSh0qVTsgslPknf?si=KYHFlXmgRIuocC_UynIU8Q",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069760210165567599",
    "author": "ehutton21",
    "date": "2023-01-30",
    "content": "“Flowing” being that idea where you’re not thinking about getting to the zone, but you’re just in the zone. It can include anything from just concepts and lyric ideas to even just finding top lines over random instrumentals I have laying around or chords I’m feeling. I’m pretty much just a bedroom guy, so sometimes all I need is an instrumental or even just my midi and my favorite sound. Sometimes I just write down images—it helps with that feeling of articulation if you try to just describe that which is around you or in front of you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075386842586828800",
    "author": "rae",
    "date": "2023-02-15",
    "content": "@OJ I agree with everyone else in that collaboration could be an awesome avenue! I tend to write songs lyrics first, then everything else and have only once or twice come up with chords/gibberish in place of words first and then worked out the lyrics later - when I was stuck i found walking around my house  for an hour just singing random lines to that pre existing melody I created and recording everything on voice memos to go through later helped a lot!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075403284489175122",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "Good social skills must be key I'd assume. I also see like the \"just be yourself\" in these creative rooms even if your more shy but if you're bringing something to the room that people want and ur positive i'd assume ok?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121252536859492423",
    "author": "Deleted User",
    "date": "2023-06-21",
    "content": "Also like Ruairi said, “what to say” could come up as you have casual conversations with your writers. That’s how it goes sometimes. \n\nBut also as Ross mentioned, there’s a whole lot of other things you can prep that is more abstract or not directly related to what you want to say. Could be just chords, riffs, groove, song titles, or a visual prompt. \n\nI also found that the more I work and less life I have the less there is to say… Not saying that this is the case for you but if it is, might be a time to go watch a movie/documentary or read books to spark some inspiration",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137960189421703188",
    "author": "rae",
    "date": "2023-08-06",
    "content": "how do people go about learning different strumming patterns on guitar when songwriting? i feel like every song ive written lately is the same pattern over and over,  just different chords...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156086843088056392",
    "author": "Josh",
    "date": "2023-09-25",
    "content": "I said I wanna write a song like Noah Kahan tonight and asked what chords I should use and it actually threw chord progressions at me.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1156087051347828786",
    "author": "austenballard",
    "date": "2023-09-25",
    "content": "oh i did a test a while back and it totally flubbed chord progressions. let's see if it's doing any better these days",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188054994327457822",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "I think that is what I am after; How do you say the same idea or concept/story but deliver it tastefully. Just like the same E major chord could be delivered in different voicings and different style of playing or instruments even. \n\nMaybe it’s just about paying attention to it more. I generally pay more attention to music than words by default, so that might be a factor that plays into it. \n\nTechnically- with drums for example, you can use the same tools, try to play it or sequence it with the feel as close to it as possible, and break down what’s on it in terms of processing. If I go further, I can look at how the drums are interacting with the rest of the ensemble. If I just want to rip off the drums from a song, the first three will pretty much get me there. \n\nD’Angelo’s Voodoo is an album I constantly go back to study for the band interaction. Questlove is usually playing straight eighth notes, and very simple pattern. but how open the hihat is, and where he’s hitting, and when he makes the choices to pop the hihat out or kind of let it hide behind the instrumentation is very interesting. Perhaps subtle spontaneous decisions like that isn’t really replicable but I just take it in physically and try to see why he made this by looking at what other instruments are doing. You can just pay attention to how he plays hi hat and go wild playing just the hat along",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199473948597956669",
    "author": "Deleted User",
    "date": "2024-01-23",
    "content": "A couple of things I always do before and during sessions\n\nHave some things ready to play so collaborators can understand my background, and same with collaborators. I would ask them to play some things they did and grew up listening to so I can understand where they are coming from with decisions or comments they make. \n\nAlways set up so it’s ready to record. have a phone running on record whenever music is played and the computer isn’t recording\n\nHave a few small incomplete ideas at disposal before walking into the sessions. Could be a simple guitar chord progression with a little something on top, could be riff or banging drum patterns. Important thing here for me is to continue moving on to next ideas if I don’t get an immediate response (which is usually singing on top) and continue to work my way into it. \n\nI like to have full drums ready to go somewhere on my computer. So I can just import it in, and it will get people moving. Splice drum loops are fine too. Some sort of instant vibe is needed in my experience. Splice really helps with that, because then you don’t have people looking at the back of your head trying to dial in drums or synth patch for more than 5 minutes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220657576333545534",
    "author": "Marshall",
    "date": "2024-03-22",
    "content": "Do any of you guys fall into the trap of writing the same type of song over and over again? lol. I feel like when I’m improvising over a beat or something I tend to make similar subconscious choices in the melodic structure/melodic rhythms/etc. the only way I can get out of it is by setting parameters before hand (ex: don’t start the melody on the 1…..use an AAAB structure……..make the A sections complex and have their own micro-structures/use many types of rhythms,  use like 3-4 notes in the scale maximum and mostly dwell on a single pitch/don’t hit the “money notes” lol…..Make the B section almost completely one  consistent rhythm, use way more notes in the scale than the “A” and hit all the notes you didn’t hit in the “A” to resolve the melody)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232647019361730621",
    "author": "Marshall",
    "date": "2024-04-24",
    "content": "Insane lyric writing mixed with great harmony between the melodies and the instrumental",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232647477211955211",
    "author": "Marshall",
    "date": "2024-04-24",
    "content": "Idk why but once the “Your wife waters flowerrrrs” hits in the chorus and resolves the tension between the melodies and chords it just gives me chills every time lmao",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1238890034380279808",
    "author": "montrose recording",
    "date": "2024-05-11",
    "content": "some pals and i ran down kaya by bob marley a couple days ago.  some of the intros were amazing and iirc were referencing the bridge harmony,  then drops into chorus",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242449834611445922",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-21",
    "content": "https://music.apple.com/at/album/raider-ii/674008092?i=674008202 the silences inbetween the piano chords in the intro are so long it almost seems like he‘s taking the piss but they add sooo much tension",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261769772903956550",
    "author": "jonmatteson",
    "date": "2024-07-13",
    "content": "I’ve been listening to that podcast “the history of rock and roll in 500 songs” that you posted a few weeks back and it was so interesting to hear that in the 40’s and 50’s it was completely normal to record the same song over and over again. Some bands only used one chord progression and would occasionally change the words or melody and they would consistently get #1’s off the same formula. Many bands would also cover other people’s songs and they would be hits as well.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276576592767881236",
    "author": "Chad Rodgers",
    "date": "2024-08-23",
    "content": "Made like 4/5 sketches today for an artist I write for, and I'm feeling a little merrrrr for all of them. Need to get out of my go-to chord structures, vibes and feels. Anyone have any tips for this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356405098821189753",
    "author": "OJ",
    "date": "2025-03-31",
    "content": "I lay down some chords, maybe add a little beat.\n\nGet my vocal chain on. And sing sweet gibberish away for a while. I really enjoy this bit and I'll listen back to the gibberish like this sounds nice.\n\nNow - how on earth do you go creating good lyrics to this melody to make it real?\n\nI realise I'm not really thinking of anything when singing the gibberish, no story line but I tend to automatically say things like \"she\" so almost talking about relationship/love kind of stuff but not necessarily what I want to go for actually.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385323238024024227",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "That is so interesting to head - I’ve never started with drums but can totally see this. I focus on the soundscape of the chords and melody, add a drum skeleton for lyric writing, write lyrics with song sections and overall composition in mind, then go back and change the production and drums to interact with the combination of the composition I envisioned and the cadence of the lyrics and how the drums interact with both at the same time.\n\nHuh - I’d like to be a fly on the wall for the drum first sessions to see how it all unfolds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385650221413040208",
    "author": "youngteam",
    "date": "2025-06-20",
    "content": "I saw a bit yesterday about writing songs on melodies rather than chord progressions giving way better results. Made sense to me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405934537938174033",
    "author": "Johnny I",
    "date": "2025-08-15",
    "content": "Working with a singer songwriter on a 4 song EP. The songs they want to record are all in G (with G as the home chord) and work well with their voice/thematically together as a whole.  \n\nIn a situation like this, would you suggest trying a capo to shift some of the songs into a different key (if it fits their range)? Or just treat every song individually and if they work best in G, roll with it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471659916518490165",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "Note on writing every day - focus more on the nuts and bolts of the song, the chords and melodies and structure. The production side and extra layers can come later. If you’re taking more than 5 seconds to pick a snare sound, you’re not focusing on the right thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472306361877659699",
    "author": "Will Trotman",
    "date": "2026-02-14",
    "content": "Hahaha and then a place that you might've written a chord change, you might not even discover that because you're just looping things. For me it can discourage the actual inherent growth of a song that's in the DNA of the song and lead me to rely on production tricks to keep it moving along.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]