[
  {
    "id": "1200522135244914768",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "If you're trying to be a highly successful professional, you should do all of these things and be prepared to adjust on the fly.\n\nI pretty much always have full songs, tracks, hooks, and concepts prepared. Much of the time, you won't use any of them on any given day. But good news: they're useful for future days.\n\nI've had all of that prepared and then the artist and I just chat for five hours, then write a song on a piano.\n\nI've had all that prepared and then cut song after song because the artist goes \"what else do you have???\"\n\nAnecdote that might be helpful: I've been in with an artist all week. Me, another producer/writer, and her. The other producer/writer has his rig set up and he also writes topline. We usually bounce back and forth depending on what the song requires. We've all worked together before and we had the whole week blocked out so there's no pressure to perform on day one. But we did three songs on the first day because she just came in firing. The first song she came in with a title and we worked from scratch and knocked it out in an hour. The other producer made the track quick with some existing drum loops he had prepped for her, adding keys and horns as we wrote. Then she asked \"do you have anything to play?\" I played her a track hook I had prepared. She liked it and we powered through that one in another hour. Then we broke for lunch. We caught up. As we were finishing she mentioned this one kinda stupid and sassy idea she tried to bring into another session but the producers didn't like it. So we wrote that one and it was fire. I tapped out a tempo as she rapped the hook idea and just make a skeleton beat on the fly.\n\nBeing way over prepared is rarely going to hurt you.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200603495351464108",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "I always tailor it to the artist in some way. It's a combination of making fresh ideas specifically for them and taking existing ideas that could work (sometimes reworking existing ideas). I never go into a session like an actual blind date where I don't know anything about them.\n\nThe challenge is always do I make something that sounds like what they've done, or do I make something that sounds like where they're going? That's impossible to answer. I've had success in major label POP artist sessions by having a 100 year old piano and specifically not playing tracks. Meaning, you never know if an artist is tired of doing the same shit. Because I have confidence in my skill as a producer, I'm happy to get an A+ ballad because I know I can turn it into whatever production I want. \"In The Name Of Love\" is my most successful example of this. It's an emotional 3 chord piano ballad that was produced into a festival EDM anthem. \n\nI've had the most success being prepared for all options. Mostly because that makes me flexible for what an artist is feeling that day, but also because the more stuff I make, the more music I'm making. If I prep for a session, I'm not working cold. The prep is also like a psychological and creative warm up for me. Prep makes me a better improviser.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200555574601986131",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "There are many stories of people marinating on a song a lyrics evolving over time, but that's mostly an artist who writes by themselves (Leonard Cohen, Tom Petty, Frank Ocean). I have rarely had that experience co-writing",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032479007997952060",
    "author": "masteredbyjack",
    "date": "2022-10-19",
    "content": "This is such a deep and cool topic. I’m in mastering now, so while I do a lot of collaboration it’s not quite what you’re getting at here but I’ve got a decent amount of experience in the room/tracking/producing. \n\nTo me it is a matter of developing trust and belief with another person. My approach is to be brutally honest with people and let the chips fall where they may. When things are amazing, meh, or bad. As @BatMeckley said…you want the $10k mic. Don’t waste the time with anything in the middle.\n\nSo in short — I’d just tell them exactly what you wrote above. But I tend to be more on the extremes — I’d like to think that people come away from working with me with a deep-seated belief in themselves and their potential but also honest feedback about very specific things we can do better. I actively seek to challenge my collaborators (which I’m sure you do as well). I’ve found people really respond to this if it’s done with the clear intention to help both of us improve and with the curiosity of the potential in the art!\n\nIn short, I’m an extreme encourager but also a harsh critic (in a kind way). I never let someone give up on themselves if I can help it and show love for them by very specifically calling out how I recognize their potential but see areas for improvement!\n\nI feel that I’ve always been able to tell when people do things like “lead with a compliment” or whatever. So that’s my POV on this whole topic…I just like people to be straight with me. When I have dealt with artists who clearly need the validation you’re speaking about….I’ll specifically call it out with something like “stop looking for validation you have the talent to do this now start believing in yourself”…etc. Seems sort of harsh but it really can cut to the chase and open up a deeper level of trust and communication.\n\nSometimes people don’t like this…and that’s all good too. Always lead with kindness and things work out. Depth > quantity",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1328022413983879199",
    "author": "Zakhiggins",
    "date": "2025-01-12",
    "content": "1. I do it first thing in the morning when I wake up before things like my phone ruin my brain for the day. \n\n2. Make it a routine. I make some time before i have to go anywhere every morning to try and create something. When your brain gets used to the idea that you're going to that place at the same time every day, once you go there then the ideas flow better with time.\n\n3. Understand it's ok to write something bad, with time good ones come. \n\n4. Understand that a song is never actually finished, it can only be abandoned wherever you chose to abandon it.\n\n4.5. Understand that it's ok to figure out what a song means after you write it.\n\n5. Understand that we're trying to make trees, not tables. (As in sometimes it's not healthy to keep refining something till it's too straight edge and the vitality is gone from it)\n\n6. Said it already but saying it again, don't check your phone before you write\n\n7. I don't always write lyrics. Sometimes i write a melody, sometimes a chord progression, sometimes lyrics. Every now and then i do a session of what i call Lego writing, where i try to see what lyrics i wrote before fit with what melody/chord progression etc. \n\n8. Oh and did i mention, it ruins my creativity to check my phone before i make anything? \n\nThis is what works for me, hope it helps you!",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009885679062364191",
    "author": "Will Melones",
    "date": "2022-08-18",
    "content": "I’m sure we all share this struggle to some degree. I’ve got some projects that I’ve put many hours into, just to let them sit on a hard drive for years.\n\nCo-writing has helped a lot, and has taken some ideas to places I never would have thought to go. The feeling that you have some moral obligation to your collaborators to finish is motivating. When you’re making art for yourself, it doesn’t benefit from those positive forces of peer pressure, and there’s a lack of constraints and no sense of urgency. \n\nI think making creative decisions is metabolically expensive. It’s easier to defer all decisions, which is why you see DAW-age producers committing to so little until the mix. In the same way you can defer the entire songwriting process, especially if you have someone else’s project or deadline to prioritize over your own.\n\nTo be both the creative mind and the executive finisher is a lot of exhausting context switching. Some options might be to split these responsibilities with someone else, or to dedicate separate time to each task. If someone hires me to print stems or solder a patchbay, the last thing I want to do is engage in creativity. But when I get inspired to write, I don’t want to stop and troubleshoot the plug-in that’s crashing the session.\n\nMaybe like the divergence/convergence approach would be to set aside an hour or three at the end of your day to finish ideas you’ve already got brewing—set a timer and finish a song, or a verse. Or, even better yet, dedicate the *end* of your day to play and experimentation. Then the next morning, hopefully with fresh perspective, get in the mood to tie up loose ends and prepare your next steps. You’ve demonstrated that you’re good at wearing that hat for other artists, so you can do it for your songs, too. Just maybe not while you’re in the creative flow.\n\nI’m not practicing what I preach, just brain-dumping. I definitely don’t have this figured out.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061318089460961430",
    "author": "Will Melones",
    "date": "2023-01-07",
    "content": "I just mean, you know, sometimes people ask to collaborate because it’s the good thing to do. But they don’t really want the feedback",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "829061668281384985",
    "author": "oaklandmatt",
    "date": "2021-04-06",
    "content": "This is a little of the top of my head, but I'll try and break it down like this. You're mostly going to get work/ collaborators for three reasons. \n\nThe #1 is your work (great songs, in this case). If you make great shit, people will either hear it and reach out, or when you meet someone, you'll send each other things and they'll love your work and want to be a part of what you can do. no matter where you are in your career, this is #1 always always always. When I was starting out, I produced some of the best sounding records for local bands, so other local bands wanted to work with me. Now, I (or my manager, or my publisher) can send a spotify playlist with songs people know, and that helps get me gigs.\n\n#2 is making shit with people you know personally. This is the best way to do it starting out since you don't have lots of great work out in the world. You need a little community of friends that you make shit with. I guess a lot of that will start moving online, but still the vast majority of great work gets done in person. Even during the pandemic, despite all the zoom writing session and remote work, most great stuff was still getting done in person. You gotta find your people and make things. Then you have the advantage of multiple people promoting your work.\n\n#3 is the pure cold call hustle. It's TOUGH. It's a low percentage game no matter what you're trying to do (be it mixing or writing or producing or being an artist). You have to understand that you may get 1% response rate from people. It's not to say it doesn't have value, but if you want responses, you have to have a good pitch and sending out thousands of messages. But the other thing about this is that writing songs remotely frankly fucking sucks compared to doing it in person. Songwriting is such an in the moment emotional thing. Producing and mixing remotely is very very different that doing real time creative vulnerability. This #3 applies more to non-songwriting collaborations than anything else.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "829067268910481409",
    "author": "antoniohannamusic",
    "date": "2021-04-06",
    "content": "Hey Matt,\nThank you for taking the time to come back to me and with such a detailed breakdown.\n\nI think of in terms of where I’m currently at, the \n\n#1 for me - released work is almost all band focussed; I probably spent the better part of the last 10 years recording rock, alt, pop punk, metal etc etc and only super recently even considered the idea that I could be a songwriter.\n\n#2 Makes loads of sense and is definitely something I will focus on in the immediate future - work with people I know and I like working with already, like even some of the artists outside their bands / solo stuff, I didn’t even really consider hitting up my favourite clients for this as I assumed (and have been met with hesitation) most bands don’t like the idea of having someone come in and “write their songs” but this approach seems way more achievable I.e just hang out and write something!\n\n#3 the struggle haha! Unfortunately being in London almost 100% of my work has been remote, I’ve found myself tracking drums, bass, vocals, trumpet etc all using AudioMovers and while it’s great to finish projects I agree with you that it’s way better to do any or all of the above in person.\n\nThat said maybe the cold call/ intro is more like a “hey, here is some of my stuff, let’s jump on a zoom call, if you don’t hate me in the first 30 mins come hang at the studio for a day” \n\nThat all said, if anyone on here wants to jump on and do a session hit me up 🤣\n\nThanks again Matt, even more keen to push forward now!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874398269361516614",
    "author": "oaklandmatt",
    "date": "2021-08-09",
    "content": "when you write songs, you're creating intellectual property together. generally no one is hiring anyone, so there's usually no fees. as a producer, if you have a studio, that's just part of what you do and it's unusual when starting out to charge anyone for its use.\n\nif an artist wants to release a song, and they want to use your recording (or any elements of it), you will negotiate a fee and royalty in exchange for the label owning your recording. an artist instead may want to engage another producer to produce your song. assuming you consent, you don't get any fee or royalty for the master recording. but you are still a co-writer on the song and thus a co-owner of the copyright (the intellectual property). you would retain all the royalties and rights from being a songwriter",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121200438163800236",
    "author": "LAPhill",
    "date": "2023-06-21",
    "content": "Maybe you come out of the session with one good lyric, one good topline, one good groove. Keep your expectations low for what the end product \"has\" to be and be open to where the session leads you.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204769060097753088",
    "author": "youngteam",
    "date": "2024-02-07",
    "content": "I personally believe some of the most mediocre music gets made this way. \n\nThink about it like this - if you just nailed a pitch by checking all the boxes against what a reference has, 10 other teams probably just did the exact same thing. \n\nI think the goal of a session should be to create the best song possible. Limitations and direction are good but tailor making things to the whim of prompts sent out by a&r’s is a good way to make the same material as everyone else. Stick out. Just my .02",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472777380891332759",
    "author": "oaklandmatt",
    "date": "2026-02-15",
    "content": "I alleviate my anxiety by doing something small every day. I feel best when I've done some writing and some singing. On days when I don't have a session and am otherwise busy, this means doing some singing and some songing. I do my normal 20 minute vocal warm up and either a 30 minute song or singing a few of my favorite songs or learning a song. Just something to keep my brain in that mode. The sense of accomplishment at the end of each day is what keeps me feeling in the swing of it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "834679444387004456",
    "author": "Deleted User",
    "date": "2021-04-21",
    "content": "This is a real struggle... When I was starting out with writing songs, I would only write stuff that I feel like people would like or that I feel like would be a cool thing. It never worked out and ended up fake and awkward. And once in a blue moon I would really feel the necessity to write about my own experience it was scary. Scared of exposing myself and what i'm feeling even to the cowriters or people that I'm sharing music with. Fuck, and I'm even shy about sharing it with my girlfriend and my family. Slowly growing out of it by training myself to be emotionally honest and vulnerable. And I also recognized that this issue is not only in songwriting but also in playing music and just expressing myself in general. ** If anyone is also struggling with this, you are not alone. I'd be happy to chat with you **",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842438318423670856",
    "author": "oaklandmatt",
    "date": "2021-05-13",
    "content": "yep. I'd say the #1 thing that ruins songs in songwriting sessions is overthinking and overwriting. Trying to make things too complicated melodically or lyrically, trying to add too much information in a record.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033164711572807802",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "The worst feedback I’ve offered is just snap judgement stuff, which feels so intuitive to us most of the time (if I hate a reverb sound, just flip to the next one), but with collaborative song writing, I think it adds a great deal of credence if you breakdown why you like/dislike an idea and you can explain it in an educated sense.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033165253577547816",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "I also think most of my worst writing sessions happen when we don’t clear the air about what someone is looking for. If I’m writing with someone who doesn’t trust themselves as much or doesn’t feel comfortable leading a session because they’re pretty new to writing, I’ll try to be more of an active guide rather than a sounding board. I’ve also had people who get embarassed to write in front of others so I’ll just chill on my phone on the porch for them lmao. \n\nI think people who are writers and producers struggle to collaborator with that middle ground between seasoned pro/artist with very clear vision, and very “green” artist. They won’t feel comfortable having someone write a whole song for them but they don’t quite trust their own judgement yet either. I think the solution is to practice the idea of commitment.  Sometimes the best writing contribution is letting them do a lot of the lifting, and if the artist gets insecure or flustered, just ask them “well, how do you feel about the idea/line?” or “what about the line feels awkward?” That way you’re helping them to actually make decisions—now they’ll be able to write with you or anyone else, or completely solo.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033175119725613149",
    "author": "Slow Hand",
    "date": "2022-10-21",
    "content": "Strong second on that. I learned very early on that when it comes to music collaboration there's not much point in saying that you don't like something unless you've got an alternative to propose.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076489276885311488",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "Yes that's the way some people do it, but that's an old school method that is going away. \n\nThere are SO many people who make songs that this method isn't super useful any more. Also, many more artists are co-writing their songs and not taking \"outside\" songs with the same frequency. \n\nThe best way to get your songs recorded is to get in with the artists themselves. Then when you're in the studio working with the artist, you can pitch existing ideas you're working on. \n\nThat's why we're always harping on the idea of making records with the people around you. You'll get used to the collaborative environment, you'll make a lot more work (because multiple people will be working on it), and you'll have more chances things get heard (because again, multiple people will be working on it). \n\nIf the things you make with the people around you are truly great, they will get heard. That will be your gateway into more collaborations.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276626928433889333",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-08-23",
    "content": "Ah cool! I had a list I copied from somewhere I while back for this purpose, not all will be helpful but maybe some:\n\nBreaking out of patterns\n1. Modal Interchange  \n2. Limitations & Constraints  \n3. Change Time Signature  \n4. Explore Unconventional Tunings  \n5. Incorporate Non-Western Scales  \n6. Randomization/Generative Techniques  \n7. Reharmonization  \n8. Switch Instruments  \n9. Use Polytonality or Bitonality  \n10. Collaborate",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1329520066705756180",
    "author": "Chad Rodgers",
    "date": "2025-01-16",
    "content": "Hey homies. Has anyone run / been to a songwriting camp before? And if so what worked particularly well and what would you avoid? Thinking of hosting something here in the north east of England just to get a bunch of talent in the room making cool stuff in the pop realm for 4-5 days or so. In talks with a funder now who’s keen to sponsor it, so just need to hatch a plan.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827668863486263306",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "If you're a producer and not a songwriter, and you want to be a songwriter in sessions, start writing songs on your own. Write 100% songs yourself, where you write all the lyrics and melodies and record your own vocal. The first 50 will probably be trash. That's ok. You don't have to show anyone. Just finish the songs and then write more. Put in the time and then you won't have any hesitation in a session because you'll be a songwriter.\n\nWatch the Ed Sheeran doc for more inspo. He wrote 2-3 songs a day for ten years. That's why he's so good. There's no shortcut. Just start writing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009601823855874119",
    "author": "Jeremiah M.",
    "date": "2022-08-17",
    "content": "Not sure this is the answer you’re looking for but try linking up with other writers to help you with unfinished demos. Don’t be afraid of collaboration writing sessions are so fun",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012026308143882280",
    "author": "TheBlur",
    "date": "2022-08-24",
    "content": "I am entering a place where I really don’t want to be an artist. I just want to be a collaborative songwriter. I’m a 70% songwriter / 30% producer. Any songwriters in here interested in a weekly hour songwriting chat? Want to build community and learn / share w other songwriters. Forgive me if this is already goin on in here haven’t been in in a while",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1019110707419164732",
    "author": "TheBlur",
    "date": "2022-09-12",
    "content": "Hey brother. My take on it; In a collaborative songwriting/ producer songwriter setting I ask for a playlist to be made showing what they are going for. Then having an exploratory meeting to discuss what’s in the playlist. Point to things and find common ground for where they are as a performer / songwriter comparative to the songs they chose. Sometimes it’s hard to express to a producer what you want. This a great way to start. Then, keep shaving off songs on that playlist until you guys have 5 - 10 songs that you both believe sounds like what you’re both going for.  \n\nI’ve found this to be a Huge help when in the exploratory stages with a new artist.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061300275605938176",
    "author": "Will Melones",
    "date": "2023-01-07",
    "content": "I’m still not sure I’m very good at this, but I didn’t know what to even offer as a co-writer until I’d had someone critique me, if that makes any sense. I mean really pull apart one of my songs word for word. Have you ever offered up one of your songs for that experience?\n\nPerhaps the most value you can add is by looking at the song out of context, with fresh ears and no bias, and just determine whether or not the writer’s intention is clear and cohesive.\n\nIt’s a thing close to the heart, so you have to approach it with care (kinda like vocal producing). I can’t think of a time that I’ve ever offered lyrical input if a song I’m producing. It would have to be really detracting from the message.\n\nIt’s another thing altogether when you’re *invited* to offer a critique or help finish an idea…although sometimes I find that the invitation isn’t always an indication of open mindedness.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069759921303867443",
    "author": "ehutton21",
    "date": "2023-01-30",
    "content": "When I was on a song by song basis, I needed to be ensconced and fixated or feel “drawn” hard to work on an idea, and once I started I need to see it though to the end. I also never slept well, needed to adjust tons of deadlines, and so I started to change things up. In some ways, feeling the urge to make moments happen is still part of how I work but I view my writing sessions as flexing the muscles rather than ideas until I know I have that feeling or moment where I am drawn to create, on top of whatever sessions I have. \n\nSo nowadays, my strategy lately has been to change my goal orientation. Rather than thinking about my output in songs or ideas, I think about just trying to get myself into a creative rhythm and a flow state. If I ride my time out further than that, that’s awesome, but I try to make sure I have 3-4 hours a week of quality “flowing” writing time.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121193336192110653",
    "author": "Nomograph Mastering",
    "date": "2023-06-21",
    "content": "Generosity? Your blank canvas is a gift to your collaborators as long as it comes with openness to unexpected outcomes",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121220288101748796",
    "author": "rae",
    "date": "2023-06-21",
    "content": "Gonna sound super hippie but channel your inner child! I remember the first time I wrote a song I was truly proud of and I was literally jumping up and down around the house thinking it was the best thing ever written (I was like 10 and the song was shit but little Rae didn’t know anything other than that she wrote a song and had fun doing so). Try and create a space where it’ll be easy to have a laugh and have fun in cause that’s the best part of music collaboration imo 🙂 also as Ruairi said let go of what happened last time cause I’m willing to bet you’ve learnt from the last time and care enough to not repeat any ‘negative’ elements from the last experience 😊",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153381809741123705",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "Like when I have a session with a new artist I’ll just make like a few riffs or loops to bring and see if they vibe with them.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277588482398617631",
    "author": "Andy Lawson",
    "date": "2024-08-26",
    "content": "Hi everyone. Heading to LA next month and thought I would hit this channel up and see if anyone is interested in co writes. Hit me up if you’re interested. I’m not sure what the rules are here so if not allowed apologies in advance. Thanks",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298314637347131453",
    "author": "Zach Hughes",
    "date": "2024-10-22",
    "content": "Can use the walk / break to bring back snacks, coffee, water, etc… for your cowriters. Double wham-o",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354661558550003794",
    "author": "oaklandmatt",
    "date": "2025-03-26",
    "content": "I would just go all in on writing sessions. Build the experience and the comfort. If you want to go deeper into songwriting, I have lots and lots of thoughts (many of which I've shared here). But it essentially boils down to: write as many songs by yourself as you can as quickly as you can.\n\nAs far as publishing deals, you won't find a good deal until there's some real revenue to be had, so until you have a song that is generating some serious money (or coming out and will), just keep writing and registering your songs",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017293085622947901",
    "author": "itaylerner",
    "date": "2022-09-07",
    "content": "Man, I have so many thoughts on this! I relate on so many levels. 100% agree with everything @NoahNeedleman said.\n\nOn the more zoomed in side of things, I have found a couple things to work extremely well. \n\n1.) specific positive feedback. “Great take” is fine. “Wow, the way you said this specific word really resonated with me, I remember feeling that way as a kid blah blah blah blah blah.” That specific positive feedback makes people feel safe, heard, and valued. “Cool idea, let’s keep exploring” feels really dismissive and tends to make people feel like they’re in boot camp which is not fun for anyone \n\n2.) mirroring emotions for validation. This might be a hot take but it’s what works for me: If they’re totally stoked about it you need to be stoked too. Just as stoked. Just fake it if you need to, ~especially~ in the early writing stages. You can always go back and revisit ideas, but once someone feels like their enthusiasm and creativity and taste is being questioned, it takes forever to rebuild that trust. Mirror their emotions, get excited, be specific. THEN, once you have established the kinship and spent your own time living with the idea and better understanding what would improve it, you can bring up “hey I was thinking and I have some ideas that might be able to make what you created hit even more!”",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075475757817675786",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "I worked on a remote session recently for some heavy hitters. Savan Kotecha was one of them, and I was listening to his Ross Golan interview as part of my prep. Him and Ross discuss how well Savan and certain writing partners of his compliment each other, for the various skills they each bring to the table. \n\nGreat listening generally too. Think it was an early episode, maybe #3?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121196437380796486",
    "author": "Ross Fortune",
    "date": "2023-06-21",
    "content": "I’m never the artist in the writing sessions I’ve done, but I am a prepper, so sketching out a bunch of beats (might do 5-10, 1 of which will be decent) in the week preceding helps me go in feeling calm. That way I have total freedom to see what happens in the moment, secure in the knowledge that if nothing does, there’s at least a solid set of chords / sounds / a groove that we can use as a jumping off point.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304263718883819591",
    "author": "oaklandmatt",
    "date": "2024-11-07",
    "content": "Yes x1000\n\nStudy the best things, even if they don't always seem to apply directly to what you're doing. \n\nMax Martin is maybe the best at making vocals sound A+. He is well known as a detail oriented, vocal-focused pop savant. He is often a part of every choice from writing lyrics and melody all the way to adjusting sibilance in the mix. His instincts for great melody and rhythm, paired with lyrics that sound good, is unmatched. And I say \"sound good,\" because though I think many of the lyrics of his songs are meaningful (especially with the best lyric co-writers), the choice of words and how they are emphasized and enunciated is what separates him from everyone else. It's like Michael Jackson. \n\nDo some YouTube searching on artists talking about working with Max Martin. You can learn a LOT about writing vocal from him.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354663387312951446",
    "author": "peterlabberton",
    "date": "2025-03-26",
    "content": "Sick. Yeah, I have enough mix work now to feel constantly behind, and am building a (small, *mostly*) mix focused studio… but my plan when the studio is done is to raise my rates a bit (long overdue!), and if that means a bit of down time try to fill it with writing sessions. That, and actually taking up the offers I get from artists to do writing sessions, which have come in more since the Suki song and a few other releases but I have mostly turned down so far. AND try and reach for some artists *I’d* love to work with, feeling like I have some wind in my sails.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471660411794231317",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "Last thing - write with friends! Collaborate!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472012041878241341",
    "author": "oaklandmatt",
    "date": "2026-02-13",
    "content": "And on that note, because I don't have a session today, I'm going to write a 30 minute song. I know it will be a bad or silly song. That liberates me to joyfully practice.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472776139452977224",
    "author": "oaklandmatt",
    "date": "2026-02-15",
    "content": "As I'm sure you already know , there is no such thing as enough. It's like how perfection doesn't exist. \n\nIt may be easier to think of being a writer on a spectrum from hobbyist to full-time artist. The one end is the hobbyist who does it whenever they want and have time (other priorities take precedent). The other end is the artist who is compelled to do it and it has to turn it off in order to live a normal life.\n\nMost people here are somewhere in between. For most of us, the key is to do a combination of two things:\n\n1. Find every way possible at all times to joyfully write. Direct yourself toward it with how live. Write silly things for fun, have a guitar you like to play next to the place you always like to sit, write emotional things for catharsis, write with other people for the collaborative joy, sing in the shower, write on different instruments that feel inspiring, etc etc \n\n2. The harder part is developing habits and practices that keep you consistent. It's easy to write when it's fun. It's harder to write when it's not fun, and that's the time to make sure you're doing it. Daily practices, schedules, deadlines (self imposed or otherwise) are the best way to do this.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851495917428277258",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I deal with (unintentional) inconsistent tempo and some time even time signature/pulse pretty often when working with songwriters and artists. It seems to solve the problem when you tap your feet to the melody. Then you would realize that the tempo has changed. And count 1-2-3-4 or whatever the meter is. So you don’t end up unintentionally having an extra beat because of words and disrupt everything else. A lot of writers ask people for beats first for this reason, but if the melody doesn’t stand on it’s own- relying on the beats will do more harm than good in my opinion. They often end up being mediocre melodies from my experience because there’s already tons of subdivisions and grooves in the beat and the topliner is relying on that to drive the rhythmic feel. But also beats need to come in with pocket so there are space for the vocal melody to fit in. It would be good for writers to start without a beat or instrumentals and it would be good for beatmakers to practice leaving vocal pockets when starting with a beat first",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "859931305164668968",
    "author": "antoniohannamusic",
    "date": "2021-06-30",
    "content": "Or like a, \"songwriters pool\" where you could post something and if someone on the group was like \"I want to jump in on this\" you hook up a cowrite session?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "859937411597336597",
    "author": "antoniohannamusic",
    "date": "2021-06-30",
    "content": "Hey there, thanks for getting back to me so quickly! Yeah I can completely understand how you wouldn't want a channel of thumbs up, fire and goat emoji's that actually don't achieve anything tangible.\n\nI'm actually much more interested in the idea of a collab channel like, \"I have a song with an artist, here it is, get in touch if you want to hook up a writing session\"\n\nOne of the key things @oaklandmatt mentioned on here before is write as many songs as you can with as many people as you can, could be a super cool way to level people up & connect with a goal like \"help me finish this\" or something to that effect... don't know, just a thought 😄",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860161400152653864",
    "author": "antoniohannamusic",
    "date": "2021-07-01",
    "content": "I totally get where you're coming from and obviously it benefits no one if there's 1000 links per day with no follow up.\n\nDon't know if this is a solution but could have set rules around it?\n\n*Limited posts per person (1 x a week?) \n*Must state intention in the post.\n*State genre in the post\n*No spamming, only DM people if you genuienly want to work with them\n*No posting work that isn't yours/ you don't have the right to open up to collab\n*Must delete your post once you find a collaborator - keep the forum clean \n\nSelfishly I want something like this so I could be like: \n\n\"Hey, got a new song I'm co-writing (Think Lauv meets PATD)  hung up on lyrics/melody/stuck on bridge (etc etc), DM to work on it (soundcloud link).\"\n\nInterested to hear your thoughts on how something like this could be implemented!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860879075018145813",
    "author": "antoniohannamusic",
    "date": "2021-07-03",
    "content": "What do people here do as far as keeping a writing portfolio goes? Do you keep a bunch of 'song starts' accessible on a soundcloud or dropbox link that you can use as a jumping off point with new artists, or is it just voice notes or both? Or do you approach each session completely from scratch?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860892345721684001",
    "author": "Josh",
    "date": "2021-07-03",
    "content": "I have a folder dedicated to all song start sessions. Ableton loads hella fast so I just flick through session from finder.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860896540343009280",
    "author": "antoniohannamusic",
    "date": "2021-07-03",
    "content": "SWEET! Yeah, someone asked me recently for some samples but I've got way more unreleased demos / song starts than songs I've co-written out in the world at the min. Went with soundcloud.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874367727295418440",
    "author": "peterlabberton",
    "date": "2021-08-09",
    "content": "Alright, I’ve got a semi-songwriting, semi-biz question:\n\nI have never written a song entirely from scratch in my life; musically I’m a drummer first and foremost but play most things guitar-related and can plunk something out on keyboards as well with a lil editing. 🙂 I can’t say I have a great ear for melody, but building a rhythm section and producing a track I feel very confident in.\n\nI frankly don’t have an interest in writing songs per se, BUT a friend of mine who does a fair amount of songwriting sessions says he tries to do one a week, partly just to get in the room with new people and start the ball rolling on potential tracks to produce.\n\nWould it be crazy to try and do a few songwriting sessions, which I understand basically have no pay up front, with the hopes to then have the artist back and finish producing/mixing the track if it goes well? Is this a version of how that works?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874385597932929054",
    "author": "peterlabberton",
    "date": "2021-08-09",
    "content": "@oaklandmatt amazing, thank you!\n\nHow do you differentiate from a biz perspective when you are doing an unpaid songwriting session vs a paid production/tracking/mixing session?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874395672592412704",
    "author": "peterlabberton",
    "date": "2021-08-09",
    "content": "Well, I’ve always charged a day rate if someone wants to work with me. If I’m initiating a session to write something, at what point does it switch to them hiring me to finish the production/mix? Liiiike, is there ever any up front money?\n\nI guess what I’d been thinking was reaching out to people and inviting them to come over and write something for a day, and then if they want to finish it with me, they pay my day/mix rate after that first day. Is that typical?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "889911971246399529",
    "author": "Deleted User",
    "date": "2021-09-21",
    "content": "I have been running into more situation collaborating with writers or artists with that come from non-musical background having lack of understanding in terminologies or music theory. Things like “pickup”. “downbeat”, “syncopation” etc, and it’s been a bit difficult trying to communicate and explain the terminologies online through text or over the phone. Sometimes there are discrepancies in what each persons mean by certain terminologies. Has anyone had experience with these barriers in communication and how do you navigate through that? I want to point them to music theory resources that are mapped out like a curriculum and easy to understand so there’s more solid ground of communication.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937779081599148072",
    "author": "Zack Hames",
    "date": "2022-01-31",
    "content": "If you're really the main person driving the session technically (running the DAW and putting elements together for everyone to hear) LANDR has an amazing streaming platform for DAW's. It's super reliable, has video, super easy to share with others. Been a godsend for remote mixing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "991103829347156049",
    "author": "Deleted User",
    "date": "2022-06-27",
    "content": "honestly, there is nothing wrong with writing a melody for an artist who has more strength in lyrics. of course- all the comments here are great for learning, but it takes time to build skills and if you gotta put something out soon, you may need to write melodies for her while sitting together in a session or bring a songwriter that can help with melody writing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1005916137583820852",
    "author": "Ross Fortune",
    "date": "2022-08-07",
    "content": "> have her learn classic songs and write a song a day for the next month or two. repetition in the process with a great musical diet. it is rarely more complicated than these two things\n\nDecided to give myself a challenge based on this - learning and writing a song a day for two months. Works out around 60 songs, so I'm building a playlist now. When I think of classic songs, my brains immediately goes to 60s/70s, so I'd love to get y'all's input on what you consider classic songs from any era.\n\nMade a collaborative version of the playlist here with some of the tracks I've chosen. Go nuts, please add your suggestions to the list!\n\nhttps://open.spotify.com/playlist/4n87RNhtFqFH6jubhNjG0h?si=e830e26efad7446b&pt=687952fa747c650079044e10be93b1fb",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017287019262660668",
    "author": "Slow Hand",
    "date": "2022-09-07",
    "content": "Question for everyone: What is your approach to fostering the best creative output from a collaborator or a team member?\n\nI'm writing/producing with an artist right now who has submitted a medium/excellent vocal concept for a song. As co-writer and producer I feel that this is a great jumping off point but it's not 100% of the way there and it will take some refinement. They're very excited about it. And they should be, because it's elegant and it's exciting.\n\nMy concern is that they may rest on their feelings of accomplishment and not give it that extra push and exploration that I believe it needs to truly shine.\n\nWhat do you find is a good way to guide collaborators towards exploring an idea further and pushing themselves harder to really make something exceptional? I feel there are only so many ways that I can say \"I really like what you've done, but let's explore some more stuff\" without exhausting them or undermining the praise that I am giving them. How do I show them what's possible without micromanaging and writing it myself? It should come from within them and feel like it's theirs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032631395396370462",
    "author": "Chris Doms",
    "date": "2022-10-20",
    "content": "Love this, I’m always gonna be straight with people because that’s just how I am and how I want people to be with me. I find it helps having a conversation at the start of a session too, i let the artist know I can be as involved or detached as they want me to be in terms of feedback/ideas. Usually people like working with me because I’m involved though. I also found having some years of serving experience has helped me with finding the line between being soft but honest.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033164205030907904",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "To go off that ending point: \n\nI’ve dealt with writing situations with complicated people who are more than just collaborators, they’re also friends and the likes etc. Nothing more than my own incredibly limited experience here, but if you can tell them what you’re feeling about an idea, why you’re feeling, and where you think there’s room for enhancement—they should trust you enough to be like “that’s a fair point” or “ I understand why it comes across that way”. But if you’re not the artist, all you can do is be honest and accept when you’re not calling the shots.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034355966004707348",
    "author": "antoniohannamusic",
    "date": "2022-10-24",
    "content": "Hey all! Loved reading all the responses to @Slow Hand ‘s question.\n\nThe sheer volume of replies really reinforces the “there’s no one way” when it comes to working with artists.\n\nTwo quick examples of that recently - \n\nOne artist I have, loves being challenged constantly and we often play the “that’s cool, but what’s that emotion on 11” or “what would be the life and death version of that feeling?”\n\nI explained that concept to a new collaborator who was like “yeah love that” 2 hours later on a lyric suggestion literally said, “yeah I see what you mean but I think this one is good enough, let’s not bother changing it”\n\nQuestion for you though, how quickly do you change tact in a session and is it something you’re consciously doing or do you pick up on the cue and just naturally address the situation with a softer/harder touch instinctively?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034365067090735154",
    "author": "ehutton21",
    "date": "2022-10-25",
    "content": "Usually a change in approach is pretty conscious, at least for me. I know a lot of people have voiced like activity ideas or conceptual ways of working through things (cards I believe, was one thing) etc and while I think if that can help jump start a situation, I usually find that if a songwriting session needs a change of pace it’s best if I lead a discussion and ask some questions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061787113672155246",
    "author": "ehutton21",
    "date": "2023-01-08",
    "content": "I agree with everything said here. Editing lyrics for someone or leading a writing session, in my experience, is where people really start to come to you for your taste and their trust in you (and by extension, your taste).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069771530172629122",
    "author": "Deleted User",
    "date": "2023-01-30",
    "content": "I don’t write a lot (not including making tracks on a daw), which is why I started trying to write for only 15 minutes a day. I don’t do it every day and still I have more days I don’t than I do, but I was surprised how much I can write in 15 minutes. I try not to question how good it is at all. I just wanted to start a stress free habit. \n\n“Show up” is definitely a thing, but I can’t imagine songwriters sitting in an office alone for 8 hours a day and writing emotionally compelling songs. \n\nMaybe cowriting 8 hours a day or more is doable, because it’s more social and interactive.m",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075386842586828800",
    "author": "rae",
    "date": "2023-02-15",
    "content": "@OJ I agree with everyone else in that collaboration could be an awesome avenue! I tend to write songs lyrics first, then everything else and have only once or twice come up with chords/gibberish in place of words first and then worked out the lyrics later - when I was stuck i found walking around my house  for an hour just singing random lines to that pre existing melody I created and recording everything on voice memos to go through later helped a lot!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075393464751116443",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "Get in there! 5+ people sounds like a lot though, maybe a little more intimidating with that many cooks, and I think hard to feel intimate with. My ideal sessions are 3 people (computer person, one proper musician on guitar or keys, topliner) +1 if it’s for an artist separate to that team",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075428938001699016",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "But sorry, to answer your question in a nutshell - I think you're right. General good vibes and positivity go a long way, and if you're bringing the goods as well, that's the double threat combo.\n\nI've had writing sessions with people a few rungs up from me, where those people may not have necessarily contributed many (or any) exceptional parts/lyrics/ideas (on that particularly day), but the positivity and excitement with which they responded to what I was coming up with validated me and encouraged me to make parts that I don't think I would've arrived at by myself. There's so much value to having a Vibe Monster / hype person in the room.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075434771401945181",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "All just personal experiences and my interpretation thereof, but I do feel like there's some universals in there.\n\nHave you tried co-writing generally? I started by rustling up sessions on Instagram. Low stakes, artists I thought were cool but just getting started etc. Low stakes rooms to start with, and it was just as well because I made some really crucial errors in those sessions that really sunk the vibe. I'm glad they happened in those settings so I could learn the lessons there, and not a little further on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075453104482422986",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "I haven't tried co-writing, not exactly sure what that entails! Riiiiight so it's almost good to just get in with people to warm up your whole skills there before proceeding onto bigger rooms.. Makes sense.. I was invited to a studio in LA before and it was a fairly known singer and I couldnt make a beat on the spot, this was like 4 years ago now and I look back and can see my mistakes there (whilst shuddering from cringe)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075458072006369341",
    "author": "BatMeckley",
    "date": "2023-02-15",
    "content": "This is very much a thing.\nDo you think “I want it that way” makes any actual sense?\n\nA significant chunk of chart topping pop music of the last 20 years is written by someone who English is not their first language. They’ll rough out the right sounds and syllables and hope that a topliner down the line will meld that into something that makes sense. Sometimes that doesn’t happen and the nonsense lyrics inadvertently stay in the song and some random artist sues them claiming that their stream of conscious nonsense was actually stolen from the carefully crafted lyrics of their garage band that no one’s ever heard of (true story). \n\nAlso, you can be eccentric in a songwriting session… (I’m wondering if that 19yo quiet genius was a Canadian phenom cause I’ve had that EXACT same experience) but don’t be a dick in a session. Those guys never last.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075478502016565248",
    "author": "Will Melones",
    "date": "2023-02-15",
    "content": "More like *Schma*van Kotecha. Did you just guess episode 3? 🎯\n\nThat’s a great interview, and I’m probably due for a re-listen to a few of those early episodes. I’d love to hear more about what you took away from that session though!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076491364251992154",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "As I've started something new its at 50 followers right now, my thought process isn't to have many followers/famous but its to have an online portfolio which people can view and hopefully the right things get attention enough where I can find people to collaborate with through this way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121192492205879308",
    "author": "Nomograph Mastering",
    "date": "2023-06-21",
    "content": "maybe you need to turn of the part of your brain that preempts tending to your collaborators needs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121195305854062735",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": "So I think my problem before was actually that I let other people write too much and the songs ended up super \"fine, I guess\"\n\nI'm very wary of balancing the benefits of collaboration with having too many cooks in the kitchen, so I feel like I should come to the table with *something*",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121237572274884638",
    "author": "Deleted User",
    "date": "2023-06-21",
    "content": "Did you have anything you wanted to write about? I’ve never been an artist but from the POV of being a co-writer helping artist, there’s nothing to work with when the artist has nothing to say because there’s no North Star. Maybe having some North Stars in place would help and maybe you don’t necessarily need to bring any tangible ideas.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121272827685904404",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": "I agree! I usually start a writing session by doing silly joke lyrics just to get them out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123805685910601728",
    "author": "LAPhill",
    "date": "2023-06-28",
    "content": "@austenballard how did your writing session go?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153373373326446702",
    "author": "austenballard",
    "date": "2023-09-18",
    "content": "same thing as having starters, etc. on deck for writing sessions",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153373537302753360",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I basically do the same thing but I get annoyed at my shitty work half way through and then just open a blank session and start again",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182252139217690624",
    "author": "Deleted User",
    "date": "2023-12-07",
    "content": "Producers with templates and preset collections- how do you navigate writing sessions when someone else is driving the session from their computer? \n\nHuge part of my workflow has been my template and my preset patches, and I would probably feel like I’m turning the wheels with my knees without them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185774432430604288",
    "author": "Slow Hand",
    "date": "2023-12-16",
    "content": "I’m not a lawyer, so don’t take my word, but these days it’s common for the original songwriters to receive a co-writing credit if their song is interpolated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185936610563461150",
    "author": "oaklandmatt",
    "date": "2023-12-17",
    "content": "Yes. \n\nCovers (which have a definition of how much you can change and in what ways) don't require permission. You just give 100% of the publishing to the copyright owners. \n\nInterpolation (aka derivative works), require permission from the copyright owners. Along with permission, you negotiate their copyright ownership percentage (aka their co-writing share) of your new derivative work.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199445712681828525",
    "author": "jonmatteson",
    "date": "2024-01-23",
    "content": "Wanted to ask producers who also write with artist what their writing sessions look like? \nAre you preparing tracks before hand? Making stuff on the spot?\nSitting at the computer or sitting together with acoustic guitars beforehand?\nHow long are you hanging before you start writing?\nI find my hangs going pretty long especially on the first write with someone but that usually leads to better lyrical content. However I want to be more intentional with our time without it feeling rushed. \n\nI’m working on my flow and would love some insight into what other people’s process looks like.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199473948597956669",
    "author": "Deleted User",
    "date": "2024-01-23",
    "content": "A couple of things I always do before and during sessions\n\nHave some things ready to play so collaborators can understand my background, and same with collaborators. I would ask them to play some things they did and grew up listening to so I can understand where they are coming from with decisions or comments they make. \n\nAlways set up so it’s ready to record. have a phone running on record whenever music is played and the computer isn’t recording\n\nHave a few small incomplete ideas at disposal before walking into the sessions. Could be a simple guitar chord progression with a little something on top, could be riff or banging drum patterns. Important thing here for me is to continue moving on to next ideas if I don’t get an immediate response (which is usually singing on top) and continue to work my way into it. \n\nI like to have full drums ready to go somewhere on my computer. So I can just import it in, and it will get people moving. Splice drum loops are fine too. Some sort of instant vibe is needed in my experience. Splice really helps with that, because then you don’t have people looking at the back of your head trying to dial in drums or synth patch for more than 5 minutes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199476568586715226",
    "author": "Deleted User",
    "date": "2024-01-23",
    "content": "I’ve tried different ways with hangs- I’m still figuring out. And I typically don’t touch lyrics anymore because I’ve found that I’m not that great at lyrics yet and if I don’t have a line (which I usually don’t….), it’s better to leave it be for the longevity of relationship because lyrics can be one of the most personal things in music making because… it is literal. If you are more lyrics person, I think you can get a lot of value out of hanging out. \n\nFirst thing is creating safe space- and it really depends on person to person. Some people never open up, some people can open up immediately. In my experience, the more experienced they are - the more they tend to be the latter. I think how much time you spend on it can be dependent on this. You mentioned wanting to be more intentional, one idea that came to my mind is communicating this from the get go. Obviously there are going to be times where bring this up can be weird in the beginning of the session, but it should get them to think about opening up as part of work at the very least. It needs to be done carefully of course\n\nThe other part of it is understanding the person themselves. Their general vibe and energy. It’s easier to tell with some folks, and it’s harder to know what kind of person it is with some other folks. regarding this, I find diving into work right away helps feel it out. my job is often to constantly create ideas and inspirations. I can often gather some information from how they respond to different ideas. \n\nLastly, I used to spend a lot of time hanging up until very recently and I found it’s so much more productive to just work and bond through that experience. Nature of work calls for connecting on a personal level, but it doesn’t require it. I’ve been trying to take it easy on getting closer with people, and focusing on the overall experience of collaboration and it has been making sessions more productive. So I plan on sticking with this way for a bit and see how it goes!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204742223946846288",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "When writing to pitch, how do you avoid letting the pitch get in the way of creativity? I was in a session writing to a brief recently and a numerous times I was like „I really wanna use this bass but it‘s not on pitch“ „I feel like the song could go here but it‘s not true the brief“ etc.\nSo the vibe suffered a lot bc my decision making was so influenced and hindered by the fear of not staying true enough to the pitch",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204959649741144074",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "I‘m not super experienced with writing to a pitch either so it was just a weird situation where the session just hit a brick wall numerous times bc we were so stuck by the confinements of the pitch the creativity just couldn’t flow \nI guess what you said aligns with what @youngteam said that writing a great song will always be better than writing something that sounds exactly like something else that came before",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204960687692976128",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "In this case it was a pitch for an established artist with specific references but yeah that makes sense. The problem wasnt even „we have to write an super amazing song“ it was more like the session and the inspiration coming to a halt because we were so unsure of the direction",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205710220161065010",
    "author": "austenballard",
    "date": "2024-02-09",
    "content": "I've had a few sync placements, not songs though - entirely instrumental pieces. Every successful placement has been through direct contact with a supervisor - I don't really send much to libraries.\n\nMost of my song placements with artists have been with people who are essentially friends of mine who ended up co-writing the final songs that went out.\n\nI've never successfully placed a song with an artist through an A&R with the exception of the situation I described above",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205712773430902814",
    "author": "Garth Tim",
    "date": "2024-02-09",
    "content": "placements in terms of writing/points on a collaboration? or placements in terms of completed material being pitched for sync",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220755040822755400",
    "author": "popaganda.",
    "date": "2024-03-22",
    "content": "I relate to this a lot. Besides all the guardrails you can put up to force a different outcome you can also find new collaborators. (Or collaborate at all if you usually fly solo)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242614904515596407",
    "author": "oaklandmatt",
    "date": "2024-05-21",
    "content": "\"The answer could easily be that I'm overthinking it, it doesn't matter that much, and that I should trust my instinct here.\"\n\nYes, no, and yes.\n\nIt matters a tremendous amount that you do the thing that you like. \n\nDo the thing you think sounds cool. Then if you need to compromise with your collaborators or benefactors, deal with it after.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287548237129056317",
    "author": "thegreatcarsoni",
    "date": "2024-09-22",
    "content": "Hey guys! sorry for the essay, got somethin on the brain i'm interested in your thoughts on...So i'm not much of a songwriter, and writing sessions tend to give me a lot of anxiety. it's something I'd like to get stronger at but don't totally have the bandwidth to dedicate resources to right now. Regardless, one of my good friends and I have committed to a sort of \"exposure therapy\" in getting together once a week or so to make stuff. My friend is an excellent guitar player and we've worked together in various capacities for a long time, but every time we get together the stuff he brings to the table is just balls out riffs and fanciful effects/tone that don't really translate to a seedling of a song. I have a hard time hearing where to take things or having a clear feeling about the sounds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291480063430361108",
    "author": "Slow Hand",
    "date": "2024-10-03",
    "content": "Here's a thought provoking clip. \n\nChilly Gonzales describes being in the writing room with Drake and watching Drake continually refine a lyrical idea to be less specific and more universal, and then refining it again in that way, and again...\nhttps://www.ddinstagram.com/reel/C_vU0qysZvQ/?utm_source=ig_web_copy_link",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298246657313603628",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-10-22",
    "content": "Does anyone have advice on how to battle brain fog during a songwriting session? I have this happen often when it‘s just me and an artist where I have to two do jobs at once (producing/writing) and only having limited capacity for the artist to bounce ideas off me when I‘m working in the track \n\nTalking about this feeling when your head gets heavy/almost like a pressure behind your eyes where nothing will come out \n\nUsually I just take a break but I‘m curious if there are methods that are more efficient and wont make us lose time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304786129358164058",
    "author": "whaleintown",
    "date": "2024-11-09",
    "content": "any suggestion on how would you hold an online writing session with an artist ? would love to learn the process of how it can be done and still getting a relatively good result.( sending files, email notes, facetime ?) Also could be nice to hear if the same can be done during production stage ? let me know your experiences !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339731298289451149",
    "author": "peterlabberton",
    "date": "2025-02-13",
    "content": "I circled around some of these ideas a few years ago here, but now I’m more seriously thinking/asking for advice…\n\nI’ve never written a song in my life, and don’t have any real desire to do so (more than happy to be mixer/producer/drummer/multi-instrumentalist guy). But, I have a friend who is a super prolific writer. He has his own artist project which I’ve produced/mixed, and a few years ago had a publishing deal and has a good deal of writing credits. We’re a really good yin/yang pair: he’s focused on melody/lyrics/chords, I’m focused on rhythm/sounds/texture/mix. We have a co-credit for a Suki Waterhouse song for the one and only explicitly “writing session” we’ve done together.\n\nI just reconnected with him and mentioned that I’m about to be in a position where I could do more open-ended writing (/spec production?) sessions and would love to work with him again—specifically on some projects that have approached me more in the writing stages, and most especially on reaching for bigger artists. And he’s down!\n\nHere are my questions (and this is a *total* explain it to me like I’m five situation—I’ve really struggled to make sense of things business/session flow-wise outside of getting paid for a discrete deliverable or a day rate):\n\nI don’t feel a need to be too formal about things right now, but is this sort of partnership where we could pursue a joint publishing deal?\n\nMy main motivation is two-fold: keep a foot in production/engineering while I’ve leaned more and more into mixing recently, and use our credits to get in a room with bigger artists. Am I way off here?\n\nAnything I’m missing/obviously oblivious to?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354656891736821782",
    "author": "oaklandmatt",
    "date": "2025-03-26",
    "content": "The short answer is: you're a songwriter now too. This is a new part of your professional repertoire. This is great.\n\nI made a similar transition from producing bands to doing co-writing sessions as a producer. You can still get hired as a producer or engineer (as I still do), but writing sessions are structured with different expectations and potential outcomes. \n\nWhen you participate in songwriting sessions, you are almost never getting paid up front as an engineer or producer. There are some cases where super rich people will pay for songwriting sessions, or artist with bigger budgets might get their label to pay a studio fee, but this will be a tiny minority of your writing sessions. \n\nPhilosophically, the idea is that you're all creating something together that, if it's good enough, it will be released into the world in someway. But your experimenting and will make many ideas that don't cross that threshold. However, if any of the recordings of these song come out you will still get paid as a producer (/ engineer / mixer / whatever else you do on the final version). If no peace of the recording that you made when the song was written gets used, you will still participate as a songwriter on the copyright.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354660204406636564",
    "author": "peterlabberton",
    "date": "2025-03-26",
    "content": "@oaklandmatt you and this place are both gems, thanks! I actually got hit up by an artist this morning to schedule something for this exact co-writing thing—that and this response are good motivation to keep after this avenue of work!\n\nYes, role so far has been sounding board/musicianship/engineering and mixing/producing/providing studio. I can’t remember the split but on the Suki song he did get a bigger cut. I got a production fee when it made the album and it all felt fair to me. It’s registered with a PRO.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357591878664585217",
    "author": "spectrummasters",
    "date": "2025-04-03",
    "content": "….hey man , yeah what Brian said . A stem ripper . \nI didn’t want to say in my OG post much more so as to not bias a potential interpretation of Louie bells process , but what I was struck by was the simple brutal idea of just taking the proven best elements of others work as a foundation to begin building your own frameworks . \nWe ve spoken about it before in other channels with regard to using a  sample to write to and ditching it later , or reconstructing a track and letting it become something new …..I’d not thought of or heard of simply ripping hundreds of classic drums and taking them into a writing session before though . \nThere’s something so abrupt and utilitarian about that approach that I felt it might be helpful to anyone who is struggling with their own process , should they be trying to write all from scratch",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378682999717236797",
    "author": "Pio",
    "date": "2025-06-01",
    "content": "And if you don’t wanna go buying books, I’d recommend possibly trying out the daily practice of object writing; you could even try it for a week or so, and you’ll end up getting interesting imagery, some of which you may be able to use in your songs - but if you stick at it a bit (I find if I do it solidly in the mornings for a week or two it just warms my brain right up for writing throughout the day) it can help get your brain into that mode, so that when you go into your writing sessions later, your brain is already making those connections. Just an option of course - everyone’s got their own way with lyric, it really is so personal. Whatever tools help, use em, whatever tools don’t, chuck em. \n\nI just mention these things bc you talk about making the songs ‘real’, and I feel that - I love trying to get a song to feel properly grounded, with a sense of place and reality. Best solution I’ve found is to just leave a bit of me in there - somehow it’s like people can feel when songwriting is ‘real’, so I just try to make sure my heart is in/behind each line, keep them smooth, rinse repeat \n\nWould love to crack open this topic again too, curious on more peoples thoughts on this stuff, thanks for opening this up  @OJ,",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397679017900904569",
    "author": "bobby k",
    "date": "2025-07-23",
    "content": "Anybody running writing sessions in pro tools? Any tips or workflow things you can recommend? \n\nAbleton has usually been home base for this, I see it as a flexible scratch pad to throw down parts while the artist and 3rd are going in on lyrics. I’ll go over to pro tools once we have something concrete and start vocals, but it’s annoying doing stems in the middle of a write lol. I’m wondering if pro tools sketch is at all useful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1413354704338948237",
    "author": "Juliette",
    "date": "2025-09-04",
    "content": "It's going to be so, so fun!! Collaborations seem so intimidating at first but I'm hoping this will be one step towards more in the future!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472553605637607702",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "i guess other forms of art like film or books often do require a lot of structure and thought in order to cohesively convey or execute a vision... even if the vision is fundamentally grounded on a seed of feeling or very specific idea. songs and music are so temporal and intuitive that it doesnt really require that necessarily. \n\nfor better and worse, i tend to have this desire to seek out a 'scientific' nature in things. for me as a fan of films, i can often decipher or intuit the internal logic and intentionality that choreographs lights and angles and framing to create a moving feeling/painting. \n\ni do fully agree that fundamentally the only thing that can create this sense of 'spatial awareness' in a medium, or a sense of dialectic/causality between the subtle and intuitive, creative elements is experience and repetition; but i can't help but seek out knowledge or structure/self critique to my approach.\n\ni think to that end, i should collaborate more with people who are experienced so i can accelerate my own learning if that's what i seek. i find myself always searching for this 'internal' awareness of intentionality, searching for the forces and patterns that make a system or experience exist and change how they do.\n\ni am alwasy looking for this feeling of purpose or understanding of which steps are wanted/needed for me to take what ive created closer to its essence or my original vision. i think people understand this at the level of more technical creative aspects... for example mixing. ultimately the art is still to have a creative vision and executing that, but it's the experience and awareness to have intentionality and wisdom in how to execute that separates raw creativity/talent from a professional level of execution no? I think the same can be applied to more abstract skills like writing/songwriting.\n\ni'm going to commit to writing new material everyday for a month and see what happens!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472555769869369490",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "idk what qualifies as a song or not.. but to this end, by chance before i got time to read everyone's response, i happened to turn a small poem and a few lyrics into a valentine voice note for a friend. by nature of simply singing it and imbuing it with melody it sort of became a song. in some sense, its that easy, and i am failing myself by not carving out the time and commitment to that every single day.\n\nperhaps what im asking is really a reflection of a lack of courage and patience/grit. where i'd like technical and direct feedback, i search for 'knowledge' and 'technique' instead of collaborators and mentors. where i am afraid to fail, i avoid the daunting task of putting ink on a blank canvas every day. \n\ni honestly fully agree and expected your answer to be the primary one!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]