[
  {
    "id": "1200522135244914768",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "If you're trying to be a highly successful professional, you should do all of these things and be prepared to adjust on the fly.\n\nI pretty much always have full songs, tracks, hooks, and concepts prepared. Much of the time, you won't use any of them on any given day. But good news: they're useful for future days.\n\nI've had all of that prepared and then the artist and I just chat for five hours, then write a song on a piano.\n\nI've had all that prepared and then cut song after song because the artist goes \"what else do you have???\"\n\nAnecdote that might be helpful: I've been in with an artist all week. Me, another producer/writer, and her. The other producer/writer has his rig set up and he also writes topline. We usually bounce back and forth depending on what the song requires. We've all worked together before and we had the whole week blocked out so there's no pressure to perform on day one. But we did three songs on the first day because she just came in firing. The first song she came in with a title and we worked from scratch and knocked it out in an hour. The other producer made the track quick with some existing drum loops he had prepped for her, adding keys and horns as we wrote. Then she asked \"do you have anything to play?\" I played her a track hook I had prepared. She liked it and we powered through that one in another hour. Then we broke for lunch. We caught up. As we were finishing she mentioned this one kinda stupid and sassy idea she tried to bring into another session but the producers didn't like it. So we wrote that one and it was fire. I tapped out a tempo as she rapped the hook idea and just make a skeleton beat on the fly.\n\nBeing way over prepared is rarely going to hurt you.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075789852584444075",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "Some songwriting-related morning routine thoughts:\n\nI've been starting my day with doing piano scales and vocal warm ups to a metronome and then singing/ learning a song and recording a voice note of it. (recently it's been Tom Petty Wildflowers at the piano). Then I look at my phone and start my day.\n\nHard to know for sure if it's causal, but my songwriting abilities have sped up. I'm quicker in sessions, both with topline and tracks. \n\nI think it's related to several aspects of the morning routine, and they all compound. \n\n*I'm playing music before I'm on my phone, so I'm outputting music before my brain starts reacting.\n\n*doing scales w piano and voice opens up my vocabulary on both instruments and makes me much more comfortable to sing/play ideas when writing\n*doing these to a metronome has improved my timing on all instruments (not just piano and vocal)\n*learning a great song and singing it every morning has massively improved my lyrical writing/ improvisation (probably the hardest part of songwriting) by just reinforcing good *sounding* words.\n*singing and recording the same song every morning for a few days or a week makes me really THINK about vocals and vocal production. How I'm singing the words, how to push certain vowels in a certain part of my voice, etc \n\n@Slow Hand  @Ross Fortune @Will Melones @OJ",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "977308745669439498",
    "author": "BatMeckley",
    "date": "2022-05-20",
    "content": "No joke, I find the oblique strategy deck of cards wildly helpful in times like that. \n\nAlso, unfortunately (and I hate hate HATE this) sometimes the only way to get a track from 95% to 100% is to take it back down to like 40% and start there.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200603495351464108",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "I always tailor it to the artist in some way. It's a combination of making fresh ideas specifically for them and taking existing ideas that could work (sometimes reworking existing ideas). I never go into a session like an actual blind date where I don't know anything about them.\n\nThe challenge is always do I make something that sounds like what they've done, or do I make something that sounds like where they're going? That's impossible to answer. I've had success in major label POP artist sessions by having a 100 year old piano and specifically not playing tracks. Meaning, you never know if an artist is tired of doing the same shit. Because I have confidence in my skill as a producer, I'm happy to get an A+ ballad because I know I can turn it into whatever production I want. \"In The Name Of Love\" is my most successful example of this. It's an emotional 3 chord piano ballad that was produced into a festival EDM anthem. \n\nI've had the most success being prepared for all options. Mostly because that makes me flexible for what an artist is feeling that day, but also because the more stuff I make, the more music I'm making. If I prep for a session, I'm not working cold. The prep is also like a psychological and creative warm up for me. Prep makes me a better improviser.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1288194554918338591",
    "author": "EliHeathMusic",
    "date": "2024-09-24",
    "content": "Watched this video last night of Billie and Finneas talking about writing \"Birds of a Feather.\" The main thing that stood out to me was hearing them discuss how long it took and how much they disliked the song at first. It sounds like they were writing and rewriting it for almost a year and it almost didn't make the album. They also emphasized the amount of time it took to record; Billie mentioned that it took a bunch of days just to figure out the delivery of the first line and at one point Finneas was like \"oh yeah, that 10 second vocal stack tucked way in the background took us 7 hours.\" I feel like we all hear stories of great songs being written and recorded really quickly and at least for myself I sometimes find it frustrating and discouraging when things aren't coming together like that. I think this is partly because I'm comparing myself to a made up notion that all of the best artists/writers/producers are able to consistently finish a great song in a single session. But I guess this video is reminding me that sometimes the quality that makes these people great is their perseverance and willingness to face discomfort and frustration and keep going long enough to finish an idea.  https://www.youtube.com/watch?v=1bkjEO_Zj2g&ab_channel=BillieEilish",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "975885922614771782",
    "author": "oaklandmatt",
    "date": "2022-05-16",
    "content": "the answer largely depends on how A&R driven the project is. sometimes the A&R is really running the show (like with a young pop boy band or something) and sometimes the A&R doesn't really matter and the artist is the whole identity. \n\na VERY loose way i often think about it is like this: if you're going to lean toward the A&R, do it on the production, not the songwriting. every great song i've been a part of writing (and i mean literally 100% of them) have been about capturing an emotional moment or excitement that is happening in the room with the people in the room. if you start thinking about \"what does the A&R want the lyrics to be like?\" you're gonna lose that.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204960712242241636",
    "author": "oaklandmatt",
    "date": "2024-02-07",
    "content": "Anytime I'm intellectualizing when I'm writing, the song gets worse. if you're editing or producing or prepping, it's definitely good to intellectualize some of the time. If you're going to write for pitch, I would suggest thinking about it in your prep and in your production/finishing, and completely ignoring it when you're creating",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "829370154273079346",
    "author": "Josh",
    "date": "2021-04-07",
    "content": "AYE WERE DOING THE SAME THING. Finally got a decent income stream in metal and said fuck thaaaattt and moved to pop. I’ve just been writing with friends, using those tracks to get with smaller artists, and pushing from there.\n\nAlso, to add to the cold call grind. There’s a really solid formula I’ve learned in marketing to get higher open rates, and my brother who’s launching a clothing brand just found out a really silly formula to get that even better. He’s getting clothes sent out to major label artists right now for free (aside from the cost of shipping and production) because he’s speaking the right language and sending clothes that people actually want. Same thing can be applied to songs. Might make a little outline and post it in here for everyone because it’s not only super important for the entry level grind, but it helps in day to day communication as well!!",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472297813420544222",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Given that this is #✍songwriting-talk , I would strongly advise people who want to learn how to be great songwriters to avoid any production at all when doing the practice we're talking about.\n\nIt's so much easier (and time consuming) to play with snare drum sounds and production transitions than to stay focused on lyrics and melody. Almost everyone I know, and seemingly everyone that asks questions here, just needs to write lyrics and melody over and over and over.\n\nIf you want to get reps to become a producer, that's awesome. Go to #🎹production-talk and talk about those reps.\n\nTrying to also do production while doing the exercises that we're talking about will only slow you down.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261743620416081920",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "I'll give a point by point analysis, cuz why not?\n\nFirst off, I love Irving Berlin. One of the greatest ever. White Christmas, God Bless America, Always, Cheek to Cheek. A master of the craft. \n\nThat being said, adhering to portions of this list could lead a songwriter in 2024 exactly in the wrong direction. Keep in mind two things: one, great artists are rarely great explainers of what makes them great. And two, his career ended in the late 1950s. This means his golden era was pre-Motown, pre-Beates, pre-television, etc.\n\nOk, my thoughts:\n\n1. This doesn't apply any more. He's speaking in relation to a time when music was more complicated. Music is MUCH simpler now. For example, White Christmas has a much larger vocal range than every Selena Gomez song. Also, 99% of songs today are recorded by someone writing it. It's much more important for the singer/songwriter to sing the song in their vocal range than to worry about some future audience. People rarely write songs and then hire a demo singer any more.\n\n2. (and 7 and 8) The best advice on here. Simplify. \"Kill your children.\" Remove things you love in order to make the song more concise.\n\n3. No. The culture changed, there are a million counter examples since Motown/Beatles. Sure, you can write a song without gender (\"you\"), but saying songs SHOULD be genderless is just wrong.\n\n4. Don't write frivolous songs? I'm all about authenticity and connecting emotionally to a song, but this is strangely phrased and doesn't seem very instructive. \n\n5. Every time I've seen people try and follow this, they write bad songs. As the great David Foster said \"There are only 12 notes and 26 letters, and Beethoven and Shakespeare already did it better than you.\" You're unlikely to find original chords, melodies, or words. The only original thing is your own life experience. Don't be \"original,\" be honest.\n\n6. Kinda. I guess I mostly stick to this. But also, there are thousands of great counterexamples after 1960.\n\n7, 8, 9. All great",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033198903132172288",
    "author": "Slow Hand",
    "date": "2022-10-21",
    "content": "On that tip:\n\nI've definitely been on a few productions where we *Ship of Theseus*'d the entire record. Usually it starts out by dropping in a new verse, which then leads to an exciting new idea for the chorus, and before you know it the original song has been replaced completely.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874382654655574097",
    "author": "oaklandmatt",
    "date": "2021-08-09",
    "content": "yes. start doing it immediately. also start writing and completing songs 100% on your own. the goal for those songs, for now, should simply be to finish them, quickly, regardless of quality. every song is a rep. it will massively improve your skills as a producer and mixer. \n\nother than getting hired to produce existing songs (about 1/3 of the time) , the last paragraph you wrote is essentially description of what's i do for a living",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009885679062364191",
    "author": "Will Melones",
    "date": "2022-08-18",
    "content": "I’m sure we all share this struggle to some degree. I’ve got some projects that I’ve put many hours into, just to let them sit on a hard drive for years.\n\nCo-writing has helped a lot, and has taken some ideas to places I never would have thought to go. The feeling that you have some moral obligation to your collaborators to finish is motivating. When you’re making art for yourself, it doesn’t benefit from those positive forces of peer pressure, and there’s a lack of constraints and no sense of urgency. \n\nI think making creative decisions is metabolically expensive. It’s easier to defer all decisions, which is why you see DAW-age producers committing to so little until the mix. In the same way you can defer the entire songwriting process, especially if you have someone else’s project or deadline to prioritize over your own.\n\nTo be both the creative mind and the executive finisher is a lot of exhausting context switching. Some options might be to split these responsibilities with someone else, or to dedicate separate time to each task. If someone hires me to print stems or solder a patchbay, the last thing I want to do is engage in creativity. But when I get inspired to write, I don’t want to stop and troubleshoot the plug-in that’s crashing the session.\n\nMaybe like the divergence/convergence approach would be to set aside an hour or three at the end of your day to finish ideas you’ve already got brewing—set a timer and finish a song, or a verse. Or, even better yet, dedicate the *end* of your day to play and experimentation. Then the next morning, hopefully with fresh perspective, get in the mood to tie up loose ends and prepare your next steps. You’ve demonstrated that you’re good at wearing that hat for other artists, so you can do it for your songs, too. Just maybe not while you’re in the creative flow.\n\nI’m not practicing what I preach, just brain-dumping. I definitely don’t have this figured out.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "858205648285073439",
    "author": "oaklandmatt",
    "date": "2021-06-25",
    "content": "@David Fuller with rare exception, a hit song can be sung and clapped along to. Occasional instrumental hooks (though most of them can be sung) are the only exception I can think of. \n\nThis is where the \"a great song can be sung and played on piano\" gets it wrong. Singing/ clapping is the fundamental. Rap songs to ballads to dance songs.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874708941274222662",
    "author": "Josh",
    "date": "2021-08-10",
    "content": "Also I’m at this stage rn so I should probably chime in. I just paid for a trip to go write with people I decided I liked from one conversation and some texts over the Internet. Today I got hit up to add production stuff to a song I didn’t even write on. Another artist I’m writing with is introducing me to everyone he knows and is coming through so we have songs to push at meetings simply because he wants me to get with a great team so I can afford to fly out and work with him whenever.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204962498525274143",
    "author": "oaklandmatt",
    "date": "2024-02-07",
    "content": "As is always the answer: it works every way you could imagine. Back to what I said a few days ago, you gotta learn a lot of skills and get a lot of reps using them. \n\nThen you learn the meta skill of making strong decisions based on your taste. Sometimes that's \"hit this note instead of that note,\" and sometimes it's \"let's stop trying to write to this track and go outside with acoustic guitars.\"",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385595768664096778",
    "author": "Ross Fortune",
    "date": "2025-06-20",
    "content": "I’ve been pushing myself to write more 100 percenters, and lyrics are a challenge for me. \n\nMy studio neighbour sings in a band but writes alone. His tack is to bounce his instrumental along with whatever gibberish vocal guides he’s laid down, then take a walk and have it on loop on headphones. Whenever he gets to a point where his mind is wandering he’s forgotten he’s supposed to be writing, that’s when the lyrics usually come.\n\nHaven’t had a chance to try it yet but it sounds like a good approach",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831646389876031539",
    "author": "oaklandmatt",
    "date": "2021-04-13",
    "content": "I liken it to a boxer. A boxer spends years perfecting his mechanics and motion and technique, thinking and analyzing and training. But when he's in the ring, he just reacts creatively. Mixing, production, songwriting are all the same￼",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "865607225590284298",
    "author": "Josh",
    "date": "2021-07-16",
    "content": "E. Dan was talking about how Mac would show up with 200 songs for every record they did together. I forget the guys name, but the executive producer for swimming and circles also said the same thing. Some of the best writers of our time aren’t inherently talented, or have this magical gift, they just do way more than us.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076506185051676672",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "I was moreso a producer and added being a songwriter to it. \n\nFirst off, DO IT. It massively improves your production and usefulness to the music industry. And it's fun as fuck to be good at another thing.\n\nSecond thing. Another way to think about it, especially as a producer, is to start thinking of yourself as a songwriter first. What does that mean? Write lyrics all the time. Keep notes of song title ideas. Make voice notes. And write a bunch of songs.\n\nLast point: tracks and melodies are easy. Everyone can do that. Lyrics are hard. Write lyrics all the time. Lyrics lyrics lyrics. @OJ",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261803179989798933",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "You're absolutely right that trying to copy existing hits rarely makes great songs. He's 100% correct on that point.\n\nI'm saying that songwriters often fall into the trap of trying to be \"original.\" They mistakenly think this means they should try to invent new phrases or not use \"generic\" words or try to do something \"interesting\" with the chords. Instead of doing the only original thing that is possible which is tell your story and express your taste. This is actually much more difficult to do because it's incredibly vulnerable.\n\nYou can compose fully original compositions this way. But it's also interesting how much groundbreaking music comes from direct appropriation of existing popular music. \n\nFrom folk music (\"Blowin In The Wind\" is a melody from another song) to hip hop (all of sampling) to producers and DJs making careers from remixes, playing around with current or past hits can also yield incredible new music.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "829061668281384985",
    "author": "oaklandmatt",
    "date": "2021-04-06",
    "content": "This is a little of the top of my head, but I'll try and break it down like this. You're mostly going to get work/ collaborators for three reasons. \n\nThe #1 is your work (great songs, in this case). If you make great shit, people will either hear it and reach out, or when you meet someone, you'll send each other things and they'll love your work and want to be a part of what you can do. no matter where you are in your career, this is #1 always always always. When I was starting out, I produced some of the best sounding records for local bands, so other local bands wanted to work with me. Now, I (or my manager, or my publisher) can send a spotify playlist with songs people know, and that helps get me gigs.\n\n#2 is making shit with people you know personally. This is the best way to do it starting out since you don't have lots of great work out in the world. You need a little community of friends that you make shit with. I guess a lot of that will start moving online, but still the vast majority of great work gets done in person. Even during the pandemic, despite all the zoom writing session and remote work, most great stuff was still getting done in person. You gotta find your people and make things. Then you have the advantage of multiple people promoting your work.\n\n#3 is the pure cold call hustle. It's TOUGH. It's a low percentage game no matter what you're trying to do (be it mixing or writing or producing or being an artist). You have to understand that you may get 1% response rate from people. It's not to say it doesn't have value, but if you want responses, you have to have a good pitch and sending out thousands of messages. But the other thing about this is that writing songs remotely frankly fucking sucks compared to doing it in person. Songwriting is such an in the moment emotional thing. Producing and mixing remotely is very very different that doing real time creative vulnerability. This #3 applies more to non-songwriting collaborations than anything else.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "831876926436016219",
    "author": "Josh",
    "date": "2021-04-14",
    "content": "One of the few things I actually learned from a course early on is that writing/production/mixing is just a ton of small choices, and the more your practice, the easier it is to make 1000 right choices",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874398269361516614",
    "author": "oaklandmatt",
    "date": "2021-08-09",
    "content": "when you write songs, you're creating intellectual property together. generally no one is hiring anyone, so there's usually no fees. as a producer, if you have a studio, that's just part of what you do and it's unusual when starting out to charge anyone for its use.\n\nif an artist wants to release a song, and they want to use your recording (or any elements of it), you will negotiate a fee and royalty in exchange for the label owning your recording. an artist instead may want to engage another producer to produce your song. assuming you consent, you don't get any fee or royalty for the master recording. but you are still a co-writer on the song and thus a co-owner of the copyright (the intellectual property). you would retain all the royalties and rights from being a songwriter",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "972722536804671528",
    "author": "Slow Hand",
    "date": "2022-05-07",
    "content": "Second. I love that The Neptunes’ musical voice is so distinct that they can make a track that’s this simple (808 and snap) that I can guess their presence on the record without even looking.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204970728886239302",
    "author": "oaklandmatt",
    "date": "2024-02-07",
    "content": "Anywhere from 0-100%, depending on the situation. Some pretty much don't write any lyrics (Benny Blanco, Metro Boomin), other producers have the ability to write all the lyrics (Pharrell, Ryan Tedder)",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463933495637311815",
    "author": "Jack",
    "date": "2026-01-22",
    "content": "I usually majorly struggle with writing second/third verse lyrics when I’ve sat with a V1 + Chorus only demo for too long.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "846901864376696852",
    "author": "oaklandmatt",
    "date": "2021-05-25",
    "content": "multiple producers, multiple artists writing their own parts (possibly with an additional writer behind the scenes for some/all), plus samples (which list every writer on the piece being sampled). then multiply by two because it's essentially two entirely different songs",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033165253577547816",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "I also think most of my worst writing sessions happen when we don’t clear the air about what someone is looking for. If I’m writing with someone who doesn’t trust themselves as much or doesn’t feel comfortable leading a session because they’re pretty new to writing, I’ll try to be more of an active guide rather than a sounding board. I’ve also had people who get embarassed to write in front of others so I’ll just chill on my phone on the porch for them lmao. \n\nI think people who are writers and producers struggle to collaborator with that middle ground between seasoned pro/artist with very clear vision, and very “green” artist. They won’t feel comfortable having someone write a whole song for them but they don’t quite trust their own judgement yet either. I think the solution is to practice the idea of commitment.  Sometimes the best writing contribution is letting them do a lot of the lifting, and if the artist gets insecure or flustered, just ask them “well, how do you feel about the idea/line?” or “what about the line feels awkward?” That way you’re helping them to actually make decisions—now they’ll be able to write with you or anyone else, or completely solo.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058037377202921524",
    "author": "Zack Hames",
    "date": "2022-12-29",
    "content": "I’ve done This several times. \n\nHere’s my philosophy on it: try to write a song a day. Even if you don’t “succeed” you’ll spend more time writing than you probably would have otherwise so it’s a win. Don’t beat yourself up about it, that’s the worst thing.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064563897727729814",
    "author": "kidcutler",
    "date": "2023-01-16",
    "content": "He has zero interest in signing. Everything self released, self produced, self mixed (now), he makes all of his money off of streaming",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081124074140479571",
    "author": "ALXCPH",
    "date": "2023-03-03",
    "content": "This should be the lyrics to the discord 2023 collab track 🔥🍫",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357039395701784867",
    "author": "spectrummasters",
    "date": "2025-04-02",
    "content": "Came across this , Charlie Handsome , describing Louie Bells process for Posr Malones F1 writing \n““Louis [Bell] was involved in the writing and production, and he recorded Post’s vocals. I think he’s done that for nine years now, and they have their routine. And Louis is good at creating libraries. At the beginning of the project he AI‑ripped the drum beats of tons of classic country songs. He had hundreds of them. So while I was doing the music, he would go, ‘What tempo are we at?’ I’d say ‘135’, and he’d have 50 drum grooves that work at 135 bpm. There was this huge catalogue of ideas we could aim for,”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463933343249727519",
    "author": "Jack",
    "date": "2026-01-22",
    "content": "I think there are two schools of thought here:\n\n1. Fuck it, do it. Path of least resistance. You’ve tried other lyrics, they’re not hitting. Cut V1 again with a different vocal, do some arrangement modification and send it. \n\n2. Nobodies heard this song before, whatever icky stimulus you’re receiving from attempting V2’s can probably be attributed to your personal saturation of V1; something nobody else will struggle with. So get a decent V2, accept it won’t hit the same for you because you’re cursed and send it. \n\nBoth work!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827668863486263306",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "If you're a producer and not a songwriter, and you want to be a songwriter in sessions, start writing songs on your own. Write 100% songs yourself, where you write all the lyrics and melodies and record your own vocal. The first 50 will probably be trash. That's ok. You don't have to show anyone. Just finish the songs and then write more. Put in the time and then you won't have any hesitation in a session because you'll be a songwriter.\n\nWatch the Ed Sheeran doc for more inspo. He wrote 2-3 songs a day for ten years. That's why he's so good. There's no shortcut. Just start writing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009590779330695288",
    "author": "youngteam",
    "date": "2022-08-17",
    "content": "kind of rambling here but last thought is that not everything needs to be finished. if i make trash, that's okay and it can just be production practice. the next idea might be the one to get finished",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012026308143882280",
    "author": "TheBlur",
    "date": "2022-08-24",
    "content": "I am entering a place where I really don’t want to be an artist. I just want to be a collaborative songwriter. I’m a 70% songwriter / 30% producer. Any songwriters in here interested in a weekly hour songwriting chat? Want to build community and learn / share w other songwriters. Forgive me if this is already goin on in here haven’t been in in a while",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014972557180555284",
    "author": "Slow Hand",
    "date": "2022-09-01",
    "content": "There's a small discussion in #🎹production-talk right now about how short a song can be, and I'd be remiss if I didn't shout out the remarkable songwriting economy of *One Fine Day* by The Chiffons.\n\nThis song is not fucking around. Once the first verse begins @ 0:11 they proceed to burn through a verse, a chorus, *and* a post chorus in the span of 22 seconds. This song has amazing momentum. It is *flying* through its sections without a note out of place and I love it. It's perfect at what it is.\n\nHats off to Carol Kaye and Gerry Goffin.\n\nhttps://open.spotify.com/track/6vcG9EgeqJUSmmF65lxUm6?si=1f80c0e895f3436b",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1019110707419164732",
    "author": "TheBlur",
    "date": "2022-09-12",
    "content": "Hey brother. My take on it; In a collaborative songwriting/ producer songwriter setting I ask for a playlist to be made showing what they are going for. Then having an exploratory meeting to discuss what’s in the playlist. Point to things and find common ground for where they are as a performer / songwriter comparative to the songs they chose. Sometimes it’s hard to express to a producer what you want. This a great way to start. Then, keep shaving off songs on that playlist until you guys have 5 - 10 songs that you both believe sounds like what you’re both going for.  \n\nI’ve found this to be a Huge help when in the exploratory stages with a new artist.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075380035998978128",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "i once sent beats out to a songwriter who was working with a new upcoming artist, i included this beat with a hook I made on it that consisted of like 10 words, ended up selling this idea to Sony which was my beat and the idea of the hook as they sung the same hook but included a bunch of their own lyrics",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153467268546711573",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I think the focus should be on “how can I make something I find exciting”. Earlier when I was talking to Austen about how I’m really bad at just sitting down and churning out beats or instrumentals, it’s because I just don’t find it exciting very often. I rarely want to chase anything. But when I’m writing and I hear something great it gives me the same feeling as when I got my black belt in tae kwon do in 2nd (don’t ask). That shit is sick. The beauty in art isn’t about who consumes it in my opinion. Or how many people. It’s about the process of creating it. So if you aren’t loving the process then maybe it’s time to explore other things? Do the opposite of what you normally do and see if it feels like Christmas Day again.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204961592412995584",
    "author": "oaklandmatt",
    "date": "2024-02-07",
    "content": "That's why producer / writers get paid a lot more. It's a much harder job with a larger set of simultaneous skills.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385127746077724683",
    "author": "Rob Domos",
    "date": "2025-06-18",
    "content": "I’ve noticed a huge trend where at least production wise, the songs that start with drums get finished and the ones that don’t don’t. There’s such a huge disparity that It’s nearly the singular delineating factor. Not sure what’s up with that but I have near zero luck trying to add drums to a song I’ve written without but top lining over a groove is consistently doable",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472572222370480322",
    "author": "Brian Reynolds",
    "date": "2026-02-15",
    "content": "Then back to Matt's advice. Think less, do more. Write, write and then write some more. I used to sit on the train and listen to things like Gym Class Heroes, John Mayer, Say Anything, etc. and write lyrics to their melodies and songs. This is in 2006 before you could just download instrumentals. And by osmosis you'll learn and pick up on their lyrical structures and how they create a \"consumable product\"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860163466060496936",
    "author": "Josh",
    "date": "2021-07-01",
    "content": "Yeah I think as long as there’s a system to it then it’ll be fine. Random links with “ayyyu I got the heat 🔥” is rather annoying to sift through. Also, in discord you can post the track right into the message so people don’t even need to link elsewhere. \n\nBut yeah I think something that’s like “What it is, what you need, here’s the song” is probanly the easiest and most effective.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885013283072008222",
    "author": "alecdibell2",
    "date": "2021-09-07",
    "content": "@Zack Hames finding a teacher for what you’re looking to improve on could take some shopping around. I think it would be helpful to move away from practice only being playing along to your productions.\n\nYou’re going to develop better groove if all you’re listing to is your own playing. So I’d start practicing some grooves solo, no click for now, no music. Listen closely to drummers that you love that have that feel throughout songs. Learn their grooves, play along to their songs for a bit.\n\nI think after you take time to play only listening to yourself, and playing along to other songs with a great feel, it’ll be easier to integrate those philosphies into your own productions.\n\nMy drum lessons when I was younger made me stiff and less creative, so finding the right teacher is soooo important. It wasn’t until I played solo to make the drums impactful by themselves, and played along to a ton of hiatus kaiyote and esperanza spalding that i was able to have a musical feel",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983961320288321576",
    "author": "chloe corley",
    "date": "2022-06-07",
    "content": "also j thought,if its like changes and repeated sections, could be helpful to memorize individual sections and then memorize the form/arrangement of those sections",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983981143336575026",
    "author": "Deleted User",
    "date": "2022-06-07",
    "content": "Personally, I latch onto vocal parts (if there is any) or other instrument parts to associate memories of what happens in the arrangement. It kind of takes me out of the charts too- if in some rare cases of “no charts” gig. But I find writing charts always helps in the process of learning parts even when it’s a no chart type of situation",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009753854008635413",
    "author": "Zakhiggins",
    "date": "2022-08-18",
    "content": "I'd add that sometimes as producers, in our subconscious we think that every song needs to be a full blown production every time, but being OK with a song being stripped back and having just a few elements, can help you get it done faster, and more often than not make the song better. \nAlso nothing wrong with a song that's only a minute 30.\n\nSometimes just making it easier for yourself is all it takes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033179526253006899",
    "author": "Deleted User",
    "date": "2022-10-21",
    "content": "I once brought my track that I wasn’t quite liking to someone. I was hoping to get a “try this, or here is an idea” type of feedback. His response was “what is the favorite thing about this track?”. I was pretty disappointed to hear no “feedback” at the time, but I understood the point two years later.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064659538659246080",
    "author": "Slow Hand",
    "date": "2023-01-16",
    "content": "Haha totally. There's a point on the 2nd Chorus of 'I Love Reading Books' where Blake starts cracking up because Sean is laughing at him while he raps about books and they just let the beat ride for 30 seconds until he gets his concentration back\n\nIt's just *fun*.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069083441712332831",
    "author": "delwin",
    "date": "2023-01-28",
    "content": "the production and songwriting really ramps up by Kids Trap 15. I recommend “Rainbows are Tight” and “French Fries” in particular",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069694991976366110",
    "author": "Zack Hames",
    "date": "2023-01-30",
    "content": "What is the lifestyle / daily life like for people who write *a lot * of songs (whether it’s the music, production, beat, lyrics, etc)? Are you writing 8+ hours a day? Like really sitting with your instrument/paper+pen/DAW. taking frequent breaks? Going hard for a couple hours? combination of everything? How scheduled is it?\n\nI have been writing songs since....forever. I've gone through various phases of writing a song every day to not writing for months on end. I do a lot of different things but am trying to get a lot of writing done in a relatively short amount of time and would love to just hear people's anecdotes on what your life is like when you are writing a LOT.\n\nI find I can go very hard for an amount of time, then I *NEED* a break. I cannot just write every day for hours on end as much as I'd like to.  If someone has tips to get more productivity in writing, I'd love to hear it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069776572724301874",
    "author": "Zack Hames",
    "date": "2023-01-30",
    "content": "Im slow at lyric writing that’s for sure, but I can bang out a production in a day, if I’m happy with it or not by the end is a different story",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121196437380796486",
    "author": "Ross Fortune",
    "date": "2023-06-21",
    "content": "I’m never the artist in the writing sessions I’ve done, but I am a prepper, so sketching out a bunch of beats (might do 5-10, 1 of which will be decent) in the week preceding helps me go in feeling calm. That way I have total freedom to see what happens in the moment, secure in the knowledge that if nothing does, there’s at least a solid set of chords / sounds / a groove that we can use as a jumping off point.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153465831292932188",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "Anytime I’m feeling uninspired it’s like “okay we’re gonna pickup the guitar and have fun”. Or “how can I make a drum track like this *insert Jeff Hazin song*” \n\nI literally was planning on not lifting a finger today bc my brain is exhausted and accidentally wrote a whole song because I wanted to find cool guitar tones to save as ableton racks lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187033435504660562",
    "author": "Iwan Morgan",
    "date": "2023-12-20",
    "content": "Good luck getting permission to use some of the Beatles’ catalogue. Sorry, I don’t mean to be negative, just realistically their catalogue is the holy grail of recorded music. If you have a way to get the demo under Paul McCartney’s door so he can listen to it the personal angle would probably be most effective.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188047183694532650",
    "author": "Deleted User",
    "date": "2023-12-23",
    "content": "moving conversation with @rae here\n\nI've been doing more of \"study the greats\" with production, when it comes to arrangement and production, I feel that things are a lot more clear cut than songwriting. For example, I can try break down the drums of a song into a  drum pattern, dynamics, feel, and the drum sound (type of drum kit, machine, and processing on it). \n\nBut with lyrics (or language) - it feels more gray to pinpoint how to take a concept and apply it into my own writing. How do you usually break it down?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212488963764518922",
    "author": "devon lougheed",
    "date": "2024-02-28",
    "content": "You could always pitch it to the artist, and if they don't want to use it, you get a hot track back for yourself. Making the best art is always the best thing! But if the artist you're pitching to has a much larger potential audience than you do, and it might make a big difference for you financially/career-wise, it might be a good move. Then you can challenge yourself to write an even better one for yourself in lieu.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324835662264008825",
    "author": "SoundsLikeJoe",
    "date": "2025-01-03",
    "content": "This is where more refined terminology make the conversation interesting...    as across genres \"producer\" could mean anything.  Some people even conflate \"songwriter\" with assuming that they produced the track.  Or that \"the producer\" wrote the song and played all the parts.  It's just too much gradient in the variables of language to be accurate.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324843425610334279",
    "author": "lystell",
    "date": "2025-01-03",
    "content": "Interesting!\nFrom my experience it’s super rare that you get paid to to demos. From a label and such anyways. It’s up to songwriters to create and finance the demo. Hence many of us becoming multi instrumentalists and recording  everything. \nI would taking it that far saying it even had a big impact on why a lot of swede music have been electronic/programmed etc. \nIt’s also very common one musician helping another out and vice versa. \nThe Nashville way seems very special in that way.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1329570713576673330",
    "author": "chris_donlin",
    "date": "2025-01-16",
    "content": "Doing some A&R and Pairing writers/producers thoughtfully is probably the most important thing in my experience",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385025632873746451",
    "author": "Brendan Trinkle",
    "date": "2025-06-18",
    "content": "I love this question, thanks for asking us. \n\nI either write with a guitar & a notebook/phone or I go production first in a DAW. I use a lot of guitar pedals & programmed drum loops to create a vibe & then I’ll write a song to that. \n\nI use Notes to organize things. The parent folder in the screenshot is also kind of an inbox & contains in-progress songs that don’t yet have a folder home. \n\nI use Voice Memos often & have a little naming convention system: \n\n“Working Title proto” for first recording of an idea\n“Working Title YYYYMMDD” for each iteration after\n“SFX title description” for field recordings\n\nI use voice memos as long as I’m developing an idea outside of a DAW. Sometimes I have to let songs brew for a long time, play them out loud a lot, and listen back as an editor with fresh ears before they feel like themselves. Love using these tools to fit that work in while I’m at the grocery store or in the car.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385030307278749817",
    "author": "Brian Reynolds",
    "date": "2025-06-18",
    "content": "I'm always in the daw. Always recording.\n\nSometimes melody first. But mostly drums first.\n\nBuild an instrumental just chasing intuition, quickly. 2-3 melody parts and a bass line on top of drums. And youve got a chorus loop. \n\nThen take that improvisational melody muscle and apply it to the vocal melody. \n\nIm not a big humming guy, I get to words pretty quickly. But will start with common phrases to me like,  \"runnin runnin runnin round runnin runnin runnin down\" I have a few others.\n\nI start to land on a melody, with a feeling and story. That I haven't told. Sometimes it takes 90 seconds, sometimes 5-10 mins. \n\nRecord and comp till I have what I like. Than do all the background vocals. \n\nThen start muting a couple of the melody parts. Find my verses.\n\nRinse repeat the process above. But now I know the story and I just have to find the melody and the thru line narrative.\n\nDepending on how the verses feel running into the chorus. Or short length of track. I'll write a bridge \n\nMelodyne the vocals.\n\nStructure the song.\n\nMix the song.\n\nUpload the song.\n\nMake another.\n\nThis usually takes 2-4 days, intermittent with regular life.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385273564210532505",
    "author": "Josh",
    "date": "2025-06-19",
    "content": "So I’ve been trying to write more and I was getting frustrated because telling myself “it’s time to write” doesn’t yield the best results. I’m also trying to get better at guitar and just started playing more. Turns out playing more makes me find cool tones which gives me cool ideas that I end up finding melodies to while I’m practicing whatever it is that sounds fun that day. Then to double down on the practice I come up with lead lines over the track until my fingies get tired and then lay down the vocal.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1388085292560551987",
    "author": "Chad Rodgers",
    "date": "2025-06-27",
    "content": "An artist I work with is so groove and feel-focused, that she hates writing without a beat. She *can* write to a piano / keyboard / guitar part on its own if she has to, but she comes up with insane stuff when she's locked into the vibe of a track via a drum beat or loop first. It's fascinating how our musical brains are activated in such different ways.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397690971017314345",
    "author": "Ross Fortune",
    "date": "2025-07-23",
    "content": "I really tried to force myself to write in PT - committed to it for 4 whole years, but it is just ball ache. There are producers who make it work, but being restricted on actions when in loop / record is just not the one for me.\n\nI find it also forces me to think like an engineer, which is great when I’m properly engineering, but not what I want when I’m throwing paint at the wall. \n\nThese days with comping in Ableton, I’m happy to get most of the work done in there. When it comes to mix I’ll usually fly the vocals out to PT with an instrumental so I can do my clip gain and RX workflows there, but otherwise I’m saving more time and frustration by just staying put.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1406208393181663242",
    "author": "Ciweeeee🐢",
    "date": "2025-08-16",
    "content": "There's a wonderful album called Siftorde by Tidiane Thiam. Now it's all instrumental guitar but I'm pretty sure it's all in the same key and follows similar themes between tracks and it's beautiful!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827627245124059176",
    "author": "Tony Chetta",
    "date": "2021-04-02",
    "content": "What are y’all’s thoughts on the producer in a write contributing to the lyric and melody?? And just how to know if your lyric ideas are any good? My write this morning was kind of a bust and as the producer in the room I feel like I probably should’ve tried to spark some concept and lyric ideas but I’m so unfamiliar with that side of things...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "829039465833168956",
    "author": "antoniohannamusic",
    "date": "2021-04-06",
    "content": "Loving the info in this thread! \n\nSuper interested in checking out some of those theory recommendations too!\n\nOne question I keep banging my head against the wall over is.\n\nSay you’ve written some songs 30,50 whatever the number, you now want to start writing with more people. How do you even approach that topic without sounding like “hey person on the internet, you don’t know me, we have no rapport and I have no released songs I’ve written on but let’s jump on zoom and write about your life.”\n\nThis is the situation I’m currently finding myself in , I’ve produced bands, solo artists etc which are released (some I’ve played on/written or arranged on) and I’m currently writing with a good friend for his project and one other client. \n\nWhy should Insta/TikTok artist #1 care or want to write with me over Mr @oaklandmatt or Matt Squire (or any other talented guy named Matt)?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831213090683093072",
    "author": "Josh",
    "date": "2021-04-12",
    "content": "I used to get really frustrated and give up but now I’ll just try off the wall shit and see what works. Rock song with a dnb beat in the pre? Let’s try it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831595748747247616",
    "author": "Slow Hand",
    "date": "2021-04-13",
    "content": "I thought it was a unique documentary in that you also get to watch a song go through all the stages of production. From hashing it out on guitar and voice with other writers, to arranging for band, to tracking, to mixing, to release. I thought that was nice.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831596833812906024",
    "author": "Slow Hand",
    "date": "2021-04-13",
    "content": "Godard shot a documentary in '69 of The Rolling Stones tracking 'Sympathy For the Devil'. You get to watch them do every take in the tracking room until they land on the final arrangement: https://www.youtube.com/watch?v=juChsS5KvhQ",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "831646112280608830",
    "author": "oaklandmatt",
    "date": "2021-04-13",
    "content": "If you listen closely to Jon and I talking about the actual making of music, whether it's mixing or production or whatever, there's very little analysis that goes into it. We spend all this time talking about it on the live streams, but that's more like training and knowledge. When we're actually working, there's very little thought that goes into it. That's why Jon doesn't like the idea of streaming a mix. Because he isn't sitting there and thinking about and talking about every move.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "832410891466702868",
    "author": "Josh",
    "date": "2021-04-15",
    "content": "Aye random thought. But it’s fucking wild how such small production details can either make or break a song. Falling by Trevor Daniel is a great song, but the blackbear remix is 100x better just by changing the percussion, 808 and bass tones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "834423140175970354",
    "author": "josephmossbridge",
    "date": "2021-04-21",
    "content": "Any thoughts on writing songs about real people? I’m an artist/songwriter/producer and for the first time I am writing about people who are in my life and it’s scary. I’m consciously keeping everything anonymous in the songs, but it’s still scary thinking about what would happen if the person the song is about hears it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835983628328239203",
    "author": "Zack Hames",
    "date": "2021-04-25",
    "content": "Production question, hopefully fits close enough to songwriting:\n\nDo y’all have recommendations for electronic drum samples?\n\nI’m wanting to expand my drum sounds for pop / rnb / hip hop / electronic anything. Last few years I’ve mostly used a korg electribe drum machine which has been awesome, but I feel like expanding a bit, maybe getting away from hardware. \n\nI don’t love the default sounds on battery, but I love battery as a sampler. The thing I like about the korg is the sounds are plain, and then I adjust with FX and pitching and attack/release, whereas battery is “finished” sounds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "841953470654185492",
    "author": "Deleted User",
    "date": "2021-05-12",
    "content": "https://www.youtube.com/watch?v=DibHtzPTr5E\nDJ Swivel, is a Canadian music producer, mixer, audio engineer, and DJ. He is a prominent audio engineer best known for working with Beyoncé as her personal recording engineer. He has also worked with BTS, Jay-Z, Kanye West, Fabolous, and Jay Sean among others.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "844401015234363413",
    "author": "i am willie",
    "date": "2021-05-18",
    "content": "i made like 300 songs between this yaer and last year and now im finally ready to release some shit cause im comfortable with myself but i had to make like 250 garbage tracks to make the good ones which is why i always tell artists and producers and whoever to just produce MORE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "846649161982017536",
    "author": "i am willie",
    "date": "2021-05-25",
    "content": "people in the room and producers getting writing credits add up- not to mention some people getting writing for arrangement and stuff that's a lot of people tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851469831248412744",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I think a lot of it has to do with the melodic rhythm. In terms of how the sections flow, if the melody can drive it on its own- the accompaniment or production will follow. And as you mentioned, high notes can move the energy and accent the rhythm. Lyrical stress patterns could contribute to the accenting and note selections. Weight sometimes means notes that are held longer than the other sometimes the opposite. Contrasts can do a lot though. Range of movement or the range of the pitches themselves, pacing of the rhythm and rests, breaking the patterns/repetition can help with contrast",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851495917428277258",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I deal with (unintentional) inconsistent tempo and some time even time signature/pulse pretty often when working with songwriters and artists. It seems to solve the problem when you tap your feet to the melody. Then you would realize that the tempo has changed. And count 1-2-3-4 or whatever the meter is. So you don’t end up unintentionally having an extra beat because of words and disrupt everything else. A lot of writers ask people for beats first for this reason, but if the melody doesn’t stand on it’s own- relying on the beats will do more harm than good in my opinion. They often end up being mediocre melodies from my experience because there’s already tons of subdivisions and grooves in the beat and the topliner is relying on that to drive the rhythmic feel. But also beats need to come in with pocket so there are space for the vocal melody to fit in. It would be good for writers to start without a beat or instrumentals and it would be good for beatmakers to practice leaving vocal pockets when starting with a beat first",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591456035438592",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Look at a song like “The Weeknd - Can’t Feel My Face”, that chorus top line wouldn’t be possible without a rhythmic and detailed instrumental",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591691099570176",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Those melodies can’t stand on their own, but work very well over very busy instrumentals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591865867829258",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "You can actually write simpler and catchier melodies over really unique/detailed instrumentals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855592297282011197",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "If you write the entire song to nothing but a chord progression, you usually have to simplify the instrumental quite a lot to make room for the melody",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855593236067123231",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Some songs are beat driven, some are story driven and some are melodically driven. Just gotta identify which type of song it is to make room for the most important part",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855594853030821909",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Or imagine how boring “Billie Eilish - Bad Guy” is without the instrumental",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855595360926564372",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "And the instrumental is mostly just straight quarter notes and 8th notes following a chord progression",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874367727295418440",
    "author": "peterlabberton",
    "date": "2021-08-09",
    "content": "Alright, I’ve got a semi-songwriting, semi-biz question:\n\nI have never written a song entirely from scratch in my life; musically I’m a drummer first and foremost but play most things guitar-related and can plunk something out on keyboards as well with a lil editing. 🙂 I can’t say I have a great ear for melody, but building a rhythm section and producing a track I feel very confident in.\n\nI frankly don’t have an interest in writing songs per se, BUT a friend of mine who does a fair amount of songwriting sessions says he tries to do one a week, partly just to get in the room with new people and start the ball rolling on potential tracks to produce.\n\nWould it be crazy to try and do a few songwriting sessions, which I understand basically have no pay up front, with the hopes to then have the artist back and finish producing/mixing the track if it goes well? Is this a version of how that works?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874385597932929054",
    "author": "peterlabberton",
    "date": "2021-08-09",
    "content": "@oaklandmatt amazing, thank you!\n\nHow do you differentiate from a biz perspective when you are doing an unpaid songwriting session vs a paid production/tracking/mixing session?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874395672592412704",
    "author": "peterlabberton",
    "date": "2021-08-09",
    "content": "Well, I’ve always charged a day rate if someone wants to work with me. If I’m initiating a session to write something, at what point does it switch to them hiring me to finish the production/mix? Liiiike, is there ever any up front money?\n\nI guess what I’d been thinking was reaching out to people and inviting them to come over and write something for a day, and then if they want to finish it with me, they pay my day/mix rate after that first day. Is that typical?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874668818235011133",
    "author": "oaklandmatt",
    "date": "2021-08-10",
    "content": "depends what we're talking about. if i'm writing with an indie band, we cross the business bridge when we come to it because i'm a co-owner of the songs we make. if they want to use the songs, we have to come to an agreement at some point and it always sucks talking business while trying to be creative.\n\nif an unsigned band wants me to produce existing songs, there's an agreement before we start.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880447673709244488",
    "author": "Josh",
    "date": "2021-08-26",
    "content": "Yeah. I need to try this out. All of my songs start with a track. Mostly because I feel like great tracks make writing way easier. But I’m interested to see how a vocal can influence my decision making when building the track out now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880512214291861514",
    "author": "Josh",
    "date": "2021-08-26",
    "content": "Right. I’m interested to see how it goes. Because I hear a track and immediately know what “type” of song it’s going to be as far as the vibe of the vocal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885004433040220180",
    "author": "Zack Hames",
    "date": "2021-09-07",
    "content": "No real routine other than Playing to productions I’m working on to a click. I play drums on projects a lot, and it just feels STIFF and not musical. Definitely a disconnect from like the kick and snare and the right hand keeping time on hihat/ride/whatever. \n\nI think Drum lessons would be the right call overall.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "899715708798259212",
    "author": "swarga",
    "date": "2021-10-18",
    "content": "That’s such a great idea. I always get stuck with vocals on produced tracks. Trying to put words on an existing theme is hard it turns out. I’ll give this a try! Do you record straight into a daw or voice memos and then import ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "977290432499314759",
    "author": "Zack Hames",
    "date": "2022-05-20",
    "content": "Broad question: how do you all push through a production that just isn't coming together? I am dealing with a client's track we produced a while ago and have done a ton of micro revisions and they want these big dramatic changes, leaving it up to me to figure out, which is fine, but I am just at a loss about moving forward. The inspiration, direction, just isn't there for me right now. Any tips?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990776830195826698",
    "author": "Slow Hand",
    "date": "2022-06-26",
    "content": "First off, I’ll second @oaklandmatt’s recommendation that she start exposing herself to a lot of different songs, learning them, and working her writing muscles. A lot of this melodic intuition will come with time, familiarity and having a feel for what’s possible.\n\nHow is her ear? I’ve worked with plenty of great singers with little-to-no comprehension for theory. While it can help, I find that for some personality types being too technical and trying to get them to learn theory is a turnoff and is never going to happen. Where does she fit on this spectrum?\n\nDo your best to assure her that she can open up and not be perfect right away. It sounds like she might be clamming up a little bit because she feels uncertain or unconfident. I always try to give my singers a place where they will feel comfortable throwing out any idea. Even horrible ones. It’s okay to fail or fall on your face.  Maybe she needs some reassurance in order to open up. Let her know that she doesn’t have to be perfect. Many singers do better when they have a safe space to open up and attempt new things. Even Prince would tell his engineer to leave the room every time when it became time to track his vocals. Hendrix would hide himself behind a wall of gobos where nobody could see him.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009589247126290444",
    "author": "Zack Hames",
    "date": "2022-08-17",
    "content": "I've written a million songs but I haven't finished a millions songs,\nWhat are some approaches for really getting a song wrapped up in the writing/production stage?\n\n I have a hard time coming back to ideas after the initial start .(like getting a verse and chorus down, 1:30 long recording demo, then coming back to finish it has been incredibly difficult). \n\nIf I don't get the whole thing structured out and pretty much written in one sitting it almost never gets done. Any ideas?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009589948443279633",
    "author": "youngteam",
    "date": "2022-08-17",
    "content": "i asked a producer friend lately what he thought he was best at and he replied \"finishing songs\" \n\nthis was pretty mind blowing to me and got me thinking that the same way we practice our instruments or production techniques, we can practice *finishing ideas*",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009811276387582102",
    "author": "NoahNeedleman",
    "date": "2022-08-18",
    "content": "When you say finished, do you mean produced a master for?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014972922080809055",
    "author": "Slow Hand",
    "date": "2022-09-01",
    "content": "It's full of great instrumental hooks too to support the main melody. It doesn't let go.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017287019262660668",
    "author": "Slow Hand",
    "date": "2022-09-07",
    "content": "Question for everyone: What is your approach to fostering the best creative output from a collaborator or a team member?\n\nI'm writing/producing with an artist right now who has submitted a medium/excellent vocal concept for a song. As co-writer and producer I feel that this is a great jumping off point but it's not 100% of the way there and it will take some refinement. They're very excited about it. And they should be, because it's elegant and it's exciting.\n\nMy concern is that they may rest on their feelings of accomplishment and not give it that extra push and exploration that I believe it needs to truly shine.\n\nWhat do you find is a good way to guide collaborators towards exploring an idea further and pushing themselves harder to really make something exceptional? I feel there are only so many ways that I can say \"I really like what you've done, but let's explore some more stuff\" without exhausting them or undermining the praise that I am giving them. How do I show them what's possible without micromanaging and writing it myself? It should come from within them and feel like it's theirs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058038205544419328",
    "author": "Zack Hames",
    "date": "2022-12-29",
    "content": "Things I do:\n-Try to write all the music for a song in a day (full structure, verse, chorus, bridge, etc)\n\n-write all the lyrics for a song in a day\n\n-write a chorus or a verse with music and lyrics together\n\n-make a beat or something electronic or pop based\n\n-write completely removed from a computer\n\n-make a drum beat first and jam over that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1060291565328805909",
    "author": "austenballard",
    "date": "2023-01-04",
    "content": "@NoahNeedleman moved from monitoring\n\nwhat did you mean by demos getting upgraded to masters btw, like when you start something as a 'demo' and before you know it you're tracking it out for mixing without swapping out drum samples or re-playing the parts you thought you were going to? \n\nI definitely see the distinction between demo and arrangement getting blurrier and blurrier.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061012551678312508",
    "author": "NoahNeedleman",
    "date": "2023-01-06",
    "content": "Basically when demos are turned in they’re expecting it to sound like a master, and most of the time they live with these demos so it either gets mixed or mastered as is, or they call in a producer to finish the track but keep most of the elements. Basically a demo should sound like a master, even if it’s just a guitar/vocal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064647690169876580",
    "author": "kidcutler",
    "date": "2023-01-16",
    "content": "The man has gamed the algorithm, wild. Love working with him he can loop something you do into a beat before you realize what you played",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064649135774507068",
    "author": "Deleted User",
    "date": "2023-01-16",
    "content": "haha making kids trap  and having “weed queen” and “I’m having too much sex blues” as top 5 track on spotify on artist profile. That’s pretty wild 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069760210165567599",
    "author": "ehutton21",
    "date": "2023-01-30",
    "content": "“Flowing” being that idea where you’re not thinking about getting to the zone, but you’re just in the zone. It can include anything from just concepts and lyric ideas to even just finding top lines over random instrumentals I have laying around or chords I’m feeling. I’m pretty much just a bedroom guy, so sometimes all I need is an instrumental or even just my midi and my favorite sound. Sometimes I just write down images—it helps with that feeling of articulation if you try to just describe that which is around you or in front of you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069777249152290836",
    "author": "ehutton21",
    "date": "2023-01-30",
    "content": "Because if I did some sick new thing with a synth, yay, I don’t need to beat myself up if the drums were complete cheeks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075377286045503569",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "I can create a nice little beat and flow over it with a nice melody but I can't for the life of me write the lyrics that would then change the gibberish i just sung out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075378729410367498",
    "author": "cy (sigh)",
    "date": "2023-02-15",
    "content": "thats pretty common method for scratch idea /sketches. \n\ndeveloping it from there (ime), is about  finding the right words for the concept of the song (assuming you have one)\n\nI know some top liners (folk who write main melodies in songs) that will sendnit to /work with  someone who may be better at writing actual lyrics (could be the artist themselves at times). \n\nim sure more people can pitch in w more examples or use ideas.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075379728493576272",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "but when i get a melody down and the flow/\"cadence\" i think people call it to a beat ive made i feel like they're hits hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075380339997937684",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "seems crazy to think i would send a beat with literal gibberish over the top of it to people ha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075426773531119748",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "Hmm, probably the likes of @BatMeckley and co could speak to this too, but the social skills ain't always the thing.\n\nI've been in rooms with shy/quieter people who are just incredible at what they do. In one case, on a very high profile session, one of the beatmakers literally didn't speak to anyone, ever. He was 19 at the time, literally only opened his mouth to very politely ask me for my email address so he could fly the beat into Pro Tools to cut vocals. But he was making absolute fire, and even though he didn't speak, you could feel a good vibe off him.\n\nI've also been in rooms with *unbelievably* obnoxious characters (the occasional particularly unpleasant example of that LA type we were discussing recently). Utterly repugnant as people, but their work is undeniable.\n\nI know who I prefer to be in a room with (and that really does count for a lot, in my experience), but in the speed dating world of pop music writing that a lot of people go through, you get all sorts. \n\nNot everyone is super charismatic of course, but that's just the world. Either way, 90% of the people I've met at the highest level are really delightful.\n\nAlso, my experience has been that the more accomplished the artist/writer/producer, the more lovely they've been. They've got nothing to prove, and perhaps at a certain level, anyone who's not truly undeniable has already been filtered out of those rooms by being a jerk on the way there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075453104482422986",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "I haven't tried co-writing, not exactly sure what that entails! Riiiiight so it's almost good to just get in with people to warm up your whole skills there before proceeding onto bigger rooms.. Makes sense.. I was invited to a studio in LA before and it was a fairly known singer and I couldnt make a beat on the spot, this was like 4 years ago now and I look back and can see my mistakes there (whilst shuddering from cringe)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075475042546225162",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "We’ve all got those cringe moments! They suck, but they also don’t define you. We all live and learn.\n\nI’d absolutely recommend getting in rooms with anyone you can. The more serious they are, the better, but there is value in just getting the reps in. Probably would’ve been an easier pill to swallow to have that experience where you choked on the beat in a lower pressure session, right?\n\nAnd there’s always zoom. If you’ve got some work you’re proud of online, you can reach out to artists you like to set up a remote session. Never quite the same as being in the room, but plenty to learn there too. And your network expands - that part is huge.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076471570584842240",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "When you produce and write/record vocals of a song, do you send a pack out to potential artists / anrs or anything? Wondering how you ship them out to maybe be used...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076505091009421403",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "i just realised im songwriting talk my bad but im more so a producer, been doing it 10 years, built a music company thing and thats all good but im now starting out a new alias type thing, so just wondering how others would grow right now really",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076505462515712063",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "think as someone said (or maybe yourself haha) the other day just write and record when ur making the beat, as right now i sometimes make a beat and just sing gibberish ontop but love the flow/melody of the gibberish but going to work on putting lyrics down at the same time to get those reps in🙏",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076509871383531540",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "Cause as I mention I built a little company but it's not like a producer/artist/alias type thing so people aren't collab with it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101364139869356053",
    "author": "toohighprod",
    "date": "2023-04-27",
    "content": "Looking to take my production into the sync world. Any suggestions on trusted companies to submit to?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121249618961891472",
    "author": "sethearnest",
    "date": "2023-06-21",
    "content": "Bring that. Might be a great jumping off point for a song. “Am I a loser with nothing to say?” It’s not True, but it’s a true feeling the demons inside most of us shout every time we sit down to write/produce/mix/master/talk/etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153371532324782141",
    "author": "austenballard",
    "date": "2023-09-18",
    "content": "writers/composers: how many pieces of music can you get done in a day? I find I can do about 30 loops, 5-10 instrumentals, or 3-5 demos with vocals. I feel like I'm slacking though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153372082827174079",
    "author": "onanisland",
    "date": "2023-09-18",
    "content": "But I'm not a full time producer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153372318496731226",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I used to make a fair amount of instrumentals and beats but none of them ever really got used",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153372796680945724",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I still make little “song starters” in the event they might lead me to writing something cool but most of the time it’s just better for me to start fresh with the artist. Then I have the demo which is gonna be more put together than a 20 minute beat, and then I can produce it further from there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153373746191663115",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "You know when it’s a good one. Which is probably a shitty way of thinking considering my fav J Cole song was a beat timbaland didn’t even save",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153374364507586651",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "So on one hand I’m being less precious with beats and instrumentals but being way more precious about the songs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153385754463064124",
    "author": "cy (sigh)",
    "date": "2023-09-18",
    "content": "recent switch for me but I used  to just have dozens (sometimes hundreds) of things just sitting.  now i work on building kits and presets and in the process end up making stuff with them or at least getting one or two melodies out of it. \n\nmy main issue is that I get to a point where I start getting different ideas that I wouldn't want together in the same song /beat /inst \n\nwhen I get to that point I'll try a bunch of those ideas and keep the ones I like. after anything sits on my drive for too long without me changing it I open sessions up and export them as multi tracks, Stems or a 2 track (any combination I like really) and keep  them in specific folders. \n\nI'll flip through some of those in sessions (on top of anything I mightve made for the specific session). after a while of those being there. I move them toa diff folder which is linked to to my cloud service and let's anyone I share the link with download (w general guidekines for use) that way friends and ppl I work with can use them in their sessions or for fun. \n\nstart a new batch of stuff and repeat this process. some things I'm more attached to (for one reason or another) I might keep  longer to try to work on or pitch but that's it. \n\nup until maybe 5 months ago my process stopped after exportingthe tracks /Stems and using them in sessions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182252139217690624",
    "author": "Deleted User",
    "date": "2023-12-07",
    "content": "Producers with templates and preset collections- how do you navigate writing sessions when someone else is driving the session from their computer? \n\nHuge part of my workflow has been my template and my preset patches, and I would probably feel like I’m turning the wheels with my knees without them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188050612550635582",
    "author": "rae",
    "date": "2023-12-23",
    "content": "Ooo this is interesting! I’m the complete opposite 😅 always found production breakdowns harder cause everyone can have the same drum kit/machine but then produce completely different sounds so how do we know it was the drum part that sparked the song yknow idk if that makes sense? I guess you could say the same re lyrics too tho as everyone has access to the same words but we all write differently 🤷🏻‍♀️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188051500019224616",
    "author": "rae",
    "date": "2023-12-23",
    "content": "How do you break down the production side of things? @Deleted User",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199445712681828525",
    "author": "jonmatteson",
    "date": "2024-01-23",
    "content": "Wanted to ask producers who also write with artist what their writing sessions look like? \nAre you preparing tracks before hand? Making stuff on the spot?\nSitting at the computer or sitting together with acoustic guitars beforehand?\nHow long are you hanging before you start writing?\nI find my hangs going pretty long especially on the first write with someone but that usually leads to better lyrical content. However I want to be more intentional with our time without it feeling rushed. \n\nI’m working on my flow and would love some insight into what other people’s process looks like.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199782227190501517",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-01-24",
    "content": "I always try to ask myself what I can do so that artist wants to work with me again. And I don‘t wanna come across as another producer who cares only about making the next sick beat instesd of the song itself. I‘ve been told by a friend of mine that a lot of edm producers she‘s working with dont even put on headphones while she‘s tracking bc they don‘t give a shit about the vocal or performance",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200536583577817098",
    "author": "Rob Domos",
    "date": "2024-01-26",
    "content": "How finished would you say these sounded arrangement production wise?\n\nLike, are y’all using placeholder patches and scratches tracks when working at that speed or are you keeping enough that it’s at 90% day of?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200555098598821999",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "I go off the assumption that this is the only time I'll have this artist focused on this idea, so my priority is always getting a finished lead vocal and some ad libs. Those are the only things that can't be done without the artist there. I'll get the production together as much as it needs to be to get the artist excited about the song. \n\nThe challenge is doing this quickly, without spending unnecessary time going through snares and patches and shit. I find that nearly all of the best songs I've written happen in about an hour long window of excitement. Sometimes you can stretch and get harmonies or punch in some vocals beyond that hour, but the excitement of a great idea is exhausting and it's hard to keep everyone 100% engaged for a long period of time. If I'm on hour 2 of a song and we're still trying to decide if we like a chorus, 100% of the time it's not a good song (in my experience).\n\nA BIG mistake I make (still) is \"oh we have tomorrow we can take a break and come back.\" It's not about being able to get the artist physically back, but getting everyone back into the emotional space. So much of what I need from an artist is the emotional focused to commit 100% to a vocal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200575979916099655",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-01-26",
    "content": "When preparing songs/hooks for an artist in a session, what influences your decision making in the genre/sounds you‘re using for those? Is it literally anything you have written maybe the past days before or do you try to „guess“ what the artist might be looking for in a song/production or sound?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204961324648628294",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "Another difficulty I was facing was being producer and writer at the same time. It‘s really hard to be creative writing a song when at the same you need to handle all the technical stuff, work in the DAW etc \nI feel like my brain is so bad at multitasking in these scenarios lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204962956165652500",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-07",
    "content": "I feel you. What you said a few days ago about the duties as a producer really resonated with me. Being a producer is so much more than just making fire beats. It‘s a about a responsibility to ensure the track lives up to its potential. Which can be very inspirational but also put a lot of pressure on you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204969129325625415",
    "author": "Deleted User",
    "date": "2024-02-07",
    "content": "how much of lyrics do producer/writers usually deal with?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205212375427579904",
    "author": "austenballard",
    "date": "2024-02-08",
    "content": "I know it's not very representative of the kind of \"okay, the publisher booked us into the studio for the day and we need to crank out some demos in whatever style\" way of working but I don't really like doing those unless there's a good demo fee lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205710220161065010",
    "author": "austenballard",
    "date": "2024-02-09",
    "content": "I've had a few sync placements, not songs though - entirely instrumental pieces. Every successful placement has been through direct contact with a supervisor - I don't really send much to libraries.\n\nMost of my song placements with artists have been with people who are essentially friends of mine who ended up co-writing the final songs that went out.\n\nI've never successfully placed a song with an artist through an A&R with the exception of the situation I described above",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217993971901661335",
    "author": "rileybrewer",
    "date": "2024-03-14",
    "content": "He's a big insiration, love all his production work and solo stuff. Did he do his dishes? 😉",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218000909238534205",
    "author": "rileybrewer",
    "date": "2024-03-14",
    "content": "Wow.. Love those celestial shore records crazy creative songwriting and great production. Discovered them through this series years ago! https://www.youtube.com/watch?v=g9_fRmDnoKM&ab_channel=WeathervaneMusic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220657576333545534",
    "author": "Marshall",
    "date": "2024-03-22",
    "content": "Do any of you guys fall into the trap of writing the same type of song over and over again? lol. I feel like when I’m improvising over a beat or something I tend to make similar subconscious choices in the melodic structure/melodic rhythms/etc. the only way I can get out of it is by setting parameters before hand (ex: don’t start the melody on the 1…..use an AAAB structure……..make the A sections complex and have their own micro-structures/use many types of rhythms,  use like 3-4 notes in the scale maximum and mostly dwell on a single pitch/don’t hit the “money notes” lol…..Make the B section almost completely one  consistent rhythm, use way more notes in the scale than the “A” and hit all the notes you didn’t hit in the “A” to resolve the melody)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221344091841892382",
    "author": "Jonathan Arnold",
    "date": "2024-03-23",
    "content": "But how do you get a beat there fast without loosing the drive and creativity",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221435603791646822",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-24",
    "content": "I was privileged enough to be a teenager during the 2010 club banger era. Back then I hated it but looking back it‘s fascinating that at every club I went to people who might not have been musically inclined at all could sing along every word of the songs of that era, think Hangover, DJ got us falling in love, all the avicii stuff even levels which is mostly instrumental. There seemed to have been something magical about those lyrics and that particular kind of songwriting that really resonated with people and created an unbeblievable sense of unity. If you‘ve ever been in a club with hundreds of people singing along to Hangover on the top of their lungs you know what I mean. Raw power. It‘s easy to dismiss those songs as stupid but there seems to be something primal about them that really connects with people",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232647019361730621",
    "author": "Marshall",
    "date": "2024-04-24",
    "content": "Insane lyric writing mixed with great harmony between the melodies and the instrumental",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244554855620808725",
    "author": "BatMeckley",
    "date": "2024-05-27",
    "content": "https://music.apple.com/us/album/supervixen/1440827138?i=1440827321\n\nThis is the song that taught me what total silence in a track could do",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276576592767881236",
    "author": "Chad Rodgers",
    "date": "2024-08-23",
    "content": "Made like 4/5 sketches today for an artist I write for, and I'm feeling a little merrrrr for all of them. Need to get out of my go-to chord structures, vibes and feels. Anyone have any tips for this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298246657313603628",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-10-22",
    "content": "Does anyone have advice on how to battle brain fog during a songwriting session? I have this happen often when it‘s just me and an artist where I have to two do jobs at once (producing/writing) and only having limited capacity for the artist to bounce ideas off me when I‘m working in the track \n\nTalking about this feeling when your head gets heavy/almost like a pressure behind your eyes where nothing will come out \n\nUsually I just take a break but I‘m curious if there are methods that are more efficient and wont make us lose time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304786129358164058",
    "author": "whaleintown",
    "date": "2024-11-09",
    "content": "any suggestion on how would you hold an online writing session with an artist ? would love to learn the process of how it can be done and still getting a relatively good result.( sending files, email notes, facetime ?) Also could be nice to hear if the same can be done during production stage ? let me know your experiences !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304937656072798361",
    "author": "JJ",
    "date": "2024-11-09",
    "content": "Newbie question. Let me know if I should move it to a different channel.  \nDo Nashville songwriters (or similar?) get paid a small fee to write and create demos for beginning and mid-tier artists? Assuming they’ve been requested to come up with ideas. I’m talking about very basic demos - nothing fully produced.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324815186938429471",
    "author": "SoundsLikeJoe",
    "date": "2025-01-03",
    "content": "Do the songwriters get paid to create those demos?  No...  but they often PAY OTHERS to help them make the demo possible.  Nashville folk will often have \"Demo Days\" where a group of Ace players charge a flat fee to perform and record the rhythm section (for instance, could be anything the song needs). They might record 5-10 tracks in a day. I'm sure some have done more. These \"demo day tracks\" are used by songwriters to then pitch their track to recording artists, labels, anyone.  There's also a whole army of producers ready to help songwriters demo-up...  where the songwriter pays a producer to turnkey the track.  Sometimes it's one guy playing everything or a few remote players all chipping in under the producers direction.  \n\nAnd...  these are viewed as a \"very basic demo\" in the eyes of industry vets. A really good \"one take\" by great players with high quality equipment recording the basic tracks is a strong demo but not fully produced. Happens all the time, but the producer (and their team) gets paid by the songwriter (or their team) to produce the track.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324831355971964979",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-01-03",
    "content": "That's so interesting! \n\nTangent, it's crazy to hear about Nashville songwriting ways being from Sweden, which is so much more single producer centric. I was just watching some BTS of Nathan Chapman & team talking about how they recorded the Taylor Swift album Fearless in like, a few takes per song at Blackbird Studios right after she just brought in songs she wrote and played them for Nathan with her guitar. So cool, and fast. Great records",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324833608879444069",
    "author": "SoundsLikeJoe",
    "date": "2025-01-03",
    "content": "By \"single producer centric\" do you mean one person and a computer doing everything?  Or the producer, and whatever musicians and studios they use?  One-man-track producers can run into stylistic limitations that \"a guy and a laptop\" struggles to solve....   so the Nashville system is not radically different from any of the old studio systems (Motown, Wrecking Crew, Stax) or any project that uses good live musicians in a studio.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324834661859459152",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-01-03",
    "content": "Yeah! It varies on genre of course, but the songwriter scene usually has a main producer doing the bulk of the work. In the US system an equivalent would be someone like Cirkut. Not a huge amount of live band stuff going on there when I was active, but it was also the peak of the EDM era and the start of K-pop, so things were very electronic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324835054970601565",
    "author": "SoundsLikeJoe",
    "date": "2025-01-03",
    "content": "American Hip Hop and Pop are much more \"single producer\" centric too.  Even then...  there's often a team of people behind the curtain.  I know a gospel keyboard player that does A LOT of top-line ghost writing for big names in Hip Hop.  On the surface it LOOKS like a single producer, but there's a group of people helping behind the scenes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328028492562038938",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-01-12",
    "content": "Great stuff above, my experience is a bit different, as I’m sure everyone’s is :)\n\nI find that lyrics is where I get stuck, especially if I’m trying to write to a set melody. The biggest unlock for me was to write an entire song’s lyrics first, sometimes preceded with some journaling and/or research on the topic so I have real, meaningful things to draw from. I keep track of syllables etc so it lines up.\n\nOnce the lyrics are done and I’m working on the song, I always end up having to change a lot, usually simplify and take out, but it’s an easy problem when you have excess good lyrical content. As opposed to trying to summon something meaningful to fit a certain melody.\n\nSimple stuff like starting with getting the chorus right has also been super helpful, and keeping production to a minimum before the topline is finished.\n\nExcited to read more people’s hacks here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339731298289451149",
    "author": "peterlabberton",
    "date": "2025-02-13",
    "content": "I circled around some of these ideas a few years ago here, but now I’m more seriously thinking/asking for advice…\n\nI’ve never written a song in my life, and don’t have any real desire to do so (more than happy to be mixer/producer/drummer/multi-instrumentalist guy). But, I have a friend who is a super prolific writer. He has his own artist project which I’ve produced/mixed, and a few years ago had a publishing deal and has a good deal of writing credits. We’re a really good yin/yang pair: he’s focused on melody/lyrics/chords, I’m focused on rhythm/sounds/texture/mix. We have a co-credit for a Suki Waterhouse song for the one and only explicitly “writing session” we’ve done together.\n\nI just reconnected with him and mentioned that I’m about to be in a position where I could do more open-ended writing (/spec production?) sessions and would love to work with him again—specifically on some projects that have approached me more in the writing stages, and most especially on reaching for bigger artists. And he’s down!\n\nHere are my questions (and this is a *total* explain it to me like I’m five situation—I’ve really struggled to make sense of things business/session flow-wise outside of getting paid for a discrete deliverable or a day rate):\n\nI don’t feel a need to be too formal about things right now, but is this sort of partnership where we could pursue a joint publishing deal?\n\nMy main motivation is two-fold: keep a foot in production/engineering while I’ve leaned more and more into mixing recently, and use our credits to get in a room with bigger artists. Am I way off here?\n\nAnything I’m missing/obviously oblivious to?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354656891736821782",
    "author": "oaklandmatt",
    "date": "2025-03-26",
    "content": "The short answer is: you're a songwriter now too. This is a new part of your professional repertoire. This is great.\n\nI made a similar transition from producing bands to doing co-writing sessions as a producer. You can still get hired as a producer or engineer (as I still do), but writing sessions are structured with different expectations and potential outcomes. \n\nWhen you participate in songwriting sessions, you are almost never getting paid up front as an engineer or producer. There are some cases where super rich people will pay for songwriting sessions, or artist with bigger budgets might get their label to pay a studio fee, but this will be a tiny minority of your writing sessions. \n\nPhilosophically, the idea is that you're all creating something together that, if it's good enough, it will be released into the world in someway. But your experimenting and will make many ideas that don't cross that threshold. However, if any of the recordings of these song come out you will still get paid as a producer (/ engineer / mixer / whatever else you do on the final version). If no peace of the recording that you made when the song was written gets used, you will still participate as a songwriter on the copyright.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354659152709947472",
    "author": "oaklandmatt",
    "date": "2025-03-26",
    "content": "Finding success as a songwriter is really about building your network of people that you write great things with. If you're writing great things with your current people I would just take it to the max. Doing great work is what links you with other people. Meet those new people who found you through your work and then make great stuff with them (traveling to where they are periodically if necessary... and it will probably be necessary). Repeat repeat repeat eventually you have a career. \n\nThe conversation of should I move to [BIG MUSIC CITY] has been had a lot here, so you could probably search for some of the discussions. The short answer is, it will most certainly give you a leg up at some point, and almost every successful producer/songwriter who doesn't otherwise have a huge artist in their hometown that they exclusively work with moves to one of the big cities at some point. It's just hard to beat being in a city with thousands of other professional music people (LA, London, Nashville).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354660204406636564",
    "author": "peterlabberton",
    "date": "2025-03-26",
    "content": "@oaklandmatt you and this place are both gems, thanks! I actually got hit up by an artist this morning to schedule something for this exact co-writing thing—that and this response are good motivation to keep after this avenue of work!\n\nYes, role so far has been sounding board/musicianship/engineering and mixing/producing/providing studio. I can’t remember the split but on the Suki song he did get a bigger cut. I got a production fee when it made the album and it all felt fair to me. It’s registered with a PRO.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356413580974751845",
    "author": "Brian Reynolds",
    "date": "2025-03-31",
    "content": "First most of what I'll have to say for this is built on the foundation of this course by Louis Bell of Post Malone, Halsey, and Justin Bieber #1 fame. In this course he spends hours going over exactly how he writes lyrics to his gibberish melodies. Then how he goes about pitching these ideas to artists. After he has 24k Goldn there for a few hours and they write another song to gibberish melody. And you can see how the process are alike and contrast. https://studio.com/classes/louis-bell/hitmaking-for-producers?utm_medium=paid&utm_source=google&utm_campaign=ws_studio_brand_louis-bell_us_phrase&utm_content=studio&utm_term=louis%20bell%20studio&ref=m&gad_source=1&gclid=CjwKCAjw-qi_BhBxEiwAkxvbkH_XdBqN7jbkwQK-0pisWV_MsC4-VSGH_iGfcL85MML5SoRwB01Q9xoCFl0QAvD_BwE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357591878664585217",
    "author": "spectrummasters",
    "date": "2025-04-03",
    "content": "….hey man , yeah what Brian said . A stem ripper . \nI didn’t want to say in my OG post much more so as to not bias a potential interpretation of Louie bells process , but what I was struck by was the simple brutal idea of just taking the proven best elements of others work as a foundation to begin building your own frameworks . \nWe ve spoken about it before in other channels with regard to using a  sample to write to and ditching it later , or reconstructing a track and letting it become something new …..I’d not thought of or heard of simply ripping hundreds of classic drums and taking them into a writing session before though . \nThere’s something so abrupt and utilitarian about that approach that I felt it might be helpful to anyone who is struggling with their own process , should they be trying to write all from scratch",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1384999147958042826",
    "author": "Gabriel Tyranny",
    "date": "2025-06-18",
    "content": "Prompt for a fun question for the group: Is there a workflow that you’ve found to be a common denominator between your songs for how you write them?\n\nI’ve been writing songs for my current project by using a compilation of many notes, voice memos, journal entries, letters I’ve written then later converted to lyrics, etc. From there I used my current craft to sculpt them into each track that captures a theme, emotion, or something else that stood out to me.\n\nI often wonder how other active song writers put their finished pieces together. Is it as scattered as my process? Do they usually sit with an idea and write it linearly, line by line? A combination of things?\n\n\nI’d love to read other people’s processes and mindsets, if anyone would like to share.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385323238024024227",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "That is so interesting to head - I’ve never started with drums but can totally see this. I focus on the soundscape of the chords and melody, add a drum skeleton for lyric writing, write lyrics with song sections and overall composition in mind, then go back and change the production and drums to interact with the combination of the composition I envisioned and the cadence of the lyrics and how the drums interact with both at the same time.\n\nHuh - I’d like to be a fly on the wall for the drum first sessions to see how it all unfolds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385325146084212920",
    "author": "Josh",
    "date": "2025-06-19",
    "content": "I think the reason why the mixed practice/writing/track sesh is working for me is because it unlocks the childlike wonder",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1388954494783459348",
    "author": "Peter the Cat",
    "date": "2025-06-29",
    "content": "I struggle with lyrics. Back when I was actually writing songs I would bounce the demo and import it into loopy on my phone and go on long walks with it, with the ability to capture different ideas on additional tracks/loops. something about walking and chain smoking ciggs helped lol but that's when I was heartbroken sad boi and especially inspired 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397679017900904569",
    "author": "bobby k",
    "date": "2025-07-23",
    "content": "Anybody running writing sessions in pro tools? Any tips or workflow things you can recommend? \n\nAbleton has usually been home base for this, I see it as a flexible scratch pad to throw down parts while the artist and 3rd are going in on lyrics. I’ll go over to pro tools once we have something concrete and start vocals, but it’s annoying doing stems in the middle of a write lol. I’m wondering if pro tools sketch is at all useful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397691872599605438",
    "author": "samvalentine",
    "date": "2025-07-23",
    "content": "I have not found pro tools sketch useful, but I think it mimics the ableton scene workflow, so you might find that familiar",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463927412373852265",
    "author": "herbie",
    "date": "2026-01-22",
    "content": "yeah i think we might just have to do that. just sucks because all the energy is in the demo vocal and we were moving so fast i dont remember how we did the vocal hahaha. cant seem to get the same energy again when we re record",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463992473792807037",
    "author": "herbie",
    "date": "2026-01-22",
    "content": "it’s actually the worst haha. we do have quite an arrangement change in the second verse so i think keeping it should work!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471654730995466455",
    "author": "revolution",
    "date": "2026-02-12",
    "content": "im not a professional, pretty new to music in the sense of trying to create a product/song. Ive been an instrumentalist, engineer, writer, etc etc as a hobby or interest from time to time... and i notice that writing is one of the areas that I have the least doubts about myself. i fully believe i can write interesting bars/emotions/etc from time to time... but it's very much an abstract 'writing' skill that could be applied to poetry or essays or anything... rather than a reflection of my actual song writing ability.\n\ni want to learn how to hone my strengths and bridge the gap between having or putting out decent ideas (wether lyrical or melodic) and actually distilling a song structure and 'product' if you will. A good analogy is the gap between someone with good cinematography instincts/eye vs a director/writer/editor level of structure or authorship",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471659916518490165",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "Note on writing every day - focus more on the nuts and bolts of the song, the chords and melodies and structure. The production side and extra layers can come later. If you’re taking more than 5 seconds to pick a snare sound, you’re not focusing on the right thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472284607972901107",
    "author": "Jack",
    "date": "2026-02-14",
    "content": "Yeah, agreed. If all the repeated components are there (with different lyrics I guess. Verse, pre, chorus) then it’s a rep for sure. I think we get passes on bridges, especially if they’re instrumental. I have no justification for this but bridges have always been latent for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472293494910484572",
    "author": "Brian Reynolds",
    "date": "2026-02-14",
    "content": "I think if your also trying to up your production game in conjuction with lyrical top line melody. Then a rep should be a whole song. You gotta learn the nuances of subtle or drastic changes from verse 1 to 2. And deploying multiple transition techniques to keep the narrative moving and compelling",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472304065454149654",
    "author": "Will Trotman",
    "date": "2026-02-14",
    "content": "I assume the 30 minute song thing is just to keep the writing flowing daily and force yourself to not be precious and get *something* down? Curious what your perspective is on hitting an idea that does feel precious. \n\nI go in phases of enforcing a daily write like this (and need to do a better job of staying in it). But doing that sort of thing, I often wonder where the line is between \"you should try to beat this line or melody or come up with something you actually like\" vs \"don't be precious at any cost.\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472304124103229490",
    "author": "Jack",
    "date": "2026-02-14",
    "content": "And if I do commit it I start layering and it starts becoming an exercise in arrangement rather than songwriting. I try work horizontally, not vertically.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472306361877659699",
    "author": "Will Trotman",
    "date": "2026-02-14",
    "content": "Hahaha and then a place that you might've written a chord change, you might not even discover that because you're just looping things. For me it can discourage the actual inherent growth of a song that's in the DNA of the song and lead me to rely on production tricks to keep it moving along.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472310847648043241",
    "author": "Zack Hames",
    "date": "2026-02-14",
    "content": "I think you can achieve both, but do them separately. Take 1 day to write the song as discussed, then another day, new hat, new focus, do all the production in that 1 day.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472312882082611391",
    "author": "Brian Reynolds",
    "date": "2026-02-14",
    "content": "I agree. I do writing and production on different days with a different part of the brain. Original poster was talking about having a desire to create \"cohesive final products\". Production is part of attaining that goal. Even though this convo is happening under the songwriting banner",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472560839809826901",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "@Brian Reynolds if it gives context, im speaking from a place of doing zero production. i fully agree with @oaklandmatt about not trying to produce or really do any editing while writing. i primarily work off premade instrumentals, and am frankly only interested in the idea/feeling in front of me. in essence its usually a barely consious continuous freestyle. the best ones at least, come up on their own, i am there to maintain the moment and my presence in it. (and to turn on the recorder lol).\n\nso i was speaking almost entirely from an exclusively songwriting pov, and especially taking idea/demo with appeal/feeling to an actual song structure and consumable product/commodity frankly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472575431516360715",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "recording a demo right now, gonna write a song after this 🫡",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1473002650588155987",
    "author": "Will Trotman",
    "date": "2026-02-16",
    "content": "Man thank you for all these thoughts, this place rocks.\n\nThe something small every day feels super important. I think that anxiety is something I only experience when I’m not in the groove of writing and I have to beat the inertia again. Guess it would be like starting to work out then stopping for a week every month lol, definitely makes it feel harder than if you just continue.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]