[
  {
    "id": "1200522135244914768",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "If you're trying to be a highly successful professional, you should do all of these things and be prepared to adjust on the fly.\n\nI pretty much always have full songs, tracks, hooks, and concepts prepared. Much of the time, you won't use any of them on any given day. But good news: they're useful for future days.\n\nI've had all of that prepared and then the artist and I just chat for five hours, then write a song on a piano.\n\nI've had all that prepared and then cut song after song because the artist goes \"what else do you have???\"\n\nAnecdote that might be helpful: I've been in with an artist all week. Me, another producer/writer, and her. The other producer/writer has his rig set up and he also writes topline. We usually bounce back and forth depending on what the song requires. We've all worked together before and we had the whole week blocked out so there's no pressure to perform on day one. But we did three songs on the first day because she just came in firing. The first song she came in with a title and we worked from scratch and knocked it out in an hour. The other producer made the track quick with some existing drum loops he had prepped for her, adding keys and horns as we wrote. Then she asked \"do you have anything to play?\" I played her a track hook I had prepared. She liked it and we powered through that one in another hour. Then we broke for lunch. We caught up. As we were finishing she mentioned this one kinda stupid and sassy idea she tried to bring into another session but the producers didn't like it. So we wrote that one and it was fire. I tapped out a tempo as she rapped the hook idea and just make a skeleton beat on the fly.\n\nBeing way over prepared is rarely going to hurt you.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221123573503230003",
    "author": "oaklandmatt",
    "date": "2024-03-23",
    "content": "I have a different angle you could try. I would focus almost all your energy on becoming a better, more truthful, richer lyricist. That's the only place you'll be original because there's only one you. Paradoxically, it's also the way you'll write songs that have a universal appeal because the more personal you get, the more the underlying universal emotions will resonate with people.\n\nTrying to be analytical about melodies and structure and style when writing has never yielded good songs for me or literally anyone I know. All the best songwriters I've met write all their best songs lyrics first.\n\nAlso, when you have something to say, it's surprising how little you pay attention to the melody. The melodies and structural components seem to just come when your heart is already in the story.\n\nThe only other thing I'd say is learn A+ songs. Learn the lyrics completely and learn the story behind them as much as possible. Then learn to sing them the way the original version is sung. That will expand your vocabulary as a vocalist and reinforce great lyrics.\n\nLastly, technology is going to continue to increasingly replace stylistic innovation. Yeah AI blah blah blah, but already drum machines and synth presets and splice and DAWs. The last thing to be replaced will be you personally writing things from your experience. Songs about your deepest insecurities and songs about your pet gerbil both fall into this category. Explore all of it.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "900188589231587340",
    "author": "oaklandmatt",
    "date": "2021-10-19",
    "content": "write embarrassingly honest songs about your life. what's exciting you stressing you making you sad making you uncomfortable etc. \n\nps, all the A level songwriters i've worked with are super lyric forward. most people think it's finding a melody then writing lyrics to it, but 90% of the great writers i know are putting their feelings into words well before they're getting on the mic",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075789852584444075",
    "author": "oaklandmatt",
    "date": "2023-02-16",
    "content": "Some songwriting-related morning routine thoughts:\n\nI've been starting my day with doing piano scales and vocal warm ups to a metronome and then singing/ learning a song and recording a voice note of it. (recently it's been Tom Petty Wildflowers at the piano). Then I look at my phone and start my day.\n\nHard to know for sure if it's causal, but my songwriting abilities have sped up. I'm quicker in sessions, both with topline and tracks. \n\nI think it's related to several aspects of the morning routine, and they all compound. \n\n*I'm playing music before I'm on my phone, so I'm outputting music before my brain starts reacting.\n\n*doing scales w piano and voice opens up my vocabulary on both instruments and makes me much more comfortable to sing/play ideas when writing\n*doing these to a metronome has improved my timing on all instruments (not just piano and vocal)\n*learning a great song and singing it every morning has massively improved my lyrical writing/ improvisation (probably the hardest part of songwriting) by just reinforcing good *sounding* words.\n*singing and recording the same song every morning for a few days or a week makes me really THINK about vocals and vocal production. How I'm singing the words, how to push certain vowels in a certain part of my voice, etc \n\n@Slow Hand  @Ross Fortune @Will Melones @OJ",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1076849791700574228",
    "author": "oaklandmatt",
    "date": "2023-02-19",
    "content": "Yes exactly! I've found that the best songs are never calculated, they're always just felt as they're being created. They are magical/ incalculable moments. As soon as people start analyzing – \"is this too generic?\" \"maybe we should have a part like **insert artist**\" – the songs loses its magic.\n\nBut the paradox is that you can't  just sit around and wait for them to happen. You have to be in motion. So often times building habits and processes (which are calculated) is a great way to keep oneself in the motion of creating things. Piano scales, learning songs, writing a song a day, etc., are just some of the many ways to do this.\n\nAnd the other aspect is also correct. These are skill building exercises that help the quick translation of creative ideas. It's the emotional and psychological side of workflow. Just like technical workflow – where you want the shortest time between idea an execution – same goes for writing. If you are constantly writing lyrics and singing melodies and playing instruments, when that emotional magical idea arrives, you can translate it more quickly into lyrics, melody, and music.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990776963394326528",
    "author": "Slow Hand",
    "date": "2022-06-26",
    "content": "Depending on the kind of wall that you’re hitting with her, there are a few simple approaches that you can suggest that will get her thinking about the different dimensions of melody and how to play with it:\n\nA) Expansion - How long is the melody? It is a small fragment, or a full sentence? Stretch it out over a longer period of time. Sing it half as fast. Hold certain notes for emphasis.\n\nB) Diminution - Compress parts of the melody into faster runs. Make it shorter. Remove notes. Simplify the melody to its melodic essence.\n\nC) Repetition - Take a fragment of the melody and play it again. And again. And again.\n\nD) Modulation - Take a melodic idea and transpose it to different keys. The first movement of Beethoven’s 5th Symphony is built entirely off of a simple four-note motif. He got a lot of mileage from such a small element.\n\nE) Dynamics - Play with volume or intensity. Encourage her to go from soft to loud, or loud to soft. Accent certain notes for emphasis. This one is really powerful. For inspiration suggest that she try voicing her dynamics like a great horn player might. Get her to clip her notes very short or to make them “bloom” or be soft and round. Make them bark or be breathy.\n\nF) Be Another Instrument - Encourage her to try writing as another instrument with her voice. Sing a bass line. Sing a horn part. Sing percussively like Michael Jackson or James Brown would.\n\nG) Role Playing - Give her a character and a persona to inhabit. Make her sing the same thing as different personalities or people. Pick a melody and then make her sing it in the style of three singers that she’d know.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177707325725884447",
    "author": "Rob Domos",
    "date": "2023-11-24",
    "content": "Just had thanksgiving dinner at Alan Burgman’s house and we talked a good amount about songwriting. If you’re not familiar with his work, he’s 98 years old and has written lyrics for everyone from Frank Sinatra to Aretha Franklin to Quincey Jones to half of the artists your grandma listened to. \n\nAnyways, some good takeaways from last night’s convo:\n\n“Writers these days are more interested in immediate appeal than they are in a great song. They aren’t the same thing. A great song is only a great song if people will want to cover it in 30 years” \n\nHe cares immensely that whatever is being said in a song is worth saying. Does the message have strong intrinsic value?  \n\nHe’s verrrry quick to say he doesn’t like a song.\n\nHe has a strong preference for melody being written before the lyrics, which is particularly interesting consider his career is as a lyric guy. \n\nHe has a strong dislike for slant rhymes. (I disagreed and it turned into a whole family convo about phonetic tension and release)\n\nHe’s still writing every single day without fail. Today he’s writing on an upcoming Pat Metheny record. \n\nHe’s never heard of Drake or Olivia Rodrigo. Mind you his wife was the president of ASCAP for 15 years so this is particularly mind blowing. It shows me how siloed different worlds can be even when they are so similar and near to one another. What wisdom does one silo have on lock that the other is missing? What rules have been taught to us by people in one silo that don’t apply in the silos we ourselves are working in? A lot to chew on here.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472297813420544222",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Given that this is #✍songwriting-talk , I would strongly advise people who want to learn how to be great songwriters to avoid any production at all when doing the practice we're talking about.\n\nIt's so much easier (and time consuming) to play with snare drum sounds and production transitions than to stay focused on lyrics and melody. Almost everyone I know, and seemingly everyone that asks questions here, just needs to write lyrics and melody over and over and over.\n\nIf you want to get reps to become a producer, that's awesome. Go to #🎹production-talk and talk about those reps.\n\nTrying to also do production while doing the exercises that we're talking about will only slow you down.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261743620416081920",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "I'll give a point by point analysis, cuz why not?\n\nFirst off, I love Irving Berlin. One of the greatest ever. White Christmas, God Bless America, Always, Cheek to Cheek. A master of the craft. \n\nThat being said, adhering to portions of this list could lead a songwriter in 2024 exactly in the wrong direction. Keep in mind two things: one, great artists are rarely great explainers of what makes them great. And two, his career ended in the late 1950s. This means his golden era was pre-Motown, pre-Beates, pre-television, etc.\n\nOk, my thoughts:\n\n1. This doesn't apply any more. He's speaking in relation to a time when music was more complicated. Music is MUCH simpler now. For example, White Christmas has a much larger vocal range than every Selena Gomez song. Also, 99% of songs today are recorded by someone writing it. It's much more important for the singer/songwriter to sing the song in their vocal range than to worry about some future audience. People rarely write songs and then hire a demo singer any more.\n\n2. (and 7 and 8) The best advice on here. Simplify. \"Kill your children.\" Remove things you love in order to make the song more concise.\n\n3. No. The culture changed, there are a million counter examples since Motown/Beatles. Sure, you can write a song without gender (\"you\"), but saying songs SHOULD be genderless is just wrong.\n\n4. Don't write frivolous songs? I'm all about authenticity and connecting emotionally to a song, but this is strangely phrased and doesn't seem very instructive. \n\n5. Every time I've seen people try and follow this, they write bad songs. As the great David Foster said \"There are only 12 notes and 26 letters, and Beethoven and Shakespeare already did it better than you.\" You're unlikely to find original chords, melodies, or words. The only original thing is your own life experience. Don't be \"original,\" be honest.\n\n6. Kinda. I guess I mostly stick to this. But also, there are thousands of great counterexamples after 1960.\n\n7, 8, 9. All great",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328022413983879199",
    "author": "Zakhiggins",
    "date": "2025-01-12",
    "content": "1. I do it first thing in the morning when I wake up before things like my phone ruin my brain for the day. \n\n2. Make it a routine. I make some time before i have to go anywhere every morning to try and create something. When your brain gets used to the idea that you're going to that place at the same time every day, once you go there then the ideas flow better with time.\n\n3. Understand it's ok to write something bad, with time good ones come. \n\n4. Understand that a song is never actually finished, it can only be abandoned wherever you chose to abandon it.\n\n4.5. Understand that it's ok to figure out what a song means after you write it.\n\n5. Understand that we're trying to make trees, not tables. (As in sometimes it's not healthy to keep refining something till it's too straight edge and the vitality is gone from it)\n\n6. Said it already but saying it again, don't check your phone before you write\n\n7. I don't always write lyrics. Sometimes i write a melody, sometimes a chord progression, sometimes lyrics. Every now and then i do a session of what i call Lego writing, where i try to see what lyrics i wrote before fit with what melody/chord progression etc. \n\n8. Oh and did i mention, it ruins my creativity to check my phone before i make anything? \n\nThis is what works for me, hope it helps you!",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "881350955013132299",
    "author": "isaac joel",
    "date": "2021-08-28",
    "content": "re: writing songs acapella first...if I had to guess I'd swear that Aaron Cartier does that, his songs are so simple and hooky but very vocal driven. As an aside I don't understand how he's not like...the biggest artist in the world and dominating TikTok 🤷‍♂️ so damny good https://www.youtube.com/watch?v=F-iWQRHJwxs",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058037149146038312",
    "author": "NoahNeedleman",
    "date": "2022-12-29",
    "content": "I used to do a thing like that with a bunch of buddies in LA every September. \n\nIt started cause I wanted to practice using key changes or modal shifts as a songwriting technique, and so I had rules for myself:\n\n1) first idea that fits, wins. No agonizing over lyrics or Melodies or whatever, if it rhymes and makes some kind of sense, move on with it. \n2) first year: ever song needed a key change or modal shift. Second year: shifting or alt time signatures. Third year: some other esoteric tool I wanted to learn etc…\n3) the moment you’re done, record a voice memo and send it to someone. Mistakes and all. \n\nThe key for these rules was the make the quality of the songs less important than the act of writing. But damn if I didn’t get two or three real winners every year.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076571860617134141",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "This and one or two more parts\nWith chords and melody\nDo it daily for a year\nA great songwriter you'll be",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472308753662611680",
    "author": "oaklandmatt",
    "date": "2026-02-14",
    "content": "Outside of just getting daily reps, the main goal of this particular practice (the 30 minute write) is that you're setting parameters where you don't have time to decide if something is good. The point is to relieve yourself of any editing and force yourself to quickly write lyrics and melodies. \n\nIt's doing two separate and important things: building muscle memory and teaching to work on instinct.\n\nBuilding songwriting muscle memory is just like learning a language. You're practicing over and over until you learn how to express yourself emotionally. This is the basics component. You'll learn what notes you can hit and what words rhyme and how rhythms bounce. You'll build a foundation that will become second nature.\n\nRelated but distinct, you will learn how to move quickly. It turns out most great songs come in an unthinking way. Until you learn how to write without editing and thinking about what you're doing, you are less likely to write those great songs.\n\nI'm speaking from a lot of personal experience, but also whether it's Hemmingway's \"write drunk edit sober,\" or the Rick Rubin, Pharrell, etc. belief that great songs come from some power outside of ourselves (\"Source\" or God or whatever), learning to create without being analytical is super super important.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "858205648285073439",
    "author": "oaklandmatt",
    "date": "2021-06-25",
    "content": "@David Fuller with rare exception, a hit song can be sung and clapped along to. Occasional instrumental hooks (though most of them can be sung) are the only exception I can think of. \n\nThis is where the \"a great song can be sung and played on piano\" gets it wrong. Singing/ clapping is the fundamental. Rap songs to ballads to dance songs.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385770568506146816",
    "author": "Slow Hand",
    "date": "2025-06-20",
    "content": "I've always been inspired by the working relationship between Elton John and Bernie Taupin. \n\nBernie (who strictly writes lyrics) would mail completed lyrics to Elton, who would sit at the piano and write to them. I can see several advantages  here:\n\nA) You have a complete subject, theme, and narrative arc.\n\nB) The dramatic arc of the lyric informs the shape of the music, which can give the lyric additional support and also shake the writer out of their usual approach.\n\nC) The lyric can be stretched or compressed until it finds it's proper cadence and allow the singer (Elton) to find the best melodic fit to support the lyrics.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880155087626981396",
    "author": "oaklandmatt",
    "date": "2021-08-25",
    "content": "yes and do it all the time. And write more acapella. Thats the most underrated shit. Truthfully, a lot of the best songs I've been a part of have been started as a lyric/melody combo before any chords were played.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1002332385406373899",
    "author": "ALXCPH",
    "date": "2022-07-28",
    "content": "hot take, dont try and invent the wheel. listen to great songs, splice a few melodies together, and you got a new great melody. its basically what anything in the spotify top 50 has done.  🙂",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076506185051676672",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "I was moreso a producer and added being a songwriter to it. \n\nFirst off, DO IT. It massively improves your production and usefulness to the music industry. And it's fun as fuck to be good at another thing.\n\nSecond thing. Another way to think about it, especially as a producer, is to start thinking of yourself as a songwriter first. What does that mean? Write lyrics all the time. Keep notes of song title ideas. Make voice notes. And write a bunch of songs.\n\nLast point: tracks and melodies are easy. Everyone can do that. Lyrics are hard. Write lyrics all the time. Lyrics lyrics lyrics. @OJ",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222179366575013939",
    "author": "oaklandmatt",
    "date": "2024-03-26",
    "content": "Definitely doesn't hurt! It's also the easiest part to learn and can be learned through doing. The \"doing\" being pushing oneself to be more honest and vulnerable and authentic about putting yourself into the song.\n\nWhen you focus on analysis of structure and melody, you don't learn how to be authentic emotionally. When you continually write songs where you try to improve emotional authenticity and clarity, you learn structure and melody.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261803179989798933",
    "author": "oaklandmatt",
    "date": "2024-07-13",
    "content": "You're absolutely right that trying to copy existing hits rarely makes great songs. He's 100% correct on that point.\n\nI'm saying that songwriters often fall into the trap of trying to be \"original.\" They mistakenly think this means they should try to invent new phrases or not use \"generic\" words or try to do something \"interesting\" with the chords. Instead of doing the only original thing that is possible which is tell your story and express your taste. This is actually much more difficult to do because it's incredibly vulnerable.\n\nYou can compose fully original compositions this way. But it's also interesting how much groundbreaking music comes from direct appropriation of existing popular music. \n\nFrom folk music (\"Blowin In The Wind\" is a melody from another song) to hip hop (all of sampling) to producers and DJs making careers from remixes, playing around with current or past hits can also yield incredible new music.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463943698365677588",
    "author": "Nomograph Mastering",
    "date": "2026-01-22",
    "content": "Or repeat verse verbatim lyrically but with a melodic variation towards the end, also love anticipating that as a listener",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827616829853270036",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "learn your favorite songs in depth. there's always a lot more going on that you think. many of the best songwriters i know just know a ton of songs. not only does it teach your conscious brain, but it builds muscle memory for a TON of good habits. lyrics, rhymes, the sound of words, melodies, harmonies, cadences, vocal performance, etc. Study the greats like @joebegalla said!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880520432665645127",
    "author": "Josh",
    "date": "2021-08-26",
    "content": "Now that I think of it, the best songs I’ve written are when the melody and lyrics hit me while I’m still fucking with chords, and there’s nothing even in the DAW yet. Gonna spend the next few weeks hopping on voice notes now. Will update my findings.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121200438163800236",
    "author": "LAPhill",
    "date": "2023-06-21",
    "content": "Maybe you come out of the session with one good lyric, one good topline, one good groove. Keep your expectations low for what the end product \"has\" to be and be open to where the session leads you.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178394854213034135",
    "author": "Rob Domos",
    "date": "2023-11-26",
    "content": "His stance against slant rhymes seems to be more about being in favor of things fitting very tightly together and having intentionality and form and structure. He and another friend of mine viewed slant rhymes as mostly a product of laziness, as if the writer couldn’t be bothered to find something that truly fit.  \n\nI countered referencing the hook to an Olivia Rodrigo song where every single rhyme is a slant rhyme, which IMO adds to the value of it because she’s trying to express how things don’t quite fit and how the thoughts in her mind are unresolved, and the rhyme scheme should reflect that to create a unified feeling. \n\nThe lyrics are:\n\nYou’ve got me thinking\nThat two plus two equals five \nAnd I’m the love of your life \nCause if rain don’t fall and sun don’t shine \nThen changing you is possible \nNo, Love is never logical \n\nHere she’s searching and grasping. She’s unresolved. She literally uses a metaphor of the math not adding up. Why would we then make the math add up phonetically? It would weaken the effect. \n\nAlan was meh on it. \n\nI also argued that hard rhymes can be like the phonetic equivalent of a classical Haydn V-I movement that has very little color or tension, and that slight rhymes can be like jazz chords and that adding a 7 and a sharp 11 on top of the tonic chord doesn’t mean you “failed to resolve”. Someone else at the table was like “well show me a truly great song built on slant rhymes and we’ll see. I’m open to it” and in my head I was like “I thought I just did” but they didn’t love it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287561324687134760",
    "author": "Slow Hand",
    "date": "2024-09-22",
    "content": "I think this is a good approach. Start by suggesting that you both do the writing with \"stripped down\" instruments like a piano or an acoustic guitar. Or at least an electric with no pedal board. Leave that at home. Something that will force you both to focus on the core song and not be diverted by sonic considerations. Those can all come later.\n\nThink of it like writing a lead sheet: Chords, melody, and lyrics. This is the heart of the song. Focus on getting that right and you'll unlock so much potential.",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "842438318423670856",
    "author": "oaklandmatt",
    "date": "2021-05-13",
    "content": "yep. I'd say the #1 thing that ruins songs in songwriting sessions is overthinking and overwriting. Trying to make things too complicated melodically or lyrically, trying to add too much information in a record.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860535201440202792",
    "author": "Alessandra Morris",
    "date": "2021-07-02",
    "content": "it’s like an  intuitive thing i think. But like @oaklandmatt said, it kinda comes with time, practice and also messing up. I’ve found great hooks by making mistakes. Sometimes i just grab the idea for a hook from a portion of the top line that I already did, I just change it a bit, make loads of variants of that motive. Or just move around the key of the song and get a lot of options. You know what i mean? Its hard to explain by writing😂But its just trial and error tbh. Don’t think there is like a formula 🤷🏻‍♀️",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121254677477072947",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": "Am I a loser with nothing to say?\nI sit around doing nothing all day\nAm I a loser, am I a loser\nAm I a loser with nothing to say?\n\nBOOM hook done thanks bro send me your publishing info, 25% sound fair?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178408050089009334",
    "author": "chrissorem",
    "date": "2023-11-26",
    "content": "Good point! Pop culture has changed drastically and is moving at record speeds. And there seems to be two categories. musicians/bands and entertainers whose specialty is music.  I often think the world of speed dating song writing is not a great catalyst for writing  a great song.  Not that it can’t happen but the structure generally leads to mediocre songs that are written in forms we can predict.  I do miss the arch of a well written song with melodies give me chills and a bridge of that breaks my brain.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240733755400912927",
    "author": "Slow Hand",
    "date": "2024-05-16",
    "content": "Chilly Gonzales (the musical genius) with some good insights on melodic writing, using the ABBA catalog as an example: \nhttps://www.youtube.com/watch?v=BM0MO8y72t8",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1443648713288585217",
    "author": "Brian Reynolds",
    "date": "2025-11-27",
    "content": "Don't let good grammar get in the way of good melody",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827668863486263306",
    "author": "oaklandmatt",
    "date": "2021-04-02",
    "content": "If you're a producer and not a songwriter, and you want to be a songwriter in sessions, start writing songs on your own. Write 100% songs yourself, where you write all the lyrics and melodies and record your own vocal. The first 50 will probably be trash. That's ok. You don't have to show anyone. Just finish the songs and then write more. Put in the time and then you won't have any hesitation in a session because you'll be a songwriter.\n\nWatch the Ed Sheeran doc for more inspo. He wrote 2-3 songs a day for ten years. That's why he's so good. There's no shortcut. Just start writing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "844384828454862889",
    "author": "oaklandmatt",
    "date": "2021-05-18",
    "content": "@Alan McKee I love this topic. People connect to the emotion of lyrics way more than the literal story. yes, the lyrics are important in that catchy memorable things are important. But more than that, lyrics are the way to express a feeling. \n\ngreat songwriting, like great poetry, allows people to connect their own lives to words that aren't about them.\n\nI didn't grow up in the hood in atlanta but I love Young Thug because I hear his joy and his pain and his bravado in his songs and my heart connects. I've never worked on a farm but when I hear \"I ain't gonna work on Maggie's farm no more\" by Bob Dylan I feel that rebellion and connect it to my life. When the chainsmokers sing \"baby hold me closer in the backseat of your rover that you can't afford and your roommate back in boulder and the mattress that you stole\" I know that feeling because I've been 20 and in love and in a crazy time in life.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860618335967641601",
    "author": "chadwahlbrink",
    "date": "2021-07-02",
    "content": "Quote time \n\n“Instead of saying, “I’m stuck, I can’t come up with anything good,” it’s far more effective to say, “I’ve finished this, and now I need to make it better.” Or possibly, “I finished this, and it can’t be made better, but now I’m ready to do the new thing, because look at all I’ve learned.” \n\nThis is the story of every human innovation. \nThis is the story of every good idea, every new project, every pop song, every novel. There was a bad idea. And then there was a better one. \n\nIf you want to complain that you don’t have any good ideas, please show me all your bad ideas first. \n\nBefriending your bad ideas is a useful way forward. They’re not your enemy. They are essential steps on the path to better.”\n\nChap 167 of “The Practice” by Seth Godin.\n\nI feel like this is very in line with getting better at all of the creative crafts out there! \n\nSub in “Show me all your bad hooks” or “show me all your bad mixes” and you are headed in the right direction.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876215060844916746",
    "author": "Rob Domos",
    "date": "2021-08-14",
    "content": "I’ve been trying to solve this puzzle and I have a working theory that the goal is to meet people’s expectations in a way that they don’t expect to have them met. Like for example: If I hear a melody in my head, rather than singing the next note I hear in my head, I’m trying to sing a related note, like a a 5th below or a third above or pop the octave on that one note or something so it still goes where they expect it too harmonically and tension / release wise, but it surprises them melodically",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036208089847828491",
    "author": "rae",
    "date": "2022-10-30",
    "content": "Hi peeps, does anyone have any advice on writing chords for songs? I’ve always written lyrics with a melody and then given that to someone else so they can fill in the right chords but I really want to be able to do this myself but I struggle a lot with it so I was wondering how other people find the right chords for songs to match a pre existing melody? Thanks in advance! 🥰",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075380035998978128",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "i once sent beats out to a songwriter who was working with a new upcoming artist, i included this beat with a hook I made on it that consisted of like 10 words, ended up selling this idea to Sony which was my beat and the idea of the hook as they sung the same hook but included a bunch of their own lyrics",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1208061627245793301",
    "author": "Zakhiggins",
    "date": "2024-02-16",
    "content": "I think my favourite thing about alternate tunings is actually not learning them. You can come up with some pretty unique stuff that you may not have otherwise thought of just by fooling around and not knowing what you’re doing. I get a similar effect off playing left hand guitars, or other string instruments that have different tuning to guitars. It’s like transporting myself back to when I was 14 and knew no music theory at all, trying to figure out how to play the chords and melodies that were in my head.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222133588691255366",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-26",
    "content": "I think the idea of this dichotomy „manufacturing“ a song and writing from the heart is a very interesting topic to talk about\nPeople have been painstakingly constructing pop songs before melodic math was a thing (think any ABBA/ Hall & Oates hit) while others are purely intuitive",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222133741921501234",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "Also, I think “melodic math” is just a new term for something that has always existed tbh",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472572222370480322",
    "author": "Brian Reynolds",
    "date": "2026-02-15",
    "content": "Then back to Matt's advice. Think less, do more. Write, write and then write some more. I used to sit on the train and listen to things like Gym Class Heroes, John Mayer, Say Anything, etc. and write lyrics to their melodies and songs. This is in 2006 before you could just download instrumentals. And by osmosis you'll learn and pick up on their lyrical structures and how they create a \"consumable product\"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591986546868236",
    "author": "David Fuller",
    "date": "2021-06-18",
    "content": "@Marshall another great example of a melody that doesn't work without something under it is Run Away With Me by Carly Rae Jepsen",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "899717743400583279",
    "author": "eliotpeace",
    "date": "2021-10-18",
    "content": "It’s interchangeable for me. 9/10 times I like the sound of my u87 clone straight to daw better than voice memos when it comes to super melody content. That said, voice memo recordings have a really unique time capsule-ey sound to them. Similar to how a dictaphone or tape recorder can date a sound. I still use voice memos all the time, usually out of necessity of time / space",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069761248310345899",
    "author": "ehutton21",
    "date": "2023-01-30",
    "content": "Like honestly, it’ll sound crazy to some (or maybe it won’t), but the way high level melodic hip hop artists write has always been the most consistent and accessible method I’ve found when applied elsewhere. The other strategies may work pretty well, but I have more ability when I focus on the flow.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121191984980303964",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": "I've always written in group settings, whether in a band or for an artist or for pretty much any other purpose. Even things I've written solo usually end up with one other person on them changing a word or a melody before they go out",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121196912872263702",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": "Yep! I am as we speak sitting here with my guitar trying to get a few hook ideas at least",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180876120040677376",
    "author": "Chad Rodgers",
    "date": "2023-12-03",
    "content": "Title afterwards generally. Whether it means picking through the lyrics and finding something cool or apt, or just using the main refrain/hook to inform whatever it’s called (90% of the time it’s the latter as I think overly clever or smarty pants titles tend to be lost on the audience).",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180920587158294629",
    "author": "shaunobi",
    "date": "2023-12-03",
    "content": "I do both when songwriting. I have a Google Doc of “songwriting starts” that includes little fragments - some titles, some a couple lines of verse, etc. A lot of times though it’s just the hook. So the title I start with becomes the hook, or the hook becomes the title. Like Chad notes smarty pants titles are kind of boring to me now…",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188126231389024296",
    "author": "cy (sigh)",
    "date": "2023-12-23",
    "content": "Questlove was actively trying to imitate the feel of J Dilla's drums in those sessions and he said he STRUGGLED  because he was so used to trying to be perfectly on time in those days - there's a couple interviews (red bull is ones I think w d'angelo there ). also I forget the engineer's name but he also has a seperate interview (if you haven't already seen it)\n\nbut on the topic I think in my case my fiction (creative writing) background helps a lot. Theresa few exercises we used to get m, some for eveyone and another was based on each person's writing styles. \nfora general excercise teach would have us write down a phrase or two we overheard during the week ina public setting (train. bus, in class etc) and create a short story that Stems from it.  this is good for being able to create things out if nothing - world creation using a set core, \n\nmy natural writing style is v descriptive so one of my peesonal excercises was to write explicit sex scenes every week. it's extremely hard to find the correct balance between keeping it enticing and going over the top and losing either making the readers cringe  or unintentionally laugh. (and we laughed so often 😂)\nall these would be read and workshopped in the class itself. \n\nI think one of my main skillsets now is based in those skills. I'm very good at re-writing / editing and most of all reframing sentences. when other ppl give mea direction to follow, whether  it's just the idea or maybe they already have words and need to readjust to whatever music we now have on hand. \n\njust recently wrote a whole song I thought was too generic and open ended but loved the ideas. pitched to an artist and they loved it. we're working on editing the lyrics to insert a ciuole personal scenarios of hers but most of the vocal melodies and words are actually the same as what I had.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1188128157740564480",
    "author": "cy (sigh)",
    "date": "2023-12-23",
    "content": "also, whike I write other things without issue. I write songs with a melody carved in 100% of the time. whether or not I have music for it.  I can change it up after without issue but writing without vocal melody vs writing without then editing gives me very different results (I feel anyway)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1208298252517122068",
    "author": "Rob Domos",
    "date": "2024-02-16",
    "content": "Exactly this. Muscle memory goes away so you have to follow your ear, and ergonomics lead you into wayyyyy different melodic places. It’s a sure fire way to end up in fresh territory",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221397512938852402",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-24",
    "content": "That‘s a very intersting and thought provoking perspective. On the other hand, don‘t you think that a lot of people, especially those who don‘t have as deep of a connection with music as we do, don‘t really care about lyrics that much as long as they have a simple, easy to remember hook they can sing along to? Or at least a memorable melody they might not even remember the lyrics of?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1224886348448665703",
    "author": "austenballard",
    "date": "2024-04-02",
    "content": "@Ross Fortune started one a while back",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287557823152259266",
    "author": "Calvin Lauber",
    "date": "2024-09-22",
    "content": "Try handing him a bass and asking if he wants to write a song focusing on the root notes, vocal Melodies first, if you come up with something throw a drum loop on it and hand him the guitar and I bet he’d play some cool stuff to it. I get when that’s your primary instrument starting too guitar-brain to focus on the songwriting part",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304263718883819591",
    "author": "oaklandmatt",
    "date": "2024-11-07",
    "content": "Yes x1000\n\nStudy the best things, even if they don't always seem to apply directly to what you're doing. \n\nMax Martin is maybe the best at making vocals sound A+. He is well known as a detail oriented, vocal-focused pop savant. He is often a part of every choice from writing lyrics and melody all the way to adjusting sibilance in the mix. His instincts for great melody and rhythm, paired with lyrics that sound good, is unmatched. And I say \"sound good,\" because though I think many of the lyrics of his songs are meaningful (especially with the best lyric co-writers), the choice of words and how they are emphasized and enunciated is what separates him from everyone else. It's like Michael Jackson. \n\nDo some YouTube searching on artists talking about working with Max Martin. You can learn a LOT about writing vocal from him.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356414365825237164",
    "author": "Brian Reynolds",
    "date": "2025-03-31",
    "content": "But beyond that. You can comp the gibberish together to make the most compelling melody for the part your writing to. Then just loop that part. And start to sing with your comp. Ask yourself what's the mood of the song, what mood am I in. And just kinda flow with it. Like improvising on an instrument. Its a muscle so it will take time and effort. The more often you sit down and improvise melody the easy this will be. Doesn't always have to be a voice exercise. 15 mins of mindless melody exploration on a guitar or piano will stretch the same brain muscles.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385030307278749817",
    "author": "Brian Reynolds",
    "date": "2025-06-18",
    "content": "I'm always in the daw. Always recording.\n\nSometimes melody first. But mostly drums first.\n\nBuild an instrumental just chasing intuition, quickly. 2-3 melody parts and a bass line on top of drums. And youve got a chorus loop. \n\nThen take that improvisational melody muscle and apply it to the vocal melody. \n\nIm not a big humming guy, I get to words pretty quickly. But will start with common phrases to me like,  \"runnin runnin runnin round runnin runnin runnin down\" I have a few others.\n\nI start to land on a melody, with a feeling and story. That I haven't told. Sometimes it takes 90 seconds, sometimes 5-10 mins. \n\nRecord and comp till I have what I like. Than do all the background vocals. \n\nThen start muting a couple of the melody parts. Find my verses.\n\nRinse repeat the process above. But now I know the story and I just have to find the melody and the thru line narrative.\n\nDepending on how the verses feel running into the chorus. Or short length of track. I'll write a bridge \n\nMelodyne the vocals.\n\nStructure the song.\n\nMix the song.\n\nUpload the song.\n\nMake another.\n\nThis usually takes 2-4 days, intermittent with regular life.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385273564210532505",
    "author": "Josh",
    "date": "2025-06-19",
    "content": "So I’ve been trying to write more and I was getting frustrated because telling myself “it’s time to write” doesn’t yield the best results. I’m also trying to get better at guitar and just started playing more. Turns out playing more makes me find cool tones which gives me cool ideas that I end up finding melodies to while I’m practicing whatever it is that sounds fun that day. Then to double down on the practice I come up with lead lines over the track until my fingies get tired and then lay down the vocal.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385304173247205488",
    "author": "Brian Reynolds",
    "date": "2025-06-19",
    "content": "Also, if i go melody first, with say acoustic. I'll play till I really got it. Record no click. Find bpm. Then go find drums that work with melody and bpm. Rerecord the acoustic to drums. Start building from there",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385766847168909353",
    "author": "Ross Fortune",
    "date": "2025-06-20",
    "content": "Ah, gotcha. I think. Yeah the way it typically comes together for me is good chords (even better if those chords have a good rhythm), then gibberish melody that might have some real words and phrases mixed in, then lyrics to those melodies. \n\nI know @oaklandmatt is a proponent of lyric first writing. I’d love to get better at that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399130324319076512",
    "author": "Ross Fortune",
    "date": "2025-07-27",
    "content": "What I’ve enjoyed about considering Ralph’s rules is that they’re making me think through a different lens about both the lyrics in songs I know and love, and the lyrics I’m writing and how they work in different contexts.\n\nThe character in Adele’s “Someone Like You” is a loser by Ralph’s definition. But if they weren’t, how would it change how I identify with them? How would I relate differently to their experiences? What emotions would I feel? How relevant would those chords and that melody be, if the sentiment changed? Would the song have legs at all?\n\nI can be a little more cognisant of how much salt I might add next time, and how much sugar I’ll need to  balance it out.\n\nLike when confronted with Jon’s no compression thing a few years back - a lot of us tried it, discovered it’s not an always/never dichotomy, but in doing so gained a deeper understanding of why and when and how hard we can use that flavour and to what effect.\n\nIt all sharpens the axe.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471659259895746641",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "1. Write a song every day (or attempt) certainly you’ve heard of and likely tried this, but nothing beats reps.\n\n2. More technically, write out the structure (intro, verse, chorus, etc) of some of your favorite songs and mimic it exactly. Even as far as how many measures, or even dynamics (or tempo changes!)\n\n3. If you play an instrument, Learn “great” songs. And ideally sing with them. Playing the best songs in the world will seep into your writing and show you new ideas on chord movements, melodies, and the physicality of a great song.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827588585673850891",
    "author": "greghvnseb",
    "date": "2021-04-02",
    "content": "Best song writing material for beginners IMO is the Beatles catalog. Great progressions and great voicings, harmony, melody. Great resource",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827627245124059176",
    "author": "Tony Chetta",
    "date": "2021-04-02",
    "content": "What are y’all’s thoughts on the producer in a write contributing to the lyric and melody?? And just how to know if your lyric ideas are any good? My write this morning was kind of a bust and as the producer in the room I feel like I probably should’ve tried to spark some concept and lyric ideas but I’m so unfamiliar with that side of things...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "827638754876325968",
    "author": "Zack Hames",
    "date": "2021-04-02",
    "content": "My best way of learning theory was just by actually having a reason to use it. Just trying to learn broadly/abstractly is very difficult IMO. A project in school, I had to transcribe a 70s funk tune by ear, get musicians to come and play the charts, then record it authentically and recreate and match the mix. This has organ, horn section, guitar, bass, drum kit, background and lead vocals. I learned so much from that process.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "842444273378000906",
    "author": "Josh",
    "date": "2021-05-13",
    "content": "I’ve been thinking a lot about how pop music is supposed to be easy to sing along to. So I def have the advantage here considering I play auto tune like an instrument with my flat ass voice. Now I just gotta do it all way better hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851462412610961458",
    "author": "Yago Ibars",
    "date": "2021-06-07",
    "content": "I've been having a thought on my songwriting I wanted to share here. As a songwriter I have this toolbox of melodic and harmonic approaches  that I can use to solve any problem when making a song, or to have direction to create another section. But recently I've been noticing that something that makes a huge impact on songs is how the different sections relate to the tempo of the track. I think this might not happen to people who write to a beat, but I think that when you are playing an instrument, tempo is so fluid that some parts of a song might \"feel\" good and others won't (at a same tempo). When all the sections flow well into another in terms of tempo (and probably how that affects to vocal delivery) it sucks you in as a listener and it is way more singable/enjoyable. And now I'm starting to see this as a priority more than which notes of the scale have more weight on the chorus and stuff like that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851469831248412744",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I think a lot of it has to do with the melodic rhythm. In terms of how the sections flow, if the melody can drive it on its own- the accompaniment or production will follow. And as you mentioned, high notes can move the energy and accent the rhythm. Lyrical stress patterns could contribute to the accenting and note selections. Weight sometimes means notes that are held longer than the other sometimes the opposite. Contrasts can do a lot though. Range of movement or the range of the pitches themselves, pacing of the rhythm and rests, breaking the patterns/repetition can help with contrast",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851475913195782205",
    "author": "Yago Ibars",
    "date": "2021-06-07",
    "content": "Couldn't agree more! I think what I was trying to say is that melodic rhythm is very much related to the tempo of the song and the delivery of the singer. And when tempo changes, even if the ratio remains the same, it has a different impact on how it feels. And, sometimes, because you might not be writing to a click, different sections of a song might \"feel\" cohesive at different tempos. And when you sum everything up it just doesn't translate well. And I've had the experience of trying to work around it but ended up noticing that it didn't have to do with the melodic rhythm in each section, but how it relates to the whole song. And now I try to be more aware of it because I think it might be something that is not easily noticeable when you are writing. I don't know if that makes sense (I'm not a native english speaker and therefore I struggle a bit sometimes 😆 ).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "851495917428277258",
    "author": "Deleted User",
    "date": "2021-06-07",
    "content": "I deal with (unintentional) inconsistent tempo and some time even time signature/pulse pretty often when working with songwriters and artists. It seems to solve the problem when you tap your feet to the melody. Then you would realize that the tempo has changed. And count 1-2-3-4 or whatever the meter is. So you don’t end up unintentionally having an extra beat because of words and disrupt everything else. A lot of writers ask people for beats first for this reason, but if the melody doesn’t stand on it’s own- relying on the beats will do more harm than good in my opinion. They often end up being mediocre melodies from my experience because there’s already tons of subdivisions and grooves in the beat and the topliner is relying on that to drive the rhythmic feel. But also beats need to come in with pocket so there are space for the vocal melody to fit in. It would be good for writers to start without a beat or instrumentals and it would be good for beatmakers to practice leaving vocal pockets when starting with a beat first",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591591104479252",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Or even the verse melody in “Dua Lipa - New Rules”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591691099570176",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Those melodies can’t stand on their own, but work very well over very busy instrumentals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855591865867829258",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "You can actually write simpler and catchier melodies over really unique/detailed instrumentals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855592297282011197",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "If you write the entire song to nothing but a chord progression, you usually have to simplify the instrumental quite a lot to make room for the melody",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855593236067123231",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "Some songs are beat driven, some are story driven and some are melodically driven. Just gotta identify which type of song it is to make room for the most important part",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855594130318032906",
    "author": "David Fuller",
    "date": "2021-06-18",
    "content": "No, but it should hold together if it's a song that focuses on melody",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "855595231041814549",
    "author": "Marshall",
    "date": "2021-06-18",
    "content": "But yeah, a song like “The Weeknd - Save Your Tears” is 100% reliant on the melody",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "859931305164668968",
    "author": "antoniohannamusic",
    "date": "2021-06-30",
    "content": "Or like a, \"songwriters pool\" where you could post something and if someone on the group was like \"I want to jump in on this\" you hook up a cowrite session?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "859937411597336597",
    "author": "antoniohannamusic",
    "date": "2021-06-30",
    "content": "Hey there, thanks for getting back to me so quickly! Yeah I can completely understand how you wouldn't want a channel of thumbs up, fire and goat emoji's that actually don't achieve anything tangible.\n\nI'm actually much more interested in the idea of a collab channel like, \"I have a song with an artist, here it is, get in touch if you want to hook up a writing session\"\n\nOne of the key things @oaklandmatt mentioned on here before is write as many songs as you can with as many people as you can, could be a super cool way to level people up & connect with a goal like \"help me finish this\" or something to that effect... don't know, just a thought 😄",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860161400152653864",
    "author": "antoniohannamusic",
    "date": "2021-07-01",
    "content": "I totally get where you're coming from and obviously it benefits no one if there's 1000 links per day with no follow up.\n\nDon't know if this is a solution but could have set rules around it?\n\n*Limited posts per person (1 x a week?) \n*Must state intention in the post.\n*State genre in the post\n*No spamming, only DM people if you genuienly want to work with them\n*No posting work that isn't yours/ you don't have the right to open up to collab\n*Must delete your post once you find a collaborator - keep the forum clean \n\nSelfishly I want something like this so I could be like: \n\n\"Hey, got a new song I'm co-writing (Think Lauv meets PATD)  hung up on lyrics/melody/stuck on bridge (etc etc), DM to work on it (soundcloud link).\"\n\nInterested to hear your thoughts on how something like this could be implemented!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860497192111702036",
    "author": "Moodydodi",
    "date": "2021-07-02",
    "content": "How to write a hook ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "867324410527875102",
    "author": "Marshall",
    "date": "2021-07-21",
    "content": "The writers who coincidentally improvise melodies and lyrics that are “in” at the moment ALWAYS fall off once the era they thrive in dies down (which is usually 2-3 years). Those who are calculated know how to evolve.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "874367727295418440",
    "author": "peterlabberton",
    "date": "2021-08-09",
    "content": "Alright, I’ve got a semi-songwriting, semi-biz question:\n\nI have never written a song entirely from scratch in my life; musically I’m a drummer first and foremost but play most things guitar-related and can plunk something out on keyboards as well with a lil editing. 🙂 I can’t say I have a great ear for melody, but building a rhythm section and producing a track I feel very confident in.\n\nI frankly don’t have an interest in writing songs per se, BUT a friend of mine who does a fair amount of songwriting sessions says he tries to do one a week, partly just to get in the room with new people and start the ball rolling on potential tracks to produce.\n\nWould it be crazy to try and do a few songwriting sessions, which I understand basically have no pay up front, with the hopes to then have the artist back and finish producing/mixing the track if it goes well? Is this a version of how that works?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "876219864585490433",
    "author": "Yago Ibars",
    "date": "2021-08-14",
    "content": "In my experience the sweet spot is somewhere in between both, as you guys have said. Melodically I tend to be like @Rob Domos and make everything as simple and predictable as possible, but sometimes it feels too easy and there is nothing that stands out. Lately my approach has been to use lyrics and chords to spice things up. For example, If I've got an idea for a lyric that I like, most times the metrics of it won't be incredibly predictable, and when I come up with a melody for it will be a bit more interesting than if I started out with the melody. Maybe then, for another section of the song I'll start with the melody and it'll be simpler. I think contrast is key. It really is an interesting topic!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880165583495262220",
    "author": "Josh",
    "date": "2021-08-25",
    "content": "I need to hop on this soooo bad. Feel like I always have great melody ideas and then just never toss em into voice notes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "880509757297930240",
    "author": "Alessandra Morris",
    "date": "2021-08-26",
    "content": "This is so true! This made think about when you are a kid and create songs out of nowhere. Maybe this happened to you guys too, before I learned any instrument I used to do that for fun. \nI think humans are naturally musical, for example accents or using different lenguages, there is melody in there, even the tone of the voice changes. When I write in spanish is a different vibe than when I write in english.     Its crazy how we forget to keep it simple as we grow 😂. Im gonna try to start to write  with acapella more often.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990458763788038184",
    "author": "ehutton21",
    "date": "2022-06-25",
    "content": "So I’ve got a songwriting question, and I’ll tag @Slow Hand cause I’ve got a feeling with his teaching experience, maybe he knows (big love if you do have advice here man!) but I’ll see if I get any others with good advice here. \n\nDoes anyone have good resources or exercises to help educate a new artist on how to write a vocal melody? I can explain the specific details if necessary but I’ve found myself a little stumped to develop this technique in one of my newer artists. She’s an incredible lyricist with a great instinct and vision, and having her in sessions has really sparked the song creation process, but she’s really struggling to learn the “theory”/musical side of vocal melody and I feel like my attempts to coach by example aren’t strengthening her knowledge or confidence.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990459602443309067",
    "author": "ehutton21",
    "date": "2022-06-25",
    "content": "I find myself a little stymied because I grew up in a musical household, and man I just kinda started sing off of imitation, but that natural “monkey see, monkey do” tactic doesn’t seem to be in her wheelhouse and her confidence takes a hit where if she’s had a rough day, convincing her to hum a just a little melody becomes intimidating. Looking to find insight and new perspectives here hopefully!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990551214108323900",
    "author": "ALXCPH",
    "date": "2022-06-26",
    "content": "This! 👆 learn a bunch of vocal melodies and apply what you’ve learned by making your own. Repeat 😇 \n\n\nSame process for pretty much anything, study, practice, apply, repeat.   😎✌️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990776830195826698",
    "author": "Slow Hand",
    "date": "2022-06-26",
    "content": "First off, I’ll second @oaklandmatt’s recommendation that she start exposing herself to a lot of different songs, learning them, and working her writing muscles. A lot of this melodic intuition will come with time, familiarity and having a feel for what’s possible.\n\nHow is her ear? I’ve worked with plenty of great singers with little-to-no comprehension for theory. While it can help, I find that for some personality types being too technical and trying to get them to learn theory is a turnoff and is never going to happen. Where does she fit on this spectrum?\n\nDo your best to assure her that she can open up and not be perfect right away. It sounds like she might be clamming up a little bit because she feels uncertain or unconfident. I always try to give my singers a place where they will feel comfortable throwing out any idea. Even horrible ones. It’s okay to fail or fall on your face.  Maybe she needs some reassurance in order to open up. Let her know that she doesn’t have to be perfect. Many singers do better when they have a safe space to open up and attempt new things. Even Prince would tell his engineer to leave the room every time when it became time to track his vocals. Hendrix would hide himself behind a wall of gobos where nobody could see him.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "991103829347156049",
    "author": "Deleted User",
    "date": "2022-06-27",
    "content": "honestly, there is nothing wrong with writing a melody for an artist who has more strength in lyrics. of course- all the comments here are great for learning, but it takes time to build skills and if you gotta put something out soon, you may need to write melodies for her while sitting together in a session or bring a songwriter that can help with melody writing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1005945644801851472",
    "author": "Will Melones",
    "date": "2022-08-07",
    "content": "I think it matters very little how classic they are. To me it’s those songs that you hear and something novel jumps out to you, like *whoa, what was that chord relationship, and why does it sound so soulful*, or *I keep noticing this similar melodic contour in songs that I like*. I enjoy picking through songs I liked in high school or childhood and trying to find the things that make them feel nostalgic. Or new songs that have a bit of a ‘classic’ quality that sets them apart.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014972922080809055",
    "author": "Slow Hand",
    "date": "2022-09-01",
    "content": "It's full of great instrumental hooks too to support the main melody. It doesn't let go.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1019111458749042700",
    "author": "TheBlur",
    "date": "2022-09-12",
    "content": "Another thing I’m sure a lot of us do; play the vocal melody on piano. See how it sounds. It’s easier to see flaws in a cadence or melody this way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035089311764328491",
    "author": "Ross Fortune",
    "date": "2022-10-27",
    "content": "Love a bridge. Can be an opportunity to get a counter argument (thematically, logically, melodically, harmonically, rhythmically…) to the entire song into a few bars. Almost a mini song within a song, that still has to build and lead satisfyingly back around to the chorus that birthed it.\n\nTop 2 bridges in my head at this particular moment: Adele - Someone Like You, Jason Derulo - Want To Want Me (been a fan of Ian Kirkpatrick for years)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069773268275441664",
    "author": "Deleted User",
    "date": "2023-01-30",
    "content": "I meant lyrics, I’m not doing much on melody because that doesn’t necessarily feel as much of a separate craft. \n\nBut in terms of all music creation, I try to put hours in as much as I can but doing it alone is taking a toll on me. I’m an introvert, I love being alone but not having any interaction with another person for a long time is really difficult for me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075377168374308945",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "Has anyone heard of people recording songwriting ideas of just flow/cadence and a melody but no real lyrics?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075377286045503569",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "I can create a nice little beat and flow over it with a nice melody but I can't for the life of me write the lyrics that would then change the gibberish i just sung out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075378729410367498",
    "author": "cy (sigh)",
    "date": "2023-02-15",
    "content": "thats pretty common method for scratch idea /sketches. \n\ndeveloping it from there (ime), is about  finding the right words for the concept of the song (assuming you have one)\n\nI know some top liners (folk who write main melodies in songs) that will sendnit to /work with  someone who may be better at writing actual lyrics (could be the artist themselves at times). \n\nim sure more people can pitch in w more examples or use ideas.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075379728493576272",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "but when i get a melody down and the flow/\"cadence\" i think people call it to a beat ive made i feel like they're hits hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075380255981842463",
    "author": "OJ",
    "date": "2023-02-15",
    "content": "this was years ago and i never really tried to go that avenue but im just thinking about it now as i made a beat, starting making pure gibberish over the top in melody/flow but couldnt write the lyrics, it made me think if i could just do that alone and that would work",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075386842586828800",
    "author": "rae",
    "date": "2023-02-15",
    "content": "@OJ I agree with everyone else in that collaboration could be an awesome avenue! I tend to write songs lyrics first, then everything else and have only once or twice come up with chords/gibberish in place of words first and then worked out the lyrics later - when I was stuck i found walking around my house  for an hour just singing random lines to that pre existing melody I created and recording everything on voice memos to go through later helped a lot!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075393464751116443",
    "author": "Ross Fortune",
    "date": "2023-02-15",
    "content": "Get in there! 5+ people sounds like a lot though, maybe a little more intimidating with that many cooks, and I think hard to feel intimate with. My ideal sessions are 3 people (computer person, one proper musician on guitar or keys, topliner) +1 if it’s for an artist separate to that team",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075458072006369341",
    "author": "BatMeckley",
    "date": "2023-02-15",
    "content": "This is very much a thing.\nDo you think “I want it that way” makes any actual sense?\n\nA significant chunk of chart topping pop music of the last 20 years is written by someone who English is not their first language. They’ll rough out the right sounds and syllables and hope that a topliner down the line will meld that into something that makes sense. Sometimes that doesn’t happen and the nonsense lyrics inadvertently stay in the song and some random artist sues them claiming that their stream of conscious nonsense was actually stolen from the carefully crafted lyrics of their garage band that no one’s ever heard of (true story). \n\nAlso, you can be eccentric in a songwriting session… (I’m wondering if that 19yo quiet genius was a Canadian phenom cause I’ve had that EXACT same experience) but don’t be a dick in a session. Those guys never last.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076505462515712063",
    "author": "OJ",
    "date": "2023-02-18",
    "content": "think as someone said (or maybe yourself haha) the other day just write and record when ur making the beat, as right now i sometimes make a beat and just sing gibberish ontop but love the flow/melody of the gibberish but going to work on putting lyrics down at the same time to get those reps in🙏",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077963423519887511",
    "author": "Deleted User",
    "date": "2023-02-22",
    "content": "Real talk.. everything else including orchestration probably came in relatively easy after he found that melody compared to coming up with that melody.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077964451547983973",
    "author": "Deleted User",
    "date": "2023-02-22",
    "content": "From my experience of scoring stuff, it’s really difficult to come up with melodic theme that communicates by itself.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121197223905067128",
    "author": "Ross Fortune",
    "date": "2023-06-21",
    "content": "That is to say, sitting with Discord avoiding coming up with hooks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121197513416908881",
    "author": "austenballard",
    "date": "2023-06-21",
    "content": "on Discord because I'm freaking out about not having any good hooks haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135792226333630626",
    "author": "Deleted User",
    "date": "2023-07-31",
    "content": "https://www.instagram.com/reel/CvYEE3KLalV/?igshid=MzRlODBiNWFlZA==\n\nI love this point- “If I can’t play a melody with two fingers, I’m doing too much” (in context of simplicity)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153374958643326996",
    "author": "Josh",
    "date": "2023-09-18",
    "content": "I also think I’m on this kick because my music taste was trap all day every day straight into Noah Kahan type shit. So I’m trying to be as much of a nerd about lyrics and melodies as I was about 808 and kick patterns 8 months ago",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153385754463064124",
    "author": "cy (sigh)",
    "date": "2023-09-18",
    "content": "recent switch for me but I used  to just have dozens (sometimes hundreds) of things just sitting.  now i work on building kits and presets and in the process end up making stuff with them or at least getting one or two melodies out of it. \n\nmy main issue is that I get to a point where I start getting different ideas that I wouldn't want together in the same song /beat /inst \n\nwhen I get to that point I'll try a bunch of those ideas and keep the ones I like. after anything sits on my drive for too long without me changing it I open sessions up and export them as multi tracks, Stems or a 2 track (any combination I like really) and keep  them in specific folders. \n\nI'll flip through some of those in sessions (on top of anything I mightve made for the specific session). after a while of those being there. I move them toa diff folder which is linked to to my cloud service and let's anyone I share the link with download (w general guidekines for use) that way friends and ppl I work with can use them in their sessions or for fun. \n\nstart a new batch of stuff and repeat this process. some things I'm more attached to (for one reason or another) I might keep  longer to try to work on or pitch but that's it. \n\nup until maybe 5 months ago my process stopped after exportingthe tracks /Stems and using them in sessions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153457186228416553",
    "author": "oaklandmatt",
    "date": "2023-09-18",
    "content": "Like, I have to get detailed and make sure the snare drum cracks with the right high mid attack against the vocals, but I also have to listen to the song and just be like \"do I like this?\"\n\nOn the flip side, I have to create emotionally. Making beats and writing lyrics and melodies quickly and instinctually, then go back a week later and listen to all my ideas on headphones away from the studio. That's how I know which of them are still good.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178402026200248442",
    "author": "Rob Domos",
    "date": "2023-11-26",
    "content": "It’s hard to say what is a step backwards vs forwards overall when speaking of all popular music. Often you have to sacrifice one virtue to gain another, but there are certainly valuable aspects of music that have been lost over time with popular music. Our melodies and harmonies no longer have long arcs where different points in the journey express different points on an emotional rollercoaster, which was a staple aspect of most classics from 80 years ago. Hell even 30 years ago Disney songs had beautiful arcs. Sing “part of your world” from the little mermaid to yourself and feel the rollercoaster of the arc in that hook. It’s magical. I think that’s a lot of what makes a song like Bohemian Rhapsody so impactful and we have close to none of it these days.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183696227947262013",
    "author": "ehutton21",
    "date": "2023-12-11",
    "content": "I keep a few midi prints for drum patterns that are common or familiar that I like using etc when I’ve got a melodic situation scored up. It’s nice because if I’m ever not driving but I have an idea I want used I can usually airdrop or email it quickly and boom.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186032423184642138",
    "author": "samvalentine",
    "date": "2023-12-17",
    "content": "Interesting. We’re basically taking the refrain of a Beatles song and repeating it over and over… almost like a mantra. Can’t imagine that’s a cover exactly. It’s the same melody but I think because the structure is so different it’s more of an interpolation. Is there an easy way to get permission or do I have to call Paul?\nAlso would be down to just submit it as a cover and relinquish publishing, but if it’s truly not a cover I could see that resulting in a headache… or is cover just a safer bet overall?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200575979916099655",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-01-26",
    "content": "When preparing songs/hooks for an artist in a session, what influences your decision making in the genre/sounds you‘re using for those? Is it literally anything you have written maybe the past days before or do you try to „guess“ what the artist might be looking for in a song/production or sound?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220657576333545534",
    "author": "Marshall",
    "date": "2024-03-22",
    "content": "Do any of you guys fall into the trap of writing the same type of song over and over again? lol. I feel like when I’m improvising over a beat or something I tend to make similar subconscious choices in the melodic structure/melodic rhythms/etc. the only way I can get out of it is by setting parameters before hand (ex: don’t start the melody on the 1…..use an AAAB structure……..make the A sections complex and have their own micro-structures/use many types of rhythms,  use like 3-4 notes in the scale maximum and mostly dwell on a single pitch/don’t hit the “money notes” lol…..Make the B section almost completely one  consistent rhythm, use way more notes in the scale than the “A” and hit all the notes you didn’t hit in the “A” to resolve the melody)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221435603791646822",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-24",
    "content": "I was privileged enough to be a teenager during the 2010 club banger era. Back then I hated it but looking back it‘s fascinating that at every club I went to people who might not have been musically inclined at all could sing along every word of the songs of that era, think Hangover, DJ got us falling in love, all the avicii stuff even levels which is mostly instrumental. There seemed to have been something magical about those lyrics and that particular kind of songwriting that really resonated with people and created an unbeblievable sense of unity. If you‘ve ever been in a club with hundreds of people singing along to Hangover on the top of their lungs you know what I mean. Raw power. It‘s easy to dismiss those songs as stupid but there seems to be something primal about them that really connects with people",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221480854128431218",
    "author": "Herb🇮🇪",
    "date": "2024-03-24",
    "content": "James Blake and Bon Iver, my ears naturally tune to their lyrics and singing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222122011132694538",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "The melody also is very well structured. Maybe they did it subconsciously…..but idk. Seems pretty intentional to me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222123583334121586",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "I have a hard time believing every detail of that melody was perfect without any thought behind it…..There is the joke that Some singers have “built in autotune” and can sing amazingly without editing and on the flip side I think some songwriters have “built in  melodic math” and don’t need to know any theory and can just improvise sick songs, which is definitely a real thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222125436583149649",
    "author": "Marshall",
    "date": "2024-03-26",
    "content": "I feel like the people who go into writing a song with the heart first are extremely valuable too. It’s like ying and yang. If you are improvising a chorus with a great song concept over a great beat, the melody falls into place……but if it doesn’t, why not use some theory/etc to understand why the topline isn’t just falling into place naturally? Could be a quick fix like switching up the rhythmic phrasing or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232647019361730621",
    "author": "Marshall",
    "date": "2024-04-24",
    "content": "Insane lyric writing mixed with great harmony between the melodies and the instrumental",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232647477211955211",
    "author": "Marshall",
    "date": "2024-04-24",
    "content": "Idk why but once the “Your wife waters flowerrrrs” hits in the chorus and resolves the tension between the melodies and chords it just gives me chills every time lmao",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232647888165929031",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-04-24",
    "content": "I just cant find one single memorable melody on that song or the album in general\nIt sounds like she stream of conciousnesses over jack antonoff stock beats",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261769772903956550",
    "author": "jonmatteson",
    "date": "2024-07-13",
    "content": "I’ve been listening to that podcast “the history of rock and roll in 500 songs” that you posted a few weeks back and it was so interesting to hear that in the 40’s and 50’s it was completely normal to record the same song over and over again. Some bands only used one chord progression and would occasionally change the words or melody and they would consistently get #1’s off the same formula. Many bands would also cover other people’s songs and they would be hits as well.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276580870148329473",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-08-23",
    "content": "What’s your method right now?\n\nMy overused patterns are mainly in the fingers and in my sung, improvised melodies, love breaking out different ways so that only my ears are engaged \n\nStarting out taking some elements from a reference’s also leads new places",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291874449322151958",
    "author": "oaklandmatt",
    "date": "2024-10-04",
    "content": "This is a strange clip and I have a very different read than you.\n\nSome thoughts:\n\nThe clip is heavily edited. Chilly doesn't mention lyrics (\"he's just looking for a melody\"). Chilly is not a lyricist himself. The two songs he mentions are incredibly specific – not universal – storytelling songs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291876851714883685",
    "author": "oaklandmatt",
    "date": "2024-10-04",
    "content": "I think Chilly must have been speaking about melodies, because the two songs he mentioned are pretty much the opposite of universal lyrics.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328028492562038938",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-01-12",
    "content": "Great stuff above, my experience is a bit different, as I’m sure everyone’s is :)\n\nI find that lyrics is where I get stuck, especially if I’m trying to write to a set melody. The biggest unlock for me was to write an entire song’s lyrics first, sometimes preceded with some journaling and/or research on the topic so I have real, meaningful things to draw from. I keep track of syllables etc so it lines up.\n\nOnce the lyrics are done and I’m working on the song, I always end up having to change a lot, usually simplify and take out, but it’s an easy problem when you have excess good lyrical content. As opposed to trying to summon something meaningful to fit a certain melody.\n\nSimple stuff like starting with getting the chorus right has also been super helpful, and keeping production to a minimum before the topline is finished.\n\nExcited to read more people’s hacks here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339731298289451149",
    "author": "peterlabberton",
    "date": "2025-02-13",
    "content": "I circled around some of these ideas a few years ago here, but now I’m more seriously thinking/asking for advice…\n\nI’ve never written a song in my life, and don’t have any real desire to do so (more than happy to be mixer/producer/drummer/multi-instrumentalist guy). But, I have a friend who is a super prolific writer. He has his own artist project which I’ve produced/mixed, and a few years ago had a publishing deal and has a good deal of writing credits. We’re a really good yin/yang pair: he’s focused on melody/lyrics/chords, I’m focused on rhythm/sounds/texture/mix. We have a co-credit for a Suki Waterhouse song for the one and only explicitly “writing session” we’ve done together.\n\nI just reconnected with him and mentioned that I’m about to be in a position where I could do more open-ended writing (/spec production?) sessions and would love to work with him again—specifically on some projects that have approached me more in the writing stages, and most especially on reaching for bigger artists. And he’s down!\n\nHere are my questions (and this is a *total* explain it to me like I’m five situation—I’ve really struggled to make sense of things business/session flow-wise outside of getting paid for a discrete deliverable or a day rate):\n\nI don’t feel a need to be too formal about things right now, but is this sort of partnership where we could pursue a joint publishing deal?\n\nMy main motivation is two-fold: keep a foot in production/engineering while I’ve leaned more and more into mixing recently, and use our credits to get in a room with bigger artists. Am I way off here?\n\nAnything I’m missing/obviously oblivious to?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354657767440388278",
    "author": "oaklandmatt",
    "date": "2025-03-26",
    "content": "@peterlabberton  I've not seen a joint publishing deal as you describe it, though I suppose it's possible. Generally it makes sense for everyone to have separate publishing deals as many songs get written with different people and different splits. You could certainly sign to the same publisher at the same time, just with separate deals. Or this person could sign you to their publisher with some finders fee type thing.\n\nWhat it sounds like you're doing is providing a great sounding board and musicianship for someone who is more primarily a songwriter? If so, you would just participate in any songs that are written in the room. If it's the sort of thing where he is really doing the bulk of the songwriting (like all the lyrics and melody, and you're helping with some of the music) you could certainly work out a deal where you get a smaller piece.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356405098821189753",
    "author": "OJ",
    "date": "2025-03-31",
    "content": "I lay down some chords, maybe add a little beat.\n\nGet my vocal chain on. And sing sweet gibberish away for a while. I really enjoy this bit and I'll listen back to the gibberish like this sounds nice.\n\nNow - how on earth do you go creating good lyrics to this melody to make it real?\n\nI realise I'm not really thinking of anything when singing the gibberish, no story line but I tend to automatically say things like \"she\" so almost talking about relationship/love kind of stuff but not necessarily what I want to go for actually.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1356413580974751845",
    "author": "Brian Reynolds",
    "date": "2025-03-31",
    "content": "First most of what I'll have to say for this is built on the foundation of this course by Louis Bell of Post Malone, Halsey, and Justin Bieber #1 fame. In this course he spends hours going over exactly how he writes lyrics to his gibberish melodies. Then how he goes about pitching these ideas to artists. After he has 24k Goldn there for a few hours and they write another song to gibberish melody. And you can see how the process are alike and contrast. https://studio.com/classes/louis-bell/hitmaking-for-producers?utm_medium=paid&utm_source=google&utm_campaign=ws_studio_brand_louis-bell_us_phrase&utm_content=studio&utm_term=louis%20bell%20studio&ref=m&gad_source=1&gclid=CjwKCAjw-qi_BhBxEiwAkxvbkH_XdBqN7jbkwQK-0pisWV_MsC4-VSGH_iGfcL85MML5SoRwB01Q9xoCFl0QAvD_BwE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385323238024024227",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "That is so interesting to head - I’ve never started with drums but can totally see this. I focus on the soundscape of the chords and melody, add a drum skeleton for lyric writing, write lyrics with song sections and overall composition in mind, then go back and change the production and drums to interact with the combination of the composition I envisioned and the cadence of the lyrics and how the drums interact with both at the same time.\n\nHuh - I’d like to be a fly on the wall for the drum first sessions to see how it all unfolds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385638686997086412",
    "author": "Brian Reynolds",
    "date": "2025-06-20",
    "content": "I'm a big proponent of all forms of creative writing helps hone the skill of melodic lyric writing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385650221413040208",
    "author": "youngteam",
    "date": "2025-06-20",
    "content": "I saw a bit yesterday about writing songs on melodies rather than chord progressions giving way better results. Made sense to me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385702873521852517",
    "author": "youngteam",
    "date": "2025-06-20",
    "content": "same idea as what you talked about. gibberish melody is easier to write to than doing both at once  was the sentiment",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471654730995466455",
    "author": "revolution",
    "date": "2026-02-12",
    "content": "im not a professional, pretty new to music in the sense of trying to create a product/song. Ive been an instrumentalist, engineer, writer, etc etc as a hobby or interest from time to time... and i notice that writing is one of the areas that I have the least doubts about myself. i fully believe i can write interesting bars/emotions/etc from time to time... but it's very much an abstract 'writing' skill that could be applied to poetry or essays or anything... rather than a reflection of my actual song writing ability.\n\ni want to learn how to hone my strengths and bridge the gap between having or putting out decent ideas (wether lyrical or melodic) and actually distilling a song structure and 'product' if you will. A good analogy is the gap between someone with good cinematography instincts/eye vs a director/writer/editor level of structure or authorship",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471659916518490165",
    "author": "Zack Hames",
    "date": "2026-02-12",
    "content": "Note on writing every day - focus more on the nuts and bolts of the song, the chords and melodies and structure. The production side and extra layers can come later. If you’re taking more than 5 seconds to pick a snare sound, you’re not focusing on the right thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472293494910484572",
    "author": "Brian Reynolds",
    "date": "2026-02-14",
    "content": "I think if your also trying to up your production game in conjuction with lyrical top line melody. Then a rep should be a whole song. You gotta learn the nuances of subtle or drastic changes from verse 1 to 2. And deploying multiple transition techniques to keep the narrative moving and compelling",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472304065454149654",
    "author": "Will Trotman",
    "date": "2026-02-14",
    "content": "I assume the 30 minute song thing is just to keep the writing flowing daily and force yourself to not be precious and get *something* down? Curious what your perspective is on hitting an idea that does feel precious. \n\nI go in phases of enforcing a daily write like this (and need to do a better job of staying in it). But doing that sort of thing, I often wonder where the line is between \"you should try to beat this line or melody or come up with something you actually like\" vs \"don't be precious at any cost.\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472317650884624475",
    "author": "Zack Hames",
    "date": "2026-02-14",
    "content": "Totally; I saw that OG poster said that as well, but some of their other notes In that post seemed to mention more songwriting aspects like melody and having more than just 1 verse or riff written.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472555769869369490",
    "author": "revolution",
    "date": "2026-02-15",
    "content": "idk what qualifies as a song or not.. but to this end, by chance before i got time to read everyone's response, i happened to turn a small poem and a few lyrics into a valentine voice note for a friend. by nature of simply singing it and imbuing it with melody it sort of became a song. in some sense, its that easy, and i am failing myself by not carving out the time and commitment to that every single day.\n\nperhaps what im asking is really a reflection of a lack of courage and patience/grit. where i'd like technical and direct feedback, i search for 'knowledge' and 'technique' instead of collaborators and mentors. where i am afraid to fail, i avoid the daunting task of putting ink on a blank canvas every day. \n\ni honestly fully agree and expected your answer to be the primary one!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]