[
  {
    "id": "1282793496272699564",
    "author": "cian riordan",
    "date": "2024-09-09",
    "content": "Love this. Often when I'm recording drums I'll track the drummer at a higher BPM then varispeed everything down to tempo... great way to get deep low end.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018624894713462804",
    "author": "peterlabberton",
    "date": "2022-09-11",
    "content": "Also I’ll say something that feels very redundant in this community but is so true: if you have your monitoring sorted out, these sub decisions become way more intuitive and effortless. If you’re just hearing a smeared mess in the low end, it’s understandably a mystery. But if you can get in a room where there is more clarity, it’s a whole lot easier.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300899367481507873",
    "author": "cian riordan",
    "date": "2024-10-29",
    "content": "Aside from the usual discussion about headphone preferences and HRTF, I’ll give you my experience with them.\n\nI bought them a few years ago with the intention of just having a baller set of headphones for a bunch of travel I had coming up. I had tried them once at @oaklandmatt’s place and wasn’t super impressed... just thought they sounded like hyped headphones. But I really wanted something with killer noise cancellation and something to potentially reference Spatial mixes. After purchasing, the more I used them, the more I fell in love with listening to music on them. I realized quite early on that there was a lot of parity between how things sounded in the APMaxes vs. my PMC 6-2s… similar low end presentation, similar high end. But just genuinely enjoyed listening to music on them.\n\nI was traveling for thanksgiving last year and a last minute mix opportunity came up for some video game trailer. Not my normal speed but they were up shits creek with a deadline and the money was good… so I mixed the whole thing start to finish on my laptop with the Airpods. I was a little sheepish about sending off un-vetted mixes, but the clients loved it and I saved the day. I curiously took a listen when I got back to my studio after the holiday and was very surprised that the mix was 98% there. There was maybe a small low end tweak I could’ve made, but by and large, the mixes translated incredibly well. \n\nNow I use them much more for odd tasks, usually revisions and printing sessions. I can be on my couch on my laptop running files down with transparency mode on, still hanging with my family while watching a show, and lock in with noise cancelling when I need to focus.\n\nFor $600 they’ve been a massive value-add to my work flow.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310998613047902288",
    "author": "Rollmottle",
    "date": "2024-11-26",
    "content": "adding stuff is always effective but i like trying to pare back the arrangement to see if i can get away with something. dropping the kick, the bass or snare for a bar, 1/2 a bar, or one beat can sometimes create the transition without adding anything.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998809181303881788",
    "author": "Slow Hand",
    "date": "2022-07-18",
    "content": "So obviously starting with the right bass is going to get you 70% of the way there, but you know what *really* surprised the hell out of me? The *strings*. \n\nIf you're not getting anywhere close to the tone that you want, start exploring the wide world of bass strings. I had overlooked this simple thing for ages. I took my choice of strings for granted because I never had to change them. And when I did it made all of the difference in my tone.\n\nI've always been a Fender guy: P-basses and J-Basses, and the DI signal was always voiced way too dark to pop out of a mix without some heavy lifting. Granted I also use flatwounds (which aren't as zippy as roundwounds). \n\nAfter some research on the TalkBass forum, I ordered a few different sets of flats to experiment. One such set were the *Thomastik-Infeld Jazz Flats*, and ho-lee *shit*. There it was. There was the sound I was looking for.\n\nThey were voiced way lighter in the bass, which gave me a far more articulate midrange. Like the sound of an upright bass which (trust me) is a very good quality to have unless you're going for a grindy metal tone. As it turns out, the midrange is where *all* of the action is in the bass. It's okay if your bass DI is voiced with no low-end, because you can always add that weight back in, but if the midrange is not present to begin with it is an uphill battle to make it articulate in a mix.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103635607747559575",
    "author": "ALXCPH",
    "date": "2023-05-04",
    "content": "I usually restrict myself to only work on stuff that gets sub 1m streams. Its crazy how good i’ve been at hitting that goal!",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331733580111548500",
    "author": "Skyler Young",
    "date": "2025-01-22",
    "content": "Also I’ve been building an 808/synth bass plugin because I think there’s a lot of room for improvement over 808 cooker and sublab",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020845158075465778",
    "author": "ALXCPH",
    "date": "2022-09-17",
    "content": "I've been a \"musician\" since way before i started recording and producing stuff. (Since i was 4 i think). It's such an integral part of how music can feel and make you move. Think about how someone like Anderson paak. can make you dance by just playing 8th notes on a highhat and nothing else(see tinydesk for ref.) or Pino Paladino, will make you break your neck with his bass, playing simple Quater notes. (anything D'angelo).  Even in a genre that is as quantized and on the grid as it gets like a lot of hiphop/trap is, notice how the artist(rappers) that really stand out, are the ones that make those beats really groove/hit because of how they themselves \"groove\" or flow on those beats. They might be slightly behind or in front of the beat, or they might even swing a little. \n\nYou can really get into the micro and macro dynamics of groove. Listen to guys like Led zeppelin, how they might start out a song a few BPM slower than they finish, because of the build up of energy through out the song, and it doesn't sound wrong or unnatural. \n\nA fun thing to do, when looking for inspiration for grooves, is record some foley, and look for naturally occurring rhythms in the sample. Try and build a grove around that probably a bit wonky rhythm. It can really be an eye opening experience once you realise how much fun rhythm and groove is, when you don't have to obey the grid in a daw like a machine. \n\nBut like anything music, it's really about listening and feeling. Really internalising what a forward or laid back snare feels like or a bass thats almost a 16th behind the beat.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086288496093831238",
    "author": "ALXCPH",
    "date": "2023-03-17",
    "content": "Peeps making Reese bases themselves in serum. \n\nWhen you’ve made the sound how you want you’ll often find with stereo Reese bases the fundamental is phasing in and out so your low end isn’t very consistent. \n\nWhat you can do is go into the waveform editor on the oscillators and click “remove fundamental” then enable the separate sub Osc and set it to direct out. That way you get a nice consistent fundamental, but your harmonics are still moving giving you that classic Reese sound but with a much beefier stable low end. \n\nHit my DM if anyone needs me to be more specific 😇",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210334510147964959",
    "author": "Skyler Young",
    "date": "2024-02-22",
    "content": "Speaking as a bass player - most bass players never learn to use their tone knob. Most bass amps roll off top end so having your tone all the way up usually sounds pretty good going through an amp. But when recording DI it took me longer than i’d like to realize it’s super important to find a sweet spot for the tone knob",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334294937176375327",
    "author": "Slow Hand",
    "date": "2025-01-29",
    "content": "Granted, her examples are *very* specific to orchestra and not directly applicable to pop records, but the underlying principles here include:\n\n**1) **Think of instrument combinations as a single composite voice.\n\nOne instrument can function as the \"sustain\" portion of the sound and a second instrument gives the \"attack\". Together they create a single melodic voice.\n\n**2) **How do the instruments stack on each other? Do they clash? Cellos doubling a bass an octave up extend it's timbre into a higher register to make it read better. It's not so different from adding fuzz to an 808 so that it has more presence.\n\n**3) **Which instrument will cut through the music?\n\n---\n\nA few concepts that I'll add:\n\n**4) **Instruments in the foreground vs. the background. Know which part is the lead (focal point) at any given point in the record and then pare down the presence of the rest and push it into the back of the sound stage.\n\n**5)** (Piggybacking off of Felix's excellent post) What is the simplest way to achieve the desired effect? Reduce. Reduce. Reduce.\n\nCut instruments and parts ruthlessly and approach it with a minimalist's eye. Like writing a haiku: How few elements can you use to create an impression? Maybe a guitar part is carrying 90% of the groove and the drums only need to be a kick and a snare. Or maybe the guitar is covering the backbeat too, and you don't even need a snare!\n\nConstantly ask yourself \"What is the most important sensation in the record?\" and then focus it by cutting out everything that gets in the way.\n\n**6)** Hocketing. Pass the melody off between different instruments at different points in the song. Play it in different registers. Combine voices occasionally for special effect.\n\n**7)** Tonal contrast. Dark instruments plus bright instruments. Distorted and clean together. Near vs. distant.\n\nElements that sound same-y will gel together and elements that contrast tonally will pop.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410709910970302494",
    "author": "cian riordan",
    "date": "2025-08-28",
    "content": "Everyone here’s take on saxophone is like if people could  only associate bass guitar with the Seinfeld sound.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453641534661722134",
    "author": "oaklandmatt",
    "date": "2025-12-24",
    "content": "My experience is that the melody often dictates the vibe. Based on your description, it sounds like you may creating too much production first, before trying to make a hook. \n\nCertainly you can make a full track and then write on top of it, but in my experience a great song or hook comes earlier in the process, either before or along with a production vibe. \n\nI would say this is true for 90% of the music I make, and is the case with both of the successful future bass songs I've been a part of.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954057628785471588",
    "author": "jonmatteson",
    "date": "2022-03-17",
    "content": "Listen to D’angelo’s voodoo and listen to the placement of the notes in each instrument. Questlove tends to lay the hat behind and push the snare which makes a sort of flaming vibe which is very pleasing. Also pino’s bass is behind his kick and the guitar behind pino etc. all about push and pull of the elements!",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998810265200119818",
    "author": "Slow Hand",
    "date": "2022-07-18",
    "content": "In summary, I think a common mistake that a lot of people make with bass is thinking that good bass tone comes from the low end, when it - in fact - is going to come from having well-balanced midrange. Often this means having less low-end than you think. That's where the money is at.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066841550031691817",
    "author": "Ross Fortune",
    "date": "2023-01-22",
    "content": "Also beware of obsessing over the phattest kick drum sound on the planet and patting yourself on the back when you finally nail it, only to discover 10 hours later when the chorus just isn’t taking off that your overweight kick is what’s been slowing down the groove and/or muddying the how the bass interacts with the drums",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075849563459555368",
    "author": "NoahNeedleman",
    "date": "2023-02-16",
    "content": "@mcneazy for pristine pop, edit the fuck outta them drums, get them gridded and feeling great. 9 times outta ten gridding them will actually improve the feel, and in the spots where it doesn’t you can always comp back in. \nThen edit bass to the kick & snare, when it’s right the bottom will tell you. \nThen call Beckley to edit your vocals.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134932834100973638",
    "author": "Nomograph Mastering",
    "date": "2023-07-29",
    "content": "So many amazing songs can be described almost completely with just the vocal and bass parts",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284218772487671991",
    "author": "LAPhill",
    "date": "2024-09-13",
    "content": "Not a dumb question. The distortion on power chords creates an octave below the fundamental pitch, which helps make them feel well, powerful. For intervals other than a 5th, it's not an octave below but some other pitch, and so yeah, you're likely creating unpleasant harmonics outside of the key.\n\nThe dumbest, but easiest way to avoid that is to let the bass be the inversion's lowest note while the plays a 5th from the root note. Otherwise, you're looking at dialing back the distortion on those inversions, or on the tone as a whole, which isn't necessarily what's desired.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444027866323878028",
    "author": "oaklandmatt",
    "date": "2025-11-28",
    "content": "The method that sounds most transparent is hand editing (no digital stretching at all). You need to line up your edits so the wave form is perfect in the middle of each note, then use an equal gain cross fade at the edit point. This gives you the most transparency because there is no algorithmic stretching happening. \n\nIt limits very slightly your options with timing because bass wave forms are long, so lining them up perfectly means you can only move the timing the length of each waveform. It's also time consuming compared to stretching.\n\nIf you are editing a DI that is then going through significant processing (amp sims and shit), you can sometimes get away with one of the stretching algorithms. Elastic audio is ok and usable sometimes, but I prefer Ableton's complex mode over everything else I've heard.\n\nI try to avoid time stretching artifacts on lead vocals and bass instruments more than anything else (unless it's creatively interesting of course).",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954060046235488256",
    "author": "oaklandmatt",
    "date": "2022-03-17",
    "content": "@Zack Hames yeahhhh. watch the questlove video on youtube where he talks about d'angelo asking him to play crazy laid back and flammy too.\n\nmy general thought on timing is: behind the beat is more groovy and laid back (vocals, percussion, bass against the kick drum, etc) and ahead is intense and anxious (especially vocals).\n\nthere are many examples of groove being behind the beat as that's something people talk about a lot. definitely dive into that concept and play with laying different elements back off the grid.\n\nbut i LOVE talking about being ahead of the beat. purists complain that a lot of modern hip hop vocals are ahead of the beat and \"off time.\" but when it's done well it makes the tracks SO exciting. lil durk, 21 savage, gucci, etc all have this excitement in some of the songs because the vocal are ahead. \n\ni've heard the argument that these guys are just amateurish in their skill. that might be true, but their natural groove and cadence works. also listen to kendrick on \"Family Ties\" where he goes in and out of being ahead of the beat and it sounds exciting as fuck when he does.\n\nalso \"Icky Thump\" by White Stripes is a song with vocals that are entirely ahead of the beat. clearly it's deliberate as jack white is a rhythmic genius (and the doubles are perfect). it adds this anxiety to the whole song that is SO dope.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062238290260013118",
    "author": "peterlabberton",
    "date": "2023-01-09",
    "content": "A little palm muted thumb bass playing goes a long way in my book 🙂",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134932731302777042",
    "author": "Nomograph Mastering",
    "date": "2023-07-29",
    "content": "One of the most unsung parts of music in the modern discourse, how the vocal and bass Melodies work together",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134940149403369544",
    "author": "LAPhill",
    "date": "2023-07-29",
    "content": "Not always that relevant in modern music, but our brains mostly hear the relationship between melody and bassline, with inner voices a distant second. So thoughtful voice leading and intervalic relationships between the bass and melody can negate the need for much other harmonic information.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210334836003184691",
    "author": "Skyler Young",
    "date": "2024-02-22",
    "content": "I was recording on an album and I heard a few tracks that a different bass player played on at the beginning of the session and the tone on his bass part was amazing so I asked the producer how he treated the bass to get that sound and he said he did nothing, it going through the same chain I was. And I was horrified cause my bass was sounding nowhere near as good and I knew the other player had the same type of bass. The only thing that could effect the sound was the tone knob and as soon as I moved it to around halfway it perfectly fit in the mix and sounded as good as the other bass player - has been the biggest key to getting a good sound in the studio",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444073245400760372",
    "author": "oaklandmatt",
    "date": "2025-11-28",
    "content": "Good question! \n\nAs @cian riordan said, when you're perfectly lining up the waveform of any solid tone, you want equal gain so it doesn't give you a boost on the crossfade. This is for \"correlated\" signals where the waveform is lining up exactly. A bass guitar, the middle of a vocal note, a synth with a consistent waveform, etc.\n\nWhen you're doing a crossfade on noise (breaths, sss's, ambience between drum hits, etc), you want equal power because these \"uncorrelated\" signals need a bit of boost around the crossfade for the perceived loudness to be the same.\n\nYou can check this by using a synth note or long vocal note, doing an edit to make it longer or shorter, lining up the waveforms perfectly, and doing a cross fade. You will find that equal power causes a volume bump. Equal gain will be smooth.\n\nDo the same thing with white noise and this time equal power will be smooth, while equal gain will cause a volume dip.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998799639853674516",
    "author": "1ggy",
    "date": "2022-07-18",
    "content": "Bro. 90% of the time I record bass it goes like this. 1. Record bass 2. Spend 3 hours trying to find the tone 3. Give up, convert  it to midi and slap Rickenbacker on it.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018563046676889710",
    "author": "peterlabberton",
    "date": "2022-09-11",
    "content": "Under 40 hz? If we’re taking *that* low, in my experience usually kicks benefit from sitting just slightly above that range, especially in rock—somewhere around 50-60hz. Usually they sound punchier and less flabby with just a touch of the super low lows rolled off. Basses can move around a bit more, obviously, but I also find that usually even if you have a fundamental around or below 40 hz, the first harmonic an octave above is usually what you’re actually interested in. Also it’s very song/arrangement/tempo (!) dependent! A slower tempo or less busy kick pattern or song arrangement will let you get away with loads more super sub stuff. Faster patterns will just sound like flabby mush with tons of sub.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095068782441021480",
    "author": "Zack Hames",
    "date": "2023-04-10",
    "content": "Duplicate OH’s, filter to the low end, blend to taste. Cut anywhere there aren’t Tom’s. Play with phase/timing. Do the thing. Seems like you’re really close",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134930893794971819",
    "author": "tomtom",
    "date": "2023-07-29",
    "content": "I had an interesting experience yesterday w a client.. both of us were scratching our head about whether or not we liked a vocal, then we switched bass takes to the scratch and all of a sudden we loved the vocal. The strange thing is that he sang to the new bass, not the scratch. Same player and gear on both. Music is cool. Don’t sleep on your bass parts.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088153824235094087",
    "author": "popaganda.",
    "date": "2023-03-22",
    "content": "Get your hands on a grandma. Sounds really great and there’s something to be said for a simple no-preset synth that forces you to make a sound. You can whip up nice bass and lead sounds really quick on a grandmother",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336392551892127825",
    "author": "NoahNeedleman",
    "date": "2025-02-04",
    "content": "I’ve been thinking about @Joel \"Roomie\" Berghult‘s question re: mixing as you since he asked it. I think what Rauirí says about not knowing what we’re doing while we’re doing it is really true, so I’ve just been trying to dissect my process in my brain, away from the computer.  I think it comes down to 2 things for me. \n\nHere are my thoughts:\n\n\n1) Choosing Sounds. \n\nIn addition to vibe & genre & emotional intent, each instrument or sample that you pick covers a certain area of the overall picture. Knowing where that part is going to go in the overall arrangement changes how much hi end or low end or wetness (etc.) you want. It also steers performances. \n\n2) Actually Mixing As You Go \n\nOnce a part is recorded, do a quick adjustment so that you hear closer to a finished product. This helps you make better choices about what else needs to be added, (or not added,) and will likely inspire the next step.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062049148234383611",
    "author": "Deleted User",
    "date": "2023-01-09",
    "content": "programmed drums > sloppy playing with sub par miking",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171125153334308954",
    "author": "BatMeckley",
    "date": "2023-11-06",
    "content": "I actually listen to a lot of music from the 40s because the whole one mic, one take thing is a great lesson in dynamics and mix arrangement. You need the bass a little quieter? Tell that dude to BACK UP.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241850865413787710",
    "author": "Nomograph Mastering",
    "date": "2024-05-19",
    "content": "Scene - Cormac McCarthy style desolation, two people walking with headphones on\n\n“Yeah, I used to love Joe’s mixes but then I found out he ate meat and we all know how those animals were treated, and of course he drove a gas car and took flights and we all know how that ended up. I just liked his low end more before I discovered he was on the wrong side of history”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350358028695769089",
    "author": "spectrummasters",
    "date": "2025-03-14",
    "content": "Foundationally , to my ear it’s pure 80s electro / hip hop .speed up planet rock with the Kraftwerk sample removed and you’re there . \n\nIf you listen to 2 live crew throw the d you’ll hear how electro moves into Miami bass and then it’s influences imho can be heard more recently by way of the trigger man break from show boys drag rap which became a major break for New Orleans bounce . Drake gave his nod to New Orleans bounce music having queen freedie in the nice for what video . \nSooo, for me it’s electro . Just with todays production aesthetics",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386528954592002068",
    "author": "cian riordan",
    "date": "2025-06-22",
    "content": "It’s usually mono distortion… just a mono send with a sans amp spicing it up a bit. Just enough grit to differentiate the signal, still give that perception of width with that panning, but sortof forcing a different phase perspective on it. It’s usually with things that have low end and low mid information. You exaggerate the high end stuff on the side pan and then anchor the low/low mids in the center.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404622497256706119",
    "author": "Slow Hand",
    "date": "2025-08-11",
    "content": "If you know your way around a synthesizer, Massive X and Serum 2 are both heavy hitters that cover all of my bases. \n\nSonically, Massive X has a \"warmer\" voicing and has all of NI's amazing effect algorithms built into it. Everything sounds incredible and is dripping with character. It's absurdly capable, but the interface may be overwhelming at first. It can be a lot to get oriented on. It's impossible for this thing to sound \"cold\". The preset library is less bass music/EDM and more balanced. NI offers a lot of genre-themed expansions. If you like programming sequenced/heavily automated one-button patches Massive X is king.\n\nSerum is on the \"cold\" side, but just as capable of \"warmer\" sounds. The sonics and DSP are clear as a bell. Stellar. It's more intuitive to program and the feature set is an embarrassment of riches. It's absurd how much functionality Steve and team crammed into it. Absolutely absurd. If you want to do EDM and bass music, it's the king and it's preset library leans towards that. I still cannot believe that they *gave* it away to Serum 1 users.\n\nBoth excel at cinematic and over the top. If you're looking for the \"classic\" sound, I'd lean Massive X.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407740479457722449",
    "author": "Zakhiggins",
    "date": "2025-08-20",
    "content": "Im pretty much always messing with the length of kick, snare and hat trying to get them to fit in the grove better, you can make some unlikely pairs work when you do this.\n\nAlso always messing with the order in which transients are hitting on downbeats, nudging certain drums slightly before or after others can make things mesh together real nice. Typically the higher pitched/attacky things like hi hats come earlier than the sub kicks for example but experiment with it and see what sounds good. A song where this is really obvious is say it right by nelly furtado, listen to the way the layers are stacked on the downbeats of the chorus. Side note, when you're doing this, think of everything with a transient on that downbeat as a percussion instrument.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470790765000003626",
    "author": "Matt Huber",
    "date": "2026-02-10",
    "content": "This may not be the case for this particular vocal, but I have found that doing a high pass filter before Melodyne can help detection be cleaner if there happens to be unnecessary excessive low end content / bleed in the vocal mic.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "938551915405533255",
    "author": "cian riordan",
    "date": "2022-02-02",
    "content": "Like Zak said, lotsa compression to exaggerate the nuance... with some aggressive filtering off of the low end. And if there's space, a tight 1/16th note slap tucked in can go a long way.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "967406678242914314",
    "author": "sukhuno",
    "date": "2022-04-23",
    "content": "Depends obviously on the type of production but sometimes removing from the verse makes a more significant impact than adding something new in the chorus (ie only bass & drums in verse, bring in instruments on chorus)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984309418982252604",
    "author": "Deleted User",
    "date": "2022-06-08",
    "content": "usually saw/buzz basses can’t have much perceived subs without filtering because of the amount of upper harmonics. with shorter saw bass- I usually tend to favor the upper area for punch and get the low subs from kick and if I need lengths in the lows I double it with a sub or electric bass and not use the sub from the saw bass. on saw bass with longer sustain- I like to do band pass filtering (take out subs and filter out the sizzlely highs) and use a separate sub bass in the middle and use saw bass that spreads out on the sides. \n\nI wouldn’t do significant boost lows on saw bass, I find it just messes with the character of the sound too much",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "992854328408813639",
    "author": "NoahNeedleman",
    "date": "2022-07-02",
    "content": "Yes! Honestly when you stack the fuck outta airy vocals you can make them a LOT darker than you would a single vocal. All the air sums pretty violently. Also eq individual tracks AND busses. Once you get an idea of how her particular voice stacks, you can eq on the way in and save some time. \n3rdly, getting the performance as close to perfect as you can instead of tuning or auto-aligning will do a lot for the stereo field and vitality of the overall sound. \n\nIf you’re just talking about the lead vocal, Multiband or Dyanmic Eq is your friend, but absolutely CRUSH that LV with something that has inherent low end saturation like Devil Loc (at like a 2) or a UAD 175-B. That’ll help balance the overall eq of the vocal better than just an additive eq/saturation. \n\nI know that’s a lot but hopefully that’s helpful!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "995954671984324609",
    "author": "Josh",
    "date": "2022-07-11",
    "content": "If you have the slate sub all of their packs are wild",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998795813306236938",
    "author": "cian riordan",
    "date": "2022-07-18",
    "content": "Anyway you shake it, live bass is warfare. So much is specific to the part, the kind of playing, the recording quality, DI vs no DI, phasing of multiple sources, etc. Once you crack the code on that, I usually find a good amount of compression to control the lumpiness and some form of parallel distortion (Sans-Amp is my go to) with whatever EQ needed to keep that motherfucker inline.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998797902489071666",
    "author": "NoahNeedleman",
    "date": "2022-07-18",
    "content": "Honestly I almost always start a live bass with UAD’s Ampeg B15. It’s ballsy as hell and there’s a lot of options for cabs, presets are all super useful. Once I’m there I hit a decap or other saturation plug with a mix knob and dial in the upper mids to “growl” a la @Slow Hand’s CLA, the I compress the fuck out of it. Depending on how much thump or how smooth I want it, I usually go with either a UAD fairchild 660 or DBX160. Dyanmic eq Side chained to the kick right at the kik fundamental, and bobs your Fucken uncle. Usually. \n\nAnother trick that helps me usually is a static eq dip just above the fundamentals. Clearly out those lows usually helps the bottom and growl speak better for me. \n\nThat being said- a poorly recorded or performed bass isn’t just warfare, it’s heartbreak warfare. 😯😬🤪",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998802866351394897",
    "author": "NoahNeedleman",
    "date": "2022-07-18",
    "content": "I heard that Rick bass on a song on Hits 1 today, knew what it was immediately, and asked myself why I don’t use it more. \n\nThat being said, I’m much more of a McCartney type bassliner, I like the slippery melodic thing. Which is why I have flat wounds on my JBass. Also I run it through a 1073 and a Tube Comp on the way in.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999048608940822628",
    "author": "Deleted User",
    "date": "2022-07-19",
    "content": "Sooo, on the recording side of things: if you’re going DI, most interfaces do not have a high enough input impedance to do passive pickups justice, especially if you want a decent amount of low end. Guitar pickups sound good with 1-2MOhm(the input impedance of a good tube amp), but if I want really clear modern low end that can compete with 808s, then I’ve had the best results with around 10MOhm on passive bass pickups. Another important thing is a transistor-based active DI will not get you a full low end. You will end up re-amping or using amp emulations etc. Octal tubes(the type of tubes IN the B15) will. Octal tubes have a lot more body(think U47, for example) and will get you there much much quicker. I have a Sarno V8, which isn’t perfect, but sounds clean, “finished” and modern from the get-go. No compression or emulations needed. It’s also comparatively affordable, so totally worth every penny.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018511870107320325",
    "author": "Eric Martin",
    "date": "2022-09-11",
    "content": "for me it depends on the bass part, if the bass isn’t playing low fundamentals the low end might not be tight, for example a picked fast bass might sound more like a guitar in which I’ll use more low end in the kick or synthesize a low fundamental if neither instrument is doing a good job at it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018766320407412757",
    "author": "ehutton21",
    "date": "2022-09-11",
    "content": "This is a big part of why i started to send my mixes around via the collab channel. People can monitor the sub info I can’t. Super helpful",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020805986128244816",
    "author": "Zack Hames",
    "date": "2022-09-17",
    "content": "I think the bass note falling after the kick usually sounds good (I think) because the kick is usually punchy and the bass is usually more tonal, they each have their own spot in the micro rhythm",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057065445221474304",
    "author": "Slow Hand",
    "date": "2022-12-26",
    "content": "I think the best thing you can do when learning a synthesizer is to pick just one or two and really take the time to learn them inside and out. There's so much overlap between the feature set and if you can get very intuitive with one synth you'll go so much farther.\n\nBack in the day I bought NI's *Komplete* bundle and it was just way too many new instruments too fast. Too many options. I never got to know any of them very well. Most synths have all of the same features that you'll want, but there's still a learning curve for every single one that you have to get over before you can be really expressive. I wish it were as easy as picking up a guitar or a horn where everything is standardized and lies in the same place. But that's part of what makes synths great: Their plasticity.\n\nNowadays the only synths I reach for (unless I need a very specific sound) are *Massive X*, *Razor*, and my Moog Sub 37. The first two are very different and don't share many features. I use the Moog when I don't want to be tethered to my computer. Limiting my available tools has been a net benefit for me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062050196630032467",
    "author": "Deleted User",
    "date": "2023-01-09",
    "content": "I would also argue that is not a sub par miking",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088565804360028250",
    "author": "NoahNeedleman",
    "date": "2023-03-23",
    "content": "@jonmatteson @popaganda. @Maxim Y’all know I’m a UAD fan. That filter is fantastic. Already on a production. Honestly that’s the sound I’ve been looking for, just used it with what I thought was an already dialed Kontakt Sub Bass. 🙌🏻",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596540809420960",
    "author": "gatewoodsensei",
    "date": "2023-04-03",
    "content": "I start with a basic sine wave and through additive synthesis or sometime fm, i create my own bass patches. I automate the pitch through an envelope to get the knock sound that I want. The way you adjust the envelope determines how tight you want the initial knock to be. This is also how i make snares from scratch (without the fm and additive stuff)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093035026528096316",
    "author": "BatMeckley",
    "date": "2023-04-04",
    "content": "It’s still one of my main reference records. There’s a bass note or three in the chorus of HWEB that exposes most poor rooms pretty quick. An all time great record. I still hold the Daniel Johns during that era is the closest we’ve come to Brian Wilson since.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095301946866417684",
    "author": "spectrummasters",
    "date": "2023-04-11",
    "content": "It’s worth considering different 808s for different parts to meet your needs  . Sometimes I’ll have three diff 808s and a Moog bass  . And they’ll obvs all be treated individually . Re : which 808s ? Ime I find the choice of 808 (in my genres ) is a trend thing , in the last 3-4 years its pretty much been a progression by producers through perhaps four or five 808 samples .....and when the sample changes its often in alignment with a new programming technique (like new multiple flams ....or conversely, sparse hits etc ) . If you’re searching for ready made samples I could point you to a few places or if you’d like a little pack of the ones I’m referring to in what I said previously ....hmu. Happy to pass on privately . If so, these ones are more contemporary rnb hip hop than the actual  old Skool electro Roland 808 kick",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103331161616433294",
    "author": "Eric Martin",
    "date": "2023-05-03",
    "content": "posed the question because I just got tracks to “mix” that need lots of editing and it’s (to me) because the bass and guitar were cut outside of the drums and piano on a group that normally plays and practices live together in a room, Supreme failure IMO by not having everyone at the same time",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134950890424504320",
    "author": "NoahNeedleman",
    "date": "2023-07-29",
    "content": "I learned everything I know about basslines from Bach & Paul McCartney",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180178108750495859",
    "author": "Josh",
    "date": "2023-12-01",
    "content": "Kinda hard to sum it up into one message, but I’ll try my best. The easiest thing to start with is basses I think. So I’d pick different bass and 808 sounds and figure out what mine were missing. A lot of this was to stop using one shots I liked. And then from there it went onto different plucks, pads, etc.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203366769025097738",
    "author": "Edward Rivera",
    "date": "2024-02-03",
    "content": "Never using one mic for anything. Each drum shell gets a mic on both sides. Bass cabs and guitar cabs will get a \"high\" and \"low\" mic. Never using a 57 just because",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204571921765765182",
    "author": "Josh",
    "date": "2024-02-06",
    "content": "I got the waves sub and spark actually so that’s a lie.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210354794770989056",
    "author": "popaganda.",
    "date": "2024-02-22",
    "content": "Exactly. This and muting are the cheat codes. You can pretty much play any bass through any chain and if you get those 2 right it sounds good",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211307883720089680",
    "author": "Zakhiggins",
    "date": "2024-02-25",
    "content": "Late to the party with this one but the neural dsp Cory Wong guitar amp sim actually has some bass presets that slap in the right context. Incredible guitar amp sim also so lots of bang for your buck",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1236393359279394876",
    "author": "Ross Fortune",
    "date": "2024-05-04",
    "content": "Synth detectives, assemble!\n\nThe lead lick that immediately follows “Perfume it for you” at 0:53. \n\nIt’s a familiar sound, thought I’d throw it to the crew in case it’s a “that’s Solid Bass on the DX7” kind of thing. Otherwise, any thoughts on how to get there?\n\nhttps://open.spotify.com/track/2qSkIjg1o9h3YT9RAgYN75?si=Lx1fdThrRlqLqtsgfzbKrA",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244852464008826970",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "Ok. Last word (cause you've got me going now). As always, starting with the right instrument or sound source is the best way to go, rather than trying to wrangle the wrong sound into shape. A well designed synth will be designed in a way to let you easily implement all of the above tricks.\n\nI did this last patch using *Razor*, which not only allows me to route the sub oscillator to bypass all other processing, but it's *also* an additive synthesizer which is immaculately clean because the harmonics are perfectly tuned and there's no atonal beating in the upper harmonics. This thing absolutely rips:",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1267201939356258457",
    "author": "Josh",
    "date": "2024-07-28",
    "content": "I’ve been trying to break out of my box with guitar. So instead of starting with guitar I’ll just find the chords and start with either piano or some kind of a bass and go from there. Been an easy way to kind of detour around the roadblock but not necessarily a great way to get better at my main instrument. 😅",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278926183525912658",
    "author": "NoahNeedleman",
    "date": "2024-08-29",
    "content": "FWIW I’ve never gone a whole album cycle where I didn’t get fed up with an artist/collaborator and they didn’t get fed up with me at some point along the way. So cut yourself some slack there. \n\nBut the only reason you’re frustrated here is because you think it should be different than it is. Honestly you’ve got a routine going and you know what the artist needs to be happy with his performance- seems like you’ve got a leg up there. You can’t practice the show, you gotta just play the show. Sometimes you don’t know what works till you hear it back. \n\nI re-recorded the bass line again on a song I was finishing up today- had to do it 3 times over the course of production. \n\nSlack, curiosity, deep breaths.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284233069922091078",
    "author": "LAPhill",
    "date": "2024-09-13",
    "content": "Playing inversions on the A string, ime, is usually not a problem. The old G5, D/F#, E5 descending line type thing has never been an issue. But that same thing down around the lowest notes of the E string can get more thorny. Again, lower interval limits and muddying up the bass notes are more of a problem down there.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284679908244717689",
    "author": "Eric Martin",
    "date": "2024-09-14",
    "content": "that’s the key, they’re voiced on these strings ADGB or DGBE, almost never on EADG and bass is always locking in the extensions of the chordal tones",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1314012958027808870",
    "author": "Ross Fortune",
    "date": "2024-12-04",
    "content": "Not as cool for details as those above, but I did Yuck by Charli XCX a while back. It was fun because you have access to most of the exact ingredients they would’ve used (eg Kontakt scarbee bass or the other one, can’t remember which). The pocket of the bass was the tough part.\n\nLearned how to make The Message synth in Diva for it, and it was a nice exercise in balancing kick / snare / claps.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366346038327119952",
    "author": "Jasper Boogaard",
    "date": "2025-04-28",
    "content": "One of the funniest things for me is that whenever I’m hungry I feel like a song is lacking low end/ low mids",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411002720529285305",
    "author": "Ross Fortune",
    "date": "2025-08-29",
    "content": "As it goes, I'm looking for a Seinfeld bass sound today and came across this.\n\nThe composer, Jonathan Wolff, took the tempo for the theme tune from the cadence of Seinfeld's standup delivery. And he recorded a new theme tune intro for each episode, playing in bass licks in the pockets of Jerry's monologues https://www.instagram.com/p/CuH3KJosa2i/?utm_source=ig_web_copy_link",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1467212271339180053",
    "author": "Ryan L",
    "date": "2026-01-31",
    "content": "Reminds me of the Marty Robbins \"Don't Worry\" sound where they accidentally invented Fuzz when their channel pre broke. With the time frame Smile Away was recorded, I'd assume its jacked thru a pre. Whenever I throw my bass thru a big muff or fuzz as well it produces that really flatulent high end, but definitely won't sit well in the mix. I'm curious to see what running a dimed pre/fuzz in parallel would sound like.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470803943952224359",
    "author": "Will Trotman",
    "date": "2026-02-10",
    "content": "In addition to the diamonds like Noah said, just root notes chugging away or playing 8th notes can be helpful and non invasive if chords or power chords feel too informative. Octaves can be a cool halfway point. A lot of songs seem to have room for the clean “dinky” sort of electric parts (sometimes slightly melodic or sometimes just hanging out on a single note).\n\nIf it’s a matter of filling space, something that helped me on a pop track the other day was making a second track for echoes of the lead vocal where you can low pass it pretty hard and delay / verb it out.\n\nI often find myself introducing subtle sub basses later in the song, potentially doubling electric bass with synth bass, maybe layering snares to be fatter in later choruses. Then playing with some subtle percussion elements like triangle, clave, wood blocks, to differentiate later choruses.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470883344484139240",
    "author": "Adam Thein",
    "date": "2026-02-10",
    "content": "My mind goes to syncopation and interplay between bass and kick instead of locked together",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470917083142553783",
    "author": "Eric Martin",
    "date": "2026-02-10",
    "content": "without context of a song at all, my brain thought what’s bounce, first was electro dance music- bass side-chain compression. And the other though was Latin bass parts.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941071239487823902",
    "author": "Zack Hames",
    "date": "2022-02-09",
    "content": "In this context, honestly blending multiple samples, even in the mix phase, can be incredibly helpful. Missing low end in the kick? Missing a certain smack in the snare? Find a sample with those attributes. Even if you’re just hired as a mixer I think it’s valid. \n\nOtherwise, EQ…saturation….blended distorted, reverbs, go nuts.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984077849260601456",
    "author": "rse",
    "date": "2022-06-08",
    "content": "I've found that Kontakt seems really interesting for scoring film, orchestra stuff, but it's not really my thing in a song production setting. Only things I really use are the Rickenbacker bass and some piano's from native instruments",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984098024303239178",
    "author": "gatewoodsensei",
    "date": "2022-06-08",
    "content": "I feel that. Most of my music is orchestral and electronic heavy so I’m in kontakt a lot. That rickenbacker bass is killer tho.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986613332771479622",
    "author": "philbarnes",
    "date": "2022-06-15",
    "content": "LOVE both. The Wurli and Dark Upright in Keyscape are daily drivers for me. Trillian bass rocks, I use it on every session in some way or another.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020818854408106015",
    "author": "Daniel Ross",
    "date": "2022-09-17",
    "content": "I feel like groove is so subjective so we’re probably all wrong and all right to some degree…but I almost never let my bass be off grid. I always find the impact lessened when I do. Something about a lack of confidence in the low end makes me like the song less. There are exceptions but they are rare imo. And I hardly ever let the down beats of transitions be off grid too. I usually want the sections to be obvious. I also start with going behind the beat first. I have also recently in the last year or so found that if I start with getting the very basic part of the groove right first, I am less likely to overcrowd my production. So before I put hats in, I’ll just put in snare and kick and try and find the groove with just those 2 elements (unless there is some other clear rhythmic element at play) but I feel like if you can’t feel the groove with just the kick and (snare/clap/perc) then it’s not there.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1026974723172749372",
    "author": "Slow Hand",
    "date": "2022-10-04",
    "content": "@wilhelmjosephk Yeah. Sometimes sounds are such a fluke of using a particular processor in a certain way that you’d be lucky to reproduce it on another source or patch, even if you know how you got there originally (shoutout *Trash 2*).\n\nThat said, I believe I’m hearing three (maybe 4) layers that could very easily be overdubs, rather than played as a single patch:\n\n1. The dark, (relatively) clean, bass component.\n\n2. The midrangey portamento Prophet-type layer that’s most intelligible.\n\n2a. The blown-out grungy layer that could easily be Layer #2 slammed into a tape emulator with very skewed biasing.\n\n3. A 100% wet reverb/echo channel. It seems to mostly be fed by layer #2.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075831122249928764",
    "author": "hyanrarvey",
    "date": "2023-02-16",
    "content": "I’ll nudge back the bass after its gridded",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075839014705311839",
    "author": "ALXCPH",
    "date": "2023-02-16",
    "content": "Something that I almost always see (I hate saying that, but it is what it is) is very technical players does not = groovy players(lots of exceptions) fx bass players that are very technically proficient will usually almost be too on beat or even a little rushed. And I find usually nudging stuff back a little can do a lot for a groove. \n\nBut again it’s all about knowing the sounds of different grooves and knowing what it takes to get there",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081719126541738014",
    "author": "austenballard",
    "date": "2023-03-04",
    "content": "Melodyne's sibilant detection is pretty good at not messing with attack, except if you're tuning a slap bass part. In that case, note separate the attack portion before tuning",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087373430032175175",
    "author": "Zack Hames",
    "date": "2023-03-20",
    "content": "I love the Sub Phatty or Slim Phatty. Was the last moog designed by Bob Moog himself.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108805828535914637",
    "author": "Slow Hand",
    "date": "2023-05-18",
    "content": "It sounds like two layered basses to me: An electric for the deep stuff and an upright bass for the upper mids/highs and the string noise.\n\nThe string noises on the upright layer strongly make me suspect that it's a *Trilian* upright bass patch, and if it's not it sounds *very* similar to a few of the default patches.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108833738089046036",
    "author": "BatMeckley",
    "date": "2023-05-18",
    "content": "I’ve been splitting the bass I’ve been recording with Kelen a lot lately between a DI with the 660, and another signal going through the HX Stomp usually that has an octave and sometimes some qtron ish shit on it. The qtron will catch different things than the di or the octaves. This kinda feels like that.\n\nThere’s also clearly a funky Cory wongy guitar chk.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134994910525784104",
    "author": "Deleted User",
    "date": "2023-07-29",
    "content": "inner harmonies are more textural than functional, they exist to fill the space in the middle, but they can also take up too much space. key players and guitarists are guilty of this too often. no need for a 7 note voicing in a dense pop song\n\nBut chord “progressions” are also underrated in a sense that it really shifts the emotional context. you can really make a pretty significant difference by carefully crafting them, but also that doesn’t mean you need all the stuff in between bass and the main melody on every songs\n\ninstruments like chord stabs can serve the function of percussion and drive the rhythm. it’s ‘rhythm sectio’  afterall",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136386873833566238",
    "author": "Deleted User",
    "date": "2023-08-02",
    "content": "Typically you want to have shorter kicks so there’s also some room for bass to bloom with sidechain pumping.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142462055656456313",
    "author": "spectrummasters",
    "date": "2023-08-19",
    "content": "Actually , ill try messing with alterboy too ! Nice . It’s been ages since I used that plug in , might be cool to try it on bass as a weird layer 🤷🏼‍♂️",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168869803675619408",
    "author": "Deleted User",
    "date": "2023-10-31",
    "content": "And for everything recording I make sure I have it plugged in and ready to go before. Like having an allround mic like a 414 ready, a piano mic’d up (if I got one there), cables for bass and guitar near me and so on",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171622090722525267",
    "author": "Maxim",
    "date": "2023-11-07",
    "content": "The Waves sub + a good eq & limiter",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197067913891414026",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "You’ve got your drums …..and built your vocal chops , the chops are like your keys part …..and then you’re gonna weave a stealthy , hooky baseline to syncopate and spin with your chops and drums . As an example ….you could do a dembow rhythm over your drums with your bass part and then jam your vocal chops into that feel …..or vice versa , a dem bow feel on the vocal chops and a stuttering walking bass line part with that .  \n\nYou ll quickly catch a groove between the drums vocal chops and bass hook \n\nTodd Edwards is the yoda of voxal chops",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197070353307029594",
    "author": "Deleted User",
    "date": "2024-01-16",
    "content": "that makes sense. dembow vocals and stuttery bass sounds really interesting. I’m gonna try making something like that",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204793012245499904",
    "author": "Edward Rivera",
    "date": "2024-02-07",
    "content": "Is it now ? I never could get on with the puigchild. Agree with waves but on a drums and bass the UA seems to do what I want (smack / groove / bring out the power)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204795121044946954",
    "author": "Josh",
    "date": "2024-02-07",
    "content": "Last stage of vocal compression. Rips on bass too.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207805796763697182",
    "author": "Rollmottle",
    "date": "2024-02-15",
    "content": "The Bass Station plugin is pretty good.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1208898190682619944",
    "author": "Deleted User",
    "date": "2024-02-18",
    "content": "Sony Headphones or Sennheiser HD280. if the budget is under 300, I think the best might be just sticking with sub 100 headphones and waiting until you can move to a different place where the noise won’t be an issue",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210266507150499890",
    "author": "popaganda.",
    "date": "2024-02-22",
    "content": "I wouldn’t amp slap bass personally",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210268872100421695",
    "author": "SoundsLikeJoe",
    "date": "2024-02-22",
    "content": "I have EQ this bass so much...   thats led me to this. \"Let's try some different amps\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210617253104586783",
    "author": "Eric Martin",
    "date": "2024-02-23",
    "content": "I know this was anecdotal, but also I have a bass player friend and we have the “same” bass, and he has a particular way he plays, when he plays my bass, he almost never sounds good, when he plays his, he sounds good, and I’ve narrowed it down to the strength of the output of the pickups, the way he plays, the taper of the pots, the type of strings, all play a huge roll and some people just don’t have the touch for certain instruments",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214235680268357693",
    "author": "GaspardMurph",
    "date": "2024-03-04",
    "content": "In my experience: X-form sounds best on polyphonic things and vocals. Rhythmic sounds best for drums and percussion (excluding cymbals or anything with long tails). Monophonic can sound way better on bass than x-form. Sometimes x-form will create weird upper harmonics on bass…",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239074141483569152",
    "author": "Zack Hames",
    "date": "2024-05-11",
    "content": "Battery is too drum beat oriented; and then processing doesn’t seem to help me get there. \n\nThen the like, more bass line centric 808s on my MPC are exactly that.\n\nDug through my other loose 808 samples, they just lack the length of note and decay, I know it sounds super simple and dumb but there’s this FEELING I am missing from all of it. Clean, long, deep, not overly bending the pitch. \n\nAn example would be good; I’ll try to find. Metal bands use them a lot and it’s sort of silly",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244842430298198046",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "I'll usually get the grit in parallel if I want the bass to be super deep.\n\nIt's also common for me to do a clean sine wave for the fundamental and then a second voice/oscillator that's getting all of the grit and processing.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1262445542219186310",
    "author": "spectrummasters",
    "date": "2024-07-15",
    "content": "Nexus moog patch plays one support role perfectly all the time for me . When I’m using my real moog for bass I’ll layer the nexus one quietly one octave up . Add a little stereo widener , sit it back in the mix …..let the real  mono moog do the low end lifting . Gabella 👌",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300407965425209364",
    "author": "Zack Hames",
    "date": "2024-10-28",
    "content": "It’s like 3 different things all following that main thing with sub bass underneath",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331646841300848766",
    "author": "Ross Fortune",
    "date": "2025-01-22",
    "content": "To disambiguate, are you talking about generating a kick that sounds like it came from an 808 drum machine?\n\nProcessing these kind of kicks after the fact?\n\nOr kicks that go well with 808 basses?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350177518543700039",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-03-14",
    "content": "Sounds like Miami Bass to me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350178412001497108",
    "author": "kieronmenzies",
    "date": "2025-03-14",
    "content": "Atlanta bass which is an offshoot of Miami bass. Same general sound with the kick pattern and 808 but the Atlanta sound is a little more r&b leaning than the Miami thing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387802921432776904",
    "author": "NoahNeedleman",
    "date": "2025-06-26",
    "content": "You’re in production talk, so assuming we’re talking about instruments and not mixing…(even still remember that EVERYTHING is mixing.)\n\nSometimes all you need is a little 1/4 or 1/8 note stop before the chorus and the right downbeat impact. Might be a low end “forever boom” or 808 drop or the right crash. \n\nBut also, sometimes it’s helpful to just mute shit in that verse and see what’s actually needful.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430694943349018716",
    "author": "NoahNeedleman",
    "date": "2025-10-22",
    "content": "Step one through 5- get/be a killer bass player. \nStep 6, compress a little\nStep 7, turn it up",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954162459013423134",
    "author": "Josh",
    "date": "2022-03-17",
    "content": "Late to the party but literally all you need is the Arturia collection and then a solid soft synth like serum or pigments. I literally only have serum, pigments, arturia collevtion, and then a few other like guitar or bass VSTs and I have yet to want anything else.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982395748329086976",
    "author": "longstoryshort",
    "date": "2022-06-03",
    "content": "for sure, both have layering no doubt.  i think with an FM bass in the j lo song",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984261380456742963",
    "author": "ehutton21",
    "date": "2022-06-08",
    "content": "anyone who uses/mixes a lot of saw/synth basslines. do you often find the sub bass region really lacking in those sounds, and if so are you layering in your own sub element to round out the overall arrangement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984261556617478245",
    "author": "ehutton21",
    "date": "2022-06-08",
    "content": "i’ve got a synth bass that was sent to me as part of a song i’m producing and i don’t know why but it’s practically allergic to sub bass harmonics",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984261816555274291",
    "author": "ehutton21",
    "date": "2022-06-08",
    "content": "but the track is missing that sub bass element",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984310015022223390",
    "author": "ehutton21",
    "date": "2022-06-08",
    "content": "okay, brilliant, you’ve confirmed my instinct which i was telling the artist—we need to swap the other guy’s kick out, it’s not handling low end and has too much click/snap/pop at like 1.5k",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984311208033284106",
    "author": "Deleted User",
    "date": "2022-06-08",
    "content": "i haven’t heard the music but yeah, low end needs to be sculpted from the arrangement- sometimes I get confused on which one to favor when I arrange without thinking about it and end up having to redo the kick and bass",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986509697395863642",
    "author": "itaylerner",
    "date": "2022-06-14",
    "content": "Don’t own trillian but have used it several times and it’s so great for fat expensive sounding bass sounds - one of the best imo. Keyscape is incredible too but I haven’t found it doing anything that i couldn’t get from a kontakt library",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986520597842526239",
    "author": "ehutton21",
    "date": "2022-06-14",
    "content": "I own the omnisphere trifecta and there stuff is the best out there on the market right now. It’s absurd how versatile and flexible it is, there’s enough preset patches that you probably never would need to try and create your own sounds again but personally the design aspect of it is what sets it apart. Keyscape might not be necessary if you’re regularly surrounded by high quality keyboards, but trillian and bass library are incredibly invaluable to me for my needs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987475081548681256",
    "author": "Jeremy Klein",
    "date": "2022-06-17",
    "content": "Yeah im thinking of trashing some of these mics.\n\nI have a kick mic which appears to have highs cut to like 150hz lolol. I have a snare that has more hi hat then snare and almost no low end. And then I have an overhead. Add to this that all these mics sound like they were the mic off an iPhone. (just not clipping)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "992525808373604404",
    "author": "Jeremy Klein",
    "date": "2022-07-01",
    "content": "I use it SOOO often on quickly transcribing lackluster bass stems to midi so I can add a sub.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "992526465650409602",
    "author": "Rollmottle",
    "date": "2022-07-01",
    "content": "it's a phenomenal writing tool. i write melodies on bass because it puts me in a different zone than guitar or even keys...great way for me to capture ideas without being tied to the instrument i'm writing on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993882997189263520",
    "author": "delwin",
    "date": "2022-07-05",
    "content": "any tips on making Kontakt horns & strings, drum samples, bass guitar, etc. sound like the 70s? working on a period piece for a client. I'm usually doing more synthpop / electro pop but this one they want to sound like an early 70s disco piece. Humanizing the horns & strings is particularly difficult.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998770961501405194",
    "author": "1ggy",
    "date": "2022-07-18",
    "content": "What are you guys liking for signal processing chain when recording bass ITB?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998792930787602472",
    "author": "Slow Hand",
    "date": "2022-07-18",
    "content": "Honestly, a lot of the time I really like what the CLA Bass does for live bass right out the box (ducks). It’s got the *growl* fader which seems to be a parallel saturation in the midrange that helps the bass “speak” a little more. The *chorus* fader is usually nice too and stays at default. \n\nI haven’t gotten around to replicating these two settings for myself yet, so if anyone thinks they’ve cracked the settings I am all ears.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998797383745949906",
    "author": "1ggy",
    "date": "2022-07-18",
    "content": "Yep I use CLA bass too but end up having to layer with a bunch of other stuff. Basically what I’m trying to get to is the sound of the scarbee rickenbacker kontakt library sound. Haven’t been able to crack that with ITB tools.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998813303067398216",
    "author": "peterlabberton",
    "date": "2022-07-18",
    "content": "I’ve been wanting to get a set of those strings for ages. I have flats on my p bass that I never intended to change but may give those a spin sooner or later.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998818423616315512",
    "author": "peterlabberton",
    "date": "2022-07-18",
    "content": "That’s what put me off back when I was setting that bass up… lesson learned again and again: buy the good thing once. 🤦🏻‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999049300686426325",
    "author": "Deleted User",
    "date": "2022-07-19",
    "content": "And @Slow Hand is absolutely right about flatwounds. It’s really just smart arrangement. I personally don’t want much happening in my Bass above 1500k",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999050178814296216",
    "author": "Deleted User",
    "date": "2022-07-19",
    "content": "I use LaBellas for maximum sub + Lindy Fralin pickups for clarity. If I wanted a more midrangy tone, I’d go Rotosound 77s(they’re more classic rock). But Thomastik flats are also incredible if you like their flavor. All great choices.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999844005602934845",
    "author": "cy (sigh)",
    "date": "2022-07-21",
    "content": "seperate folder. use the plugin names  for sub folders. I won't move a preset there until I start using it regularly though. it's mostly filled with my readjusted \"default\" settings tbh. \n\nalso have my most used chains saved in studio one and that gets backed up regulsrly.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000201537085259806",
    "author": "RUDI",
    "date": "2022-07-22",
    "content": "Honestly i wish you could use the splice app with your own samples n sub groups. That’d be a dope update",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018474257174495303",
    "author": "louisvie",
    "date": "2022-09-11",
    "content": "hiya everyone. sub bass question : how do i decide which instrument is going to take the under 40hz frequencies between kick and bass ? for a rock song with hybrid drums and hyped up real bass gtr. i personnaly prefer bass to hit me rather than kick cuz i like the longer rumble, but i feel like the other way might be the best. for this one. i will A/B but any tips are appreciated 🙏",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1019033288632979496",
    "author": "Chris Doms",
    "date": "2022-09-12",
    "content": "Low key been having to restrain myself from getting a sub 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020802074918793349",
    "author": "Slow Hand",
    "date": "2022-09-17",
    "content": "Does anyone have any rules-of-thumb that they rely on when programming groove?\n\nThings like \"I like my bass notes to be ___ in relation to the kick because...\" or \"I put my hats (blank) the snare because...\" or \"My (instrument) is 100% locked to the grid all of the time.\" \n\nOf course, everything is context dependent, so we're talking generalities here. But if you make nothing but trap music or lo-fi beats it would be good to mention that as well, for context.\n\nI'm curious to know what approaches everyone else has arrived at. For better or worse, I like to start with a blank slate each time and it ends up being an exploratory process for me every time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020805692094947358",
    "author": "Zack Hames",
    "date": "2022-09-17",
    "content": "I asked a similar question a while ago, and @oaklandmatt had a great answer basically to the effect of: \nSomething rushing ahead adds energy or anxiousness (a punk bass line or fast trap hihats, maybe a rock guitar solo)\nSomething late adds groove/swagger (Lofi hip hop snare, a lazy vocal, a funky bass line)\nI think that’s a really cut and dry way to view it; but what you said obviously applies, every context is different.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020824609920135178",
    "author": "cy (sigh)",
    "date": "2022-09-17",
    "content": "yeah its very case by case. as far as groove in relation to other elements. I've had guitars recorded loosely toa click and worked the groove around that - lining up the downbeats of the drums/bass  with the guitars even if it's a bit early or late. that was for a more indie type of joint. and for something more trap /modern hip hop, I've nudged bass notes or samples to get them to either sync w drums up for impact  or nudge slightly off to hype of of pull back the energy in the groove. \n\nas far as programming. I'll play with forward swing and dragging notes a lot if I'm going for a more real/dynamic feel when programming. keeping in mind that if the goal is trying to stay \"on time\" any fwd swing that might happen at the start of a phrase will be compensated with some drag  after or vice versa.  keeping velocities in mind w drum hits + linking it to a filter env so that harder hits have more high end and softer hits end up a bit rounder.\n\nadding subtle layers that are similar   to the main drums but occupy a different texture or tone  in dif  sections to thicken up the groove or automate the attack /sustain of certain elements thru diff sections to help shift the listener  focus throughout",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1027297229901406298",
    "author": "wilhelmjosephk",
    "date": "2022-10-05",
    "content": "I think this is a great breakdown. One hypothesis I want to add for the bass is that it might actually be a pitch delay of the lead sound. Something about the way that it reacts to movements in the lead and its blurriness reminds me of some of the wackier presets in valhalla delay where it'll pitch down echoes 2 octaves or so and filter them out. They're not the most useful most of the time because it would probably ruin whatever preexisting bassline you have going, but this sort of setting would be the place to try them out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037481151687819304",
    "author": "peterlabberton",
    "date": "2022-11-02",
    "content": "Yeah—I’m 34, dove deep on drums from, I dunno, age 12-20. Picked up bass in high school, got good in college. Only started playing guitar to a level that felt passable 2-3 years ago. (Honestly COVID was great for that.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040038095137017977",
    "author": "Jeremy Klein",
    "date": "2022-11-09",
    "content": "Im putting together a set of tracks for a live show. Literally just wav's of the master's placed one after another in an ableton session for a rapper to rap over them. \n\nNever done this before. Anything I should be aware of? Like should I LUFS match the tracks? cut stereo sub out, mix the eq's slightly differently for live, etc?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040192099603202128",
    "author": "ALXCPH",
    "date": "2022-11-10",
    "content": "Using mastered tracks is usually fine, but being able to make “live” mixes is awesome if you have access to the stems. for live I usually find a little more dynamic can punch so much harder. A -4 lufs mix, will hit no where near as hard as a -9 lufs mix. Also The low end extension is so much deeper if the room allows it. Generally speaking ofc. As with anything sometimes the opposite can be true ✌️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047265760491343882",
    "author": "Adam Thein",
    "date": "2022-11-29",
    "content": "Anyone have a good tip for a solid upright bass kontakt library?\n\nFollow up: Pulled the trigger on Orange Tree Corebass, did the trick for me!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051603180733079622",
    "author": "Slow Hand",
    "date": "2022-12-11",
    "content": "(Ok. Now I'm starting to run with this train of thought. Now would be a good time to step off if you've gotten what you need.)\n\nI don't want this to sound like the end-all be-all. One of my absolute favorites is James Brown, and there is no way that some of his songs would hold up to the level of scrutiny I'm describing. And those records *kill*. It's all vibe. It's vibe all the way down, bebe. Not a chord change in sight. Barely a melody in some cases. And that's alright.\n\nSo what did James do? More often than not James would get all of his band (real jazz killers) in the studio and he would sing the parts to them one by one and allow them to input their own feel.\n\nHe'd start with the drummer and have them play a pattern that James was feeling. Once the drummer was jamming on that he would move on to the bass player and sing them an idea. Once the bass player had that germ of an idea they would continue to jam on it with the drummer, refining and adding their own thing. Then James would move on to the horns, and so on, and so on.\n\nWhile James could be dictatorial and (from the perspective of music education) the least technically qualified person in the room he had *vision*. \n\nIf the song has a strong identity you can give your players a good (non-technical) prompt and they can interpret that through their own sensibilities. You can describe a mood, or a scene, or an abstract sensation.\n\nR. Kelly once said (I'm paraphrasing): \"RnB is supposed to feel like the best moment of your *life*.\" That simple description conveys so much about the feel, the pleasure, and the joy that he is looking for in his music. It also excludes a lot of possibilities as well. If you can give your players a prompt like *that* then you can get everyone aligned on the same wavelength and it will carry you so much further without the need to dictate parts.\n\n----",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051726649240064110",
    "author": "Zach Hughes",
    "date": "2022-12-11",
    "content": "I think it’s a question of trade offs and the pitfalls and benefits of varying choices. I don’t have a specific question but am more curious to discuss the topic  and hear other folks experience. Could go many diff directions.. how do we facilitate those ‘special’ moments with session players? Which I like the idea of getting the piece you know you want or need first and then playing the rest of the time. Or how to communicate and prevent really good players from over powering a song and doing too much? For this project I chose to leave a lot of room for the players to play and write their own parts, but I also needed to reel them in a little bit and simplify what was happening. Even then when I dug through the tracks I had to mute certain fills, take a simpler pass of the keys to let the bass do it’s thing or vice versa. This also makes me consider the question: when do you let a song suggest to you when something special needs to happen?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055268061101437028",
    "author": "Ross Fortune",
    "date": "2022-12-21",
    "content": "At some stage I screenshotted and recreated their Monark patch from the Talk bassline (see Sol State for details - excellent YT channel generally for inspiring start-of-the-day videos).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055332215334125668",
    "author": "sukhuno",
    "date": "2022-12-21",
    "content": "Also voice of god by UAD (boz makes a free alternative called bark of dog), r bass , maxxbass are some other ways to introduce low freq information that’s based on the material you’re feeding in",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057320214385143940",
    "author": "Ross Fortune",
    "date": "2022-12-27",
    "content": "From a cursory Synthtopia scan:\n\n\"So it seems that Luis Fernando Zepeda is part of the Organist generation of 60s-70s Mexico City with others like Evaristo Enriquez or Juan Torres.\nThis technique was “invented” by Tito Enriquez but perfected by Ernesto “Hill” Gil Olvera, whom was blind, and recorded LPs under the advertising that he played “the Organ that Talks!”\n\nI found on a random blog that the drawbar configuration was something like this, you started with:\nA = 88 8000 000 00\nE = 80 8080 000 00\nI = 80 0080 000 00\nO = 80 8000 000 00\nU = 80 0000 000 00\n\nAnd you worked them with your left hand as you played with your right hand and play bass with with left foot and expression with right foot. It is a Hammond X66\"\n\n\nThere's lots of Ernesto Gil Olvera stuff on YT, but I (and my nephew) don't like it is as much as this Luis Fernando Zepeda track. Can't find anything else by him unfortunately.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062049371065159791",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "Not if you want a record that has sloppy playing with sub par micing 😜😜😜😜😜😜😜😜😜😜",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062070224813310003",
    "author": "NoahNeedleman",
    "date": "2023-01-09",
    "content": "For my producer/mixers: You guys know that feeling when you’re done with tracking, and you’re just leaning into the minutiae? Like how much poof should the kick have? How does the low mid in the bass effect the groove in the vocal? \nWhat’s your overarching feeling about that part of the process?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062165427700121630",
    "author": "conor_i997",
    "date": "2023-01-09",
    "content": "Any producers ever have issues with their nails when switching between guitar and bass? For fingerpicking on guitar they need to be longer but for bass they usually need to be shorter. Kind of annoying lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062166223443476502",
    "author": "popaganda.",
    "date": "2023-01-09",
    "content": "Classical guitarist background......Basshead. I've done years with and without nails. There's a perfect length where you can miss the nail on bass and catch it on guitar, but its a pretty hard thing to \"nail\"  😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062183289907073095",
    "author": "jonmatteson",
    "date": "2023-01-09",
    "content": "Yeah my nails are long even when cut as short as I can so I’ve always had to play thumb palm muted bass or picked. Sounds great for guitars tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062236021611307068",
    "author": "Will Melones",
    "date": "2023-01-09",
    "content": "Playing bass with your thumbs? What is wrong with you guitar players",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062250035384954890",
    "author": "Eric Martin",
    "date": "2023-01-09",
    "content": "emulating upright bass thump, it’s a thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062250997944156160",
    "author": "Eric Martin",
    "date": "2023-01-09",
    "content": "I kinda don’t like the clicks part of the upright, was over exposed to a bad bluegrass upright player that likes to slap bass his upright and now if the upright is ever clicks I just hate it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066427921394315314",
    "author": "Adam Thein",
    "date": "2023-01-21",
    "content": "Just got the Thomastiks on my Pbass and dang these are the weirdest feeling flats I've ever played, but they definitely sound the most out of the box \"like a record\" pbass tone I've had personally.  Going to have to relearn the touch on these but they feel and sound really nice.  +1\n\nI should clarify my \"like a record\" to mean basically the sound on Actual Proof by Herbie & The Headhunters",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066840416160325722",
    "author": "Deleted User",
    "date": "2023-01-22",
    "content": "but try crazy low boosts and and heavy compression, it can get you a faux length in the low end.  \n\nAll pass filter on low frequencies can extend the sustain too, but it will compromise the transient",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070815481654693939",
    "author": "Iwan Morgan",
    "date": "2023-02-02",
    "content": "I can’t rip the video for you i’m afraid. I think it’s available without a sub now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073344894606770176",
    "author": "delwin",
    "date": "2023-02-09",
    "content": "does anyone know what the samples that FM radio stations use to abruptly stop songs and transition back to the DJ are called? The like, laser explosion swirling bass drop insanity? Looking for some of these (for a live show I’m doing tomorrow) and unfortunately don’t have the time to make any (as fun as that sounds)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073924380826030140",
    "author": "subWATT",
    "date": "2023-02-11",
    "content": "I played bass in the Matt Beckley Band and all I got was this lousy ~~t-shirt~~ sticker. ❤️ Hey there bud. 👋",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075829377327190126",
    "author": "mcneazy",
    "date": "2023-02-16",
    "content": "For pop tracks that need to sound “perfect”, when y’all track live drums and bass, are y’all recording a bunch of takes and then comping until the drums and bass line up, or are y’all using beat detective. And if you are using beat detective, are you moving the bass to line up with the drums or moving the drums to line up with the bass. I just struggle to get the drums and bass tracks to lock in together like the pros",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075832429853540352",
    "author": "Zack Hames",
    "date": "2023-02-16",
    "content": "Beat detective all day. Both things go to the grid. Adjust bass by feel as needed. Sometimes perfectly edited bass / drums can make the tempo feel slower that it actually is.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076923654916558929",
    "author": "oaklandmatt",
    "date": "2023-02-19",
    "content": "Yes, but even super short syllables. Anything with a consistent waveform can be adjusted like this. A bass note, a vocal note, a breath, an S, anything really",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077520986322243675",
    "author": "spectrummasters",
    "date": "2023-02-21",
    "content": "some great arps and synth bass sounds especially",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077722237223841833",
    "author": "BatMeckley",
    "date": "2023-02-21",
    "content": "Everybody is focused on “low end thumping” and most forget “no one has a system that goes to 26hz, but everyone wants to sing along”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078366545195044884",
    "author": "Nomograph Mastering",
    "date": "2023-02-23",
    "content": "It’s a sub division of a note?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079524676025462945",
    "author": "BatMeckley",
    "date": "2023-02-26",
    "content": "You know, I don’t know. I’m not sure if they were on Lakeland by then. John Fields is a MONSTER bass player so I’m sure he had a lot to say. Also a lot of moog bass. Also, Tim Foreman is probably the most underrated bass talent I know. Just really really gifted and no matter what he picks up he sounds like him.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081715279391895552",
    "author": "popaganda.",
    "date": "2023-03-04",
    "content": "Homies who auto-tune the bass - what's your go-to settings?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087345563458080849",
    "author": "NoahNeedleman",
    "date": "2023-03-20",
    "content": "So if I didn’t want to spend all the money on a Matriarch… where am I looking for that signature Møog sound? Would the Sub 37 or 25 do it? Would the Minitaur?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092909246745694298",
    "author": "ehutton21",
    "date": "2023-04-04",
    "content": "Most of my synth bass stuff I design in ableton patches or in omnisphere",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093682999888990270",
    "author": "austenballard",
    "date": "2023-04-06",
    "content": "Actually hey, fun question for everyone\nMost ridiculous thing you've seen used to dampen a drum? Mine has to be giving the bass player's girlfriend some earplugs and cramming her into the kick drum",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095819372473352233",
    "author": "Edward Rivera",
    "date": "2023-04-12",
    "content": "There's a story about the first talking heads record. A band who knew damn well that Tina Weymouth was the bass player. Anywho, the producer brags that he replayed all her parts, and is especially proud that no one knows. I just find that to be crass",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095836459468066837",
    "author": "ehutton21",
    "date": "2023-04-12",
    "content": "I can’t speak to this on a scale that maybe some others can, but I know when I started offering to pitch something for a track or to help bring out a drum pattern a bit more/offer notes for the way the low end is translating were the moments that people who were initially just outside my orbit would actually come back into the orbit with frequency.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105117373880598569",
    "author": "Edward Rivera",
    "date": "2023-05-08",
    "content": "Me in 2009 watching Rusko make music on Acid in his attic. Later saw him spin my friends party in LA and one of his bass drops was so monstrous it shook the dust off the rafters of the venue and it looked like it was snowing (YT \"Rusko Control\" to see that)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108782805284044810",
    "author": "NoahNeedleman",
    "date": "2023-05-18",
    "content": "Producers, recordists: \n\nhttps://music.apple.com/us/album/vacation-eyes/1673436886?i=1673437127\n\nThe bass in this track is giving me life. The top is clearly stereo, wondering if y’all think that’s another instrument or a couple signals of the same performance?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108791776380194950",
    "author": "shaunobi",
    "date": "2023-05-18",
    "content": "Wow. That is really an amazing sounding track. At first I thought it was too bass heavy, but nope. Excellent balance, not a lot of masking.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108806202936262666",
    "author": "Slow Hand",
    "date": "2023-05-18",
    "content": "It's conceivable that this is played live, but if it *was* you could recreate this exact patch very quickly using *Trilian*. The voicing and attack of these bass layers scream *Trilian* to me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108830050163372132",
    "author": "NoahNeedleman",
    "date": "2023-05-18",
    "content": "I would be VERY surprised if it was programmed. Honestly it sounds like the same guy played the bass and then played the same part on a guitar",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108838325088956578",
    "author": "Adam Thein",
    "date": "2023-05-18",
    "content": "The stuff on the left that sort of sounds like a guitar sounds like string noise to me - like it was played on a short scale with rounds and the low end is ultra crazy rolled off and compressed to hell and run through a pretty stable chorus like a dimension D type thing (pulls right slightly to me) and then the stuff high end is through an auto-wah that is chorused out in the opposite way, but the slides in those little moments where you can hear them seem too perfectly tracked against the low end to be a double to me, and it sounds like bass-octave stuff but the harmonics of it to me rather than a separate guitar layer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108845488591081512",
    "author": "Adam Thein",
    "date": "2023-05-18",
    "content": "I'd even add there's a preset called \"Smooth Finger 2\" under the bass folder on FilterFreak2 that sounds like eerily similar EQ points, not sure about the modulation though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108925679187271770",
    "author": "Deleted User",
    "date": "2023-05-18",
    "content": "the high stuff sounds more like a bass with wah on it panned to left or guitar lowered by an octave doing the same stuff. Sound more like a guitar lowered by an octave by the tone. \n\nThe low stuff is probably tone knob all the way down compressed real hard. It sounds more like J than P to my ear",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108927048610742312",
    "author": "Deleted User",
    "date": "2023-05-18",
    "content": "OR the same take of bass and the low stuff is lowered by an octave hence the more consistent intonation and sustain. I feel like it would be hard to achieve that kind of dynamic consistency (length wise) on low strings even with heavy compression.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108938803286126644",
    "author": "Deleted User",
    "date": "2023-05-18",
    "content": "Ahh yes. it’s definitely bass. Tenroc played the bass on the song (also produced).",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1118964617482346556",
    "author": "louisvie",
    "date": "2023-06-15",
    "content": "hi everyone, i need your ears. i'm stealing a kick from a record i like and am now doing fade ins/out to get the audio clip right.\n\ni feel like i'm at a point where if if shorten the clip more, i'm losing bass (full xx hz cycles can't properly develop or something like that, right ?)\n\ni can't tell if i'm hallucinating or not.\n\nso one of these is the 'full' length, one is slightly shorter. \n\ndo y'all hear any difference with proper sub monitoring and fresh ears ?",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1118966586523521115",
    "author": "Rollmottle",
    "date": "2023-06-15",
    "content": "envelope on the 2nd one is better for me. bass sounds the same between the two.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123444044903764090",
    "author": "Deleted User",
    "date": "2023-06-27",
    "content": "What are your favorite ways of creating density in an arrangement with minimum instruments without parts being busy? Particularly harmonic elements. \n\nI’ve noticed certain songs have really dense feel in the harmonic instruments without too much movements but still have really crowding density. Unfortunately can’t think of any other examples at the moment… but some trap songs and dance music (brazilian moombaton, dancehall, reggaeton, soca) often have elements that crowd the upper mid range or midrange while letting the low end breathe.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126883732750606406",
    "author": "Deleted User",
    "date": "2023-07-07",
    "content": "Looking for some new sounds\n\nAny alternatives to Trillian for Synth Bass/808s? Looking for Bass stuff sampled from Analog synths and machines. \n\nAlso looking for Nexus-esque pre made keyboard/synth plugin but for hip hop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134966697388945508",
    "author": "youngteam",
    "date": "2023-07-29",
    "content": "bassline + melody definitely can supply you with enough context to know what the harmony is tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135001503120248852",
    "author": "Slow Hand",
    "date": "2023-07-29",
    "content": "I love James Brown deeply. His innovation to strip the harmony way down is a baller move that I think we mostly take for granted today. Probably because 70% of bass product demos are whack single-chord funk grooves. 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135023123763306506",
    "author": "Slow Hand",
    "date": "2023-07-29",
    "content": "It’s funny. I held back from comparing Family Man to Paul McCartney, but as bass players and arrangers they’ve got the same sensibility. Even if their styles are very different.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135025750672683039",
    "author": "tomtom",
    "date": "2023-07-29",
    "content": "Very similar. They hear everything and know exactly where the right shit is. You can tell the bass players that don’t play other instruments.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136382571282976818",
    "author": "lystell",
    "date": "2023-08-02",
    "content": "Let's say you're doing a house beat and it's kind of a bass drone thing. Like staying on the same note and building a groove. Are there traditionally better keys to do that in that plays well?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136383112717283329",
    "author": "Deleted User",
    "date": "2023-08-02",
    "content": "it depends on the type of bass sound, is it subby or reese bass style?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136383559670710402",
    "author": "Deleted User",
    "date": "2023-08-02",
    "content": "with subs-there isn’t a specific key that works well, but you typically don’t want the bass notes to go down too low. Kick wants to be lower than bass in 4 on the floor house most of the times and if the bass is too low then the kick can’t be lower",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136386308470734849",
    "author": "lystell",
    "date": "2023-08-02",
    "content": "Had to google reese bass :). \nThat's interesting. Is it the depth and length of the kick that determines the low end then?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137104311206293634",
    "author": "Edward Rivera",
    "date": "2023-08-04",
    "content": "Sounds killerrrr. When it comes in the bass drum has my favourite kind of bass drum sound too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137116219837796562",
    "author": "chrissorem",
    "date": "2023-08-04",
    "content": "Thanks! It’s even cooler in the arrangement I’ll share when the song is out.  That thwacky bass drum!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142093628546760766",
    "author": "Deleted User",
    "date": "2023-08-18",
    "content": "So on tiny differences- I’ve seen you talk about this here every now and then. But at what point does it matter and at what point does it not matter? \n\nDoes it really matter whether I used Warm47 or real 47 if it does its thing and makes you feel things? And does it really matter to care about things like that if it costs so much more to get a real 47, if it does then at what point does it start becoming a worthwhile investment other than for a self satisfaction? \n\nI’m in the camp of just buy a sub 1k mic/guitars that does its thing. 1 - because it would be a ridiculous decision to spend more money than that with what I make now 2 - It’s case by cases but a lot of times when I hear comparison it’s not really a matter of “it’s better” but more so it’s exactly that thing or that sound we know and like. I’m sure there is value in that, but when does that become actually valuable and when does it become just trivial difference?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150877034214592662",
    "author": "masteredbyjack",
    "date": "2023-09-11",
    "content": "Right but somehow AI makes them magically be able to?\n\nOr is it like they sound like a different human with a model or something?\n\nI get how you can take a guide track and sub in a singer’s voice…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1166115822805205052",
    "author": "chris_donlin",
    "date": "2023-10-23",
    "content": "Anyone have trouble with Arturia stuff not arpeggiating well? Im trying to use the Mini V it's sounding like it's falling in and out of a swung rhythm just every so slightly. The track is kick snare drum machine so everything needs to be tight. this arp bass is throwing everything off. I tried programming the midi and triggering my Poly D but im digging the sound of the Mini V more for the first time. Anyone try UAD's version?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171637118821470208",
    "author": "Deleted User",
    "date": "2023-11-07",
    "content": "those are solid too. I just find it better to play the bass. It won’t be a Rickenbacker bass tho 😦",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190579777573236757",
    "author": "Slow Hand",
    "date": "2023-12-30",
    "content": "My working theory is that it's a cello pitched down an octave in Melodyne, perhaps with some formant shifting too. I'm trying to emulate it in Melodyne right now, but am not quite there.\n\nBut the distortion and dramatic dryness is a total mystery to me. I don't know this flavor of distortion at *all*. There also seems to be a *very* nice sub octave layered in there too. The funny thing is that it all sounds very natural to me. As if there's not a tremendous amount of processing going on. I feel like I'm missing something here.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190624629828616202",
    "author": "Ross Fortune",
    "date": "2023-12-30",
    "content": "Oh that's a rad sound! Educated guess would be violin pitched down (more likely one of the Logic algos than Melodyne) with a sub synthesized octave (as in Pro Subharmonic, but some Logic equivalent), but I'll ask him next time I see him. Get all those questions down, we can surprise him with a live streamed formal grilling",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196604361401454613",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "I’ve had things like this happen to me all the time, especially when it comes to bass guitar\nBut usually, a whole week gives me enough time to push through. This one, I don’t see the light at the end of the tunnel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196649141682577428",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "For sure. Even the greatest session musicians I grew up listening to don’t play it technically at all times. But the first vibey take is gonna be better as I get my chops up. \n\nIn my definition, one take musician still applies as long as I don’t NEED to record another take after the first one. if the first take doesn’t have anything that throws the listener off from feeling the music, that’s as good as I want to be. I’m not crazy about not needing punch ins or comps. \n\n@popaganda. that’s where Ruairi’s listen like a 15yo girl probably comes in. I’m often listening as myself, I don’t know how to listen outside of my own self. \n\nLarry Klein said “I usually don’t play bass on my records because it makes me listen as a bassist”. Perspective is everything, and it really can’t be faked or bought. Posing a question to myself to open up to different perspectives is huge",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197061149372448838",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "4. Bass and keys \n\n\nBass has to be the hook playing off the vocal chop \n\nIn logic the FM synth and I think it’s ES1 all have the house bass and organs and pianos (will check the modules and edit this if in correct )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197063242816692346",
    "author": "Deleted User",
    "date": "2024-01-16",
    "content": "What do you mean by “bass has to be the hook playing off the vocal chop?” what would be the typical relationship between the bass and vocal chops?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203198736507863070",
    "author": "shaunobi",
    "date": "2024-02-02",
    "content": "I'm a little with you on not using stock plugins. Then again, I'm using Reaper and Pro Tools... Reaper especially has, um, pretty bare bones stock plugs. (For some stuff they're great - the quick drag and drop for sidechaining bass to kick if you're into that is just so quick). I mostly use paid plugins tho...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204596514790449233",
    "author": "NoahNeedleman",
    "date": "2024-02-06",
    "content": "I bought the 2245 and the Distressor this year- neither for dynamic reduction, both for unique sonic footprint. But I did have a little crisis of faith in myself when I got the 2254. \n\nIt does a thing on bass that I’ve been looking for for a long time and could figure out how to cobble together. Made me feel like a bad engineer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204786505927622676",
    "author": "Ross Fortune",
    "date": "2024-02-07",
    "content": "I think you’re being harsh on yourself there. Would you rag on someone who couldn’t get a P bass to sound like a J, even though they have the Waves bundle?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207743384941236304",
    "author": "Josh",
    "date": "2024-02-15",
    "content": "I kind wanna get a bass station. It’s something I can also use decently while still working in my living room.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207805576193777734",
    "author": "! Andy !",
    "date": "2024-02-15",
    "content": "I got mine for $450AUD (which is about 200-300US) & man, such a workhorse ! There were some venues the sub on it made the glass shake on the rooms outside",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210223033495588965",
    "author": "SoundsLikeJoe",
    "date": "2024-02-22",
    "content": "Hive mind?   Favorite BASS AMP sim plugins? \n\nI have the UAD Ampeg stuff, and it's nice...  but looking for other flavors.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210228694136791090",
    "author": "Zack Hames",
    "date": "2024-02-22",
    "content": "I actually really like the bass amp sounds available on Line 6 Helix Native. But probably not worth $400 for just some bass amp sims",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210229808223752203",
    "author": "Josh",
    "date": "2024-02-22",
    "content": "Haven’t used their bass sim specifically but I trust them with my life.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210232940865388544",
    "author": "Josh",
    "date": "2024-02-22",
    "content": "The bass amp and the tuner are the best parts of that plugin",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210237494218723400",
    "author": "SoundsLikeJoe",
    "date": "2024-02-22",
    "content": "Good tone in general though.  Could be very nice for modern metal or other crunchy bass needs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210261606089494619",
    "author": "popaganda.",
    "date": "2024-02-22",
    "content": "If I was leaving ampeg I’d be going for non-amped sounds (which is my go-to anyway) or guitar amp plugins. Love bass through a JC-120",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210265820543057960",
    "author": "SoundsLikeJoe",
    "date": "2024-02-22",
    "content": "Boredom. There are also different playing styles on this record. Slap bass for instance. Sometimes the Ampeg is just too tubby and it feels like I'm missing options.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221871628137398405",
    "author": "Slow Hand",
    "date": "2024-03-25",
    "content": "Looks like this guy's got a tutorial for that *Von Dutch* bass patch you were looking for a few weeks back. At least I think it was you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222058592023216180",
    "author": "Josh",
    "date": "2024-03-25",
    "content": "It’s funny how that works. One of my fav bass sounds I’ve ever made was just the MicroFreak I’ll take to sessions “Just in case” (I have ADHD) into one of those plasma pedals.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230982224577560710",
    "author": "markmaclure",
    "date": "2024-04-19",
    "content": "Anyone have any tips on working with new artists/producers with no filter? Like where they NEED to try out every idea they have, even if it's not good, or if it's a bad time (ie we're tracking guitars and they stop everyone to try out a (bad) bass idea). \n\nI'm on a project right now where a new artist is bringing their songwriting partner to every session as a producer. This is their first production gig (which is fine), but we're wasting a lot of time on ideas that get scrapped later on. This person has a good ear, and occasionally has GREAT ideas, but it takes forever for them to let go of bad ideas. \n\nIt takes all of my patience to very slowly walk them through why the ideas aren't working, and there's a lot of pushback when I do. A lot of \"but can we just try it? I really feel like it will work\" then 3 hours later \"oh yeah I think you were right let's delete it\".",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239066325750382714",
    "author": "Zack Hames",
    "date": "2024-05-11",
    "content": "Anyone have some reliable 808 bass drop samples they'd be willing to share? Scouring all of my samples and just none of them feel right.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241761596615692441",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Eh I mean aside from the bass guitar and little lead its all in the Oliver pack",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241764969003880569",
    "author": "Edward Rivera",
    "date": "2024-05-19",
    "content": "The bass guitar is dong a lot of the heavy lifting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241771625863712838",
    "author": "Bryan DiMaio",
    "date": "2024-05-19",
    "content": "Okay so where is the line for you? If you heard a song you liked but then found out the drums and bass were from a sample pack do you like the song less?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244839450949713980",
    "author": "chris_donlin",
    "date": "2024-05-27",
    "content": "Question for synth bass heads! I've been into dirty synth bass sounds for a while but having a hard time making them sound big as they feel and sit in a track right. I have no problem getting a sound i dig, but once it's in the track, it either get's lost or gobbles up all the headroom. Should i go for a clean sound and get the grit in parallel? Or is it just an arrangement issue",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244843081182744616",
    "author": "Josh",
    "date": "2024-05-27",
    "content": "Most of the my favorite big bass sounds actually have very little sub information in them. Mike Dean is kind of the king of that IMO. Way Bigger by Don Toliver is a great example of that. Every room I get into I play that track first to figure out what’s going on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244844346801520754",
    "author": "chris_donlin",
    "date": "2024-05-27",
    "content": "Ahh interesting, i always assumed they have clean low end somewhere in there. I'll check out that song",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244845365409222676",
    "author": "Josh",
    "date": "2024-05-27",
    "content": "Also what Bradley said is very common as well. Having a sub oscillator going will help but latest favorite distorting the filter and playing with the oscillator balance to see how it changes the distortion characteristics",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244846244598124564",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "This also allows me to keep the transient punch on the low end while the midrange is getting flattened by the distortion.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244846400584552550",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "You can't see it, but I've dialed out all of the low end inside of the Manny Distortion plugin, so that it's not fighting against the dry layer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255763586731479171",
    "author": "spectrummasters",
    "date": "2024-06-26",
    "content": "When jungle and (later ) drum and bass producers in England started to receive commercial radio plays and their productions were licensed onto major label compilations , every music and fashion journalists worth their fee was all over “the sound “ . How is it constructed , what is it made up of . The same thing a little after with uk garage . Jungle had and still has “a round table “ of gatekeepers who founded the music and who would meet to discuss the future of the music , the sounds , the vibe the bpm etc . If you knew the music and the people you’d know why some people would be excluded from the scene . I never had a problem with any of that . They invented the scene and they were protecting it from scene jumping fair weather productions .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255764271812317266",
    "author": "spectrummasters",
    "date": "2024-06-26",
    "content": "U.K. garage died out . Jungle : drum and bass is still thriving in the hands of the people who created it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255764709689266176",
    "author": "spectrummasters",
    "date": "2024-06-26",
    "content": "Zooming in . In U.K. garage , jungle / drum and bass , U.K. funky , grime and sub low / dub step ….the idea that you’d expect other producers to show you how to make a banger would be embarrassing .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258505112473571428",
    "author": "LAPhill",
    "date": "2024-07-04",
    "content": "100%. I usually have the bass slightly behind the kick, and the guitars slightly behind the bass. Just feels better to me. But it’s all context dependent, of course.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261169525441691749",
    "author": "Slow Hand",
    "date": "2024-07-11",
    "content": "You may already be aware, but you can get very different textures by playing with the LFO shape on the tremolo. \n\nThe bass is more of a sine/triangle shape while those vocal samples have harder edges, closer to a square wave. The square wave modulating volume at high rates will give you that \"ripple\" I think you may be hearing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1273437682491461704",
    "author": "Brian Reynolds",
    "date": "2024-08-14",
    "content": "Why is C# 2 the greatest bass note of all time on a Synth? Why does it feel sooooo good??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278121811724210277",
    "author": "Rollmottle",
    "date": "2024-08-27",
    "content": "i used it to tune the envelope on an unwieldy synth bass arp. pretty slick shit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283991071499620364",
    "author": "Josh",
    "date": "2024-09-12",
    "content": "I was shocked at how much I used Reason. I got a month of their sub for $1 for fun and it’s definitely one of the go-tos now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284219192576315443",
    "author": "LAPhill",
    "date": "2024-09-13",
    "content": "(Though, even if the bass is playing that inversion note, it can still get muddy if your guitar's chord is low enough that the added low octave is near the bass note)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284226087433539696",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-13",
    "content": "Thanks for the great answer man! \n\nWould it at all make sense to for C/E play a normal E power chord, and then reduce the most B sounding frequencies w/ tight EQ bells? \n\nIn the past I’ve dubbed single bass notes w guitar and automated that track in more when needed to try and make up the difference when things get wacky",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300405866402676778",
    "author": "Sam Segarra",
    "date": "2024-10-28",
    "content": "Probably a noob question - any idea how I could get close to the sawtooth bass sound on the new Rose/Bruno Mars track \"APT\"?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1302254096534994945",
    "author": "Skyler Young",
    "date": "2024-11-02",
    "content": "Question for you all: would you rather a plug-in that did 808s and synth bass in one plugin - or have them as two separate plugins? Does something like that make a difference to you workflow wise?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310990290047336449",
    "author": "Eric Martin",
    "date": "2024-11-26",
    "content": "before the downbeat no crash on the new section, filter sweeps do the thing for me, Juno chords raising the cutoff, drums through a EHX bass microsynth doing the sweep, anything to have fun",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313044648641695785",
    "author": "vostral",
    "date": "2024-12-01",
    "content": "I highpass these Room & Overhead emulation layers because i once listened to the stems of a Polyphia record, that the Room & OH tracks do not have any sub information, that's the moment i came up with this verb layer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313615825181081611",
    "author": "spectrummasters",
    "date": "2024-12-03",
    "content": "I need to get basic chops up quickly to get through a batch of mixes I have and I’m struggling to make sense of it and / or find a trustworthy channel to give me a grounding . There’s so many vids based in a lack of basic engineering knowledge , \n\nAll I want to do is  throw drum and bass into it and print back out . \n\nWill I need to load drums in as hits and re program them or can I import stems ? \n\nAnd do you know by any chance where I could find a good video demonstration",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336713352306495561",
    "author": "bobby k",
    "date": "2025-02-05",
    "content": "QUESTION FOR THE CLASS -\n*(this could really go in any sub but I think production talk is most relevant)* \n\nWe all have little adhd monkey brains and the people we work with tend to as well. What are some tricks or practices you’ve found success with to keep a small group of creatives on track during in-person sessions? I’m all for a yap but some days it’s like every 3 minutes some new conversation breaks out in the room and I find it terribly interrupting being the computer person trying to lead the way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1338592140128686214",
    "author": "Jeremy Klein",
    "date": "2025-02-10",
    "content": "but with all kinds of loops. Bass lines, key parts, fx, etc.\n\nSo simple, but just helps the song feel less like a Garageband demo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1338603935656710154",
    "author": "kieronmenzies",
    "date": "2025-02-10",
    "content": "Oh actually no it isn't a pickup. Just thought it was for a sec because where the bass accent is",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346576371056382054",
    "author": "Slow Hand",
    "date": "2025-03-04",
    "content": "Other strategies for re-vamping the feel and arrangement:\n1. Trying putting instruments in different registers (move the bass up/down an octave).\n2. Play the song in a neutral form like only piano and vocals and listen for what it might suggest.\n3. Substitute instruments (Ex: bowed bass instead of electric bass).\n4. Try a different key.\n5. Try half-time. Try double-time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360250394382565406",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-04-11",
    "content": "Sure! Using elements of both electronic and acoustic drums to get the :\"best of both worlds\". Thick low end, acoustic dynamics and vibe, crisp controlled top end. The kinda of sounds used in lots of modern pop & rock. Would love something expressive, dynamically playable in that ballpark",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1373093478828998707",
    "author": "Brian Reynolds",
    "date": "2025-05-16",
    "content": "Jazzy B-3 Tonewheel Organ makes for a dope sub bass",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383594268928770130",
    "author": "Slow Hand",
    "date": "2025-06-14",
    "content": "Oooh, maaaybe? The quality of the sound feels like it's been pitched down an octave using varispeed. The part is kind of loose and not always locked-in with the bass and guitar, so maybe they overdubbed a harmonica at double speed, so that it would play back an octave lower. That would also explain the heavy chorusing effect on the pitch, which might be the pitch fluctuation in the reeds being exaggerated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386477275276378122",
    "author": "chris_donlin",
    "date": "2025-06-22",
    "content": "Love this question, I’ve been on a big panning journey the last two months because I’ve always just doubled things and panned everything evenly. I was listening to an episode on Sonic Scoop about Nigel Godrich’s approach to mixing and it was really eye opening to hear how bold his mixes are. I used to get distracted when something was panned but not balanced but after just forcing myself to do it I’ve gotten more comfortable, and even fallen a bit in love with what panning can do. I’ve noticed I have a tendency to pan instruments a certain way, pianos sound better panned, electric guitars always feel better panned right, no reason why it just does. Find what feels good to you! I haven’t gotten bold enough to pan bass and drums to a side. One day",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404592196237398098",
    "author": "cian riordan",
    "date": "2025-08-11",
    "content": "I've had good luck picking the more consistent kick and anchoring the low end in the center, then having the rest hard panned. Things can get a little seasick otherwise.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430682230912450671",
    "author": "Cole",
    "date": "2025-10-22",
    "content": "Can someone please tell me how to get the bass tone of this record. I’m desperate",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430682317176963204",
    "author": "Cole",
    "date": "2025-10-22",
    "content": "The compression is just soooo nice and the low end is perfect",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430695104334659706",
    "author": "NoahNeedleman",
    "date": "2025-10-22",
    "content": "I know dude. Sounds like a cop out, but truly the best bass tone starts and ends with the fingers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1443996556465274891",
    "author": "James Cronier",
    "date": "2025-11-28",
    "content": "What is the best sounding way to edit timing on an electric bass DI? cutting and slipping clips? Elastic Audio? Some other option like the melodyne time tool?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444090579431587840",
    "author": "oaklandmatt",
    "date": "2025-11-28",
    "content": "And not just for making things incrementally better, but for solving problems as well.\n\nI recently was mixing a song with a young mixer who I gave my session to. I heard a very subtle low and thump after two particular downbeat and we could not figure out what it was. We solo'ed some groups and then I remembered that he had replicated my autotune settings on the bass guitar (he had a slightly different version). I know from lots of tuning experience that different modes will occasionally cause different types of artifacts. So we solo'ed the bass, switched from \"modern\" (his default) to \"classic\" and it was solved.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1455064115998621809",
    "author": "longstoryshort",
    "date": "2025-12-28",
    "content": "one of my earlier experiences writing for other people (ghost producing for a few DJs) in that same kinda lane, future bass ish\n\ni used to produce before i would *write* sometimes, and the energy would just get sucked right out of the room\n\nas soon i opened serum they'd say oh we're not getting a record done today\n\nthat moment really hurt me at that time, but later on i realized it was true - it's always the true criticism that really hits, right?\n\nso i made adjustments by building out my sounds/library/synth patches in advance, so when sessions came up i would be able to just fire in 90% of the way done sounds.\n\nwhen the song was written then i'd finish up the sounds and do the tweaking and the session had so much momentum it didn't take long to finish.\n\nrecords got done, money was made, everyone was happier.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460734858203500810",
    "author": "NoahNeedleman",
    "date": "2026-01-13",
    "content": "How much of that low end pressure is processing and how much just the 44?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1467073255868207156",
    "author": "Chad Rodgers",
    "date": "2026-01-31",
    "content": "Can anyone recognise what’s happening with the bass here? It’s got an amazing fuzzy quality to it but it has a lot of clarity at the same time. Sits in the mix amazingly. Is it just getting driven through a pre / channel strip quite heavily?\n\nhttps://youtu.be/Hs3qInd2a5s?si=v0atsCO1-YbrIA9N",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]