[
  {
    "id": "1378011172728602625",
    "author": "Nomograph Mastering",
    "date": "2025-05-30",
    "content": "Have you tried keeping the doom and despair on separate tracks? Allows more creative control later!\n\n(Sometimes blending a little hopelessness in parallel can really make things pop)",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076918045261451414",
    "author": "BatMeckley",
    "date": "2023-02-19",
    "content": "I would say it’s not one or the other. Like, I might do some big timing moves first, just to have the vocal 80% of the way there. I’m talking actually nudging things around, not stretching. Then I’ll consolidate and drop into Melodyne. In Melodyne I’ll turn the whole thing and also really pay attention to the timing. At this stage it’s a lot more stretching and/or compressing notes, or more importantly PARTS of words. Like I’ll separate the consonant, and time compress that and bring up the volume so ccchhhhhhhhair becomes CHaaaaiiirrrr. (If that makes any sense). Then back into ProTools. Double check for any weirdness, comp back in the untuned bits you can get away with if you want. Then I’ll do a final cleaning up of group Esses, do my little what I call Swedish time stretching technique, REALLY pocket and polish the vocals. Then I send it off to the label who needed it yesterday but somehow don’t get back to me for 6 months.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1189652778113568850",
    "author": "Slow Hand",
    "date": "2023-12-27",
    "content": "Cian's advice is good. It's hard to know where to start, so I'll just share three \"a-ha!\" moments that I've had over the years where the reverb sound that I had been chasing was unlocked. Some of these may already be obvious to you:\n\n1. **Pre-Delay Time:** The longer your pre-delay time is the farther away the \"back wall\" of your mix will sound. 120ms pre-delays (which are huge) will give you that Bruce Swedien depth. The longer your pre-delay the less wet the verb will need to be. \n\nA short pre-delay time will \"glue\" the verb to your dry signal, while pre-delays longer than 50ms will \"detach\" from the dry sound and give you a greater sense of depth *and* clarity.\n\nExperiment with pre-delay times of 20 ms, 50ms, 80ms, and 120ms and see what happens. As you try these settings re-balance your verb with the dry/wet knob and see how that changes the feelings of depth, rhythm, and clarity in your mixes.\n\n2. **Panning/Width/Band-Limiting:** Most verbs default to full-width. Recognize that most verbs don't need to be this massive and practice narrowing your tails. The more that you narrow a reverb towards the center the more it will feel like it's extending into infinity towards the vanishing point of your mix.\n\nAdditionally, don't be afraid to focus your verb by rolling off the high-end and the low-end. Verbs contribute to a lot of clutter in a mix.\n\n3. **Slap Echo:** This was a big one for me. The reverb sound that I was hearing on so many of my favorite records (Bowie, Prince, etc) was really just a single band-limited echo blended to taste. Slap echoes tend to live in the 50ms - 100ms delay range. Sometimes that's all that's needed for the feeling of ambience I'm seeking and it takes up *way* less space in a mix.\n\nOnce you master that you can start blending your slap echo with your reverb tails and the combination will give you a very expansive sound with minimal fuss.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1093033210088271902",
    "author": "BatMeckley",
    "date": "2023-04-04",
    "content": "Things that I didn’t work on that blow my mind vocally: When the Circus Comes by Los Lobos. A lot of the 1975 stuff is really really well put together vocally. It’s Not Living if its Not With You is full of incredible vocal tricks. Worth repeated listenings. Youngblood by 5SOS is a modern song really well put together. Think Andrew Watt handled the vocals on that and did a fantastic job getting the take out of Luke. Dance Hall Days by Wang Chung is always a good reference. Mercy Street by Peter Gabriel (the whole SO record) pretty unfuckwithable. Bang Bang is always a great reference because you can really show a singer the difference between a Jessie J and an Arianna. Comes in handy in sessions a lot.\n\nIf you’re looking for creative, the whole Dissociatives record is a constant reference. I’d start with “Horror With Eyeballs”",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094318611922964520",
    "author": "popaganda.",
    "date": "2023-04-08",
    "content": "I’ve been deep-diving on Daniel Johns this last week and really been thinking about the toll that being creative can take on people. It came up yesterday in the VC too. In some ways our culture likes to reward artists being martyrs, but it’s never something to strive for. I think as producers one of the biggest parts of our job is to be a grounding presence and a support for artists who can sometimes have pretty wild swings. But we’re artists too in our own right with our own bipolar tendencies. In a way that can create an empathy bond between us…we can understand the manic exuberance of making an amazing thing and how there’s usually a pendulum swing in the other direction to compensate. But I kind of think our job as producers is to have our shit together enough to buffer that bipolar thing and make a sanctuary where an artist can feel at home. Just my random thought for the day.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211803070422589450",
    "author": "Slow Hand",
    "date": "2024-02-26",
    "content": "I once had to do three revisions with a ME to keep their masters from distorting in unwanted places. *Then* we found out that their hardware routing was also flipping the L/R imaging because their cabling was patched wrong. That was an artist-recommended ME. Needless to say, we did not go with them again.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017130871964315668",
    "author": "BatMeckley",
    "date": "2022-09-07",
    "content": "I mostly fuck with retune speed; adjusting it slows down how hard the tune snaps to the note and it can basically reduce the “severity” of the effect. Classic mode is because when they went from 5 to 7 we all threw a fit because they fucked heavily with the “sound” of the plug in. In an effort to increase transparency they actually messed with the high end artifacts we actually dug, and were using the plugin for (on a lot of the Luke records I worked on we were using melodyne for tune and AutoTune for tone). I clearly remember sitting on the phone with Antares brass for HOURS while they tried to convince us the new version was “better” and me having to explain to them that it wasn’t and we were now traveling with rigs that had the old version because the new version just didn’t have the sound we needed. They compromised by introducing “classic” mode which was their attempt to get the sound of v5 back.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137097720885157918",
    "author": "chrissorem",
    "date": "2023-08-04",
    "content": "Here’s  a mix I’m working on currently. It starts with mangled drums and the hat and ride mics creepy in and eventually the whole kit comes in",
    "reactions": 11,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1310998613047902288",
    "author": "Rollmottle",
    "date": "2024-11-26",
    "content": "adding stuff is always effective but i like trying to pare back the arrangement to see if i can get away with something. dropping the kick, the bass or snare for a bar, 1/2 a bar, or one beat can sometimes create the transition without adding anything.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362522906663587841",
    "author": "chrissorem",
    "date": "2025-04-17",
    "content": "I try to think about the records that inspired me to want to get into music in the first place.  Keep an open mind, and remind myself to stay teenage.  Keep my ear on the floor to what the youth are up to,  and  how not knowing how things work sometimes is more creative. Also putting my self in situations outside of comfort zone. As I age I tend to want to be more sure and more comfortable and confident in my choices and when I was younger I put myself in many situations where I maybe  wasn’t ready for but i figured out creative ways of dealing",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998809181303881788",
    "author": "Slow Hand",
    "date": "2022-07-18",
    "content": "So obviously starting with the right bass is going to get you 70% of the way there, but you know what *really* surprised the hell out of me? The *strings*. \n\nIf you're not getting anywhere close to the tone that you want, start exploring the wide world of bass strings. I had overlooked this simple thing for ages. I took my choice of strings for granted because I never had to change them. And when I did it made all of the difference in my tone.\n\nI've always been a Fender guy: P-basses and J-Basses, and the DI signal was always voiced way too dark to pop out of a mix without some heavy lifting. Granted I also use flatwounds (which aren't as zippy as roundwounds). \n\nAfter some research on the TalkBass forum, I ordered a few different sets of flats to experiment. One such set were the *Thomastik-Infeld Jazz Flats*, and ho-lee *shit*. There it was. There was the sound I was looking for.\n\nThey were voiced way lighter in the bass, which gave me a far more articulate midrange. Like the sound of an upright bass which (trust me) is a very good quality to have unless you're going for a grindy metal tone. As it turns out, the midrange is where *all* of the action is in the bass. It's okay if your bass DI is voiced with no low-end, because you can always add that weight back in, but if the midrange is not present to begin with it is an uphill battle to make it articulate in a mix.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078132289227198485",
    "author": "cian riordan",
    "date": "2023-02-22",
    "content": "Apollos sound fantastic. Literally everything else in your chain will have 1000x more effect than a fucking DAC. You’ve solved the problem for now… time to dig in and make some music.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086259037265477633",
    "author": "isaac joel",
    "date": "2023-03-17",
    "content": "Hey friends, \n\nI've been working on a production/songwriting tool called Infinite Directions for a long time and happy to say they are finally available. Basically a deck of cards that generate modular, creative prompts--think Eno's \"Oblique Strategies\" meets Tarot. I've been using them on my own work and with clients for years and they've been super useful to me and excited to finally be able to share. Checked with mods, but if this is the wrong thread/inappropriate let me know 👍 \n\nhttp://themarblegarden.com/infinite-directions",
    "reactions": 10,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1142131726701826218",
    "author": "BatMeckley",
    "date": "2023-08-18",
    "content": "<deep breath>\nSo, grasshopper, everything matters, and nothing matters. It depends on where you are and where you’re going, and most importantly actually knowing where you’re going.\n\nI view the difference in shitty gear vs good gear as compound interest. A vintech one on one might sound basically like a vintage neve. ALMOST indistinguishable. But if you’re using it on all 149 of the tracks you’re compiling into a pop song, the end result is going to be 149 times more noticeable. The second floor of the leaning tower of Pisa looks pretty spot on but the people on the 15th floor are freaking out. \n\nThat said, I could record a garbage singer through my 251 and my chain, and if I didn’t know what to do with it, it would still be garbage. The flip side is we actually demoed different mics and different chains on Paris Hilton. There was a right answer. And she’s not gonna win any singing contests, but at the end of the day the cumulative effect of all the decisions we made led to tracks that are still being played in clubs to make people dance over a decade later.\n\nDetails matter in not just what the audience hears eventually, but what the artist hears initially, giving them the confidence and headspace to sprinkle in their extra few (sometime more than a few) percentage points of vibe that the audience attaches too later. Fix it in the mix is an abused concept because it doesn’t take in to account the affect of shitty sound or feel on the performance. You think 1 mic doesn’t matter? I’ve heard people sing noticeably more in tune and in time when switching from DAW monitoring to direct monitoring. It ALL matters.\n\nBut if you don’t understand songs, melody, rhythm, and how these things interact to move people? None of it matters.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265502391705534615",
    "author": "NoahNeedleman",
    "date": "2024-07-23",
    "content": "Quick reminder that sometimes muting stuff is more effective than adding stuff.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195016804305731764",
    "author": "Ross Fortune",
    "date": "2024-01-11",
    "content": "Confirmed by Phil Collen that 98% of the Hysteria guitars were Rockman (and Adrenalise, the following album - although that was with the later Rockman where you could switch the chorus/verb/delay in and out).\n\nThe *jang jang jang* I was looking for was Phil's 1978 Fender Stratocaster (nicknamed \"Felix\"), picking one string at a time through the clean setting on the Rockman, avoiding the arpeggio effect of actually strumming a guitar.\n\nSauce: https://www.youtube.com/watch?v=6pli9XTPHR8",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212370153153503252",
    "author": "SoundsLikeJoe",
    "date": "2024-02-28",
    "content": "Sometimes for deadline work,  I use a \"trust the numbers\" or \"trust the process mentality\" and avoid the time sink of artistic minutia viewpoints.   Meaning...   don't be too precious about it. You know what levels \"need\" to be.  You know the approximate balance of things. Get it into the range of \"that works well enough\" and ship it....  Because you HAVE too.  Clients that are pushing against the deadline are (often) just making products, and that doesn't get the same creative refinement as real art. Truth...   some clients often can't even tell the difference in that last 10% of quality improvement anyway (advertising, corporate, broadcast).  Not that you shouldn't always strive to do your best...  but at some point your craft-skill at 80% of max is all they have budgeted for and all you have time to invest and is AMAZING in their eyes.  That's just how WORK is sometimes. Ship it.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258182742844375082",
    "author": "LAPhill",
    "date": "2024-07-03",
    "content": "Sharing a tip for those that track distorted guitars - always take a DI signal with it. So much easier to edit timing looking at the bottom waveform vs. the top:",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1334294937176375327",
    "author": "Slow Hand",
    "date": "2025-01-29",
    "content": "Granted, her examples are *very* specific to orchestra and not directly applicable to pop records, but the underlying principles here include:\n\n**1) **Think of instrument combinations as a single composite voice.\n\nOne instrument can function as the \"sustain\" portion of the sound and a second instrument gives the \"attack\". Together they create a single melodic voice.\n\n**2) **How do the instruments stack on each other? Do they clash? Cellos doubling a bass an octave up extend it's timbre into a higher register to make it read better. It's not so different from adding fuzz to an 808 so that it has more presence.\n\n**3) **Which instrument will cut through the music?\n\n---\n\nA few concepts that I'll add:\n\n**4) **Instruments in the foreground vs. the background. Know which part is the lead (focal point) at any given point in the record and then pare down the presence of the rest and push it into the back of the sound stage.\n\n**5)** (Piggybacking off of Felix's excellent post) What is the simplest way to achieve the desired effect? Reduce. Reduce. Reduce.\n\nCut instruments and parts ruthlessly and approach it with a minimalist's eye. Like writing a haiku: How few elements can you use to create an impression? Maybe a guitar part is carrying 90% of the groove and the drums only need to be a kick and a snare. Or maybe the guitar is covering the backbeat too, and you don't even need a snare!\n\nConstantly ask yourself \"What is the most important sensation in the record?\" and then focus it by cutting out everything that gets in the way.\n\n**6)** Hocketing. Pass the melody off between different instruments at different points in the song. Play it in different registers. Combine voices occasionally for special effect.\n\n**7)** Tonal contrast. Dark instruments plus bright instruments. Distorted and clean together. Near vs. distant.\n\nElements that sound same-y will gel together and elements that contrast tonally will pop.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368611818746150934",
    "author": "Rollmottle",
    "date": "2025-05-04",
    "content": "I would never put rules around how a client wants to engage to give me the information I need to get the project done. People are wired differently and may communicate more effectively in certain modalities. I’ll trade that off every time for any personal inconvenience.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033939905086226472",
    "author": "Slow Hand",
    "date": "2022-10-23",
    "content": "I couldn't speak to the current state of samplers, but I've always wished that someone would build a bold sampler that wasn't afraid to be really wacky and full of unique characteristics. For starters:\n\n1. Include a radio tuner. \n2. Maybe some really nice - but heavily colored - preamps.\n3. Include all kinds of weird peripheral sensors like devices that pick up EMF signals or a few contact mics. Include a suite of effect plugins that are specially geared towards these input methods.\n4. Super-intuitive resampling, time-stretching, and pitch-shifting features.\n5. An algorithm that analyzes the dominant pitch of a loop and auto-maps it to a keyboard. It should be capable of re-orienting itself as the dominant pitch of a loop is adjusted.\n6. Tracker-style sequencing capabilities.\n7. An OTT-style compressor. Maybe something really trashy and blown-out like Devil-Loc or Vulf Compressor. Something that really messes with the proportions of a sample.\n8. Easy and flexible integration of feedback loops.\n9. Intuitive integration of polyrhythmic looping or sequencing.\n10. A feature for easy implementation of Steve Reich 'It's Gonna Rain' style tape loop phasing.\n11. Auto-bpm detection keyed off of designated inputs (ala Ableton).\n12. Automated master tempo effects.\n\nI could go on.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055530871605698630",
    "author": "oaklandmatt",
    "date": "2022-12-22",
    "content": "To go further on what @Maxim said: when you stack a bunch of vocals that are all hard tuned, they're gonna phase cancel. I often detune L/R doubles of a lead by a few 10ths of a cycle (like take the left channel to 439.4hz and the right channel to 440.6hz in auto tune) to help separate them.\n\nThis is actually what a \"chorus\" effect is meant to do. When you actually get a bunch of great singers together to sing the same thing, their different timbres and slightly different pitches will add up to a very rich sound you can't get from stacking one tuned voice. That's what the effect called \"chorus\" is essentially trying to mimic with slight detune and delay.\n\nNot sure if this is a topic we've covered much but I know @BatMeckley and @Slow Hand have thoughts",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078140000811622460",
    "author": "JakeTB",
    "date": "2023-02-22",
    "content": "Can also spend it on better food and good coffee for a couple to be in a better creative space",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1144660152264433694",
    "author": "Jeremy Klein",
    "date": "2023-08-25",
    "content": "the wobble and distortion can get a bit much if you are trying to use it in a more musical context so i created an ableton macro to control all the rc-20 params at once:",
    "reactions": 8,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1197211761410064384",
    "author": "Ross Fortune",
    "date": "2024-01-17",
    "content": "@NoahNeedleman I hate to reopen a closed case, but… new shit has come to light. \n\nConfirmed with the man himself - it was indeed violin, recorded with a mic rather than DI. Passed through stacked Logic pitch shifters (and maybe some Alterboy).\n\nFuckin wild what all that processing does to the perception of timbre/depth or whatever causes the claustrophobia. \n\nSounds like if you’ve got a cello and a DI though, you can save yourself a trip to the Stradivarius shop and a few CPU cycles.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241812975019364462",
    "author": "LAPhill",
    "date": "2024-05-19",
    "content": "We're not privvy to the conversations and the process that led to the results of finished songs. In the same way that sometimes the rough mix wins, sometimes that loop that you grabbed just to kick off ideas ends up unbeatable. Rerecord with different sounds, trying to match or improve the feel, but there was something about the way those Splice loops interacted that couldn't be beaten. Or just isn't worth the effort because now everyone is focused on making sure the vocal is perfect and the track is working. \n\nI'd take the best version of the song over some self-imposed creative high ground any day.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1311026460831645696",
    "author": "Slow Hand",
    "date": "2024-11-26",
    "content": "At the risk of stating the obvious, transitions can also be telegraphed through the instrumental writing too. Whether it's a drum fill, or a chord voicing that walks up/down into the next section, or tension in the melodic voices, or shortening the notes lengths (staccato, staccatissimo).\n\nThere's also idiomatic noises from the instruments. Guitars have string scrapes, headstock rakes, that cool chattering thing from tapping near the bridge with the edge of your pick. Pianos have big glisses, horns can squeal, bowed strings can sweep a fast legato scale up into the downbeat or do a large gliss.\n\nThen there's foley. I get a *lot* of mileage from sound libraries made for film audio. Foley artists are some creative people and you can go far layering their sounds into instruments at the transitions.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405042432306843808",
    "author": "Rob Domos",
    "date": "2025-08-12",
    "content": "Omnisphere is a great rompler with pretty bad effects. IMO the best way to use it is to initialize it and then dive through the sample library",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1111783637101314088",
    "author": "Ross Fortune",
    "date": "2023-05-26",
    "content": "I’m not a psytrancer (although the first time I took MDMA was at a psytrance festival called Voov where I got so fucked up that I found myself wearing someone else’s trousers at 8am with no memory of having taken off my own), but I saw a pretty impressive live show this week with an artist running all their vocal effects (lots of pitch and formant stuff) live through a logic session. Chatted to the tech after, she was singing the praises of the Antares Throat plugin.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157507043578630204",
    "author": "Jeremy Klein",
    "date": "2023-09-29",
    "content": "the more you want it to sound like a \"crowd\" at like a soccer stadium or whatever, the more rhythmically and pitch off the layers should be. you can go as hard as hitting the wrong notes for this effect",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169735837987123301",
    "author": "NoahNeedleman",
    "date": "2023-11-02",
    "content": "@Matthew The Cooke🎄🎅🏻 sounds like you’re developing a Philosophy. Which is important to do. Finding out who you are, how you thrive, how you best help others thrive. \n\nBut philosophies are not set in stone, and you’ll at some point find a time where being a dick is important to the process. It may bring you closer to the artist, or plant a seed that allows them to grow in ways they didn’t know they needed to. Or it’s just the only way they’ll hear things. Also- it will just remind everyone in the room that we’re all human. Niceness < Kindness.  Effectiveness > Most Things.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241808535050780823",
    "author": "Slow Hand",
    "date": "2024-05-19",
    "content": "I used to feel deflated when I discovered that records I loved were sampled or interpolated from pre-existing records; not written solely by the artist that I admired. Still do sometimes.\n\nAnother thing happened, though. It shortened the distance in my mind between my work and the achievements of these artists. Doing what they did no longer felt quite so far out of reach. It's not to say that I went out and started sampling records, but it gave me a deeper appreciation for the creative act and assured me that so much brilliance is rarely created in isolation. It's all building on the foundations of what others have done before.\n\nIt opened my eyes to having a dialogue between myself and the rich history of music. Music is plastic, malleable, and fluid. There's a hundred and more ways to make something wonderful and they're all equally valid if we don't let our sense of pride prevent us from savoring them.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284218772487671991",
    "author": "LAPhill",
    "date": "2024-09-13",
    "content": "Not a dumb question. The distortion on power chords creates an octave below the fundamental pitch, which helps make them feel well, powerful. For intervals other than a 5th, it's not an octave below but some other pitch, and so yeah, you're likely creating unpleasant harmonics outside of the key.\n\nThe dumbest, but easiest way to avoid that is to let the bass be the inversion's lowest note while the plays a 5th from the root note. Otherwise, you're looking at dialing back the distortion on those inversions, or on the tone as a whole, which isn't necessarily what's desired.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444027866323878028",
    "author": "oaklandmatt",
    "date": "2025-11-28",
    "content": "The method that sounds most transparent is hand editing (no digital stretching at all). You need to line up your edits so the wave form is perfect in the middle of each note, then use an equal gain cross fade at the edit point. This gives you the most transparency because there is no algorithmic stretching happening. \n\nIt limits very slightly your options with timing because bass wave forms are long, so lining them up perfectly means you can only move the timing the length of each waveform. It's also time consuming compared to stretching.\n\nIf you are editing a DI that is then going through significant processing (amp sims and shit), you can sometimes get away with one of the stretching algorithms. Elastic audio is ok and usable sometimes, but I prefer Ableton's complex mode over everything else I've heard.\n\nI try to avoid time stretching artifacts on lead vocals and bass instruments more than anything else (unless it's creatively interesting of course).",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444149540965056582",
    "author": "BatMeckley",
    "date": "2025-11-28",
    "content": "Kind of? I can stretch notes absurdly far by just highlighting a single cycle the wave form ( at zero crossings ) duplicating the cycle between one and four times, and then stretching back out the end of that last region, effectively lengthening the word. If it needs more, I move over a few cycles and then do it again, rinse and repeat until it’s where I want. Shortening the words a bit trickier, I won’t take out more than one cycle at a time.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453853636844195902",
    "author": "oaklandmatt",
    "date": "2025-12-25",
    "content": "Copying your favorite songs is actually a great way to learn! I've done it a lot and continue to do it periodically, even after making records for like 25 years. \n\nThink of this like practice, not as how to make *your* music. Trying to make a note for note, sound for sound copy of a song you like forces you to make moves and choose sounds you otherwise wouldn't choose.\n\nBy practicing in this way, you accumulate skills that become part of your subconscious creative arsenal.\n\nAgain, at this early point in your journey, there really are no right and wrong ways to make things. The key is to just make as much stuff as you can, trying as many different methods as possible.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077714346882375851",
    "author": "BatMeckley",
    "date": "2023-02-21",
    "content": "I mean, at the risk of over simplifying what it is we do, just listen. If you’re getting too much consonant already, I certainly don’t recommend over hyping the consonant any further. 😂\n\nIt’s like “how do you know when to use the maag eq to boost the high?” Answer: when it doesn’t sound bright enough. \n\nThe other night I was at a table full of very very very good producers and mixers, and a discussion on the merits of Serban broke out, and there was talk about compression and limiting and making something sound like it comes out of fm radio already and how that effects the human nervous system and… and i was just like, I dunno man, I always thought that we went to Serban because he made sure you could understand the words. Lol. I think a lot of times as producers we can very quickly lose the forrest from the trees and fixate on the upper harmonic character of spectre at a certain oversampling level and it’s like yeah, but man, your song doesn’t have a bridge and the melody is forgettable. It’s like the people that put $10,000 spinner rims on a $700 ‘88 Nissan Maxima. Worry about the color and consistency of the icing once you’ve baked a kickass cake, not before. \n\n(I also know you’re not the target market for this advice cause you’re already killing it, this is more for the people reading through the discord.)",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099855972182278184",
    "author": "Nomograph Mastering",
    "date": "2023-04-23",
    "content": "I know I’m the RX is a hammer everything is a nail guy but using the “repair” function in spectral repair can smooth a transition between two things that don’t match really effectively. I use it to repair gnarly stuff in mixes all the time",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108921383926382673",
    "author": "Slow Hand",
    "date": "2023-05-18",
    "content": "Wow. I'm making my way slowly through this Lanois/Beato interview and am amazed by what Lanois is describing from @ 52:24 to 53:45 regarding his approach to stacking modulations and special effects.\n\nAs he describes it, he's performing and printing his modulation effects (delay, verb, vibrato, pitch shifting, etc) one generation at a time as he iterates through the song. This allows him to fine-tune and perform the modulations on each successive pass so that every moment is honed and responsive enough that it becomes a part within the music, and not just a blanket effects chain.\n\nSo if he's doing pitch-shifted delays, he'll do a pass that goes up a fifth on certain notes and then layer another pass that modulates by a different interval at a select moment instead of leaving everything on throughout the entire section. He's honing each effect in sequence. It shows a tremendous care and sensitivity to the music that he would go through and *perform* each layer with so much intention.\n\nThis feels like a revelation to me and I can't wait to practice this.\n\n(I've cued up the video where they start talking about it)\nhttps://www.youtube.com/watch?v=vxP9kKzbCFA&t=3144s",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210334836003184691",
    "author": "Skyler Young",
    "date": "2024-02-22",
    "content": "I was recording on an album and I heard a few tracks that a different bass player played on at the beginning of the session and the tone on his bass part was amazing so I asked the producer how he treated the bass to get that sound and he said he did nothing, it going through the same chain I was. And I was horrified cause my bass was sounding nowhere near as good and I knew the other player had the same type of bass. The only thing that could effect the sound was the tone knob and as soon as I moved it to around halfway it perfectly fit in the mix and sounded as good as the other bass player - has been the biggest key to getting a good sound in the studio",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1279232501918863483",
    "author": "chris_donlin",
    "date": "2024-08-30",
    "content": "Today I said something very simple and honestly think it solved most of the issue. We were getting some scratch vocals down and I suggested we use that as the scratch vocal time to experiment with how we want to capture it. I tend to overlook the importance of a good, intentional scratch, because you might get usable stuff. But then they can sit with it and tweak if need be. I think it’s fair to take responsibility for not pushing him harder for a more intentional scratch. It made the rest of our writing session today go much smoother and just more exciting. Appreciate everyone’s input. In good spirits!",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386529215381377105",
    "author": "cian riordan",
    "date": "2025-06-22",
    "content": "It works great with doubled vocals… a la Elliot smith vibe. If you have two vocals hard panned, goosing a bit of signal up the middle with a little distortion keeps the width but helps with diction and makes thing a little less sea sick if the performances are really moving from each other",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470792876400316578",
    "author": "NoahNeedleman",
    "date": "2026-02-10",
    "content": "These are great. \n\nWas mixing/finishing a song and realized I needed more weight on the sides when the chorus dropped, so added some diamonds on electric. When I mixed ‘em in, if I could hear ‘em they didn’t work; mixed ‘em low enough that they didn’t draw attention but when muted the song lost something important. \n\nTl;dr, sometimes the additions don’t need to draw the ear in order to be effective.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017137533022388254",
    "author": "samvalentine",
    "date": "2022-09-07",
    "content": "@BatMeckley nailed retune and classic... Flex tune allows you to hit notes that aren't allowed in the key; higher the value, more time you're allowed on that note before it'll snap you to a note in the key. I'll keep it pretty low usually but it all depends on the vocalist. I've never really fucked with natural vibrato. Humanize is nice. Let's longer sustained notes wobble a bit even at high retune speeds. Sometimes I'll really crank it, but it does take away from the autotune effect if that's what you're going for.\nOne other tip is I like to flip to advanced mode and set major/minor in the bottom section (leave top drop down in chromatic). This allows you to bypass or allow certain notes that aren't in the key. So if you wanna hit that flat seven now and then, bingo",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033439422181543956",
    "author": "gatewoodsensei",
    "date": "2022-10-22",
    "content": "Absolutely. I went from FL to Ableton and Logic (before Ableton got comping), then played with Bitwig, Cubase and a bunch of other DAWs and S1 by far is the most comprehensive. It’s like the developers sat back and said “I see what they’re doing but what if we made it more streamlined.” Not to turn this into the daw thread, but I’ll give you an example. In order to create a reverse reverb effect, I’d have to cut the part that i want to reverse, duplicate the track in a way that only copies the plugins, drag the cut audio down to the new track, add a reverb, reverse the audio, bounce in place, reverse again, and line it up. \n\nIn studio one, I can create a custom macro that adds all of those commands to one command in sequence and turn that one command into a button. Effectively turning what, like 8 steps, into one. And it does it in seconds.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1063142146384855040",
    "author": "sukhuno",
    "date": "2023-01-12",
    "content": "So basically what i did was i set up an ableton multisampler with all of my favourite linn drum sounds + some others that i liked (did this for snares and kicks) - so about 127 each. then i made 4 versions of that in an instrument rack and split them using multiband to only certain freq ranges (low, low mid, mid, high) - i think i used shaperbox for this. then i used an ableton random midi effect so it would trigger random samples in each of the 4 instrument racks... so you create a new sound from the seed sounds you choose. you get sounds that are in the linn drum ballpark but just a little different - which is the cool thing. https://we.tl/t-MxppdXPQlf here are some of the ones i liked (kicks, pitched snare, snares) that i made using this method",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150535682591293480",
    "author": "Slow Hand",
    "date": "2023-09-10",
    "content": "Yeah. I can certainly see that. I think a negative side effect of this contemporary value of \"struggle/grit\" that you describe is that we've ended up with a whole lot of contrived-sounding performances where the singer is belting or breaking up or singing with a feigned intensity. It's so common these days for songs to be maxed out with a nacho-cheese level of intensity. The emotional affect is turned up to a ten. Everything is maximally dramatic. This kind of grit/heaviness ends up being a shortcut to feelings of gravitas and after a while it can ring hollow once everyone has adopted that affect.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187936400646090782",
    "author": "Josh",
    "date": "2023-12-22",
    "content": "It’s a hard question to answer because you could play me a thousand tracks and I’d have a different answer every time. Sometimes I’ll even be time stretching words to make them longer or shorter. Sometimes I’m not touching anything. Depends on the context of the performance.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196608137105518713",
    "author": "popaganda.",
    "date": "2024-01-15",
    "content": "You’ll make more interesting music by finding creative cheats to get to the vibe you’re going for",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336803114065592452",
    "author": "BatMeckley",
    "date": "2025-02-05",
    "content": "These are two different things.\nIf you are doing meticulous need to be unbothered nerd shit, it’s great to have someone to keep the artist entertained. \n\nI would lose my mind, and my intern, if they kept interrupting a creative flow to yap. \n\nAgain, (again again again), this business is 20% understanding gear, and 80% understanding people. You have to know your artists. Often, id even argue more often than not, it’s the fuckery and the messing around that often inspires the best ideas. We tend to be very bad at being creative with a gun to our head. As a producer, I’m trying to foster that safety and relaxation, while taking a Birds Eye view of the conversation listening for anything that I can go “wait! THAT was a lyric” or a riff or whatever. That’s always worked much better than me staring at someone going “hush. Write.”\n\nOccasionally, like the old Peter Gabriel SO story, you have to lock the artist in the room and tell them they can’t come out until they’re done. But most of the time that just gets the job done, rather than the job done well.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337201984863862894",
    "author": "Rollmottle",
    "date": "2025-02-06",
    "content": "Some of my most creative thinking and best ideas come during wildly unfocused time. The same principle as passive listening -- you hear something totally different and it might be revealing in a way you can't access while actively listening. I think it's dangerous to try and impose rules around how somebody is most creatively fertile. It's different for everybody and may manifest in ways that aren't how they manifest for you. It's important to recognize whether it's truly them or is it actually you. You could certainly propose trying different approaches together to see what that sparks (more like Oblique Strategies), but best to be clear on what's driving what you're feeling lest you inadvertently kill the vibe or shut down a path.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337223093785067720",
    "author": "bobby k",
    "date": "2025-02-06",
    "content": "Im by no means articulating anything against divergent thinking in fact it is the backbone of all art & creative problem solving, the mark of genius like ruairi was saying. \n\nPerhaps my original question has more to do with highlighting a lack of motivation or investment in the present moment, one that can so often stem from phone addiction? And banning phones or blocking reception is just kind of intense… \n\nA headspace I try to inject in myself is to pretend that any time I’m in a moment, it’s the last time I’ll ever get to do that thing. Whether it’s making a record or cooking a meal or sitting in traffic or having a beer with all of my favorite local discord friends tomorrow night.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1398818700068655174",
    "author": "cian riordan",
    "date": "2025-07-26",
    "content": "But be wary of getting too spread-sheety. If you’re feeling creative, stay in that zone. If you’re not, dip into a track that needs editing or cleaning up. Hard to force the brain to be musical.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1420862391868063744",
    "author": "Zach Hughes",
    "date": "2025-09-25",
    "content": "I've been melodyning vocals for a ten song album past couple weeks and feel like I've leveled up my chops significantly. I'm no Beckley, but browsing whats been previously shared here and trial and error has been the mechanism of growth for me.\n\nI kinda had the note separation tool workflow down from work in other programs. I've been experimenting with the time tool and attack speed tool as well as formant shifting to mask when the tuning becomes more audible than I'd like. That's probably where I'd pinpoint the level up for me personally. That and trying to be more conscious about not relying too much on the graphical UI. Unless it's something that really calls for hard tuning I lean towards wanting it to feel invisible / natural. Im realizing more what parts of the note actually need to be more 'on' and which can be more 'off' or just left alone. That and letting notes naturally drift to become more sharp as they tail off. If I'm too heavy handed it starts to feel lifeless to me. I'm also appreciating more the nuance of how one might approach different genres or styles with melodyne. Its humbling how powerful the program really is.\n\nThere've been a few moments with the attack speed tool that have felt like magic curing some subtleties of the performances that bug me, but I don't feel super confident that I have a grasp on that one yet. I've been working in standalone and importing a REF mix. For some reason I feel more confident dealing with esses in protools with RX or clip gain than I do melodyne idk why. Some frustrations have been flipping back and forth between tracks when tuning multiple files feels real clunky. I might be missing something about how best to do that. I wish, like with RX monitor, you could hear the vocal through your mix chain when tuning (is that possible?). Being able to rename exported files would be nice too like in RX.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "970793735489224774",
    "author": "Slow Hand",
    "date": "2022-05-02",
    "content": "Usually doing it by hand is the way to go, in my experience. But I’ve found that Izotope’s *Stutter Edit 2* is *very* powerful and works great. It’s got a bit of a learning curve to get used to, but if you’re trying to do stutters across the entire mix buss it might be the best way to go, so that you don’t have to render your entire mix to audio beforehand.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032045921904631808",
    "author": "cian riordan",
    "date": "2022-10-18",
    "content": "If I'm recording musicians with real instruments, they're a must. Hardware units are much easier to interface with the console, to audition stuff quickly, to capture & distort. They become more of an instrument in this context.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062044605677326386",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "In the creative mindset I like the pressure relief of not being in the studio. The studio makes me technical and analytical. A living room in a wooden cottage on a beach 100miles from the city gets my juices flowing",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103332566234300506",
    "author": "Bryan DiMaio",
    "date": "2023-05-03",
    "content": "That's a lot of the reason why Terrace's stuff has so much of a vibe, he gets a lot of musicians together and sometimes we'll chop stuff around but always keep the context set. It's so live, even the 808 drum kit on Drones was an electric kit hooked up to an 808 machine lmao",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169707433141207050",
    "author": "Nomograph Mastering",
    "date": "2023-11-02",
    "content": "Assuming we all agree that we must be nice to each other going forward, will we be limited in some way? Creatively, societally, culturally",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1170158967574511616",
    "author": "Deleted User",
    "date": "2023-11-03",
    "content": "I had this one particular vocal session where I was fucking up and all my comments were messing with the artist’s flow. So about an hour or two into the session, I got real with the artist and said “I feel like I’m being too much of a control-freak and my comments seem to be distracting you. Why don’t we take a break? When we come back, let’s forget about everything I mentioned earlier and see how things come out when you express freely. I have a feeling that it’s gonna turn out way better. I’m sorry, I think I got it your way” \n\nthen after the break, the artist started nailing the takes. Not in the exact way I imagined, but in the best possible way that we were capable of THAT DAY. \n\nSince then, I decided to let go of control a bit more and let the artists do their thing as much as I can. I started developing ears for hearing what artists can work on before the session to get a better recording to my best of ability (if I get to know them before the sesh). I would only mention the simple things that can be improved with small adjustments short-term. That way the session can be more experimental and wild as opposed to fault-finding.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189634281845293126",
    "author": "cian riordan",
    "date": "2023-12-27",
    "content": "There’s so many answers to this question but I guess my main contribution would be to ensure you’re doing lots of processing to the reverb after the fact to make it interesting. Distortion, compression, Eq, delays before/after, flanger/phaser, stereoizer. If I’m tweaking reverb in the production phase, I’m going ham on it to make sound like something interesting. Otherwise it’s just clutter.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1231003352637243473",
    "author": "Zach Hughes",
    "date": "2024-04-19",
    "content": "I can't take credit for this framework (might have actually been in a conversations pod ep) but something I've adopted in my own production practice is the idea of convergence and divergence. If you are trying to converge on final guitar takes while your client is wanting to diverge and explore new creative ideas, then might be worth explicitly communicating 'this is where we're at and here's what we need to get done today' as lead producer before you begin tracking just so everyone knows. I'd be wary of stifling the exploration / play of your client, but maybe you could have them channel that into a notebook or voice memo in the back of the studio and you could schedule a time with the sole purpose of fucking around and exploring / playing with new ideas. Really just wanna make sure everyone knows when you're in 'convergence mode' and when you're in 'divergence mode' to avoid that frustration.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258190900753072250",
    "author": "BatMeckley",
    "date": "2024-07-03",
    "content": "Yup, but also, depends how you’re tracking the distorted chord. Certain modelers and even pedals (h90) have a significant amount of latency. (If we’re getting nerdy about it). So if you’re splitting the signal, make sure to account for that.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280990286977175642",
    "author": "BatMeckley",
    "date": "2024-09-04",
    "content": "It’s been my experience that the directors usually have no clue what they actually want. I had another brief where they wanted “super modern” “hits of today” where they’d ref’d a dua lipa song, gave them something that was so close it probably wouldn’t have cleared copyright, then they said “no, more like this” and gave me a song that was 8 years old (that i actually had the stems for) , used THE ACTUAL stems and they were like “we can’t use it those stomps sound like gunshots” when it was the EXACT TRACK that they’d ask me to reference. \n\nThe corporate hustle is learning how to interpret what they say they want with what they actually mean is how they want it to feel, and then being prepared to have it go through a dozen not musician hands, with each person having to give notes to justify their job. It pays well but it is about the farthest thing from “being creative and making music” as it gets.\n\nThey are almost never on the bleeding edge of what’s cool, and that’s fine, you just need to go in knowing that.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331710072488726661",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-01-22",
    "content": "has anyone else experienced the reverse Bruce-Swedien/MJ-Billie Jean story? Like when Quincy came in and asked them to play Mix 2 after they had mixed it 90 times? \n\nI just hit mix 30 on a song I've been working on with an artist for over a year and this is finally the one where both of us were like \"yep, this is it\" and sent it to mastering without even second guessing it. \n\nI almost didn't do this mix bc I thought my ears are too fatigued/used to the song but I'm rly glad I did in the end. I hear a lot of talk about \"art isn't finished, it's only abandoned\" but I feel sometimes it pays to put in the extra mile and not be satisfied until everyone's happy",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337073363193167983",
    "author": "chris_donlin",
    "date": "2025-02-06",
    "content": "This is a little bit of a different take but I strongly believe focus would stay in the room if people didn’t have Instagram/tik tok on their phones or at least had the discipline to not check it every single moment they get. Brings in the topic of actual ADHD vs bad habits and addictions. It drives up a fucking wall when  working on a track for someone and I say, “what do you think about that” and they go “uhh can you play it again” every single time. I think filling the in moments with your phone is the worst possible thing for a creative brain. Being creative is a practice and a muscle that needs exercising. I’ve been trying to get artists more involved during the process so they have something to keep them occupied. And if they don’t play instruments, I have sketch books and markers I encourage them to use. I understand many creatives have ADHD, I don’t want to excuse that if it’s genuinely detrimental for you, but bad habits are bad habits too",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407182938105188428",
    "author": "Slow Hand",
    "date": "2025-08-18",
    "content": "There's no right way to go about sound selection, but ultimately you have to use your intuition and taste to judge if they're right for the record you're making. If the sounds don't seem to fit, then perhaps you need to ask yourself what effect it is that you're going for in the first place. Why are you trying to put *those* two sounds together? Decide if they get you close to that goal. If not, then simply find another sound. Not everything needs to work.\n\nA lot of it comes down to intention and conviction. \"Wrong\" notes or sounds that are dramatically different can still be pulled off if you play them with confidence and panache. Records are full of sonic choices that stick out like a sore thumb, and we can make them sound coherent with conviction. What might sound abrasive and weird at first can easily become habituated and familiar with enough exposure.\n\nI think almost any combination is valid. There are sound choices that are conventional and there are choices that go against the grain. Every unconventional choice is an opportunity to create a new genre or to create a new mood. It can be a matter of mindset. If you can free yourself from the need to do the \"right\" thing then the creativity to play with unusual combinations will come a lot easier.\n\nOf course, this is all hard to discuss without hearing examples. If you can give us more examples of what you're dealing with perhaps we can be more specific.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1432614737279189003",
    "author": "oaklandmatt",
    "date": "2025-10-27",
    "content": "I will say I don't think it's all about their vision or when they want to pivot. It's a bit more nuanced. \n\nIf you are truly a producer collaborator (as opposed to a hired gun engineer or musician), it's about trying all the ideas and collectively deciding what's best. But remember YOU are the one who holds the keys to the execution of the artist's ideas. You can have ideas and try them yourself, but if the artist has ideas, it's still YOU that has to execute them (because presumably they're not a producer like you). \n\nSo you're actually building a big creative trust by helping the artist try stuff. If you can execute ideas that the artist can't quite articulate or do themselves, you gain a credibility where you can both listen and then say \"Ah, I see what you mean. I think this other version is best.\"",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941768896900395028",
    "author": "Jeremy Klein",
    "date": "2022-02-11",
    "content": "i love blending splice percussion loops that have a lot of natural variation into my programmed drum parts. just chop them to fit your rhythms but try to use every part of the loop (i.e don’t just take one snare from the loop and paste it everywhere)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "967300151444123698",
    "author": "NoahNeedleman",
    "date": "2022-04-22",
    "content": "GREAT QUESTION. Creative Subdivisions are so important. Wide/high filtered ping-pong delays are a go to for me sometimes- also cool to do this with pitched instruments: take an electric guitar or even an acoustic, double track a syncopated ostinato and filter that? Idk I’m looking forward to hearing other ideas too.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "968192285290397706",
    "author": "Deleted User",
    "date": "2022-04-25",
    "content": "for toppers i like going to\n\n808 toms, hitting random objects with sticks or knocks on surfaces, short loop of vinyl crackle or any sort of rustling/scrambiling somewhat quantized to have a rhythm, mangling with found sound (this may or may not work cause they have such strong characters and very particular mid-high frequency content), timbale fills, congas and bongos, or any random noises into distortion (to just bring out every bit of low level stuff) going through gated filter sidechained from a drum loop (it can be the main drums or any other random rhythmic thing to key the filter envelope)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051735608571203594",
    "author": "Zach Hughes",
    "date": "2022-12-11",
    "content": "This makes me wonder about what are some different ways to ‘stress test’ a song. Also I do think that part of being a producer is learning to live in and persevere through those spans when the vision isn’t perfectly clear. At least for me it’s rare when all the pieces of the puzzle are determined in my brain ahead of time. Sometimes I need to hear a drummer thwack some stuff and then it all seems to click a little better. Heard an analogy from a book called Creative Inc, kinda a bio about the founder of Pixar, and he likened working on a film to driving through a long tunnel. When you’re in the middle and you can’t see the light from the entrance or exit there’s an element of trusting in the process there but also living with uncertainty.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053763659152752670",
    "author": "NoahNeedleman",
    "date": "2022-12-17",
    "content": "I’ll add something a little off the beaten path here. There’s a library called Indie from NI that’s kind of a pain in the ass to use, but has VERY real sections performing phrases. \nI’ve found a fair amount of the time I can use some of their phrases to better effect than programmed parts, as long as I don’t need specific Melodies. It’s worth looking at",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061779460245946390",
    "author": "1ggy",
    "date": "2023-01-08",
    "content": "Just chop up the LWMR collab track and you have it lol",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062045389806649444",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "I have a session coming up in a week or two(still working on the date😅) where I’m going in on a production weekend(3-4ishdays) with two artist who are doing their first project together. A weekend with no studio, just fishing, chess, good food, bad stories, probably a rolled up plant, and some creative music making. Then when we get back after a few days the studio is there to start cleaning up the creative mess",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087102540505698344",
    "author": "Slow Hand",
    "date": "2023-03-19",
    "content": "Any polyphonic subtractive synth should be able to get you there. There's nothing so unique about the sound that you'd need a specific synth model. The characteristic sound of this patch is a saturated LPF with an ADSR filter sweep. It may actually be a monophonic synth with a second oscillator tuned to +7 and blended in at a lower volume. It doesn't sound like they're playing chords, so much as stacked oscillators.\n\nAs others mentioned, a Prophet is a good place to start, but it's not going to get you that heavy-grit saturation by itself that we hear on this record. Prophets don't get that dirty on their own. Maybe the Prophet X's with DSP effects will. I haven't used them.\n\nSomething like a Moog synth is going to lean heavier into the saturation capabilities. That record feels much more like a Moog filter. A Moog Matriarch is the first thing I'd reach for if it were available to use.\n\nThat said, you've probably got enough saturation boxes lying around that you can approximate that grit. But it's a very Moog-y saturation sound.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095835105697738783",
    "author": "Nomograph Mastering",
    "date": "2023-04-12",
    "content": "I care the mostest, but I need to use that energy where it can be effective",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102685105715150888",
    "author": "Deleted User",
    "date": "2023-05-01",
    "content": "print the synth (if it’s a soft synth) and then chop the clip you want for a throw and put it on an audio track. I find this works better for throws than sends.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138383806735339520",
    "author": "Nomograph Mastering",
    "date": "2023-08-08",
    "content": "A signal that didn’t need dither gets imperceptibly noisier if you dither, a signal that did need dither gets distorted (in a way you cannot reverse) if you don’t dither",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155906847509839963",
    "author": "LAPhill",
    "date": "2023-09-25",
    "content": "Hey man, nice effort on this! The sounds themselves here seem like they're be really useful. Loading it up for the first time today and will follow up with any additional thoughts, but right off the bat - you've GOT to make those parameters MIDI assignable. I have a big pet peeve for VSTs that don't map expression (cc11) to volume  by default, but beyond that, vibrato and the ADSR seem like no-brainers to be able to assign to a CC.\n\nI love the reverse function, I can tell that'll be really useful. \n\nI'd be surprised if @Rollmottle didn't mention this, but it's very odd to me that Saturation is controlled by dragging that little flame icon when everything else is much more straightforward. \n\nLast thought for now - when you get ready to release this, put your best patch as the default. You want people to load this up and be inspired and interested in diving into what it can do. Most people can't get away with the ear-splitting default patch from Omnisphere, and why would you want to anyway?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194297860896862250",
    "author": "NoahNeedleman",
    "date": "2024-01-09",
    "content": "I mean… I said it all like I know exactly what I’m talking about. But it’s just my best guess. Chorus effect emulates a 12 string vibe but 12 string kinda does its own thing. I’ve gone for sounds like that by stacking a high strung with a standard guitar. \n\nI have 2 12 strings- a 1972 Martin and a 1982 epiphone. I took all the low strings off the epiphone and it’s a GREAT instrument for stacking strums.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244822001592569958",
    "author": "Eric Martin",
    "date": "2024-05-27",
    "content": "Waves - Abbey Road Saturator actually really good, Waves Berzerk is also incredible for intense distortion",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247496047324958720",
    "author": "SoundsLikeJoe",
    "date": "2024-06-04",
    "content": "Have produced a couple albums this last year off click. They just feel better to me...  the way the energy swells the tempo slightly is a great sound effect. I've also been recording more classical and folk musicians, and the experience of letting the players emote and push tempo...  I think I just like it more. It's something that happened in older music more often... but its a feature not a bug.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1252710422474264616",
    "author": "ehutton21",
    "date": "2024-06-18",
    "content": "Whoever swore by trying the reverb ahead of the delay on a vocal effect, I just want to thank you for your service",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1279127623540412498",
    "author": "Chris Lyon",
    "date": "2024-08-30",
    "content": "How much time are you guys spending cutting the vocals the first time? I would just recognize this pattern and make the first day about getting takes fast, experimenting but not overthinking. Don’t edit too much. Let them sit with it with fresh ears since that’s part of their process. Save the editing and detail work until after you have the performance you both love.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285675447643803830",
    "author": "EliHeathMusic",
    "date": "2024-09-17",
    "content": "Just listened through the new Dora Jar album and there's a lot of cool songs/productions. Anyone have any idea of how to get the effect at 1:45 in this song? https://open.spotify.com/track/2qw9g6qA71qONmR1VbQqle?si=473fd099324b499e",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1314013843810160682",
    "author": "Ross Fortune",
    "date": "2024-12-04",
    "content": "Dug deep into Help Me Rhonda by the beach boys which was loads of fun (Carole Kaye bass, trying to get the feel of the ska type upstrokes on guitar was way tougher than I expected), biggest takeaway was how effective the big tempo fluctuations were. I’ve used tempo as a technique a bunch more since then. Noticed some similar stuff in Vampire by Olivia Rodrigo.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353173956059856928",
    "author": "Slow Hand",
    "date": "2025-03-22",
    "content": "Oh man. The included sample libraries sound *good* too. There's an 808 sampled kit that they included which is killer. You'd think that people can't improve on the sound of an old-fashioned 808 kit after all these years, but the samples sound great!\n\nI've got one song where I never quite got the 808 clap sound I wanted. Two days ago I booted up Serum 2... and there it was. So I resampled the clap, flew it into the existing session and now I'm done! This thing is paying off already 😄.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386528954592002068",
    "author": "cian riordan",
    "date": "2025-06-22",
    "content": "It’s usually mono distortion… just a mono send with a sans amp spicing it up a bit. Just enough grit to differentiate the signal, still give that perception of width with that panning, but sortof forcing a different phase perspective on it. It’s usually with things that have low end and low mid information. You exaggerate the high end stuff on the side pan and then anchor the low/low mids in the center.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404622497256706119",
    "author": "Slow Hand",
    "date": "2025-08-11",
    "content": "If you know your way around a synthesizer, Massive X and Serum 2 are both heavy hitters that cover all of my bases. \n\nSonically, Massive X has a \"warmer\" voicing and has all of NI's amazing effect algorithms built into it. Everything sounds incredible and is dripping with character. It's absurdly capable, but the interface may be overwhelming at first. It can be a lot to get oriented on. It's impossible for this thing to sound \"cold\". The preset library is less bass music/EDM and more balanced. NI offers a lot of genre-themed expansions. If you like programming sequenced/heavily automated one-button patches Massive X is king.\n\nSerum is on the \"cold\" side, but just as capable of \"warmer\" sounds. The sonics and DSP are clear as a bell. Stellar. It's more intuitive to program and the feature set is an embarrassment of riches. It's absurd how much functionality Steve and team crammed into it. Absolutely absurd. If you want to do EDM and bass music, it's the king and it's preset library leans towards that. I still cannot believe that they *gave* it away to Serum 1 users.\n\nBoth excel at cinematic and over the top. If you're looking for the \"classic\" sound, I'd lean Massive X.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407740479457722449",
    "author": "Zakhiggins",
    "date": "2025-08-20",
    "content": "Im pretty much always messing with the length of kick, snare and hat trying to get them to fit in the grove better, you can make some unlikely pairs work when you do this.\n\nAlso always messing with the order in which transients are hitting on downbeats, nudging certain drums slightly before or after others can make things mesh together real nice. Typically the higher pitched/attacky things like hi hats come earlier than the sub kicks for example but experiment with it and see what sounds good. A song where this is really obvious is say it right by nelly furtado, listen to the way the layers are stacked on the downbeats of the chorus. Side note, when you're doing this, think of everything with a transient on that downbeat as a percussion instrument.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410008315093581905",
    "author": "chris_donlin",
    "date": "2025-08-26",
    "content": "The pedal idea is fun. I have some creative books like \"Steal Like an Artist\" and a big sketch book with markers/oil pastels for people to pick up instead of just chilling on their phones. The sketch book gets used more than i expected. I also have a yo-yo that people fucking love to play with hahah. Making music got way more fun for me when i realized the studio is just a playground for adults",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441472070486593599",
    "author": "oaklandmatt",
    "date": "2025-11-21",
    "content": "Definitely viable for excellent art!\n\nI would guess (though I'm not 100% sure) that neither are using flex pitch to kind of transparent pitch correction that vocal producers do. They both use it as a creative tool and aren't worried about (or perhaps even desire) the unnatural artifacts.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957455128233930823",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "As a counterpoint to this idea, what you often see in many styles of electronic or 20th century classical music is that the arranging can, in fact, be an integral part of the composition and it doesn't have much of a \"song\" to speak of. In this case the arrangement and the song cannot be teased apart, because the overall musical effect is defined by and dependent on the unique qualities of the arrangement. Something like this: https://www.youtube.com/watch?v=wmrsud1PpRk",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "961417058212515850",
    "author": "ALXCPH",
    "date": "2022-04-06",
    "content": "i find in hiphop it can sometimes be quite cool, if allowed, to just insert a bleep, just poke fun at a word being censored as the listener will most probably still know what the word was, and it will almost make the effect of the word stronger. doesnt always work, but when it does i think its kinda cool 🙂",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "970792990186549278",
    "author": "oaklandmatt",
    "date": "2022-05-02",
    "content": "https://en.m.wikipedia.org/wiki/Stutter_edit",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "971615993061335070",
    "author": "jantrit",
    "date": "2022-05-04",
    "content": "Tottally get it! The new one is a little better in that respect, they streamlined the flow a lot. Also I’ve been doing a lot of stuff just using as an effects processor, tapped into a send from the console or protools. The stutter and other chop effects are super powerful and they can be utilised just as you said! It’s instant and can be recorded back on another audio track",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987472849965043732",
    "author": "ehutton21",
    "date": "2022-06-17",
    "content": "Whenever I get left field projects, I always talk with the artist about what they ideally want and then I kind of just try a couple versions where I’m doing big changes. \n\nIf it’s poorly recorded, I’ve found success on finding a deliberate style for the one “poor sounding” element in a song—be it vocals, drums etc and then stylizing the elements around them. If the drums sound meh, blow em up—make ‘em loud, distort, double/warp, chop.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987475076213538867",
    "author": "ehutton21",
    "date": "2022-06-17",
    "content": "Yes. Don’t let yourself hide them. I’d also say if the drums sound bad, that can also be a side effect of having everything else in the mix fitting one aesthetic or overall vision, and then having another that just doesn’t mesh. So turning the drums up might help you say, tap into a lofi element you didn’t know was there previously but that might sound great on the record",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998795813306236938",
    "author": "cian riordan",
    "date": "2022-07-18",
    "content": "Anyway you shake it, live bass is warfare. So much is specific to the part, the kind of playing, the recording quality, DI vs no DI, phasing of multiple sources, etc. Once you crack the code on that, I usually find a good amount of compression to control the lumpiness and some form of parallel distortion (Sans-Amp is my go to) with whatever EQ needed to keep that motherfucker inline.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1026970790375206992",
    "author": "wilhelmjosephk",
    "date": "2022-10-04",
    "content": "I love this sound and a lot of the other stuff that Jockstrap's come up with, and while this is a bit of a non-answer, I think the key is that these sounds are easier to arrive at than they are to aim for. I think a lot of what Taylor Skye is doing is taking sounds and then warping them/distorting them to shit using all of the \"wrong\" methods, and then just judging what comes out and deciding if it should be kept. I think there's a good hint of this in the lead sound at the start, where it's really out of rhythm and grainy, some notes seem to sort of \"break\" which reminds me of the results you get when you try to formant shift a verbed-out or polyphonic sound with little alterboy, or even abusing izotope RX on something that doesn't really need it (also, the RX de-reverb can do wild things to a sound you've put reverb on higher in the chain). Logic, which is what he uses, also has a lesser known formant shift that you can only get to by turning on flex pitch then adjusting in the side info bar, which can really take sounds into space. I haven't done this with melodyne, but I imagine there are some similar features.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040339199225770024",
    "author": "ehutton21",
    "date": "2022-11-10",
    "content": "Suffice it to say colorism is a frequent and effective weapon of colonialism, and its later consequence, imperialism.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055174557222314084",
    "author": "Slow Hand",
    "date": "2022-12-21",
    "content": "Yup! Massive was my go-to for years prior to Massive X.\n\nThe biggest change for me is that the raw oscillators sound far better. The original Massive had a lot of aliasing that could make it sound hazy and flat. Switching over to Massive X it is crystal clear and even buzzy saw waves feel warm, pure, and tactile.\n\nIt has extremely flexible modulation capabilities that I find to be very musical as well as some very comprehensive ADSHR envelopes. It also has four different keyboard tracking curves that you can assign and tweak, which is very important when fine-tuning your patch to make sure that it sounds even across the entire range of keys.\n\nIt has a lot of musical sounding filters that can inject a ton of vibe, or be completely neutral. The *noise* section is robust and very flexible. I use it a lot.\n\nFinally, it has a great-sounding set of internal effects (delay, chorus, saturation, verb, etc) that can be placed anywhere inside of the routing diagram. It's always a bummer when the on-board effects aren't very inspiring. But NI has a strong catalog of well-designed dsp to draw on and integrate into their products, so it's turned out great.\n\nOverall, it's a very robust and well-rounded synthesizer that also does a lot of things extremely well. It can be super clean (like Serum) but also get very dirty, which I appreciate in a synth.\n\nThe only thing I don't like is that the preset browser kind of sucks. I prefer the original Massive's browser. NI is well aware and they have been overhauling it and slowly adding new features, so I trust in time this will be made better.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062040266523025440",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "Man I don’t believe in this not using loops is better nonsense. To me it feels like playing chess but not using your pawn. \n\nAs producers we don’t get hired for our sounds any more. Everyone has access to everything at this point. We are much more curators of sounds and taste makers. All the biggest producers are using them in one form or another. Doesn’t have to be drag and drop, lots of creative ways to use them. But pre-made loops is still just a tool in the arsenal.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073224566920450119",
    "author": "Will Melones",
    "date": "2023-02-09",
    "content": "Only for effect and not for square waves. But do NOT pay $399 for it. Last week you could buy all the PA plugins for that. Next week it’ll be $25 with a $25 voucher or something. If anything, subscribe to the bundle at $99 and get it for free.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077720540321681480",
    "author": "NoahNeedleman",
    "date": "2023-02-21",
    "content": "It’s worth noting that some  compressors/compression techniques actually bring out constants, adding to the intelligibility not detracting from it. Things like eq’ing, de-essing, and saturating can become detrimental much quicker. \n\nSo choose your tools based on what the vocal calls for and all, but thinking about what’s needed from the vocal effects the very first plug-in you choose… the hard part is remembering that.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1115341894109634570",
    "author": "conor // wbotm",
    "date": "2023-06-05",
    "content": "me and a buddy figured a very scuff version out years ago with very few tools... created a big audio rack in ableton with a channel for each note in the scale across 2 octaves, each channel had an autotune instance (or graillon 2 in our broke case) hard tuned to a single note and a gate that was sidechained to the corresponding note on a MIDI track. The MIDI track was just a plain sine wave synth, but you could also get some cool gated effects by using different inputs",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150533161596489869",
    "author": "LAPhill",
    "date": "2023-09-10",
    "content": "Oooh I have a theory here, about cultural values. Audiences in the 1800s, for instance, could go to a symphonic concert and recognize sonata form, key centers, etc. There was an appreciation for the form of the music and the virtuosity of the player first and foremost. Acknowledgement of skill. Making things seem effortless was the ideal.\n\nContemporary listeners seem to connect more with the struggle. They want to hear the grit in the vocal, the player at the edge of their ability (whatever it may be) holding on for dear life. The mix at the edge of distortion. In that breaking point, there is a lot of beauty and emotion that would have traditionally been considered bad form. Uncouth, even!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155587694274035813",
    "author": "Skyler Young",
    "date": "2023-09-24",
    "content": "With analog synths I almost always record 2 mono takes and pan each left and right and the small timing difference in performance make it wide and more intresting imo- this has a doubler effect which humanizes the timing on one side for every note and plays a different sample which gives the same effect and saves time from having to do multiple takes",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1176330354072756365",
    "author": "sethearnest",
    "date": "2023-11-20",
    "content": "Yeah that part’s coolness is 98% the performance and arrangement’s contrast. \n\nProduction wise, sounds like a lot of heavily pre-delayed verb and some long stereo delays swirly-twirling around the vocal, plus the double (mono double) and harms dipping in and out. The long pre-delay and tight double will be key to get that super-intimate-but-still-swirly feeling. \n\nBut yeah as you alluded to, the feeling of that part is so dope b/c of 1) the whispery performance itself and 2) the contrast of the bottom falling out from the previous section. Very effective.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182116999434862705",
    "author": "peterlabberton",
    "date": "2023-12-06",
    "content": "This is a straight up @cian riordan move (as far as I know), but send it to a mono aux with distortion on it—sansamp or decapitator—and blend that in to anchor it in the middle",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197075888018309221",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "The old reverse reverb on a long cymbal splash into the same cymbal splash reverb the right way round on the downbeat makes a nice riser / downer",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203345701451337798",
    "author": "Eric Martin",
    "date": "2024-02-03",
    "content": "I’ve been full kit all the mics lately, including HiHat and Ride mics, two sets of rooms. I’m bougie about processing drums with distortion on the way in",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209062551988731944",
    "author": "Deleted User",
    "date": "2024-02-19",
    "content": "Learn what different carrier to modulator ratios sound like by messing with them only using sine waves.  and then feel out what it feels like feedback carrier and/or the modulator. And then you can introduce envelopes to create shapes with them. \n\nTool wise- I would start with FM8, it’s pretty much DX7 but without the limitations of routing configuration like it does in Arturia DX7. And then you can learn with arturia DX7 in conjunction with how the different configuration work. +FM8 has patch morphing function which can be VERY useful when it comes to FM sounds. Another cool thing about FM8 is that it shows you all of the sidebands. \n\nFrom here, it’s all experimentation\n\nThat’s really all you need, FM looks intimidating but it’s really not that difficult. \n\n\nlinear FM is essentially really fast vibrato. Non linear FM is a fast trill between the two frequencies. AM is essentially fast *unipolar* tremolo, RM is fast *bipolar: meaning it shifts polarity too* tremolo. they all create sonic characters by creating sidebands. \n\none thing to keep in mind is most FM synths are actually not FM. it’s actually imitated by doing phase modulation- but results are almost identical. except in actual FM, you get more of the carrier frequency. So FM with a high-pass filtered modulator is essentially the same as PM with a low pass filtered modulator\n\n\nrun down on difference in sidebands between the most common audio-rate modulated synthesis:\n\nFM/PM creates equally spaced sidebands\n\nRM only produces sidebands (carrier frequency + modulator frequency & carrier frequency- modulator frequency)\n\nAM is carrier with side bands of c+m and c-m",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222354079360090133",
    "author": "NoahNeedleman",
    "date": "2024-03-26",
    "content": "Way to keep it fun and creative. Caring about the things that matter and making room for them without stealing the joy. That’s everything.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1236428305863803000",
    "author": "Adam Thein",
    "date": "2024-05-04",
    "content": "I was able to whip it up on the Prophet 6 also - I used the sawtooth wave, very slight detune, unison mode, full sustain on the Amp envelope, no filter envelope, tuned the LP/HP filters, touch of chorus/verb and touch of distortion to darken the tone, slight LFO slow to both oscs for the slight wow effect, touch of glide - I used 3 voices on unison with a bit of slop for a bit of extra chorusing",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237787320091021324",
    "author": "LAPhill",
    "date": "2024-05-08",
    "content": "That said, legato is way less important than any internet forum would have you believe. Players spend their lives working to hide their transitions between notes and make them as smooth as possible. You rarely want to hear the portamento between notes unless it's for special effect.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255928969153478688",
    "author": "oaklandmatt",
    "date": "2024-06-27",
    "content": "Also, I highly recommend when vocal producing that every have a fun distortion/ tune/ delay throw option for the singer to do some creative ad libs after tracking all the important stuff. Especially for songs outside of the genre of the usual tune/distortion hip hop thing.\n\n@BatMeckley have we ever talked about this? I always do this when I'm cutting vocals and it always yields interesting results.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277698599572213821",
    "author": "Tyler Graham",
    "date": "2024-08-26",
    "content": "I’m still using the AIR effects bundle, another great utility stock-ish bundle",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284338455341695037",
    "author": "BatMeckley",
    "date": "2024-09-13",
    "content": "There’s two things going on here… one is the natural rub of harmonics that normally occur no matter the instrument, but there’s something specific that happens when you do chords like that pre-distortion, meaning the way an amp (or pedal) distorts that rub willl usually be different sounding than if you hit those notes on individual takes and THEN blended them together. I’d give that a shot (the aforementioned mutt lang one note at a time chord theory, which supposedly has been overblown, though I’ve heard guys like MUSE have explored it later on) before you go too haywire looking at dramatic eq moves or what not.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310927276673728552",
    "author": "Chad Rodgers",
    "date": "2024-11-26",
    "content": "One of my go-to crashes is a vocal chop taken from the song itself (usually a particular note – or pitched as I need it) whacked through Valhalla Room for a sheeny, clean sort of thing. OR I'll just grab a nearby mic – not precious – and scream or yell something into it. That'll then get thrown through Decapitator on punish for the right kind of saturation appropriate to the track. This works quite well for me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315229223069159424",
    "author": "Slow Hand",
    "date": "2024-12-08",
    "content": "*Massive X* came out a few years ago and immediately became my main workhorse/swiss army synth.\n\nIt's extremely well rounded, deep, flexible, sounds *impeccable*, and has a wealth of well curated NI effects built in that make it a one-stop shop.\n\nIt's probably overkill for most people and I'm nowhere near close to squeezing all of the juice that it has to offer. But it's so comprehensive that I immediately stopped using 80% of my synths. At this point the only other synth I use is NI *Razor*, which is it's own distinct animal.\n\nI could spend the rest of my life learning to master *Massive X*, and I feel confident that it's a worthy pursuit. It's allowed me to focus on mastering a single instrument. I've stopped being 20% good at several synths and am now deeply familiar with a single tool. I'm very pleased with it.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334322947069968495",
    "author": "Felix Byrne",
    "date": "2025-01-29",
    "content": "this just made me think of something i'll do on planes\n\nlisten thru to songs and do super super granular notes app breakdowns on everything that's happening at any point\n\nINTRO 8 Bars - first filtered sine synth pad comes in playing block chords, subtle seagull sounds in background, 4 bars in a bright distorted synth lead motif appears with tails running into next section\nVRS 1 16 Bars - same synth pad, but even more filtered etc etc etc\n\nkinda helps show what all is going on arrangement wise and how it changes or doesn't",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341058778136838174",
    "author": "cian riordan",
    "date": "2025-02-17",
    "content": "John Vanderslice’s Emerald City is interesting in that he did all the guitars with acoustics but they’re often heavy and distorted.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342979194686148709",
    "author": "Slow Hand",
    "date": "2025-02-22",
    "content": "*Breakdown* and *Smear* mode are cool (I just tried them out). I put them in parallel on a drum loop and it sounded great! Am going to try when I get home tomorrow.\n\nHowever, Saturn as a distortion box still hasn't clicked in my brain. Every time I try it out I end up bypassing it because things end up sounding dull and gauzy and I lose definition. Also, it feels like it doesn't get mean or hairy enough for my taste.\n\nI think I need to see how someone else uses it for it to finally click.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368612623427309649",
    "author": "Rollmottle",
    "date": "2025-05-04",
    "content": "Having been on the receiving end of these from you, they are extremely effective.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389976767736971275",
    "author": "Brian Reynolds",
    "date": "2025-07-02",
    "content": "On that particular song, it was just too much. The band is chock full of talented musicians. And Gracie is as talented as any singer on earth right now. But in chasing the expression of the full height of the musicial and vocal talents of the group. They made this hugely confident and robust piece of art. By doing that they lost the heart of the song. The magic was in the umami effect lyrically and in performace of the vocal over the uke. The way her vocal would dance around feeling loose and unsure to striking and confident. \"Im confident im insecure.\" Is such a clever contradiction. There was nothing unsure or lacking in confidence in this final production or vocal performace. It was, we're as talented as anyone on earth, listen and watch!! Lost the \"see saw effect\" I loved about it initally. Just missed the mark for me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1409976783603896431",
    "author": "Bryan DiMaio",
    "date": "2025-08-26",
    "content": "get a reamp box and use your guitar pedals as a creative tool, can even get multiple people moving the knobs of multiple pedals",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1420993065635680296",
    "author": "Josh",
    "date": "2025-09-25",
    "content": "Anytime we get a bad comp the first thing I reach for is the attack tool. It’s like magic. I can’t say I use it terribly often as time stretching does the trick most of the time, but for fixing little percussive elements in a vocal it’s truly a killer tool to have around.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440495283686473899",
    "author": "cian riordan",
    "date": "2025-11-18",
    "content": "When it's not a glitchy piece of shit, it's the best, most natural tuning software out there.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440831990713815232",
    "author": "oaklandmatt",
    "date": "2025-11-19",
    "content": "I hand edit with audiosuite AT graphical mode if I want it not to sound tuned. There is no close second tuning software for this purpose. It is easily the best for transparent tuning.\n\nUnfortunately it randomly does the following:\n*reads notes in the wrong octave\n*plays back notes in the wrong octave\n*shaves off all the high end \n*adds a click to the beginning of the rendered file\n*adds a weird glitch that sounds like a bad edit in the rendered file\n*says it can't authorize the plugin\n\nSo I'm constantly shifting between classic and modern modes, and switching the input type which sometime corrects some of these things. Again, often seemingly at random.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1455184741681729557",
    "author": "Beck Nebel",
    "date": "2025-12-29",
    "content": "It may be worth focusing on producing first. You’ll get quicker wins without relying on your own sound design, and using high-quality Serum presets gives you material to reverse engineer.\n\nIf that doesn’t click, separate the two. Don’t sound design while starting a track. Set aside dedicated time to make patches, which can still inspire songs. Ultimately, even the best sounds do not matter if the arrangement and melodies are not strong.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "939374659370102865",
    "author": "peterlabberton",
    "date": "2022-02-04",
    "content": "I’ve done this a few different ways as well—once, both songs were mixed in the same session, and then bounced separately for mastering. (FWIW, that Pro Tools session became an absolute nightmare—wouldn’t necessarily recommend this method unless there is some reason to do so. In this case we had effects/elements from the first song pop up later on in the second song.) I left blank space in the second song’s bounce so they could be lined up perfectly. Other times I’ve taken a stereo bounce of one song and dropped it into the mix session for the other just to mock things up as we go. What happens on the mastering side I am less familiar with… but if it’s something specific we’re after I’ll usually send along a reference of the exact timing/fade/etc. for them to match.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941071239487823902",
    "author": "Zack Hames",
    "date": "2022-02-09",
    "content": "In this context, honestly blending multiple samples, even in the mix phase, can be incredibly helpful. Missing low end in the kick? Missing a certain smack in the snare? Find a sample with those attributes. Even if you’re just hired as a mixer I think it’s valid. \n\nOtherwise, EQ…saturation….blended distorted, reverbs, go nuts.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954399125598769182",
    "author": "spectrummasters",
    "date": "2022-03-18",
    "content": "Lil yachty carti and lancey foux are usually so far ahead they sound like their rapping to a whole track we haven’t heard yet lol. Love it tho . So creative and rule breaking",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954490120252317768",
    "author": "samvalentine",
    "date": "2022-03-18",
    "content": "Appreciate it bro!! Not in with them that deep but running in the same circles I guess 🙃 A Yachty and Internet Money project would definitely be cool. In that session he mentioned that he's been working on stuff with more live production - maybe even a full band?? 👀 Regardless gonna be super cool. I know Matt talks about Yachty on the pod now and then... he's for sure one of the most creative stars right now",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "956992784550756472",
    "author": "Zakhiggins",
    "date": "2022-03-25",
    "content": "@KushKadett I think to be a good producer, you should be just able to make whatever sonic feeling you want - so if that means technically \"wrong\" things like grit and noise, so be it. They still give a certain vibe. \nYour technical ability doesn't get in the way of your creative vision is what I'm saying in short\n\nWhat good production is, is different. It's in the eye of the beholder imo.\n\nYou could have a kid who just downloads FL, loads up a splice loop and happens to find a perfect kick and snare to go on it, the beat slaps, (technically good production?) but does this make him a good producer??\nYou see where I'm going haha",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "962486599227174992",
    "author": "Slow Hand",
    "date": "2022-04-09",
    "content": "As a practical example of when not being in phase is the right move:\n\nJon Castelli did a live mix on Twitch on Wednesday that included live drums. He identified that one of the snare mics sounded fuller when he inverted the polarity and proceeded to mix with that. \n\nLater in that session when it came time for notes, the producer (who was present in the room) asked why the snare had lost a certain thin and \"woody\" character that they liked. Jon reverted the snare mic to it's original polarity and the producer went \"Ahh! There it is.\"\n\nSo the takeaway here is that while drums usually *do* sing the best and hit the hardest when they're all working in phase with one another, sometimes the creative intention overrides the need to align them in a way that makes them most \"full\".\n\nAs you say: If it sounds good, it is good.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "962775783036837928",
    "author": "ALXCPH",
    "date": "2022-04-10",
    "content": "protools has a built in pitchdrop effect that you can put on a clip. Izotope vinyl is a free plugin that can do the same effect. its called a record stop effect 🙂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "974820159766298644",
    "author": "thejadenmejia",
    "date": "2022-05-13",
    "content": "Yea that vibrato effect is definitely just in the performance. I’ve done it a bunch.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987477215480537148",
    "author": "ehutton21",
    "date": "2022-06-17",
    "content": "Devil loc, Saturn has some real crazy automation abilities so don’t under estimate that, and also there’s this one in W*ves (i know it’s taboo) but it’s called berzerk distortion. You can add a lot of cool info to a sound with that one.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999509900596092928",
    "author": "gatewoodsensei",
    "date": "2022-07-20",
    "content": "This. That’s why I resonate with what @ehutton21 said. I prefer stems. I don’t have every single iteration of the La2a. Hell, If you do send the session AT LEAST bounce everything down and take the effects off. Idk man lol. I’ve dealt with some pretty difficult-to-work-with recording engineers. Took this one guy 2 years to send me the correct files for a project. 2 years.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999531721546539038",
    "author": "Calvin Lauber",
    "date": "2022-07-20",
    "content": "Yeah for me it’s the need to commit to what felt good in the room while tracking/producing and then starting fresh and kind of putting myself in a box for the mix. I get a little caught up if I have all the production effects and processing going while mixing because it makes it harder to commit to what we have done. Maybe from a bit of an unhealthy desire to think things could always be better on the front end when usually I just need to commit and do a solid mix.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012390690984054975",
    "author": "NoahNeedleman",
    "date": "2022-08-25",
    "content": "I’ve got it in my Master chain and I’ll toggle it on/off to see if it helps. \nI’ve got it set to 25% up and 25% down, and I’ll usually try it around 3-5% to see how it effects the whole thing. I end up with it on about 1 in 5 times, but I don’t do a lot of hard hitting pop.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031433585577693184",
    "author": "Deleted User",
    "date": "2022-10-16",
    "content": "I use it for the same effect on toms sometimes. They should add it as an option to turn it on/off for the next version",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031701849838989383",
    "author": "BatMeckley",
    "date": "2022-10-17",
    "content": "Interesting. I’ve had sustain glitches on some of the NI stuff too. Wonder why it’s such a challenge to get right.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1049483855670820885",
    "author": "Deleted User",
    "date": "2022-12-05",
    "content": "I can see stuff like that being useful for electronic music though. making the sound pop with a different character can be a cool effect. I've seen skrillex do it with his synths",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051571692260040824",
    "author": "LAPhill",
    "date": "2022-12-11",
    "content": "IME it depends a lot on who the players are. There are certain people I would call to play parts more or less as written, and others whose whole vibe is based off of experimentation. Both have their place for sure.\n\nOne thing you keyed in on that is really crucial is the \"space\" you ask them to fill. Even something as simple as \"ad lib between vocal lines\" tells the player a lot about where they need to fit in, while still giving them a lot of freedom to bring their thing to the production. \n\nCertainly a place for all of these approaches, and the more you know and trust the musicians around you, the easier it becomes to envision where it might go (and leave room for pleasant surprises).",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051602973593194587",
    "author": "Slow Hand",
    "date": "2022-12-11",
    "content": "I agree with @BatMeckley's approach on this. Have them execute your vision, and then once you have it let them go wild and swing big. Try something new.\n\nIt's up to either the artist or you, as the producer, to have a vision for what the song is, where it's going, and what it needs. One of you have to have a roadmap. *Someone* needs to have the vision. To be the leader. To steer the ship.\n\nIf the vision is not clear then perhaps the song itself needs to be refined some more until it has a strong identity. That will be your north star for creative decisions. \n\nIf you can convey the essence of the song to your players, the emotion behind it, then they can interpret that feeling in a way that is uniquely them without the need for you to dictate their parts. If you can give them an emotion and maybe some general contour of what you're hearing then they can fill in the spaces and bring their own qualities.\n\nAs producer, part of your job is curating the talent that you recruit to realize your vision. If you know what the song needs you can confidently pick a player with complimentary sensibilities. If you can pick the right person then very often most of the work is done by virtue of them being aligned with the song. Each of their contributions and ideas are likely to be excellent.\n\n----",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051632861150715975",
    "author": "Will Melones",
    "date": "2022-12-11",
    "content": "Oh no of course not. I was still just kind of thinking, the more money is on the line here, the more studio time costs, players, etc...we still have to get to that arrangement we were planning on at some point before we go home today. So you don't want to be in the position of applying extra pressure at the end of the session when everyone's tired, when you should have started there to begin with. That does just sound like being an effective producer.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055480296952311838",
    "author": "Maxim",
    "date": "2022-12-22",
    "content": "With stacks increase the ms amount or work on the takes to make them sound less like the lead (detune, distortion, verb, etc.) or try both. If that still fails adjust timing manually when the phase kicks in.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1063141305854722048",
    "author": "bennythetweet",
    "date": "2023-01-12",
    "content": "It’s a creative tool - limitations and advantages. It effing works tho! Since I’m a part-timer the PT shit drives me a special kind of bonkers. I will exit at some point or more likely just add another system with Lynx.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1063178918477181088",
    "author": "owengineered",
    "date": "2023-01-12",
    "content": "mad that is really really cool, both technically and creatively !! thanks alot for the link, i'll be sure to check out the results. crazy thing is you could do this for all different drum genres and get some original yet familiar sounding stuff. big up to you boss !!!!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070857894540615680",
    "author": "Slow Hand",
    "date": "2023-02-02",
    "content": "Yuuuup. That should be drilled into the head of every young creative: Capture that shit *immediately* or you *will* forget it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071896027587686542",
    "author": "ehutton21",
    "date": "2023-02-05",
    "content": "But beyond all that, good work is it’s own reward for everyone involved. I think @Rollmottle makes a really good point about being an effective communicator. I think a big part of that is being able to explain how your understanding of their vision is guiding you to the choices you’re making at every level. Whether it’s a reverb or manually adjusting consonants or spectral editing a master",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071898331908943963",
    "author": "Nomograph Mastering",
    "date": "2023-02-05",
    "content": "I suppose it’s fair to say that the earlier the stage in making a record the more everything is on the table for debate, experimentation, explanation et.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076965501122642042",
    "author": "ehutton21",
    "date": "2023-02-19",
    "content": "Melodyne time stretch is voodoo magic",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080575156407255131",
    "author": "Nomograph Mastering",
    "date": "2023-03-01",
    "content": "All he’s doing is distorting the peaks only, which can be achieved much easier with a good clipper",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080590750275870770",
    "author": "spectrummasters",
    "date": "2023-03-01",
    "content": "Aha ! I did not realise this . At all . I appreciate and use the action of clippers carefully but had not realised that they do this . My level of understanding was that instead of squashing peaks down (a la comp / limiter ) they just shaved them off and so the rest of the material could remain less compressed for the same rms . I’d not realised at all that those clipped peaks are  sort of returned / recycled into the signal . Fascinating . Thanks for the enlightenment man . I’ll have to read up on that . And this fact of course gives evidence to your point that using a delta is a longer way round to try and achieve much the same . I listened to the delta in kotelnikov and couldn’t see how it could sound musical to return that to the mixbus . It sounded like the sound of mp3 stream buffering glitches , so I figured I must not have understood something and left it at that . With the potential imo for phase issues I left the idea behind , but I was intrigued if Ryan’s comment about deltas pertained to the same thing . Another lesson learned here today . Thank you for the explanation",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084557011095654401",
    "author": "popaganda.",
    "date": "2023-03-12",
    "content": "If there’s a free flow of creative energy let it keep going!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084901581025194086",
    "author": "hank01564",
    "date": "2023-03-13",
    "content": "My favorite plugins for something like this are Abletons Redux (I use the filters on the bottom to low pass), Softtube Dirty Tape (for the wobble), McDSP Futzbox (distortion, speaker emulation), Unfiltered Audio lofi-af, RX950 (emulation of MPC conversion) and Goodhertz Lossy",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086727547892543509",
    "author": "austenballard",
    "date": "2023-03-18",
    "content": "I mean our resident Melodyne expert swears by Standalone, and also there's a corrupted project glitch in ARA that hasn't been ironed out yet. So maybe stick to Standalone for now",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099710357955674182",
    "author": "hyanrarvey",
    "date": "2023-04-23",
    "content": "Yeah you might have to get a lil creative on weird stretches and fades",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099719660309581824",
    "author": "NoahNeedleman",
    "date": "2023-04-23",
    "content": "There’s a few tricks for making this work- I’m sure Beckley has some more insight as well. \nFirst id say use “equal power” fades, and play with where and how wide. You’ll usually get a phasey type effect but if it’s in the right spot it’ll sound like a vocal ornament instead of a bad comp.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100093835972980748",
    "author": "BatMeckley",
    "date": "2023-04-24",
    "content": "I’m only really bothered by the last glitch at the end. Few things can’t be made better by making a longer fade and/or kicking Cian in the shins.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119463942784299128",
    "author": "Deleted User",
    "date": "2023-06-16",
    "content": "I had to make a template that has all the articulations on separate track. I always have staccato, fp 2,4 and sustain loaded up. another additional one for miscellaneous effects like shakes or glide up/dn",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123026404691415243",
    "author": "Zack Hames",
    "date": "2023-06-26",
    "content": "Might not be worth purchasing for this, but a program called Soundminer is really great for having a foley library that integrates with your DAW in a seamless way. Not sure if it works with Ableton though.\n\n\nDon’t be afraid to mangle sounds until they’re right. Don’t be afraid to record things yourself. Layers, layers, layers, layers.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135003946956619838",
    "author": "Slow Hand",
    "date": "2023-07-29",
    "content": "A great chord progression is my favorite thing to work on. They're the scaffolding for the entire song. They're the band's office for the day. A landscape for the musicians to dance over. The fixed point to push against and create effect through compliment or contrast. Good chords make me warm inside.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136021969490411591",
    "author": "Jeremy Klein",
    "date": "2023-08-01",
    "content": "\"room mic\" on distorted guitars",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150096699352698910",
    "author": "chrissorem",
    "date": "2023-09-09",
    "content": "Sam messaged you!  Ableton is very creative",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150636671675662407",
    "author": "masteredbyjack",
    "date": "2023-09-10",
    "content": "I love Ruairi, literally he is my favorite mastering engineer and the most impactful creative person I’ve ever met — but I definitely disagree with this",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155251789592018964",
    "author": "Skyler Young",
    "date": "2023-09-23",
    "content": "The sounds are from vintage synths (prophet 5, Jupiter 8, model D), a real mellotron, and Rhodes and wurli etc. - all the effected sounds are ran through a chase bliss heavy pedalboard",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161756638940758157",
    "author": "NoahNeedleman",
    "date": "2023-10-11",
    "content": "Turn them down, verb them out. Use them for effect rather than being up front",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164630057575268432",
    "author": "NoahNeedleman",
    "date": "2023-10-19",
    "content": "Not just the performance, it’s the voice itself. Some singers take to tuning really well, some not as much. \nBUT, the voice modulation tool in Melodyne can be used to pretty good effect here.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179918374675939410",
    "author": "gatewoodsensei",
    "date": "2023-11-30",
    "content": "I’m not sure if this’ll help, but I tend to go with whatever hits me at the time. If it’s a melody, I’ll sing it, mumble words, and allow the music to form around that idea. If it’s lyrics, then i grab a guitar or sit in front of the keyboard and play the accompaniment. Or if I’m in front of my computer, and melody line hits, I’ll play the melody, or chords and allow it to loop while I write. So I don’t necessarily balance, because to me that means I’m shutting part of my creativity off i order to allow the other part to flow, and more often than not, that kills the creative flow. \n\nSo don’t try to balance anything. Whatever you feel, go with that and allow your creativity to flow.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181052075212279868",
    "author": "Adam Thein",
    "date": "2023-12-03",
    "content": "Just finally got access at the end of last week, but I haven’t had much time yet to experiment.  I’m pretty happy with the improvements so far though!  Seems like a more substantial improvement than the change from 10 to 11.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182115098429497475",
    "author": "Rollmottle",
    "date": "2023-12-06",
    "content": "oh the CHORUS EFFECT, not the CHORUS OF THE SONG",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189639236564041780",
    "author": "cy (sigh)",
    "date": "2023-12-27",
    "content": "either using some simple slap or early reflections just to have some kind of space on the elemtn or similar to @cian riordan if its something more noticeable I'll usually print and go ham in the mixing stage to make it sound like something special. I either want the verbs to be invisible or I want the listener to really notice it. if I we're experimenting during production /recording then I might wild out with effects from jump and have them sing/perform into the the fxs to catch a vibe",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189643661542170755",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-12-27",
    "content": "I can second what @cian riordan said \nOn this track I mixed there is a pretty heavily high cut 6 second valhalla verb just to really embed the vocals in the mix … \nAt around 1:53 into the bridge I put some compressor on the verb and as it fades out I automated the threshold and gain so it became this cool effect almoat like a transition/feedback kinda thing \n\nhttps://open.spotify.com/track/7ECq1xBwMYD4J0eBx0ii23?si=AJ-T63jpSgmqSIxlFOW1yw",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190866939325710366",
    "author": "Slow Hand",
    "date": "2023-12-30",
    "content": "I'm trying this now and I think you're spot-on. I've got the Alter Boy pitch/formant down an octave and although the cello vibrato is making the pitch-detection *very* wobbly that seems to be it. The distortion is right-on as you suggested. Between Noah's conviction about a piezo DI on the cello to get that raucous grit and the Alter Boy we're 85% of the way there.\n\nThe only unknowns are the exact octaver and the means to get it sounding so incredibly dry and claustrophobic. That sense of proximity is still the biggest mystery to me.\n\nIt's such a visceral sound. I'm gonna keep running this down and I'll report back if I find anything else. Thanks folks!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191817127062155395",
    "author": "OOYAH",
    "date": "2024-01-02",
    "content": "Hey guys, I'm new here! Haven't posted much but been reading a lot, was wondering if anyone knows how to achieve the vocal effect from 0:02 until 0:33?\nhttps://open.spotify.com/track/41oY4WCTj5kccfesTVFnvN?si=2428e2c63dba451c\n\nIt sounds chopped or like a really fast gate but ive never been able to replicate it. I think Niall Horan also does a more exaggerated version in Slow Hands.\nhttps://open.spotify.com/track/2cOUlop2ZakjOKe4WinesN?si=a7582782b60e4874\n\nAny thoughts?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191845162951921684",
    "author": "Calvin Lauber",
    "date": "2024-01-02",
    "content": "Welcome man! To me it sounds like on slow hands that there’s a main vocal bus which is including dry vocal and the reverb send, with a gate on it that has a side chained input from the dry vocal so the whole thing is getting hard chopped in between words. And then then you could probably be selective about which in between words you don’t want it to chop by muting the send to the gate",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194257422378876978",
    "author": "Karim",
    "date": "2024-01-09",
    "content": "A trick I’ve used is for a similar effect is micing the electric guitar itself while you strum it, and mixing that in to taste.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197067913891414026",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "You’ve got your drums …..and built your vocal chops , the chops are like your keys part …..and then you’re gonna weave a stealthy , hooky baseline to syncopate and spin with your chops and drums . As an example ….you could do a dembow rhythm over your drums with your bass part and then jam your vocal chops into that feel …..or vice versa , a dem bow feel on the vocal chops and a stuttering walking bass line part with that .  \n\nYou ll quickly catch a groove between the drums vocal chops and bass hook \n\nTodd Edwards is the yoda of voxal chops",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197070353307029594",
    "author": "Deleted User",
    "date": "2024-01-16",
    "content": "that makes sense. dembow vocals and stuttery bass sounds really interesting. I’m gonna try making something like that",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202586137370169414",
    "author": "Edward Rivera",
    "date": "2024-02-01",
    "content": "There's also this artist called Ada Rook who is more apart of the bedroom metal scene, leans more towards 100 Gecs...super loud and distorted",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202629431227588649",
    "author": "David Fuller",
    "date": "2024-02-01",
    "content": "The Halo Effect sounds like vintage In Flames so there's that",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222144362171990066",
    "author": "Iwan Morgan",
    "date": "2024-03-26",
    "content": "You’ve got this. If the usual methods don’t work, try and introduce some wildcard stuff to get the artist excited - feed the vocals through an amp, put a shit load of effects on. Anything to get them lost in the moment and singing in a less precious way. You can always take a dry feed as well. Get them to do press-ups before a take, run around the block. Sounds like the brain is getting in the way of the heart.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239237591140663306",
    "author": "Josh",
    "date": "2024-05-12",
    "content": "There’s definitely something magic about the pitch shifting a sampler does vs using a synth. Also when I discovered the SP1200 kits from samples from mars my life was changed",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239256920146317352",
    "author": "BatMeckley",
    "date": "2024-05-12",
    "content": "A lot of that was taking off the “time correction” bit of pitch shifting and having your 808’s tuned by essentially adjusting the sample rate, almost like a varispeed.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239264634192658624",
    "author": "Adam Thein",
    "date": "2024-05-12",
    "content": "Got turned onto it by John Rooney, it's sort of a very stripped down Ableton sampler, drag and drop and it'll prompt you to slice the transients across the pads, and I think it's free so it's just a no-frills plugin to load some samples and chop up some loops fast",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242974330007326741",
    "author": "chris_donlin",
    "date": "2024-05-22",
    "content": "I did the pro tools version of this with Clip Separation. With an arpeggiated phrase, it ends up being a lottt of mouse clicking to manually reverse each one, i figured there was a better way",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244765713663529031",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "Been using *Tupe* for years and I love it, but it's still too polite. I need a distortion box that's gonna fuck something up so badly that it's mother won't recognize it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244772149114437685",
    "author": "Rollmottle",
    "date": "2024-05-27",
    "content": "I always forget about it because the individual plugins are so good, but chaining together many instances of plugins in the SoundToys effect rack always bears fruit. Not like you can't do that already just by chaining plugins together, but for me, it's a different modality and always makes me try wilder shit.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248268884130267197",
    "author": "Josh",
    "date": "2024-06-06",
    "content": "Preamp distortion on DI guitars has been something I’ve messed around with for awhile and this record and Mk.gee only made it worse hahaha",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1249728704570064967",
    "author": "simplersounds",
    "date": "2024-06-10",
    "content": "super cool, yeah this must be the article I'm remembering. Instrument designers don't get enough praise! I like reading stuff like this and experimenting with some of the concepts.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1252879717137125427",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-06-18",
    "content": "Damn. Thanks for all the answers guys showed me that I need to be more creative with my fx sends. Thanks!!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255945955279376524",
    "author": "BatMeckley",
    "date": "2024-06-27",
    "content": "I don’t know if we’ve talked about it, but it’s something I do. (I just used sans amp on vocals on this thing I did for Noah this week). \n\nLuke would often have the singers just do a garbage take or two through full auto tune at the end of a session just to see if we stumbled on anything cool.\n\nIt’s weird how challenging it can be to get the RIGHT distorted track. It can take a lot of work to make something sound appropriately shitty. A lot of elements beyond straight distortion; filtering, small room, subtle flanging, etc. Speakerphone used to be great for this. I still wish I had my license for it, it’s fucking robbery what they’re charging for it now.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264496681144156192",
    "author": "Ross Fortune",
    "date": "2024-07-21",
    "content": "I use splice bridge in Ableton. The time stretching does often sound different in splice to when it’s dropped in, but that’s to be expected. I always attributed perceived tonal differences to simple gain mismatch, but didn’t look too deep.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1272483249943478315",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-08-12",
    "content": "I always felt I got pretty perfect results with vocalign going section by section with Audiosuite, same with Revoice Pro. Sometimes you get some artifacts, but I'd just save the original take and splice in the glitchy word if needed. What settings are you using? I haven't used it in a hot minute and prefer Melodyne Studio multi-edit, perhaps it's gotten worse?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277691000155934731",
    "author": "Slow Hand",
    "date": "2024-08-26",
    "content": "Unless you really know what you want, writing and arranging *into* OTT from the beginning seems like a mistake because it will severely distort your ability to tell what moves you're making.\n\nYou're basically marrying yourself to the OTT sound up front if you start with it on, because If you try to dial it back later on in the process you're going to reveal all of the weird moves that you made to compensate for OTT's sound.\n\nIn general, I find OTT works best on individual instruments, and not on groups, except in extreme circumstances. If you want the OTT sound I'd advise you to apply it on individual tracks, rather than on your entire mix buss.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280986821555392567",
    "author": "Slow Hand",
    "date": "2024-09-04",
    "content": "Agreed. If that's what the client wants, then do it - unless they say that they've specifically hired you for your progressive taste.\n\nThat said, a good director will have given Rob guidance on the tone that they want in the video and hopefully the client's brand is defined enough that we can know what would be appropriate and what would not be appropriate.\n\nWhat is the client trying to project with their branding? Are they cool? Classy? Expensive? Creative? Reliable? Simple?\n\nIn the case of the U.N. they're international, serious, responsible, far seeing, and dignified. Those are the targets I would be thinking about.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284222070108061798",
    "author": "Slow Hand",
    "date": "2024-09-13",
    "content": "Now it's got me thinking. If you wanted to get really surgical about reducing the dissonance (not eliminating it entirely) you could break the chord into single notes that are recorded individually, each with a carefully-adjusted distortion profile (say only a 2nd harmonic - maybe a 4th) so that there aren't so many clashing upper-harmonics.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285709124788682754",
    "author": "Ross Fortune",
    "date": "2024-09-17",
    "content": "Sounds a little bit like time stretching artifacts (like something kind of abrasive slowed down masssssively in Ableton Complex). \n\nI bet @Slow Hand could make a good guess at it though",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304896386667380786",
    "author": "cy (sigh)",
    "date": "2024-11-09",
    "content": "been playing  w stacks a lot fora few songs recently and often think of them as a chord arrangements. might even play it in on a piano for reference if I can't figure it out in my head. \n\nyou can often control density with the spacing of the harmonies - both in pitch and positioning in the track. \n\nusing different types of distortion on similar takes to bring in different /contrasting textures. \n\nbig stacks can take well to  really agressive EQ depending on how natural you need them.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1333022892799295558",
    "author": "itamaramati",
    "date": "2025-01-26",
    "content": "Primaries sounds phenomenal! Thanks for recommending. I'm always inspired by wave alchemy revolution, always fun sequencing og drum machines and their effects section is really fun for experimenting and mainly sounds bonkers.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342938208924729446",
    "author": "chris_donlin",
    "date": "2025-02-22",
    "content": "Try the breakdown function in Saturn. I’ve only used it for extreme applications so I’m not positive it will work, it only may have a bit crush effect to it which isn’t what you’re looking for. Worth a try",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1343469917575319614",
    "author": "montrose recording",
    "date": "2025-02-23",
    "content": "i use saturn alot in subtle tape mode mostly for drastic eq and a little dynamics stuff.  not really a distortion box but a pretty bold shaper",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1379877063766577303",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-06-04",
    "content": "when dialing in the volume of your Bvs/harmonies, do you first dial them in dry and then adjust the effects (delay, reverb) to taste or do you adjust the volume with the reverb enabled? working on a track that's more floaty/atmospheric today and was quite suprised how much a large reverb on backings can change their perceived volume if you adjust it together with the reverb",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1380018645249425519",
    "author": "Josh Bowman",
    "date": "2025-06-04",
    "content": "Both for me ! Pull  em up ballpark, dial in effects, adjust level, repeat till it feels right.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392215976531071116",
    "author": "Rollmottle",
    "date": "2025-07-08",
    "content": "As others have said, recreating a beat you like is the school you need to go to. One of my favorite beats of all time is Fleetwood Mac's \"Hypnotized\" which is a swingy, triplet unchanging thing that is effectively a drum loop through the song, except Mick Fleetwood plays it. I recreated it using a sample pack of Mick Fleetwood's and turned it into a song after serious finagling, especially in the context of grid music. The insight into accent, velocity, swing, where in the grid things hit (or don't), which specific hits matter and how dropping just one or two key hits in a repetitive pattern can shift the groove entirely. It also tests your chops for figuring out choke groups, how to make closed and open hi hats sound \"real\" (if that's your goal) so on and so forth. I also love recreating a beat as a way in when musical inspiration may be lacking.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396235549911552191",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": "I want the mpc sound . Renaming the wav file to match the FAT12 mpc system is long . The transfer of files takes time in itself. \nI just resample everything into the mpc out of my daw system as audio and build up the program . You want the sound of the mpc right ? A major part of it is it’s a/d",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1398934854514769952",
    "author": "andrew_yv",
    "date": "2025-07-27",
    "content": "One thing that I’ve found effective for me is having days or half-days dedicated to more generative creative tasks and others dedicated to more technical, clerical, discerning tasks. Not a hard and fast rule, but separating the generative mentality from the evaluative mentality allows me to do both much more effectively. Also, if I have one scheduled and the other is calling to me, unless I’ve got a non-negotiable deadline, I follow that instinct",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404515484375978224",
    "author": "bobby k",
    "date": "2025-08-11",
    "content": "I think spending your own money to cover someone else’s ass is a slippery slope. Unless you’re in a band, the songs you’re producing aren’t your own (despite how much they feel like they could be). If every artist OP works with hired a shitty mixer for the next 5 years and the only solution he had in mind was to to pay out of pocket, that’s a lot of money he’s losing that could be invested in his own tools and life. This is why I would advocate for a creative problem solving compromise of sorts - find ways to wrap it for free or cheap that don’t suck, or convince the artist to budget better, or learn how to finish out your vision yourself from the rough mixes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411101993199603813",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-08-29",
    "content": "maybe the Avid LOFI? you can get some pretty nasty distortion with that one and since it's PT internal there should be little latency",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417228431803810043",
    "author": "Rollmottle",
    "date": "2025-09-15",
    "content": "- Random MIDI generator into a Scale filter\n- Same as above but add an Arpeggiator \n- Same as above but replace the Arpeggiator with a Chord filter \n- Mangle a drum loop\n- Mangle any loop\n-  Create a drum loop with differently timed Arpeggiators and midi generators controlling a  drum machine/drum rack \n- Modular synth patches",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1455074481809915945",
    "author": "Akanksha",
    "date": "2025-12-28",
    "content": "thanks for sharing your creative process with me!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1462548877721993309",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2026-01-18",
    "content": "https://www.instagram.com/reel/DTqhwuTkowE/?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw== there he is!!! probably the most creative approach to distortion atm",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469849018065621085",
    "author": "youngteam",
    "date": "2026-02-07",
    "content": "loud amp super bright bridge pickup zero reverb, distortion in post if necessary",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469849320583991367",
    "author": "Ross Fortune",
    "date": "2026-02-07",
    "content": "Dope. I’ll experiment thanks.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469942282022289539",
    "author": "BatMeckley",
    "date": "2026-02-07",
    "content": "3 possibilities to me: Console distortion. Go direct and just on the gain knob. Or, pig nose amp. Or, one of those guitars with the built in speaker, dying battery,",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470875419258523741",
    "author": "BatMeckley",
    "date": "2026-02-10",
    "content": "When you redetect, make sure you’re bringing them into the right octave. Then, give the blob on either side a good wiggle to make them redetect too. Should smooth out the glitches. If you just do the bad blob, it’ll glitch at the edges. You have to redetect going in and out of it as well",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1473135311029538910",
    "author": "sethearnest",
    "date": "2026-02-16",
    "content": "We’ve also experimented with a combo of remote login (Google Chrome is an easy one) and ListenTo (li-SENT-o) so that we can both be working on something together at the same time, each able to control the session but also at our own spots for any critical listening needs. \n\nEg finalizing a mix, he can be at his place, me at mine, and we’re both able to control the given mix session real-time. Handy for last minute tweak needs or if the collaborator lives farther away than you want to drive for a given situation.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1473402967188177027",
    "author": "austenballard",
    "date": "2026-02-17",
    "content": "There are two sides to that though\n\nI am grateful that I only ever had to splice tape in school and that I don't need a six-seven figure analog studio and the Wrecking Crew to make a track\n\ndrag-and-drop samples, vocal comping, time stretching... these are things people who came before me spent days or weeks doing. VST synthesizers! Kontakt! \n\nwe can do more, faster, because we don't have to muddle through every little thing. but this also means we have an obligation to learn how to combine the things that have become easy into new challenges and adventures\n\nin 50ish years we went from Sgt Pepper to Skrillex because of this\n\nit's the drive that humans who want to achieve and accomplish and push beyond possess",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937612703894216734",
    "author": "jonmatteson",
    "date": "2022-01-30",
    "content": "Question: what does everyone include in their writing/production templates? Building a new on for this year and am walking the line of having everything available but not wanting to lean on the same sounds for every start. I want to be efficient but also keep things creative!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941080701808300045",
    "author": "KushKadett",
    "date": "2022-02-09",
    "content": "interested what you mean with blended distortion",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941081876142116924",
    "author": "Zack Hames",
    "date": "2022-02-09",
    "content": "Send any parts of the drum to an aux with some sort of sat or distortion plug, ala decapitator for coloration",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954056626485227570",
    "author": "Zack Hames",
    "date": "2022-03-17",
    "content": "Jon and Matt have talked a lot about nudging performances ahead or behind the beat to make things groove more. (whether it's a hihat or a vocal or whatever)\n\nCan anyone substantiate why you would nudge ahead or behind and what the effect musically is? I understand what swing is but I can't seem to make a real decision on what really feels \"right\" when I attempt this technique. Sometimes it sounds fantastic and other times not but I cannot quantify it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "956990799902556230",
    "author": "Rollmottle",
    "date": "2022-03-25",
    "content": "I think this is where it starts getting tricky and starts to dip into territory @Zakhiggins was touching on. Is there an objective measure of what good production is? \n\nTons and tons of dub and reggae from the 70s and 80s would be what I would consider not necessarily great production -- from a technical standpoint -- but a lot of those shortcomings (noise, grit, distortion, etc.) don't get in the way of the end product because the sum total well surpasses any production shortcomings. Most of the punk, post-punk and hardcore stuff I listened to in the 90s would also fall well below a bar most would consider “well produced” but the music transcends any of that for me. \n\nSo…by my measure, all of these recordings I mentioned ARE well-produced by nature of them being good to me and still “adding up” so to speak. By somebody else's measure, they may not be because they don’t meet some threshold -- be it technical, artistic, whatever -- of what they consider well-produced.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "961089682542850120",
    "author": "samvalentine",
    "date": "2022-04-05",
    "content": "I'm doing clean edits for a rap project. Been using a healthy mix of varifi, echoing the previous word, and even copying a clean lyric from somewhere else that maintains meaning.\nAnyone have creative suggestions?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "962522295874764840",
    "author": "isaac joel",
    "date": "2022-04-09",
    "content": "in Reaper I automate the ReaTune plugin on full formant mode but that's baked in to Reaper (i'm a stan!) not sure if Ableton has a good built in pitch shift plug for automating but AlterBoy is a good stand i n",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "970790639119794187",
    "author": "Zack Hames",
    "date": "2022-05-02",
    "content": "What are some easy ways to add tempo based glitches? Either to full mixes or individual aspects of a mix. Anything from simple Linkin Park type vocal chops to Aphex Twin. It's something I've never found an easy/fast/musical way to do.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "970796738900295680",
    "author": "Eric Martin",
    "date": "2022-05-02",
    "content": "Stutter Edit 2 is fun, I haven’t practically applied it yet, but it’s hella fun",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "970821107068313600",
    "author": "blanco",
    "date": "2022-05-02",
    "content": "the grid is your best friend. anything really. i like stutter edit effectrix looperator.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "970874395025342474",
    "author": "alex_epton",
    "date": "2022-05-02",
    "content": "I heard max martin does this too…. Lots of time editing to get it all just right. @Zack Hames Sometimes the magic bullet is time and attention.  Even with effectrix  or permut8 etc you still need to finesse that stuff it’s not like you just slap those on and it’s done",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "971052207636119552",
    "author": "jantrit",
    "date": "2022-05-03",
    "content": "Tend to either do it manually by chopping and pasting on the grid. Or using an sp404!! This is probably the quickest and most fluid/inspiring and the onboard effects are sick",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "971451685018927175",
    "author": "delwin",
    "date": "2022-05-04",
    "content": "I do this a lot!\n\nIn Ableton, you have soooo many options. Most often I put the sample on an Ableton Simpler and am able to slice / pitch / etc really fluidly — record that, and then edit by hand. This is my workflow for 90% of vocal chops. If it’s really simple I’ll do it by hand but I find I get more musical results if I can “play” the chop. \n\nThere’s also Buffer Shuffler and Beat Repeat in Ableton which can be fun and unpredictable. \n\nThe Glitch Machines plugins are also really nice if you’re going for something a bit crazy (two of them are free and very good). I don’t fully understand them yet so I just throw them on when I want something wacky to happen. \n\nAnd I’ll also second stutter edit — very fun for “playing” chops live too, and editing presets isn’t too hard either.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "974443414550609950",
    "author": "blanco",
    "date": "2022-05-12",
    "content": "it’s called tremolo. when Post does it thats how he performs it into the mic while recording. but can also get creative with tremolo plugins to recreate it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "974446893608366110",
    "author": "jonmatteson",
    "date": "2022-05-12",
    "content": "Its autotune adding vibrato to the longer tails. Fun effect that he and kid laroi use a lot!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987468565147943014",
    "author": "Jeremy Klein",
    "date": "2022-06-17",
    "content": "Any ideas on how to creatively process a 3 mic drumset?\n\nI'm mixing one on this song right now that was pretty poorly recorded so it just doesnt sit in the mix at all. The song production is pretty left field and I have a ton of creative liberty on this project so I can really go crazy with it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987476116170244137",
    "author": "ehutton21",
    "date": "2022-06-17",
    "content": "Ahhhhh yes. Okay, so maybe blow these drums up and distort a lot and see what you find in the mix. Sounds like these drums are pretty much band passed. Maybe you can try layering in your own samples but that’s usually some thing I do if I’ve been told I’ve got a green light to add production. Usually though, you can always save two copies and if what you do is dope, the people come around to it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987476732510609499",
    "author": "Jeremy Klein",
    "date": "2022-06-17",
    "content": "Yeah I think samples is what I MIGHT end up having to do here. Do you have a favorite drum distortion? I was using radiator and that sounded cool-ish.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993908595227898016",
    "author": "Will Melones",
    "date": "2022-07-05",
    "content": "I like to take those sample instruments and slap a convolution reverb right on the channel or bus. Really short studio-style room reflections. I think something about that fools the ear into hearing real players…even though there would have been carpet on all the walls in the ‘70s. Kontakt instruments seem to either be bone dry with exaggerated proximity effect or drenched in long hall reverb for a cinematic application.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994791533574369361",
    "author": "Calvin Lauber",
    "date": "2022-07-07",
    "content": "This seems to be an easy solution for using the drum rack or midi instruments from ableton within Protools, but less sure about how using the Effects Rack with this method would work? https://youtu.be/k0HWeGQKdQg",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000897103343652864",
    "author": "prodbyobseen",
    "date": "2022-07-24",
    "content": "Haha you’re kidding, that’s so funny. I’ve had my Nintendo on the desk, great for killing some time while bouncing stems or songwriting breaks, have everything connected to my monitor with an hdmi switch 😂\n\nIf you really want to chop it up smash bros is my go to 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009743271523799061",
    "author": "Ross Fortune",
    "date": "2022-08-18",
    "content": "Not Melodyne, but AutoTune graphic mode allows you to edit audio on the timeline after it’s been transferred into the plug. Handy if you spot a click or a mouth noise you missed.\n\nIn Pitch & Time mode it behaves like melodyne in that you can’t edit the audio on the timeline, but the time stretching inside the plug is the smoothest I’ve heard for vocals (I don’t use melodyne so that could be just as good)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012779937175969954",
    "author": "ehutton21",
    "date": "2022-08-26",
    "content": "It’s real great for distortion where I wanna shape it a bit but I don’t wanna overthink it like an ozone exciter or trash 2",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1015088276052390009",
    "author": "Calvin Lauber",
    "date": "2022-09-01",
    "content": "Enjoy. It’s obviously great for live purposes but it’s such an incredible creative tool in the studio! Also the stock plugins honestly sound great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020339808821837825",
    "author": "Deleted User",
    "date": "2022-09-16",
    "content": "Hey guys, what are cool plugins for full mix filter swells like in Hung Up by Madonna or various Dr Luke transitions? I’d like to do a radio-dial-tuning effect at the beginning of a song. Any ideas appreciated!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020805692094947358",
    "author": "Zack Hames",
    "date": "2022-09-17",
    "content": "I asked a similar question a while ago, and @oaklandmatt had a great answer basically to the effect of: \nSomething rushing ahead adds energy or anxiousness (a punk bass line or fast trap hihats, maybe a rock guitar solo)\nSomething late adds groove/swagger (Lofi hip hop snare, a lazy vocal, a funky bass line)\nI think that’s a really cut and dry way to view it; but what you said obviously applies, every context is different.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1024817303528943616",
    "author": "ehutton21",
    "date": "2022-09-28",
    "content": "I can flip through my decks sometime this weekend when I’m all done with work this week. I usually just make it for the homies etc but i’d be down to experiment with sharing some. A tad shy so, hit me via DM and don’t be freaked if I don’t respond right away",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1027269453660037251",
    "author": "delwin",
    "date": "2022-10-05",
    "content": "It's the sharper, percussive, SOPHIE-esque sounds are easier for me to arrive at with the modular experiments, so I've been studying my pad sound design recently 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031429637198327838",
    "author": "Will Melones",
    "date": "2022-10-16",
    "content": "Speaking of bad in a beautiful way…there was an old stereo version of Little Alter Boy that didn’t track the same in both channels. They fixed it with an update, but sometimes that bad tracking makes for a great stereo harmonizer-esque effect. I still use the old one sometimes within Blue Cat’s Patchwork for it’s glitchiness. So @Calvin Lauber, if you’re getting stereo artifacts, there may be a newer version of LAB out there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031430746306519130",
    "author": "Will Melones",
    "date": "2022-10-16",
    "content": "v5.3.0 was the last glitchy version, and 5.3.1 was the fix, back in 2019. (I happen to have an email from their support team after asking for the old installer.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031705832645218304",
    "author": "NoahNeedleman",
    "date": "2022-10-17",
    "content": "Lotta glitches punching while tracking midi. Always have to go back a draw in a sustain release before the punch point, and even then it can be a problem.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031744242990718997",
    "author": "Will Melones",
    "date": "2022-10-17",
    "content": "Oh I always assumed the sustain glitching was a DAW-level midi problem. Never noticed a specific virtual piano being worse than others",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032032631971397732",
    "author": "peterlabberton",
    "date": "2022-10-18",
    "content": "No hardware controller, but the softube spring reverb has a feature where you can virtually beat the thing up for crazy spring effects. Unfortunately it doesn’t sound very good.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033881551424995339",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "The sp404 was incredibly fun and almost gameboy-esque. That quality was really valuable. Roland has a whole showcase at guitar center right now, I think. It also went very seamlessly into a lot of lo-fi/formant heavy editing that I love to do with samples. \n\nI also made a pit stop to hardware synths. I love the korg units. I want to explore hardware synths because I feel like the tactile nature might actually teach me to be more creative than my digital synths.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035109832518279198",
    "author": "louisvie",
    "date": "2022-10-27",
    "content": "i'm thinking time based effects but i have no precise vision.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1049488440711975022",
    "author": "ehutton21",
    "date": "2022-12-05",
    "content": "Grazi, so it’s like a meld of decap and radiator with a little bit of a softening effect",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050204220260888666",
    "author": "baileybonds",
    "date": "2022-12-07",
    "content": "I’ve been having a lot of fun with kits by PastToFutureSamples. They are kontakt instruments with nice little GUIs. Super playable and they sound great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050456616895528980",
    "author": "Zeuswayn3",
    "date": "2022-12-08",
    "content": "Superior is so great and very tweakable- I’ve preferred it to other libraries. With the routing, onboard effects, and mic bleed options you can really dial in a sound.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051048900938707005",
    "author": "Slow Hand",
    "date": "2022-12-10",
    "content": "I think an overlooked art is the art of satisfying creative needs, economic necessity, and political reality.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055307591879774218",
    "author": "austenballard",
    "date": "2022-12-21",
    "content": "Anybody have good tricks for tuning drum samples? I have a reasonably effective chain that uses Ableton's Resonator and some really intense Pro Q curves, but I haven't been able to re-create it in any other DAW, mostly for lack of a good third-party resonator plugin",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055323064612696134",
    "author": "austenballard",
    "date": "2022-12-21",
    "content": "the reason i like using resonator specifically is because it uses the spectral content of what's already in the sample rather than layering another tone over the sample, which i have experimented with. i guess i'm mainly wondering if anybody else has done anything like this and knows of a quick and dirty way to do it in PT, Logic or other DAWs that don't have the same sound design capabilities as Ableton",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055340811706970213",
    "author": "Deleted User",
    "date": "2022-12-21",
    "content": "All of these methods suggested will yield in different results. \n\nResonators are made from delay using feedback to create tones. So you may need to resample to kill sustains - or not if you want it to have lengthiness. If you are going for SOPHIE kind of sound then you'd probably keep the feedback. \n\nBooms (filter resonance) are similar mechanisms but less tonal unless you turn up the feedback a lot more - it will certainly be more natural sounding as opposed to comb-filtery sound. \n\nLayering will give more focused pitch while maintaining the integrity of the layered sample sound, you would probably have the most control this way. \n\nVocoder will have inherently baked sound because of the synthesis mechanism, it can be desirable or not depending on the scenario. \n\nWith sampler looping, you will get grainier tail - dialing in the decay is necessary if you want the sound to be percussive because it will just continue sustaining. You can create pads this way too!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055430858326167582",
    "author": "ALXCPH",
    "date": "2022-12-22",
    "content": "Not sure if this has been mentioned, but the ableton pitch shifter and an EQ is great for this. Basically you are able to shift the fundamental of the sound without changing the tambre of the sample. EQ is just to visualise the fundamental moving. I have the same obsession with some tracks and can usually do it by ear now. If you are able to sing somewhat in pitch, try and sing the percussion sound, and find a note on the piano that matches it. If you get the technique down, I find it is the fastest way to do it. ❤️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1056251099297878116",
    "author": "Ross Fortune",
    "date": "2022-12-24",
    "content": "Thanks for your synth tips @wilhelmjosephk, @Slow Hand  and @ALXCPH. I decided to learn Serum while I'm back home for xmas, and having a lovely time making my way through the manual on AirPods.\n\nWhen I'm just experimenting, I tend to get inspired by a sound or a part that comes out of my fingers while I'm tweaking, and next thing I know I've made a track but abandoned the curriculum. Obviously a positive outcome in one way, but it's the same thing that's scuppered my progress for years (including on ever getting to properly know the OP1).\n\nI was thinking to try emulate some patches from songs by ear. Then there's YT tutorials from the likes of Mr. Bill and other EDM people, they'd probably keep me occupied for a minute.\n\nBeyond that, would you suggest any fun ways to keep myself interested in learning and honing my skills?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057065421393633442",
    "author": "Slow Hand",
    "date": "2022-12-26",
    "content": "I'm really not much of a template guy. I love building everything from scratch, whether it's instrument patches, DAW setups, or effects chains. But these synth settings are hard-won and I spend so much time repeating them that I finally saved them. 😄",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061653682489405620",
    "author": "Adam Thein",
    "date": "2023-01-08",
    "content": "Alright folks, I'm trying to pare back any subscriptions I have that I can live without and Splice is on the chopping block.\n\nI have ~1200 credits built up but don't want to lose them.  I mostly use Splice to grab one shots of drums, transitional effects, percussion, etc.\n\nDoes anyone have some packs that they'd recommend for that type of stuff?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062040884847321090",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "That’s way too much of a blanket statement to me. I’d use loops for drums any day and just try and be creative enough to make it sound cool. Sure it won’t sound like Jon Bonham. And it’s not supposed to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062043376037412945",
    "author": "Zack Hames",
    "date": "2023-01-09",
    "content": "This is a total aside:\n\nDo people really like making stuff remotely / in hotels / on the go? Maybe it’s because I’m such a hardware freak but man anytime I try to work on headphones with just a laptop, I just don’t do my best work and I don’t find it inspiring. Is it a means to an end? Or to simply be able to creative at a moments notice?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062043750181908600",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "For production I 10/10 times prefere sitting out side the studio when being creative. And then I will go into the studio and finess  and tidy up, get a good mix going, maybe replace a few sounds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062049004860477440",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "That makes sense! \n\nTo me being outside the studio is much more about finding the vision, than being able to execute it. I don’t care if my kick is 15db too loud and everything is distorted to hell. If there’s a vibe that’s inspiring that’s all that matters. Once the vision is clear it’s usually easy to reign it in and start making sense of thing once you get back into the studio, because now the goal is clear. Looking for a goal in a studio is just not as inspiring to me. \n\nI can always re-record stuff, and that part can also inspire immensely. But I find it much easier when the vision is already there, that doesn’t mean we have to be locked to it 😇",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062070224813310003",
    "author": "NoahNeedleman",
    "date": "2023-01-09",
    "content": "For my producer/mixers: You guys know that feeling when you’re done with tracking, and you’re just leaning into the minutiae? Like how much poof should the kick have? How does the low mid in the bass effect the groove in the vocal? \nWhat’s your overarching feeling about that part of the process?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062078652285718654",
    "author": "THE44MOVEMENT",
    "date": "2023-01-09",
    "content": "I find I am really good at either starting or finishing but rarely great end to end and is something I am trying to overcome. If my buddies do the creative work but the production isnt great i can easily bring it to a finished level. If i have the creative idea i can never quite bring it over the line. The mind boggles..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064391425405501530",
    "author": "Calvin Lauber",
    "date": "2023-01-15",
    "content": "It’s unhinged how loud all of the presets are. idk what they were thinking there but it’s definitely fun to play with finding a unique distortion sound",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069005017345957988",
    "author": "Slow Hand",
    "date": "2023-01-28",
    "content": "I've always wondered about a move that they pull in this Murray Head song. During the chorus @ 1:08-1:30 there's this effect where all of the depth gets sucked out of the track and it becomes super present. What is that? As far as I can tell they're muting the string pad and guitar, but it also sounds like they might be muting all of the effects returns so that it dries up.\n\nhttps://open.spotify.com/track/6erBowZaW6Ur3vNOWhS2zM?si=cd755dcd108f4583",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069027570865156206",
    "author": "ALXCPH",
    "date": "2023-01-28",
    "content": "for nice transitions like this, it is Nice make something sound how you would like, and then treat what comes before to be contrastful. Makes for the most convincing impacts to my ears. Working the other way around is not as effective to me, because then you are looking for a  contrasting goal, instead of having a goal and then being easily able to contrast that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070118989994414152",
    "author": "KushKadett",
    "date": "2023-01-31",
    "content": "is there a way to effectively do crossfades in ableton without committing to audio?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070326569077317742",
    "author": "austenballard",
    "date": "2023-02-01",
    "content": "By chop do you mean you're using slice mode or something else?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073022892234788944",
    "author": "Slow Hand",
    "date": "2023-02-08",
    "content": "I haven't done a deep-dive on *Autotune Real Time*'s algorithm, but my guess is that it would be a delay-line style pitch shifter because of it's need to process in real time.\n\nThose types of pitch shifters are just fancy arrays of that pitch-rising/pitch-falling effect that you can get on a high-feedback delay unit by modulating the delay time. So it follows that they're going to have to delay the signal by *a little bit* in order to allow some audio into the buffer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073031742518214666",
    "author": "ehutton21",
    "date": "2023-02-08",
    "content": "And then chop it up from there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073180178370543677",
    "author": "ehutton21",
    "date": "2023-02-09",
    "content": "Which upon A/Bing with a client side by side I was somewhat shocked by how noticeable it was. I never bothered experimenting till a project or two ago with the classic style",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073349801774682194",
    "author": "ehutton21",
    "date": "2023-02-09",
    "content": "Idk if splice will have them but I think if you google you can find some transitions if you need a chop or something there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073447086571389020",
    "author": "hank01564",
    "date": "2023-02-09",
    "content": "Wow, this is a dream come true on so many levels. I’ve been waiting for an opportunity to have someone listen to my Antares complaints! First, it’s insanely glitchy on my M1 computer which is funny since this is the version that’s supposed to be compatible. Still running Pro Tools through Rosetta but Auto Tune will consistently freeze up my sessions to the point of me uninstalling it and going back to the previous version. So that made it unusable for me right off the bat. Second, for some reason, it has a mix knob. Even if I wanted to blend an octave down or some effected vocal with the dry, I’d want the dry to be in tune. Not a natural dry vocal against a tuned octave down. Third, the default in AAX I remember was the craziest setting. I forget exactly what it was but I remember spending 20 minutes just trying to get it to tune and relearn where everything was. My last  biggest issue is that I’m pretty sure Code Meter (Antares iLok substitute) kicks Dante in the balls every time it wants to check my license. This means late packets on my DVS and in extreme circumstances, drop outs. Autotune doesn’t even have to be in the session for this to happen. This is a hard issue to prove so I’m still a little unsure if I’m right about this one but after uninstalling everything Antares, this problem went away. Super niche issue but wanted to throw it in there since it’s been causing gray hairs lately",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076920608492892241",
    "author": "austenballard",
    "date": "2023-02-19",
    "content": "Curious about the Swedish Time Stretching Technique™ but that sounds like some proprietary secret sauce",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076928002685943828",
    "author": "austenballard",
    "date": "2023-02-19",
    "content": "paging @Slow Hand who I know did a bunch of testing on the warp modes a while back\n\nI haven't used them for vowels because either I do it by hand or I get lazy and just chop around the consants and turn on Complex Pro (with HiQ off, which should really be called LoQ IMO)\n\nBut it works great on drum samples, especially if you're pitching them around. I think it's texture now that I'm thinking back on it but I haven't really used Ableton for a few months now",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076945232387657829",
    "author": "BatMeckley",
    "date": "2023-02-19",
    "content": "As always, just listen. If it sounds good it is good. Sometimes I’ll hear the glitch if the zero crossings don’t line up so fade it is. I don’t know how to explain it, with a bunch of fades it just FEELS weird to me. Almost like watching a movie on a tv on that weird setting.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076960108816379944",
    "author": "austenballard",
    "date": "2023-02-19",
    "content": "@BatMeckley ok so I've been wary of time stretching in Melodyne since I first learned it back in high school... I remember my teacher VERY FIRMLY telling us to use the time tool as sparingly as possible. \n\nIdk why it never occurred to me that maybe they had improved it since then. This is great. Def using your \"nudge\" > Melodyne > polish process from now on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076972207303041186",
    "author": "ALXCPH",
    "date": "2023-02-19",
    "content": "HiQ is an interpolation algorithm that lets you pitch or src an audio file with less distortion than with out. What do you not like about it? Gotta be honest I’ve never actually messed with that setting.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076973640639328346",
    "author": "austenballard",
    "date": "2023-02-19",
    "content": "My understanding is that HiQ reduces distortion if you're using complex or pro to change the pitch, but otherwise all it does is reduce audio quality by resampling. It's the  'complex modes are never neutral' disclaimer they put in the manual.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076985956160241674",
    "author": "ALXCPH",
    "date": "2023-02-19",
    "content": "Yeah that makes sense, it has to interpolate the audio, so if you have it off it doesn’t need to touch the audio, so there is no difference. But as soon as you are stretching the audio I would turn it on to get the least distortion possible. Like he mentions just turn of warp when it’s not needed, and on when it is, that way you don’t have to think about it. \n\nWhat I was curious about was why you would have HiQ turned of while stretching or pitching something.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076986201657069669",
    "author": "ALXCPH",
    "date": "2023-02-19",
    "content": "As soon as any audio is manipulated you fidelity is lessened, but the HiQ just makes it less distorted",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076993370070728795",
    "author": "austenballard",
    "date": "2023-02-19",
    "content": "> What I was curious about was why you would have HiQ turned of while stretching or pitching something.\n\nBecause I still have trust issues from Ableton 9 SRC. \n\nI use HiQ when pitch shifting because apparently that's what it's for, but (from what little I can actually understand of Zplane's documentation) stretching is a different operation from pitch shifting. So HiQ stays off.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076995769774653543",
    "author": "ALXCPH",
    "date": "2023-02-19",
    "content": "Maybe the extra distortion is desirable and masks some artefacts",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077047460427468932",
    "author": "austenballard",
    "date": "2023-02-19",
    "content": "It's not a make or break issue at all really... I think this conversation got dragged a bit into the weeds. Anyway, I went back and fact-checked myself for my, and anyone else's, benefit:\n\n- It's Tones mode that roughly works like manual stretching. Emphasis on *roughly*\n\n- HiQ is only intended to reduce artifacts from SRC or pitch-shifting. It does have an effect on audio quality and doesn't need to be on if you're not doing one of those two things. Stretching in Complex or Complex Pro does not need HiQ to be on.\n\n- It's unclear whether the Infinitewave SRC measurements for Ableton apply to the SRC algorithm used for warping.\n\nOn the other point, we don't need to know the nuts and bolts, but it would be nice to unambiguously know when something is degrading sound quality in Ableton's case, or behaving differently in different versions of the 'same' software in Celemony's case.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077055174104858624",
    "author": "jonmatteson",
    "date": "2023-02-19",
    "content": "I would definitely recommend having hi q on if you are doing any time stretching or pitch shifting. The cumulative effect of it is very noticeable in my experience.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077055881830740048",
    "author": "austenballard",
    "date": "2023-02-19",
    "content": "per the manual, HiQ doesn't affect time stretching, only SRC and pitch shifting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077581939957051514",
    "author": "ALXCPH",
    "date": "2023-02-21",
    "content": "I think it does actually. HiQ from what I understand just interpolates the signal. So when you are stretching it, it upsamples the audio to have more sample points for more accurate stretching and then Downsamples it to the original again for playback so you get less distortion after the fact. At least it’s how my brain understands it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077626285100109887",
    "author": "austenballard",
    "date": "2023-02-21",
    "content": "I don't know if there's adequate information for either of us to know if we're 'right'.\n\nWhere things are really unclear is whether this applies in Complex and Complex Pro modes. Those are licensed Zplane Elastique algorithms which, according to the product page, is for both \"time stretching & pitch shifting\"\n\nhttps://licensing.zplane.de/technology#elastique",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077628248676110396",
    "author": "austenballard",
    "date": "2023-02-21",
    "content": "There's pretty extensive documentation of Zplane Elastique, which I did attempt to read once upon a time:\n\nhttps://licensing.zplane.de/uploads/SDK/ELASTIQUE-PRO/V3/manual/elastique_pro_v3_sdk_documentation.pdf\n\nas far as I can make out, the pitch shifting and time stretching functions are unrelated operations, and pitch shifting uses resampling, but time stretching does not.\n\nI'm also a dummy, though, and a lot of what's in this document is waaaay above my head",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078085654296133682",
    "author": "JakeTB",
    "date": "2023-02-22",
    "content": "Method: Recorded vocal at 192kHz into Pro Tools. Exported via Shift+CMD+K at 192kHz and again at 48kHz. Vocals were both imported into Melodyne application in monophonic mode. Administered time stretching (both lengthened and shortened) via the time tool. Also administered pitch shifting via pitch tool and checked detection of tuning via correct pitch macro. After exporting these, they were reimported to see if detection had changed.\n\nObjective Results:\n-Upon import, vocal tempo detection was different. (One detected in 5/4, the other in 3/4, at drastically different tempos).\n-For short notes, when using the time tool to stretch, there were audible differences in results.\n-For long notes, when using the time tool to shorten, there was significantly less audible difference (subjectively: no difference)\n-For pitch detection, the algorithm detected pitch differently both audibly and visually.\n\nSubjective Opinions:\n-Time stretching yielded reduced artifacts in extreme settings when done at 192kHz. It did not eliminate all artifacts, but did reduce them.\n-When time stretching in a more nuanced way, the differences in artifacts were negligible.\n-When adjusting pitch manually, there was no audible difference in the quality of the pitch shifting at different sample rates. (For this test, everything was shifted up half an octave before any adjustments made)\n-When detecting pitch, both behaved quite differently. This was partially due to detection of select blobs being different at either sample rate. (This was most surprising to me of all the results)\n-When blobs were adjusted to match as closely as possible by hand, the tuning seemed to behave identically, including locations and levels of artifacts. (My gut says they “felt” different but that is most likely either placebo or the slight differences in true blob locations)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078089900940869673",
    "author": "austenballard",
    "date": "2023-02-22",
    "content": "Your observation on no audible difference for pitch shifting, yeah I couldn't *hear* the difference either but I also did this on my MacBook Air listening through system output 🙃  but measurement suggests there is a difference and it might be significant if you're combining dramatic pitch, time, formant, god knows what else shifting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078090161642033193",
    "author": "JakeTB",
    "date": "2023-02-22",
    "content": "Ah interesting regarding measurements for pitch shifting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079444029726539876",
    "author": "NoahNeedleman",
    "date": "2023-02-26",
    "content": "Alright guitarists:\nY’all like amp distortion over pedals? Also what’s your fav fuzz box?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079803130247651388",
    "author": "Will Melones",
    "date": "2023-02-27",
    "content": "I was really pushing my luck though, between clip edits and intense Melodyne mangling. It was time to start over 🙏",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080569938848268369",
    "author": "Nomograph Mastering",
    "date": "2023-03-01",
    "content": "This sounds needlessly complicated, using a limiter to remove peaks, then adding them back in with distortion added?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080586191973392385",
    "author": "Nomograph Mastering",
    "date": "2023-03-01",
    "content": "Right. By distorting the delta he is adding harmonics only to those moments where the limiter is acting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080586608853663804",
    "author": "Nomograph Mastering",
    "date": "2023-03-01",
    "content": "An *very* important point about clipping, it does not chop off peaks (as in discard them), it redistributes the energy of that peak across the whole frequency spectrum",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084556795458101308",
    "author": "Maxim",
    "date": "2023-03-12",
    "content": "I love exploring ideas and chasing *that* feeling. But once you have it or you know you have enough (and you can see it visually in the room) it’s that moment. \n\nIt can be so obvious especially if you’re not the one pushing the buttons and just feeling & observing. There’s a free flow of creative energy and nobody wants to be the person that could kill that. It’s almost an impossible trade off. Do I trade what is against what could be? In the spirit of creativity it tends to be the latter.\n\nCommunication is such a skill I’m realizing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084782879407616000",
    "author": "Ross Fortune",
    "date": "2023-03-13",
    "content": "Have to say I was and still am on the crafty train. Tried a month of Melodyne end of last year, and it really does get the job done but for the majority of the work I do AT Pro (pitch + time time stretching is killer), VocAlign, PT Elastic and good old fashioned editing have served me well and will continue to do so until maybe next melodyne sale",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087434656917495918",
    "author": "LAPhill",
    "date": "2023-03-20",
    "content": "I could see a world in which I set up a modular effects station, or pedal-board type setup. That sounds like a lot of fun.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090392207405629520",
    "author": "austenballard",
    "date": "2023-03-28",
    "content": "Thanks! There's a part of me that really likes the extremely tight, very-tuned sound, it adds a dimension to pop vocals that you don't get with more natural harmonies/doubles. I've been experimenting with using both a lot lately",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092795238436843581",
    "author": "youngteam",
    "date": "2023-04-04",
    "content": "Which one is it? The distortion when it hits the first time always catches me off guard in the best way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092798553182699521",
    "author": "youngteam",
    "date": "2023-04-04",
    "content": "Thank you! Yeah it happens a lot unfortunately, can’t imagine how many chop snares I have in my HD",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092957974164672632",
    "author": "Josh",
    "date": "2023-04-04",
    "content": "I actually went through my entire library recently and moved all the ones i use consistently and it was only like… 1400 files? For drums, 808s and some effects. And that was me moving entire folders. Shits wild.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093042260557439077",
    "author": "BatMeckley",
    "date": "2023-04-04",
    "content": "Oh man I’m jealous you get to hear it for the first time. His “solo” ish record after Diorama. Firing on all creative cylinders, not bumpers. A truly brilliant piece of work",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095062271350280303",
    "author": "louisvie",
    "date": "2023-04-10",
    "content": "thinking basics : filtering, eq & compression, distortion too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095795260761833542",
    "author": "Edward Rivera",
    "date": "2023-04-12",
    "content": "Is it an indie project ? Label ? Paid ? Friends ? Client ? What does your role constitute ? Who has creative direction ? Conversations and transparency are SACROSANCT",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095795870974365706",
    "author": "Deleted User",
    "date": "2023-04-12",
    "content": "It’s an indie project I’m doing on spec. I’m basically doing everything as a producer except songwriting and recording. Creative direction wise- it’s pretty flexible but I’d rather not deviate too much from “singer with a guitar” world and both the artist and I are on the same page about that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095826586315526185",
    "author": "Nomograph Mastering",
    "date": "2023-04-12",
    "content": "I'm simplifying the story for effect but the thrust of it is true",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1096115755805835294",
    "author": "Nomograph Mastering",
    "date": "2023-04-13",
    "content": "I give a lot of time and energy to the fact that mastering is the end of the creative process, stepping from a space where anything is possible (drop a part, add a track, recut a vocal, remix etc) to “we’re done”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100515912123162694",
    "author": "Deleted User",
    "date": "2023-04-25",
    "content": "not an fft stuff but cecilia is also cool for mangling stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100519387993231472",
    "author": "Deleted User",
    "date": "2023-04-25",
    "content": "Ahh I see, that’s what I thought it did. But it’s a pitch shift feedback loop.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105156134240800828",
    "author": "Josh",
    "date": "2023-05-08",
    "content": "A little distortion and transient designing and it sounds like a real hi hat",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105928996379705375",
    "author": "BatMeckley",
    "date": "2023-05-10",
    "content": "Lot of good effects makers out of MN weirdly enough?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108763304089886800",
    "author": "NoahNeedleman",
    "date": "2023-05-18",
    "content": "It was a lot faster than I expected cause all the plugs are right next to each other. So I’d just select the kontakt plug on the adjacent channel, solo a channel in the kontakt mixer, repeat until done. \n\nTriggering didn’t work great cause the performances are SO dynamic, but eq and distortion goes a long way. I’m not making any hits like this, but for a hallmark Christmas movie? Golden.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113176640302895185",
    "author": "chrissorem",
    "date": "2023-05-30",
    "content": "Has Anyone attempted the prismizer vocal effect? Is it just harmonizers ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114442257794351106",
    "author": "louisvie",
    "date": "2023-06-02",
    "content": "is the 808 era coming to an end anytime soon ? i feel like i'm starting to get tired of trap sounds, even the weird ones, even when used by experimental / alt artists and producers in good songs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1115767052989370498",
    "author": "chrissorem",
    "date": "2023-06-06",
    "content": "I guess so , someone asked if I could do the prismizer effect  and I had never heard of that… to my ear it sounds like a layer of harmonizers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117243146770858065",
    "author": "Deleted User",
    "date": "2023-06-10",
    "content": "I was the most excited for new sound during XXXTentacion’s popularity. Right now, there’s not a whole lot of the experimental spirit that aligns with emotional merit in the mainstream hip hop that was around during that time at least from what I hear. \n\nThere’s still a lot of experimentation but not a lot of them actually hit on an emotional level the same way as back then around 2016-2019 whether it’s just having fun or some deep shit. But who knows… maybe it’s cause I turned 20+ and it still hits the same way for young adults and teens. But my feelings are a lot of new records were experiment for experiment’s sake, which is still cool. But rather than “I got these stories, how can I fuck with it?”, it feels more like “I wanna fuck things up. How can fuck with it more?”. \n\nI don’t know 🤷‍♂️ Maybe I’m one track minded, but mainstream hiphop hasn’t really been all that exciting to me since the covid times.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1120100606112190635",
    "author": "peterlabberton",
    "date": "2023-06-18",
    "content": "Like, be about something, on the creative side, and don’t shy away from it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121726629945802832",
    "author": "Ross Fortune",
    "date": "2023-06-23",
    "content": "Just thinking how effective even Fruit Shaker is, is there a library that does live hi hats in a similar way?\n\nI know this has been covered here before, and there are methods, but a library like that could solve a problem I still haven’t worked around",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122931333803561004",
    "author": "louisvie",
    "date": "2023-06-26",
    "content": "I'm about to do  foley / sound design / scoring for an artist's experimental short film. They didn't get sounds during shooting on purpose, to create this very particuliar sonic landscape they have a vision for. \n\ni kinda know how to make beats and kinda know how to record and mix my rock band (in Ableton, in which I'll do the scoring too)\n\nfoley feels like it's gonna be long & tedious but relatively simple ? compared to potential \"let's put a jazzy song ambience background there\" and i have to actually write a jazz piece\n\nSo, any former experiences, anecdotes, advices on scoring and/or scoring in Ableton are welcome.\n\n#1 thing to do is ask for how long the film is.\n#2 is asking my real musician friends for some help (seems like they'd be down for it)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1124090110007320607",
    "author": "KushKadett",
    "date": "2023-06-29",
    "content": "When you distort stuff in the analog realm it kinda fattens the lower mids easier so you need less layers for it to sound full imo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126309007833956442",
    "author": "OJ",
    "date": "2023-07-05",
    "content": "Does anyone have advice on creating sample packs? Like do I go record a real snare and then put distortion on etc to get like a Lex Luger Snare for example, how is something that clean made, not like a real sounding snare but these trap snares for examples, or just unique sounds??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137066080129515564",
    "author": "chrissorem",
    "date": "2023-08-04",
    "content": "I’ve also mangled drums before to sound under water or manipulate them in a way that the mics can sound like two separate performances in a cool way. And then brought that hifi hat mic in juts for a  time and you can make an organic kit sound like a programmed kit. This has to be for the right kind of song ect. But record all the damn drums so I can mute them or use them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138114680657805396",
    "author": "Zack Hames",
    "date": "2023-08-07",
    "content": "Bet lots of those have been done in less than ideal ways. Experiment, find your fav for what it is and turn it in!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150096456104026224",
    "author": "Josh",
    "date": "2023-09-09",
    "content": "This is one of the most creative things I’ve seen in ableton",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150509460444426444",
    "author": "Dove",
    "date": "2023-09-10",
    "content": "Forsure, i personally think AI is the best thing happened to Artists. From what we’re seeing everywhere, its replacing all the non-creative jobs which means there’s more people getting into music or any kind of art. I am waiting for the day i see everyone doing what they genuinely love.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150863942286049330",
    "author": "stevestmartin",
    "date": "2023-09-11",
    "content": "I think in the way DAWs have changed music making, AI will do the same. It's not replacing your job, but it will without a doubt change the interface of how you work with music.\n\nImagine not having to learn every control on a Synth, or a compressor, or EQ but instead being able to describe the sound your looking for to a bot. It doesn't make you any less musical, but allows you to focus more on the art/creative side of things.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150874500578156584",
    "author": "cian riordan",
    "date": "2023-09-11",
    "content": "Sorry not sure I understood the question then. You mean the reverse -- having studio singers do BGVs then just modeling the feature artist so they dont have to do the work?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154269646309044264",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-20",
    "content": "I haven't upgraded to X yet, but AT graphical mode has been famously buggy and the people I know who use it bounce it down to audio in a panic before it glitches out (or use it in AudioSuite) 😅 Is X more reliable in your experience? Is the time editing up to par with Melodyne?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155587424643186729",
    "author": "Skyler Young",
    "date": "2023-09-24",
    "content": "And better/more modern effects - the vibrato is based off the shallow water pedal and can easily give you cassette sounding wobble or nice movement that people usually do in like rc20 - but because I do it in the audio samples instead of just the incoming buffer you have a lot more freedom (and It has different vibrato movement per voice)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155587543933407332",
    "author": "Skyler Young",
    "date": "2023-09-24",
    "content": "The reverse effect I’m obsessed with - it syncs to your bpm and can make really cool pumping sounds or intresting swelling chords that would typically take a number of steps to do otherwise",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155587891318247566",
    "author": "Skyler Young",
    "date": "2023-09-24",
    "content": "The tone shift effect is something that I was thinking about for a long time - it manipulates which samples you access for each note played. For example you shift it +12 and play C1 it will take the sample from C0 and play it at double speed - changing the character of the sound sometimes drastically. If the range knob is at 50% and shift is at 0 and you play C0 it will use the sample from G0 (because it’s 50% the distance from C0) and if you play C2 it will use the sample from G1 - also has interesting effects on the sound. I still haven’t figured out the best way of explaining this function but I find it really usable and I’ve never seen sometime implement it before.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161018647817490512",
    "author": "NoahNeedleman",
    "date": "2023-10-09",
    "content": "But if you’re not getting paid, it’s not a job right? It’s just an experiment?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161028544571392100",
    "author": "xico1702",
    "date": "2023-10-09",
    "content": "Thank you for your answer about this 🙂 \n\nSo I have to see the resolution of the problem in two phases:\n1) work on the input (listening other stuff) and experimenting alone\n2) disobey fear and experiment",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161029061930389626",
    "author": "LAPhill",
    "date": "2023-10-09",
    "content": "Experiment alone if that's a more comfortable starting point. If you have friends who work in these styles, hit them up for tips, feedback (the #🤝collab-talk  channel is a great place for this, too), and bring in people who can help guide you. Don't feel like you have to figure everything out on your own!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1166421436982898749",
    "author": "Dove",
    "date": "2023-10-24",
    "content": "Watched this recently, Love the experimentation.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169717011614552135",
    "author": "Rollmottle",
    "date": "2023-11-02",
    "content": "i AM very effective 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169718787814207538",
    "author": "Nomograph Mastering",
    "date": "2023-11-02",
    "content": "Granted it’s not a creative space so going drill Sargent is not the thing for a shy singer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169719002596118620",
    "author": "Edward Rivera",
    "date": "2023-11-02",
    "content": "That's why it's a hard analogy for me to get behind. Creative collaboration and going to war don't seem applicable to me. But I get your point of doing great work with people you have no rapport with",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171529453516619776",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-07",
    "content": "I think that effect was „donald glover doing his thing“",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171530885087101020",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-07",
    "content": "Oh my bad sorry about that. I thought you were referring to the way he sings which a lot of ppl believe to be an effect I think",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171551459419111544",
    "author": "NoahNeedleman",
    "date": "2023-11-07",
    "content": "Small Slap / Room Ambience + gate after effects",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171566330797903912",
    "author": "thejadenmejia",
    "date": "2023-11-07",
    "content": "Awesome! thank you all\n\nLast one\nI know this one’s probably too simple for me to be asking, but just in case my theory is wrong, what’s going on here on the effects.\n\nhttps://open.spotify.com/track/33SNO8AaciGbNaQFkxvPrW?si=qEW3QkHeT5y6_OoARzsDRg",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171612820115296357",
    "author": "NoahNeedleman",
    "date": "2023-11-07",
    "content": "Some drive or distortion like decapitator or tapehead, saturated & filtered slapback delay",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174160430952890439",
    "author": "thejadenmejia",
    "date": "2023-11-14",
    "content": "Alright guys I’m back with another episode of “what effect is on this vocal?”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174165592689889280",
    "author": "Slow Hand",
    "date": "2023-11-14",
    "content": "It's subtle, but it sounds to me like a single-voice chorus effect with a more-emphasized pitch depth (possibly +1/-1 step?) and a medium rate of modulation.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174166214092791891",
    "author": "Slow Hand",
    "date": "2023-11-14",
    "content": "Essentially it's just pitch modulation blended in with the dry vocal. There's lots of devices that'll do it for you: chorus, (guitar) vibrato effect, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174166380497616906",
    "author": "Slow Hand",
    "date": "2023-11-14",
    "content": "Like a less cranked-up version of this old Tik tok effect (1st and 3rd clips): https://www.youtube.com/watch?v=A5gu_QkqIO0",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174170565288939650",
    "author": "thejadenmejia",
    "date": "2023-11-14",
    "content": "Ooooouuuu that’s so neat. Dude that’s so funny. I never made that connection with that meme effect 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177695725740621864",
    "author": "oaklandmatt",
    "date": "2023-11-24",
    "content": "@Matthew The Cooke🎄🎅🏻 yeah Shaperbox is one of these multi-effect plugins that fuck with time and space and distortion and many other effects. It's a great plugin to throw on an existing sound as almost a randomizer effect. It has a huge library of presets that open up possibilities for creativity that I would never choose. EASYFUN was a madman with it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177856417047248938",
    "author": "spectrummasters",
    "date": "2023-11-24",
    "content": "If you have a main melody and send it into the timeshaper …..try experimenting with the stutter 1 and 2 presets at different length settings ….and then play with the mix percentage . Sometimes you get some total gems 💎 that can work great for a breakdown section",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178132892489101402",
    "author": "Slow Hand",
    "date": "2023-11-25",
    "content": "It's also a pretty rad vocal effects processor to boot!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180264703126155285",
    "author": "Chenoatarin",
    "date": "2023-12-01",
    "content": "I’ve been using them and there’s some really cool distorted unique stuff in here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181037280840929371",
    "author": "Slow Hand",
    "date": "2023-12-03",
    "content": "That would be interesting, but (like green screens) they are some no-vibe-having environments to work in, and (at worst) may enable record makers to be even more non-committal about creative choices on the day of tracking.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181636243499536505",
    "author": "Will Melones",
    "date": "2023-12-05",
    "content": "It sure feels more creative putting things in concrete form in the world, rather than adding 1s and 0s to cyberspace",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181858294097252392",
    "author": "Deleted User",
    "date": "2023-12-05",
    "content": "I’m trying to get my DAW to have the same workflow as MPC of ASR. The thing that I have the most trouble with is changing sample start point with a controller so I can chop samples with a dial instead of using the mouse",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182116615714770984",
    "author": "Rollmottle",
    "date": "2023-12-06",
    "content": "when the chorus is in, does the vocal go to a set spot to the left? any hidden settings in the plugin that are not set right? looks like a stomp box style effect...wouldn't expect it to be mono, but maybe?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183502650885558272",
    "author": "jonmatteson",
    "date": "2023-12-10",
    "content": "i usually will just nudge around until it feel right but if you want it to be relaxed drag the pick scrape to the down beat. if you want it to rake do the “meat” of the chord. \n\nI would also recomend trying to split the audio on the grid and drag that around instead of quantizing because it can have less audible effect kind of like time aligning a vocal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186396444475797574",
    "author": "cian riordan",
    "date": "2023-12-18",
    "content": "If you're building the song around the HH sound, then you might get snazzier with room mics and effects. But hi hats have a small window in which they don't sound terrible, best to just aim for that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189655057696825354",
    "author": "LAPhill",
    "date": "2023-12-27",
    "content": "To further dig in on the pre delay time - It also affects the perception of how far into the room the source is. If you have a long predelay, it creates the effect that your source is close to you, in a large space. Conversely, no prelay will position your source farther into the room, where the reverb and direct signal hit your ear concurrently. (These effects work in tandem with wet/dry mix to further accentuate the positioning)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190579756643647598",
    "author": "Slow Hand",
    "date": "2023-12-30",
    "content": "I've got a challenge for the sound design nerds: There's a cello motif that runs from 0:16 to 0:27 on this track and I cannot for the life of me figure out how the composer has achieved something so thick, distorted, and claustrophobic. I love it: https://open.spotify.com/track/7x4GzEMWQZrrSLbmWxu2hH?si=8d4ea18200424376",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190579777573236757",
    "author": "Slow Hand",
    "date": "2023-12-30",
    "content": "My working theory is that it's a cello pitched down an octave in Melodyne, perhaps with some formant shifting too. I'm trying to emulate it in Melodyne right now, but am not quite there.\n\nBut the distortion and dramatic dryness is a total mystery to me. I don't know this flavor of distortion at *all*. There also seems to be a *very* nice sub octave layered in there too. The funny thing is that it all sounds very natural to me. As if there's not a tremendous amount of processing going on. I feel like I'm missing something here.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190598789694771260",
    "author": "RÜSSO",
    "date": "2023-12-30",
    "content": "this is an interesting sound lol. it reminded me of the new synth in ableton: Meld. it can make some strange distorted bubbling noises similar to the sound above. i will try and see if i can get it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190717615409209455",
    "author": "Slow Hand",
    "date": "2023-12-30",
    "content": "Thanks for the insight, everyone. Very helpful. I’m still wondering about the distortion, though. I’ve never heard anything like it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190727408685416570",
    "author": "Slow Hand",
    "date": "2023-12-30",
    "content": "It's a very unique distortion on the Alter Boy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194249778595381258",
    "author": "Ross Fortune",
    "date": "2024-01-09",
    "content": "Guitar wizards, I'm experimenting with clean 80s tones and wondering how Mutt and the lads might've got the clean strums in the pre at 0.52.\n\n*jang jang jang*  \"I wanna know tonight\" *jang jang jang* \"Are you alone tonight\" *jang jang jang* \n\nFeels like there's layers of chorusy electric, but maybe a plasticy layer of DI'd acoustic or something in there too?\n\nhttps://open.spotify.com/track/2PFIZFcGry0po3ZfRZkzKc?si=c691d11446cf40e1",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196608744277151805",
    "author": "Nomograph Mastering",
    "date": "2024-01-15",
    "content": "Seems like an awfully effective way to avoid life",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197059035418071110",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "2. Vocal chops \n\nListen down to the main vocal and whatever really jumps out ….a little melody run or phrase ….chop up and replay on the keyboard\nThink of your vocal chops as a keys part . Play the chops backwards , re form a new melody , reverse etc . These chops are now a rythmic device",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197060397732208651",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "Because it’s an open and minimal drum production listen to Calvin harris and the disciples how deep is your love \n\nIn this house style you want to really experiment with note velocities and swing settings (how far you push the swing ) to get it spinning. U.K. producers wrote early house and garage with the grid on 1/24 (triplets ) for the snares and hats . So we are talking take your swing potentially all the way to triplet time  . \n\nKick is to have subtle little syncopations and doubles to push the groove (before transitions/ on turnarounds  for example )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197061149372448838",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "4. Bass and keys \n\n\nBass has to be the hook playing off the vocal chop \n\nIn logic the FM synth and I think it’s ES1 all have the house bass and organs and pianos (will check the modules and edit this if in correct )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197073341446623253",
    "author": "Deleted User",
    "date": "2024-01-16",
    "content": "I’m wondering if you have any examples of unconventional risers and transitions. I suck at risers and transitions effects, so I’d like to come up with something else besides laser up downers or noise sweeps.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203141729499222076",
    "author": "NoahNeedleman",
    "date": "2024-02-02",
    "content": "Fastest effective path please.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203195320704696340",
    "author": "Eric Martin",
    "date": "2024-02-02",
    "content": "I’m with you, I layer samples for an effect, not for the sound ¯\\_(ツ)_/¯",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204563028608032818",
    "author": "Ross Fortune",
    "date": "2024-02-06",
    "content": "No doubt, but it’s very well laid out and just sort of… does shit you might not encounter otherwise. Multiband treatment is super simple and effective, GUI is brill. Try demo maybe. See if it works for you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204564957346136134",
    "author": "Ross Fortune",
    "date": "2024-02-06",
    "content": "Noice. Also got some wild presets that completely mangle - good when you’re stumped with a sound that needs life but you have no idea what to do with it. Same with the UAD Moog XL filter.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204570836791722114",
    "author": "Deleted User",
    "date": "2024-02-06",
    "content": "BYOME is also cool if you wanna do some modular multi effect stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204571659852455957",
    "author": "Josh",
    "date": "2024-02-06",
    "content": "Seems to have the edge on turning little dry sounds into big pads and soundscapes. Shaperbox has the edge with rhythm based glitchy thing. I sorta hate the UI of infiltrator tho so we’ll see. 👀",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1208184197026418781",
    "author": "Adam Thein",
    "date": "2024-02-16",
    "content": "You probably already worked through this all already but if not, maybe try going into Note Assignment Mode, selecting all your blobs, and de-select Sibilant Handling and try re-selecting.  Seems like there was a glitch when the Melodic algorithm first ran the analysis.  Grabbing all the notes in Note Assignment and wiggling them a little might also correct any analysis issues.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209168201225736272",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-19",
    "content": "Artist I’m working with asked me to pitch up a song one or two half steps (she will decide the next few days) normally wouldn’t be a problem since I usually keep all the midi around but this was started by another producer and I only have audio from him and afaik he right now doesnt have access to the hard drive with the session. Additionally a lot of his stuff was real electric guitars with no MIDI anyway \nI‘m working with pro tools atm do you guys think the pitch shift algo is reliable enough or should I switch to something different e.g. melodyne and if yes is there anything you can recommend?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209169350330683412",
    "author": "Zack Hames",
    "date": "2024-02-19",
    "content": "As far as PT is concerned, the new ElastiquePro has been pretty great for everything other than drums where I still use “Rhythmic”.\n\nYou also might experiment with pitching all of the non midi stuff TOGETHER; I find that when you pitch each individual element or track, it opens up more chances for errors/glitches. But that may not be possible.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209169537317208075",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-19",
    "content": "Thanks for the tip! How would u do that? Routing everything to a bus and applying the pitch shift on there?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209172480099356742",
    "author": "popaganda.",
    "date": "2024-02-19",
    "content": "Worth it to experiment with a few if you have the time. Soundshifter, Ableton, etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209955439869952031",
    "author": "Zakhiggins",
    "date": "2024-02-21",
    "content": "Honestly by far the best pitch shifting tool I’ve ever used is the stock FL studio one. Put audio in stretch mode before you do it and it holds the integrity extremely well. Whenever I have to pitch a song up or down I bounce stems out to FL and then back in to PT and it always works",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210642780867534848",
    "author": "mariano",
    "date": "2024-02-23",
    "content": "btw on some of these vids i still notice that slow attack / smooth effect i was talking about",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212098292591362158",
    "author": "Nomograph Mastering",
    "date": "2024-02-27",
    "content": "Seriously though I would say that about half the time an artist sends me something that they’ve trimmed or edited in some way it gets mangled. I’ve had people accidentally time stretch, accidentally print through the mix bus processing again, chop whole sections off …",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212230415633481798",
    "author": "Deleted User",
    "date": "2024-02-27",
    "content": "what do you mean when you say production? \n\nsome thing I can think of off the top of my head\nwriting process\narrangement\nsound selection & mangling\nworking with an artist or other humans\n\none thing that has been helping me lately with the writing portion is figuring out chords for all sections early on. this might be obvious for some folks but I’ve been way too focused on figuring out instrumentation and making new sections work by changing instrumentations. So I’ve been trying to pay more attention to linear development. \n\n@slow.hand prompted really good ideas on figuring out chord progressions. Speaking of which, I do need to put together a way to use google form and compile all the oblique strategy forms in one place sometime soon",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1213298777037865051",
    "author": "Josh",
    "date": "2024-03-01",
    "content": "When I started working in PT again found the time stretching clumsy I started using melodyne for it and realized how much I’ve been missing out on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1213980381682991154",
    "author": "Johnny I",
    "date": "2024-03-03",
    "content": "Working on a project where we just have the foundational acoustic guitar tracks for 9 songs, and are about to start overdubbing. Everything recorded to click, but would like to change the tempo on a couple of tracks, and in a couple of sections...most likely no more than 2bpm in either direction. Want to do this before we lay anything else down...what's the best time-stretching tool to accomplish this while preserving the audio as best as possible? I have access to RX, Melodyne, Pro Tools...haven't explore time stretching yet, so any advice is appreciated. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216184460681150516",
    "author": "Slow Hand",
    "date": "2024-03-09",
    "content": "This thing better malfunction, stutter, and fail catastrophically.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217488908011438243",
    "author": "livdejonghelvrs",
    "date": "2024-03-13",
    "content": "What effect(s?) is used on the vocal in this track? \n\nhttps://open.spotify.com/track/6PUPRb62MyZo6MRlEQZKFq?si=aA3Z13I7R8a9Mr93iivR8g",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217491169613975692",
    "author": "esquinalee",
    "date": "2024-03-13",
    "content": "Love this album. To me it sounds like a fast chorus/vibrato effect",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220507257737842729",
    "author": "Ross Fortune",
    "date": "2024-03-21",
    "content": "He’s got that 8 string beast for sure, but the white noise /sine wave stuff through whatever’s mangling it is incredible",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221904795078758511",
    "author": "louisvie",
    "date": "2024-03-25",
    "content": "Confidence and experimentation.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237142454797336637",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-05-06",
    "content": "Love her approach. \n\nAlso God I love Tape Notes (and song exploder), in the beginning I would just listen to familiar artists but almost everyone who goes on there (no matter the type of music output) says something creatively inspiring",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241080579043364874",
    "author": "Skyler Young",
    "date": "2024-05-17",
    "content": "Yes! Daws would have to send note length info - which would be super easy for them to add. I just think because midi is originally mostly geared at live playing they don’t do it and could cause a crazy amount of bugs if plugins don’t implement correctly\n\nYes - this is something that could unlock many types of new effects being made. For example my reverse note function would not have to be locked to a single note length anymore. Honestly that’s the only thing that I really have felt is strongly needed\n\nHave not looked into midi 2.0 yet but I need to !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241822574250299433",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-05-19",
    "content": "Is that an effect of living behind the scenes and seeing how the sausage is generally made?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242971719921045625",
    "author": "chris_donlin",
    "date": "2024-05-22",
    "content": "Does anyone have a quick way to take a melodic riff on guitar/keys/etc and have each note play in reverse? I dont want the whole clip to just play backwards. I want the melody the same. Slice to new midi track in ableton almost gets me there but i cant reverse the samples within each sampler... or can i?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242973399945445397",
    "author": "! Andy !",
    "date": "2024-05-22",
    "content": "Slice each note you want to reverse in the audio file & hit r",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242975212782227456",
    "author": "Slow Hand",
    "date": "2024-05-22",
    "content": "I don't think *slice to MIDI* is the way here. It will become tedious if you have rests in between notes.\n\nImagine that you have a quarter note followed by a quarter note rest in your melody. If you *slice to MIDI* it will slice that sequence into a half-note length clip. If you then reverse that clip the rest will play *first*, followed by the reversed quarter note.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242975662848086127",
    "author": "Slow Hand",
    "date": "2024-05-22",
    "content": "Doing it manually is probably the safest bet until someone writes a Max patch to automate it. Print to audio, slice at the note start and end, and then hit *R* to reverse the desired notes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244756143427944528",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "Hey y'all, I'm looking to try a new blown-out distortion plugin. Any recommendations? I'm trying to broaden my palette.\n\nI'm looking for something with a lot of character, sculpting ability, and sound design potential. Something that can go from 0-100 quickly. Examples would be Decapitator, Trash 2, or NI's Driver. Unique features are welcome.\n\nWhat are y'all using and why do you like it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244766639849738271",
    "author": "! Andy !",
    "date": "2024-05-27",
    "content": "I use it for extreme distortions & overdrives, works really well for hyperpop kinda stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244773188957634580",
    "author": "Ross Fortune",
    "date": "2024-05-27",
    "content": "Camelphat was off the chain. I made a bunch of outrageous distorted feedback risers with it in 2014, and I’ve only now finally made a track they fit in. Absolute the sauce though, and I don’t know how else I would’ve gotten there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244794583599288320",
    "author": "matthewrederburg",
    "date": "2024-05-27",
    "content": "Check out these offerings from Airwindows:\n\nLoud\nMackity\nFracture\nBusscolors\nADClip8\n\nThey do lack a lot of sculpting ability, but they offer some deliciously distortion options.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244845365409222676",
    "author": "Josh",
    "date": "2024-05-27",
    "content": "Also what Bradley said is very common as well. Having a sub oscillator going will help but latest favorite distorting the filter and playing with the oscillator balance to see how it changes the distortion characteristics",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244845494086402169",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "Depends on the DAW. I use Ableton so I do all of the parallel processing right on the channel using an *Audio Effect Rack* like this:",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1244846244598124564",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "This also allows me to keep the transient punch on the low end while the midrange is getting flattened by the distortion.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244846400584552550",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "You can't see it, but I've dialed out all of the low end inside of the Manny Distortion plugin, so that it's not fighting against the dry layer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247264007463768074",
    "author": "spectrummasters",
    "date": "2024-06-03",
    "content": "I have a male vocal , and auto tune is introducing a nasty distortion on only one sustained note . I’ve never experienced it before and it’s bizarre . The distortion sounds like clicks and it’s definitely not in the audio file . Have checked in rx ….and autotune does it when I use it as a clip effect not just as a channel insert . So bizarre and I can’t work it out . Has anyone ever experienced this and found a fix ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247269197784809522",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-06-03",
    "content": "Is the vocal slightly distorting by any chance? (not clipping but distortion in throat?). I get it quite often on rougher vocals (had it today), try messing with the autotune detection mode (Tenor/Alto/Low etc) and tracking setting, if nothing works melodyne is usually the only option for those specific notes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247269434658394214",
    "author": "spectrummasters",
    "date": "2024-06-03",
    "content": "Yes ! it is a rougher vocal with a raspy mid , but it’s not actually distorting in the source file …..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247556509550772324",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-06-04",
    "content": "bouncing out live stems from a studio session for the first time and got a questions - would be dope if anyone could answer them❤️ : \n-) when bouncing the vocal fx, do you bounce everything together or do you keep the lead and BV effects seperate? Meaning, do you bounce the FX once with just the lead vox on, and the another time with the backing vox? \n-) When bouncing vocal stems, do you bounce out doubles and harmonies seperately or as one? \n-) do you generally keep the mix bus processing on, and do you do anything to the stems after that? limiting, normalising? \n-) anything else that's imperative when doing that stuff that might not be obvious when doing it for the first time? \n\nThank you so much already for your answers!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248265665597669468",
    "author": "SoundsLikeJoe",
    "date": "2024-06-06",
    "content": "Stanky feel on that guitar distortion too. Overloading the pre or a compressor maybe?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248268389278027877",
    "author": "SoundsLikeJoe",
    "date": "2024-06-06",
    "content": "TG channel on dime is my wager!...  I breakpoint my G bus clone from time to time as a funky distortion.... cranking makeup to max.  Has that circuit crunch sound...  an abuse and error in most context, but good flavor in some adventurous projects.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254872042319380492",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-06-24",
    "content": "Yeah I like to reduce sample rate and then bring back some of the high end with anti aliasing. Then messing with the sample size and you get some interesting glitchy textures.\nTurning the distortion and saturation up miniscule amoubts (about 0.1-0.3%) also rly helps to make vocals more intelligible \nOn top of that, it‘s also rly great if u rly wanna f*ck up a sound. It truly is a great plugin",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255929710924402779",
    "author": "Bryan DiMaio",
    "date": "2024-06-27",
    "content": "also in terms of crazy cool delay plugins I found out about recently, one is unfiltered audio Tails, it can do some bitcrushy effects on the delay repeats",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261167517385232455",
    "author": "chris_donlin",
    "date": "2024-07-11",
    "content": "I guess ill try that first and see if it's hitting the mark. Do you know what i mean with the ripple haha, idk how else to describe it. it's almost like distortion but not",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261502438838370446",
    "author": "hyanrarvey",
    "date": "2024-07-12",
    "content": "Yeah and if you need to access the di cause your guitar tone sucks just reverse what you’re doing in downmixer and load up an ampsim or dup it and blend in the ampsim with the real amp. Just to be sure to check phase maybe have to nudge it etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1262417688269951006",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-07-15",
    "content": "Haha maybe I went a bit far there for effect 😅 I'm not deep into electronic production but it's a take I've heard a lot - Nexus being very usable rompler sounds modeled after the stuff already out there being heavily used. Not hating on it, I have it and use it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264593904506900490",
    "author": "Maxim",
    "date": "2024-07-21",
    "content": "Sometimes the stretching does something that can't be copied even with that feature. In that case gotta resample the audio coming from Splice Bridge in a separate Ableton track.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264608063009198193",
    "author": "Ross Fortune",
    "date": "2024-07-21",
    "content": "True that. The little reverse whip into every kick is a bummer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1273841543492665426",
    "author": "Josh",
    "date": "2024-08-15",
    "content": "There has to be someone in here that understands what I’m about to say. \n\nI want a looper. But in my computer. \n\nI find myself always making a ton of layers of guitars and then bouncing them down. I don’t want to have to do that. I just want to hit a button and play over the parts over and over again until it’s a jumbled mess. This isn’t for performance or anything, I just like to make little loops and chop em up and throw them around projects I’m working on and I find myself doing it less and less with my free time becoming less common.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277728192152600759",
    "author": "Rollmottle",
    "date": "2024-08-26",
    "content": "My buddy and I are working on a remix. It's being done in Ableton. He tinkers with parts on his own in Logic against the rough and he added a great part with a Logic instrument that is good...but it has a very specific effect that I'd like to recreate in Ableton. Anybody have any thoughts on how to get this rhythmic gating effect using Ableton effects or know of a plugin that makes this trivial? I've included a sample of the audio, a screenshot of the Logic patch and a screenshot of the very straightforward MIDI from which it is derived. (Worse comes to worse we can use an export of the audio, but would like to see if I can crack it for maximum flexibility).\n\nI tried fucking with Beat Repeat and it's close, but not quite the same. Anybody have any bright ideas?",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1277731799166091415",
    "author": "Rollmottle",
    "date": "2024-08-26",
    "content": "Yeah just the gating effect! I can add the delay, reverb and autopan",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278119654182879253",
    "author": "Ross Fortune",
    "date": "2024-08-27",
    "content": "Good mangleizer for prod to breathe unexpected life into a sound - the presets are mental. Usually OTT but easy to dial back",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280179643038564533",
    "author": "Adam Thein",
    "date": "2024-09-02",
    "content": "Fabfilter Timeless probably is the closest in terms of feature set if you want to get really really really tweaky with the modulation/pitch shift of your delays @Jonathan Arnold",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280343424154861660",
    "author": "Josh",
    "date": "2024-09-02",
    "content": "The filters with distortion are 🤌",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284216940889509966",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-13",
    "content": "Dumb question time: Is there a trick to getting a consistent distorted power chord guitar tone with mixed in non-5th intervals? Like going from a C to a C/E (which will have a minor 6th in the bottom E+C) the intermodulation and breakup sounds entirely different with all settings I’ve tried. How would you approach it to make sure it sits similarly?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285128133909151837",
    "author": "David Fuller",
    "date": "2024-09-15",
    "content": "Are you sure that's acoustic? It sounds like an electric, albeit heavily effected",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285793345141997609",
    "author": "Slow Hand",
    "date": "2024-09-17",
    "content": "@Ross Fortune Granular time-stretch would definitely be a good way to get in the ballpark.\n\nI could probably also hack a similar effect together with a high-feedback/short delay time (around 8ms) echo plugin. I'd have it on a send and automate it up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1286447679265570848",
    "author": "Ross Fortune",
    "date": "2024-09-19",
    "content": "I got one but it’s far too effective. I’ve had better luck rolling up toilet paper and stuffing it under, tuned to C standard. \n\nAlso taking the DI straight into the tape effect on the HX with the low pass and a touch of wow has been cool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290031233090326569",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-09-29",
    "content": "I've recently recorded some samples with a trumpet player; due to the tuning of the trumpet, we recorded everything at 442 hz. We now want to pitch shift those samples so they sound as if they were recorded at the standard A=440 hz. \n\nDoes anyone know of a plugin or method on how to achieve that?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290049734001557618",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-09-29",
    "content": "Can melodyne really pitch shift by hertz or do I have to do it by cents? I haven't found anything online regarding melodyne pitch shifting herz",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293328054386688102",
    "author": "ehutton21",
    "date": "2024-10-08",
    "content": "In need of some additional inspiration creatively so I figured I’d give this to production talk.\n\nAnyone got reference material for (1) layering vocal stacks & vocals that are sang in a round [just looking to see how others have gone about it] and (2) effectively mixing a duet w/ two male leads. \n\nNot necessarily looking into the tips and problem solving. Right now the only reference I’ve had time to drum up was December by neck deep, if that helps narrow the field.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300407837784145920",
    "author": "Zack Hames",
    "date": "2024-10-28",
    "content": "Double it with fuzzy electric guitar feels like the move to me, or simply use some distortion on the synth; it also feels like octaves+fifths to your advantage",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301959627839246376",
    "author": "Johnny I",
    "date": "2024-11-01",
    "content": "Yes I mean editing, but this is the first time I've encountered this particular situation, and wasn't sure how to go about it...I am in Pro Tools...I am used to replacing parts with a section from a different part of the track, when it appears elsewhere...this is the first time I've had to edit where there wasn't another similar section....so I wasn't sure how to take a chord or note, pull it back or forward without a space/silence in between...wasn't sure the best method (i.e. time stretching the tail, etc).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304886119640465541",
    "author": "itaylerner",
    "date": "2024-11-09",
    "content": "Stacks stacks stacks, I think real vocal layers are like 90% of the size. With Effects I’ve had pretty good luck with izotope nectar for cool tuning/robotic voices, and soundtoys effects rack is my fave to build cool filtered delays and stuff. Also Saturn 2 for cool effects and honorable mention for Valhalla shimmer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310961103521447998",
    "author": "Sam Segarra",
    "date": "2024-11-26",
    "content": "Reverse reverb on an arpeggiated piano chord 100% wet has been a go-to for me. En verb in logic has a cool stock setting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313036038020661251",
    "author": "vostral",
    "date": "2024-12-01",
    "content": "I have a couple of That Sound acoustic drum sample packs (available on Splice and very fresh!), when i use the one shot kicks, snares... i'd like to use another layer using the Ableton effect rack on the Drum Bus. That second rack would be highpassed and equipped with a Room reverb. Thats how i emulate the overhead and the room  tracks of live drum recording. And Ableton Effect Racks allow me to layer more to make it not sound like one-shot samples playing!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313041862969524295",
    "author": "vostral",
    "date": "2024-12-01",
    "content": "Just layer for effect, ableton is great at this. In terms of sample, i can layer more tracks (kick 1 kick 2 snare 1 2 3) inside that drum buss",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313311471073103944",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-02",
    "content": "Haha that’s fair. Got some bitcrushing artifacts on the higher levels so that’s why. I always throw in some Oliver sample with some reverb, stereo spread and crisp high end to stress test it. Resynthesis is hard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313311769099243550",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-02",
    "content": "Full AI music generation seems to have similar issues, bitcrushy high end",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313405163528257587",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-02",
    "content": "You think so, in fully programmed beats? Idk I see people talk about humanizing/organic groove a lot, and people spend so much time pitch shifting handfuls of cents and varying layers/microtiming/velocity to get to a less machinegunny/real place",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318432160121618522",
    "author": "Slow Hand",
    "date": "2024-12-16",
    "content": "**#2**\n@ 24:42 - Anthony describes the two-voice \"falling star\" effect. This is such a cool approach to orchestration. \n\nI love this because it feels very in-line with how I think about sound design. Often a single sound is, itself, a well-crafted mini composition with multiple layers that create the composite effect. It really blurs the line between orchestration and sound design.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318646368897597473",
    "author": "spectrummasters",
    "date": "2024-12-17",
    "content": "If anyone felt they could help me nail the guitar sound in this I’d be very grateful . If you listen from 2mins 20s in just before the big chorus drop , when it drops in a snaking guitar line  comes in . Not the chords the weaving melody line . Sounds like a chorus or flange ? And pitch flutter . I tend to get stumped between nailing chorus / flange / phase effects on guitar and really nailing them . https://music.apple.com/gb/album/conceited/1743250148?i=1743250259",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319741715711529053",
    "author": "Jeremy Klein",
    "date": "2024-12-20",
    "content": "Hey!! Im looking for a creative piece of hardware gear that will spur new musical ideas. Preferably with sample manipulation, but open to anything. \n\nThink Korg Kaoss Pad, OP-1, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319744935766921217",
    "author": "Zack Hames",
    "date": "2024-12-20",
    "content": "So, I think it’s superbly underrated. Especially the new Akai MPC lives, one, etc series.\n\nI use it as a drum machine/sampler/sequencer for all of my hardware synths. It’s the brain and controller for everything.\n\nBut you can also use it completely on its own, you can put any sample all the way across a keyboard/pads to the correct pitch automatically. \n\nThere are built in AIR effects. You can time stretch, etc do whatever with samples. \n\nLoad up any drum samples and go to town. \n\nIt also has some built in instruments / synths, but I rarely use those. \n\nIt’s essentially a portable DAW as far as music production. I prefer it to computer by far for producing / writing with samples and synths",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319766639453143203",
    "author": "Zack Hames",
    "date": "2024-12-20",
    "content": "I gotta think on that. I’ll try to experiment. I feel like you can adjust the arp to effectively turn key sync off. \n\nSeems like a pretty intense thing I’d never considered! May be hard to find hardware alone that does that. you could effectively do that on the Akai but you’d have to do it in passes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1320131094510833797",
    "author": "Will Pragnell",
    "date": "2024-12-21",
    "content": "You can get a used mk1 Elektron Digitakt for under $400 these days and in my mind that incredible value for a very cool very fun sample based groovebox. Super creative, sounds great, can't go wrong!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328110554107220039",
    "author": "Slow Hand",
    "date": "2025-01-12",
    "content": "*Driver* sounds amazing. It does a very specific flavor of over-the-top distortion and filtering (think contemporary NIN) but when it's the right choice it's extremely musical. I love it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331562132621234278",
    "author": "vostral",
    "date": "2025-01-22",
    "content": "50% of time untouched. 40% of time enhanced with saturation or exciters. 10% of time blended with heavy distortion layer 👍👍pultec  would also be used every once in a while",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336713352306495561",
    "author": "bobby k",
    "date": "2025-02-05",
    "content": "QUESTION FOR THE CLASS -\n*(this could really go in any sub but I think production talk is most relevant)* \n\nWe all have little adhd monkey brains and the people we work with tend to as well. What are some tricks or practices you’ve found success with to keep a small group of creatives on track during in-person sessions? I’m all for a yap but some days it’s like every 3 minutes some new conversation breaks out in the room and I find it terribly interrupting being the computer person trying to lead the way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337151286889549886",
    "author": "chris_donlin",
    "date": "2025-02-06",
    "content": "I’ve been considering doing this but haven’t yet cus I haven’t figured out how to implement it without sounding like a dick or coming across wrong/“too serious”. I’m afraid it could backfire and create a hostile environment rather than a creative one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337160830763929743",
    "author": "Brian Reynolds",
    "date": "2025-02-06",
    "content": "You could either do as Edsel say and do it verbally with stern commitment. But artists can be sensitive to tone and pushing. Or you could do it like a middle school teacher. With a pouch system just outside the studio. With some corny but cute sign, \"No Phones In The Creative Zone\" but a better version of that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337165737810460703",
    "author": "Edsel Holden",
    "date": "2025-02-06",
    "content": "I had a friend long ago who did the \"basket outside the studio\" thing in college and it was def effective at getting phones out the room, and I always felt like their output was better than their peers - and they are still makin records ! but IDK if they are still strict about phones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337193851739443291",
    "author": "cian riordan",
    "date": "2025-02-06",
    "content": "I think if staring at your phone is more interesting than being present in a recording space with instruments and creative people you've chosen to be around... then there are bigger issues at hand.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339522488564060233",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-02-13",
    "content": "What’s a current production/sonic benchmark for music with driving distorted 8th note guitars, with a pop crossover appeal? Only thing I can think of is the MGK stuff, would love some other references",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339744031617450006",
    "author": "Lee Rouse",
    "date": "2025-02-13",
    "content": "It kinda sucks because when I’m producing rock/metal stuff I want to keep certain things a certain way creatively like tones and stuff but the mixer just wants to change it all to what works for them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342660558079524947",
    "author": "kieronmenzies",
    "date": "2025-02-21",
    "content": "But I would just drop it onto a cassette tape like @Eric Martin suggested. I have a Tascam Portastudio without a cover and a modded pitch wheel that goes +/- 50% specifically to do effects like this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1343615083074293851",
    "author": "chris_donlin",
    "date": "2025-02-24",
    "content": "I have also had great success with the randomization effect",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1344544849814093865",
    "author": "lystell",
    "date": "2025-02-26",
    "content": "Funny thing is I so rarely play the same part with the same tone that I didn’t recognise the effect 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346577154531655732",
    "author": "Slow Hand",
    "date": "2025-03-04",
    "content": "Try a doing a rough key change to hear things in a different light. Just print the stereo mix and do a varispeed or granular pitch shift. That will help you to hear it with fresh ears.\n\nWhen I go off on these excursions I'll usually end up making two versions of the record and quite often there are really exciting elements of both and I end up fusing them together. The contrast can be really cool and exciting!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353962826107977730",
    "author": "Josh",
    "date": "2025-03-24",
    "content": "First time actually using serum 2 in a WIP. Unsure if it’s because of it being new, but it feels like a genuine playground inside of my computer. It’s definitely easier to get sucked down a rabbit hole, but it’s so easy to do creative routing and what not that it just feels inspiring.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357142306863710208",
    "author": "chris_donlin",
    "date": "2025-04-02",
    "content": "Can someone refresh my memory on sampling vocal chops from songs? Like when someone uses a chop of james brown going \"Huh!\" or \"Hit me!\" what's the deal with that? I vaguely remember there being a clause that samples under a certain amount of time were okay, like 2 seconds or something.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357751777851605235",
    "author": "Brian Reynolds",
    "date": "2025-04-04",
    "content": "Playing off the same idea of liability. Ed Sheeran now films ALL his writing sessions for legal purposes after the fact. And it makes easy content if you've got someone on payroll to chop it up for you and curate angles.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359585267652104192",
    "author": "Grover",
    "date": "2025-04-09",
    "content": "I should have clarified \"for me\" I suppose : ) \nI guess my point was just that listening in that one mode did make it a little more difficult to switch the creative ears back on. I certainly don't have the same experience mastering as I do when hearing a song that catches my attention outside the studio for example.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360358465511493815",
    "author": "minipops",
    "date": "2025-04-11",
    "content": "Right!?  Very creative unique instrument",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1364153978480365618",
    "author": "onanisland",
    "date": "2025-04-22",
    "content": "D16 offerings, sometimes also shaperbox, infilitrator and others seem to make it more often in regards to creative distortion and filtering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370883102372659260",
    "author": "Nomograph Mastering",
    "date": "2025-05-10",
    "content": "Imagine if you could run the experiment and delete just one album or show from history and then see how the world would be different",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1372306703919616162",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-05-14",
    "content": "https://open.spotify.com/track/0kiaVCnEEFQWIbEd9bjqAe?si=c95749559ee542be can anyone identify the guitar effect starting at 5:18 on the arpeggiated guitar and knows how to recreate it? It sounds chorusy but there is more going on that I can't quite put my finger on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1372310809556029440",
    "author": "Slow Hand",
    "date": "2025-05-14",
    "content": "Sounds like a Leslie speaker cabinet. So there's going to be tremolo, vibrato, and the grainy distortion from the cabinet.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376080274349101219",
    "author": "tim adamson 🇦🇺",
    "date": "2025-05-24",
    "content": "Someone correct me if I'm wrong but from what I understand converters have a distortion curve toward the top and bottom of full scale, with the lowest amount of distortion sitting around the middle depending on the converter. I wouldn't split hairs over -10 and -12, but I think aiming round there (or wherever your specific converter hits best)  is a better practice than hitting -20 or -3dbfs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1380453987278393355",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-06-06",
    "content": "what are yalls fav ways of adding \"energy\" to a vocal take when u cant rerecord? \n\nArtist on a fast paced pop-punk-ish style tracked asked for more energy on the vocal but it's not rl feasible to rerecord at this time. \n\nI already tried a few things like parallel distortion/compression, pitching up the vocal a few cents and moving it a few ms to the right all of which cool but I was wondering if yall had any more tricks up your sleeves?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383594268928770130",
    "author": "Slow Hand",
    "date": "2025-06-14",
    "content": "Oooh, maaaybe? The quality of the sound feels like it's been pitched down an octave using varispeed. The part is kind of loose and not always locked-in with the bass and guitar, so maybe they overdubbed a harmonica at double speed, so that it would play back an octave lower. That would also explain the heavy chorusing effect on the pitch, which might be the pitch fluctuation in the reeds being exaggerated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386505294716076245",
    "author": "vostral",
    "date": "2025-06-22",
    "content": "I think Jack not only succeeds in experimenting in his songs but also with big artists. I'm very into what he does on Please Please Please but as i'm not as experienced as Jack, i wouldnt do these extreme techniques. My philosophy on width  is mostly 70-30 which means 70% of the tracks are center or close to center. For pad, i like to make it as wide as possible because its sound can hug everything else in a space.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386808111280558322",
    "author": "Gabriel Tyranny",
    "date": "2025-06-23",
    "content": "To stick with a song I made, MIRROR, I had the lead say anxieties earlier in the song in the middle, then later add those full lines as BGs that almost swirl around the last hooks lead. The lead is performing a part that’s trying to overcome anxieties, and the BGs are saying full lines with the anxieties from before.\n\nPanning was essential to create the effect of the anxieties around the lead, but I found that if I introduced them as panned BGs they were hard to make out behind the lead.\n\nBecause of this, knowing when to make a moment earlier in the song to spotlight what would later be panned made those lines more intelligible once they were in the BG to the sides, because the listeners brain recognized it from an earlier section.\n\nDoes that make sense? I can struggle to explain what I’m doing in practice and this is my attempt, so my bad if it sounds like gobrish",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389040110728777870",
    "author": "andrew_yv",
    "date": "2025-06-29",
    "content": "Not really an answer to the second half of your question, but if you have annnnny ability to play a wind instrument, SWAM horns + an EWI controller is such an effective, facile workflow, no digging through articulations etc, just perform it how you feel it. Needs mixing to sound realistic, but can sound really good too if properly treated",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1394690248578961458",
    "author": "Jonathan Arnold",
    "date": "2025-07-15",
    "content": "What do you guys reach for to create random slices/ granular Type effects on audio to create Rhythm and randomness?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1394712528658894971",
    "author": "LAPhill",
    "date": "2025-07-15",
    "content": "Shaperbox or Cubase built-in effects for randomness, Omnisphere or Portal for granular",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397668091814609047",
    "author": "Josh",
    "date": "2025-07-23",
    "content": "Also anyone have any idea on how to reverse that for a remix? I think I might just have to hand align everything.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405059173414342718",
    "author": "Zack Hames",
    "date": "2025-08-12",
    "content": "Great tip. I’ll give this a shot! The effects thing rings true for me, I’ve just never done a deep dive.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1406857238907322460",
    "author": "Juliette",
    "date": "2025-08-17",
    "content": "Hey, all. Been trying to experiment with sounds a little outside of my box more and I’m running into the difficulty of sound selection.\n\nWhen looking for new sounds to mesh together, sometimes two samples will sound pretty weird next to each other. \n\nBut then it confuses me why they don’t sound correct next to each other, when there’s millions of tracks that have a bunch of different samples— sounds that are very different from each other but still manage to fit and be its own unique piece of work. Is there a correct way to go about sound selection?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407008366009778258",
    "author": "Edward Rivera",
    "date": "2025-08-18",
    "content": "What effect are you trying to achieve ? Not really seeing the point especially in delay boxes with small increments. I would just…adjust the delay time ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407011217171812392",
    "author": "aliberger",
    "date": "2025-08-18",
    "content": "i've done this before a couple times - the effect achieved is basically a longer initial delay, followed by a shorter delay that actually repeats",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407981136604430388",
    "author": "Slow Hand",
    "date": "2025-08-20",
    "content": "Oh I certainly feel that. \n\nI'll often find myself making records that start to fall into three or four different buckets (ex: heavy stuff, singer songwriter, experimental, etc...). I start grouping together the tracks that feel complimentary and then when I have enough they'll start to suggest a direction for an album, at which point I'll focus on that larger project until it's complete.\n\nThen I jump back into the songs in the remaining buckets and use them as the jumping off point for the next release. That's one way to do it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1409976489725923378",
    "author": "Will Trotman",
    "date": "2025-08-26",
    "content": "Curious if anyone has ideas to make sessions more fun / hands on for artists. I think the modern workflow of artist and producer in a room together (not live tracking with a band) can lead to a lot of “artist staring at the back of the producers head while they make sounds” time and, while some of that seems inevitable, I want to make sure the process feels creative and they feel involved",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1409977432747937866",
    "author": "Bryan DiMaio",
    "date": "2025-08-26",
    "content": "though I guess if your goal is to mangle, anything could work haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410618442045853736",
    "author": "Bryan DiMaio",
    "date": "2025-08-28",
    "content": "also don't be afraid to throw some creative fx onto a sax",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411083970673774693",
    "author": "Ross Fortune",
    "date": "2025-08-29",
    "content": "Got this SAULT track as a vocal reference: https://open.spotify.com/track/4Tzw9IdZbVyzmpWrvsGaNX?si=XrLYvMmgT4OJDvabUvyulA\n\nI want to set up a recording chain where the distortion is monitored live (ideally in Ableton but could do Pro Tools) so the artist can push into it in real time. \n\nMy thoughts always go to Decapitator, Devil Loc, Sansamp parallel, and hardware Level-Or, but the sault tone is particularly wonderful and I want to explore avenues I haven’t gone down. \n\nAny suggestions for killer distortions in this world that play well in real time?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418311133202481182",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "I don't give a major fuck about being able to tweak the sounds other than pitch within a sampler. (don't need effects or EQ built in necessarily but it can be nice)\nI do like using battery for key-tracking samples. but again, it still loads everything as a fucking loop by default. I just read the *entire* manual, there is 0 way to change the default way it loads in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418316605963894904",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "I've got my prophet 6 going midi out to a MOTU midi USB interface...it doesn't matter if I use that, put a midi note in the piano roll with my mouse, or if I click the cell to hear the sound, it all behaves the same way.\n\nI am going to experiment with the files themselves and where the files live to see if it fixes anything.\n\n\"load into cell\" so far has not worked. it just sits there and nothing loads in. IDK if that's a sample rate issue of some kind",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1420724144907091990",
    "author": "Ross Fortune",
    "date": "2025-09-25",
    "content": "This synth that starts 2.12 and ends up directly inside my brain at 2.24. \n\nThe most \"out of speaker\" parts cancel in mono, but the effect works both in headphones and speakers. I'm guessing it is some kind of phase inversion between the two speakers, but it feels like the effect modulates smoothly over time (rather than ON/OFF). \n\nIs there a tool that can shift phase per speaker over time so that it slides to 180 and back?\n\n@Slow Hand maybe this is something that can be accomplished in Serum somehow?\n\nhttps://open.spotify.com/track/7jq2d4lyn2WvP6m5v2Q4fD?si=6aad087b9d27491e",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1420825094485184552",
    "author": "Slow Hand",
    "date": "2025-09-25",
    "content": "It sounds like it may be a simple haas-effect spread by delaying one side by a few ms. \n\nThat would be easy enough to modulate with a stereo delay: Keep one channel at 0 ms and then automate the opposite channel in the range of 0-60ms\n\nThat would track with the collapse in mono that you're experiencing and explain why the rhythm starts to slur and get messy at the apex of the effect.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440495532731535451",
    "author": "Josh",
    "date": "2025-11-18",
    "content": "I turned on the ol’ classic mode last night and my right channel started distorting. I thought I blew a driver at first",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441081495300346007",
    "author": "Bryan DiMaio",
    "date": "2025-11-20",
    "content": "would probably have to be reverse engineered to get around IP laws",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1446692427133091862",
    "author": "Will Melones",
    "date": "2025-12-05",
    "content": "It’s so valuable to imagine yourself in the next person’s shoes, to really consider what will help them do their job effectively. Simple but so often overlooked",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453584698117718080",
    "author": "Akanksha",
    "date": "2025-12-24",
    "content": "I have a question for producers who make future bass. I love the genre but I really can never finish a song.\nMost of the time I'd lay down a drop arrangement and then try to create a lead or vocal chop melody but it never fits the vibe.\nHave you ever had this production block? What did you do to overcome it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1455072951001940111",
    "author": "Akanksha",
    "date": "2025-12-28",
    "content": "you're so right\nsometimes we fail to understand the difference between creative exploration and being stuck in the process of creation.\n\nI also have let go of my habit of watching endless tutorials before starting a session. I especially dislike going down the rabbit hole of  those \"50 advanced production tricks to level up your sound\" videos. It's like why am I watching this instead of creating some actual music first?\n\nyes, creating a bank of samples and sounds beforehand is the way to go. \nOn those days, I'll just spend my time doing sound design and exploring sounds that fit the genre. \n\nI've realised that scheduling and managing time well is important, even in music.\n\nBtw, did you talk about the vibe and atmosphere of the track in advance with your clients in order to do better sound selection for the style they wanted to go for?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1462544394686042213",
    "author": "CMC",
    "date": "2026-01-18",
    "content": "Creative examples welcome, could even be just the sound on a bridge, etc. Really anything.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1462544619798794484",
    "author": "CMC",
    "date": "2026-01-18",
    "content": "Follow up, also looking for some favorite creative distorted guitar tones. Nothing metal or standard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1462546560196804619",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2026-01-18",
    "content": "there is this dude on IG who does crazy stuff with guitar distortion like micing up just the strings with an Sm57, then pitching it up an octave and crushing it with tape but I can't remember his name atm. once he pops again on my feed I will send!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465863217724264505",
    "author": "Rollmottle",
    "date": "2026-01-27",
    "content": "Looking for any references for a guitar tone that feels sqwanchy, uncomfortably dry, no room, pressed, upfront, boxy, forward, distorted-but-still-articulate...what you got?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469846243092992001",
    "author": "youngteam",
    "date": "2026-02-07",
    "content": "ah man flashbacks to eternal sunshine of the spotless mind. never knew this was a beck song! \n\nsounds like a double tracked guitar solo first and foremost. dry as fuck, bridge pickup with fuzz or distortion. reminds me of beatles tones tbh should be easy to recreate",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469847325173354630",
    "author": "youngteam",
    "date": "2026-02-07",
    "content": "don't think an octave fuzz would get you there, but I'm sure you could just crank an amp to get crunch and add more distortion in post",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469852488961228953",
    "author": "youngteam",
    "date": "2026-02-07",
    "content": "ruina. absolutely fucking insane distortion",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469852543973851309",
    "author": "youngteam",
    "date": "2026-02-07",
    "content": "nudistort will also hit this mark",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470071684894560419",
    "author": "Ross Fortune",
    "date": "2026-02-08",
    "content": "I’m struggling to hear it. Are you hearing modulation in mono on the source or the delay? Or stereo effect across the lot?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470769273507942577",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-02-10",
    "content": "Anyone have a good hack for gritty vocal melodyne glitches? \n\nGoing in and manually fixing the detection leads to more clicks/glitches than keeping it as is, but it's also visually unworkable. Many are not just -1 octave glitches but straight out there",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1473134140730638521",
    "author": "sethearnest",
    "date": "2026-02-16",
    "content": "I’ve been doing this a lot with a buddy. We house everything in DB as the “master” session then each backup to our own backup systems. \n\nOne thing we’ve noticed is that PT seems less happy working out of DB on our rigs — I’m going to experiment with “pausing sync” in DB next time we get into a heavy session as we’re actually working to see if that helps. \n\nBut generally has worked great aside from a slight performance dip (which doesn’t seem to affect some other people as much, so maybe it’s just our own rigs’ issues). And general best practices of Save-As’ing often have proven important as we’re both working on various things so we’re not messing up each other’s work/sessions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1473401130473095271",
    "author": "Bryan DiMaio",
    "date": "2026-02-17",
    "content": "Yeah we're a niche anyways, but these tools are going out to everyone so some of the ill effects always bleed through",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]