[
  {
    "id": "1204488670858584156",
    "author": "NoahNeedleman",
    "date": "2024-02-06",
    "content": "Quick shoutout to @Zack Hames for remote recording & delivering pro level drums. He saved me on that cranberries loop thing I was looking for and then absolutely smashed a full song performance for a country song. \nPro delivery, great communication, enthusiastic collaborator, reasonable rate, tight and tasteful performances.",
    "reactions": 28,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077740838102253618",
    "author": "BatMeckley",
    "date": "2023-02-21",
    "content": "Well you know, i was the top guy working for the top guy so the top guy called me and I just kept being the top guy.\n\n(Actually, I was doing assistant work for John fields because I’d helped him with a college buddy’s record, and then he taught me about melodyne, so i spent a year or two trying to get good at it, and then his drummer/bff was working for Rob Cavallo who was on their ninth engineer trying to tune the Paris Hilton record and the drummer guy recommended “Fields’s guy” and so I tuned vocals on a laptop in a studio kitchen for a long time, and worked my way up through robs team doing a bunch of work with them until as an exec at Warner bros he trashed the entire rock Paris Hilton record to start over as a pop record and I was in his office where he had his assistant call the top three writers on the billboard hot 100 that week, one of whom was Dr Luke. A month or two later I got a call at like 3am from Luke going “so hey, I hear you’re the guy that can do Paris vocals?” And that’s how. Much abbreviation, but basically.",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061736780845551616",
    "author": "oaklandmatt",
    "date": "2023-01-08",
    "content": "Oliver power tools and kshmr are the most useful and most modern packs. Not sure what kind of music you're making but for my workflow I like doing whatever I feel on a production and then having quick \"modern\" drum sounds I can reach for that immediately can put things into the present.\n\nI'm doing a production right now for a UK artist where they gave me a throwback sounding demo, but I know the artist is a young 2023 female pop star. So I did a bunch of organic shit (acoustic through my 67, some live claps, shit like that), then I threw some kshmr and oliver loops in to just see what the hybrid of classic and modern sounds like. Production is basically done now",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059568643878428843",
    "author": "NoahNeedleman",
    "date": "2023-01-02",
    "content": "@BatMeckley is the resident Grammy Loser on this topic, but I’ve made a decent living doing some indie and major label stuff as a vocal producer. \n\nDeliverables really depend on the producer you’re working with. In my experience it’s 50/50 whether they want tuned or raw, comped or all the takes- etc. \n\nThe key things that keep me getting called are, in no particular order:\n\nCommunication. Everybody knows what to expect and what is to be expected. \n\nProfessionalism. The room is clean, mics are up, lighting is right, session is loaded. \n\nIntuition. All the artistic/personal things. Making the artist feel safe enough to be dangerous, knowing how hard you can push them to get a take, knowing where the line is between their vision and yours, etc…\n\nSonics. I want my artists to feel expensive when they’re recording, so getting the mic and cue mix right is everything. \n\nSpeed. A comp up by the time they’re done tracking, a quick shine to make it feel special, and a bounce for them to take with them.\n\nEverything else is on a per session basis. I can deliver a fully mixed/tuned vocal and everything in between, so it all depends on communication ahead of time.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1120088518425841784",
    "author": "Slow Hand",
    "date": "2023-06-18",
    "content": "I had a similar moment when I moved to Los Angeles. I wrote Michael Beinhorn a really nice letter after I was inspired by his book, with the offer to be his assistant. The timing didn't work out because he had a newborn and was leaving LA, but I *did* get to sit down with him for drinks a few times. \n\nThe big moment for me in those discussions was realizing that I was never going to be a great pop music producer *in addition* to everything else that I wanted to do. There are people out there who are 100% bought-in to that idiom and are going to absolutely smoke me because they *love* it. My takeaway was that in order to excel you have to lean into the things only you can do because no one else cares about them as much as you do and no one else is prepared to put in the same effort to see it realized.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998809181303881788",
    "author": "Slow Hand",
    "date": "2022-07-18",
    "content": "So obviously starting with the right bass is going to get you 70% of the way there, but you know what *really* surprised the hell out of me? The *strings*. \n\nIf you're not getting anywhere close to the tone that you want, start exploring the wide world of bass strings. I had overlooked this simple thing for ages. I took my choice of strings for granted because I never had to change them. And when I did it made all of the difference in my tone.\n\nI've always been a Fender guy: P-basses and J-Basses, and the DI signal was always voiced way too dark to pop out of a mix without some heavy lifting. Granted I also use flatwounds (which aren't as zippy as roundwounds). \n\nAfter some research on the TalkBass forum, I ordered a few different sets of flats to experiment. One such set were the *Thomastik-Infeld Jazz Flats*, and ho-lee *shit*. There it was. There was the sound I was looking for.\n\nThey were voiced way lighter in the bass, which gave me a far more articulate midrange. Like the sound of an upright bass which (trust me) is a very good quality to have unless you're going for a grindy metal tone. As it turns out, the midrange is where *all* of the action is in the bass. It's okay if your bass DI is voiced with no low-end, because you can always add that weight back in, but if the midrange is not present to begin with it is an uphill battle to make it articulate in a mix.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095812910506324069",
    "author": "BatMeckley",
    "date": "2023-04-12",
    "content": "It’s neat that there’s so many different approaches to producing a record, some people like Albini are almost strictly engineers capturing the artist warts and all, other people like mutt and fields are replaying everything and singing 90% of the BVs. (Once you hear Max Martin sing you can’t unhear him on all those boy band (and even Brittney) tracks. \n\nIt’s such a weird balance of the ego, because as a producer you have to be arrogant enough to go “your art should sound like THIS” but you have to be humble enough to know when your idea isnt the best one. An up and coming pop band im far more likely to hard tune and really lock in their performances, where as if im cutting a Nels Cline or a Mimi Parker im more apt to go “well shit, that’s not what I would do, but who am I to try and dictate to you how to sound… here’s my gentle suggestion and if you say no, cool”\n\nMy general rule is put in the work, then take a step back, take a deep breathe, and try to accurately assess which is better… that decision you make is REALLY what defines you as a producer. So so so much of what I do ends up on the cutting room floor, but I wouldn’t have gotten to the end result without it.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142131726701826218",
    "author": "BatMeckley",
    "date": "2023-08-18",
    "content": "<deep breath>\nSo, grasshopper, everything matters, and nothing matters. It depends on where you are and where you’re going, and most importantly actually knowing where you’re going.\n\nI view the difference in shitty gear vs good gear as compound interest. A vintech one on one might sound basically like a vintage neve. ALMOST indistinguishable. But if you’re using it on all 149 of the tracks you’re compiling into a pop song, the end result is going to be 149 times more noticeable. The second floor of the leaning tower of Pisa looks pretty spot on but the people on the 15th floor are freaking out. \n\nThat said, I could record a garbage singer through my 251 and my chain, and if I didn’t know what to do with it, it would still be garbage. The flip side is we actually demoed different mics and different chains on Paris Hilton. There was a right answer. And she’s not gonna win any singing contests, but at the end of the day the cumulative effect of all the decisions we made led to tracks that are still being played in clubs to make people dance over a decade later.\n\nDetails matter in not just what the audience hears eventually, but what the artist hears initially, giving them the confidence and headspace to sprinkle in their extra few (sometime more than a few) percentage points of vibe that the audience attaches too later. Fix it in the mix is an abused concept because it doesn’t take in to account the affect of shitty sound or feel on the performance. You think 1 mic doesn’t matter? I’ve heard people sing noticeably more in tune and in time when switching from DAW monitoring to direct monitoring. It ALL matters.\n\nBut if you don’t understand songs, melody, rhythm, and how these things interact to move people? None of it matters.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020845158075465778",
    "author": "ALXCPH",
    "date": "2022-09-17",
    "content": "I've been a \"musician\" since way before i started recording and producing stuff. (Since i was 4 i think). It's such an integral part of how music can feel and make you move. Think about how someone like Anderson paak. can make you dance by just playing 8th notes on a highhat and nothing else(see tinydesk for ref.) or Pino Paladino, will make you break your neck with his bass, playing simple Quater notes. (anything D'angelo).  Even in a genre that is as quantized and on the grid as it gets like a lot of hiphop/trap is, notice how the artist(rappers) that really stand out, are the ones that make those beats really groove/hit because of how they themselves \"groove\" or flow on those beats. They might be slightly behind or in front of the beat, or they might even swing a little. \n\nYou can really get into the micro and macro dynamics of groove. Listen to guys like Led zeppelin, how they might start out a song a few BPM slower than they finish, because of the build up of energy through out the song, and it doesn't sound wrong or unnatural. \n\nA fun thing to do, when looking for inspiration for grooves, is record some foley, and look for naturally occurring rhythms in the sample. Try and build a grove around that probably a bit wonky rhythm. It can really be an eye opening experience once you realise how much fun rhythm and groove is, when you don't have to obey the grid in a daw like a machine. \n\nBut like anything music, it's really about listening and feeling. Really internalising what a forward or laid back snare feels like or a bass thats almost a 16th behind the beat.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334294937176375327",
    "author": "Slow Hand",
    "date": "2025-01-29",
    "content": "Granted, her examples are *very* specific to orchestra and not directly applicable to pop records, but the underlying principles here include:\n\n**1) **Think of instrument combinations as a single composite voice.\n\nOne instrument can function as the \"sustain\" portion of the sound and a second instrument gives the \"attack\". Together they create a single melodic voice.\n\n**2) **How do the instruments stack on each other? Do they clash? Cellos doubling a bass an octave up extend it's timbre into a higher register to make it read better. It's not so different from adding fuzz to an 808 so that it has more presence.\n\n**3) **Which instrument will cut through the music?\n\n---\n\nA few concepts that I'll add:\n\n**4) **Instruments in the foreground vs. the background. Know which part is the lead (focal point) at any given point in the record and then pare down the presence of the rest and push it into the back of the sound stage.\n\n**5)** (Piggybacking off of Felix's excellent post) What is the simplest way to achieve the desired effect? Reduce. Reduce. Reduce.\n\nCut instruments and parts ruthlessly and approach it with a minimalist's eye. Like writing a haiku: How few elements can you use to create an impression? Maybe a guitar part is carrying 90% of the groove and the drums only need to be a kick and a snare. Or maybe the guitar is covering the backbeat too, and you don't even need a snare!\n\nConstantly ask yourself \"What is the most important sensation in the record?\" and then focus it by cutting out everything that gets in the way.\n\n**6)** Hocketing. Pass the melody off between different instruments at different points in the song. Play it in different registers. Combine voices occasionally for special effect.\n\n**7)** Tonal contrast. Dark instruments plus bright instruments. Distorted and clean together. Near vs. distant.\n\nElements that sound same-y will gel together and elements that contrast tonally will pop.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "969368396095455293",
    "author": "Slow Hand",
    "date": "2022-04-28",
    "content": "Has anyone checked out the massive update that Ableton just released for their *Learning Synths* website? \n\nI wish I didn't know a thing about synths so that I could experience it fresh. It's a brilliant site and a great resource for learning the fundamentals of synthesizers. *Strong* recommend, even if you already know that domain.\n\nThey've done something really cool, in that you can play a patch in the browser as they're teaching you, pop the hood and tweak it if you want to go deeper *and then* you can download the patch you've been playing with as a Live session that you can then open in Live and continue creating with it.\n\nThat might sound pretty simple, but the execution is brilliant. It's very fun.\n\nhttps://learningsynths.ableton.com/en/get-started",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037480224448843957",
    "author": "peterlabberton",
    "date": "2022-11-02",
    "content": "Oh also, most of the shit that you’re learning when you *really* learn an instrument (like your primary instrument, going deep), is completely irrelevant making pop music. Using the word pop very broadly here. The parts people actually want on a record are fucking bonehead easy most of the time. So I don’t feel like I need to be a ripping guitarist to play something. If I need a great solo, I have friends I can call.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1200632313822842900",
    "author": "oaklandmatt",
    "date": "2024-01-26",
    "content": "@Skyler Young what Noah said. Song/ singer dependent. Usually a combo of both. \n\nAnother dimension to think about is processing. What you hear in an unmixed vocal is different than mixed. If a vocal gets compressed and brightened in the mix, new things pop out. I try to process as close to what I think the final vocal will sound like before I comp.\n\nDiscord-related anecdote: I had a song mastered by @Nomograph Mastering last week where when I got the master back, I heard a few clicks in the vocal that needed adjusting. Ruairi made my mix clearer and it revealed a couple things I missed in my vocal comp.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1347936976820764772",
    "author": "NoahNeedleman",
    "date": "2025-03-08",
    "content": "Also this is what I used for a long time. (Lo-Fi or Varispeed to tame some of the brightness.)\n\nhttps://www.dropbox.com/scl/fo/kjw1jzui86d02ql6jcee8/AA25QsdVEXUMy03AI4-V9Ss?rlkey=yiea9a8qzltnzr65szea2nzyz&st=plps1kfl&dl=0",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954060046235488256",
    "author": "oaklandmatt",
    "date": "2022-03-17",
    "content": "@Zack Hames yeahhhh. watch the questlove video on youtube where he talks about d'angelo asking him to play crazy laid back and flammy too.\n\nmy general thought on timing is: behind the beat is more groovy and laid back (vocals, percussion, bass against the kick drum, etc) and ahead is intense and anxious (especially vocals).\n\nthere are many examples of groove being behind the beat as that's something people talk about a lot. definitely dive into that concept and play with laying different elements back off the grid.\n\nbut i LOVE talking about being ahead of the beat. purists complain that a lot of modern hip hop vocals are ahead of the beat and \"off time.\" but when it's done well it makes the tracks SO exciting. lil durk, 21 savage, gucci, etc all have this excitement in some of the songs because the vocal are ahead. \n\ni've heard the argument that these guys are just amateurish in their skill. that might be true, but their natural groove and cadence works. also listen to kendrick on \"Family Ties\" where he goes in and out of being ahead of the beat and it sounds exciting as fuck when he does.\n\nalso \"Icky Thump\" by White Stripes is a song with vocals that are entirely ahead of the beat. clearly it's deliberate as jack white is a rhythmic genius (and the doubles are perfect). it adds this anxiety to the whole song that is SO dope.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062454965907501226",
    "author": "peterlabberton",
    "date": "2023-01-10",
    "content": "I was wearing out that Willie Nelson record Teatro that he played on around the time we did that lesson—but hadn’t told him that. When I showed up, he had two drum kits setup mirror image of each other, sharing a floor tom, as I’m lefty. I walk in and he goes, “I figured to start we could just jam a bit and play together, this is how I did this Willie Nelson record with Tony Mangurian” (another lefty). It was pretty rad to just rock out with him, and then we ended up hanging for a while and just chatting about whatever. Gem of a guy.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103377281482756246",
    "author": "LAPhill",
    "date": "2023-05-03",
    "content": "Okay @Nomograph Mastering , so I think the analogy is a little off. Music is a conversation, but it's a conversation between performers. At it's best, the performance is authentic, transcendent, and speaks to our souls in a way that real-world conversation with words can't do. But it's heightened, exaggerated, hyper-focused. If the song is written ahead of time, it's more akin to actors interpreting a script. The words are written, the notes are there. Unless we're talking about jazz improvisation, which is the closest we come to real world conversation, but even then, it's translated and performed. As much as Miles was saying what he wanted to say, he was saying it that way so that an audience would hear it, it wasn't a private conversation.\n\nNow, if you get incredible actors on a stage or in front of a camera, you can let them do their thing with minimal trickery, minimal edits, and it will move you to tears. The respond to each other and elevate the piece beyond what feels possible. Watch that same play as a community theater-level performance and feel nothing. The reality is that a lot of the artists that are coming through aren't Sidney Poitier. They're just not that good at making their music feel effortless. Not every play works as a film, and vice versa. Not every track benefits from having a band in a room. \n\nConfusing the genesis of songwriting (one person crafting both sides of a conversation) with the act of expressing that work (one person performing every part, a la Tom Hanks' motion capture of every character in The Polar Express). I know that ultimately you and I agree on the benefits of humans recording together, but the analogy feels too blurry to me.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103400817526054942",
    "author": "cian riordan",
    "date": "2023-05-03",
    "content": "That’s my soul leaving my body",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280945164009082946",
    "author": "Slow Hand",
    "date": "2024-09-04",
    "content": "Hmm. Fun question. Ultimately hard to say without seeing the clip. Want to text me a small clip of the video so I can get a vibe?\n\nI will say this: God have mercy on your soul if you use an electric guitar with a dotted-eighth delay on it.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1323734704871968821",
    "author": "BatMeckley",
    "date": "2024-12-31",
    "content": "I had to do this with this group Krewella once. They had a single that had done well, and I was brought in to reimagine it stripped down so they could do it acoustically, but it was a fully blasted out EDM track. \n\nThe trick for me was focusing on what made the original song work, what were the most captivating elements, and more importantly WHY. When I had that sussed out, it was  easy enough to figure out another way to paint the picture with a different set of brushes if you know what the picture is supposed to be.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954089059154804767",
    "author": "Slow Hand",
    "date": "2022-03-17",
    "content": "Michael Beinhorn (badass rock producer) wrote a good primer on feel that’s worth a read: https://www.michaelbeinhorn.com/a-primer-on-feel/",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993962978447732799",
    "author": "delwin",
    "date": "2022-07-05",
    "content": "thanks for all the help here y'all. izotope vinyl on the string section did surprise me indeed, succeeded where my other lofi plugins failed me 🙂",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051623536910938182",
    "author": "BatMeckley",
    "date": "2022-12-11",
    "content": "I mean, pop music or not, I’m not trying to make the team helping me out feel shitty ever.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090310201535627295",
    "author": "BatMeckley",
    "date": "2023-03-28",
    "content": "I will say there is a single percussion loop that’s probably been on over half the number 1 pop songs of the last 15+ years.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157760619051761664",
    "author": "BatMeckley",
    "date": "2023-09-30",
    "content": "This discord is a great place to learn some things and expand one’s knowledge. Today’s lesson is “Doubling the L/R Harmonies for thickness and blend has been standard operating procedure in pop for the last 50 years.”",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169709048682270750",
    "author": "cian riordan",
    "date": "2023-11-02",
    "content": "And given Nirvana was the pushback to Metallica, this makes a lot of sense.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456011088591323341",
    "author": "oaklandmatt",
    "date": "2025-12-31",
    "content": "The friends of mine who are having success doing it started by scoring their friend's work (short films, YouTube shows, etc.).\n\nLike with pop music production, nearly all success starts with making stuff with the people around you.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071554194793824359",
    "author": "popaganda.",
    "date": "2023-02-04",
    "content": "It can be hard to convince someone about the amount of work it actually takes to fully produce/mix a record. But you can't undersell it or you might resent the work. My full prod rate is about 4x my mix rate, but it's been hard to get anyone to pay it, so I've compromised with points. It's a tricky spot to figure out though, that threshold between indie clients who have never spent anything to make a record vs the higher echelon who don't give the invoice second thought, but tend to go to known producers.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073636721645846608",
    "author": "BatMeckley",
    "date": "2023-02-10",
    "content": "You’re gonna have your minds blown when he starts testing pop filters.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082744341975552060",
    "author": "popaganda.",
    "date": "2023-03-07",
    "content": "@sethearnest responding to your demoitis comment here to not clog up the episode questions, but I agree with you. Engineers and producers can be quite arrogant, especially when they’re either not super experienced or have done things a certain way for a long time. It is extremely common for producers and mixers to suck the soul out of something for the sake of “better” production or sonics",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084887762995523665",
    "author": "Jeremy Klein",
    "date": "2023-03-13",
    "content": "2 helpful things come to mind:\n\n1) my go to technique for that sampled sound is too record the instrument an octave higher, and twice as fast. then based on your desired decade, put RC-20, sketch cassette, lossy, etc on that octave higher, twice as fast part. render this. Now stretch this rendered audio twice as long so its in the right octave and right speed. The key here is that your lofi plugin is on BEFORE you pitch around the audio.\n\n2) as you already keyed in on, the more mono you go, the more lofi / grungey / busted, something will sound.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103376473764667472",
    "author": "hyanrarvey",
    "date": "2023-05-03",
    "content": "Same way how i don’t wana hear a metal band winging it from chord charts",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103384575637475488",
    "author": "Nomograph Mastering",
    "date": "2023-05-03",
    "content": "So much so that in pop, hip hop, indie rock etc many people Don’t even really seem to know that other ways are possible",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119854727711166544",
    "author": "spectrummasters",
    "date": "2023-06-17",
    "content": "After I left Uni I lived down in bristol and amongst many music related jobs I worked for a small live engineering company . We d cover the whole south west of England and two tone ska is still alive and kicking down there . We did all the two tone bands multiple times and I can say …….they are tight  performers and high energy like the chilli peppers . V impressive . Weird scene though on a visual level though . The  music is obviously a mutation of jamaican ska with punk attitude …..a typical English spin on a carribean music….but the audiences who came out looked like national front members . Strictly Caucasians in shott bomber jackets Fred Perry shirts and braces , skin headed , drain pipe jeans rolled up to show massive doc marten boots . Lol . Us English are an odd bunch . Skinheads dancing to jamaican rhythms 🤷🏼‍♂️ . I couldn’t ever make sense of it . Pauline black from the selecter was a sweetheart and a real performer . It cannot be overstated what a firecracker you’d have to be growing up as a black girl in Coventry in the 70s and saying to ya self , right f these racists im gonna rock this party and make them dance",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336392551892127825",
    "author": "NoahNeedleman",
    "date": "2025-02-04",
    "content": "I’ve been thinking about @Joel \"Roomie\" Berghult‘s question re: mixing as you since he asked it. I think what Rauirí says about not knowing what we’re doing while we’re doing it is really true, so I’ve just been trying to dissect my process in my brain, away from the computer.  I think it comes down to 2 things for me. \n\nHere are my thoughts:\n\n\n1) Choosing Sounds. \n\nIn addition to vibe & genre & emotional intent, each instrument or sample that you pick covers a certain area of the overall picture. Knowing where that part is going to go in the overall arrangement changes how much hi end or low end or wetness (etc.) you want. It also steers performances. \n\n2) Actually Mixing As You Go \n\nOnce a part is recorded, do a quick adjustment so that you hear closer to a finished product. This helps you make better choices about what else needs to be added, (or not added,) and will likely inspire the next step.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366573229916815400",
    "author": "Slow Hand",
    "date": "2025-04-28",
    "content": "Three things come to mind: \n\n1) **Note length and envelope**. That's going to have a large influence on the feel. Electronic producers will spend a *lot* of time sculpting the volume envelope relative to the tempo. Trance producers have entire plugins that give them microscopic control over the pitch and volume envelopes of kick drums.\n\n2) **Presentation and proportion**. Is it up-front or does it sink into the back? It's easy for a 4x4 to feel hackneyed or overbearing. Sometimes all you need is a gentle *pat pat pat pat* to tie things together.\n\nA fresh or unconventional texture will open up drastically different feels. People can dance to anything if it's got a 4x4 click, so it doesn't necessarily *need* to be a kick. You can go far using samples and percussion that sit in different registers, but play the same role.\n\n3) **Complimentary instruments**. If the kick is the \"rock\" then the groove is going to come from how everything else swings over that. What's the friction like between the kick and the other elements? If the kick is a \"straight man\", then the other elements pushing off of it are where the magic comes from.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387803428423733311",
    "author": "NoahNeedleman",
    "date": "2025-06-26",
    "content": "I find that im often too stereo in verses to make the chorus pop right, so I have to go back and pan shit inward, which always feels worse at first. Currently learning to think more mono in the verses from the get-go",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407182938105188428",
    "author": "Slow Hand",
    "date": "2025-08-18",
    "content": "There's no right way to go about sound selection, but ultimately you have to use your intuition and taste to judge if they're right for the record you're making. If the sounds don't seem to fit, then perhaps you need to ask yourself what effect it is that you're going for in the first place. Why are you trying to put *those* two sounds together? Decide if they get you close to that goal. If not, then simply find another sound. Not everything needs to work.\n\nA lot of it comes down to intention and conviction. \"Wrong\" notes or sounds that are dramatically different can still be pulled off if you play them with confidence and panache. Records are full of sonic choices that stick out like a sore thumb, and we can make them sound coherent with conviction. What might sound abrasive and weird at first can easily become habituated and familiar with enough exposure.\n\nI think almost any combination is valid. There are sound choices that are conventional and there are choices that go against the grain. Every unconventional choice is an opportunity to create a new genre or to create a new mood. It can be a matter of mindset. If you can free yourself from the need to do the \"right\" thing then the creativity to play with unusual combinations will come a lot easier.\n\nOf course, this is all hard to discuss without hearing examples. If you can give us more examples of what you're dealing with perhaps we can be more specific.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "967445874953297970",
    "author": "Eric Martin",
    "date": "2022-04-23",
    "content": "I added a typewriter typing sample and gated it to the toms of a rock song to great affect once the band thought I added a motorcycle sample",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053763659152752670",
    "author": "NoahNeedleman",
    "date": "2022-12-17",
    "content": "I’ll add something a little off the beaten path here. There’s a library called Indie from NI that’s kind of a pain in the ass to use, but has VERY real sections performing phrases. \nI’ve found a fair amount of the time I can use some of their phrases to better effect than programmed parts, as long as I don’t need specific Melodies. It’s worth looking at",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062442086642765996",
    "author": "Slow Hand",
    "date": "2023-01-10",
    "content": "Yeah, this is a really cool approach to metronome. I once worked with an engineer who had a drum machine/sequence set up where he could fade in and blend different rhythmic subdivisions. (1/4, 1/4t, 1/8, 1/8t, 16, etc...) The samples were all shakers and pleasant sounding percussion. It was way more musical than getting pummeled by the worlds crispest woodblock on the quarter-note pulse.\n\nHe said he'd developed it after doing a lot of slow doom-y metal records that grind along at ultra-slow tempos and where the players are playing very spacious but angular rhythmic parts that needed to come in on the \"+ e\" of beat 3 after a 4 bar rest. Stuff like that. Having 1/16t subdivisions alongside the 1/4 pulse was really helpful for the players to come in strong when they needed to catch a really tough entrance.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065765387473518602",
    "author": "Adam Thein",
    "date": "2023-01-19",
    "content": "Got some Thomastik-infeld Jazz Flats coming tomorrow.  Been wanting a set for years and finally decided to grab them after reading good things about them here.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066827922234679296",
    "author": "Ross Fortune",
    "date": "2023-01-22",
    "content": "ps not pop but Com Truise is my favourite hyperreal version of those 80s machines https://open.spotify.com/track/655RseUuyYprKIoC0mrNSF?si=29e1ece8b5824ae8",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596735626444951",
    "author": "LAPhill",
    "date": "2023-04-03",
    "content": "I was working with an EDM guy who was like \"yeah, this 808 sample is only good for F and G.\" It was eye-opening how narrow the sweet spot is with these samples.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114512948673650738",
    "author": "cy (sigh)",
    "date": "2023-06-03",
    "content": "pretty sure it won't. some folks might lean on it less in a pop context but it won't die down overall.\n\nthe \"trap era\" started in early 2000s (Rubber Band Man - TI  being one of the breakthru songs)  mightve hit the pop world later. it's (808 subs) been in hiphop since the beginning (80s) just that the exact texture has been changing with time/tech but it was already in modern hip hop hits. \n\nthe shift to hip hop being the main musical influence in the world around the 2000s  (not necesarily the #1 genre) is what weighs more on it. if another genre managed to pull that influence from it.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141949329347715183",
    "author": "NoahNeedleman",
    "date": "2023-08-17",
    "content": "Another example:\n\nOn Brett’s last record, he did a demo with a co-writer of a song I loved. he tracked vocals with me, and I suggested the track needed a Mayer style guitar solo, so I played it. When Dann Huff heard it he told Brett “we’ll just upgrade Noah’s track to Master Scale. It’s not gonna get any better than that.”\n\nWhen they went into the studio, they ended up taking the Mayer idea all the way, and the whole thing kinda went Country “Don’t Trust Myself.” They couldn’t do a Mayer solo on top of a Mayer vibe cause it would go from inspired by to straight derivative. \n\nMy solo didn’t make the record, and I didn’t get any production credit. But the guy who did the demo did. I did get some BGVs on it and paid accordingly. All that felt right to me.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1170114352402153614",
    "author": "Ingmar Carlson",
    "date": "2023-11-03",
    "content": "Toxic masculinity is key here. Honestly, even watching this clip years later, while I'm sure Bob Rock was and is a special kind of asshole, so much of this just reads as the culture of metal in the studio. He's largely just speaking their language, what we'd call \"vibing\" today. I grew up watching so many similar \"behind the scenes\" metal docs in which bands were just imitating/replicating this vibe in the studio. It's basically just all the boys who didn't/weren't gonna make the football team just doing the \"locker room\" thing in the studio. That's how it felt in the 2000s anyway.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179922587896266782",
    "author": "Zach Hughes",
    "date": "2023-11-30",
    "content": "I also struggle to find a balance between focusing on production work and my songwriting. I was focused heavily on production work over the summer and then when my schedule loosened up in the Fall I started writing for my next album. I had done a little brainstorm session with chatGPT actually to help me create a daily schedule oriented solely around writing which was pretty helpful. But even when still in the production grind I like having guitars laying around so I can grab one when I take a break or bring on in the house with me. If you have the flexibility, w/o compromising deadlines, I've found it helpful to leave room to indulge the moments when songs / melodies / lyrics pop into my head even when my expectation that day was to work on a mix or other production. Be interrupted by the song and push everything else back an hour and see what happens.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247538749005365328",
    "author": "Ross Fortune",
    "date": "2024-06-04",
    "content": "It’s a beautiful flowing thing. Obviously genre and context dependent, but it’s a flavour that I do really like. \n\nI went deep on the Beach Boys earlier this year and mapped out the tempo of Help Me Rhonda, then used the map to compose a track. The jumps could be as much as 3-5BPM from the verse into the pre, but in context it just feels like push and pull, tension and release, rather than “why’d it slow down so much?”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256451908827353188",
    "author": "Slow Hand",
    "date": "2024-06-28",
    "content": "Yessir. I knew an engineer who did a lot of doom-y sludge-y metal that moved at very slow tempos. \n\nHis pro-tip was to program a drum machine instead of a metronome that had 1/4, 1/8, and 1/16 subdivisions in the pattern so that the band could tightly snap to weird angular rhythms and hits at a very slow tempo. Worked like a charm.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278556410870763591",
    "author": "NoahNeedleman",
    "date": "2024-08-28",
    "content": "Or it’s just country music ¯\\_(ツ)_/¯",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350358028695769089",
    "author": "spectrummasters",
    "date": "2025-03-14",
    "content": "Foundationally , to my ear it’s pure 80s electro / hip hop .speed up planet rock with the Kraftwerk sample removed and you’re there . \n\nIf you listen to 2 live crew throw the d you’ll hear how electro moves into Miami bass and then it’s influences imho can be heard more recently by way of the trigger man break from show boys drag rap which became a major break for New Orleans bounce . Drake gave his nod to New Orleans bounce music having queen freedie in the nice for what video . \nSooo, for me it’s electro . Just with todays production aesthetics",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352474852774252544",
    "author": "James Cronier",
    "date": "2025-03-20",
    "content": "some highlights from tempo mapping a metal album today. The artist started playing drums in  tech death bands when he was 14.",
    "reactions": 3,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "1404445156685516923",
    "author": "spectrummasters",
    "date": "2025-08-11",
    "content": "It’s giving steel banglez and the Afro swing sound he made popular about 6 or 7 years ago in London ? Then we got the trap wave . Interesting one imho because there’s an unsettled debate as to whether the dembow , soca and other clave and tresillo derived pulses gave rise to the Afro beats wave that popped off in london years back (and steel banglez finessed so successfully into his (great ) productions) or if those Afro Cuban / carribean forms that have existed for hundreds of years are fundamentally derivative of the west african forms (eg nyabinghi and early New Orleans drum lines being deliberately so ) and so even if Afro beat reappropriated some carribean forms for its own modern genesis , it was only using what it gave birth to in the first place . \n\nImho these beats today sit as a uk post modern take on the product of all of these wonderful rhythms from the diaspora, and like the people the rhythms themselves are all kin . I’m sure Interested also if that particular beat can be pinned down to an early african or Afro carribean form\n\nMy Mrs dad is sierra leonian creole . Which is to say his heritage is to have been the people that returned back to Sierra Leone from Jamaica . Much of the sierra leionian creole culture is a blend of carribean and west african and The music and culture tends to be somewhere along this journey most times . It travels with the people and their story is the story of the music",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404468451623309324",
    "author": "cy (sigh)",
    "date": "2025-08-11",
    "content": "@Ross Fortune  @spectrummasters \n\npretty much hit the nail on the head on a lot of it. it does have a basic name and was originally mostly popular in West and Central Africa, where msot of the slaves that went to the Caribbean were from.  I'm just blanking out on the name rn. \n\nthat rhythm, or a form of it present in almost all popular Caribbean styles of music. \n\nreggae, reggeaton, dancehall, zouk, konpa, salsa, soca etc all have their versions of it w some of them essentially not having any difs. \n\ni think things kind of went full circle for various cultures. rose of reggeaton in the 90s in the Caribbean (2000s in the US) which became the first Caribbean genre after reggae/dancehall  to really hit the international stage hard brought a lot of those back to the forefront.  \n\naround the same time a boom in zouk / konpa music started happening in African countries (a lot of acts started touring there). \n\n\nafro house then afro pop and all subcategories started making rounds in Europe (at least the French speaking countries)  and the Caribbean in 2010s and hitting  us soil full strength a couple years after that (w some exceptions)\n\nall this culminating in the now where you'd be hard pressed to not here a handful of these rhythms on the radio in most countries. even I was surprised that one of the biggest intl hits was a haitian song and they ended up having a remix w burna boy. \n\nbut yeah I find it super interesting how the same core  rhythms is delivered under so many names.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404622497256706119",
    "author": "Slow Hand",
    "date": "2025-08-11",
    "content": "If you know your way around a synthesizer, Massive X and Serum 2 are both heavy hitters that cover all of my bases. \n\nSonically, Massive X has a \"warmer\" voicing and has all of NI's amazing effect algorithms built into it. Everything sounds incredible and is dripping with character. It's absurdly capable, but the interface may be overwhelming at first. It can be a lot to get oriented on. It's impossible for this thing to sound \"cold\". The preset library is less bass music/EDM and more balanced. NI offers a lot of genre-themed expansions. If you like programming sequenced/heavily automated one-button patches Massive X is king.\n\nSerum is on the \"cold\" side, but just as capable of \"warmer\" sounds. The sonics and DSP are clear as a bell. Stellar. It's more intuitive to program and the feature set is an embarrassment of riches. It's absurd how much functionality Steve and team crammed into it. Absolutely absurd. If you want to do EDM and bass music, it's the king and it's preset library leans towards that. I still cannot believe that they *gave* it away to Serum 1 users.\n\nBoth excel at cinematic and over the top. If you're looking for the \"classic\" sound, I'd lean Massive X.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407996896177291264",
    "author": "andrew_yv",
    "date": "2025-08-21",
    "content": "Not the one true solution by any means, but when I did my first album, I settled on an ensemble after I had already produced a lot of disparate demos, and then rearranged the best ones for that ensemble. In my case, it was string quartet, nylon guitar, percussion, and electronics. That also led to cool “choices” that came from like, having my violist play a part I made the demo of on a semi-modular mono synth. Ensemble can be a unifying lens to capture your diverse ideas through and give them a sense of unity",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1431635999351509123",
    "author": "NoahNeedleman",
    "date": "2025-10-25",
    "content": "Listening to Rubber Soul this morning and realizing just how much of my production instincts come from the Beatles. \n\nThe way repeated verses get a slight lift, BGVs as a real band member, the way space is filled with interesting sounds, not just guitar fills, and how every part is a *part*",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "940464922620461126",
    "author": "Zack Hames",
    "date": "2022-02-07",
    "content": "Live records, jazz records, and classical are actually usually SUPER fucking edited lol.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957455128233930823",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "As a counterpoint to this idea, what you often see in many styles of electronic or 20th century classical music is that the arranging can, in fact, be an integral part of the composition and it doesn't have much of a \"song\" to speak of. In this case the arrangement and the song cannot be teased apart, because the overall musical effect is defined by and dependent on the unique qualities of the arrangement. Something like this: https://www.youtube.com/watch?v=wmrsud1PpRk",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987475076213538867",
    "author": "ehutton21",
    "date": "2022-06-17",
    "content": "Yes. Don’t let yourself hide them. I’d also say if the drums sound bad, that can also be a side effect of having everything else in the mix fitting one aesthetic or overall vision, and then having another that just doesn’t mesh. So turning the drums up might help you say, tap into a lofi element you didn’t know was there previously but that might sound great on the record",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994680091076464712",
    "author": "ALXCPH",
    "date": "2022-07-07",
    "content": "I like to mostly just work with audio in the daw. I dont gel well with the separate sequencer work flow. I might use midi for high hats if I’m doing some hip hop with rolls and pitched hats, but that’s it. If not I’m just pure drag on drop onto the timeline. Also midi can sometimes introduce delay or mess with the audio envelope. With audio what is see is what I get, so there is no second guessing my self.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032069020549124146",
    "author": "jantrit",
    "date": "2022-10-18",
    "content": "Love a real bx20, not in any way spring sounding but it’s def my fav all around verb. Used to rock an old sound workshop rack spring and that was 🔥🔥 great for dubs",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061756445206532146",
    "author": "NoahNeedleman",
    "date": "2023-01-08",
    "content": "I’ve produced some jazz records. Bleeds into engineering and mixing a lot, but also just being the conduit for the artist’s vision is 90%. Help them get their ideas to tape.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066190946447917076",
    "author": "jordanmcleod_io",
    "date": "2023-01-20",
    "content": "anyone here move from ableton to pro tools and actually enjoyed pt more after the learning curve? i came up making edm loop based music in ableton but have been using more instruments and synths over the past couple years and enjoy recording myself live instead of programming notes. i've been using ableton since i started 10 years ago so i'm very much in my comfort zone using it, but have always thought about a change into pt. i use pt for mixing so it's not completely foreign to me. just curious if anyone else has an experience that would encourage me to try it out.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078115086784270429",
    "author": "BatMeckley",
    "date": "2023-02-22",
    "content": "This is interesting, but definitely puts me in the feel extra fine at 48 camp now. No where near the difference to justify all the extra file size/processing power/etc. for me at least. And I’m the kind of guy that sweats pop filters.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092594893181943879",
    "author": "cy (sigh)",
    "date": "2023-04-03",
    "content": "a large amount of hip-hop and R&B 808s are modified DJ spinz 808s from early 2000s. \nor they'll be layered along with them. I'm sure the % has gone down over the recent years w sublab and ANA going on but it was hard af to find any that weren't from those packs early on. unless you had access an 808 drum machine  of course.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093033710628126771",
    "author": "ehutton21",
    "date": "2023-04-04",
    "content": "Oooo bang bang is a great pop ref",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095301946866417684",
    "author": "spectrummasters",
    "date": "2023-04-11",
    "content": "It’s worth considering different 808s for different parts to meet your needs  . Sometimes I’ll have three diff 808s and a Moog bass  . And they’ll obvs all be treated individually . Re : which 808s ? Ime I find the choice of 808 (in my genres ) is a trend thing , in the last 3-4 years its pretty much been a progression by producers through perhaps four or five 808 samples .....and when the sample changes its often in alignment with a new programming technique (like new multiple flams ....or conversely, sparse hits etc ) . If you’re searching for ready made samples I could point you to a few places or if you’d like a little pack of the ones I’m referring to in what I said previously ....hmu. Happy to pass on privately . If so, these ones are more contemporary rnb hip hop than the actual  old Skool electro Roland 808 kick",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095798928231895072",
    "author": "popaganda.",
    "date": "2023-04-12",
    "content": "I'm gonna butt in and say, respectfully, I don't think it's that deep. If Marv tries it and realizes he sucked the soul out of it there's an undo button. No harm done",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103373035131637802",
    "author": "popaganda.",
    "date": "2023-05-03",
    "content": "There are some traps with Lego music that can be overcome with a little intention. For instance, we all kinda know the standard contours of a pop song….in Lego music you pretty much accomplish this by addition and subtraction of arrangement elements, but in the live days musicians would contour a song with the energy/intensity of their playing, and when a rhythm section is tracking together someone is usually leading that charge and everyone’s riding that energy wave together into the last chorus or whatever",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103374529767677994",
    "author": "popaganda.",
    "date": "2023-05-03",
    "content": "Well yeah, doing anything won’t make you great unless you do it greatly. But my point is that if you feel you’ve been making boxy music a way out of that trap is to conceive parts more linearly and play down a whole take with an energy contour rather than add and subtract elements for the energy shifts",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105818824885932192",
    "author": "Adam Thein",
    "date": "2023-05-10",
    "content": "Mine just arrived yesterday.  I’ve got a session coming up that I knew this would be great to have for keys, vocals, and guitar sounds.  It’s definitely a bit limited in scope to lofi world but lord almighty it does those tones with ease and sounds awesome.  And the saturation knob like Noah pointed out is really sweet sounding.  I’m not a guitarist but I was playing around last night with keyboard sounds and full mixes and it was very inspiring.\n\nI agree wholeheartedly that $400 is a lot for one pedal.  Factor in another $60 for their midibox if you want to have it connected via midi.  They do have CC control of every feature on the pedal including the hidden ones and an Ableton Max4Live plugin that allows you to recall settings and automate parameters.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114670343798411264",
    "author": "cy (sigh)",
    "date": "2023-06-03",
    "content": "so translating that in a palatable way often take deep understanding of both sides (of whatever genre /style you're combining)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117328178361421866",
    "author": "spectrummasters",
    "date": "2023-06-10",
    "content": "yes agreed, production wise you can follow those roland drum kits pretty much through every decade to this day. its amazing to me that a number of todays budding producers can name these things partially, for example referring to the Roland 808 Kick Long and not know anything about the Roland 808, let alone the other modules. ......and parrallel to the \"808 \", the 909 is still to this day, going strong in house with the likes of MK . From a production/mix viewpoint....i suppose these sounds themselves hit with such a charcter in the right frequencies that there must be something intrinsically appealing to us that will keep them forever relevant.Im diving back into the Linndrum Clap and the old Jermain Dupri / So So Def claps at the mo for a little diff sonic character .....they are all still in the same ilk as the rolands though. \n\nre: the drill hats.....thats another cyclical pattern there. In the uk thats been appearing and reforming for decades now. its a soca pattern that the uk appropriated into a period of uk garage production (about the same time that 2 step began to mutate into the hip-hop influenced So Solid style )......and then dipped into a scene we had follwing called UkFunky ( a mix of Us House and Carribean influenced drum patterns and bass) . Then it re-appeared again in those drill hats once the uk appropriated/re-mouldedd chicsago drill",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123025494460346468",
    "author": "Will Melones",
    "date": "2023-06-26",
    "content": "For the score, if rock is your typical voice, see if you can get away with a rock score. Or a beats and rock hybrid.\n\nLuckily in every case I’ve heard a director say they wanted jazz in the score, they really didn’t want jazz at all",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141882025469554698",
    "author": "NoahNeedleman",
    "date": "2023-08-17",
    "content": "John Fields did this to me on a Daniel Powter song. Note for note redo, 2 clicks faster. There’s no legal recourse, just a dick move. In country music it’s done a lot, but demo producers often get a co credit if they really crush it and parts they recorded or programmed are used.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174811638696775841",
    "author": "BatMeckley",
    "date": "2023-11-16",
    "content": "You should absolutely take Phil’s advice over mine on this, as he’s a scoring guy, and I’m a hack rock guy that occasionally needs orchestral stuff… but having said that I’ve found the spitfire stuff both useful and inspiring. That’s where I’d start if I had to do it all again.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186816812986400870",
    "author": "Josh",
    "date": "2023-12-19",
    "content": "It’s wild how many tuning artifacts are in rock songs that you’d never notice.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203509836315103242",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-03",
    "content": "Ive told this story before, but the one singer I worked with before was surprised I actually cared about her vocal performance and gave her consistent feedback. Turns out she was working with a lot of EDM guys who rly dont give a damn and dont even put on their headphones when she’s doing her takes",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241851491610923018",
    "author": "cian riordan",
    "date": "2024-05-19",
    "content": "My wife hates Michael Jackson because of all the things, I still rock him weekly. Everyones entitled to their feelings an opinions.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248752375146090516",
    "author": "Oli J",
    "date": "2024-06-07",
    "content": "Yes this album was actually combination of a Telefunken 251 and a CM7s. Cm7 bit darker and 251 we used for the brighter more pop songs. \nI also own a flea and love it and the Wunder is our go to mic. We pretty much use that on everything and we have quite a few. they all sound the same which is really important for us for doing drop ins. Laura’s Instagram has a funny pic of her taking that mic to abbey road to do Taylor drop ins so we have consistency.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255928969153478688",
    "author": "oaklandmatt",
    "date": "2024-06-27",
    "content": "Also, I highly recommend when vocal producing that every have a fun distortion/ tune/ delay throw option for the singer to do some creative ad libs after tracking all the important stuff. Especially for songs outside of the genre of the usual tune/distortion hip hop thing.\n\n@BatMeckley have we ever talked about this? I always do this when I'm cutting vocals and it always yields interesting results.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1262410190670794802",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-07-15",
    "content": "For slightly aged generic (but not original drum machine) stuff, Vengeance sample packs should do the trick. The Nexus 4 VST is also a library of impossibly generic patches and sounds (including drums) for electronic music. But honestly I feel like searching \"House Kick\" on Splice should get you there within the first few results",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1316727593726120030",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-12-12",
    "content": "I went to this DJ gig yesterday and the last DJ played some dubstep and I found it remarkable how similar Dubstep and (modern) Metal can be. The buildups, the slow half time breaks with people jumping up and down, the tension and release culminating in fast, energetic parts where everyone freaks out and just loses it. At one point ppl started to mosh like crazy which I've never seen at a gig like this",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1323730372772761690",
    "author": "SawyerM",
    "date": "2024-12-31",
    "content": "I come at it from what the artist wants to do... I always ask for a playlist of artists who are their biggest inspirations. Then I try to work with them to find a sonic identity. I am working with an artist who is in a similar spot and we ended up with an indie folk sound that was a pretty big shift from his social media content. But it was the sound that he heard in his head when he played. To me it's important to make the project that the artist will want to stand behind instead of something that might stream more copies.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341918124957761579",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-02-19",
    "content": "Yeah sometimes you‘d type in something like „lead synth“ and it gives you trap hats…",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360330677740109986",
    "author": "minipops",
    "date": "2025-04-11",
    "content": "Ok not exactly what you're asking for but this is what came to mind when you first asked.  It's an acoustic kit made to sound like electronic 808 sounds. Could be layered with a real (electronic) 808 kit for a more electronic sound.  https://majetone.com/products/ac08?srsltid=AfmBOoowl8cU0O8AdqkZLT53l-S8Vfk7WnH_a-4oslEhJe2JlOYI3GiD",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417190382579744830",
    "author": "Josh",
    "date": "2025-09-15",
    "content": "You try lower velocities? Most of the annoyance is due to the part being played super hard. Even when doing rock and metal I’m rarely all the way up unless it’s a snare",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1462556614879088753",
    "author": "hyanrarvey",
    "date": "2026-01-18",
    "content": "That dude was my neighbor in the apartment I used to trap out of in Brooklyn",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470803943952224359",
    "author": "Will Trotman",
    "date": "2026-02-10",
    "content": "In addition to the diamonds like Noah said, just root notes chugging away or playing 8th notes can be helpful and non invasive if chords or power chords feel too informative. Octaves can be a cool halfway point. A lot of songs seem to have room for the clean “dinky” sort of electric parts (sometimes slightly melodic or sometimes just hanging out on a single note).\n\nIf it’s a matter of filling space, something that helped me on a pop track the other day was making a second track for echoes of the lead vocal where you can low pass it pretty hard and delay / verb it out.\n\nI often find myself introducing subtle sub basses later in the song, potentially doubling electric bass with synth bass, maybe layering snares to be fatter in later choruses. Then playing with some subtle percussion elements like triangle, clave, wood blocks, to differentiate later choruses.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937557545302757406",
    "author": "Slow Hand",
    "date": "2022-01-30",
    "content": "*Keyscape* has some fantastic sounding (and unorthodox) sampled keyboard instruments. That said I'm not particularly fond of the sound of it's LA Custom C7 grand piano. Which is a little too hi-fi for my taste.\n\nLately I've been very impressed by NI's/Kontakt's *The Maverick* grand piano. I believe it's a vintage Bechstein grand. The sound is robust and rich without all of the \"zing\" that I see in a lot of full-scale sampled grand pianos. It sounds \"woody\" to me. I think it would make for a very nice jazz piano.\n\nThey did a really good job of sampling every facet it and it has enough flexibility that you can dial in the really intimate Nils Frahm-style damper/pedal/mechanical noises, which I like.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "939374659370102865",
    "author": "peterlabberton",
    "date": "2022-02-04",
    "content": "I’ve done this a few different ways as well—once, both songs were mixed in the same session, and then bounced separately for mastering. (FWIW, that Pro Tools session became an absolute nightmare—wouldn’t necessarily recommend this method unless there is some reason to do so. In this case we had effects/elements from the first song pop up later on in the second song.) I left blank space in the second song’s bounce so they could be lined up perfectly. Other times I’ve taken a stereo bounce of one song and dropped it into the mix session for the other just to mock things up as we go. What happens on the mastering side I am less familiar with… but if it’s something specific we’re after I’ll usually send along a reference of the exact timing/fade/etc. for them to match.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957009290315583489",
    "author": "KushKadett",
    "date": "2022-03-25",
    "content": "Dub and raggae from that era was made on old BBC consoles (very hifi and not lofi gritty in my book) There's an engineer giving a masterclass on dub mixing on youtube (great video, highly recommend it!)  and he explains how it's kind of a misconception that their equipment was all ghetto when in actuality they had incredible world class stuff left over from the brits after they left, which rivals what the best studios use even today. Analog gear hasn't really progressed much and a pultec/Neve EQ is still one of the best EQs ever for instance. Those records still sound great for that reason. As for punk and hardcore it's interesting: do people genuinely still listen to those records? I've revisited a few old punk records which I used to think were amazing. The songs are great but the listening experience just isn't enjoyable for me anymore, in part due to messy playing  and bad recording/mixing. With bad I mean the playing distracts from the groove of the band and the mixing distracts from the song, where it does not support the dynamic shifts",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957015140400783410",
    "author": "peterlabberton",
    "date": "2022-03-25",
    "content": "I think the example of great punk/post punk/early indie records is perfect: great music but poor sonic quality and sloppy playing—at least by many peoples’ standards. The Replacements Let It Be is fucking rad, but would I use that as a mix reference for how I want something to *sound*? No!\n\nOn the other side of the coin, I feel like a *ton* of current/recent music can sound really good from a technical production/sonic perspective, but be totally void of any emotion that I connect to. So would I ever put it on to listen to for pleasure? No!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957453360200548423",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "It's the difference between playing *Blackbird* by The Beatles with solo voice and acoustic guitar, versus arranging it for a big band or a symphony, or doing it as a gritty electronic dirge.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984098024303239178",
    "author": "gatewoodsensei",
    "date": "2022-06-08",
    "content": "I feel that. Most of my music is orchestral and electronic heavy so I’m in kontakt a lot. That rickenbacker bass is killer tho.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009911580147855360",
    "author": "Jeremy Klein",
    "date": "2022-08-18",
    "content": "I compose/mix a lot of library rock/metal music and I basically couldnt have that gig without superior drummer 3. \n\nFor it's variety of tones and realism I think it's the best out there. If you program with the predefined MIDI grooves as a base, you can get rock drums that sound _almost_ indistinguishable from the real thing. \n\nI've got a few of the SD expansions and honestly think the core library is still the best one.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1049483855670820885",
    "author": "Deleted User",
    "date": "2022-12-05",
    "content": "I can see stuff like that being useful for electronic music though. making the sound pop with a different character can be a cool effect. I've seen skrillex do it with his synths",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053737478776959166",
    "author": "BatMeckley",
    "date": "2022-12-17",
    "content": "I’m a spitfire junky, and LOVE the ar2 stuff, but I don’t know if this is the answer.\n\nChamber is better. There’s some really good intimate stuff in Albion NEO. In terms of sitting them in productions I’ve found that libraries you wouldn’t expect like the olafur stuff works really well in a dense track. If you’re trying to make an actual orchestral track it’s different.  In the same way if I was doing a pop song I’d reach for a Taylor acoustic but if it was solo acoustic singer songwriter I might reach for an old Gibson or Martin, if that makes any sense",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066812129560236182",
    "author": "Slow Hand",
    "date": "2023-01-22",
    "content": "How does it *sound*? I'm not crazy about 707 sounds, but if the writer has made something compelling and it sounds good  as-is then why *not* use them? That said, I can't recall the last time I heard a 707 in a pop track.\n\nIt sounds like you're wary about undermining their original choice to use a 707 kit and are trying to decide if it would be a step too far to replace what they've already done. I would just ask them \"Hey, how committed are you to this drum sound? Do you mind if I juice up the samples a bit, or would you like roll with what's already there?\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073678135016558592",
    "author": "austenballard",
    "date": "2023-02-10",
    "content": "you mean pop filters vs. ess-enhancers, right?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073680222064488508",
    "author": "The Lemon Chef",
    "date": "2023-02-10",
    "content": "Yea it comes with that and a mesh filter and also a metal filter. I mainly use the synthetic foam",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077799792861794374",
    "author": "Josh",
    "date": "2023-02-21",
    "content": "Same. I was watching this Netflix series called like “the history of pop music” or something like that. And the team max came up with literally operated in studios that were nice but most people in this discord have the same or better setups, and they were literally just working with their friends.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080775656570363934",
    "author": "jonmatteson",
    "date": "2023-03-02",
    "content": "I use addictive drums and enjoy it. I’m sure superior drummer is great too. I like to use the build in midi packs for basic grooves then customize them to my liking if it’s a pop rock thing.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080823675579813999",
    "author": "cy (sigh)",
    "date": "2023-03-02",
    "content": "1. for sound i think one option would be a more functional pack that covered most \"meat and potatoes\" sounds. \nor a more stylized /specific sound. with a couple more flexible parts /sounds added. \n\n2. personally I set my own to aroun -8 too so id actually prefer  that\n\n3. having the stems seperate can definitely be useful for altering the groove (of loops)  ans modifying individual sounds when needed. \n\n4. not important at all to me. i tend to build from scratch anyway but would be down to make the Studio One instrument versions if you need it\n\n5. as far as o can tell  44/16  is what's most common but recently im finding 48/16 and 48/24 packs pop up, especially for more acoustic sounds. prefer those myself.\n44/16 by far the most common in my exp tjiugh",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080871146251104338",
    "author": "Zack Hames",
    "date": "2023-03-02",
    "content": "I’m probably an outlier in the usual drum pack consumer but I’ll give you my take:\n\n1. I found when there’s a million samples I get uninterested quickly. I’d prefer 2 snare sounds as opposed to 15 slight variations of nearly the same thing.\n\n2. I use an MPC, so the lower volume thing would be annoying for my personal use, but that’s an outlier.\n\n3. You could farm out the Battery / Kontakt / etc packs to friends who would be willing to do it or use those tools a lot, that way you’re not stuck making a ton of them (unless you want to of course) \n\n4. I don’t touch loops usually but I know tons of others do. \n\n5. That’s it. Sounds like a super fun and badass project! You should document it on the way on the discord\n\nEdit: I’m speaking to more electronic and supplemental use of drum samples. There are probably tons of folks out there who want all the options as if there was 100% a real drummer recorded in their studio.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080905952674455592",
    "author": "Jeremy Klein",
    "date": "2023-03-02",
    "content": "So i'd say get SD3, but also get all their indie rock / genre appropriate midi packs and your drums will sound amazing in sessions",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084901581025194086",
    "author": "hank01564",
    "date": "2023-03-13",
    "content": "My favorite plugins for something like this are Abletons Redux (I use the filters on the bottom to low pass), Softtube Dirty Tape (for the wobble), McDSP Futzbox (distortion, speaker emulation), Unfiltered Audio lofi-af, RX950 (emulation of MPC conversion) and Goodhertz Lossy",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089200817178947695",
    "author": "hyanrarvey",
    "date": "2023-03-25",
    "content": "Oh wait haha not in the metal discord",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089251394629931130",
    "author": "jonmatteson",
    "date": "2023-03-25",
    "content": "The Travis Barker pack on splice does this sound really well. His engineer when he made this was Matt Malpass who did a lot of late 2000's rock stuff and gets awesome drum sounds",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105843115060891758",
    "author": "NoahNeedleman",
    "date": "2023-05-10",
    "content": "Think of it less like an expensive pedal and more like a great deal on an outboard vibe box. \n\nThe wow & flutter go from really subtle to downright outlandish, but always musical. And there’s a failure knob that you can automate for ends of phrases. Idk man, if you think of it as a lofi box I get that it feels expensive, but it’s more than than imo",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114663006354292806",
    "author": "Slow Hand",
    "date": "2023-06-03",
    "content": "Bowie being perceptive as always. \n\nThe question that comes up in my mind is \"Where are the new innovations happening today?\" The incubation period for new musical styles is much smaller than it used to be, pre-internet. \n\nMusical innovations don't live in obscurity for very long these days. They get widely disseminated and integrated into existing styles far more quickly. If a group of teens in Mumbai create something fresh it may be days or weeks before it gets shared with the rest of the world and before other creators start integrating it. Whereas early hip hop had years - nearly a decade, by some counts - to gestate and find itself before it spread outside of New York and was co-opted by the greater world.\n\nI wonder if we've lost something in that tradeoff. We gain quicker access to art and ideas around the world, but we pre-emptively bring these musical mutations out into the daylight before they have time to grow into something unique. Something that is fully formed by it's local environment.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116808418175483957",
    "author": "spectrummasters",
    "date": "2023-06-09",
    "content": "yes, i agree with this fully. i think what we've all witnessed perhaps over the last couple of years is the implosion of the atlanta sound and scene, the death of takeoff (rip) , trouble (rip) , the sale of QC , the rico of YSL , the fallout amongst collaborators......tory lanez getting banged up.....the list sort of goes on and on....all the cases and arrestys in NY drill, i think gun crime has unfortunately eviscerated hip-hop over the last few years (rip nipsey) and its impact is being truly felt. The oversaturation of lil-kim style shocke femal mc's is super dead as well imo. city girls, ice spice....sexxyred, meg the stallion.....its sinking the ship a bit imo. Louisiana and memphis still hitting tho IMO. love nba youngboy, toosie, rod wave, kodak black....i think it might just continue to go a bit more to the scattier, hyper drum patterns of some of these artists i mentioned. in the UK nines has just dropped a dope album , a lot of nice throwback 90s hiphop patterns that i didnt know i needed but apparently i do",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134994910525784104",
    "author": "Deleted User",
    "date": "2023-07-29",
    "content": "inner harmonies are more textural than functional, they exist to fill the space in the middle, but they can also take up too much space. key players and guitarists are guilty of this too often. no need for a 7 note voicing in a dense pop song\n\nBut chord “progressions” are also underrated in a sense that it really shifts the emotional context. you can really make a pretty significant difference by carefully crafting them, but also that doesn’t mean you need all the stuff in between bass and the main melody on every songs\n\ninstruments like chord stabs can serve the function of percussion and drive the rhythm. it’s ‘rhythm sectio’  afterall",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135061180545761340",
    "author": "LAPhill",
    "date": "2023-07-29",
    "content": "Pretty sure 99% of current country songs have either “blue jeans” or “cold beer” in the lyrics, so you are very correct.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142056262524207125",
    "author": "NoahNeedleman",
    "date": "2023-08-18",
    "content": "In country music they do just that. A lot. They pay a premium for a known entity to make no changes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150084081808326777",
    "author": "Josh",
    "date": "2023-09-09",
    "content": "The whole wave of  younger new indie rock is somehow getting more gnarly than the stuff we listened to coming up. So I’m extremely hype.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155587108543664210",
    "author": "Skyler Young",
    "date": "2023-09-24",
    "content": "Started with making sounds more tailored to the modern pop or hip hop producers, I felt like omnisphere and nexus sounds were more made for 90s electronica than what most producers are actually looking for today",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169726028269236234",
    "author": "Edward Rivera",
    "date": "2023-11-02",
    "content": "That's probably why Bob mostly did butt rock records. He was in the space where that was mostly tolerated",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169731074671247540",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-02",
    "content": "Yes. I guess being in a studio desling with five hyper masculine dudes who play heavy metal with posters of half naked ladies on the wall everywhere is different than cutting the newest Enya record. Context is king & read the room",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180161894703714425",
    "author": "Josh",
    "date": "2023-12-01",
    "content": "TLDR: I found sounds I liked from “extreme” genres like EDM and hyperpop, learned how to recreate them, and now I feel it translating to less extreme genres.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185148080379662366",
    "author": "Deleted User",
    "date": "2023-12-15",
    "content": "https://youtu.be/0cmUQj3A_aM?si=1BiKf7NYYFBIzrm7\n\na lot of interesting ideas here. honestly I haven’t really layered anything besides rock snare drum in a minute",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186399600957997236",
    "author": "cian riordan",
    "date": "2023-12-18",
    "content": "I mean, I'm rarely recording HH only in a rock situation -- it's usually part of the kit and will get whatever room treatment is going. But yeah, for 99.999% of stuff, I'm sticking a SDC on there. Some people like the SM7... that's never worked for me. AKG 451, KM184, AT4051... it's gonna sound like a dagger in your ear with most options.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196906358180691989",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "@marv , I’d also add  to @Edward Rivera  spot on suggestions . Genius deconstructed channel on YouTube is for me always a quick inspiration . Within rnb / pop / reggae ton / hip hop ….it’s 15 min videos with the producers discussing their formulative idea or jam that gave  rise to whatever became the hook for the song and how they built it up …..how it felt in the studio when they did it ….and each one is a hit record so it’s always a fun QuickStart imho",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202568892958908497",
    "author": "Edward Rivera",
    "date": "2024-02-01",
    "content": "Yoooo. I've been really enjoying anything Zakk Cervini has been putting his hands on lately...Poppy, Bad Omens, Architects, Spirit Box, Sleep Token...it's all a little same-y and a bit pop but no one's doing it better",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202586137370169414",
    "author": "Edward Rivera",
    "date": "2024-02-01",
    "content": "There's also this artist called Ada Rook who is more apart of the bedroom metal scene, leans more towards 100 Gecs...super loud and distorted",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202788395261231144",
    "author": "sethearnest",
    "date": "2024-02-01",
    "content": "Yeah, Echoboy, the Space Echo algo would be the one. Waves H-Delay w/the filter down at like 1.5k and the 'lofi' button engaged would be another (maybe this actually would be closer to that song you linked).",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239074141483569152",
    "author": "Zack Hames",
    "date": "2024-05-11",
    "content": "Battery is too drum beat oriented; and then processing doesn’t seem to help me get there. \n\nThen the like, more bass line centric 808s on my MPC are exactly that.\n\nDug through my other loose 808 samples, they just lack the length of note and decay, I know it sounds super simple and dumb but there’s this FEELING I am missing from all of it. Clean, long, deep, not overly bending the pitch. \n\nAn example would be good; I’ll try to find. Metal bands use them a lot and it’s sort of silly",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241766989412831242",
    "author": "Bryan DiMaio",
    "date": "2024-05-19",
    "content": "If you can make something compelling out of ingredients in front of you, does it lessen the art? Listen to a lot of old school hip-hop, it's mostly rapping over a sample or combination of samples of released music but the art is still art",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255902242368655461",
    "author": "cy (sigh)",
    "date": "2024-06-27",
    "content": "this is true mostly in the context of most pop music - which aligns a w what the discord is about. and I do think it's much more so for loops than samples (as in sampling songs or sound from other coxtexts)\n\nin a lot of jazz, hiphop, rnb (others genres too tbh) the samples can be pritty vital to understanding the full context of a song.  historical /cultural references through borrowed sounds  are very much part of world building and storytelling  when it comes to music outside the pop /mainstream  worlds",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255906395895627858",
    "author": "cy (sigh)",
    "date": "2024-06-27",
    "content": "Melanie Charles (jazz / heavy hiphop influence)  is a good recent example. she put an album out on Verve a couple of years back. she's sampling /reinterpretating a bunch of classic songs written /performed by black women in jazz (all from the same label) . she uses 4 Roland SP samplers in her process on top of live instruments. there's is very intentional use of sound bites too. all to guide the listener through specific narratives. \n\nit's a different approach/intention  in captivating a listener in those ways than most chart topping music. both valid and both necessary imo. but very different",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265087373365219340",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-07-22",
    "content": "For anderson Pak stuff you have Make Pop Music's \"Anderson Pack\". On splice for live drums, \"that sound\" is very good and has lots",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277693286001148087",
    "author": "NoahNeedleman",
    "date": "2024-08-26",
    "content": "I usually rock a Pultec with a wide smile & TDR Kotelnikov.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1314092953492258847",
    "author": "vostral",
    "date": "2024-12-04",
    "content": "Every year i try to remake 2-3 of my favorite records for practice. Even i've listened to a record 100 times, reconstructing that song helps me learn so much not only about production techniques but also mixing. I'm not the only one by Sam Smith was reconstructed years ago and i'd learned the simplicity of the production and how i can achieve that indie sound using Eq, comp & tape plugins.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1316803473995599902",
    "author": "onanisland",
    "date": "2024-12-12",
    "content": "Modern trap flows are nu-metal riffs",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328819956850229258",
    "author": "Slow Hand",
    "date": "2025-01-14",
    "content": "I like NI’s *Session Horns* for a pop horn section. Good selection of horns and articulations with an easy interface.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339614547971145800",
    "author": "Spencer Broschard",
    "date": "2025-02-13",
    "content": "Depending on how pop you’re talking, good for you by Olivia Rodrigo at least the chorus’, more rock the futures album by Jimmy eat world sounds like it fits this brief, still into you by paramore",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341878787436187739",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-02-19",
    "content": "I'm assuming since Splice used to be used mostly my hip hop and edm people, they didn't rly feel a need to add a time signature option. but it's long overdue imo",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350178412001497108",
    "author": "kieronmenzies",
    "date": "2025-03-14",
    "content": "Atlanta bass which is an offshoot of Miami bass. Same general sound with the kick pattern and 808 but the Atlanta sound is a little more r&b leaning than the Miami thing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357842058492252460",
    "author": "Slow Hand",
    "date": "2025-04-04",
    "content": "I've always loved Vulfpeck's approach. For the first few albums every single tracking take was filmed on an iPhone while they recorded in their living room/bedroom/etc, which allowed Jack Stratton to turn around and release low budget music videos for every single song on the album using the take that made the album.\n\nTheir setup was always lo-fi and charmingly janky in the edit. They just leaned into the artifice of a low-grade camera and built their whole visual style around these simple phone captures of the session.\nhttps://www.youtube.com/watch?v=uUyuGjLy4BQ",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1364312086733389845",
    "author": "Spencer Broschard",
    "date": "2025-04-22",
    "content": "Telofi by black salt audio is nice",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376735802360598611",
    "author": "hyanrarvey",
    "date": "2025-05-26",
    "content": "Coming from metal no task is too daunting so that’s always a good feeling",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386474605404754042",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-06-22",
    "content": "How do you guys approach the stereo field with intent? \n\nWas listening to some Short N Sweet today and I was floored how much stuff is happening on the sides, especially all the Jack Stuff. (just listen to Please Please Please there's different stuff happening ALL the time)\n\nNow whenever I try doing something that's maybe using the stereo field more than your run of the mill pop production I get a bit afraid of it being too obvious/distracting/unbalanced etc. or simply sounding more like an accident than a concious decision. \n\nWhen you guys have something on one side, do you always balance with something on the other side or do you sometimes simply have smthg on its own on the left / right? \n\nHow do you make sure it sounds meaningful and intentional rather than being just \"oh they panned that to the side\" \n\nWhat about stuff like pads? I normally never pan that to either side (again being afraid of it sounding too weird) \n\nHope I'm making sense here and looking forward to hearing your perspectives on this!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392272697542840563",
    "author": "hyanrarvey",
    "date": "2025-07-08",
    "content": "So like knowing your accents is really gonna help but when I am programming like hardcore or rock drums and need it to sound natural I do these things. Learning how the hand dynamics work so like for a snare roll into a Tom roll it would be like 125 119 120 110 125 118 120 87",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411101993199603813",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-08-29",
    "content": "maybe the Avid LOFI? you can get some pretty nasty distortion with that one and since it's PT internal there should be little latency",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417190541468369027",
    "author": "Josh",
    "date": "2025-09-15",
    "content": "Superior should be perfectly fine. GGD is kinda the standard anymore for country and rock but if you want something flexible I’d check out the Benny grebb kit they have. The cymbals are also lovely. Big beefy shells.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418321628680683610",
    "author": "longstoryshort",
    "date": "2025-09-18",
    "content": "it's just a random thing, a lot of people obsess over Logic swing in the house/electronic world \n\nit's based on the Linn Drum swing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1420356340664242276",
    "author": "Ross Fortune",
    "date": "2025-09-24",
    "content": "@Joel \"Roomie\" Berghult shared this a while back \n\n“https://helpcenter.celemony.com/ is really good tbh, better than most first party learning resources\n\nif you want a pop vocal workflow, Louis Bell shows his in his studio.com course",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428443726321160423",
    "author": "ltucunduva",
    "date": "2025-10-16",
    "content": "I tested it on a souless vst acoustic piano that I received for mixing and it kind of helped transform it into a more interesting sound. Almost without saturation and with a lot of room reverb from the plugin. The context was a folk rock like Steve Earle.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1455208080467038259",
    "author": "Beck Nebel",
    "date": "2025-12-29",
    "content": "There’s so much out there (lots of bad and lots of good). And lots of genre specific stuff. Ash Taylor, Nest Acoustics, Sam Smyers, Rob Late are some that I’ve liked",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937568391403814932",
    "author": "peterlabberton",
    "date": "2022-01-30",
    "content": "Just remembered I have this but haven’t tried it yet—you just inspired me to pop it open and, yeah, it’s a good one. And loads of fun mechanical noises, too, if ya want ‘em.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937660293184647188",
    "author": "Maxim",
    "date": "2022-01-31",
    "content": "I see what you mean. I used to fall into the trap of letting Melodyne “do its thing” or trying to align things to its pitch grid. I’ve since moved on by getting the best performance out of an artist (with the sound of autotune) and will only use Melodyne if I can hear a specific problem on a note that needs to be changed. So I guess I’ve started getting better results with it after using it less and only after listening specifically for pitch errors. I know it can do a lot more but the many features rarely helped me make the vocal sound better.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937696686946537472",
    "author": "h3x",
    "date": "2022-01-31",
    "content": "I second this. Been doing it for a while now and it works great. Especially for a pop/ hip hop vocal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "938546547522670612",
    "author": "Zakhiggins",
    "date": "2022-02-02",
    "content": "Any tips on funk guitar and making it sound good? It always sounds good when other people do it but I find it hard to not make it sound annoying",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "940459109176733746",
    "author": "peterlabberton",
    "date": "2022-02-07",
    "content": "ANY of it? Never—even jazz or live records often have *something* edited... at least in my experience.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "940464840231768114",
    "author": "Zack Hames",
    "date": "2022-02-07",
    "content": "I actually did a single mix recently of a 3 piece rock and roll band, didn’t edit a single thing. But that is the first time in a decade?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "940654505308094535",
    "author": "gawddammitmichael",
    "date": "2022-02-08",
    "content": "Im sure every genre is a bit different but I usually feel like as soon as i go from “that really helps the intention of the song” to “i love this cool sound I made” I’m pretty close to being in overproduction land.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941067108400377856",
    "author": "Zakhiggins",
    "date": "2022-02-09",
    "content": "Hmm. Hard to say. Put it this way, imagine you just got any old kick snare and hat sample, and made a basic beat with just those 3 samples and no processing. How would you approach going from that to making it sound finished?\nI suppose I'm talking in about pop music mostly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "949141515505119232",
    "author": "itaylerner",
    "date": "2022-03-03",
    "content": "I used Kyma a bunch in college, part of an “electronic composition” course. Super fascinating, but it’s a huge expense. Hardware dependent and pretty damn expensive if I remember correctly. Not super intuitive and it’s really nothing like a daw, it’s an object-oriented coding environment. But really incredibly deep, and if you’re into that sort of thing I can’t imagine there’s really anything like it, you could design some really remarkable stuff. Totally changed how I saw sound, but not really how I saw music tbh.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957018475379970058",
    "author": "KushKadett",
    "date": "2022-03-25",
    "content": "What issues do you see with the mixing? I think it fits the genre and the musical decade quite well",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957018947054608445",
    "author": "peterlabberton",
    "date": "2022-03-25",
    "content": "Eh, I just kinda pulled that outta my ass as a reference, there are probably better examples, but I’d fully agree that it fits the decade and genre well, BUT that in 2022 it sounds thin and old and, to the average listener, probably doesn’t sound as subjectively good as many modern records that are more full range in the bottom, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957484236435251200",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "You're right. The terminology often has different meanings when working in different musical idioms. For example, a rock producer is more of the coach and artistic midwife for an album while in hip hop the producer is the person making the beat.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "958186254686638100",
    "author": "isaac joel",
    "date": "2022-03-28",
    "content": "reading through this whole thread is amazing, i live for this type of thoughtful dialogue \n\nFWIW in my book sometimes \"poor\" production value is often what gives something it's magic, or at least the people at the time were just doing their best with the limitations at the time. i often will hear a song and feel like it's been over-produced/polished to within an inch of it's life and it just doesn't do it for me. \n\ni might have shared this before but this article from Gabriel Roth on how to make a funk 45 is intentionally absurdist, but he touches on a lot of points as to why so many old singles still hit so hard \n\n*shitty is pretty*\n\nhttps://funkydown.com/downloads/shitty1.pdf",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "961456887067447326",
    "author": "blanco",
    "date": "2022-04-06",
    "content": "mutes are common in hip hop cleans",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "962488466254475284",
    "author": "Slow Hand",
    "date": "2022-04-09",
    "content": "Has anyone got a recommendation for plugins that do fast varispeed-style pitch drops or ramp ups?\n\nIn a nutshell, I'm trying to do the move you hear in hip hop all of the time where the vocal pitches down a few octaves real fast for an accent or a drop-out. You hear it a lot in clean edits of vocal tracks.\n\nI know this is a trivial process for users of Pro Tools and Logic, but Ableton (unfortunately) does not offer an elegant solution. 😕",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "974051943561457675",
    "author": "delwin",
    "date": "2022-05-11",
    "content": "@isaac joel ohhh the lofi scene is doomed >_< bout to see lots of my friends' primary income streams disappear",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "980680508700753971",
    "author": "ehutton21",
    "date": "2022-05-29",
    "content": "the only thing i can think of is one of those tc electronic meters but that won’t help",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982391436295168072",
    "author": "longstoryshort",
    "date": "2022-06-03",
    "content": "producers - where are yall finding the pop marimbas/plucks that aren't edm synths?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987475418711990282",
    "author": "Jeremy Klein",
    "date": "2022-06-17",
    "content": "rest of the production is trap drums and 808 which is just hard to layer real drums even if they are recorded great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993882997189263520",
    "author": "delwin",
    "date": "2022-07-05",
    "content": "any tips on making Kontakt horns & strings, drum samples, bass guitar, etc. sound like the 70s? working on a period piece for a client. I'm usually doing more synthpop / electro pop but this one they want to sound like an early 70s disco piece. Humanizing the horns & strings is particularly difficult.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993890252148183181",
    "author": "Shadowherb",
    "date": "2022-07-05",
    "content": "moar tape saturation / lo-passing the strings somewhere between 15-20khz will bring you closer to a 60s/70s AM pop sound",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994720640290525335",
    "author": "Zack Hames",
    "date": "2022-07-07",
    "content": "I’ve yet to find a sampler plugin that is really fast and easy to use for me - Somehow using an AKAI MPC is easily the best and fastest way for me to use any electronic drum elements.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1008496764652888204",
    "author": "peterlabberton",
    "date": "2022-08-14",
    "content": "Any recs for good jazz chorus amp sims?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009932930631610388",
    "author": "VESHZA",
    "date": "2022-08-18",
    "content": "im trying to develop my ears to do more pop stuff but im just not at the place yet where like you automatically hear things and what you could add",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018474257174495303",
    "author": "louisvie",
    "date": "2022-09-11",
    "content": "hiya everyone. sub bass question : how do i decide which instrument is going to take the under 40hz frequencies between kick and bass ? for a rock song with hybrid drums and hyped up real bass gtr. i personnaly prefer bass to hit me rather than kick cuz i like the longer rumble, but i feel like the other way might be the best. for this one. i will A/B but any tips are appreciated 🙏",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020802074918793349",
    "author": "Slow Hand",
    "date": "2022-09-17",
    "content": "Does anyone have any rules-of-thumb that they rely on when programming groove?\n\nThings like \"I like my bass notes to be ___ in relation to the kick because...\" or \"I put my hats (blank) the snare because...\" or \"My (instrument) is 100% locked to the grid all of the time.\" \n\nOf course, everything is context dependent, so we're talking generalities here. But if you make nothing but trap music or lo-fi beats it would be good to mention that as well, for context.\n\nI'm curious to know what approaches everyone else has arrived at. For better or worse, I like to start with a blank slate each time and it ends up being an exploratory process for me every time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020805692094947358",
    "author": "Zack Hames",
    "date": "2022-09-17",
    "content": "I asked a similar question a while ago, and @oaklandmatt had a great answer basically to the effect of: \nSomething rushing ahead adds energy or anxiousness (a punk bass line or fast trap hihats, maybe a rock guitar solo)\nSomething late adds groove/swagger (Lofi hip hop snare, a lazy vocal, a funky bass line)\nI think that’s a really cut and dry way to view it; but what you said obviously applies, every context is different.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020824609920135178",
    "author": "cy (sigh)",
    "date": "2022-09-17",
    "content": "yeah its very case by case. as far as groove in relation to other elements. I've had guitars recorded loosely toa click and worked the groove around that - lining up the downbeats of the drums/bass  with the guitars even if it's a bit early or late. that was for a more indie type of joint. and for something more trap /modern hip hop, I've nudged bass notes or samples to get them to either sync w drums up for impact  or nudge slightly off to hype of of pull back the energy in the groove. \n\nas far as programming. I'll play with forward swing and dragging notes a lot if I'm going for a more real/dynamic feel when programming. keeping in mind that if the goal is trying to stay \"on time\" any fwd swing that might happen at the start of a phrase will be compensated with some drag  after or vice versa.  keeping velocities in mind w drum hits + linking it to a filter env so that harder hits have more high end and softer hits end up a bit rounder.\n\nadding subtle layers that are similar   to the main drums but occupy a different texture or tone  in dif  sections to thicken up the groove or automate the attack /sustain of certain elements thru diff sections to help shift the listener  focus throughout",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031612979520745494",
    "author": "BatMeckley",
    "date": "2022-10-17",
    "content": "All the guys better than me seem to love keyscape but I’ve never used it. It’s ALL OVER pop records tho.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031613561870491768",
    "author": "BatMeckley",
    "date": "2022-10-17",
    "content": "I feel like a ton of people on the Alicia’s Keys piano for pop mixes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032036247805370468",
    "author": "Slow Hand",
    "date": "2022-10-18",
    "content": "Ha. What I *really* want is Squarepusher's custom-built spring tank. So if anyone is near Essex and wants to burgle one of the baddest electronic musicians ever then be my guest. *(Note: please don't)*",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1032080851133022238",
    "author": "isaac joel",
    "date": "2022-10-18",
    "content": "@Slow Hand Gabriel Roth has a great instruction manual on making a funk 45 and he details taking a mixer + spring tank and making your own verb unit. Have a couple I’ve gutted from old amps and you can drive the circuit or run them in tandem for some incredible sounds 🤙 https://funkydown.com/downloads/shitty2.pdf",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033881551424995339",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "The sp404 was incredibly fun and almost gameboy-esque. That quality was really valuable. Roland has a whole showcase at guitar center right now, I think. It also went very seamlessly into a lot of lo-fi/formant heavy editing that I love to do with samples. \n\nI also made a pit stop to hardware synths. I love the korg units. I want to explore hardware synths because I feel like the tactile nature might actually teach me to be more creative than my digital synths.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033882394794655894",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "I have gone from mostly working around hip hop to actually being able to put my theory knowledge to more use with alternative material, esp synth pop, so like I’m kinda re-assessing what I have on deck as a producer.  Any recommendations on fun items to demo in the synth or sampler world that might be useful would be a massive plug",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050529370642591804",
    "author": "hyanrarvey",
    "date": "2022-12-08",
    "content": "Austin hull has an amazing kit from make pop music. For like 20 bucks its great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051200492941873313",
    "author": "hyanrarvey",
    "date": "2022-12-10",
    "content": "I don’t wana hear rick rubin play jazz lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051603180733079622",
    "author": "Slow Hand",
    "date": "2022-12-11",
    "content": "(Ok. Now I'm starting to run with this train of thought. Now would be a good time to step off if you've gotten what you need.)\n\nI don't want this to sound like the end-all be-all. One of my absolute favorites is James Brown, and there is no way that some of his songs would hold up to the level of scrutiny I'm describing. And those records *kill*. It's all vibe. It's vibe all the way down, bebe. Not a chord change in sight. Barely a melody in some cases. And that's alright.\n\nSo what did James do? More often than not James would get all of his band (real jazz killers) in the studio and he would sing the parts to them one by one and allow them to input their own feel.\n\nHe'd start with the drummer and have them play a pattern that James was feeling. Once the drummer was jamming on that he would move on to the bass player and sing them an idea. Once the bass player had that germ of an idea they would continue to jam on it with the drummer, refining and adding their own thing. Then James would move on to the horns, and so on, and so on.\n\nWhile James could be dictatorial and (from the perspective of music education) the least technically qualified person in the room he had *vision*. \n\nIf the song has a strong identity you can give your players a good (non-technical) prompt and they can interpret that through their own sensibilities. You can describe a mood, or a scene, or an abstract sensation.\n\nR. Kelly once said (I'm paraphrasing): \"RnB is supposed to feel like the best moment of your *life*.\" That simple description conveys so much about the feel, the pleasure, and the joy that he is looking for in his music. It also excludes a lot of possibilities as well. If you can give your players a prompt like *that* then you can get everyone aligned on the same wavelength and it will carry you so much further without the need to dictate parts.\n\n----",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051619305239892109",
    "author": "NoahNeedleman",
    "date": "2022-12-11",
    "content": "I’d argue that not all songs with a narrower style or that are more genre specific are necessarily “lesser” songs. The style or genre of the song often informs the parts that are written or played in the studio. \n\nThat being said, it does take a great song to be able to cross multiple genres and still be compelling… just that’s not the only rubric for a great song IMO. \n\nNow that I’m done with the pedantry, the rest of this manifesto was, per your usual, very well thought out and explained.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055091005726138409",
    "author": "Ross Fortune",
    "date": "2022-12-21",
    "content": "I dig. In pop tracks it’s pretty streamlined (though I do like to toss in options / widdly sound design bits etc and not worry it’s going to choke it), but I do some orchestral-hybrid video game stuff that can be pretty expansive.\n\nI’d love to have one go to that ticks all the boxes you listed, and maybe would also add that it be cross platform (ie plugin rather than a stock synth - would be nice to have the tool no matter what I’m in).\n\nThe hunt continues…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055319469225934899",
    "author": "Slow Hand",
    "date": "2022-12-21",
    "content": "Ahhh gotcha. That's a cool goal.\n\nSo it sounds like part of what you're seeking are techniques to add pitched resonance to samples that may be atonal?\n\nWell a resonator is a great start. If you're not already into it, I'd look into the karplus-strong theorem and physical modeling synthesis. That whole field has a lot of overlap with what you're describing. It's the kind of thing you'd hear Sophie or Jimmy Edgar do with their Elektron Monomachine.\n\n*AAS* have a whole suite of physical modeling products that function similar to *resonator*, but are third-party plugins. Doing percussion synthesis with *Chromaphone* can do a pretty convincing recreation of certain percussion tones with the added bonus of being as flexible as a synthesizer, because it is a synthesizer!\n\nYou could tune a high-feedback delay unit until it rings at the pitch you're seeking. I can elaborate if you need more explanation. Funnily, that's the entire basis for physical modeling synthesizers.\n\nAlternately, you could layer your samples with gently-blended sine tones. That's worth a try too. I know a lot of EDM producers are into this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1056251099297878116",
    "author": "Ross Fortune",
    "date": "2022-12-24",
    "content": "Thanks for your synth tips @wilhelmjosephk, @Slow Hand  and @ALXCPH. I decided to learn Serum while I'm back home for xmas, and having a lovely time making my way through the manual on AirPods.\n\nWhen I'm just experimenting, I tend to get inspired by a sound or a part that comes out of my fingers while I'm tweaking, and next thing I know I've made a track but abandoned the curriculum. Obviously a positive outcome in one way, but it's the same thing that's scuppered my progress for years (including on ever getting to properly know the OP1).\n\nI was thinking to try emulate some patches from songs by ear. Then there's YT tutorials from the likes of Mr. Bill and other EDM people, they'd probably keep me occupied for a minute.\n\nBeyond that, would you suggest any fun ways to keep myself interested in learning and honing my skills?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057070011757367326",
    "author": "Deleted User",
    "date": "2022-12-26",
    "content": "I'm gonna check it out! John Chowning made a huge contribution to electronic music and sacrificed his hearing inventing FM synthesis.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061755683663528016",
    "author": "Deleted User",
    "date": "2023-01-08",
    "content": "Saw some discussion on mixing channel about Jazz mixes. There's an album I love very much, and it's Brad Mehldau's Largo album. And when I looked at the album credit to find out who the drummer was, I found a producer on the credit. Which made me wonder what kind of a function does a producer in non-vocal jazz records would serve - things like snarky puppy is more obvious but this one is a bit different, it has more organic instruments and some interesting processing on it. I tried to find Jon Brion (the producer of this album)'s contact to ask him about the process but couldn't find anything - but does anyone have any experience producing jazz records? I'm curious to hear what were the roles\n\nhttps://en.wikipedia.org/wiki/Largo_(Brad_Mehldau_album)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062040600741937204",
    "author": "hyanrarvey",
    "date": "2023-01-09",
    "content": "This is also a genre thing too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062041020839235645",
    "author": "hyanrarvey",
    "date": "2023-01-09",
    "content": "Its 100% a genre thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062041400855773245",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "I think it’s more a “I want 100% live drums” thing. I can’t imagine a whole genre that has never used a form of loop in their drum sound.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062041824765681724",
    "author": "hyanrarvey",
    "date": "2023-01-09",
    "content": "Yeah thats cool for the styles you guys produce, loops are dope i love them but for heavy music its a no thats why i said its genre based",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062042025798672517",
    "author": "Zack Hames",
    "date": "2023-01-09",
    "content": "Even for electronic based or pop or hip hop or whatever.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062043462091943997",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "Never used those drum plugins 😅 but I don’t really do a lot of classic rock sounds 😇",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062330551450742875",
    "author": "Ross Fortune",
    "date": "2023-01-10",
    "content": "Woah. This is what I was doing 10 years ago with Addictive Drums 1 and it worked great.\n\nI think having Splice somehow caused me to just forget that. \n\nOddly I keep a Kontakt kit in my template for cymbals (third chorus in a rock song type stuff - 1/8 note bashing that doesn’t sound machine gun, with a gentle sidechain from the kick to simulate overhead compression), but I forgot about the hats approach. Thank you for the reminder!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065655894509105204",
    "author": "ALXCPH",
    "date": "2023-01-19",
    "content": "One producer works with Multiplatnum artists, the others are more local artist. All of them with labels, no indie stuff.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066429016380285048",
    "author": "youngteam",
    "date": "2023-01-21",
    "content": "that was my first jazz record. good shit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066831600089825311",
    "author": "Ross Fortune",
    "date": "2023-01-22",
    "content": "Absolutely. It's a genre with a whole lot of dross. If you have any other recommends in that world I'd love to hear them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069028197414469758",
    "author": "ALXCPH",
    "date": "2023-01-28",
    "content": "A bit like a jazz progression, it’s usually easier to add extra chords when you know where you are going, rather than just plopping in random chords hoping to get somewhere. Like with so many things, it’s all about intention and having a goal in mind.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070260435334479892",
    "author": "VESHZA",
    "date": "2023-02-01",
    "content": "Every time I start a new project/song I feel like the DAW just stares into my soul and I’m like… ok how do I make music?\nIt’s as scary as it is like the first client project I had lol the feeling doesn’t fade away with each work 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071216217584582686",
    "author": "Jeremy Klein",
    "date": "2023-02-03",
    "content": "the exception of digitalis. I love the idea, but for such a simple concept, (digital lofi) why does it add FOUR THOUSAND milliseconds of latency",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071541542399004763",
    "author": "peterlabberton",
    "date": "2023-02-04",
    "content": "Question just now in the mastering talk has me wondering:\n\nHow are folks pricing all-in flat-rate production work? I had a request come in yesterday and am kind of at a loss—talked to my manager a bit ago about this but would love some other perspectives, especially as we’ve been focusing more on mixing until recently. I don’t want to make this too specific, but curious specifically for markets like LA, someone my level (has some credits but still finding a foothold in the big boy biz). Just don’t really have a handle on what the market is supporting right now both for indie and label stuff.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073678343674806363",
    "author": "The Lemon Chef",
    "date": "2023-02-10",
    "content": "Pop Audio Pop Filter is the best one out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073766001201647736",
    "author": "philbarnes",
    "date": "2023-02-10",
    "content": "Hakan P110 has been my favorite pop filter I've used. Looks like a scrub daddy, but leaves no trace on a vocal in my experience with it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075829377327190126",
    "author": "mcneazy",
    "date": "2023-02-16",
    "content": "For pop tracks that need to sound “perfect”, when y’all track live drums and bass, are y’all recording a bunch of takes and then comping until the drums and bass line up, or are y’all using beat detective. And if you are using beat detective, are you moving the bass to line up with the drums or moving the drums to line up with the bass. I just struggle to get the drums and bass tracks to lock in together like the pros",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077710356132151316",
    "author": "BatMeckley",
    "date": "2023-02-21",
    "content": "I find I’m always trying to get enunciation that’s gonna survive the monster amounts of processing sure to follow.\n\nOne of my fav stories is a writer producer I worked with did a song with a rock band where the lead singer just was not enunciating for whatever reason that day, and after the session he just sang in all the hard consonants himself and dropped them in over the original track. Song did well",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080536059080872049",
    "author": "spectrummasters",
    "date": "2023-03-01",
    "content": "Someone explained to me about using the delta of a limiter and then inverting it saturating it and feeding it back in to the mix parallel for extra loudness.....haven’t bothered yet ...lol, my rnb/hip hop stuff hitting loud enough.....maybe if i get stuck on another pop rock thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080722229412778004",
    "author": "Nick Hatzakos",
    "date": "2023-03-01",
    "content": "Hello, first post in here. Please advise if I'm posting this in the wrong channel. \n\nWhat are we using for writing MIDI Drums? I'm after something that would work well for Indie Pop/Rock kinda stuff - so something that works well for real sounds / something that I would be able to use as a stepping stone for real drum tracking. Even better if the sounds are flexible enough for me to avoid drum tracking all together. 🙂\nSuperior Drummer 3 seems to pop up a lot but just wanted to see what you guys are using? \nCheers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081154773430050907",
    "author": "Ross Fortune",
    "date": "2023-03-03",
    "content": "Jeremy, thanks for the insight. Do you have a link to some examples, ideally for indie/pop stuff? IME it tends to be more challenging to program realistic feeling drums in indie (song dependent etc etc) than straight down the line rock, but I’m definitely interested in a solution that works as you describe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081159249117331467",
    "author": "Ross Fortune",
    "date": "2023-03-03",
    "content": "1) what are the top 5 most important things for you in purchasing a drum sample pack ?\n\n\nI never purchase drum sample packs - not since having Splice. I do like a clear identity in a pack though - for instance, The Kount's sample pack has all those lo-fi/saturated kicks and snares, wonky grooves and crusty hi hats etc that sit very much in his genre, so if I'm reaching for that sound, I know exactly where to go. \n\nI don't know your drummer or his band, but I'd wonder what distinctive character you could capture in your pack? So that I know exactly where to go when I want \"that\" sound in a writing session instant. \n\n\n2) I’m always annoyed that all samples are 0.0db normalized and I always have to turned them way down to keep my gain staging coherent, would I be crazy to have them peak at -8 ? Would people automatically hate it ? \n\nI produce largely in Ableton now, and when you drop a sample in the drum rack, the instance of Simpler it creates defaults to -12dB. With the velocity:volume dial at default (45%), this causes a 0dB sample to play back at -6dB when velocity=100 (the default). My template has all mixer faders (including a basic drum rack + instance of Drum Buss) trimmed to -9dB (similar to my mix gain staging strategy I detailed previously), allowing me to mash stuff up if needed, and still have headroom to not have to max out vocals when it comes to cutting them. What I'm saying in a roundabout way is... I've already made allowances for 0dB samples, so I don't care - but you probably should, because if you're selling on Splice, they could sound dwarfed against the next pack.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081349155403870370",
    "author": "Jeremy Klein",
    "date": "2023-03-03",
    "content": "the place my library music goes to is pretty strict with posting it elsewhere so i just made a little demo this morning to show you SD3 in a more indie rock context. tried to get a few different playing styles in https://www.dropbox.com/s/sbfotwe6hh0xli8/Diamond%20Dallas%20Page%20Yoga%20-%20SD3%20Test.mp3?dl=0",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084808315533525033",
    "author": "Keegan",
    "date": "2023-03-13",
    "content": "In this particular example, I'm just not sure what to do differently to get mine to sound lofi like the original",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084808681687883777",
    "author": "Keegan",
    "date": "2023-03-13",
    "content": "This kind of wavy/sampled/lofi sound seems everywhere in hip hop and R&B right now (for example, the new SZA is full of this sound). Being able to get that sound seems like a really important skill to have at the moment!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084918835209060412",
    "author": "ALXCPH",
    "date": "2023-03-13",
    "content": "That is one serious lofi chain 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088950684499591229",
    "author": "ehutton21",
    "date": "2023-03-24",
    "content": "Anyone in here playing around with granulator X audio samples for hyper pop material?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089253516868063384",
    "author": "hyanrarvey",
    "date": "2023-03-25",
    "content": "You def need a vsti for like rock drums",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089254177231880192",
    "author": "jonmatteson",
    "date": "2023-03-25",
    "content": "I like addictive drums for this and i'll add an electronic snare that links to the acoustic snare for that extra high and low. Will also add a sample on top of that if it needs it. This shit is honestly way easier and more fun with real drums in a nice studio though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090392207405629520",
    "author": "austenballard",
    "date": "2023-03-28",
    "content": "Thanks! There's a part of me that really likes the extremely tight, very-tuned sound, it adds a dimension to pop vocals that you don't get with more natural harmonies/doubles. I've been experimenting with using both a lot lately",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092626659586359316",
    "author": "Josh",
    "date": "2023-04-03",
    "content": "It depends on the genre. Like for super over the top genres it’s great. But it just doesn’t have the attack that 808s normally have in hip hop, and it’s rather bothersome trying to dial in the release and sustain properly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092848720539815966",
    "author": "Josh",
    "date": "2023-04-04",
    "content": "Eh more so regarding some of the one shots. Their EDM stuff seems legit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095795260761833542",
    "author": "Edward Rivera",
    "date": "2023-04-12",
    "content": "Is it an indie project ? Label ? Paid ? Friends ? Client ? What does your role constitute ? Who has creative direction ? Conversations and transparency are SACROSANCT",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095795870974365706",
    "author": "Deleted User",
    "date": "2023-04-12",
    "content": "It’s an indie project I’m doing on spec. I’m basically doing everything as a producer except songwriting and recording. Creative direction wise- it’s pretty flexible but I’d rather not deviate too much from “singer with a guitar” world and both the artist and I are on the same page about that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095801366183682169",
    "author": "Edward Rivera",
    "date": "2023-04-12",
    "content": "This isn't a budget pop record with multiple people signing off on it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095824734601621544",
    "author": "Edward Rivera",
    "date": "2023-04-12",
    "content": "I've been on the other side of this coin as well. Had a few years working with the rock mafia doing songs for the Cyrus family and other Disney kids and of course we flew things around, replayed or re-sang parts, but the situation called for it and the artist wasn't the person who signed off on anything and therefore didn't need to know what the heck we were doing. It payed well in money but cost a lot of dignity. But I understand that wanting to align my life in such a way is a choice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101280910588006460",
    "author": "Slow Hand",
    "date": "2023-04-27",
    "content": "Do you have any pre-existing experience with synths? Generally speaking, what kind of music do you like to make? What’s your budget?\n\nWhen you say drums, do you want live-sounding drums, or do you want electronic drums?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101281609606516786",
    "author": "Sean Rogan",
    "date": "2023-04-27",
    "content": "yes! familiar with synth hardware and how they work, just haven’t done an awful lot in the box. musically it’s mainly singer songwriter indie/pop world. looking in the more affordable end <£500.\n\nmore electronic drums, as still have the option of recording kit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102718257896620243",
    "author": "Iwan Morgan",
    "date": "2023-05-01",
    "content": "I love the plate in Eventide SP2016 for this, set the length and predelay how you want it, lately been following it up with the SSL Native strip and playing with the width control to really make it pop out of the speakers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102719610823909516",
    "author": "Edward Rivera",
    "date": "2023-05-01",
    "content": "It does the gate pop thing too. I rarely do that anymore but it's there. Same goes for the cranked threshold compressor trick. Does it so well",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103329967678427186",
    "author": "Eric Martin",
    "date": "2023-05-03",
    "content": "that’s an easy miss when you’re halfway across the country",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103376388574163116",
    "author": "hyanrarvey",
    "date": "2023-05-03",
    "content": "No one wants to hear a funk band to the grid and played by midi instruments",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103397569968734309",
    "author": "Deleted User",
    "date": "2023-05-03",
    "content": "Still, you can do a whole lot with just 4. But if we’re arranging a pop song, then probably may not be the first move",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105118624949219338",
    "author": "Edward Rivera",
    "date": "2023-05-08",
    "content": "Same for me, after I saw Justice for the first time I started making dance music which got me a production deal. But I wasn't passionate about it enough to call myself an EDM guy. I can't sound design for shit or play keys, let alone work a club, way more talented people out there for that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108602095101284434",
    "author": "NoahNeedleman",
    "date": "2023-05-17",
    "content": "Had to rock a quick turnaround for a sync pitch today. Used Studio Drummer in Kontakt- chose some stock drum grooves, dragged the midi onto the channel and adjusted velocities of the kik & snare. I couldn’t figure out how to mult it out without googling so I just mixed it in the plug-in. It’s legit not cool sounding at all, but honestly it was useful and it got me to a pitchable place. \nAnybody else using workflows in and around kontakt that allow you to mult & trigger more interesting samples?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114442257794351106",
    "author": "louisvie",
    "date": "2023-06-02",
    "content": "is the 808 era coming to an end anytime soon ? i feel like i'm starting to get tired of trap sounds, even the weird ones, even when used by experimental / alt artists and producers in good songs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114514120708993124",
    "author": "Edward Rivera",
    "date": "2023-06-03",
    "content": "The 808s and hi hats are here to stay. But the general vibe of trap today (triplet vocals) has rung itself out and I think someone will take those textures to make new styles and then that's what we'll be vibing on for a while. Even rubber band man (deep cut !) doesn't bear resemblance to the mumble rap that came after it, and mumbling came out of fashion before the pandemic. Hip hops not dying, it'll be around forever I hope, but it's gonna change",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114514888505688114",
    "author": "cy (sigh)",
    "date": "2023-06-03",
    "content": "agreed there. took the origibal comment as the 808 sound as a whole. but as far as the style changing, that's exactly what's going to keep happening. \n\nalso I've been tied of the triplet thing a year after  its statted. i was actually upset it was that people were associating w trap 😂 trap is originally defined by the content not the sound lol (trap house music)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114515575473967124",
    "author": "cy (sigh)",
    "date": "2023-06-03",
    "content": "True. as humans we want things to seem as simple as possible.  \n\nunderstand it  now back then but I was going crazy the first time edm folks were saying they were making trap 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114678601015623720",
    "author": "cy (sigh)",
    "date": "2023-06-03",
    "content": "I agree with all of this. \n\n\nI do think the time between proper style/genre adoption is getting smaller.\n\nthe tonal thing will take time but like you said it's getting more and more popular and I think the tools that give access to that are getting simple enough to cut down a lot on that time. \n\npersonally, would also love to hear what's that sounds /will sound like",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114682913468989521",
    "author": "Slow Hand",
    "date": "2023-06-03",
    "content": "I think the band Secret Chiefs 3 is a good glimpse at what a truly pan-musical approach could be like. Though they are far from pop music. \n\nThey're drawing on a wide variety of musical systems: Western diatonicism, Messiaen-ic (lol) scales, Azerbaijani mugham, Afghani traditionals, Italian avant-garde film score, surf rock, and so on.\n\nThey integrate a lot of different tuning systems and rhythmic approaches into their compositions. Trey Spruance has said on a few occasions that their seemingly arabic-sounding music would sound just as foreign to an arab musician as it would to an American listener. They embody a real ethos to fuse as much of these musics together.\n\nhttps://open.spotify.com/track/2qHkwrDOfg291jbrQbb91z?si=dd5397e501784b3a",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116808835382923295",
    "author": "spectrummasters",
    "date": "2023-06-09",
    "content": "i feel like hip-hop might get a little bit more bob power and less tillie over the next year or two. Jason goldberg probs v safe in his position too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117242087683924085",
    "author": "Deleted User",
    "date": "2023-06-10",
    "content": "Doesn’t help that every yungins are chasing drill sound now without understanding what it really is. Speaking of gun crime I honestly think media portrayal has a lot to be blamed for in the increase of gun violence between young men. Media portrayal glorifies the kind of lifestyle that people with no choice used to have to survive in. Now a lot of young kids with choice not to join gangs wanna join because that’s where they find the sense of community. People wanna become what they see and what they know. \n\nI’m completely with you on the lil kim style wave- it was cool when she did it, she did it her own way. But whatever’s happening now in the name of women empowerment is doing the exact opposite of what it is meant to do. It’s not my place to really say, but I think it really conformed the path of success for women rappers into a tiny box. Modern R&B and Hip Hop being closely linked together, same with Female R&B artist’s stereotypical toxic relationship songs are also its own box that I can’t seem to avoid wherever I go. R&B at least seem to have more diversity in the type of stories that become heard, hip hop is a lot less like that. \n\nThere are tons of talented women rappers not in that box, but they don’t make it as big nor do people care as much. Kind of frustrating how uniform it has become… But I don’t agree that it’s dead. It’s dead to me, or to you- but it’s still pretty much what people wanna hear all day long.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117243146770858065",
    "author": "Deleted User",
    "date": "2023-06-10",
    "content": "I was the most excited for new sound during XXXTentacion’s popularity. Right now, there’s not a whole lot of the experimental spirit that aligns with emotional merit in the mainstream hip hop that was around during that time at least from what I hear. \n\nThere’s still a lot of experimentation but not a lot of them actually hit on an emotional level the same way as back then around 2016-2019 whether it’s just having fun or some deep shit. But who knows… maybe it’s cause I turned 20+ and it still hits the same way for young adults and teens. But my feelings are a lot of new records were experiment for experiment’s sake, which is still cool. But rather than “I got these stories, how can I fuck with it?”, it feels more like “I wanna fuck things up. How can fuck with it more?”. \n\nI don’t know 🤷‍♂️ Maybe I’m one track minded, but mainstream hiphop hasn’t really been all that exciting to me since the covid times.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117330394480660480",
    "author": "spectrummasters",
    "date": "2023-06-10",
    "content": "re: hip-hop losing excitement since the covid times......id call it about that time as well. And for me,  this period coincides with the ysl rico  .....and young thug coming out of the music game has defo been felt as a big gap on the playlists in my circles. for the good and the bad of it...he is/waas unpredictable and refreshing artistically imo and the implosion of the YSL camp has been felt more broadly in the music .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1120071849343197194",
    "author": "peterlabberton",
    "date": "2023-06-18",
    "content": "Growing up, my parents basically listened to no music and I had to discover everything for myself when I started getting into it. (Was also the older sibling of two, so no help there!) And then I got in a snobby rabbit hole in high school of being “better than” all the rock and pop kids. So my 20s (and still now) have been all about rediscovering stuff most of my peers grew up with. Like rocking out to Weezer for the first time as a 29 year old. Have had many moments of having to ask, “who’s this?” … “oh, The Rolling Stones… got it cool 🤦🏻‍♂️”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1120101659557777448",
    "author": "peterlabberton",
    "date": "2023-06-18",
    "content": "Totally. Scott (the drummer I mentioned) has a very distinct style and even a pretty specific way of tuning and getting his sounds dialed. It is NOT right for many things, but dude has a great career playing jazz in the Bay Area and playing with Nels Cline and just being a badass. Like, find yourself and dig in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122931333803561004",
    "author": "louisvie",
    "date": "2023-06-26",
    "content": "I'm about to do  foley / sound design / scoring for an artist's experimental short film. They didn't get sounds during shooting on purpose, to create this very particuliar sonic landscape they have a vision for. \n\ni kinda know how to make beats and kinda know how to record and mix my rock band (in Ableton, in which I'll do the scoring too)\n\nfoley feels like it's gonna be long & tedious but relatively simple ? compared to potential \"let's put a jazzy song ambience background there\" and i have to actually write a jazz piece\n\nSo, any former experiences, anecdotes, advices on scoring and/or scoring in Ableton are welcome.\n\n#1 thing to do is ask for how long the film is.\n#2 is asking my real musician friends for some help (seems like they'd be down for it)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123444044903764090",
    "author": "Deleted User",
    "date": "2023-06-27",
    "content": "What are your favorite ways of creating density in an arrangement with minimum instruments without parts being busy? Particularly harmonic elements. \n\nI’ve noticed certain songs have really dense feel in the harmonic instruments without too much movements but still have really crowding density. Unfortunately can’t think of any other examples at the moment… but some trap songs and dance music (brazilian moombaton, dancehall, reggaeton, soca) often have elements that crowd the upper mid range or midrange while letting the low end breathe.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126309007833956442",
    "author": "OJ",
    "date": "2023-07-05",
    "content": "Does anyone have advice on creating sample packs? Like do I go record a real snare and then put distortion on etc to get like a Lex Luger Snare for example, how is something that clean made, not like a real sounding snare but these trap snares for examples, or just unique sounds??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126883732750606406",
    "author": "Deleted User",
    "date": "2023-07-07",
    "content": "Looking for some new sounds\n\nAny alternatives to Trillian for Synth Bass/808s? Looking for Bass stuff sampled from Analog synths and machines. \n\nAlso looking for Nexus-esque pre made keyboard/synth plugin but for hip hop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135001503120248852",
    "author": "Slow Hand",
    "date": "2023-07-29",
    "content": "I love James Brown deeply. His innovation to strip the harmony way down is a baller move that I think we mostly take for granted today. Probably because 70% of bass product demos are whack single-chord funk grooves. 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135052184887758890",
    "author": "LAPhill",
    "date": "2023-07-29",
    "content": "I never really cared about lyrics until I started listening to country.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138409967381131305",
    "author": "Rob Domos",
    "date": "2023-08-08",
    "content": "In the EDM world, the rule of thumb seems to be dither if you’re bouncing to 16 and don’t if you’re bouncing to 24. I’ve tried this rule of thumb out on a few occasions and can say I’m in agreement with it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140004142811721840",
    "author": "Rob Domos",
    "date": "2023-08-12",
    "content": "All postulating and math talk aside, for me it just comes down to the fact that I prefer the sound of not randomizing the bottom bit in a 24 bit file. At 16 bits that noise is preferable to the audible quantization error but at 24 it’s not for me. After 3 EDM dudes with solid careers (including luca pretolesi) said this exact same thing to me about dithering, I tried it and agreed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141816082047443007",
    "author": "Josh",
    "date": "2023-08-17",
    "content": "Is it country or any other genre?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141876658261991535",
    "author": "bobby k",
    "date": "2023-08-17",
    "content": "Not country, but why the distinction?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142051349807255724",
    "author": "Ross Fortune",
    "date": "2023-08-18",
    "content": "Was around a situation where a big name electronic producer made a great production of a song, but the fee they demanded was too high, so the solution was for another producer to remake it note for note, and that version was released - no fee, no credit for big name producer.\n\nThat felt slimy to me. Not sure what the outcome was, but I never heard about any backlash.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142099994501980320",
    "author": "NoahNeedleman",
    "date": "2023-08-18",
    "content": "True. In pop, you can't be fresh enough, but in country music, you can't be in-the-middle enough. It takes a real tsunami to move the industry here. People like Dann Huff do an excellent job pulling the meat from demos and then making fast food. Say what you will about a big mac, but I know what one tastes like in Paris France \nor in Paris Texas.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1146536505418993805",
    "author": "Josh",
    "date": "2023-08-30",
    "content": "I love the ownhammer heavy hitters pack with the Marshall T75. I can just send it to you since most of the pack is just weird metal amp cabinets that don’t sound very good. I need to get the GGD cab plugin. That thing RIPS.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150069744217632848",
    "author": "Edward Rivera",
    "date": "2023-09-09",
    "content": "In rock ? Pop ? Or all of it ? Everything's tight right now. Even stuff that's disguising as rustic is super tight",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150069829718528110",
    "author": "hyanrarvey",
    "date": "2023-09-09",
    "content": "Def seeing it in rock pop and hip hop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150194740189483049",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-09-09",
    "content": "There‘s a difference btw a 2:30 min club banger and a 10 min half folk / half trap beat with lana vocals over it though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150195231250194452",
    "author": "hyanrarvey",
    "date": "2023-09-09",
    "content": "Both are pop to me but I get what you mean",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150221018036699227",
    "author": "BatMeckley",
    "date": "2023-09-09",
    "content": "No, hence why I’m not saying who. But you’d be surprised. The trick with AI is developing the modelfor the voice, the guide. But once you have that it’s tremendously easy to make the artist sing whatever you want. And… cheaper. Hence to therefore, it’s not going anywhere. I know pop stars to MASSIVE legacy acts that you’d never guess that are weirdly at the forefront of it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150908782466048081",
    "author": "stevestmartin",
    "date": "2023-09-11",
    "content": "right it doesn't fix bad singing, it will just be off pitch, and out of time with the timbre of another singer. The performance will make a difference. If you have a death metal performance, your not going to run it through a (insert favorite pop singer name) model and have it sound anything like that artist. Its just going to have the timbre of their voice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154488396736106587",
    "author": "Josh",
    "date": "2023-09-21",
    "content": "Yeah it sounds pretty on brand as far as classic rock band works with young producer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156795179739652227",
    "author": "Zack Hames",
    "date": "2023-09-27",
    "content": "Hey ya'll. I am working on a Taylor Swift Reputation Era influenced track for this young artist, and i was wondering you all had any tips on how to achieve some of these vocal sounds. How do I go about this sort of pseudo group vocal sound. Big, clearly layered. Is it a matter of standing in different places in the room and recording several layers, simply singing different, harmonies, different mics... etc\n\nhttps://www.youtube.com/watch?v=kRJKB291Z1g\n01:00 vocals at the chorus\n\nhttps://www.youtube.com/watch?v=xYLxUJ9v6KU\n00:46 Vocals at chorus\n\n\nThis is out of my typical realm so any advice with ANY big pop vocal production would be really cool.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161013243263848539",
    "author": "xico1702",
    "date": "2023-10-09",
    "content": "Hi folks! Hope you're doing great! I want to ask you something. My name is Francisco, from Portugal, I'm 23 years old and I'm a self learner about music theory and music production. I know how to play piano and strumming acoustic guitar a bit. I started to using a DAW in my 14s (FL Studio, yeah I know xD) and in the last 3 years I've been using Logic Pro and last months Pro Tools (just for editing and mixing).\n\nI love to produce electronic pop with a mix between synths and acoustic instruments. I want to be more versatile and confortable producing other genres (genres that I can produce just in my bedroom studio without having a great recording gear). \n\nI'm feeling stuck, I'm trying to listen different genres. I'm feeling very limited because I don't have a great background as a music player or student (my bsc is physics engineering). The music industry is tough and I want to be more confortable to work in other genres.\n\nI tried to be as brief as possible. What advice do you have for this situation? If I forgot to say something, I am free to respond. Thank you for your attention! Sorry about my english. 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161015002094915665",
    "author": "xico1702",
    "date": "2023-10-09",
    "content": "Well, it's both I guess. Sometimes I'm trying to network with people and when I see some artist that I think it's great to work but the genre is not what I usually do/can't do I tend to not talking to them. I don't want to accept or getting hired to produce a song that I can't produce like the artist wants.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1165807276083396749",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-10-22",
    "content": "Anyone can recommend any livestreams on vocal production?  Especially pop vocals \nFeel like I need to up my game and wanna see the pros at work",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1166529419612004352",
    "author": "CameronKuwada",
    "date": "2023-10-24",
    "content": "If that's not the case, then I would go for a really lofi/filtered treatment on the artificial harmonies, and not keep them too high in the mix.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169702970309492856",
    "author": "cian riordan",
    "date": "2023-11-02",
    "content": "I think you've got a real point when you say we've evolved a bit in the 30 years or so since the making of this record. But for one, Bob Rock got an incredible solo out of Kirk and that song and record went on to become an enormous success. I also feel that this particular genre of music was born out of toxic masculinity... and might have been the only positive outcome of it. Coming into the present, I don't think we should treat artists in the studio this way anymore, but then again, we're not really making cock-rock records like this either... the genre has sort of fizzled out naturally.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169709624899936296",
    "author": "Edward Rivera",
    "date": "2023-11-02",
    "content": "That onus was sort of put _on_ them, as opposed to Metallica who really wanted that title. Idk if it's apples and apples there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169722174525935647",
    "author": "Edward Rivera",
    "date": "2023-11-02",
    "content": "Bob rock is still alive, Metallica could make records with him if they wanted. But Greg has been treating them square since day 1 and that's why he still has the gig",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169723559933919305",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-02",
    "content": "I guess this goes back to my original point regarding the bob rock video - there *has to be* a way of getting the best performance out of an artist with having them feeling like crap first being one of the options",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169724525299122347",
    "author": "Maxim",
    "date": "2023-11-02",
    "content": "Maybe starting with what's in the way might be useful. If you can feel the person is anxious or afraid behind the mic that's different than someone who had a bad day and feels uninspired. But there might also be the case where you have to push someone. The dudes in the Bob Rock video I think don't mind the latter.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169729511986827264",
    "author": "cian riordan",
    "date": "2023-11-02",
    "content": "*massively successful, hit* butt rock records",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169730758039044096",
    "author": "Edward Rivera",
    "date": "2023-11-02",
    "content": "Hey I like my buttrock. There's a video somewhere of me subbing on guitar for Metal Skool (Steel Panther) and I fucking butt rocked it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169730937509117952",
    "author": "cian riordan",
    "date": "2023-11-02",
    "content": "But I don’t like the revisionist “what if someone else produced it” type stuff. Metallica used to have hit songs on the radio. Bob Rock was a big part of that transition for them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169797759616958515",
    "author": "BatMeckley",
    "date": "2023-11-02",
    "content": "But you can’t control their behavior, just yours. I feel like we’re moving the goal posts here a bit… i know some pretty verifiably shitty human beings that are massively successful songwriters, and people look the other way because they consistently deliver. \n\nMy Dad used to have this concept he called “would you throw your dog off a roof”… people would always ask him in the lean years “why do you play these shitty state fairs all the time” and he would respond with that analogy… “would I throw my dog off the roof for $100? NO. Not for anything. He’s family. I love him.” Would you throw your dog off the roof for $100 million dollars? “Well he pisses on the carpet and he’s always barking at the mailman and…”\n\nThat example of where Metallica doesn’t work with Bob Rock anymore neglects to take into account that they’re in the very rare air where it doesn’t really matter how well the records do anymore, and having said that the foundation that BR helped build ensured a fan base that will make sure any new record won’t totally tank regardless. So it doesn’t really apply to your situation.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171154950714294382",
    "author": "chris_donlin",
    "date": "2023-11-06",
    "content": "Anyone have tips on using vocoders? Getting them to pop out, wrap around a vocal nicely, not sound too brittle, etc. My first thoughts are taking unnecessary high end out of synths and hi hats but im not sure where to start",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171567152613048412",
    "author": "thejadenmejia",
    "date": "2023-11-07",
    "content": "I’m so used to straight forward clean pop vocals that I never took the time to learn these things.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179927856197943316",
    "author": "Josh",
    "date": "2023-11-30",
    "content": "There’s something beautiful about interacting with instruments when a lyric or melody pop into your head that o think I was missing for months. And it wasn’t until I stopped writing so much I really found that again.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179933224202403882",
    "author": "Josh",
    "date": "2023-11-30",
    "content": "Same here. I spent so much time trying to make perfect little pop songs that finding the honest, dirtier, rough around the edges ideas that I wanna say gets me excited about music in a new way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180553590213976156",
    "author": "youngteam",
    "date": "2023-12-02",
    "content": "felt like I had been following this thread of left-field pop music with weird sounds in it and to learn it has a name and his name is BJ was quite significant.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181874879927164999",
    "author": "Slow Hand",
    "date": "2023-12-06",
    "content": "This Loop Op review might be helpful if you're trying to decide between a *Maschine* or a contemporary MPC. He does the best electronic instrument reviews on the internet. All killer, no filler. Quick and to the point: https://www.youtube.com/watch?v=gPxQpcJxbJg",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183771624076476436",
    "author": "Josh",
    "date": "2023-12-11",
    "content": "The old sturgis way is to make sure the pick attack is before, depending on genre though I’ll often have the pick attack on the beat. Remember when we were doing drums and we just sort of listened to how we it should placed when the drummer flammed the kick and snare? This is the same thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185389800774180935",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-12-15",
    "content": "https://www.youtube.com/watch?v=be12BC5pQLE are u guys hearing doubles on the vocals in the first chorus? because I...don't? or are they just so perfectly timed/performed that you don't notice it? I'm asking because I feel in modern pop production doubles are kind of a must but in certain cases they seem to go against that? \nI'm currently looking for other ways to do modern BVs except \"double everything, harmonize everything\" to keep my vocal production from sounding stale/cliched so any kind of insight would be greatly appreciated!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186398671332450527",
    "author": "lystell",
    "date": "2023-12-18",
    "content": "Cool, thanks! Would you do that in a rock situation as well? It has been my go-to but was thinking it might be an idea to do a more room thing.   It turned out that an iPhone behind left shoulder was pretty cool as well",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186817328260845659",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-12-19",
    "content": "Well they managed to have a hit even without a lot of rxing \nNot to say you shouldn‘t do it but I think with a lot of modern pop music that imperfect, „I made this in my bedroom“ / DIY aesthetic is part of the charm",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187931773745774695",
    "author": "hendrick",
    "date": "2023-12-22",
    "content": "general question about pop vocal comping/editing - when you finish making your selection do yall make it a habit to make micro changes in the rhythm?\n\ni like to keep vocals sounding \"human\" but sometimes i wonder if i'm confusing that for laziness haha. im obviously not talking about super obvious off-pocket takes, but more about \"perfection\" of a cadence and the million ways a phrase can enter in a pocket.\n\nany tips for knowing when to intervene and when to avoid a rabbit hole?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189083720469196811",
    "author": "Rob Domos",
    "date": "2023-12-25",
    "content": "To be embarrassingly transparent, a lot of times I think a note is late by listening and then after looking find out it was early. Things just feel in time or out. Also, a lot of things that have loose rhythm in a way that people tend to love often bother me and sound out of time to me. Jay-Z is a perfect example of this. I spent years thinking his rhythm was terrible before I realized he was doing a shuffle time feel where the amount his vocal is off from the snare creates the shuffle. I just didn’t pick up on that for like… 15 years? And just wondered why nobody else was bothered him being “out of time”. Kind of like when people with an undeveloped sense of harmony think of jazz as simply being an excuse for allowing wrong notes. That’s how I hear people that are famous for stretching rhythm",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189641418055106621",
    "author": "cy (sigh)",
    "date": "2023-12-27",
    "content": "see I think my heritage saved my ass on this aspect. catching rhythm is one thing I pride myself in -I'm nowhere near other ppl I  know. but  in high-school when a teacher couldn't manage a class everyone would breakdown into rara /rasin (haitian roots/carnival  music) and start freeatyking insults/jokes about them. everyone would pick a subdivision of the rhythm and play and almost no one was ever out of time. for the most part I can catch complex  rhythms and play to them even if I can't actually count them properly. \n\nstudying non standard tracks might be a good idea @Rob Domos \n\nhttps://youtube.com/playlist?list=RDEM98p-nAErqVvow4rwmEtPKg&playnext=1&si=ifw8q5y2iYHfaRjg\n\nTiRoro is a rhythm legend back in Haiti and multiple American jazz drummers came to Haiti to study under him and learn rara, rasin and vodou rhythms",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190232508751675392",
    "author": "Deleted User",
    "date": "2023-12-29",
    "content": "@RÜSSO Here a serum patch. It's close enough - but if you want it to be exactly the same then you'll likely have to find out what synth they used. You could try tweaking the waveform to a slightly different Saw wave, but this is probably as close you'll get with the Serum LPFs and enveloping. You'll need to mess around with pitch bend and attack time to get the performative aspect of this lead line, and especially when you do the pitch bend - you might need some help from the compressor to get the sustain out of that slow pitch bend,\n\nWhenever you hear buzziness it's usually LFO on OSC level on a faster rate. This same lead sound is all over different styles of EDM so it's a good patch to know. Kaskade - Atmosphere has the same lead but in square wave with other layers as well.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1196673563541909616",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "But I do want to clarify about my one take musician thing… \n\nI may have used the term too loosely. To me, most jazz musicians are one take players. They record everything together and calls it. (of course they do a few takes but I’m not trying to be a “first take and that’s it” player)\n\nBeing able to play through the whole song (unless arrangement calls for section by section) and just needing to punch in a few spots is what I want. I do not have any desires to go beyond that. \n\nBUT\n\nI don’t ever want to edit my timing other than micro adjustments that can be done by moving small part of audio clip or hitting quantize. \n\nThat + being more consistent with touch so I don’t have to punch in as much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202402551899627640",
    "author": "LAPhill",
    "date": "2024-01-31",
    "content": "For my metal brethren ( @hyanrarvey @David Fuller @Edward Rivera ) - I have a project coming up that's going to be very metal-centric. I haven't been keeping up with the genre for awhile, and everything I hear sounds the same as what I was listening to 10 or 20 years ago. Are there any artists out there doing interesting work? What, if any, are the latest trends?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202402661853306880",
    "author": "hyanrarvey",
    "date": "2024-01-31",
    "content": "Like more pop centric metal?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202403256333111306",
    "author": "LAPhill",
    "date": "2024-01-31",
    "content": "It'll be instrumental, but anything goes really. To pull from older bands, Children of Bodom, Nightwish, earlier Metallica, Blind Guardian, Opeth.. all of that applies",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202403319662780576",
    "author": "LAPhill",
    "date": "2024-01-31",
    "content": "Basically anything that's not full-on death metal or too rock-based",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202629303771078707",
    "author": "David Fuller",
    "date": "2024-02-01",
    "content": "I was going to say Vitriol but you said no death metal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202783355301666867",
    "author": "Josh",
    "date": "2024-02-01",
    "content": "But I need to figured out what that super old sounding delay is that all the smino type hip hop artists use. I have the galaxy echo from UAD and it's close but not quite and I can't find a setting in echoboy that gets me the same thing. I'll link an example",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210237494218723400",
    "author": "SoundsLikeJoe",
    "date": "2024-02-22",
    "content": "Good tone in general though.  Could be very nice for modern metal or other crunchy bass needs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210268352296259634",
    "author": "popaganda.",
    "date": "2024-02-22",
    "content": "Unless you’re going for a RHCP rock slap kinda thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220506768204107776",
    "author": "Ross Fortune",
    "date": "2024-03-21",
    "content": "Metal gang (summoning @hyanrarvey), is Gojira still the one for high gain metal stuff? Or Tonality: Lasse Lammert?\n\nReaching for Mick Gordon Doom vibes (holy fucking fuck), on a telecaster tuned as low as I can get away with.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221906051641638982",
    "author": "JustinLeu",
    "date": "2024-03-25",
    "content": "What’s everyone favorite way to pitch instruments down to change the key of a song? I have an artist that had a large country production recorded and now wants it to come down a half step… 🙏🏻",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222335932418752634",
    "author": "louisvie",
    "date": "2024-03-26",
    "content": "Thank you ! Did this today with him actually, 30 min after you sent this message I'm just seeing now, coincidentally.\n\n His brother went in to do metal vocals and him not being a singer, i put a ton of saturation using UAD FATSO live in Console which made his voice sound  larger than life, and then kept that on for the rest of the session\n\nThat allowed Leo the main singer to let his deep-ass voice resonate a lot in the lows. We got Verse 1 and the next part that way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1229545149923856384",
    "author": "ehutton21",
    "date": "2024-04-15",
    "content": "But I don’t find it irreplaceable. It is a nice sort of spark if it fits the genre I’m working in, though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1235108617880076389",
    "author": "Lewis Turner",
    "date": "2024-04-30",
    "content": "does anyone have any stems for a pop or edm track i could practice mixing with?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237797084648706121",
    "author": "Ross Fortune",
    "date": "2024-05-08",
    "content": "Um, while we’re doing pester @LAPhill about libraries… What are real composers using for action style repeated fast staccato string figures? \n\nI’ve got reasonable results layering Kontakt Session Strings 2 with BBCSO, but it’s pretty laborious - key switching in BBC per note between staccato and spiccato to make it more exciting and less machine gun.\n\nI see Action Strings pop up. Is that old hat?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241759287596941322",
    "author": "Iwan Morgan",
    "date": "2024-05-19",
    "content": "On a theoretical level it does bother me, and i feel it limits ideas. But then I remember how most electronic music comes from the purposeful misuse of equipment and crucially that Rihanna’s Umbrella is based on a Garageband loop so 🤷‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241767813677584516",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Very true. checking the credits and not seeing the person who made the majority of the beat just feels gross to me. Especially because we can draw parallels to most hip hop songs but all of those kids who make loops all day every day are on the credits.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241767960822153317",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Well. The hip hop songs that aren’t cymatics loop into gross beat lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241774263736864791",
    "author": "Maxim",
    "date": "2024-05-19",
    "content": "I bet a new generation of people are going to be making music with the help of AI that will be just as cool (if not more so) than the stuff that's coming out now. Heck a lot of listeners already think pop music is often AI-generated. Despite someone working on something from scratch.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247594610461638687",
    "author": "SoundsLikeJoe",
    "date": "2024-06-04",
    "content": "That last part...  yuck. 🤮  😜\nCome on man. You wont chart in Modern Country without it, but locking music down like that by default can be real stale. Long line of historical music and modern artists capturing gold off click.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254867293356294275",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-06-24",
    "content": "it does kinda sound like a greatly exaggerated version of the pro tools Lo-Fi trick people use on vocals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255926008545280150",
    "author": "Adam Thein",
    "date": "2024-06-27",
    "content": "in the against category a fresh reel with box and metal reel of 456 or SM911 from Nashville Recording Supply is $96 a pop now",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256109716552155227",
    "author": "BoozleBAM",
    "date": "2024-06-27",
    "content": "Their free amp sim \"Crunk\" is honestly stellar, imo. Just did a quick mix for a metal band and used it. Just the ticket. Beautiful.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256158471187857458",
    "author": "rawssx",
    "date": "2024-06-28",
    "content": "I was wrong about the tony berg thing, soo wrong. I dived into phoebe’s stuff just last week, funny that it took me 4 year to check out an Amazing album even thou i have been following her on instagram since 2020. What blew me up was, most of the modern productions in the pop side of industry, the sad songs, all of them are inspirationally ripping phoebe’s sound. I was mad at tony berg when i saw his interview where he gatekept a vst they used throughout the album to get that muffled texture. But in the past two days, i also realised he said “We are not going to tell you the vst just so you at home can not replicate the sound”. I thought that was asshollery until i realised that they are actually being ripped so hard in the industry and that they really gotta protect their sound. Tony, Phoebe, Ethan these guys are hidden unknown diamonds “i think (like me) a lot of people know phoebe as a celebrity than a music artist, or that was just me being lazy to check out her songs” but i feel like everyone needs to experience their music.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256159897012142101",
    "author": "rawssx",
    "date": "2024-06-28",
    "content": "Good for you, i am saying that as a listener, not as an analyst. And so does anyone who listens to sad pop music, the guy who found out about the vst on youtube he also mentioned “Everyone is trying to copy phoebe” that is true. Not only did they gatekeep the sauce lol, even the mic they recorded vocals on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258581071491239988",
    "author": "Josh",
    "date": "2024-07-04",
    "content": "Outside of metal I’ve been really enjoying late guitars.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1262417688269951006",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-07-15",
    "content": "Haha maybe I went a bit far there for effect 😅 I'm not deep into electronic production but it's a take I've heard a lot - Nexus being very usable rompler sounds modeled after the stuff already out there being heavily used. Not hating on it, I have it and use it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265064657467609210",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-07-22",
    "content": "not sure if this is the right place or #📚book-talk, however: For my master thesis, I'm looking at why and how pop music production of the early 2020s has adapted so many elements of 1980s pop music, including instruments (most notably analog synths and their software emulations, drum machines), sounds and samples. As part of my thesis I'm looking to analyse songs of both eras to showcase if and how they are similar. \nAnyone got recommendations for literature that might help with the analysis of songs in that regard. Unfortunately, I can't just wing and say \"that MJ synth kinda sounds similar to the The Weeknd used on Blinding Lights\".🫠 \n\nAny recommendations highly appreciated!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265086994015326314",
    "author": "Keegan",
    "date": "2024-07-22",
    "content": "Anybody know of good sample pack makers doing live drum loops? I used to use The Loop Loft stuff but I guess they aren't making new stuff anymore. I know Circles is good, but I'm hoping to find stuff that's less rock oriented than that. Ideally groovy Anderson Pak style stuff but open to checking out whatever!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265294207938068580",
    "author": "esquinalee",
    "date": "2024-07-23",
    "content": "AJ Hall is your guy. Incredible drummer with an encyclopedic knowledge and love for drum sounds and styles from all eras with a hip hop tilt. Check him out, “Left Field Drum Breaks” @ajhall89 on IG \n\nHe also does custom batches",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265604557707280414",
    "author": "Dereck Blackburn",
    "date": "2024-07-24",
    "content": "I am not a scholar but I think 1.) the increase in availability of electronics education and 2.) the fall of eBay and rise of sites like reverb and other gear classifieds have done quite a bit to jumpstart cottage industries in bringing many of these instruments back to life. The same as the 1950s in the 1980s, nostalgia is a hell of a drug.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1274015352904486912",
    "author": "Eric Martin",
    "date": "2024-08-16",
    "content": "non-linear is more similar to playing jazz from memory vs playing classical from the score",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280937674336764046",
    "author": "Adam Thein",
    "date": "2024-09-04",
    "content": "Aka Roundball Rock aka NBA on NBC on a loop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1282754339647127635",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-09",
    "content": "Any of yall ever made genre specific templates for hire? Are there resources etc for this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1282758558408249426",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-09",
    "content": "Like, starting grounds for different types of songs including the bread and butter sound choices etc. Seems like a missed opportunity that there’s not more out there.\n\nThis guy does some rock stuff, some of it sounds all right but I think there’s a business opportunity here for more popular music. I would definitely use it for mockup/startup purposes https://mix-ready.com",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291507227303350352",
    "author": "BatMeckley",
    "date": "2024-10-03",
    "content": "The amount I’ve seen the c4 pop vocal preset sent to me…..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304883546380304394",
    "author": "hendrick",
    "date": "2024-11-09",
    "content": "question about pop vocal production. given that we have a great source material (amazing recording, lyrics, etc), what do you think a pop vocal production needs to have?\n\na lot of new pop tunes have insane vocal production and i wanna start adding more tricks to my toolbox beyond delay throws and a nice verb Lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308926167319052360",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-11-20",
    "content": "if you want a pop vocal workflow, Louis Bell shows his in his studio.com course",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312980990846566511",
    "author": "Will Pragnell",
    "date": "2024-12-01",
    "content": "when you say “sound like one kit”, do you literally mean sound like a drum kit, or do you just mean sound like they fit together in some harder to describe way (e.g. like many of the best electronic beats)?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313895468383604789",
    "author": "Tyler Graham",
    "date": "2024-12-04",
    "content": "Hey great! Glad you found it. Funny enough, I really learned the inside out of the daw by watching tons of livestreams of trap producers working during quarantine. It’s a daw i know just as well as Pro Tools and it works.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1325055770559119370",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-01-04",
    "content": "https://www.youtube.com/watch?v=mUepiakzALc wake up guys new audio engineers reactio metallica video just dropped",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1332397126080008202",
    "author": "Brian Reynolds",
    "date": "2025-01-24",
    "content": "Aksel Coe Country Drums & Ilan Rubin Drum Samples And Loops",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339522488564060233",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-02-13",
    "content": "What’s a current production/sonic benchmark for music with driving distorted 8th note guitars, with a pop crossover appeal? Only thing I can think of is the MGK stuff, would love some other references",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339718455590387806",
    "author": "Jeremy Klein",
    "date": "2025-02-13",
    "content": "its crazy how much dominance Zak has in the hard rock / metal world right now. nearly all of the breakout bands of the past couple of years have been zak productions or mixes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339734629971791903",
    "author": "Josh",
    "date": "2025-02-13",
    "content": "I think it’s mostly because there are only a few producers doing 90% of the big rock and metal stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339740797590966322",
    "author": "Jeremy Klein",
    "date": "2025-02-13",
    "content": "genuinely asking here: is this the way it _always_ is with rock and metal, more so than other genres? \n\nwhere the charts are dominated by one person doing 90% of everything",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339742958626279494",
    "author": "Lee Rouse",
    "date": "2025-02-13",
    "content": "This is also very specific to main stream metal/active rock more than any other genre I’ve seen",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339743254811246604",
    "author": "Jeremy Klein",
    "date": "2025-02-13",
    "content": "Ah yeah this totally makes sense. Metal is definitely more sonically homogenous than other genres so this would make sense that one producer and their associated sound has complete dominance",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339743437120868382",
    "author": "Josh",
    "date": "2025-02-13",
    "content": "Also when have you seen a pop artist rave about a particular mixer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339743783083839611",
    "author": "Lee Rouse",
    "date": "2025-02-13",
    "content": "It’s also totally different in rock/metal than pop. I remember when I got thrown head first into pop production and was confused why the mixer didn’t want all dry everything to make it sound “their way” because I was so used to sending stuff like that to mixers. The whole concept of keeping the stems the way they were in the production mix was completely foreign to me hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339756100378951730",
    "author": "Josh Bowman",
    "date": "2025-02-13",
    "content": "Totally fair! It’s wild that almost all the rock guys are still like that…! Is it even the next gen or just the og guys?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340219308655120385",
    "author": "OJ",
    "date": "2025-02-14",
    "content": "alt rnb / alt hip hop / electronic style mostly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346572984156160020",
    "author": "Zach Hughes",
    "date": "2025-03-04",
    "content": "Anyone ever get pretty far into a production and then decide you want to totally change the genre / style? How do you go about doing this? Any specific explorations that have led to cool discoveries in this vein?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1349100001434931200",
    "author": "diamndsdancin",
    "date": "2025-03-11",
    "content": "I'm looking for some new analob lab banks, does anyone know any good ones that kind of have that alternative rnb electronic folk style...\n\nJames blake, mk gee, fred again, bon iver kinda stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350170905682247740",
    "author": "diamndsdancin",
    "date": "2025-03-14",
    "content": "yoo\ni have this drum loop that is in like a similar genre we're hearing today and i want to know the name of it, does anyone know? i think drake has some little boogie songs to this kinda pattern right now, other artists too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360250394382565406",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-04-11",
    "content": "Sure! Using elements of both electronic and acoustic drums to get the :\"best of both worlds\". Thick low end, acoustic dynamics and vibe, crisp controlled top end. The kinda of sounds used in lots of modern pop & rock. Would love something expressive, dynamically playable in that ballpark",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368061985899413514",
    "author": "Juliette",
    "date": "2025-05-02",
    "content": "(not that quad tracking is *bad* (wonderful for metal and the likes) )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370815491765043230",
    "author": "Zach Hughes",
    "date": "2025-05-10",
    "content": "What are some great pop / rock records with weird snare sounds? Funky tunings or strange presentations, anything a bit out there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370888280438210670",
    "author": "Zach Hughes",
    "date": "2025-05-10",
    "content": "Ah ok. I thought you meant the metallica record and I was trying to make the connection between that and Will Oldham",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1371184981086568528",
    "author": "spectrummasters",
    "date": "2025-05-11",
    "content": "This was peak pharrell era imho too . He’d done clipZ. Then Britney , timberlake, Beenie man, Capone n noreaga. That man (and chad) fused rap and pop with a korg triton . Job done lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376712278921183233",
    "author": "Juliette",
    "date": "2025-05-26",
    "content": "Something that I’m realizing that kind of screwed me a bit is that I grew up playing and recording a lot of heavy metal, and that turned into hours and hours of trying to perfect the method to get a huge, heavy song. I’ve watched quite a bit of Joey Sturgis, Fredrik Nordstrom, Zakk Cervini, Jordan Fish, Dan Weller, Will Putney— and the production/mix process became very technical at times, and that’s what I stuck with when it came to my projects as well. \n\nDelving into other genres has been extremely fun but my brain is still used to trying to be super technical rather than just enjoy the sound. :sigh:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376734454822866994",
    "author": "Josh",
    "date": "2025-05-26",
    "content": "A bunch of us came from metal. The learning curve is extreme but I’ve found it just makes people more well rounded.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1380748899110883398",
    "author": "diamndsdancin",
    "date": "2025-06-06",
    "content": "Has anyone found programming trap drums into Ableton can feel a bit bland/generic, it's almost like they need to all be glued together or something - I'm not sure exactly but it just doesn't feel right and almost feels basic when I add some 2 step hi hats, kick and snare. Even when I enjoy the sounds selected and the drum pattern. They don't really fit aswell on melody I've made VS if I drag and drop a drum loop.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387837795866902618",
    "author": "hyanrarvey",
    "date": "2025-06-26",
    "content": "I don’t  like love all the octane rock bands rn but they all do that before the chorus and it’s always a good time no matter how many times I hear it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1388583386586681395",
    "author": "CamSoss",
    "date": "2025-06-28",
    "content": "What are y'all using to come up with horn parts?\n\nFor me it's more for pop and latin, and I love anything that has generative or pre-built phrases that can keep me in a flow, something that can just pin down the vibe quickly for likely hiring players for the final recording session. I am looking at getting NI Session Horns but wondering if there are other options I am overlooking.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1388726830244040776",
    "author": "NoahNeedleman",
    "date": "2025-06-28",
    "content": "Splice is a great start- there’s a few phrase based instruments for Kontakt that might be worth looking at. INDIE is my fav for more folk shit but I bet that have Latin ones too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389075982614270075",
    "author": "Juliette",
    "date": "2025-06-29",
    "content": "I saw Sitala pop up as well, I’m definitely going to give it a shot, thank you for the recommendation! \n\nIt’s not a huge deal but I will admit, I like Ableton’s workflow a little better when it comes to drum kits. But it becomes inconvenient when I’m doing basically everything else in ProTools 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392527872761004052",
    "author": "Josh",
    "date": "2025-07-09",
    "content": "Crying in active rock while reading this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397826882895872132",
    "author": "Gabriel Tyranny",
    "date": "2025-07-23",
    "content": "Session crashed, which was fine cus I backed it up, but then this terrible pop up killed all my momentum for the night 😭 \n\nHadda vent it. Here I go to try and fix it tonight so I don’t procrastinate getting back to it tomorrow. 🤞",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1404121661439086632",
    "author": "Ross Fortune",
    "date": "2025-08-10",
    "content": "Is there a broad name for the rhythm in this beat? Or a genre this kind of beat generally lives in?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1405641262429769758",
    "author": "hyanrarvey",
    "date": "2025-08-14",
    "content": "https://www.tone3000.com/search?gear=ir here’s a huge library of a bunch of stuff don’t know if any of them are super good. Pretty much all of my irs are based for rock and metal and super over driven  cabs, I’ll do some digging around",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410598543802237059",
    "author": "NoahNeedleman",
    "date": "2025-08-28",
    "content": "What are we using to replace guitar solos these days? Country is still very much guitar hero land so having trouble breaking my brain from that habit rn. \n\nIdeas?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410614498863218808",
    "author": "Josh",
    "date": "2025-08-28",
    "content": "Also trying to bring back guitar solos because rock took a break",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417816013025837176",
    "author": "Val ᶠʳ",
    "date": "2025-09-17",
    "content": "Can music be difficult to dive into, because of English accent issues, even if the lyrics are fairly understandable ?\nI know some counter examples of strong assumed French accent in international successful songs, but it seems to be attitude/genre dependent, and I don't think it can fit every kind of song.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418383896088809493",
    "author": "diamndsdancin",
    "date": "2025-09-18",
    "content": "is it mainly for say percussion/hats in the electronic world?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453584698117718080",
    "author": "Akanksha",
    "date": "2025-12-24",
    "content": "I have a question for producers who make future bass. I love the genre but I really can never finish a song.\nMost of the time I'd lay down a drop arrangement and then try to create a lead or vocal chop melody but it never fits the vibe.\nHave you ever had this production block? What did you do to overcome it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456816548714123457",
    "author": "Slow Hand",
    "date": "2026-01-02",
    "content": "What do you mean it feels like hitting cardboard? Does the instrument have bad velocity mapping that feels unnatural? Or does it have poor response time when you use your electronic kit?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456947138796851212",
    "author": "Slow Hand",
    "date": "2026-01-03",
    "content": "I imagine most electronic kits will have this feature that lets you bend the transfer curve, but you could always use a device to filter the MIDI messages before they reach the plugin. A lot of DAWs have them these days.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456958492358348801",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-03",
    "content": "Good shout, gonna try messing around a bit more with that! \n\nAnother part of what makes these kits sound so good are boost layers/one shots that suddenly pop in at certain velocities, I might turn them off. But that also makes it sound entirely different, almost like tracking with a different guitar amp 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457018417423843437",
    "author": "hyanrarvey",
    "date": "2026-01-03",
    "content": "Architects was very very very much made for heavy rock dynamics so like a few ghost notes and then a bajlion hard hits",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460692845068419228",
    "author": "Rob Domos",
    "date": "2026-01-13",
    "content": "I guess what I mean is that the Haley song sounds tighter than the circles stuff (which I own and have used on various projects) and I’d like to take it even further if possible but this is the closest I’ve heard. You may be right about the shortening with processing but I’m a huge sucker for no reflections at all. \n\nAlso not really going for a QOTSA rock kit thing which is a lot of what I’m finding. I’m interested in having the hyper tightness of modern hip hop / EDM drums but with the natural textures of real instruments being hit.\n\nWould be even more hyped about finding tablas and woodblocks than rock drums. \n\nI’ll check out the addictive one!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460738351140307208",
    "author": "Rob Domos",
    "date": "2026-01-13",
    "content": "Looks like there idea of dry is like how rock is dry as opposed to traditional orchestral levels of wet, but I am finding things I like and may use though! The jazz kit is sick",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1462544619798794484",
    "author": "CMC",
    "date": "2026-01-18",
    "content": "Follow up, also looking for some favorite creative distorted guitar tones. Nothing metal or standard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470639745163071509",
    "author": "Juliette",
    "date": "2026-02-09",
    "content": "I've run into a weird dilemma and I'd love some advice/guidance. A pop track I'm producing on sounds great on the ears instrumentally and vocally, but I keep thinking it could have *more* going on to compliment it. Kind of like adding sprinkles onto a cake. However, I go to to explore other elements (extra vocal layers, extra synths, etc.) and it just throws this feeling of balance off. It's probably a mental barrier after listening to what the demo sounds like so much, but at the same time, I think the track could objectively benefit from some filling out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470805851077087444",
    "author": "Will Trotman",
    "date": "2026-02-10",
    "content": "Or if u bad fr a lil jazz flute solo usually does the trick",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]