[
  {
    "id": "1267175404322689046",
    "author": "chrissorem",
    "date": "2024-07-28",
    "content": "This made me think of a production technique Ive stumbled on.  We all have our go to instincts that can lead to a similar feeling across a  record.  Generally there is a dominant instrument that the song was written on such as guitar or piano maybe a synth.  Take a filled out productions and mute all the main ingredients and leave the additive colors, only the sprinkles on top. And start rebuilding the production around that. It can take you to an entirely different  universe and provide contrast in the arch of the record",
    "reactions": 21,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196682595795210270",
    "author": "BatMeckley",
    "date": "2024-01-15",
    "content": "Couple things:\n1) no one is actually a perfectionist. It doesn’t exist. I heard a great story of someone telling (I want to say) Richard Marx that he hadn’t released his record yet cause he’s a perfectionist and RM replied “Bullshit. Name one thing you’ve ever done that’s actually perfect. You’re just scared to move on.”  That story has stuck with me.\n\n2) I’m a fairly decent guitar player, have made an actual career of being paid to do it. And I STILL am either constantly hiring people better than I or recording things note by note and then assembled in protools afterwards. Dr Luke might be the best guitarist I’ve ever been around (and I’ve hung with Blake Mills, Tim Pierce, Phil X), and he CONSTANTLY would just hit record, play the four chords of the song free time, and then cut them up and drop them on the ones or wherever they’re supposed to go in the song. My favorite thing about making records vs performing them live is that on record NO ONE CARES how you got there, just that you did. Unless your groove has something particularly magic to offer I’d get over the one take mentality pretty quick.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376707792471199765",
    "author": "BatMeckley",
    "date": "2025-05-26",
    "content": "Someone in the mix channel had mused about what Serbian’s assistant’s do, and it brings me back to “The people that know how will always work for the people that know why”\n\nDo you know the actual reasons why you feel your work doesn’t measure up yet? Hint: it’s very rarely strictly the sonics and/or mix. That Olivia Rodrigo album sounded objectively terrible, but FELT awesome. And that’s what mattered in the end.  Benny Blanco became successful with a folder full of songs at 120 bpm cause he didn’t know how to change the tempo, and stacks of kick drums because he didn’t know how to eq (he just layers a brighter kick on top if it needs more snap). When I’d ask him why he pretty much did anything it was always “I dunno, man, it just sounds cool!”. Make sure you’re attacking the work with that kind of mindset. \n\nWhen I get lost in the minutiae I try to zoom out and just be like “does this whole track feel good? Am I instinctually bobbing my head?” And if not, why?\n\n95% of the songs that people have sent me here, the issue hasn’t been their space, or their monitoring, or whether they used a 60s or 70s guitar, or if they mixed analog or in the box. The issues almost always tend to be much less narrow in scope. Make sure you zoom out and just go “is this cool?”",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103454133257785384",
    "author": "BatMeckley",
    "date": "2023-05-03",
    "content": "I worked with a band at the very beginning that was a three piece with VERY specific rules. \n\n1) all songs had to be under 2:45\n2) guitars and vocals could be doubled for tone, but not parts.\n3) bassist sang lead, if there was a harmony the guitarist (not a gifted singer) had to sing it, if there was a third part the drummer had to sing it (couldn’t sing at all)\n4) record couldn’t take more than a week to record/mix \n\nIt was the project that convinced Luke I could be a producer; his fav record id done up to that point.\n\nThere’s a real value to putting strict limitations on your art, it often brings the most clarity and creativity. Side note: they were terrible technical musicians but just fucking AWESOME.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324439663867461652",
    "author": "popaganda.",
    "date": "2025-01-02",
    "content": "No matter what I’d be trying to build off a live performance. Vocals and guitar at the same time if possible, make sure the artist is comfortable enough to really deliver the way they did on their videos. Sometimes when artists get in the studio they get way in their heads, and then the process of doing takes and dressing up a track piece by piece can really cloud up the original energy that the fans connected with. So no matter how you eventually dress it up, the core has to be as dynamic and connective as possible.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256331669477003304",
    "author": "BatMeckley",
    "date": "2024-06-28",
    "content": "Nice of my tech to lend me this guitar and show me how to amp and mic it up properly to get the sound I’m looking for. Made me coffee too (I can currently see music and hear colors). Played me a bunch of stuff that made me want to light everything I’m working on on fire and start fresh and be better. If this is gatekeeping I hope he keeps all the gates. \n\n(Had nice things to say about a certain Matt Rad as well, go figure, no one’s perfect)",
    "reactions": 13,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1281690105634881630",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-06",
    "content": "Obvious for pretty much all of you I believe, but I spent so many hours over the last few years trying to make Guitar VST:s work for realism (for time/travel purposes), and it’s always a pain. Tracked real yesterday for first time in a while and even when it sounds bad, it sounds good. I want my guitar VST hours back 🥲",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258499590303256627",
    "author": "oaklandmatt",
    "date": "2024-07-04",
    "content": "Also be mindful that guitar editing is more like shaker/tambourine editing than kick/snare editing.\n\nThe sound leading up to the transient can be super important. The peak of the waveform on the DI track can be misleading, depending on the part and how it's played.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095867810154025100",
    "author": "BatMeckley",
    "date": "2023-04-12",
    "content": "To be fair, I replay all of Noah’s guitar parts, just out of spite. We still get on alright.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196625414848786532",
    "author": "peterlabberton",
    "date": "2024-01-15",
    "content": "And on the flip side: I once stayed up until 2 am while working on a record I was producing and put together a killer guitar part that I was somehow able to nail (with some significant editing). I listen in the morning and think to myself, \"bite me, Blake Mills, I've got your fuckin' number asshole!\" Artist comes in, I play the song back... \"it's cool but it's not the vibe.\" And that was that—I think we put a Solina pad in there instead that took 3 minutes to do and we moved on.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077750373776904345",
    "author": "BatMeckley",
    "date": "2023-02-21",
    "content": "I actually ended up working on the Fields record because I was touring (my friends had road cases that I needed, and they wanted my amps for their guitar sound on the record). I’ve found that just making music anyway I can has always managed to lead to work (ie, I produced a 3oh!3 song because the girl I was playing with on warped tour was on the same stage with them, we became friends, I started playing with them too, and then we just kept in touch.) But that song wasn’t until 2 years later. Doors of opportunity rarely open immediately, you just try to keep yourself in a shape that means you can walk through them when they do.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135910262516486174",
    "author": "tomtom",
    "date": "2023-08-01",
    "content": "Beatles playbook..acoustic guitars provide the clangy shit. I wish more people thought about their arrangements this way.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183956465174716527",
    "author": "BatMeckley",
    "date": "2023-12-11",
    "content": "It’s been fun to watch Tyler’s arc from an auxiliary live guitarist we hired for a project to the go to guy in the One Republic camp. Just a great example of being a good dude and crushing it at every stage of the ladder and making themselves indispensable. Really talented dude.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195016804305731764",
    "author": "Ross Fortune",
    "date": "2024-01-11",
    "content": "Confirmed by Phil Collen that 98% of the Hysteria guitars were Rockman (and Adrenalise, the following album - although that was with the later Rockman where you could switch the chorus/verb/delay in and out).\n\nThe *jang jang jang* I was looking for was Phil's 1978 Fender Stratocaster (nicknamed \"Felix\"), picking one string at a time through the clean setting on the Rockman, avoiding the arpeggio effect of actually strumming a guitar.\n\nSauce: https://www.youtube.com/watch?v=6pli9XTPHR8",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258182742844375082",
    "author": "LAPhill",
    "date": "2024-07-03",
    "content": "Sharing a tip for those that track distorted guitars - always take a DI signal with it. So much easier to edit timing looking at the bottom waveform vs. the top:",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1334294937176375327",
    "author": "Slow Hand",
    "date": "2025-01-29",
    "content": "Granted, her examples are *very* specific to orchestra and not directly applicable to pop records, but the underlying principles here include:\n\n**1) **Think of instrument combinations as a single composite voice.\n\nOne instrument can function as the \"sustain\" portion of the sound and a second instrument gives the \"attack\". Together they create a single melodic voice.\n\n**2) **How do the instruments stack on each other? Do they clash? Cellos doubling a bass an octave up extend it's timbre into a higher register to make it read better. It's not so different from adding fuzz to an 808 so that it has more presence.\n\n**3) **Which instrument will cut through the music?\n\n---\n\nA few concepts that I'll add:\n\n**4) **Instruments in the foreground vs. the background. Know which part is the lead (focal point) at any given point in the record and then pare down the presence of the rest and push it into the back of the sound stage.\n\n**5)** (Piggybacking off of Felix's excellent post) What is the simplest way to achieve the desired effect? Reduce. Reduce. Reduce.\n\nCut instruments and parts ruthlessly and approach it with a minimalist's eye. Like writing a haiku: How few elements can you use to create an impression? Maybe a guitar part is carrying 90% of the groove and the drums only need to be a kick and a snare. Or maybe the guitar is covering the backbeat too, and you don't even need a snare!\n\nConstantly ask yourself \"What is the most important sensation in the record?\" and then focus it by cutting out everything that gets in the way.\n\n**6)** Hocketing. Pass the melody off between different instruments at different points in the song. Play it in different registers. Combine voices occasionally for special effect.\n\n**7)** Tonal contrast. Dark instruments plus bright instruments. Distorted and clean together. Near vs. distant.\n\nElements that sound same-y will gel together and elements that contrast tonally will pop.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033939905086226472",
    "author": "Slow Hand",
    "date": "2022-10-23",
    "content": "I couldn't speak to the current state of samplers, but I've always wished that someone would build a bold sampler that wasn't afraid to be really wacky and full of unique characteristics. For starters:\n\n1. Include a radio tuner. \n2. Maybe some really nice - but heavily colored - preamps.\n3. Include all kinds of weird peripheral sensors like devices that pick up EMF signals or a few contact mics. Include a suite of effect plugins that are specially geared towards these input methods.\n4. Super-intuitive resampling, time-stretching, and pitch-shifting features.\n5. An algorithm that analyzes the dominant pitch of a loop and auto-maps it to a keyboard. It should be capable of re-orienting itself as the dominant pitch of a loop is adjusted.\n6. Tracker-style sequencing capabilities.\n7. An OTT-style compressor. Maybe something really trashy and blown-out like Devil-Loc or Vulf Compressor. Something that really messes with the proportions of a sample.\n8. Easy and flexible integration of feedback loops.\n9. Intuitive integration of polyrhythmic looping or sequencing.\n10. A feature for easy implementation of Steve Reich 'It's Gonna Rain' style tape loop phasing.\n11. Auto-bpm detection keyed off of designated inputs (ala Ableton).\n12. Automated master tempo effects.\n\nI could go on.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037560949273538661",
    "author": "popaganda.",
    "date": "2022-11-02",
    "content": "I’ll add kind of a different angle to this convo….everything mentioned is crucial…play a lot, record, play with others, just reps….but if you want to see big gains TECHNICALLY on something like guitar or piano, you need to break movements down and very very slowly drill the transitions….one note to the next. One chord to the next…really building muscle memory. For a new chord shape…form it very slowly and then let go completely. Repeat many times. Same thing for chord transitions….super slowly between the two. It may seem like it would take too long to practice like that, but doing micro work like that will completely transform your ability on an instrument if you’re judicious and persistent.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103477593837150218",
    "author": "NoahNeedleman",
    "date": "2023-05-03",
    "content": "Interesting, and to your point, I just finished a production where I reached for Spitfire *instead* of guitars or synths in the same spirit of limitation / creativity. Turns out the BBC horns make a killer pad.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196612413320077415",
    "author": "LAPhill",
    "date": "2024-01-15",
    "content": "The hard truth is that, if you're going to be a producer recording your own parts, then it's your responsibility to figure out how to make them bang. And learning how to quickly and efficiently work around your limitations is part of the gig. Get really good at knowing where you can punch to hide the seams of comping, regardless of the type of part. Retune the guitar to make chord shapes easier. Split up the part. If you practice THOSE editing skills, your workflow will speed up tremendously. There's no need to concern yourself with being able to play it in one go, or at all, unless you're going to perform it live.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276781338091061280",
    "author": "youngteam",
    "date": "2024-08-23",
    "content": "just want to share some sauce that khs transient shaper has changed my life lately. i've been on the hunt for a good ZERO LATENCY transient designer and this thing just fucks. attack, decay, a mid envelope stage called pump, time knob and built in clipping. trying to keep my production template very, very lean in terms of cpu and latency causing plugins while i'm making beats and tracking synths with a midi guitar heh",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1311026460831645696",
    "author": "Slow Hand",
    "date": "2024-11-26",
    "content": "At the risk of stating the obvious, transitions can also be telegraphed through the instrumental writing too. Whether it's a drum fill, or a chord voicing that walks up/down into the next section, or tension in the melodic voices, or shortening the notes lengths (staccato, staccatissimo).\n\nThere's also idiomatic noises from the instruments. Guitars have string scrapes, headstock rakes, that cool chattering thing from tapping near the bridge with the edge of your pick. Pianos have big glisses, horns can squeal, bowed strings can sweep a fast legato scale up into the downbeat or do a large gliss.\n\nThen there's foley. I get a *lot* of mileage from sound libraries made for film audio. Foley artists are some creative people and you can go far layering their sounds into instruments at the transitions.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410709910970302494",
    "author": "cian riordan",
    "date": "2025-08-28",
    "content": "Everyone here’s take on saxophone is like if people could  only associate bass guitar with the Seinfeld sound.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954057628785471588",
    "author": "jonmatteson",
    "date": "2022-03-17",
    "content": "Listen to D’angelo’s voodoo and listen to the placement of the notes in each instrument. Questlove tends to lay the hat behind and push the snare which makes a sort of flaming vibe which is very pleasing. Also pino’s bass is behind his kick and the guitar behind pino etc. all about push and pull of the elements!",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037472500860321863",
    "author": "Zack Hames",
    "date": "2022-11-02",
    "content": "Then keep doing that. I can play drums and edit them to filth and they sound great. Make and do by any means necessary, no ego. \n\nThe only reason to worry about getting better is to have more freedom on the instrument or because you want to get a certain feel out if it, that maybe isn’t easy to just edit. \n\nTo answer your question, I’ve been “playing drums” for 14 years casually as a lifelong guitarist first. It probably took me that long to feel like I could record unedited.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037480224448843957",
    "author": "peterlabberton",
    "date": "2022-11-02",
    "content": "Oh also, most of the shit that you’re learning when you *really* learn an instrument (like your primary instrument, going deep), is completely irrelevant making pop music. Using the word pop very broadly here. The parts people actually want on a record are fucking bonehead easy most of the time. So I don’t feel like I need to be a ripping guitarist to play something. If I need a great solo, I have friends I can call.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169730262733693000",
    "author": "cian riordan",
    "date": "2023-11-02",
    "content": "Context is king here. Some people respond better to hard criticism. I think Ruairi’s point of having a shared mission is key. If everyone is aligned and that’s what it takes to get the guitar player to give a shit, and you have a comfortable rapport with them and the band to dig in, then go for it. No one is advocating to be mean for means sake.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444027866323878028",
    "author": "oaklandmatt",
    "date": "2025-11-28",
    "content": "The method that sounds most transparent is hand editing (no digital stretching at all). You need to line up your edits so the wave form is perfect in the middle of each note, then use an equal gain cross fade at the edit point. This gives you the most transparency because there is no algorithmic stretching happening. \n\nIt limits very slightly your options with timing because bass wave forms are long, so lining them up perfectly means you can only move the timing the length of each waveform. It's also time consuming compared to stretching.\n\nIf you are editing a DI that is then going through significant processing (amp sims and shit), you can sometimes get away with one of the stretching algorithms. Elastic audio is ok and usable sometimes, but I prefer Ableton's complex mode over everything else I've heard.\n\nI try to avoid time stretching artifacts on lead vocals and bass instruments more than anything else (unless it's creatively interesting of course).",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051559803668938862",
    "author": "Zach Hughes",
    "date": "2022-12-11",
    "content": "Wanted to share some thoughts spurred on by a recent experience on here. So a local artist has hired me to produce two of her songs. Vibe is singer-songwriter, soul, RnB.\n\nWe tracked drums, bass, and keys live in the studio OD'd to scratch tracks we cooked up together. The scratch tracks / demos were just guitar vocal and we were really relying on the players to fill out the arrangements, but we knew more would be added down the line.\n\nAll the players were incredible. Could singe your eyebrows off with technical prowess and shredtastic chops. Tracks turned out great, still working on the arrangement, but..\n\nThis project has got me thinking more about the importance of how you present a song to session musicians and the 'space' you ask them to fill in a production. As well as the changing dynamics project to project affected by a revolving cast of participants, more fleshed out demos, etc... I find this a really interesting topic. Curious if anyone in the group has any unique experiences or insights whether as a producer or a musician.\n\nI've found that the more I flesh out demos with the artist beforehand the more bound and limited the session players we bring in are based off our decisions. This can make ODs more efficient, add a clearer direction, but can also remove the opportunity for the player to really add something special. Sometimes I don't want to be too suggestive b/c I want the players to have more of a blank canvas to work with.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280945164009082946",
    "author": "Slow Hand",
    "date": "2024-09-04",
    "content": "Hmm. Fun question. Ultimately hard to say without seeing the clip. Want to text me a small clip of the video so I can get a vibe?\n\nI will say this: God have mercy on your soul if you use an electric guitar with a dotted-eighth delay on it.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357597759493902559",
    "author": "oaklandmatt",
    "date": "2025-04-03",
    "content": "The law says \"any use\" needs to be cleared. One of the major legal cases even specified no minimum length.\n\nThat being said, nearly all drum one shots are commonly uncleared. There are some other exceptions that would fall under being a generic sound of some sort.\n\nThe short answer is, if someone can recognize it from their original recording, you can be sued. \n\nMost people don't bother trying to clear things because they don't have budget. Usually nothing ever happens because most songs don't get big enough for the copyright owner to care. Then again, I heard Gotye had to give away 80% of Somebody That I Used To Know because of the two chord uncleared bossa nova guitar lick.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444073245400760372",
    "author": "oaklandmatt",
    "date": "2025-11-28",
    "content": "Good question! \n\nAs @cian riordan said, when you're perfectly lining up the waveform of any solid tone, you want equal gain so it doesn't give you a boost on the crossfade. This is for \"correlated\" signals where the waveform is lining up exactly. A bass guitar, the middle of a vocal note, a synth with a consistent waveform, etc.\n\nWhen you're doing a crossfade on noise (breaths, sss's, ambience between drum hits, etc), you want equal power because these \"uncorrelated\" signals need a bit of boost around the crossfade for the perceived loudness to be the same.\n\nYou can check this by using a synth note or long vocal note, doing an edit to make it longer or shorter, lining up the waveforms perfectly, and doing a cross fade. You will find that equal power causes a volume bump. Equal gain will be smooth.\n\nDo the same thing with white noise and this time equal power will be smooth, while equal gain will cause a volume dip.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1004628773796335717",
    "author": "oaklandmatt",
    "date": "2022-08-03",
    "content": "the people want an all guitar episode pt 2!",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032031776278839307",
    "author": "cian riordan",
    "date": "2022-10-18",
    "content": "I have the Strymon Flint and that's a great pedal spring -- Julian Lage hipped me to that and he's super particular.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037479551988670604",
    "author": "peterlabberton",
    "date": "2022-11-02",
    "content": "I’m a drummer first, but now play bass/guitar/some minimal keys on a good amount of stuff I produce. Taking drums out of the equation (that was years and years of many many hours every day), I’ve just gradually improved on the other instruments to a point where I now feel comfortable playing on a record. There have been moments of sustained growth in a given instrument, but really it’s just been time and growing as a *musician*—almost more a mindset of confidence. A baseline level of theory helps, then just a) learning songs, and b) learning how to play what you want to hear.\n\nAlso editing. Not gonna throw this person under the bus, but I got to work with a very A-list producer a couple years ago and recorded him playing drums (not his main instrument). Let’s just say it wasn’t great. But it got the idea down, and then edit edit edit. No shame, just make it great in the end!",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051573042800767047",
    "author": "BatMeckley",
    "date": "2022-12-11",
    "content": "Rod Castro is BRILLIANT at this. He comes in, listens to the rough, lays down the “right” part with the right tone immediately without me having to hold his hand, and then because the studio’s booked for the day and he just handled it in 15 minutes we get to spend the rest of the time trying weird ambient guitar pads and absurd lead lines.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141936547181109258",
    "author": "BatMeckley",
    "date": "2023-08-17",
    "content": "I was just bringing it up to be a schmuck and mildly difficult (largely because DP’s camp was pretty difficult with us when we’re on intersecting tours forever ago)  but it does bring up an important TOTALLY UNRELATED TO YOUR SPECIFIC DANIEL POWTER situation point: we’re in the business of tiny differences making huge differences. You can get a Warm 47 for a grand or real 47 for 15 grand and they’re preeeetttyy  close. But the devil is in the details. The original Dare you to Move (I think that song has had 4 different versions now) is pretty close to the Fields version… Fields rocked up the drums a little more, and by far most importantly  had my sage input (and gear) for a more kickass guitar sound. The song went from a heavily pushed song that couldn’t quite get its footing for them to a massive multi platinum career defining hit. It can be frustrating to watch someone else turn something we got 95% of the way there into the thing that got released, but often times it’s that exact skill which makes them worth the investment from the label. Understanding that difference and learning how to bridge the gap is the whole secret to making a living in this business.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1345420598263677138",
    "author": "hyanrarvey",
    "date": "2025-03-01",
    "content": "Double tracked guitars 4 life",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410685435985924176",
    "author": "cian riordan",
    "date": "2025-08-28",
    "content": "Gimme sax over that shitty McGee guitar thing any day",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062096684982747167",
    "author": "BatMeckley",
    "date": "2023-01-09",
    "content": "Perspective. Start smoking 🚬. That kind of shit in the process is where it usually goes south, at least for me. Frequent ear breaks, frequent referencing other things helps me avoid rabbit holing. Nothing worse than spending 10 hours on the 5k of a guitar and not realizing the song doesn’t have a bridge yet.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087438215587307560",
    "author": "stefandurandt",
    "date": "2023-03-20",
    "content": "I’ve got a lil pedal setup w/ a tascam, two overdrives, two strymons & a spring pedal running into a stereo amp all fed from my buddy Franklin Audio RA10 reamp (so good!) It’s so inspiring",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1095799671160582166",
    "author": "LAPhill",
    "date": "2023-04-12",
    "content": "Where was this recorded? Saying \"hey, I noticed the guitar is pretty out of tune, can you retrack it?\" is a no-brainer conversation to someone working from home. If they rented studio time and invested a bunch into that recording, then you need to tread more carefully.. but still do it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095818213109022770",
    "author": "Zack Hames",
    "date": "2023-04-12",
    "content": "My viewpoint was to “always” do whatever is necessary to make it great. Not that you should “always” replace the guitar part. But if something isn’t working, fix it! If that’s you replaying or them replaying who cares? Fuck ego.\n\nAnd when I say always or never I hope everyone can assume I mean “most of the time but not always and not never because everything is subjective and unique and this is just my experience” but that doesn’t really roll off the tongue.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222058055626133545",
    "author": "itMIGHTbeNICK",
    "date": "2024-03-25",
    "content": "Today we were looking for a more textured dirty synth sound out of the Juno. We tried multiple different ideas until we came to a conclusion with a guitar amp.\nRan the 106 right into a Keeley rat style pedal for extra sizzle and then mic’d up one of the newer Bad Cat black cat amps (tremolo and reverb from the amp on) and it was absolutely the PERFECT sound for this track!\n\nThat is all.\n#trystuff",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1231003352637243473",
    "author": "Zach Hughes",
    "date": "2024-04-19",
    "content": "I can't take credit for this framework (might have actually been in a conversations pod ep) but something I've adopted in my own production practice is the idea of convergence and divergence. If you are trying to converge on final guitar takes while your client is wanting to diverge and explore new creative ideas, then might be worth explicitly communicating 'this is where we're at and here's what we need to get done today' as lead producer before you begin tracking just so everyone knows. I'd be wary of stifling the exploration / play of your client, but maybe you could have them channel that into a notebook or voice memo in the back of the studio and you could schedule a time with the sole purpose of fucking around and exploring / playing with new ideas. Really just wanna make sure everyone knows when you're in 'convergence mode' and when you're in 'divergence mode' to avoid that frustration.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256422160331833426",
    "author": "BatMeckley",
    "date": "2024-06-28",
    "content": "People forget (or never knew in the first place) that he was an in demand session guitarist. It’s how he got in the gig. Today I played him this very jazzy expensive chord record I’m working on and he immediately picked up a guitar off the wall and played all the inversions properly and started suggesting new ones. First take, no hunting and pecking. When a guy like that with experience buys an amp or whatever it’s because it makes the sound he’s hunting for, not just an eh version of it. His wurli is a great wurli, his 330 is a great 330. If they’re not great he doesn’t keep them around.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258190900753072250",
    "author": "BatMeckley",
    "date": "2024-07-03",
    "content": "Yup, but also, depends how you’re tracking the distorted chord. Certain modelers and even pedals (h90) have a significant amount of latency. (If we’re getting nerdy about it). So if you’re splitting the signal, make sure to account for that.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285434545327444049",
    "author": "cian riordan",
    "date": "2024-09-16",
    "content": "Asked my bud Sam who played the guitar, he couldn't remember much. I imagine Dan went deep on the processing.",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1291505406090154135",
    "author": "BatMeckley",
    "date": "2024-10-03",
    "content": "I really like the range function. There’s something in the way that it reacts that I just can’t get ProMB to sound the same. (And I’ve tried). \n\nI tend to be doing pretty wide, easy, just a few DB moves with it. The sharp resonant notches I used to use have been MOSTLY replaced by eq or soothe. \n\nYou don’t have to use all the bands. Less is more. \n\nThe whole reason I c6 over c4 is the side chain feature, where I’ll just have it last on say the guitar bus, triggered by the vocal, just ducking enough space to make the vocal a bit more intelligible. Bit like the song mixing itself. \nI find I’m not using c6 a ton on the actual track, it’s always side chained. \n\nC4 is more on the track itself. Really handy to focus a chunk of the audio. You can control the range of say 2-5k, and then move the entire volume of that up and down as it only dances with 5db of itself. Useful.\n\nNot sure if I’ve mixed a song where the c4 isn’t on the drum bus somewhere.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310903150026424351",
    "author": "NoahNeedleman",
    "date": "2024-11-26",
    "content": "Love this q. Curious to hear everyone’s thought. \n\nI like Pitched elements, like a synth chord kinda raked, or high strung guitar.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410618488174936229",
    "author": "Nomograph Mastering",
    "date": "2025-08-28",
    "content": "Awesome, I think an underused format is 2 instruments - one handing off to the other - like start on guitar and then up the ante with Sax/synth etc to bring it home",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "967300151444123698",
    "author": "NoahNeedleman",
    "date": "2022-04-22",
    "content": "GREAT QUESTION. Creative Subdivisions are so important. Wide/high filtered ping-pong delays are a go to for me sometimes- also cool to do this with pitched instruments: take an electric guitar or even an acoustic, double track a syncopated ostinato and filter that? Idk I’m looking forward to hearing other ideas too.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037565557232369754",
    "author": "popaganda.",
    "date": "2022-11-02",
    "content": "Classical guitar is my background too and that advice is coming from a couple world-class performers who totally overhauled my technique. Slow down! Tortoise and the hare lol. And zooming out remember that you’re good enough at all your instruments to make amazing records. So choose something to improve and just zoom in for a bit.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057705034596503605",
    "author": "BatMeckley",
    "date": "2022-12-28",
    "content": "Bro he asked for a spring reverb pedal and you keep shouting out pedals that are anything but 😂",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057705397311504546",
    "author": "BatMeckley",
    "date": "2022-12-28",
    "content": "Kinda not really. Let’s try to keep the noise down like shouting out 224 style pedals, even if they’re really great.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1058445687848710175",
    "author": "BatMeckley",
    "date": "2022-12-30",
    "content": "Just a heads up, that pedal show on YouTube just posted a video about their top 5 real spring reverb pedals or what not. I’ve found their advice when taken in context can be really useful. Maybe helpful to you?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079449588513112144",
    "author": "cian riordan",
    "date": "2023-02-26",
    "content": "For recording, I lean pedals because it’s faster and easier to try a million different options.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095798570910761042",
    "author": "cian riordan",
    "date": "2023-04-12",
    "content": "I was just implying the connection between replacing someone’s shitty guitar performance with showing them how to fuck their wife feels a little extreme. I don’t disagree with your input, per se. Its a somewhat reasonable argument, just laid out with the weight of a 1000 anvils.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099742521736822935",
    "author": "NoahNeedleman",
    "date": "2023-04-23",
    "content": "Friends: RC20 can fuck a duck. Generation Loss MkII from Chase Bliss is remarkable. The Wow & Flutter are super musical, and the Saturation knob alone is worth the money, but mostly every plug-in I’ve used to add movement makes tracks sound smaller. This pedal makes shit sound bigger. 👏🏻🙏🏻",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141949329347715183",
    "author": "NoahNeedleman",
    "date": "2023-08-17",
    "content": "Another example:\n\nOn Brett’s last record, he did a demo with a co-writer of a song I loved. he tracked vocals with me, and I suggested the track needed a Mayer style guitar solo, so I played it. When Dann Huff heard it he told Brett “we’ll just upgrade Noah’s track to Master Scale. It’s not gonna get any better than that.”\n\nWhen they went into the studio, they ended up taking the Mayer idea all the way, and the whole thing kinda went Country “Don’t Trust Myself.” They couldn’t do a Mayer solo on top of a Mayer vibe cause it would go from inspired by to straight derivative. \n\nMy solo didn’t make the record, and I didn’t get any production credit. But the guy who did the demo did. I did get some BGVs on it and paid accordingly. All that felt right to me.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150161320268804146",
    "author": "Zack Hames",
    "date": "2023-09-09",
    "content": "As if drum machines replaced drummers entirely.  As if the electric guitar replaced acoustic guitar. As if tubes are actually obsolete in audio. \n\nAI is a trendy word. It used to be called “algorithm” 🙄 \n\n/rant",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168804285660798996",
    "author": "Marshall",
    "date": "2023-10-30",
    "content": "1. Fully copy the structure of a song you like 2. rip the exact drum beat off from a different song you like 3. thrown down some chords 4. find the stems of a completely different song you really like the sonics of and try to copy the exact types of instruments/synth sounds/samples/etc and what purpose they serve in that song (ex: guitar in middle octave playing a rhythmic pluck, synth swell with reverb into the chorus, bright noise synth drones only on the last chorus)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179922587896266782",
    "author": "Zach Hughes",
    "date": "2023-11-30",
    "content": "I also struggle to find a balance between focusing on production work and my songwriting. I was focused heavily on production work over the summer and then when my schedule loosened up in the Fall I started writing for my next album. I had done a little brainstorm session with chatGPT actually to help me create a daily schedule oriented solely around writing which was pretty helpful. But even when still in the production grind I like having guitars laying around so I can grab one when I take a break or bring on in the house with me. If you have the flexibility, w/o compromising deadlines, I've found it helpful to leave room to indulge the moments when songs / melodies / lyrics pop into my head even when my expectation that day was to work on a mix or other production. Be interrupted by the song and push everything else back an hour and see what happens.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194297860896862250",
    "author": "NoahNeedleman",
    "date": "2024-01-09",
    "content": "I mean… I said it all like I know exactly what I’m talking about. But it’s just my best guess. Chorus effect emulates a 12 string vibe but 12 string kinda does its own thing. I’ve gone for sounds like that by stacking a high strung with a standard guitar. \n\nI have 2 12 strings- a 1972 Martin and a 1982 epiphone. I took all the low strings off the epiphone and it’s a GREAT instrument for stacking strums.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202659052895862904",
    "author": "LAPhill",
    "date": "2024-02-01",
    "content": "This might finally be the project to get a 7 or 8 string guitar",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256013017817026730",
    "author": "NoahNeedleman",
    "date": "2024-06-27",
    "content": "For my fellow Apollo users:\n\n\nPrompted by Beckley the other day, I did some deep dives in to UAD’s unison amp sims for tracking. The Suhr and Marshall Blues Breaker were both DOPE. The Suhr really shined on clean stuff and the room sounds on the blues breaker were as good as it gets for modeling imo",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285478715987591210",
    "author": "BatMeckley",
    "date": "2024-09-16",
    "content": "I just went through this with an artist, and was surprised at the difference a good rubber bridge guitar made. The crummy one she borrowed sounded like a big uke, but the good one I got from my friend Tony made all the difference. The other hack is running the pickup through a good tweed style or projector type amp, and then blending that in to taste in parallel",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1288480538151223369",
    "author": "Iwan Morgan",
    "date": "2024-09-25",
    "content": "I’d be inclined to charge slightly less, but just because there are fewer sources doesn’t mean the job is easier. A more exposed performance reveals a lot more and can technically be challenging if the singer is playing the acoustic guitar and singing at the same time. @bobby k",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1314013843810160682",
    "author": "Ross Fortune",
    "date": "2024-12-04",
    "content": "Dug deep into Help Me Rhonda by the beach boys which was loads of fun (Carole Kaye bass, trying to get the feel of the ska type upstrokes on guitar was way tougher than I expected), biggest takeaway was how effective the big tempo fluctuations were. I’ve used tempo as a technique a bunch more since then. Noticed some similar stuff in Vampire by Olivia Rodrigo.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341132363865915455",
    "author": "kieronmenzies",
    "date": "2025-02-17",
    "content": "Thanks for posing this question today! I have an acoustic guitar session booked for tonight so it's great to be reminded of these references @cian riordan @Brian Reynolds",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407996896177291264",
    "author": "andrew_yv",
    "date": "2025-08-21",
    "content": "Not the one true solution by any means, but when I did my first album, I settled on an ensemble after I had already produced a lot of disparate demos, and then rearranged the best ones for that ensemble. In my case, it was string quartet, nylon guitar, percussion, and electronics. That also led to cool “choices” that came from like, having my violist play a part I made the demo of on a semi-modular mono synth. Ensemble can be a unifying lens to capture your diverse ideas through and give them a sense of unity",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410008315093581905",
    "author": "chris_donlin",
    "date": "2025-08-26",
    "content": "The pedal idea is fun. I have some creative books like \"Steal Like an Artist\" and a big sketch book with markers/oil pastels for people to pick up instead of just chilling on their phones. The sketch book gets used more than i expected. I also have a yo-yo that people fucking love to play with hahah. Making music got way more fun for me when i realized the studio is just a playground for adults",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1431635999351509123",
    "author": "NoahNeedleman",
    "date": "2025-10-25",
    "content": "Listening to Rubber Soul this morning and realizing just how much of my production instincts come from the Beatles. \n\nThe way repeated verses get a slight lift, BGVs as a real band member, the way space is filled with interesting sounds, not just guitar fills, and how every part is a *part*",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434557064587382946",
    "author": "Josh",
    "date": "2025-11-02",
    "content": "I’d even argue that D’addario flats will get just about any guitar really close to that sound. They’re not as flat as the electric strings so you still get a good amount of resonance and way less finger noise",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999048608940822628",
    "author": "Deleted User",
    "date": "2022-07-19",
    "content": "Sooo, on the recording side of things: if you’re going DI, most interfaces do not have a high enough input impedance to do passive pickups justice, especially if you want a decent amount of low end. Guitar pickups sound good with 1-2MOhm(the input impedance of a good tube amp), but if I want really clear modern low end that can compete with 808s, then I’ve had the best results with around 10MOhm on passive bass pickups. Another important thing is a transistor-based active DI will not get you a full low end. You will end up re-amping or using amp emulations etc. Octal tubes(the type of tubes IN the B15) will. Octal tubes have a lot more body(think U47, for example) and will get you there much much quicker. I have a Sarno V8, which isn’t perfect, but sounds clean, “finished” and modern from the get-go. No compression or emulations needed. It’s also comparatively affordable, so totally worth every penny.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018511870107320325",
    "author": "Eric Martin",
    "date": "2022-09-11",
    "content": "for me it depends on the bass part, if the bass isn’t playing low fundamentals the low end might not be tight, for example a picked fast bass might sound more like a guitar in which I’ll use more low end in the kick or synthesize a low fundamental if neither instrument is doing a good job at it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032023535251628154",
    "author": "ALXCPH",
    "date": "2022-10-18",
    "content": "fellow guitar nerds look at this https://www.youtube.com/watch?v=fI3hn6VLnb0",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037480790025572393",
    "author": "peterlabberton",
    "date": "2022-11-02",
    "content": "@Zack Hames you wanna start a band? I’m on guitar, you’re on drums.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057065445221474304",
    "author": "Slow Hand",
    "date": "2022-12-26",
    "content": "I think the best thing you can do when learning a synthesizer is to pick just one or two and really take the time to learn them inside and out. There's so much overlap between the feature set and if you can get very intuitive with one synth you'll go so much farther.\n\nBack in the day I bought NI's *Komplete* bundle and it was just way too many new instruments too fast. Too many options. I never got to know any of them very well. Most synths have all of the same features that you'll want, but there's still a learning curve for every single one that you have to get over before you can be really expressive. I wish it were as easy as picking up a guitar or a horn where everything is standardized and lies in the same place. But that's part of what makes synths great: Their plasticity.\n\nNowadays the only synths I reach for (unless I need a very specific sound) are *Massive X*, *Razor*, and my Moog Sub 37. The first two are very different and don't share many features. I use the Moog when I don't want to be tethered to my computer. Limiting my available tools has been a net benefit for me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057706491232124989",
    "author": "BatMeckley",
    "date": "2022-12-28",
    "content": "To answer your question, I was probably referring to the source audio True Spring pedal, which is a great spring reverb. The flint isn’t terrible, it’s just not the greatest. But will totally get you by for gigging. The surfybear unit is great if you’ve got the space.\n\nI honestly just mostly use my actual silver face twin reverb if I want that drip, but Castelli brought up the other day that he’s less concerned about what type of reverb it is (hall plate chamber spring) and more of why he’s using it, which also might be something to consider",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079497504179093644",
    "author": "cian riordan",
    "date": "2023-02-26",
    "content": "I sold Annie’s PMCs to a studio in Glendale and they had a really trick patchbay setup for pedals… looked very slick and if I had lots of time and money I would absolutely set something up like that.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103331161616433294",
    "author": "Eric Martin",
    "date": "2023-05-03",
    "content": "posed the question because I just got tracks to “mix” that need lots of editing and it’s (to me) because the bass and guitar were cut outside of the drums and piano on a group that normally plays and practices live together in a room, Supreme failure IMO by not having everyone at the same time",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103375974957072535",
    "author": "hyanrarvey",
    "date": "2023-05-03",
    "content": "Like if you played james blake music with a live band the guitar player would probably quit from you telling them to stop playing untill that one chord at the end",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105818824885932192",
    "author": "Adam Thein",
    "date": "2023-05-10",
    "content": "Mine just arrived yesterday.  I’ve got a session coming up that I knew this would be great to have for keys, vocals, and guitar sounds.  It’s definitely a bit limited in scope to lofi world but lord almighty it does those tones with ease and sounds awesome.  And the saturation knob like Noah pointed out is really sweet sounding.  I’m not a guitarist but I was playing around last night with keyboard sounds and full mixes and it was very inspiring.\n\nI agree wholeheartedly that $400 is a lot for one pedal.  Factor in another $60 for their midibox if you want to have it connected via midi.  They do have CC control of every feature on the pedal including the hidden ones and an Ableton Max4Live plugin that allows you to recall settings and automate parameters.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105901031180742779",
    "author": "NoahNeedleman",
    "date": "2023-05-10",
    "content": "They took a great sounding Gtr pedal and made it more than just a Gtr pedal.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150097030333599925",
    "author": "Josh",
    "date": "2023-09-09",
    "content": "He’s defending JHS pedals rn",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203366769025097738",
    "author": "Edward Rivera",
    "date": "2024-02-03",
    "content": "Never using one mic for anything. Each drum shell gets a mic on both sides. Bass cabs and guitar cabs will get a \"high\" and \"low\" mic. Never using a 57 just because",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211307883720089680",
    "author": "Zakhiggins",
    "date": "2024-02-25",
    "content": "Late to the party with this one but the neural dsp Cory Wong guitar amp sim actually has some bass presets that slap in the right context. Incredible guitar amp sim also so lots of bang for your buck",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232769839903543326",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-04-24",
    "content": "Have u tried putting it on stuff that‘s not guitar?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256162829774360649",
    "author": "Nomograph Mastering",
    "date": "2024-06-28",
    "content": "Getting up close to real artists and seeing what actually matters is a real gift - “oh she sounds and feels like herself on a dinged up 58 with a borrowed guitar”",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258193941170491463",
    "author": "LAPhill",
    "date": "2024-07-03",
    "content": "Quick, the guitarist wants to change the part. Break out the 42 amps again",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1260718632632188980",
    "author": "Zack Hames",
    "date": "2024-07-10",
    "content": "Generally SM58’s actually have awesome isolation. I tried to be fancy and use RE20’s, 441’s, SM7B’s, and the SM58 was way more reliable with rejection and sounded good still. \n\nIf you’re doing vocals and acoustic guitar only, I love the figure 8 mic on both sources pointed to reject the other source. I’ll send a video;",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267201939356258457",
    "author": "Josh",
    "date": "2024-07-28",
    "content": "I’ve been trying to break out of my box with guitar. So instead of starting with guitar I’ll just find the chords and start with either piano or some kind of a bass and go from there. Been an easy way to kind of detour around the roadblock but not necessarily a great way to get better at my main instrument. 😅",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283904198349426750",
    "author": "LAPhill",
    "date": "2024-09-12",
    "content": "+1 for Noire. I received an advanced copy of the H&W pianos, which I also really like (and appreciate that there's a grand and two uprights). Between those two libraries, my bases are pretty much covered. Still, like guitar, nothing beats the real thing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284338455341695037",
    "author": "BatMeckley",
    "date": "2024-09-13",
    "content": "There’s two things going on here… one is the natural rub of harmonics that normally occur no matter the instrument, but there’s something specific that happens when you do chords like that pre-distortion, meaning the way an amp (or pedal) distorts that rub willl usually be different sounding than if you hit those notes on individual takes and THEN blended them together. I’d give that a shot (the aforementioned mutt lang one note at a time chord theory, which supposedly has been overblown, though I’ve heard guys like MUSE have explored it later on) before you go too haywire looking at dramatic eq moves or what not.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334279075656765491",
    "author": "Felix Byrne",
    "date": "2025-01-29",
    "content": "things start to get hairy when you're stacking tons of guitars and synths and stuff for \"impact\"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341058778136838174",
    "author": "cian riordan",
    "date": "2025-02-17",
    "content": "John Vanderslice’s Emerald City is interesting in that he did all the guitars with acoustics but they’re often heavy and distorted.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376692332916637731",
    "author": "Josh",
    "date": "2025-05-26",
    "content": "Aside from the writing process, because we’re not gonna wanna lose ideas to guitar tone chasing. But try to mix as you go. Don’t move onto the next instrument/effect/etc until it feels like it belongs intentionally. Or take little breaks to dial in the mix a little bit more. You’ll start finding that the patches, mic placement, etc aren’t hitting the way they should and most of your mix work can be solved at the source.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387837964440305857",
    "author": "cian riordan",
    "date": "2025-06-26",
    "content": "Another freebie is whipping the attack of the guitars and drums with a compressor on the downbeat",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387840836003430492",
    "author": "Edward Rivera",
    "date": "2025-06-26",
    "content": "Oooooh I get it now. I feel like a lot of the guitarists I’ve worked with and even myself have just sort of done that instinctually and never had to instruct it.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397242859203330201",
    "author": "NoahNeedleman",
    "date": "2025-07-22",
    "content": "Lots of ways to skin this cat. Try some shit see what excites you. But so far sounds like your guitars and piano are balanced, so the vocals will want to live in the middle. I wouldn’t be afraid of keeping them both there, one treated with a little more ambience or sauce",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1409976783603896431",
    "author": "Bryan DiMaio",
    "date": "2025-08-26",
    "content": "get a reamp box and use your guitar pedals as a creative tool, can even get multiple people moving the knobs of multiple pedals",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465778151551402005",
    "author": "BatMeckley",
    "date": "2026-01-27",
    "content": "It’s super common in orchestral scoring to ride two faders at once, 1) being the same cc as the mod wheel which controls the intensity of the instrument, 2) a cc that usually represents the overall volume of the instrument. So, on a dense score like that you’re going to get massive amounts of micro automation, almost as if you were mapping the vibrato on a guitar solo (x25 different instruments).",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469896211954929839",
    "author": "Eric Martin",
    "date": "2026-02-07",
    "content": "I have the Line 6 Helix Nstive plug and there’s a Fuzz Factory sim that’s pretty good in there. Woolly Mamm on Guitar also is so good, doesn’t spit as much but is good. Also mastotron & Fuzzollo are great spotty fuzz options, will it sound like the Beatles IMo",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937557545302757406",
    "author": "Slow Hand",
    "date": "2022-01-30",
    "content": "*Keyscape* has some fantastic sounding (and unorthodox) sampled keyboard instruments. That said I'm not particularly fond of the sound of it's LA Custom C7 grand piano. Which is a little too hi-fi for my taste.\n\nLately I've been very impressed by NI's/Kontakt's *The Maverick* grand piano. I believe it's a vintage Bechstein grand. The sound is robust and rich without all of the \"zing\" that I see in a lot of full-scale sampled grand pianos. It sounds \"woody\" to me. I think it would make for a very nice jazz piano.\n\nThey did a really good job of sampling every facet it and it has enough flexibility that you can dial in the really intimate Nils Frahm-style damper/pedal/mechanical noises, which I like.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957374226308947968",
    "author": "David Fuller",
    "date": "2022-03-26",
    "content": "Man I never noticed how much reverb is on the rhythm guitars in this.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957453360200548423",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "It's the difference between playing *Blackbird* by The Beatles with solo voice and acoustic guitar, versus arranging it for a big band or a symphony, or doing it as a gritty electronic dirge.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993888770581602435",
    "author": "Zack Hames",
    "date": "2022-07-05",
    "content": "Also, depending how vintage you want to get, what I’ve done in the past to “vintigify” is literally reamp out of my speakers into another mic - usually a ribbon or like a green bullet (going for really old sound) may help soften or make the sounds more real feeling.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996140577206841396",
    "author": "ALXCPH",
    "date": "2022-07-11",
    "content": "Im listening on my phone but all im hearing is a guitar and something like a lowpassed Juno maby? Try th me brass presets and lowpass them. Ill try headphones later its a bit Hard to hear when its so wide on my phone",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1008525759628968137",
    "author": "Zeuswayn3",
    "date": "2022-08-14",
    "content": "Cory wong neural dsp",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032034627449258064",
    "author": "GaspardMurph",
    "date": "2022-10-18",
    "content": "+100000 for the Avid Black Spring - Air Spring Reverb is great too and the spring reverb in guitar rig is pretty cool too. They almost always benefit from some eq’ing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032040300102811688",
    "author": "BatMeckley",
    "date": "2022-10-18",
    "content": "Flint I far prefer over the big and blue sky. Just works. Super useful pedal",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037562746557976576",
    "author": "peterlabberton",
    "date": "2022-11-02",
    "content": "I had my drums in the basement of the music building in college, and there was a classical guitarist who for whatever reason would practice down there in a hallway sometimes. He was just in there playing everything super slow and deliberately, and fucking ripped when I finally heard him perform. I always think of that when I’m in serious practice mode.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057707630929399968",
    "author": "BatMeckley",
    "date": "2022-12-28",
    "content": "The flint was hard to take off my board for years. It’s a really great pedal. The genius is that in most cases when people think they want “spring” what they really want is spring with some tremolo. Gives that old times sound and it’s so easy to get there quickly with the flint.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087635143902109786",
    "author": "stefanmacc",
    "date": "2023-03-21",
    "content": "Modular becomes a whole new monster once you grab yourself a strymon AA1 module… whole thing becomes a pedalboard / post processing tool. Use mine all the time on mixes for interesting reverbs / granular fx ect…",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105843115060891758",
    "author": "NoahNeedleman",
    "date": "2023-05-10",
    "content": "Think of it less like an expensive pedal and more like a great deal on an outboard vibe box. \n\nThe wow & flutter go from really subtle to downright outlandish, but always musical. And there’s a failure knob that you can automate for ends of phrases. Idk man, if you think of it as a lofi box I get that it feels expensive, but it’s more than than imo",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105852436565995591",
    "author": "Adam Thein",
    "date": "2023-05-10",
    "content": "Also FWIW their customer service got back to me within minutes when I realized I needed the Midibox for what I wanted to do and they refunded me my shipping on the midibox and made sure they got boxed together.  Got a reply quickly from both a customer service person as well as the shipping person.  That alone makes the $400 sting less to me knowing there are real humans ready to answer questions and troubleshoot.\n\nOne thing I wish I had noticed earlier is you can request for them to mod the pedal to not include a gentle HPF.  I'm not handy myself with soldering but there is a guide or they will mod it for you on request.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106097152234635326",
    "author": "NoahNeedleman",
    "date": "2023-05-10",
    "content": "This is how @BatMeckley records guitar parts:\n\nhttps://www.tiktok.com/t/ZTRKSLpE7/",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108504424286003330",
    "author": "Bryan DiMaio",
    "date": "2023-05-17",
    "content": "I did that on guitar to make like a bass-sounding loop for a song lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108833738089046036",
    "author": "BatMeckley",
    "date": "2023-05-18",
    "content": "I’ve been splitting the bass I’ve been recording with Kelen a lot lately between a DI with the 660, and another signal going through the HX Stomp usually that has an octave and sometimes some qtron ish shit on it. The qtron will catch different things than the di or the octaves. This kinda feels like that.\n\nThere’s also clearly a funky Cory wongy guitar chk.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134993364576637058",
    "author": "Nomograph Mastering",
    "date": "2023-07-29",
    "content": "I’ve often described here how I was a fairly shitty band mate in my youth. One of the dumbest things I can remember believing was that the chords (and hence my guitar playing) were the most important thing. I later came to realize that they were most often the *least* important thing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134994910525784104",
    "author": "Deleted User",
    "date": "2023-07-29",
    "content": "inner harmonies are more textural than functional, they exist to fill the space in the middle, but they can also take up too much space. key players and guitarists are guilty of this too often. no need for a 7 note voicing in a dense pop song\n\nBut chord “progressions” are also underrated in a sense that it really shifts the emotional context. you can really make a pretty significant difference by carefully crafting them, but also that doesn’t mean you need all the stuff in between bass and the main melody on every songs\n\ninstruments like chord stabs can serve the function of percussion and drive the rhythm. it’s ‘rhythm sectio’  afterall",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136021969490411591",
    "author": "Jeremy Klein",
    "date": "2023-08-01",
    "content": "\"room mic\" on distorted guitars",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155251789592018964",
    "author": "Skyler Young",
    "date": "2023-09-23",
    "content": "The sounds are from vintage synths (prophet 5, Jupiter 8, model D), a real mellotron, and Rhodes and wurli etc. - all the effected sounds are ran through a chase bliss heavy pedalboard",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156617945418575983",
    "author": "chrissorem",
    "date": "2023-09-27",
    "content": "I dig this https://www.critterandguitari.com/organelle-patches/k-loop",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168869803675619408",
    "author": "Deleted User",
    "date": "2023-10-31",
    "content": "And for everything recording I make sure I have it plugged in and ready to go before. Like having an allround mic like a 414 ready, a piano mic’d up (if I got one there), cables for bass and guitar near me and so on",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169717711522246746",
    "author": "Slow Hand",
    "date": "2023-11-02",
    "content": "I'll submit this example from Phil Ramone's *Making Records*. It's an anecdote from the pedal steel player on Bob Dylan's *Blood On the Tracks* about how Bob went about getting the performance that he wanted.",
    "reactions": 1,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1179918374675939410",
    "author": "gatewoodsensei",
    "date": "2023-11-30",
    "content": "I’m not sure if this’ll help, but I tend to go with whatever hits me at the time. If it’s a melody, I’ll sing it, mumble words, and allow the music to form around that idea. If it’s lyrics, then i grab a guitar or sit in front of the keyboard and play the accompaniment. Or if I’m in front of my computer, and melody line hits, I’ll play the melody, or chords and allow it to loop while I write. So I don’t necessarily balance, because to me that means I’m shutting part of my creativity off i order to allow the other part to flow, and more often than not, that kills the creative flow. \n\nSo don’t try to balance anything. Whatever you feel, go with that and allow your creativity to flow.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183509277810372688",
    "author": "Adam Thein",
    "date": "2023-12-10",
    "content": "This is probably repeat info but I like to split the audio between transients manually then use the Shift+Option+Command (on mac) combo and click drag the audio to slip the audio within the clip, then slice the next transient and you can get into a flow pretty fast and manually slice up an entire take pretty quickly.  Multimic sources like drums I do the same thing but with the \"Link Tracks\" option.  Can usually fly through a full song pretty quickly.\n\nEspecially for acoustic guitars, drums, and vocals that are super sensitive to warping this is usually my method in Ableton.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185101259666112564",
    "author": "BatMeckley",
    "date": "2023-12-14",
    "content": "The little repeating four note lead line when it gets all pretty might be the most efficiently beautiful guitar work I’ve ever heard. And the intro is SO heavy. And also kind of… funny? Just seems fun to experience live. An all time underrated gem for me. Ranks right up there with the best of Jane’s Addiction for me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185111564504793138",
    "author": "spectrummasters",
    "date": "2023-12-14",
    "content": "😂👌🏼 well played.    . @BatMeckley ….gotta say , the lyrics on my wave could not more perfectly articulate my feelings about how people should respect each others view . Sound garden were THE shitttttt! Anyhoo , to what you said about production and feel Matt,  and as ruairi reminds us here so often (dont lose the feel in the search for the sonics ) ……and picking up on what @edward Rivera said in the mixing channel the other day , these days out of my studio and on the construction site are giving me time to really reflect on my studio work and what I’ve achieved , where I’ve got to and what really matters moving forward . It’s been revitalising to take pay out of it for a mo . The last payed work I did I returned a couple of grand to get out of the band war the project had turned into and looking at the new year I feel like I only want to work on things that offer rhe potential of something really unique ….and really speak to people “on their waves 🌊 “ . If it’s about one acoustic guitar and a simple vocal I’m doing it . I’ve an artist who’s ready to leave formulas behind and go on the journey with me ….who knows maybe I’ll even find a place for a bagpipe like AC/DC managed to pull off !",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189091514849169418",
    "author": "Deleted User",
    "date": "2023-12-25",
    "content": "Yeah. Also one other thing I’ve learned is that a guitarist could learn time on the picking hand but it can collapse once pick up another instrument. And that’s because time was only taught to the picking hand. Being able to internalize it through the whole body is my current goal. Bending legs or moving the whole body as opposed to just tapping one foot or moving my head back and forth. This may be a weird territory, but I feel the time from all the way down the navel when I feel locked in. But all of that can also collapse immediately once I start thinking about it. So visualizing clicks as my navel lighting up is something I am adding to my practice these days. \n\nI don’t really play drum sets but I’ll do a paradiddle every now and then to teach myself how to coordinate the timing between two arms",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189093646843248763",
    "author": "Deleted User",
    "date": "2023-12-25",
    "content": "Another thing that I found for myself - and this may not have anything to do with you\n\nI spent a long time with my instruments (relative to my age and short years lived), but I didn’t spend a long time ON my instruments. Which led to self doubt on my chops. \n\nThe self doubt was actually more detrimental to my timing than the lack of practice itself. But the self doubt was brought on because I didn’t spend enough time practicing my instrument and maintaining a healthy relationship with my fingers and the guitar. I’m still with a tons of self doubt but I am learning that as long as I’m working on the right things, practice won’t betray me. What I put in comes back out, and I had a weird relationship with that for a long time because I would work on a lot of wrong things and spend a long time doing that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191794469708771498",
    "author": "Deleted User",
    "date": "2024-01-02",
    "content": "JOYO Pedal AC Tone. $40 pedal but it is actually pretty good probably one of the next best options after the real thing. My favorite thing about it is its EQ and pre drive Mid EQ (the voice knob). The only downside is that you can’t turn off the cab so you’ll be stuck with one cab. But I saw some people on reddit modding them to have a switch that bypasses the cab",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194257422378876978",
    "author": "Karim",
    "date": "2024-01-09",
    "content": "A trick I’ve used is for a similar effect is micing the electric guitar itself while you strum it, and mixing that in to taste.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202659467766800395",
    "author": "LAPhill",
    "date": "2024-02-01",
    "content": "I keep one of my guitars in Drop C already, so I'm not far off..",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222002919230935121",
    "author": "Jonathan Jetter",
    "date": "2024-03-25",
    "content": "I had really good luck recently w/ ElastiquePro, but you can't trust the commits to be flawless, have to check them meticulously and/or print in real time to new tracks. One caveat: I was dealing with synths + electric guitars. No idea if it works as well w/ complex acoustic sounds.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244770335489003654",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "Although I've always wanted Soundtoys to turn Decapitator into a guitar pedal.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248268884130267197",
    "author": "Josh",
    "date": "2024-06-06",
    "content": "Preamp distortion on DI guitars has been something I’ve messed around with for awhile and this record and Mk.gee only made it worse hahaha",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255913886306140304",
    "author": "popaganda.",
    "date": "2024-06-27",
    "content": "It’s just fascinating to me that what was “gatekept” in a Tony Berg production was a filter/saturation plugin, rather than DADGAD, baritone guitar, rubber bridge, lyrics that mean something",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256032036120956928",
    "author": "Dereck Blackburn",
    "date": "2024-06-27",
    "content": "The Buxom Betty is one of my very favorite amp sims and takes pedals really well!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256453228724486154",
    "author": "NoahNeedleman",
    "date": "2024-06-28",
    "content": "It’s my cheat code for making scratch guitars keepable.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1279391284720832563",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-08-31",
    "content": "Maybe some rl bluesy side guitar with lots of blue notes?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280177169024155762",
    "author": "Adam Thein",
    "date": "2024-09-02",
    "content": "You are looking for something that can do what Chase Bliss Thermae pedal does in the box?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312948441701421186",
    "author": "Nomograph Mastering",
    "date": "2024-12-01",
    "content": "I had a day dream once where all samples were sent to different monitors, speakers and guitar amps. Positioned as per a drum kit and then mic’d up as normal in a good room",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318652679282495512",
    "author": "Brian Reynolds",
    "date": "2024-12-17",
    "content": "It could have chorus and or flange on it as well. Maybe an envelope filter pedal. But what I think you're reacting to most is the wah wah pedal. An expression pedal. And the guitar player is playing the pedal at the same time as the guitar. I don't know anyways to recreate in plugin form",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339796890656571433",
    "author": "Brian Reynolds",
    "date": "2025-02-13",
    "content": "I've reached the point of my journey where I'm stacking a second buried white noise guitar feedback in the chorus for vibes and glue",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341131650779713568",
    "author": "kieronmenzies",
    "date": "2025-02-17",
    "content": "The tastefully overcompressed sound of Johnny Cash IV has always been a huge influence on my acoustic guitar recording and mixing instincts https://open.spotify.com/album/2BlL4Gv2DLPu8p58Wcmlm9?si=IcEBCBNZTUaxfTTpJLwVog",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1344422946692665465",
    "author": "Slow Hand",
    "date": "2025-02-26",
    "content": "Sounds like the variation from double-tracked guitars that are panned hard L/R.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387838115686649887",
    "author": "cian riordan",
    "date": "2025-06-26",
    "content": "And raking the strings on guitar on said downbeat",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411115751489667093",
    "author": "onanisland",
    "date": "2025-08-29",
    "content": "mixwave pedals or 286/70s, p42 climax, goodhertz tupe, etc all ZL, soundtoys near zl too.\n\nthat SAULT sound sounds like a driven parallel amp and space echo reverb",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1445559690913255495",
    "author": "Will Trotman",
    "date": "2025-12-02",
    "content": "For anyone looking to ~take the edge off~ their acoustic guitar recordings, I’ve had my main acoustic in D standard (just down a whole step) recently for that purpose and it’s been working wonders",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465749034231660556",
    "author": "LAPhill",
    "date": "2026-01-27",
    "content": "I can't quite put my finger on why this bugs me, but it feels somewhat disingenuous. Akin to \"remember that you don't have to play every guitar note with exactly the same dynamic.\" The \"automation\" he's turning off is part of the performance, riding modwheel/expression and maybe other things, which is somewhat, but not completely, separate from automation during mixing. But content creators gonna content create.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469848630734229738",
    "author": "Slow Hand",
    "date": "2026-02-07",
    "content": "Savoy Truffle, for the Beatles guitar tone you're trying to think of?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469850810748899555",
    "author": "Slow Hand",
    "date": "2026-02-07",
    "content": "Generally speaking, these are all fuzz pedals with a hard gate and pulse-width modulation. I'm not the biggest fuzz aficionado, but Zvex Fuzz Factory (and Woolly Mammoth for bass) are gonna do this spitty lazer beam fuzz really well.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469874209227280494",
    "author": "sethearnest",
    "date": "2026-02-07",
    "content": "I could be wrong on that specific Beck example, but this sort of guitar fuzz sound always makes me think DI guitar into a cool pre fully futz'd out (which is my understanding of how they got the \"Taxman\" guitar solo sound -- straight into a console, maxed out).\n\nI've also always loved on that Beck tune how the vocal isn't centered.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469942282022289539",
    "author": "BatMeckley",
    "date": "2026-02-07",
    "content": "3 possibilities to me: Console distortion. Go direct and just on the gain knob. Or, pig nose amp. Or, one of those guitars with the built in speaker, dying battery,",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470003555590213723",
    "author": "Ross Fortune",
    "date": "2026-02-08",
    "content": "Killer, thanks Matt. The only pre I have to hand atm is a Neve 1073LB. It sounds cool when I’ve dimed a gtr DI on it, but not quite like that tone I’m after. Going to pull up some plugin emulations and see what I can cook up. \n\nThe dying battery thing made me think of the power sag feature on my voodoo labs pedal power supply. Found this dude power sagging different fuzzes - the Octa Hive pedal around 12:15 could be kind of close to the tone from that Blake Mills / Pino ref. So much cool shit to explore https://youtu.be/MlAWosDHwRE?si=CAzZodxq-duu4Zu1",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470073166771781887",
    "author": "hyanrarvey",
    "date": "2026-02-08",
    "content": "It sounds like phaser pedal before a fuzz pedal",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470916974258163804",
    "author": "Ross Fortune",
    "date": "2026-02-10",
    "content": "What they said 👆🏻 \n\nCould also be an element on an upbeat to bring the head back up after it nods on the downbeat. If the head nods to a four on the floor kick pattern, the hi hat on the 1/8 notes in between brings it back up. Guitar upstrokes in reggae. That kind of thing?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "938546547522670612",
    "author": "Zakhiggins",
    "date": "2022-02-02",
    "content": "Any tips on funk guitar and making it sound good? It always sounds good when other people do it but I find it hard to not make it sound annoying",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "938559341827612702",
    "author": "Zakhiggins",
    "date": "2022-02-02",
    "content": "@cian riordan @Zack Hames how are you guys typically dialing in attack and release on that kinda guitar?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954162459013423134",
    "author": "Josh",
    "date": "2022-03-17",
    "content": "Late to the party but literally all you need is the Arturia collection and then a solid soft synth like serum or pigments. I literally only have serum, pigments, arturia collevtion, and then a few other like guitar or bass VSTs and I have yet to want anything else.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "965743741639991348",
    "author": "1ggy",
    "date": "2022-04-18",
    "content": "What are your guys go to production techniques for chords/melodies if you're not a pro on keys or guitar? Mine for example is using Scaler as a midi instrument, finding a cool progression or pattern and then messing with the midi. Or, finding a cool sounding melody in Splice and then using Pitchmap and/or melodyine to get it in the correct key and chopping it up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "992526465650409602",
    "author": "Rollmottle",
    "date": "2022-07-01",
    "content": "it's a phenomenal writing tool. i write melodies on bass because it puts me in a different zone than guitar or even keys...great way for me to capture ideas without being tied to the instrument i'm writing on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993882997189263520",
    "author": "delwin",
    "date": "2022-07-05",
    "content": "any tips on making Kontakt horns & strings, drum samples, bass guitar, etc. sound like the 70s? working on a period piece for a client. I'm usually doing more synthpop / electro pop but this one they want to sound like an early 70s disco piece. Humanizing the horns & strings is particularly difficult.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998800702929379458",
    "author": "1ggy",
    "date": "2022-07-18",
    "content": "Ohh ok nevermind. Looks like psa 2 is a preamp.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1004274081824252006",
    "author": "BatMeckley",
    "date": "2022-08-02",
    "content": "Honestly? Mostly because it’s just how I’ve always done it. I like to comp, print a two track instrumental, drop all of the vocals into melodyne, tune, sometimes time, sometimes de-ess, oftentimes re consonant words. I’ve got all my key commands etc dialed in standalone so I’m just much faster on it. Plus I like to commit things to tape (same way I like to often tack guitar with verb and delay etc).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1008496764652888204",
    "author": "peterlabberton",
    "date": "2022-08-14",
    "content": "Any recs for good jazz chorus amp sims?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020805692094947358",
    "author": "Zack Hames",
    "date": "2022-09-17",
    "content": "I asked a similar question a while ago, and @oaklandmatt had a great answer basically to the effect of: \nSomething rushing ahead adds energy or anxiousness (a punk bass line or fast trap hihats, maybe a rock guitar solo)\nSomething late adds groove/swagger (Lofi hip hop snare, a lazy vocal, a funky bass line)\nI think that’s a really cut and dry way to view it; but what you said obviously applies, every context is different.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020824609920135178",
    "author": "cy (sigh)",
    "date": "2022-09-17",
    "content": "yeah its very case by case. as far as groove in relation to other elements. I've had guitars recorded loosely toa click and worked the groove around that - lining up the downbeats of the drums/bass  with the guitars even if it's a bit early or late. that was for a more indie type of joint. and for something more trap /modern hip hop, I've nudged bass notes or samples to get them to either sync w drums up for impact  or nudge slightly off to hype of of pull back the energy in the groove. \n\nas far as programming. I'll play with forward swing and dragging notes a lot if I'm going for a more real/dynamic feel when programming. keeping in mind that if the goal is trying to stay \"on time\" any fwd swing that might happen at the start of a phrase will be compensated with some drag  after or vice versa.  keeping velocities in mind w drum hits + linking it to a filter env so that harder hits have more high end and softer hits end up a bit rounder.\n\nadding subtle layers that are similar   to the main drums but occupy a different texture or tone  in dif  sections to thicken up the groove or automate the attack /sustain of certain elements thru diff sections to help shift the listener  focus throughout",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031701602270195723",
    "author": "GaspardMurph",
    "date": "2022-10-17",
    "content": "I love keyscape but I also find it to be super buggy with sustain pedal and release samples stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032029354827468881",
    "author": "ALXCPH",
    "date": "2022-10-18",
    "content": "agreed, the hardware pedal, is so dope",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032029550382682215",
    "author": "Zakhiggins",
    "date": "2022-10-18",
    "content": "Oh shiiiit I love this pedal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032046606175965305",
    "author": "cian riordan",
    "date": "2022-10-18",
    "content": "Very rarely. Usually if I just run outa gas with ideas in the box, I'll look to pedals or outboard units to just spice things up and help me commit to something. But this is like 3-5% of the time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032080746589990942",
    "author": "BatMeckley",
    "date": "2022-10-18",
    "content": "The spring is not the best feature of the flint tbh.  If spring is what you really really need there are better options. But as a whole it’s a fantastic pedal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032082016356794368",
    "author": "ALXCPH",
    "date": "2022-10-18",
    "content": "Have you ever tried the Carl Martin Headroom spring reverb pedal? They are made where I am from. I think they are pretty cool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033881551424995339",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "The sp404 was incredibly fun and almost gameboy-esque. That quality was really valuable. Roland has a whole showcase at guitar center right now, I think. It also went very seamlessly into a lot of lo-fi/formant heavy editing that I love to do with samples. \n\nI also made a pit stop to hardware synths. I love the korg units. I want to explore hardware synths because I feel like the tactile nature might actually teach me to be more creative than my digital synths.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037481151687819304",
    "author": "peterlabberton",
    "date": "2022-11-02",
    "content": "Yeah—I’m 34, dove deep on drums from, I dunno, age 12-20. Picked up bass in high school, got good in college. Only started playing guitar to a level that felt passable 2-3 years ago. (Honestly COVID was great for that.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1045819429033877597",
    "author": "gatewoodsensei",
    "date": "2022-11-25",
    "content": "Idk how I'm just now hearing this. This is the single best demo of a plugin I've ever head in my life. Good Lord. Neural DSP FTW\n\nhttps://www.youtube.com/watch?v=bjMI8oA1RGU",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057701529806700645",
    "author": "Zack Hames",
    "date": "2022-12-28",
    "content": "Reviving a super old post...what spring reverb pedals do you recommend? My big sky is taking a specific role away from guitar and i'd like to get a reverb pedal dedicated to my guitar pedalboard - I usually use spring or plate verb on guitar. I was thinking Flint but you said there is something better.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057702853013143603",
    "author": "hyanrarvey",
    "date": "2022-12-28",
    "content": "That reverb pedal rules",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057703271873130546",
    "author": "David Fuller",
    "date": "2022-12-28",
    "content": "Hmmm I'm not too versed in reverb pedals but I swear there's something that has a pretty good algo of an accutronics tank",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057703612823916666",
    "author": "Zack Hames",
    "date": "2022-12-28",
    "content": "I also like V simple pedals. I don't need a \"ambient reverb sound engine\" with 300 modes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057706916685561929",
    "author": "Zack Hames",
    "date": "2022-12-28",
    "content": "That makes sense. I've got a fender twin and it's hard to beat - but I am running this marshall JMP and wanting something more for live / a committed rig. Going for more live than studio, or perhaps writing if that makes sense.\n\nI have heard the surfy bear is amaaazing. I'll check out the source audio true spring pedal. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057707077218349136",
    "author": "Zack Hames",
    "date": "2022-12-28",
    "content": "and honestly the flint might be just the thing - I could use an upgrade trem too, and all in one pedal, pretty awesome.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062038160701390908",
    "author": "Zack Hames",
    "date": "2023-01-09",
    "content": "Yeah dog, program that shit. \n\nI am probably shooting myself in the foot but I do not like using loops. Feels yucky. But I come from “rock guitar” background so take with a grain of salt.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062043769979023401",
    "author": "Zack Hames",
    "date": "2023-01-09",
    "content": "That’s impressive, I was working out of my home studio exclusively for….a long long time. It took me probably a year to get comfortable in an studio outside studio again. Like just feeling confident. I got so used to my speakers, my preamps, even my mic stands.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062165427700121630",
    "author": "conor_i997",
    "date": "2023-01-09",
    "content": "Any producers ever have issues with their nails when switching between guitar and bass? For fingerpicking on guitar they need to be longer but for bass they usually need to be shorter. Kind of annoying lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062166223443476502",
    "author": "popaganda.",
    "date": "2023-01-09",
    "content": "Classical guitarist background......Basshead. I've done years with and without nails. There's a perfect length where you can miss the nail on bass and catch it on guitar, but its a pretty hard thing to \"nail\"  😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062183289907073095",
    "author": "jonmatteson",
    "date": "2023-01-09",
    "content": "Yeah my nails are long even when cut as short as I can so I’ve always had to play thumb palm muted bass or picked. Sounds great for guitars tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062236021611307068",
    "author": "Will Melones",
    "date": "2023-01-09",
    "content": "Playing bass with your thumbs? What is wrong with you guitar players",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065655460696445068",
    "author": "ALXCPH",
    "date": "2023-01-19",
    "content": "I've recently been tasked with making a bunch of guitar loops for a bunch of local hiphop producers(not a lot of local guitarist in that niche). Not a game i have particularly lots of experience with. \n\nAre there any rules or standards as to sending out the same loops to multiple producers? it would be a shame to send some melodies to one producer that never uses it and not giving someone else the chance to use it. \n\nI've seen multiple producers use the same Cubeatz loops. so i'm guessing its somewhat fine? also would the same loops in two different beats still count for a 50/50 royalty split for both beats? \n\nany insight is appreciated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069005017345957988",
    "author": "Slow Hand",
    "date": "2023-01-28",
    "content": "I've always wondered about a move that they pull in this Murray Head song. During the chorus @ 1:08-1:30 there's this effect where all of the depth gets sucked out of the track and it becomes super present. What is that? As far as I can tell they're muting the string pad and guitar, but it also sounds like they might be muting all of the effects returns so that it dries up.\n\nhttps://open.spotify.com/track/6erBowZaW6Ur3vNOWhS2zM?si=cd755dcd108f4583",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069551933922226306",
    "author": "spectrummasters",
    "date": "2023-01-30",
    "content": "Apologies if this has been said before/I’m probs v late on this...but I’ve just realised )after years of using logic remote app when I’m tracking my own ac guitar parts)...logic remote has a whole soundflow type function with multiple comprehensive pages of pre-made macros for editing/transport/mixing   . On an iPad this is like a whole soundflow/stream deck setup for free on logic Who knew?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078139467891748874",
    "author": "Deleted User",
    "date": "2023-02-22",
    "content": "I hear you though, if I had 5-600 bucks to spend on a piece of gear- I could get another guitar, p bass, or a microphone that I’ve been eyeing on for a bit and that would yield better results",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079444029726539876",
    "author": "NoahNeedleman",
    "date": "2023-02-26",
    "content": "Alright guitarists:\nY’all like amp distortion over pedals? Also what’s your fav fuzz box?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079445742705459341",
    "author": "David Fuller",
    "date": "2023-02-26",
    "content": "amp over pedals for most things yes; what kind of fuzz sound are you after?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079449121661911091",
    "author": "NoahNeedleman",
    "date": "2023-02-26",
    "content": "Well shit idk. Something vintage & vibey? I’ve got a Vibrochamp that sounds pretty menacing when I pin the knobs and roll off the tone on the guitar. But can’t always play at that volume with the home stu setup",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079452498672242748",
    "author": "David Fuller",
    "date": "2023-02-26",
    "content": "I mean I'm sure they exist, I'm no pedal fiend",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079459238566428732",
    "author": "hyanrarvey",
    "date": "2023-02-26",
    "content": "Nah, but its hard to beat a bunch of bad ass pedals infront of a bassman",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079459613004533991",
    "author": "ALXCPH",
    "date": "2023-02-26",
    "content": "sidenote, most fuzz pedals love a turned up amp, so not sure its gonna help with your volume problem. 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079496137846825121",
    "author": "Deleted User",
    "date": "2023-02-26",
    "content": "What’s your workflow for trying out different pedals? unplug and swap or patchbay on already patched pedals? \n\nI’ve never ever seen anyone use patchbay for it btw, I was just wondering if that is a thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079497338810290197",
    "author": "cian riordan",
    "date": "2023-02-26",
    "content": "My workflow is usually 4 guys sitting around staring at me while I quickly rifle through pedals, swapping, auditioning until we get something cool and get to tracking.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079757799199879198",
    "author": "chris_donlin",
    "date": "2023-02-27",
    "content": "I’ve been very interested in using a patch bay just for pedals cus I’m always swapping them around. It’s annoying as hell",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081692324867887214",
    "author": "thejadenmejia",
    "date": "2023-03-04",
    "content": "Hey producers, I’m a rookie when it comes to production as a whole. Im trying to get a specific guitar sound.  I have some references along with what i recorded. Anyone mind helping me out for a minute 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081697551864057857",
    "author": "hyanrarvey",
    "date": "2023-03-04",
    "content": "Well the july one sounds like m/s guitars and yours sounds mono\nAnd the kid laroi one is double tracked and panned from what i am picking up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081700293835763813",
    "author": "popaganda.",
    "date": "2023-03-04",
    "content": "there's more body in the guitar in those songs, so find a position that picks up a little more lowend, but not so much that its too boomy or woofy",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081711231502647306",
    "author": "thejadenmejia",
    "date": "2023-03-04",
    "content": "Thanks you guys! I’ll try positioning the mic a little closer to start off. I already double tracked the guitars on the clip I sent. But yea, mine is definitely missing body. I’ll keep trying till I get it down. 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087434656917495918",
    "author": "LAPhill",
    "date": "2023-03-20",
    "content": "I could see a world in which I set up a modular effects station, or pedal-board type setup. That sounds like a lot of fun.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087438971501564005",
    "author": "Rollmottle",
    "date": "2023-03-20",
    "content": "at the risk of blatant self promo, i wanted to be the opposite of the modular stereotype and actually channel the modular into listenable music instead of just wild noise. it's all over 2 of my records, a lot on Fear Ritual and The Obsolete Man and less so on my third It's a Miracle We're All Still Alive, but it's there as a foundational textural element on all three. tuning guitars sharper and flatter to be in tune with wonky oscillators and modulations is challenging, but lends to a weirdness i'm a fan of. https://sentrall.bandcamp.com/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090699921197375619",
    "author": "hyanrarvey",
    "date": "2023-03-29",
    "content": "@BatMeckley rocking the 414 buls on guitars in fig 8 today in honor of you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090700121324392560",
    "author": "hyanrarvey",
    "date": "2023-03-29",
    "content": "Doug used the c800 not g on guitars so i am very tempted",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091389636439453786",
    "author": "Jeremy Klein",
    "date": "2023-03-31",
    "content": "just want to shout out that the Neural DSP Tone King Imperial amp is probably the greatest sounding amp sim ever made.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095790817949520026",
    "author": "Deleted User",
    "date": "2023-04-12",
    "content": "Is it okay to replace guitar parts on “a singer with guitar”’s records? They’re pretty out of tune, performance is acceptable and there’s certain aspects of the performance that feels great that I don’t think I’ll be able to recreate, but the performance overall is not very good",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095795870974365706",
    "author": "Deleted User",
    "date": "2023-04-12",
    "content": "It’s an indie project I’m doing on spec. I’m basically doing everything as a producer except songwriting and recording. Creative direction wise- it’s pretty flexible but I’d rather not deviate too much from “singer with a guitar” world and both the artist and I are on the same page about that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095799218272223232",
    "author": "Deleted User",
    "date": "2023-04-12",
    "content": "I think I would have normally just replayed the parts and send it, but let them know I replayed the part for ________ reason and I'm down to set it back if the artist doesn't want it. \n\nBut the thing is that this is a \"singer with a guitar\", and the other thing is I'm trying to finish my in progress projects so I can take the break that I need and be able to pace myself in the process so I don't end up burning myself out further. Weirdly I wasn't getting new projects when I needed them and I am now getting them after deciding to take a break 😂 \n\nBut my experience with polyphonic melodyning is that it doesn't really work with strummed acoustic guitars, so I think I'd probably still have to try replaying the parts.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095820598464225331",
    "author": "Edward Rivera",
    "date": "2023-04-12",
    "content": "I've had guitar players allow me to play a part I showed them, after a few takes where they couldn't get it right, then deferred to me. I was lucky to have the luxury of time and no one breathing down our backs to spend those moments with the band (the people I care about) until they threw there hands up and said \"do you just wanna do it ? It's fine by us\" and I felt that time and respect continued to forge our bond",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095821269892612126",
    "author": "Nomograph Mastering",
    "date": "2023-04-12",
    "content": "(Also I was a better guitar player than any of my clients for probably 10 years and fucked up in this way far too often)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095821731542863922",
    "author": "Edward Rivera",
    "date": "2023-04-12",
    "content": "I guess I was more in contention with the first reply @Deleted User received, not marv themself. \n\nI like to believe that trusting the guitar player to execute an idea I had run by them was a positive experience because I presented myself as a collaborator and not an arbiter",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095826336527962112",
    "author": "Nomograph Mastering",
    "date": "2023-04-12",
    "content": "I was too identified with the work, so their janky guitar reflected on my ego Trump style",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095868511215161435",
    "author": "Deleted User",
    "date": "2023-04-12",
    "content": "does the artist ever wonder “what happened to the guitar parts?! something is just not right”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099746540651823155",
    "author": "BatMeckley",
    "date": "2023-04-23",
    "content": "Big big fan of that pedal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103385337255956611",
    "author": "LAPhill",
    "date": "2023-05-03",
    "content": "For many, it's about efficiency. It's quicker to grab a Splice loop, load up some samples, to edit the guitar instead of retracking. Which comes back to showing people a better way - working with artists and showing how much better it feels when a real drummer plays that same hi hat pattern. The nuance of working with a brilliant session guitarist. Everyone should have the experience of that, spend the money to splurge once, and see if they hear it, or if it resonates with them. And it doesn't necessarily take that much longer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105573667389321286",
    "author": "Adam Thein",
    "date": "2023-05-09",
    "content": "Are you talking about Softube Saturation Knob?  or the saturation knob on Generation Loss Mk2 (the Chase Bliss pedal)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105760141237833819",
    "author": "Ross Fortune",
    "date": "2023-05-10",
    "content": "I’ve been using a memory man 100% wet (tightest delay, no feedback) to generate wonk with the chorus. It’s a cool sound, but quite specific and limited.\n\nDefinitely want to add a dedicated wonker to the board, but by jiminy $400 seems spenny for a single in-production pedal! Guess that’s the world I’d be getting into?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105852642162397385",
    "author": "NoahNeedleman",
    "date": "2023-05-10",
    "content": "I want to own all of their pedals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108830050163372132",
    "author": "NoahNeedleman",
    "date": "2023-05-18",
    "content": "I would be VERY surprised if it was programmed. Honestly it sounds like the same guy played the bass and then played the same part on a guitar",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108838325088956578",
    "author": "Adam Thein",
    "date": "2023-05-18",
    "content": "The stuff on the left that sort of sounds like a guitar sounds like string noise to me - like it was played on a short scale with rounds and the low end is ultra crazy rolled off and compressed to hell and run through a pretty stable chorus like a dimension D type thing (pulls right slightly to me) and then the stuff high end is through an auto-wah that is chorused out in the opposite way, but the slides in those little moments where you can hear them seem too perfectly tracked against the low end to be a double to me, and it sounds like bass-octave stuff but the harmonics of it to me rather than a separate guitar layer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108925679187271770",
    "author": "Deleted User",
    "date": "2023-05-18",
    "content": "the high stuff sounds more like a bass with wah on it panned to left or guitar lowered by an octave doing the same stuff. Sound more like a guitar lowered by an octave by the tone. \n\nThe low stuff is probably tone knob all the way down compressed real hard. It sounds more like J than P to my ear",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108926368567275530",
    "author": "Deleted User",
    "date": "2023-05-18",
    "content": "Or could be a surprise and both are guitar and lowered by an octave below.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1118264508448788521",
    "author": "Slow Hand",
    "date": "2023-06-13",
    "content": "Sounds like a pretty simple synth patch with some heavy vibrato that’s being processed through a guitar amp or a similar tool. There may be a little bit of glide time between the notes, or they achieved the gliding with a pitchbend wheel. Either route will get you there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1118273630229512213",
    "author": "lystell",
    "date": "2023-06-13",
    "content": "I think it's a guitar when I listen more but I got pretty close with a synth patch, saturation, leslie and chorus",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123446174188314734",
    "author": "Deleted User",
    "date": "2023-06-27",
    "content": "Some examples I’m thinking of is anything from Tropzilla and Alabama Shakes - don’t wanna fight. On the latter the guitar parts are pretty simple, one main guitar doing longer chords and the other one doing single note rhythms.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136022993554903110",
    "author": "Edward Rivera",
    "date": "2023-08-01",
    "content": "It's not going to work on a Djent track. And it helps if the guitar doesn't play all the time (good luck with that one)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136043344833806346",
    "author": "Eric Martin",
    "date": "2023-08-01",
    "content": "I love that and use it often actually, it can make you guitars feel like they’re panned outside of the speakers if used right",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141945556684505179",
    "author": "NoahNeedleman",
    "date": "2023-08-17",
    "content": "DP is difficult period. \n\nI agree with you on every point here, philosophically. In pure defensiveness, I did the record with Kaplan and I remember hearing JF’s version and thinking 2 clicks faster, guitar performances are looser (not in a good way,) and sonically slightly different but not “better.” \n\nBut I digress; it’s beside the point and honestly without going back and listening to them both now who fucking knows if I was right. \n\nLong story short: I agree with you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142093628546760766",
    "author": "Deleted User",
    "date": "2023-08-18",
    "content": "So on tiny differences- I’ve seen you talk about this here every now and then. But at what point does it matter and at what point does it not matter? \n\nDoes it really matter whether I used Warm47 or real 47 if it does its thing and makes you feel things? And does it really matter to care about things like that if it costs so much more to get a real 47, if it does then at what point does it start becoming a worthwhile investment other than for a self satisfaction? \n\nI’m in the camp of just buy a sub 1k mic/guitars that does its thing. 1 - because it would be a ridiculous decision to spend more money than that with what I make now 2 - It’s case by cases but a lot of times when I hear comparison it’s not really a matter of “it’s better” but more so it’s exactly that thing or that sound we know and like. I’m sure there is value in that, but when does that become actually valuable and when does it become just trivial difference?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150864823551266957",
    "author": "stevestmartin",
    "date": "2023-09-11",
    "content": "The same way you don't have to learn to play drums, piano, guitar, or sing, etc.. digital audio has opened up a world to non player musicians to focus on the part of music that interests / excites them most. AI I think will create new styles/ideas as the interface artists use to express their musical ideas becomes less technically challenging.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155587424643186729",
    "author": "Skyler Young",
    "date": "2023-09-24",
    "content": "And better/more modern effects - the vibrato is based off the shallow water pedal and can easily give you cassette sounding wobble or nice movement that people usually do in like rc20 - but because I do it in the audio samples instead of just the incoming buffer you have a lot more freedom (and It has different vibrato movement per voice)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156055184238190633",
    "author": "Trolligator",
    "date": "2023-09-25",
    "content": "@Skyler Young btw i made this piece of garbage with your keys plugin today. everything that isn't an acoustic guitar in this is from your plugin which was just an absolute joy to use. there's a pad sound, a piano, a wurli, a soft pluck thing, and a guitar patch played super low masquering as a bass.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1156615780230774824",
    "author": "Adam Thein",
    "date": "2023-09-27",
    "content": "What sort of toys/gear does everyone like to travel with?  I’ve been slowly trying to buy a few unique pedals and percs but wondering if anyone has anything they’ve found really inspiring.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1158036921495330858",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-10-01",
    "content": "In this case it was a bunch of timpani rolls I wanted to sound like one big roll but I‘m curious in general what you guys use on drums, guitars, synths etc if you do that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161013243263848539",
    "author": "xico1702",
    "date": "2023-10-09",
    "content": "Hi folks! Hope you're doing great! I want to ask you something. My name is Francisco, from Portugal, I'm 23 years old and I'm a self learner about music theory and music production. I know how to play piano and strumming acoustic guitar a bit. I started to using a DAW in my 14s (FL Studio, yeah I know xD) and in the last 3 years I've been using Logic Pro and last months Pro Tools (just for editing and mixing).\n\nI love to produce electronic pop with a mix between synths and acoustic instruments. I want to be more versatile and confortable producing other genres (genres that I can produce just in my bedroom studio without having a great recording gear). \n\nI'm feeling stuck, I'm trying to listen different genres. I'm feeling very limited because I don't have a great background as a music player or student (my bsc is physics engineering). The music industry is tough and I want to be more confortable to work in other genres.\n\nI tried to be as brief as possible. What advice do you have for this situation? If I forgot to say something, I am free to respond. Thank you for your attention! Sorry about my english. 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169257269578432552",
    "author": "youngteam",
    "date": "2023-11-01",
    "content": "The thought process is I want to be able to make beats in various styles very fast because I feel a lot of sessions are like this. You don’t have to use a sample for inspiration it can be a couple of piano or guitar chords. I’m trying to understand what producers are looking for in samples as I make them myself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169729644036116490",
    "author": "cian riordan",
    "date": "2023-11-02",
    "content": "I’m glad he sent Kirk home to write a fucking guitar solo.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169730758039044096",
    "author": "Edward Rivera",
    "date": "2023-11-02",
    "content": "Hey I like my buttrock. There's a video somewhere of me subbing on guitar for Metal Skool (Steel Panther) and I fucking butt rocked it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1170191625755054152",
    "author": "Will Melones",
    "date": "2023-11-03",
    "content": "Don’t you guys feel like there’s a difference between pushing a guitar solo and a vocalist though? When you get personal lyrics involved, and the sound that their body is basically born making, which becomes so closely linked with personal identity. Seems like we tend to be extra conscious of the way our words are perceived with singers, and not just because of diva personalities or fragile egos.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171016613894570095",
    "author": "Marshall",
    "date": "2023-11-06",
    "content": "A lot of singers (if not most tbh)  train their voices to sounded way different singing than they do speaking (pitch, tone, formant, etc)....They are basically \"acting\" vocally lol. Meanwhile, some singers do just sing with the voice they were given. I feel like the performance of \"putting on\" a voice that isn't your own is tough to capture on command. whereas, playing guitar is just athletic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171016696836931614",
    "author": "Marshall",
    "date": "2023-11-06",
    "content": "even on your \"off days\", you can still play guitar the same as you usually do",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171017728698630184",
    "author": "Marshall",
    "date": "2023-11-06",
    "content": "muscle memory with guitar is way more reliable than muscle memory in singing.....with guitar, your fingers just need to move fast enough and apply enough pressure on the strings and the instrument produces the tone for you. With vocals, you have to have every single muscle/vocal flap/space in the throat/sinus congestion level/etc perfect to produce a certain tone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174166214092791891",
    "author": "Slow Hand",
    "date": "2023-11-14",
    "content": "Essentially it's just pitch modulation blended in with the dry vocal. There's lots of devices that'll do it for you: chorus, (guitar) vibrato effect, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183500705135333376",
    "author": "Rob Domos",
    "date": "2023-12-10",
    "content": "As a dude who's musical education was mostly in accapella music and who's production has mostly been midi that was easily quantizable, my sense of rhythm is nowhere near tight enough for the tier of work that I've been entering into lately. This means if I play something, I'm going to need to be quantizing audio and I'm relying on the visual aid of the waveform because my inherent sense of groove is pretty weak. So I'm looking for advice on quick heuristics for quantizing audio. \n\nTodays example: I played some palm muted acoustic guitars, I've marked the scrape of the pick in red and the peak of the waveform where the note truly starts ringing in green. The waveform actually starts a little before the scrape as you can see where the pick touches the string wave over on the left . How are y'all thinking about which part of this waveform should fall on which side of the beat?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1183554168171003984",
    "author": "Deleted User",
    "date": "2023-12-10",
    "content": "it’s generally the orange if it’s something like palm muted guitars. But always listen and feel it. It can feel better to be early in certain styles but it can feel better to be late on other styles. it also depends on who else is doing what\n\nBut groove template is always there if you wanna line it up with other instruments. bounce and make the source and destination audio files the same length, make sure the markers are in the correct place then sync them up. \n\nI’m 90% manual editing though. Because aligning automatically can fix notes I didn’t want to fix. you can also go measure by measure to be more careful if you want to auto align with groove templates \n\nyou want to ask yourself “is this note late or early?” before making any moves. I like nudging with keyboard so I can fine tune how far it goes. \n\nNowadays I’m more committed to “the only way to make the groove feel good is to play it that way”. I hate having to edit and to be honest, nothing beats well played rhythm section… Especially because I do a lot of in between the groove stuff, 30% quantization can mess with the feel of well landed notes. So I’m doing a lot of metronome practice these days",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186391425491935323",
    "author": "lystell",
    "date": "2023-12-18",
    "content": "I'm very curious about how you go about and record hihat only. Like now I'm working on a track that has some influences from Prince, Dua Lipa. The rest of the drums are programmed. Live bass, synths, and guitar. \nHow would you record it? Close mic, close + room, just OH.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186803340156342342",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-12-19",
    "content": "going through the stems of blackbears \"hot girl bummer\" and once again I noticed that it doesn't take a lot to make a great song: there's only stack of harmonies in the chorus and it's I'm pretty sure made with melodyne or autotune bc of all the artifacts in there. There is one natural mono harmony in the second pre and it has crazy bleed. The sample they took from a tv show (\"you want me to change... f*** you) still has the background music from the show in it (you'd never notice it in the mix though) \nWhat makes his vocals so cool is the creativitiy, with all the formant shifting on the lead + the lower octave that's probably done with little alter boy or smthg similar. \nthe guitars are played super well but also there's the occasional scracth and bum note in there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194249778595381258",
    "author": "Ross Fortune",
    "date": "2024-01-09",
    "content": "Guitar wizards, I'm experimenting with clean 80s tones and wondering how Mutt and the lads might've got the clean strums in the pre at 0.52.\n\n*jang jang jang*  \"I wanna know tonight\" *jang jang jang* \"Are you alone tonight\" *jang jang jang* \n\nFeels like there's layers of chorusy electric, but maybe a plasticy layer of DI'd acoustic or something in there too?\n\nhttps://open.spotify.com/track/2PFIZFcGry0po3ZfRZkzKc?si=c691d11446cf40e1",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194302102252556418",
    "author": "Deleted User",
    "date": "2024-01-09",
    "content": "I used to want one of their amps. A friend of mine had it, and it had this sustain button which acts like a compressor sustainer and it was the coolest thing I saw people do with guitar at the time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194318876155064460",
    "author": "Deleted User",
    "date": "2024-01-09",
    "content": "those are not the ones with the chorus-echo though. But they do still do the 80’s guitar sound",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196602677245780018",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "what do you do in this scenario? \n\nThere’s a guitar part I’ve been trying to record (myself playing the part) and it just won’t come out right. \n\nI tried over the course of two weeks, practiced in slower tempo - and I basically dedicated all my guitar practice hours on this guitar part for the past week. I can feel that my overall ability to play this part a bit more cleanly has improved- but I don’t see myself being able to play it clean enough for me to be satisfied in the next few hours or next couple days. \n\nFor this particular one, I already sent it to my client- but what do you do when 1) you can’t play the part right 2) and don’t have the money to hire someone out my own pocket\n\nfor more context, this is me just cold calling artists and asking them for a few references so I can make them a beat.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196603519982129342",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "the guitar part is just disco/funk type rhythm guitar. I would comp if I could, but I’m almost exclusively a punch in guy when it comes to recording myself. I just can’t sort through the takes and wonder if there is a better one (if that makes sense)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196604361401454613",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "I’ve had things like this happen to me all the time, especially when it comes to bass guitar\nBut usually, a whole week gives me enough time to push through. This one, I don’t see the light at the end of the tunnel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196607959296376893",
    "author": "Rollmottle",
    "date": "2024-01-15",
    "content": "many ways to solve the problem. i've sampled myself playing the notes and then programmed the guitar part and have also sampled myself and then played the part via MIDI. no rules.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196612563513921638",
    "author": "LAPhill",
    "date": "2024-01-15",
    "content": "I'm a very mediocre player, but I record 99% of my own guitar parts because I've gotten really good at hiding how shitty I am.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196696952901996554",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "re: 1 \n\nI have gotten over the whole “perfectionism” thing. I still overthink all the time but I can confidently day I am free of perfectionism. I have no problem letting go when it calls for it. I believe there’s a difference between wanting to be better and working towards it vs not being able to move on out of fear and holding onto something without knowing the next move. If that was the case I wouldn’t have sent what I first recorded to the artist. I may have wasted some time thinking I would be able to get this part down, but I don’t think I was being a perfectionist by doing that. \n\nre: 2\n\nWhy would he do this if he’s a great guitarist? Is it a workflow preference or the aesthetic of edit/sampling? I can only imagine it being faster playing the parts in rather than stitching bits together. \n\n\n\nThe whole goal is to be able to consistently reproduce that magical groove, and being able to create great moments when I am with other people. I really believe I have a good sense of groove but can’t execute it just yet. \n\nI can see myself spending countless hours editing myself. (Which I already do daily). That time is better spent working on my chops. If I can hire other musicians so I can stop wasting time trying multiple takes, I would. But I don’t have that just yet. I go by sections or measures most of the time, I don’t just sit there trying to nail ONE perfect take.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203420710551289897",
    "author": "hyanrarvey",
    "date": "2024-02-03",
    "content": "Hahahah no I just go way over the top for guitar tones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204495329924227143",
    "author": "Zack Hames",
    "date": "2024-02-06",
    "content": "It wasn't the star of anything that's for sure. I LOVE it on guitar amp for fender amps. That's the main use case for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209168201225736272",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-19",
    "content": "Artist I’m working with asked me to pitch up a song one or two half steps (she will decide the next few days) normally wouldn’t be a problem since I usually keep all the midi around but this was started by another producer and I only have audio from him and afaik he right now doesnt have access to the hard drive with the session. Additionally a lot of his stuff was real electric guitars with no MIDI anyway \nI‘m working with pro tools atm do you guys think the pitch shift algo is reliable enough or should I switch to something different e.g. melodyne and if yes is there anything you can recommend?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210223033495588965",
    "author": "SoundsLikeJoe",
    "date": "2024-02-22",
    "content": "Hive mind?   Favorite BASS AMP sim plugins? \n\nI have the UAD Ampeg stuff, and it's nice...  but looking for other flavors.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210224706666373120",
    "author": "Adam Thein",
    "date": "2024-02-22",
    "content": "I've enjoyed the IK Multimedia Amplitube stuff lately - wouldn't really call it an improvement over the Brainworx/UA Ampeg stuff but it is nice to be able to mix in a little room and mess with mics and positions a bit.\n\nIf you haven't gone down the Neural Amp Modeler wormhole (NAM) there are some good models in there that I've been using.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210228694136791090",
    "author": "Zack Hames",
    "date": "2024-02-22",
    "content": "I actually really like the bass amp sounds available on Line 6 Helix Native. But probably not worth $400 for just some bass amp sims",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210261606089494619",
    "author": "popaganda.",
    "date": "2024-02-22",
    "content": "If I was leaving ampeg I’d be going for non-amped sounds (which is my go-to anyway) or guitar amp plugins. Love bass through a JC-120",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1213980381682991154",
    "author": "Johnny I",
    "date": "2024-03-03",
    "content": "Working on a project where we just have the foundational acoustic guitar tracks for 9 songs, and are about to start overdubbing. Everything recorded to click, but would like to change the tempo on a couple of tracks, and in a couple of sections...most likely no more than 2bpm in either direction. Want to do this before we lay anything else down...what's the best time-stretching tool to accomplish this while preserving the audio as best as possible? I have access to RX, Melodyne, Pro Tools...haven't explore time stretching yet, so any advice is appreciated. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1213982665443905566",
    "author": "cian riordan",
    "date": "2024-03-03",
    "content": "I would start with polyphonic mode in Pro Tools  and figure out the tempo maps. Then, switch it to X form and render to see if it sounds better. With acoustic guitar, I bet the different won’t be drastic.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217493116429275228",
    "author": "chrissorem",
    "date": "2024-03-13",
    "content": "I concur it’s a Leslie but it sounds like a plugin in or a guitar pedal. I have a couple Leslie’s and they sound a bit different speed wise",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220507032163975180",
    "author": "LAPhill",
    "date": "2024-03-21",
    "content": "Most of the Mick Gordon sound isn't even guitars..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221896227952525383",
    "author": "louisvie",
    "date": "2024-03-25",
    "content": "Hi everyone, here's the situation for me right now \n\nSinger/Artist/Band Leader wants to release big single with video in 4 days to coincide with band's concert. (In important small venue in Paris, FR (hometown) friends will be there, big event he rightly envisions as a celebration for the new kick-ass song with the new kick-ass video.)\n\nBut, as close friend, band-in-question-member, sound guy and producer for the project, I think we should wait and take time to get very good vocals, while right now it feels like they're merely existing because song has to have vocals. Leaves no strong impression, or the impression that the performance lacks intention.\n\nBand rocks (his guitar included), Harmonies and Gang Vocals are cool. \nReally the lead vocal is the only thing in the way of getting the song to be really good. \n\nOn the one hand, I feel like his intuition for the release date (deadline is in 4 days) is good and could be very valuable for us.\nOn the other, I don't see why anyone would be truly excited for us if singer is mid.\n(I know he's good deep down, he's given me chills when singing with no pressure, rn we're just lacking some of that magic.)\n\nAs the song is today, you wouldn't love to listen to the song on your way to work or school, enjoying it for what it is.\n\nAnyway, right now I'm going to try and squeeze that magic out of him in the next following days when we can see each other.\nAs I'm typing this I also realize I should send him the instrumental and let him try shit alone. \n\nMaybe that's my answer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222058592023216180",
    "author": "Josh",
    "date": "2024-03-25",
    "content": "It’s funny how that works. One of my fav bass sounds I’ve ever made was just the MicroFreak I’ll take to sessions “Just in case” (I have ADHD) into one of those plasma pedals.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230982224577560710",
    "author": "markmaclure",
    "date": "2024-04-19",
    "content": "Anyone have any tips on working with new artists/producers with no filter? Like where they NEED to try out every idea they have, even if it's not good, or if it's a bad time (ie we're tracking guitars and they stop everyone to try out a (bad) bass idea). \n\nI'm on a project right now where a new artist is bringing their songwriting partner to every session as a producer. This is their first production gig (which is fine), but we're wasting a lot of time on ideas that get scrapped later on. This person has a good ear, and occasionally has GREAT ideas, but it takes forever for them to let go of bad ideas. \n\nIt takes all of my patience to very slowly walk them through why the ideas aren't working, and there's a lot of pushback when I do. A lot of \"but can we just try it? I really feel like it will work\" then 3 hours later \"oh yeah I think you were right let's delete it\".",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232754549983543358",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-24",
    "content": "I’m such a sucker for plugins that don’t seem like they should work. Anyone tried Blue Cat’s “Re-Guitar” that supposedly can make humbuckers sound like single coils etc after the fact? Not a guitar guy, but the demos sound interesting and it just seems fun. Selecting inbetweens across a spectrum of pickups also seems kinda cool https://m.youtube.com/watch?v=wK7xSpQ6Wqg&",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232776376352899103",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-24",
    "content": "haven't tried it at all, just came across it this morning. I always liked the variax stuff but since that went out of production/support last year I was looking at options (gonna be traveling a lot this year so many guitars is a nono)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237488867376889877",
    "author": "Adam Thein",
    "date": "2024-05-07",
    "content": "Does anyone with Guitar Rig 5 installed and Ableton 11 or 12 have a few minutes to open a session for me just so I can recall a setting?  I only have GR6 and GR7.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237779317770162306",
    "author": "Ross Fortune",
    "date": "2024-05-08",
    "content": "Unless maybe it used a rule where the first note hit would always be assigned to bass, second to celli etc. So you’d play/program a chord like you might rake a pick across a guitar chord. Still tho, fuck that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241761596615692441",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Eh I mean aside from the bass guitar and little lead its all in the Oliver pack",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241764969003880569",
    "author": "Edward Rivera",
    "date": "2024-05-19",
    "content": "The bass guitar is dong a lot of the heavy lifting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241768887943692358",
    "author": "Edward Rivera",
    "date": "2024-05-19",
    "content": "_This album created by fender guitars and remo heads !_",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242553078784196690",
    "author": "cian riordan",
    "date": "2024-05-21",
    "content": "Tried to do a quick search but can't find it -- what's the best online vocal extractor? Need to separate a vocal from an acoustic guitar -- @Joel \"Roomie\" Berghult ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242971719921045625",
    "author": "chris_donlin",
    "date": "2024-05-22",
    "content": "Does anyone have a quick way to take a melodic riff on guitar/keys/etc and have each note play in reverse? I dont want the whole clip to just play backwards. I want the melody the same. Slice to new midi track in ableton almost gets me there but i cant reverse the samples within each sampler... or can i?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244724139508498493",
    "author": "lystell",
    "date": "2024-05-27",
    "content": "Great advices. Thanks!\nYeah, I found some great stuff on micing strings in the search bar.\nI’m thinking I’ll try some semi close mic (maybe moving player around a bit for different takes). And then reamping them into a nice room and capture that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244769728799445012",
    "author": "Ross Fortune",
    "date": "2024-05-27",
    "content": "Pedals and amps? Real or plugin. For sculpting there’s a million ways you can slice it before/after.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247566351107752006",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-06-04",
    "content": "For completion‘s sake they want all the tracks so vocals, drums, bass, synths/keys, guitars and fx",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248265665597669468",
    "author": "SoundsLikeJoe",
    "date": "2024-06-06",
    "content": "Stanky feel on that guitar distortion too. Overloading the pre or a compressor maybe?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248266263646437456",
    "author": "NoahNeedleman",
    "date": "2024-06-06",
    "content": "That fuzzy guitar actually feels like speaker breakup on a small amp to me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248266524003668039",
    "author": "Josh",
    "date": "2024-06-06",
    "content": "I can’t remember this song off the top of my head but I know matty said they used a TG channel for a lot of the guitar tones.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254869147586924685",
    "author": "Bryan DiMaio",
    "date": "2024-06-24",
    "content": "I like to do that with guitars too yeah that's pretty much it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256109716552155227",
    "author": "BoozleBAM",
    "date": "2024-06-27",
    "content": "Their free amp sim \"Crunk\" is honestly stellar, imo. Just did a quick mix for a metal band and used it. Just the ticket. Beautiful.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256163976275038239",
    "author": "BatMeckley",
    "date": "2024-06-28",
    "content": "In fairness, I went through 5 different guitars today trying to get the right rubber bridge guitar sound  down and none were quite right. Heading over to Tony’s tmrw morning to pick up his that he kindly offered to lend me tonight, so I’ll let you know if it’s the guy or the gear after I’m done trying to track it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258505112473571428",
    "author": "LAPhill",
    "date": "2024-07-04",
    "content": "100%. I usually have the bass slightly behind the kick, and the guitars slightly behind the bass. Just feels better to me. But it’s all context dependent, of course.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258581071491239988",
    "author": "Josh",
    "date": "2024-07-04",
    "content": "Outside of metal I’ve been really enjoying late guitars.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1260717790101504122",
    "author": "DanRodriguezMusic",
    "date": "2024-07-10",
    "content": "Question for y'all. I want to record some live, in-studio, acoustic performances of a few songs, and record them with video as well. Do you have any best or favorite mic'ing practices for this?  Dynamic mic for vocals so it can be isolated & treated easily? Tube mic to pick up everything? DI on the guitar w/ a mic as well? Two mics?    --- What is YOUR go to for this, and what other variations would you recommend I try?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261160395612360754",
    "author": "Eric Martin",
    "date": "2024-07-11",
    "content": "M88 Vocal\nColes 4038 on guitar",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261502438838370446",
    "author": "hyanrarvey",
    "date": "2024-07-12",
    "content": "Yeah and if you need to access the di cause your guitar tone sucks just reverse what you’re doing in downmixer and load up an ampsim or dup it and blend in the ampsim with the real amp. Just to be sure to check phase maybe have to nudge it etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1273841543492665426",
    "author": "Josh",
    "date": "2024-08-15",
    "content": "There has to be someone in here that understands what I’m about to say. \n\nI want a looper. But in my computer. \n\nI find myself always making a ton of layers of guitars and then bouncing them down. I don’t want to have to do that. I just want to hit a button and play over the parts over and over again until it’s a jumbled mess. This isn’t for performance or anything, I just like to make little loops and chop em up and throw them around projects I’m working on and I find myself doing it less and less with my free time becoming less common.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1273841753681559643",
    "author": "Josh",
    "date": "2024-08-15",
    "content": "I’m also considering a looper pedal specifically to expedite this process but figured if there’s something easy in software form then I’ll try that first",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1282019002901594244",
    "author": "jonmatteson",
    "date": "2024-09-07",
    "content": "Does anyone have any good acoustic guitar IR’s to be used with a di acoustic into an HX stomp?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1282407942921912473",
    "author": "James Cronier",
    "date": "2024-09-08",
    "content": "I have a live recording for a label client tomorrow (finally)\n\nThink tiny desk, KEXP, etc\n\nThey’ll have drums/bass/electric on every song, and the singer plays acoustic on two songs. \n\nI’m trying to figure out how to get a compelling and consistent sound from the acoustic in a way that doesn’t mess with the video recording too much…\n\nI can take a DI, and then I have my Beyer 201, some NT5s and a Beta 98 clip on as options for this guitar. \n\nLet me know what y’all might try here.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283895423597150218",
    "author": "Slow Hand",
    "date": "2024-09-12",
    "content": "Speaking of piano instruments, I'm in the market for a MIDI three pedal controller (sustain/sostenuto/soft) to go with my Korg SV-1. Does anyone have a three pedal sustain that they'd recommend?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283896781884620894",
    "author": "Slow Hand",
    "date": "2024-09-12",
    "content": "I'm currently leaning on the Roland pedal, but I am open to recommendations.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283990253899612181",
    "author": "BatMeckley",
    "date": "2024-09-12",
    "content": "There’s things that it just does better, the way notes interact with each other, the way the sustain pedal resonates. I actually really love their Celeste too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284216940889509966",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-13",
    "content": "Dumb question time: Is there a trick to getting a consistent distorted power chord guitar tone with mixed in non-5th intervals? Like going from a C to a C/E (which will have a minor 6th in the bottom E+C) the intermodulation and breakup sounds entirely different with all settings I’ve tried. How would you approach it to make sure it sits similarly?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284219192576315443",
    "author": "LAPhill",
    "date": "2024-09-13",
    "content": "(Though, even if the bass is playing that inversion note, it can still get muddy if your guitar's chord is low enough that the added low octave is near the bass note)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284226087433539696",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-13",
    "content": "Thanks for the great answer man! \n\nWould it at all make sense to for C/E play a normal E power chord, and then reduce the most B sounding frequencies w/ tight EQ bells? \n\nIn the past I’ve dubbed single bass notes w guitar and automated that track in more when needed to try and make up the difference when things get wacky",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285112816260349964",
    "author": "lystell",
    "date": "2024-09-15",
    "content": "I’d like some help to decipher what’s going on with the acoustic guitar in this:\n\nhttps://open.spotify.com/track/1zejeOnykpCoyVSit6Bwp3?si=R8zZdg-ZSwS8Eu-vapnv_A&context=spotify%3Aalbum%3A6s84u2TUpR3wdUv4NgKA2j",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1286755201839267921",
    "author": "stewart_hidalgo",
    "date": "2024-09-20",
    "content": "I've been using board tape to just tame things.  Have not tired painters or going for the rubber bridge sound. Definitely trying it out next time I do acoustic guitars.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1288462475372793947",
    "author": "bobby k",
    "date": "2024-09-25",
    "content": "I’ve encountered this a few times now and want to poll the class — if an artist wants to cut just an acoustic rendition of a song, do you do it for a fraction of your rate? Type of thing where we’d probably knock out three in one full day of work…one guitar, one vocal, maybe some harms.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300407837784145920",
    "author": "Zack Hames",
    "date": "2024-10-28",
    "content": "Double it with fuzzy electric guitar feels like the move to me, or simply use some distortion on the synth; it also feels like octaves+fifths to your advantage",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301949773187776595",
    "author": "Johnny I",
    "date": "2024-11-01",
    "content": "Working on a track that's primarily acoustic guitar and vocals; a couple of sections where a chord or note on the guitar is a bit off timing, in a way that's distracting. What's a suggested method to best correct this if an edit or punch isn't possible? Since the guitar is so exposed, I'm not sure how to approach this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312672629332774962",
    "author": "Slow Hand",
    "date": "2024-11-30",
    "content": "Anyone know a good hack to recreate this seagull feedback sound in the first 30 seconds? Short of - y'know - cranking a guitar through an amp?\nhttps://www.youtube.com/watch?v=R_nviNS0IAw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318646368897597473",
    "author": "spectrummasters",
    "date": "2024-12-17",
    "content": "If anyone felt they could help me nail the guitar sound in this I’d be very grateful . If you listen from 2mins 20s in just before the big chorus drop , when it drops in a snaking guitar line  comes in . Not the chords the weaving melody line . Sounds like a chorus or flange ? And pitch flutter . I tend to get stumped between nailing chorus / flange / phase effects on guitar and really nailing them . https://music.apple.com/gb/album/conceited/1743250148?i=1743250259",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1323724942256111758",
    "author": "bobby k",
    "date": "2024-12-31",
    "content": "Open-ended question i would love to pick your lovely brains on — \n\nI’ve started working with an artist who’s caught some good momentum doing the selfie singer songwriter thing on social media. It’s just acoustic guitar + vocals on an iPhone video. There’s a strong fanbase asking for a few songs in particular that we’re trying to cut studio versions for in January. \n\nQUESTION - What are your instincts when producing a song that has already been played a certain way many times? Are you building from the base of what already exists and trying to “put a band” to it, are you recapturing it exactly as-is and releasing that, are you throwing it all out and making a brand new banger from the song, or something else?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339522488564060233",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-02-13",
    "content": "What’s a current production/sonic benchmark for music with driving distorted 8th note guitars, with a pop crossover appeal? Only thing I can think of is the MGK stuff, would love some other references",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339744000084803605",
    "author": "Josh",
    "date": "2025-02-13",
    "content": "Can’t even keep our guitar tones 😔🤚",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339744165289791661",
    "author": "Lee Rouse",
    "date": "2025-02-13",
    "content": "The only real thing you can decide on on production is lead tones and aux guitars, vocal fx and synths/production stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339744702282469406",
    "author": "Lee Rouse",
    "date": "2025-02-13",
    "content": "God forbid you don’t record a DI for rhythm guitars lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341252282708262953",
    "author": "eliotpeace",
    "date": "2025-02-17",
    "content": "I gravitate to the acoustics on this track! Combined with the 12-string in the chorus just so  @Matthew The Cooke🎄🎅🏻  Also, played by one of the most killer guitarists, in Ian Thornley",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1344412195022442600",
    "author": "lystell",
    "date": "2025-02-26",
    "content": "What's up with the guitar sound (intro/verse) on Sabrina Carpenter - Taste? A kind of filter/movement stuff there that I cant understand.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1365214656548962414",
    "author": "oaklandmatt",
    "date": "2025-04-24",
    "content": "How is RX with pulling a vocal from an acoustic guitar/ vocal mix, tuning it, and putting it back together?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1372306703919616162",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-05-14",
    "content": "https://open.spotify.com/track/0kiaVCnEEFQWIbEd9bjqAe?si=c95749559ee542be can anyone identify the guitar effect starting at 5:18 on the arpeggiated guitar and knows how to recreate it? It sounds chorusy but there is more going on that I can't quite put my finger on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1375753903878176780",
    "author": "Deleted User",
    "date": "2025-05-24",
    "content": "I want to chime in here, I mostly agree with what the others said and as long as you don’t unintentionally clip all is well. But I think we can dig a bit deeper.\n\nI like to work in a way during tracking/production that’s maybe a bit more old school with shooting for around -18dbFS on the average. It gives me a kind of fixed reference in my mind which gives me enough headroom for most dynamics. Now the important part is you have to turn up your monitoring/headphones volume to be adequately loud to work with those lower levels and then leave it there.That being said it might be necessary to bring down other pre existing tracks that are too loud.\n\nNow since the volume of the monitoring/headphones stays the same during that tracking session you can use the gain of your preamp (or the output gain of the compressor, if you’re using one on the way in) to adjust the vocal or instrument so that for every part of the arrangement it feels right. So in a sense you are pre mixing during the recording, taking off some work down the line",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383591306785198101",
    "author": "Slow Hand",
    "date": "2025-06-14",
    "content": "Any thoughts on what instrument this might be in the left channel doubling the main riff throughout the song? I can hear electric bass, an electric guitar, and... *something* low, roomy, and out of tune. But I can't ID what it is. \n\nYou can hear it best @ 3:00 when it comes back in.\nhttps://www.youtube.com/watch?v=Fug0KpLhIso",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383591430974472293",
    "author": "Slow Hand",
    "date": "2025-06-14",
    "content": "The liner notes credit Pete Cosey with bowed guitar. Maybe that?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383594268928770130",
    "author": "Slow Hand",
    "date": "2025-06-14",
    "content": "Oooh, maaaybe? The quality of the sound feels like it's been pitched down an octave using varispeed. The part is kind of loose and not always locked-in with the bass and guitar, so maybe they overdubbed a harmonica at double speed, so that it would play back an octave lower. That would also explain the heavy chorusing effect on the pitch, which might be the pitch fluctuation in the reeds being exaggerated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383910301333852341",
    "author": "Ross Fortune",
    "date": "2025-06-15",
    "content": "This is probably day one stuff to real guitarists, but Semi Charmed Life by Third Eye Blind, the guitar in the first half of each verse has this amazing kind of muted quality to it.\n\nHow do I get there?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386477275276378122",
    "author": "chris_donlin",
    "date": "2025-06-22",
    "content": "Love this question, I’ve been on a big panning journey the last two months because I’ve always just doubled things and panned everything evenly. I was listening to an episode on Sonic Scoop about Nigel Godrich’s approach to mixing and it was really eye opening to hear how bold his mixes are. I used to get distracted when something was panned but not balanced but after just forcing myself to do it I’ve gotten more comfortable, and even fallen a bit in love with what panning can do. I’ve noticed I have a tendency to pan instruments a certain way, pianos sound better panned, electric guitars always feel better panned right, no reason why it just does. Find what feels good to you! I haven’t gotten bold enough to pan bass and drums to a side. One day",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386513951096963083",
    "author": "vostral",
    "date": "2025-06-22",
    "content": "Guitar & synth tracks panned wide and almost as loud as vocal. A ton of melody layers playing at the same time, i mean that's top-notch!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387834486179368980",
    "author": "Brian Reynolds",
    "date": "2025-06-26",
    "content": "I'm always layering my melodic instruments in the stereo field. I imagine it like making a cold cut sandwich. Noah's comment unlocked something, I hadn't done before, moving the melody thru different layers. The main melodic guitar. I had it at like 60% where I normally leave it. But had it widen to over 80% in chorus. Then more narrow than I would normally have a doubled melodic at like 35%. Usually id just do one guitar, mono to scratch the scene change itch. I save hard panned left right area for chorus guitars or stereo stereo synths to swim in. That with dropping the piano for first half of verse 2 did the trick! Still hoping this is a catalyst for more sharing of ideas",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387840526316863589",
    "author": "cian riordan",
    "date": "2025-06-26",
    "content": "That’s arrangement + raked guitars + the compression trick all working together to kick you in the balls",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1390222389459030058",
    "author": "Sam Segarra",
    "date": "2025-07-02",
    "content": "I feel that sometimes in a production an element can be added which is distracting from the essence of the production - a \"tacky\" synth line, an acoustic guitar which feels disjointed etc. Often it's something that feels like it doesn't suit the genre/vibe of the track or has an emphasis in a particular frequency range which makes it feel un-glued in the mix. This can sometimes be legitimized by having the part played by another sound or by recording the sound differently, in my opinion. Or sometimes the part it just superfluous per se.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397217566237266083",
    "author": "Johnny I",
    "date": "2025-07-22",
    "content": "Are doubled lead vocals typically panned hard or just slightly left and right of center? \n\nIf you had a production with 2 acoustic guitars playing slightly different parts (hard panned L and R for width), a stereo upright piano, and a doubled lead vocal, how might you approach the panning of these 3 elements in the stereo field?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404545666369191936",
    "author": "chris_donlin",
    "date": "2025-08-11",
    "content": "What's everyone using for remote production these days? For my scenario, the client is just going to be listening. I've used audiomovers for remote mix check-in's, but if im dialing in some sounds it'd be nice for the client to monitor through UA console with me. We're just finishing up a song from we wrote in person a few months ago. I don't anticipate there being much to track besides some guitars and maybe synth stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404816341852229633",
    "author": "DELLA",
    "date": "2025-08-12",
    "content": "hi!! \ndoes anyone have any good guitar cab IRs to recommend? \nI'm looking for 1x12 or 2x12 vintage or weird models.\nhave a great day everybody 😄",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1409976963334013139",
    "author": "Will Trotman",
    "date": "2025-08-26",
    "content": "Perfect example I would love to buy a reamp box. Is the radial one the way to go?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410598543802237059",
    "author": "NoahNeedleman",
    "date": "2025-08-28",
    "content": "What are we using to replace guitar solos these days? Country is still very much guitar hero land so having trouble breaking my brain from that habit rn. \n\nIdeas?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410614498863218808",
    "author": "Josh",
    "date": "2025-08-28",
    "content": "Also trying to bring back guitar solos because rock took a break",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410614940602994829",
    "author": "Nomograph Mastering",
    "date": "2025-08-28",
    "content": "In your best productions what is a guitar solo for?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417202467443310734",
    "author": "chrissorem",
    "date": "2025-09-15",
    "content": "https://tidal.com/browse/track/158703972?u any ideas about this guitar sound ? I can’t tell if it’s a torn speaker or a vibra slap\nOn the hits doubling it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434280530198659122",
    "author": "lystell",
    "date": "2025-11-01",
    "content": "This song i all kinds of good.\nSound wise - what kind of acoustic guitar would get me close to the guitars you hear from start?\n\nhttps://spotify.link/odojWYIWWXb",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434333490614370326",
    "author": "NoahNeedleman",
    "date": "2025-11-01",
    "content": "Strumming in the right spot on the guitar",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444090579431587840",
    "author": "oaklandmatt",
    "date": "2025-11-28",
    "content": "And not just for making things incrementally better, but for solving problems as well.\n\nI recently was mixing a song with a young mixer who I gave my session to. I heard a very subtle low and thump after two particular downbeat and we could not figure out what it was. We solo'ed some groups and then I remembered that he had replicated my autotune settings on the bass guitar (he had a slightly different version). I know from lots of tuning experience that different modes will occasionally cause different types of artifacts. So we solo'ed the bass, switched from \"modern\" (his default) to \"classic\" and it was solved.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456958492358348801",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-03",
    "content": "Good shout, gonna try messing around a bit more with that! \n\nAnother part of what makes these kits sound so good are boost layers/one shots that suddenly pop in at certain velocities, I might turn them off. But that also makes it sound entirely different, almost like tracking with a different guitar amp 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1462544619798794484",
    "author": "CMC",
    "date": "2026-01-18",
    "content": "Follow up, also looking for some favorite creative distorted guitar tones. Nothing metal or standard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1462546560196804619",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2026-01-18",
    "content": "there is this dude on IG who does crazy stuff with guitar distortion like micing up just the strings with an Sm57, then pitching it up an octave and crushing it with tape but I can't remember his name atm. once he pops again on my feed I will send!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465863217724264505",
    "author": "Rollmottle",
    "date": "2026-01-27",
    "content": "Looking for any references for a guitar tone that feels sqwanchy, uncomfortably dry, no room, pressed, upfront, boxy, forward, distorted-but-still-articulate...what you got?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469838339023831202",
    "author": "Ross Fortune",
    "date": "2026-02-07",
    "content": "This is probably real 101 stuff, but how is this guitar tone achieved? It’s in lots of songs over the years, this is just the first that jumped to mind.\n\nGuitar solo starting 2:50. Feels like bees buzzing in my ears \n\nhttps://open.spotify.com/track/4oYfMQ6NDGHq0GcbICqsDw?si=omxKOdgPTUCSrR1XAjz9zA",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469846243092992001",
    "author": "youngteam",
    "date": "2026-02-07",
    "content": "ah man flashbacks to eternal sunshine of the spotless mind. never knew this was a beck song! \n\nsounds like a double tracked guitar solo first and foremost. dry as fuck, bridge pickup with fuzz or distortion. reminds me of beatles tones tbh should be easy to recreate",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470172634913308978",
    "author": "Ross Fortune",
    "date": "2026-02-08",
    "content": "So if we ask him about that vocal panning and the guitar tone, we might get half an answer by Paddy’s Day?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470344911780839628",
    "author": "Jack",
    "date": "2026-02-09",
    "content": "Blown out Neve. Easiest way is the hi-gain setting on a Hudson Broadcast, DI. Use it all the time. UAD’s Helios plugin can do something very similar too. Realistically, spitty, low bias fuzz (Zonk Machine, FZ-1, Buzzaround, MKI Tonebender, Fuzzrite) + DI gets you there. Also sounds like it’s probably a single coil bridge pickup, I’m leaning towards that ratty Silvertone 1448 that he loves but guitar is far less important.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472312587117924415",
    "author": "chrissorem",
    "date": "2026-02-14",
    "content": "Finally got a chance to listen to this my guess would be that sounds like a fuzz pedal over a dime out Mic pre and sounds like one of them is a direct signal paned and the other side is an amp. The slight delay on it high pass filtered pretty high.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1473485249467121847",
    "author": "Slow Hand",
    "date": "2026-02-17",
    "content": "Maybe it's just my taste, but if I'm sequencing sampled instruments I'm not trying to sample guitars and I don't think we need another drum library, either. Drums and percussion already translate well to sampling (for the most part). \n\nI want strings and woodwinds, or brass. Gimme some of that, and make it something with some real energy and excitement. Their platform seems capable of expressing things that traditional sampled instruments cannot do, so lean into those strengths and make the parts a little more opinionated. A little more unique.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]