[
  {
    "id": "1267175404322689046",
    "author": "chrissorem",
    "date": "2024-07-28",
    "content": "This made me think of a production technique Ive stumbled on.  We all have our go to instincts that can lead to a similar feeling across a  record.  Generally there is a dominant instrument that the song was written on such as guitar or piano maybe a synth.  Take a filled out productions and mute all the main ingredients and leave the additive colors, only the sprinkles on top. And start rebuilding the production around that. It can take you to an entirely different  universe and provide contrast in the arch of the record",
    "reactions": 21,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061736780845551616",
    "author": "oaklandmatt",
    "date": "2023-01-08",
    "content": "Oliver power tools and kshmr are the most useful and most modern packs. Not sure what kind of music you're making but for my workflow I like doing whatever I feel on a production and then having quick \"modern\" drum sounds I can reach for that immediately can put things into the present.\n\nI'm doing a production right now for a UK artist where they gave me a throwback sounding demo, but I know the artist is a young 2023 female pop star. So I did a bunch of organic shit (acoustic through my 67, some live claps, shit like that), then I threw some kshmr and oliver loops in to just see what the hybrid of classic and modern sounds like. Production is basically done now",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937550457465880597",
    "author": "oaklandmatt",
    "date": "2022-01-30",
    "content": "@everyone added a production channel. mostly because \"gear\" seemed a weird place to ask what people are using for piano these days. \n\nbut also seems good since we have \"songwriting\" \"recording\" and \"mixing\" channels already \n\ni'm sick of Alicia's Keys. i want some all purpose grand that sounds natural and has not too much built in eq and shit.\n\nwhat y'all using?",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248404199746703482",
    "author": "Oli J",
    "date": "2024-06-06",
    "content": "ok so its an original live take. then we recut the vocal (but you can hear a bit of the original in the rooms/piano/drum mics). Double vocal panned a bit right. \nThen theres echoboy on the vocal (ping pong at 60 and 130ms) low mix and bit of feedback.\nThen some D Verb large hall!",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203593111973011606",
    "author": "oaklandmatt",
    "date": "2024-02-03",
    "content": "There is a much longer answer, but essentially you learn that they are not opposites. You can overthink repeatedly on your way to finishing. \n\nIt's not a straight line where you're productively working toward better. It's about always striving toward the absolute best you can get by exhausting your ideas and making the best decision you can in the moment. \n\nArt is subjective, so there's actually no \"better.\" If you build up all these little skills (from keyboard shortcuts to emotional vulnerability in a writing session) and add that to repetitions, all you need is a relentless will to finish at the highest standard and you'll have a serious career.\n\nSpoiler alert: the relentless will to finish is the hard part.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407562288927609034",
    "author": "montrose recording",
    "date": "2025-08-19",
    "content": "@Skyler Young sky keys all over the new flock of dimes track thats about to drop.  i remember she was looking for a sound and i pulled up skykeys and very quickly jenn lit up and was like ‘ooh!  thats sounds cool!’  and it made it!",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033939905086226472",
    "author": "Slow Hand",
    "date": "2022-10-23",
    "content": "I couldn't speak to the current state of samplers, but I've always wished that someone would build a bold sampler that wasn't afraid to be really wacky and full of unique characteristics. For starters:\n\n1. Include a radio tuner. \n2. Maybe some really nice - but heavily colored - preamps.\n3. Include all kinds of weird peripheral sensors like devices that pick up EMF signals or a few contact mics. Include a suite of effect plugins that are specially geared towards these input methods.\n4. Super-intuitive resampling, time-stretching, and pitch-shifting features.\n5. An algorithm that analyzes the dominant pitch of a loop and auto-maps it to a keyboard. It should be capable of re-orienting itself as the dominant pitch of a loop is adjusted.\n6. Tracker-style sequencing capabilities.\n7. An OTT-style compressor. Maybe something really trashy and blown-out like Devil-Loc or Vulf Compressor. Something that really messes with the proportions of a sample.\n8. Easy and flexible integration of feedback loops.\n9. Intuitive integration of polyrhythmic looping or sequencing.\n10. A feature for easy implementation of Steve Reich 'It's Gonna Rain' style tape loop phasing.\n11. Auto-bpm detection keyed off of designated inputs (ala Ableton).\n12. Automated master tempo effects.\n\nI could go on.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037560949273538661",
    "author": "popaganda.",
    "date": "2022-11-02",
    "content": "I’ll add kind of a different angle to this convo….everything mentioned is crucial…play a lot, record, play with others, just reps….but if you want to see big gains TECHNICALLY on something like guitar or piano, you need to break movements down and very very slowly drill the transitions….one note to the next. One chord to the next…really building muscle memory. For a new chord shape…form it very slowly and then let go completely. Repeat many times. Same thing for chord transitions….super slowly between the two. It may seem like it would take too long to practice like that, but doing micro work like that will completely transform your ability on an instrument if you’re judicious and persistent.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1311026460831645696",
    "author": "Slow Hand",
    "date": "2024-11-26",
    "content": "At the risk of stating the obvious, transitions can also be telegraphed through the instrumental writing too. Whether it's a drum fill, or a chord voicing that walks up/down into the next section, or tension in the melodic voices, or shortening the notes lengths (staccato, staccatissimo).\n\nThere's also idiomatic noises from the instruments. Guitars have string scrapes, headstock rakes, that cool chattering thing from tapping near the bridge with the edge of your pick. Pianos have big glisses, horns can squeal, bowed strings can sweep a fast legato scale up into the downbeat or do a large gliss.\n\nThen there's foley. I get a *lot* of mileage from sound libraries made for film audio. Foley artists are some creative people and you can go far layering their sounds into instruments at the transitions.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937558241829851136",
    "author": "Adam Thein",
    "date": "2022-01-30",
    "content": "Not really an all-around solution and slightly off topic but would recommend checking out https://www.pianobook.co.uk/",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142151095209185391",
    "author": "bobby k",
    "date": "2023-08-18",
    "content": "I will say this, on the topic of standing up for yourself -- I've seen a couple times in these threads now a general sentiment of accepting that people are gonna kick you around. It felt evident when we were riffing on sliding scale mixing rates last month and it felt evident this morning/last night in here. I'm all in on the greyhound sentiment, I've been a grafter through and through since I was in elementary school skipping homework to double up on piano practice. I once drove 7 hours to buy a Juno-60 on Craigslist and the guy didn't answer the door; I make DUMB life decisions all centered around this non-negotiable gravity towards the art. I can promise I have whatever that obsessive brain disorder thing is that we all keep riffing about (and believe the same for the grand majority here). But can we not practice a little self preservation along the way? Nobody besides your team is really gonna stick up for you; I believe that in line with the all the professional metrics there exists the opportunity/need to set  precedents on how you want to be treated. I don't think this is something that *comes* with being a great producer, I think it's something that *contributes* to someone becoming a great producer. And of course, knowing how to ask for that fairness with a kind/patient/assertive/flexible tone is critical. But if I believe something is a little crooked in the system, I'd rather not wait till I hopefully arrive a decade later on the other side of the fence to be able to do something about it. I would rather make an attempt at being heard now and see whether it makes any progress, even if it just gives some suit on an email thread something to think about. It's not for the sake of my own ego, it's for the sake of our entire breed.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155162939179946086",
    "author": "BatMeckley",
    "date": "2023-09-23",
    "content": "It’s not being able to play a piano. I know this as fact. 😂\n(Benny was a two finger piano player at best)\n\nIt’s about having great taste. Understanding what the end product needs to be, and then developing a skill set, both technical and social, that allows you to get the artist there.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051559803668938862",
    "author": "Zach Hughes",
    "date": "2022-12-11",
    "content": "Wanted to share some thoughts spurred on by a recent experience on here. So a local artist has hired me to produce two of her songs. Vibe is singer-songwriter, soul, RnB.\n\nWe tracked drums, bass, and keys live in the studio OD'd to scratch tracks we cooked up together. The scratch tracks / demos were just guitar vocal and we were really relying on the players to fill out the arrangements, but we knew more would be added down the line.\n\nAll the players were incredible. Could singe your eyebrows off with technical prowess and shredtastic chops. Tracks turned out great, still working on the arrangement, but..\n\nThis project has got me thinking more about the importance of how you present a song to session musicians and the 'space' you ask them to fill in a production. As well as the changing dynamics project to project affected by a revolving cast of participants, more fleshed out demos, etc... I find this a really interesting topic. Curious if anyone in the group has any unique experiences or insights whether as a producer or a musician.\n\nI've found that the more I flesh out demos with the artist beforehand the more bound and limited the session players we bring in are based off our decisions. This can make ODs more efficient, add a clearer direction, but can also remove the opportunity for the player to really add something special. Sometimes I don't want to be too suggestive b/c I want the players to have more of a blank canvas to work with.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1056268100040917042",
    "author": "wilhelmjosephk",
    "date": "2022-12-24",
    "content": "One thing I love to do to help me wrap my head around sounds and tools is basically “transcribing” a preset to a new initialized patch on the same synth. Keep hitting the keys as you go to see how copying each setting changes the sound, and see if the end result is the same when you think you’re done. Often you’ll be completely missing some modulator somewhere and you’ll really need to dig through the synth’s features to find something you didn’t know before. As a bonus, you can try the same thing but have the synth that the preset comes from and the synth you’re recreating it in be two different tools, like trying to remake you’re favorite serum patch in Pigments. Sometimes certain features will be missing outright and you’ll just have to use your ears to get close, but I find this really useful for figuring the inherent differences in the tools at my disposal. Best thing about both of these exercises is they only take about 10-15 minutes a patch, then you’re on to something new",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280284103018676427",
    "author": "jonmatteson",
    "date": "2024-09-02",
    "content": "Play 4 octaves of C on a piano slowly and record that and drop it into simpler. Then play a chord into that simpler and you’ve got the 1975 “random piano”",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037479551988670604",
    "author": "peterlabberton",
    "date": "2022-11-02",
    "content": "I’m a drummer first, but now play bass/guitar/some minimal keys on a good amount of stuff I produce. Taking drums out of the equation (that was years and years of many many hours every day), I’ve just gradually improved on the other instruments to a point where I now feel comfortable playing on a record. There have been moments of sustained growth in a given instrument, but really it’s just been time and growing as a *musician*—almost more a mindset of confidence. A baseline level of theory helps, then just a) learning songs, and b) learning how to play what you want to hear.\n\nAlso editing. Not gonna throw this person under the bus, but I got to work with a very A-list producer a couple years ago and recorded him playing drums (not his main instrument). Let’s just say it wasn’t great. But it got the idea down, and then edit edit edit. No shame, just make it great in the end!",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171637146810073138",
    "author": "NoahNeedleman",
    "date": "2023-11-07",
    "content": "INSTRUMENTS:\nBattery\nKeyscape \nKontakt vintage machines & vintage organs, scarbee bass\nArturia Mellotron + Minilab \nMIXING:\nProQ3\nKramer PIE\nDecapitator\nValhalla Delay\nOzone 9 or 10 covers a lot of basses\n\nThe majority of my shit is real instruments but I think I could make a record with just those. And a midi keyboard",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031608726345494601",
    "author": "NoahNeedleman",
    "date": "2022-10-17",
    "content": "Try Felt Piano by Spitfire. It’s only $29 and if it’s not right for this it’ll be right for something.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099737931834470439",
    "author": "Adam Thein",
    "date": "2023-04-23",
    "content": "I'm guessing it's a few Roland D50 patches blended - released in 1987.  Maybe patch 30 \"Spacious Sweep\" modified with a slower attack with Patch 6 \"D50 Voices\" mixed on the left?  Maybe a third layer on another preset in there with a phaser in mono, you can hear that come in on the verses.  Could also be Emulator like @stefanmacc said but I'd just look at using some of the Arturia sample-based digi synths for a similar vibe! \n\nhttps://www.youtube.com/watch?v=sM6c_jxVVlM\n\nEDIT: another clue would be D50 would have been a lot more affordable, what I could find is that a lot of the keys were tracked in a home studio which I think would point toward D50.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290046258622500909",
    "author": "chrissorem",
    "date": "2024-09-29",
    "content": "Actually yes It matters in this case 440-442 is roughly 7 cent difference  almost 8. Ive heard a piano at 442 and the band at 440. Doesn’t work so well haha",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1432614737279189003",
    "author": "oaklandmatt",
    "date": "2025-10-27",
    "content": "I will say I don't think it's all about their vision or when they want to pivot. It's a bit more nuanced. \n\nIf you are truly a producer collaborator (as opposed to a hired gun engineer or musician), it's about trying all the ideas and collectively deciding what's best. But remember YOU are the one who holds the keys to the execution of the artist's ideas. You can have ideas and try them yourself, but if the artist has ideas, it's still YOU that has to execute them (because presumably they're not a producer like you). \n\nSo you're actually building a big creative trust by helping the artist try stuff. If you can execute ideas that the artist can't quite articulate or do themselves, you gain a credibility where you can both listen and then say \"Ah, I see what you mean. I think this other version is best.\"",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1473041814369079529",
    "author": "Felix Byrne",
    "date": "2026-02-16",
    "content": "i’ll do a save copy in off their session and basically just turn it into a wet dream of a deliverable\n\nperfect organization, colour, markers in order, things are labeled, routing makes sense, stuff is in a general layout that is going to be easy to bring into a template and understand",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1027614559508377611",
    "author": "Daniel Ross",
    "date": "2022-10-06",
    "content": "Aaron Sterling Mono Drums pack for organic stuff is so dope. He just put the pack out but i'm obsessed with it.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169716822455631963",
    "author": "Nomograph Mastering",
    "date": "2023-11-02",
    "content": "There’s a reason those big bad capitalists that run large organizations get paid so much, it’s brutally hard to get tens of thousands of people on the same page, and when you do you can add enormous value",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171992413225623572",
    "author": "NoahNeedleman",
    "date": "2023-11-08",
    "content": "Ya I do this a lot with my prophet. Setup a midi track, and set the output to your Yamaha. \nSet up an audio track and set the inputs to whatever you’re running the keyboard to.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337310640955723868",
    "author": "montrose recording",
    "date": "2025-02-06",
    "content": "also, simple psa - audio to midi in pro tools can be so fruitful and fun.  just was working on a simple piano ballad and instead of adding new parts, i sent piano audio to midi data to a poly synth and played the knobs dynamically, then did the same with the vocal.  good stuff",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937551259605565462",
    "author": "thejadenmejia",
    "date": "2022-01-30",
    "content": "Matt, I suggest you start carrying around a grand piano in your bag wherever you go.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983780248275546193",
    "author": "sukhuno",
    "date": "2022-06-07",
    "content": "Pianobook would be my first recommendation",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986498676484620318",
    "author": "oaklandmatt",
    "date": "2022-06-14",
    "content": "loading up the new M1 and thinking of rounding out my synths/ vsts. i have all arturia and Narive Instruments and omnisphere and several others. i'm thinking of getting keyscape and/or trillian. i know some people that love either/ both and am curious if anyone here uses them",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986718349834739732",
    "author": "jonmatteson",
    "date": "2022-06-15",
    "content": "Not sure if you’ve upgraded or not yet but the Arturia v9 stuff is very nice and worth the upgrade cost. The Korg ms20 is sick and they did a big overhaul to the piano and prophet which both sound fantastic!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031610748306198549",
    "author": "NoahNeedleman",
    "date": "2022-10-17",
    "content": "Love Noire. All the kontakt pianos work for me for different vibes. Wonder if I can share presets, cause my preset for the gentlemen gives me 90% of what I ever need from a piano in a track.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032127642725527622",
    "author": "longstoryshort",
    "date": "2022-10-18",
    "content": "try sononym.  it's an AI based sample organizer, it organizes everything based on tags/tonality/type of sound.  the best part of it is you're able to find something similar at just one click, so say you have a sound that has a unique character, and you want stuff like it....it suggests it. obviously this isn't always super on point but i've found by chance it gives me some inspiring stuff that leads me to new decision making.  i like it a lot.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055174557222314084",
    "author": "Slow Hand",
    "date": "2022-12-21",
    "content": "Yup! Massive was my go-to for years prior to Massive X.\n\nThe biggest change for me is that the raw oscillators sound far better. The original Massive had a lot of aliasing that could make it sound hazy and flat. Switching over to Massive X it is crystal clear and even buzzy saw waves feel warm, pure, and tactile.\n\nIt has extremely flexible modulation capabilities that I find to be very musical as well as some very comprehensive ADSHR envelopes. It also has four different keyboard tracking curves that you can assign and tweak, which is very important when fine-tuning your patch to make sure that it sounds even across the entire range of keys.\n\nIt has a lot of musical sounding filters that can inject a ton of vibe, or be completely neutral. The *noise* section is robust and very flexible. I use it a lot.\n\nFinally, it has a great-sounding set of internal effects (delay, chorus, saturation, verb, etc) that can be placed anywhere inside of the routing diagram. It's always a bummer when the on-board effects aren't very inspiring. But NI has a strong catalog of well-designed dsp to draw on and integrate into their products, so it's turned out great.\n\nOverall, it's a very robust and well-rounded synthesizer that also does a lot of things extremely well. It can be super clean (like Serum) but also get very dirty, which I appreciate in a synth.\n\nThe only thing I don't like is that the preset browser kind of sucks. I prefer the original Massive's browser. NI is well aware and they have been overhauling it and slowly adding new features, so I trust in time this will be made better.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057076018550149242",
    "author": "Slow Hand",
    "date": "2022-12-26",
    "content": "Also shoutout to Luis Fernando Zepeda who could mimic vowels on his organ drawbars. https://www.youtube.com/watch?v=QD3TH8W0hFI",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080450297723371590",
    "author": "spectrummasters",
    "date": "2023-03-01",
    "content": "Logic Gang: quick share, Im finding the sample delay tool v useful in a few ways and reccommend for a few reasons. Picking up on the midi ticks convo last week, if youre programming in Logic , instead of dragging (and losing track of your moves) in the timeline/piano roll....throw one of these on an insert and increase the delay in tiny increments as you run down the track (typically hats and offbeat/ghost snares first) . You can quickly create the pocket youre looking for . Also added bonus...I believe under c. 12ms most people arent hearing a glaring time shift , (i dont go above 2ms ) so the delay is handy again just putting your hats , snares, percussive elements....just a millisecond or two behind/in front of each other so all your transient sounds are not hitting the 1/4,1/8, 16th counts at precisely the same instant. I find this helps with transients. Lastly, unlink the left and right on a stereo channel and youve got an instant width tool. Best for the transient and groove use tho imo.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1088159435022676019",
    "author": "Slow Hand",
    "date": "2023-03-22",
    "content": "To be clear, I'd recommend getting the *Subsequent 37* over the *Sub37*. The Subsequent was a refresh of the Sub37 that added some more headroom in the circuits, a far better keyboard, and some CV input/output. The better keyboard is worth it alone, because the Sub37 keys felt a bit thick and slow.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103331161616433294",
    "author": "Eric Martin",
    "date": "2023-05-03",
    "content": "posed the question because I just got tracks to “mix” that need lots of editing and it’s (to me) because the bass and guitar were cut outside of the drums and piano on a group that normally plays and practices live together in a room, Supreme failure IMO by not having everyone at the same time",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103398102951546930",
    "author": "cy (sigh)",
    "date": "2023-05-03",
    "content": "me coming from the lego/programmed world  trying to make it feel organic has always been my goal so this has been a v insightful read",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105126970112614551",
    "author": "louisvie",
    "date": "2023-05-08",
    "content": "This is probably a known thing, but the Korg Triton vst really is the best source material I can find to replicate that early 2000s feeling. \n\nMakes sense since it was the keyboard used by producers in those days.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105818824885932192",
    "author": "Adam Thein",
    "date": "2023-05-10",
    "content": "Mine just arrived yesterday.  I’ve got a session coming up that I knew this would be great to have for keys, vocals, and guitar sounds.  It’s definitely a bit limited in scope to lofi world but lord almighty it does those tones with ease and sounds awesome.  And the saturation knob like Noah pointed out is really sweet sounding.  I’m not a guitarist but I was playing around last night with keyboard sounds and full mixes and it was very inspiring.\n\nI agree wholeheartedly that $400 is a lot for one pedal.  Factor in another $60 for their midibox if you want to have it connected via midi.  They do have CC control of every feature on the pedal including the hidden ones and an Ableton Max4Live plugin that allows you to recall settings and automate parameters.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1124815044828479528",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-07-01",
    "content": "Hey @louisvie\nI hope I'm not late for the reply but Here are some workflow tips(with an assumption that you are doing foley first time).\n1.Download Your Sounds from https://sonniss.com/gameaudiogdc . They have almost 150-160 GB's of free Library of Pre Recorded sound which are royalty free which has almost everything  you'll need.\n2. Download Soundly(it's Free) and Use it as your Sample Browser for faster workflow as it's search functionality is specifically designed for searching foley sound,sfx,ambience etc(make Sure to Run it as Administrator for windows or it won't drag sounds to ableton) .\n3. Run Ableton in Gridless Mode for perfect timings for placing foley.\n4. Make sure to level and organise similer sounds together on the Go as it will help in later stages for sending stems for mixing.\n5. Going Scene by scene helps for preventing the overwhelm of the Huge Film.\nand all the Best for this Gig🍻",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139357734131740794",
    "author": "NoahNeedleman",
    "date": "2023-08-10",
    "content": "@LAPhill was thinking of you today while doing some “scoring” for my wedding video (DIY slideshow / iPhone video montage.) \n\nI loaded up Keyscape cinematic grand, Spitfire BBC Orch on 4 tracks, (violins, violas, cellos, horns,) and went at like I would a vocal arrangement- one voice at a time, which was great for internal voice leading and lead to some beautiful & unexpected chords. \n\nCame together really fast too.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150531467936546867",
    "author": "Slow Hand",
    "date": "2023-09-10",
    "content": "I don't know that music being hard is necessarily a good thing for it's own sake. I'd rather have it be easy and lower the friction between conception and realization. A lot of tech these days enables that ease and has opened the door to more people writing and producing their records.\n\nBut a secondary side-effect that I think we can all observe - and I think this is more to your point - is that musicians are leaning into those methods and not pursuing the hard work and practice that is necessary to do things like singing well, or playing piano with more than a base level of proficiency, or orchestrating an ensemble well. The expressive unlock of being highly proficient isn't being pursued like it was in the past decades (before we had so may technological means). People are - broadly speaking - more satisfied these days to settle for records that don't push into that potential.\n\nWhat we lose are the heights of expression that virtuosity unlocks. Whether that's singing like Aretha Franklin, or playing a simple ballad like Bill Evans, or writing a song with as much sophistication and lyrical wit as Joni Mitchell.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155601280291586230",
    "author": "Josh",
    "date": "2023-09-24",
    "content": "This is super sick. I think just making the saturation an actual knob (I didn't notice it at first), adding a delay, and having a mono toggle would be killer. Wanted to see if I could make a beat only using SKY and the Rhodes makes a pretty convincing bass!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172184394769891358",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-09",
    "content": "Had an amusing moment the other day that also served as a learning experience- singer sent me a raw demo for a song she wants produced (phone recording of her performing the song on piano without a click). After producing the instrumental and her revisions, I ask if she could send me the vocal track on it’s own expecting she will perform a demo vocal over the instrumental - what I got back instead was the vocal from the original phone demo isolated with some sort of AI/program. Taught me be to be super clear about what I need when communicating with artists who might be a bit more inexperienced",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196704706567876698",
    "author": "popaganda.",
    "date": "2024-01-15",
    "content": "Changing the subject here fir a sec, @spectrummasters I’ve been into the classic house thing for the past few months, everytime I go there in my dj sets it kills, now I want to do some remixes and productions. Any tips? I know you’ve rabbit holed on this. Learning resources, interviews, docs/history lessons,Best 909s? House piano? (I’m assuming m1) swing settings? Kinda broad I know, but wonder if some things can be distilled here from other people’s experiences",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196706630625132595",
    "author": "Edward Rivera",
    "date": "2024-01-15",
    "content": "I have some experience here. Question is very broad yes. Might be easier to post a tune that piques your interest and ask about what you hear. 909s are dope but sometimes you want an oberheim dmx. House piano is lovely but some songs don't even use it (it's the Korg M1 correct) swing settings can differ too, MPC 16 gets the job done in most cases. But also shifting around drums to be early or late is a vibe.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1262417842649956352",
    "author": "gatewoodsensei",
    "date": "2024-07-15",
    "content": "Nah you’re spot on. 😂 that nexus piano is abysmal",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267201939356258457",
    "author": "Josh",
    "date": "2024-07-28",
    "content": "I’ve been trying to break out of my box with guitar. So instead of starting with guitar I’ll just find the chords and start with either piano or some kind of a bass and go from there. Been an easy way to kind of detour around the roadblock but not necessarily a great way to get better at my main instrument. 😅",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276509451083317410",
    "author": "NoahNeedleman",
    "date": "2024-08-23",
    "content": "You try hi passing and compressing the shit out of the piano you have?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276532069245259869",
    "author": "Josh",
    "date": "2024-08-23",
    "content": "First try what Noah said. OTT rips. If that doesn’t work I know omnisphere, I think ANA, and a Google search for “free Korg M1 house piano library” should get ya going",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283888848757198879",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-12",
    "content": "All-around piano/keyboard production needs is probably Keyscape. Doesn't sound the best but covers a lot of bases",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283895299986821141",
    "author": "Adam Thein",
    "date": "2024-09-12",
    "content": "I used JRRShop for Keyscape with the GROUP code.  It ended up being $318 and change but they shipped a physical copy.  I think the last physical software I owned was Half Life 2",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283904198349426750",
    "author": "LAPhill",
    "date": "2024-09-12",
    "content": "+1 for Noire. I received an advanced copy of the H&W pianos, which I also really like (and appreciate that there's a grand and two uprights). Between those two libraries, my bases are pretty much covered. Still, like guitar, nothing beats the real thing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397242859203330201",
    "author": "NoahNeedleman",
    "date": "2025-07-22",
    "content": "Lots of ways to skin this cat. Try some shit see what excites you. But so far sounds like your guitars and piano are balanced, so the vocals will want to live in the middle. I wouldn’t be afraid of keeping them both there, one treated with a little more ambience or sauce",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937557545302757406",
    "author": "Slow Hand",
    "date": "2022-01-30",
    "content": "*Keyscape* has some fantastic sounding (and unorthodox) sampled keyboard instruments. That said I'm not particularly fond of the sound of it's LA Custom C7 grand piano. Which is a little too hi-fi for my taste.\n\nLately I've been very impressed by NI's/Kontakt's *The Maverick* grand piano. I believe it's a vintage Bechstein grand. The sound is robust and rich without all of the \"zing\" that I see in a lot of full-scale sampled grand pianos. It sounds \"woody\" to me. I think it would make for a very nice jazz piano.\n\nThey did a really good job of sampling every facet it and it has enough flexibility that you can dial in the really intimate Nils Frahm-style damper/pedal/mechanical noises, which I like.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "976643376097136670",
    "author": "jantrit",
    "date": "2022-05-18",
    "content": "Yes! Always laying keys parts back a hair, player dependant of course",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984077849260601456",
    "author": "rse",
    "date": "2022-06-08",
    "content": "I've found that Kontakt seems really interesting for scoring film, orchestra stuff, but it's not really my thing in a song production setting. Only things I really use are the Rickenbacker bass and some piano's from native instruments",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986613332771479622",
    "author": "philbarnes",
    "date": "2022-06-15",
    "content": "LOVE both. The Wurli and Dark Upright in Keyscape are daily drivers for me. Trillian bass rocks, I use it on every session in some way or another.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031609357403688971",
    "author": "ALXCPH",
    "date": "2022-10-17",
    "content": "or the free one called soft piano in the free Labs plugin by spitfire",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1056290027950317588",
    "author": "Slow Hand",
    "date": "2022-12-24",
    "content": "Oh, just one more thing. I find it very helpful to practice making patches by trying to emulate a given instrument's expression. I'm primarily thinking about note articulation, here. Modeling these behaviors is a good way to start thinking musically with a synthesizer.\n\nSo if I'm going for a \"horn\" instrument I want a patch that can do attack-y stabs, but also fade into notes and have complete dynamic control. It should also have some sort of brightness feature that I can open up at will, like blowing harder into some brass.\n\nIf I'm emulating a voice there's going to be a big emphasis on legato playing and fluidity, with some very expressive pitch control for bends and vibrato. Maybe some form of subtle formant control to shade the notes like a singer would with different vowel sounds.\n\nAn organ patch is going to be a dead simple note-on/note-off volume envelope with the expression coming from the addition or subtraction of different oscillators.\n\nAnd some patches are just going to be gangly chaotic messes that you do your best to wrangle. Something with a lot of chaos and feedback and squealing. You can't control it, but you just strap in.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105106754100002857",
    "author": "Ross Fortune",
    "date": "2023-05-08",
    "content": "Good shout. Had a dig, preset called “Grand Piano 1” does the gubbins",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108586938878931014",
    "author": "peterlabberton",
    "date": "2023-05-17",
    "content": "Was in a studio with a kinda crappy sounding grand piano and had a lot of fun recording that at various speeds—added a lot more life and vibe than it had in the good ol meatspace",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155251789592018964",
    "author": "Skyler Young",
    "date": "2023-09-23",
    "content": "The sounds are from vintage synths (prophet 5, Jupiter 8, model D), a real mellotron, and Rhodes and wurli etc. - all the effected sounds are ran through a chase bliss heavy pedalboard",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155886077345812641",
    "author": "Skyler Young",
    "date": "2023-09-25",
    "content": "Very happy you feel that way about the sounds! Ohhh those are both really good points the favorite buttons would be better there. You should be able to use your arrow keys to scroll go to next/previous sound but each daw treats it differently so buttons may be the move",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155953985606402048",
    "author": "Josh",
    "date": "2023-09-25",
    "content": "For some more options. I don’t really want the “best” patch. I just want something that’s as playable as a piano or Rhodes when I open a synth",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168869803675619408",
    "author": "Deleted User",
    "date": "2023-10-31",
    "content": "And for everything recording I make sure I have it plugged in and ready to go before. Like having an allround mic like a 414 ready, a piano mic’d up (if I got one there), cables for bass and guitar near me and so on",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171634575382958080",
    "author": "Deleted User",
    "date": "2023-11-07",
    "content": "mostly piano instruments from pianobook",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179918374675939410",
    "author": "gatewoodsensei",
    "date": "2023-11-30",
    "content": "I’m not sure if this’ll help, but I tend to go with whatever hits me at the time. If it’s a melody, I’ll sing it, mumble words, and allow the music to form around that idea. If it’s lyrics, then i grab a guitar or sit in front of the keyboard and play the accompaniment. Or if I’m in front of my computer, and melody line hits, I’ll play the melody, or chords and allow it to loop while I write. So I don’t necessarily balance, because to me that means I’m shutting part of my creativity off i order to allow the other part to flow, and more often than not, that kills the creative flow. \n\nSo don’t try to balance anything. Whatever you feel, go with that and allow your creativity to flow.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183505973546074172",
    "author": "Rob Domos",
    "date": "2023-12-10",
    "content": "slicing the audio is helping a lot already. helps my brain organize each strike as it's own thing as well. hell yeah ty",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186762724731002961",
    "author": "masteredbyjack",
    "date": "2023-12-19",
    "content": "Understood. Of course I master only all day, so I am not in wild sessions needing that stuff, I just have one to keep connected to the music and play a few times a month or so, but I love the synthesizers.com QBK line…incredible keybed, fatar synth action but no knobs or anything. That said, knobs on the desk that do midi can be had easy too.\n\n @Rollmottle would know more than me (or anyone else literally as far as application to producing goes), but if action is a big deal to you I’d check those out, you can also mount them to drawer slides easily or whatever, they are thin\n\nI’ve posted this here before but the Extra Deluxe one looks insanely cool too (but very expensive and I doubt it’s coming back ever). I believe it uses the exact same keybed as the synthesizers.com stuff though, just in a prettier package: \n\nhttps://www.extradeluxemfg.com/buy/extra-deluxe-keyboard-61\n\nMy knowledge of these things are several years old, I’m not up on what the newest stuff is since I went to mastering",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189667902987702406",
    "author": "Rob Domos",
    "date": "2023-12-27",
    "content": "Caribbean music tends to utilize subdivisions so much more. Earlier this year I was playing keys for a trini producer and he asked me to come in on the sixteenth note before the 1 and I was like… wtf no one one has ever asked me to do that before. sounded fantastic btw",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194567881455841341",
    "author": "Deleted User",
    "date": "2024-01-10",
    "content": "You can imitate that feel by minimizing the pitch deviation. e.g. melodyne vibrato turned down-  but not all the way down. \n\nThe sustain part having very little pitch movement is probably what made you hear it as synth-y sound. But the doubles are not perfectly in tune with each other so it still feels somewhat organic at the same time",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197067913891414026",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "You’ve got your drums …..and built your vocal chops , the chops are like your keys part …..and then you’re gonna weave a stealthy , hooky baseline to syncopate and spin with your chops and drums . As an example ….you could do a dembow rhythm over your drums with your bass part and then jam your vocal chops into that feel …..or vice versa , a dem bow feel on the vocal chops and a stuttering walking bass line part with that .  \n\nYou ll quickly catch a groove between the drums vocal chops and bass hook \n\nTodd Edwards is the yoda of voxal chops",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239238889919746079",
    "author": "montrose recording",
    "date": "2024-05-12",
    "content": "sweet.  my pt sampler game has been woeful.   maybe ill just use sky keys tho lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247577706208694273",
    "author": "Jonathan Jetter",
    "date": "2024-06-04",
    "content": "Mostly convenience, just the way my mix sessions are organized from the start. Everything gets slotted into a subgroup. I try to avoid having the same FX return serve multiple subgroups. Even if the settings are identical, I'll just duplicate it for the BGVs.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1279252440826384476",
    "author": "NoahNeedleman",
    "date": "2024-08-30",
    "content": "Not funny, but I put autotune on a scratch electric the other day cause it was *slightly* out of tune with the piano which ended up being the focus instrument of the track- it ended up sounding dope, real tape warbly but kept coming into tune instead of going out.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283894577606164501",
    "author": "Slow Hand",
    "date": "2024-09-12",
    "content": "@kylem Yeah, Keyscape is an excellent choice with some truly excellent sampled instruments, though a bit of an up-front investment ($400).\n\nIn fact, I just spent the last fifteen minutes practicing piano with Keyscape before taking a break here on the DIscord. It must be a decade old at this point, but Spectrasonics do a good job at supporting it. They're constantly patching it and a few months ago they added a fully-sampled felt piano instrument that sounds excellent.\n\nKontakt wouldn't be a bad investment either, since it's the backbone of NI's entire business model at this point, it comes with a sizeable sample library (not just piano), and new sample instruments are constantly being developed for the platform.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283900074237231215",
    "author": "Spencer Broschard",
    "date": "2024-09-12",
    "content": "Pianobook has some amazing free kontakt sample libraries. For piano, this guy's Yamaha and NY Steinway sound incredible: https://www.pianobook.co.uk/profile/dore_m/\n\nAlso the UAD Ravel piano is pretty nice",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283987069558984724",
    "author": "BatMeckley",
    "date": "2024-09-12",
    "content": "I find noire really useful, but I’ve also been using the PianoTeq ones which feel better. When it matters I’m often blending between the two.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298644531155046402",
    "author": "Ross Fortune",
    "date": "2024-10-23",
    "content": "Any favourite ways to create the thin piano at the start of this track? Particularly exposed at 00:14\n\nhttps://open.spotify.com/track/07m8PuXxxv5J4qPEDq6ZkK?si=ufwGrVMwRDK0taHyFOKsYA",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298925962745876570",
    "author": "Ross Fortune",
    "date": "2024-10-24",
    "content": "Nice. I think my chain was Kontakt The Giant with the tone all the way to “Hard”, Taj Mahal reverb setting built into the piano > pro-Q > cla-76 (or maybe faraday?) > OTT",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304896386667380786",
    "author": "cy (sigh)",
    "date": "2024-11-09",
    "content": "been playing  w stacks a lot fora few songs recently and often think of them as a chord arrangements. might even play it in on a piano for reference if I can't figure it out in my head. \n\nyou can often control density with the spacing of the harmonies - both in pitch and positioning in the track. \n\nusing different types of distortion on similar takes to bring in different /contrasting textures. \n\nbig stacks can take well to  really agressive EQ depending on how natural you need them.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313457739459989544",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-03",
    "content": "Oh really? What genres are we talking? Am I correct that you deal with a lot of organic sounding stuff? You think it’s people like, recording on their controllers?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313488570262093825",
    "author": "cy (sigh)",
    "date": "2024-12-03",
    "content": "that's been my exp. more organic productions tend to  have too much variation and the mix becomes more about controlling those and on the flip side I tend to add very small  variations on things that are obviously more programmed - really depends on the feel they want",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318430795370725399",
    "author": "Slow Hand",
    "date": "2024-12-16",
    "content": "Two cool things here:\n\n**#1 **\n@ 21:04 (where this video link starts) Greg demonstrates the difference between playing the synth part with piano technique vs a technique that's... a little less refined. It's remarkable how much of a difference it makes in the feel.\n\nhttps://youtu.be/t-_DbUzWlD0?si=nWLX1s38YrGbAEbN&t=1264",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1320166132002590800",
    "author": "BatMeckley",
    "date": "2024-12-21",
    "content": "I use as a chord generator a lot. Get into the keyboard mode. Good for idiot like me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1323729693903421532",
    "author": "Brian Reynolds",
    "date": "2024-12-31",
    "content": "I would grow into eventually doing everything above. But my impulse would be on the first one to stay true to original presentation that's already loved. Add some doubled Acoustics at points. Maybe a light pad or piano under parts. Then just vibe and grow from there. The guiding north star being where the artist is excited by",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336759231826624595",
    "author": "Zach Hughes",
    "date": "2025-02-05",
    "content": "Fwiw I'd wager the answer has less to do with being a better 'manager' of the group and instead helping to create the conditions for the group to organize themselves in a manner that feels good and feels productive to all involved. Maybe that involves you stepping into more of a leadership role prompting questions like what is this for? why are we here? What would make everyone feel like this time was productive? Could also be that some feel like the conversations are the point and maybe that is their favorite part.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411888700207665314",
    "author": "Slow Hand",
    "date": "2025-08-31",
    "content": "A few things:\n\n1. What kind of samples are we talking about syncing here? Short samples like drums and loops? Or heavy sampled instruments like a piano/string library? Or both? \n\n2. I think the equivalent syncing feature in Dropbox would be \"make available offline\". If you right click a folder and \"make available offline\" it will continually update when it receives uploads from the other computer. Have you used that before? It doesn't have the lightning speed of a local network/ethernet connection, but if you can wait a few minutes it's good.\n\n3. I assume these are Ableton sessions. Do you ever use the 'collect all and save' feature when saving sessions? It will gather every external sample (but not sampled instrument libraries) and save them to the project folder, which will save you the trouble of having to point your Ableton session to any external directory, because it will all be in the project folder. Very good when it comes to archiving sessions and opening them up years later.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428443726321160423",
    "author": "ltucunduva",
    "date": "2025-10-16",
    "content": "I tested it on a souless vst acoustic piano that I received for mixing and it kind of helped transform it into a more interesting sound. Almost without saturation and with a lot of room reverb from the plugin. The context was a folk rock like Steve Earle.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465760143021969652",
    "author": "oaklandmatt",
    "date": "2026-01-27",
    "content": "Truthfully you probably need to just start doing it. Use the mod wheel and pitch bend when you play keyboards. Learn to assign the cutoff of a filter to a knob on your midi* controller. Then use it. \n\nWhat instrument(s) do you play?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1473415174064050288",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-02-17",
    "content": "Lol I love how my question of 'any tips on how to organize when a project is overwhelming' and his initial answer (paraphrasing) 'just organize lol' became this convo\n\nWhat he said after was genuinely useful perspective (perhaps mainly from a mix prep standpoint more than one's own production workflow) but this has been an interesting flow of conversation",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937551028763623434",
    "author": "bennythetweet",
    "date": "2022-01-30",
    "content": "Addictive Keys or the Nord for me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937551316169920582",
    "author": "kc_kasey",
    "date": "2022-01-30",
    "content": "Keyscape is dope too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937551435548225556",
    "author": "itaylerner",
    "date": "2022-01-30",
    "content": "It’s super bright but i’ve always used True Pianos by 4Front",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937553469475278888",
    "author": "1ggy",
    "date": "2022-01-30",
    "content": "Scaler 2 is my shit lately. Best felt piano in the game.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937558205200998430",
    "author": "Slow Hand",
    "date": "2022-01-30",
    "content": "Speaking of Nils Frahm, I've heard good things about the *Noire* piano library that was sampled from his personal grand. Though I haven't used it yet. He's enough of a piano nerd *and* a tech guy that I'd be surprised if it wasn't excellent.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937641215086718986",
    "author": "Maxim",
    "date": "2022-01-31",
    "content": "I can confirm Noire sounds veeery nice. The plugin doesn’t capture the atmosphere of being in the room at Funkhaus 100% but you can still get some really “felt” tones out of it. Especially if you’re looking for a more organic and thick texture. Couldn’t see myself use it much in a standard production setting though. But other NI pianos are fine for that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937643733481050113",
    "author": "Zakhiggins",
    "date": "2022-01-31",
    "content": "Keyscape is great, but if you want a really natural, real piano sound, basically anything in the spitfire libraries is insanely good",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937657597488689242",
    "author": "Georgios",
    "date": "2022-01-31",
    "content": "I feel that I am doing okay, I have practiced with my voice and other people. However I sometimes I feel that I am tuning with my eyes instead of my ears. It would be cool if melodyne had an option to not have any piano or pitch lines in the background, just the voical. I have been doing also some esr training. Just was wondering if there are other forbidden techniques I could be doing haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957455146378465320",
    "author": "Rollmottle",
    "date": "2022-03-26",
    "content": "the piano & vocal version of Like Spinning Plates for example...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "965743741639991348",
    "author": "1ggy",
    "date": "2022-04-18",
    "content": "What are your guys go to production techniques for chords/melodies if you're not a pro on keys or guitar? Mine for example is using Scaler as a midi instrument, finding a cool progression or pattern and then messing with the midi. Or, finding a cool sounding melody in Splice and then using Pitchmap and/or melodyine to get it in the correct key and chopping it up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "965745872900067348",
    "author": "Rollmottle",
    "date": "2022-04-18",
    "content": "Big fan of Ableton's Scale and Chord midi tools so the same dumb finger patterns I make on the keyboard come out much more interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "971609734752915547",
    "author": "Zack Hames",
    "date": "2022-05-04",
    "content": "I actually had one and sold it, I didn’t like having to Load the samples because I’m a lazy fucker. I want that sp404 action but I can drop and drop into a daw format and hit on a keyboard or pad. Which I think battery can do. But idk I think I need to just bite the bullet haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982393590753923072",
    "author": "oaklandmatt",
    "date": "2022-06-03",
    "content": "yes to organic sounds in kontakt like bradley said. also check out chromaphone. super underrated pluck plugin",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982396495795998720",
    "author": "ehutton21",
    "date": "2022-06-03",
    "content": "feels like there’s a filter later on in the plucks that disappears, and it sounds like the piano at the intro takes some of the chords in the loop. would say if you’re having trouble with marimba sounds that don’t sound perfect a piano/organ layer is usually gonna round out the low mids in a way that feels like",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983780302096830534",
    "author": "sukhuno",
    "date": "2022-06-07",
    "content": "https://www.pianobook.co.uk/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986509697395863642",
    "author": "itaylerner",
    "date": "2022-06-14",
    "content": "Don’t own trillian but have used it several times and it’s so great for fat expensive sounding bass sounds - one of the best imo. Keyscape is incredible too but I haven’t found it doing anything that i couldn’t get from a kontakt library",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986520597842526239",
    "author": "ehutton21",
    "date": "2022-06-14",
    "content": "I own the omnisphere trifecta and there stuff is the best out there on the market right now. It’s absurd how versatile and flexible it is, there’s enough preset patches that you probably never would need to try and create your own sounds again but personally the design aspect of it is what sets it apart. Keyscape might not be necessary if you’re regularly surrounded by high quality keyboards, but trillian and bass library are incredibly invaluable to me for my needs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987364782376099880",
    "author": "Will Melones",
    "date": "2022-06-17",
    "content": "Trilian has the richest real sounding upright bass, too. Plus the integration between Omnisphere, Trilian, and Keyscape is pretty sick",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994680320588783656",
    "author": "ALXCPH",
    "date": "2022-07-07",
    "content": "I’ll use midi for synths, sample based keys and 808’s tho!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996666201172348988",
    "author": "prodbyobseen",
    "date": "2022-07-12",
    "content": "Legends, what’s everyone’s backup strategy? I just upgraded from a 2012 Mac Pro to a max studio and don’t have access to Sata drives. Have been in chats with splice about project backups (why can’t these be organised into folders like my prod disk RIP) but now looking into backblaze. Thoughts?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999380054289174678",
    "author": "NoahNeedleman",
    "date": "2022-07-20",
    "content": "Yeah that’s not outside the norm for me… but each set of vocals has a place and I organize them accordingly as I go, grouping, bussing, panning, processing. Moving on to the next part 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999725042713768056",
    "author": "ehutton21",
    "date": "2022-07-21",
    "content": "I organize better and can compartmentalize the production vs mixing vs tracking parts of my work if i at least have a session where the mixing is separate from everything else",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999736535878484068",
    "author": "ehutton21",
    "date": "2022-07-21",
    "content": "I started to split my sessions up after I listened to matt and jon on the episode where they talked about how they would organize sessions if they had to write, produce, track, mix, and finalize/master their own work. It’s not the most efficient method but even just the fresh template is revitalizing. When the plugin numbers start to pile up and the automation is getting hectic and the groups get a little crazy, i get too overwhelmed to make clear decisions",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999810076355330200",
    "author": "josephmossbridge",
    "date": "2022-07-21",
    "content": "Is there a way to save synth patches in a way that makes them playable in multiple daws? I’m organizing all of my synth presets into my own sound library and realized that FL studio saves them as “.fst” This is great if you want to use Fl studio forever but it would be great to to put these presets on an external hard drive and be able to use them in other daws, specifically abelton because I’m trying to switch soon. Any thoughts on this? I’m unfamiliar with organizing presets!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999838158793474168",
    "author": "josephmossbridge",
    "date": "2022-07-21",
    "content": "So this brings me to a much broader question, how do you organize your synth presets? Do you put everything into one big folder that has different dub categories? Or do you do that but inside each individual synth?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000197004053446706",
    "author": "RUDI",
    "date": "2022-07-22",
    "content": "How does everyone organise their drums / samples?  \n\nEspecially interested in opinions on anyone exporting drum sounds they love from sessions /  recorded dope percussion & wanna save for other prod\n\n🙏🏼",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000219571816517702",
    "author": "NoahNeedleman",
    "date": "2022-07-22",
    "content": "It’s so hard to organize until you have a sizable library. I’ve tried. I always end up just importing session data ¯\\_(ツ)_/¯",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031605520269836400",
    "author": "Johnny I",
    "date": "2022-10-17",
    "content": "Recommendations for a piano sample library for a convincible grand piano that works in a sparse vocal/piano arrangement? Kontakt, or Keyscape? I have access to a real baby grand at a friends house, but it needs some repair (some mechanical noises) and tuning and not sure if it’s worth the hassle.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031608972572119160",
    "author": "BatMeckley",
    "date": "2022-10-17",
    "content": "This is a really great library. They also make one at this price point called like soft piano or something. I have all the originals libraries and they’re always useful.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031610284353273987",
    "author": "ALXCPH",
    "date": "2022-10-17",
    "content": "did you update to NI 14 yet? i'm still on 13. The 40 keys and that vocal sample plugin look cool, but also like something that will sound super dated in about 5 minutes...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031611501380898816",
    "author": "Johnny I",
    "date": "2022-10-17",
    "content": "That would be great! Having a good upright would be nice as well. The Gentleman and The Grandeur seem like solid options, along with Noire. Any thoughts on Keyscape compared to NI and Spitfire?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031612950991093840",
    "author": "ALXCPH",
    "date": "2022-10-17",
    "content": "This might get me banned of this discord, But i've in certain productions actually prefered the stock ableton piano, to kontakt, spitfire and arturia when A/B ing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031612979520745494",
    "author": "BatMeckley",
    "date": "2022-10-17",
    "content": "All the guys better than me seem to love keyscape but I’ve never used it. It’s ALL OVER pop records tho.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031613390403141733",
    "author": "Jeremy Klein",
    "date": "2022-10-17",
    "content": "if you are going for \"obviously fake sampled piano\" then its great. lolololol and i dont mean that sarcastically",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031613534947254332",
    "author": "ALXCPH",
    "date": "2022-10-17",
    "content": "sometimes sampled piano sounds cooler than sampled piano trying to be real piano.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031613561870491768",
    "author": "BatMeckley",
    "date": "2022-10-17",
    "content": "I feel like a ton of people on the Alicia’s Keys piano for pop mixes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031613726513713273",
    "author": "Jeremy Klein",
    "date": "2022-10-17",
    "content": "Oh yeah i remember at least 5 or so years ago Alicia's Keys was everything. Especially with the velocity curve limited at only the lowest velocities",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031613759795494994",
    "author": "ALXCPH",
    "date": "2022-10-17",
    "content": "when that came out and a for a goood while after, those keys were fucking everywhere",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031701602270195723",
    "author": "GaspardMurph",
    "date": "2022-10-17",
    "content": "I love keyscape but I also find it to be super buggy with sustain pedal and release samples stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031702191318257705",
    "author": "GaspardMurph",
    "date": "2022-10-17",
    "content": "Maybe because midi is such old technology ? Anyways I tend to commit pianos pretty quickly now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031702265012179014",
    "author": "GaspardMurph",
    "date": "2022-10-17",
    "content": "Also I love the piano sounds in Nord keyboards!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031744242990718997",
    "author": "Will Melones",
    "date": "2022-10-17",
    "content": "Oh I always assumed the sustain glitching was a DAW-level midi problem. Never noticed a specific virtual piano being worse than others",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031745138122305607",
    "author": "NoahNeedleman",
    "date": "2022-10-17",
    "content": "I probably just use the kontakt pianos most",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031746076409086002",
    "author": "Will Melones",
    "date": "2022-10-17",
    "content": "I’m most definitely not saying you’re wrong. It would make sense that a huge sampler like keyscape might fall behind and get stuck more often than a small one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031903489112145980",
    "author": "Ross Fortune",
    "date": "2022-10-18",
    "content": "Big love here for Keyscape. Excellent grand, vibey upright, and tack piano (least used admittedly) with great presets that process the various models in such significant ways that they could easily be separate libraries. Also, the Wurli and Rhodes libraries (plus the vintage digital keys) are second to none (that I've found - very willing to be convinced though)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032013171168383066",
    "author": "GaspardMurph",
    "date": "2022-10-18",
    "content": "Ok here we go! What is everyone methodology for keeping samples organized ? I’m old school and do not use a sampler plugin so I’m basically dragging and dropping wave files into pro tools. If I want something I like I’m searching spotlight or important track data from an old session. It’s complete chaos + I’m planning on using Ableton more and more for sketching and I really hate having all those duplicate .asd files 😦 how do ya’ll do it ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033433341015375963",
    "author": "ALXCPH",
    "date": "2022-10-22",
    "content": "For live these days ill usually just bring a 25 key midi keyboard to launch tracks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033955775858626561",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "I really wanna get familiar with a korg/moog/keyboard style synth too. Something real versatile. Nothing I want immediately, just down the line at any point.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1049485638258405386",
    "author": "Deleted User",
    "date": "2022-12-05",
    "content": "soothe only worked for me on stuff like pipe organs. for everything else it's weird - it does its thing but it doesn't do what I think it would do. spiff is something I tried on multiple things but it never worked for me. the idea of complex transient shaping like that kind of defeats the purpose of transient shaping but I think if you are going to fuck with the sound it can be really fun.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050129655392370779",
    "author": "Deleted User",
    "date": "2022-12-07",
    "content": "That sound is on more processed side, but acoustic drum workshop has pretty organic sound (probably still processed) with 3 velocity layers and snare rolls. They also tell you the drum sizes so I find it pretty useful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051726649240064110",
    "author": "Zach Hughes",
    "date": "2022-12-11",
    "content": "I think it’s a question of trade offs and the pitfalls and benefits of varying choices. I don’t have a specific question but am more curious to discuss the topic  and hear other folks experience. Could go many diff directions.. how do we facilitate those ‘special’ moments with session players? Which I like the idea of getting the piece you know you want or need first and then playing the rest of the time. Or how to communicate and prevent really good players from over powering a song and doing too much? For this project I chose to leave a lot of room for the players to play and write their own parts, but I also needed to reel them in a little bit and simplify what was happening. Even then when I dug through the tracks I had to mute certain fills, take a simpler pass of the keys to let the bass do it’s thing or vice versa. This also makes me consider the question: when do you let a song suggest to you when something special needs to happen?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055430858326167582",
    "author": "ALXCPH",
    "date": "2022-12-22",
    "content": "Not sure if this has been mentioned, but the ableton pitch shifter and an EQ is great for this. Basically you are able to shift the fundamental of the sound without changing the tambre of the sample. EQ is just to visualise the fundamental moving. I have the same obsession with some tracks and can usually do it by ear now. If you are able to sing somewhat in pitch, try and sing the percussion sound, and find a note on the piano that matches it. If you get the technique down, I find it is the fastest way to do it. ❤️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1056543004833370162",
    "author": "Ross Fortune",
    "date": "2022-12-25",
    "content": "All this is so good gang, thank you! Got some direction now for my many days “off”.\n\nNext question will be how to focus improving my keyboard skills, but that’s another day’s work.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1056544156866072656",
    "author": "Ross Fortune",
    "date": "2022-12-25",
    "content": "On the 3-4 patches: what are they? I’m imagining one attacky bass, a pad that works in lower/mid/upper registers, a good playable poly keys patch with enough editable character to slot into different tracks… \n\nPresumably you find they cover enough bases, but I’d be wondering if having such a limited palette would narrow the variety of what I’m going to come out with. Often times it’s flipping through presets and finding something very unique sounding that will inspire a part that inspires a track for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057060835635236934",
    "author": "Slow Hand",
    "date": "2022-12-26",
    "content": "Totally. \n\nSo I should clarify a little bit. These 3-4 patches aren't static sounds that I never change. Think of them more like initialized synth templates with pre-determined routings and modulation that I can start with and then diverge from. I still use other people's presets, but using these templates can save me a good 15 minutes every time that I want to build a new patch and don't want to start all the way from scratch. They come with a lot of built-in expression.\n\nOn most of these I've got a lot of the keyboard tracking already tuned so that a bright patch doesn't get too harsh as I go up in register or it doesn't get too flabby and lose definition in the low-end.\n\nI've got one patch set up for very expressive pitch modulation. Lots of big sweeps and bends in the attack/release envelope phases. Think wonky Neptunes-type sounds or two-octave dive bombs. Stuff like that.\n\nOne patch is set for expressive filter and amplitude modulation. Wobbles, envelope modulations, and such. It's my go-to if I'm trying to play with some \"brassy\" dynamics.\n\nOne is a legato mono patch for very fluid vocal-like playing. A big emphasis on note articulation and variation. I think of it as a solo instrument.\n\nThe final one is (you called it) A nice poly synth. Think James Blake on a Prophet. Pretty standard stuff, but once again it's got keyboard tracking that's tuned up so that the patch feels rich across the entire range.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057070266070610011",
    "author": "Deleted User",
    "date": "2022-12-26",
    "content": "And I should check out Razor, I haven't really found intuitive Additive synths with modulation abilities besides Hammond Organs haha.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057073537657098290",
    "author": "Slow Hand",
    "date": "2022-12-26",
    "content": "Good call. Hammond B3/C3 organs go overlooked as additive synthesizers, but *what. an. instrument!* There's nothing like standing in the presence of a skilled B3 player.\n\nIt's unreal. I can't even imagine how impressive it must have been back in the 1940s when they paired it with a Leslie.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057320214385143940",
    "author": "Ross Fortune",
    "date": "2022-12-27",
    "content": "From a cursory Synthtopia scan:\n\n\"So it seems that Luis Fernando Zepeda is part of the Organist generation of 60s-70s Mexico City with others like Evaristo Enriquez or Juan Torres.\nThis technique was “invented” by Tito Enriquez but perfected by Ernesto “Hill” Gil Olvera, whom was blind, and recorded LPs under the advertising that he played “the Organ that Talks!”\n\nI found on a random blog that the drawbar configuration was something like this, you started with:\nA = 88 8000 000 00\nE = 80 8080 000 00\nI = 80 0080 000 00\nO = 80 8000 000 00\nU = 80 0000 000 00\n\nAnd you worked them with your left hand as you played with your right hand and play bass with with left foot and expression with right foot. It is a Hammond X66\"\n\n\nThere's lots of Ernesto Gil Olvera stuff on YT, but I (and my nephew) don't like it is as much as this Luis Fernando Zepeda track. Can't find anything else by him unfortunately.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061658965181726842",
    "author": "KushKadett",
    "date": "2023-01-08",
    "content": "Is it better to use a midi cable vs usb midi when interfacing your midi keyboard with say your mpc and other pieces of gear?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061755683663528016",
    "author": "Deleted User",
    "date": "2023-01-08",
    "content": "Saw some discussion on mixing channel about Jazz mixes. There's an album I love very much, and it's Brad Mehldau's Largo album. And when I looked at the album credit to find out who the drummer was, I found a producer on the credit. Which made me wonder what kind of a function does a producer in non-vocal jazz records would serve - things like snarky puppy is more obvious but this one is a bit different, it has more organic instruments and some interesting processing on it. I tried to find Jon Brion (the producer of this album)'s contact to ask him about the process but couldn't find anything - but does anyone have any experience producing jazz records? I'm curious to hear what were the roles\n\nhttps://en.wikipedia.org/wiki/Largo_(Brad_Mehldau_album)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066407593054064660",
    "author": "Adam Thein",
    "date": "2023-01-21",
    "content": "Hmm, yeah I’m not sure - it’s not an issue I’ve experienced and have used Ableton to run three keyboards live at a buffer of 128 and negligible input latency.  Wish I knew what was going on, I’ve never noticed a difference between Logic and Live for softsynths, but I might just not be sensitive enough to differences in latency under 10ms",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076946697516753067",
    "author": "oaklandmatt",
    "date": "2023-02-19",
    "content": "Yeah i feel you on that. I often find things piano do that for me. I assume it's cuz the waveform is so much more complicated than a vocal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1096086554600013965",
    "author": "spectrummasters",
    "date": "2023-04-13",
    "content": "With regards to making a call , I’d be interested in peoples perspectives . How do you make the call between following an artists ideas and helping them to articulate those ideas vs following your own instincts  that it’s time to move the process on and finish adding ideas in order to resolve and complete ? Ie . Recently I completed a project to master with an artist who was over the moon , planning the video ….no complaints , pure buzz , a few weeks later . I get the message “hey man I was just thinking what if we try and add a piano part “ . Imo the song doesn’t demand it , I suspect friends and armchair mozarts have thrown in their own 2 pence in the last few weeks and now what was in all our opinions 🔥, has to face tinkering . I don’t like telling people what to think , ie . I think you’re making a mistake …..but I don’t like overwriting songs , so for me it’s a obvious f that idea let’s just write another one  . I’d be interested in others internal dialogue with regards to when / if/ how you say no ….and if it sits with you alright personally or you find it problematic (and I ask this in order to find charming but assertive ways to keep the door closed on a project when it truly felt  finished to all involved  and went to full completion / master and release strategy and now as the producer you truly believe it can only be damaged by changes )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105065352322351114",
    "author": "Ross Fortune",
    "date": "2023-05-08",
    "content": "Dance music folks, any recommends for piano sounds in the Korg M1 universe (beyond the Korg legacy or the M1 itself)?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105074214521798747",
    "author": "Maxim",
    "date": "2023-05-08",
    "content": "slap the Waves Aphex Exciter on something like truepianos and you’ll get close but I still think the M1 sound is ‘the sound’ if you are going for that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105075325790064680",
    "author": "Maxim",
    "date": "2023-05-08",
    "content": "Also on true pianos (which is that great crappy piano sound on almost all old Avicii songs btw) max out the ‘keyboard dynamics’ section to really get that upfront vibe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105081889557057536",
    "author": "Ross Fortune",
    "date": "2023-05-08",
    "content": "Oh nice, thanks for the tip. Hadn’t heard of True Pianos.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108037304309784596",
    "author": "Brodie Stewart",
    "date": "2023-05-16",
    "content": "https://www.echosoundworks.com/house-pianos\n\nThis is free, and does the job!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123050821186232441",
    "author": "Josh",
    "date": "2023-06-26",
    "content": "Right? My dumb ass thought foot steps were just included organically",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1124610502916571156",
    "author": "louisvie",
    "date": "2023-07-01",
    "content": "any go-to plugins for little simz-ish instrumentation ? Like organic and orchestral real instruments, but still kinda tight / motown-y",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126883732750606406",
    "author": "Deleted User",
    "date": "2023-07-07",
    "content": "Looking for some new sounds\n\nAny alternatives to Trillian for Synth Bass/808s? Looking for Bass stuff sampled from Analog synths and machines. \n\nAlso looking for Nexus-esque pre made keyboard/synth plugin but for hip hop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1133111019682664568",
    "author": "suxpierre",
    "date": "2023-07-24",
    "content": "like when making a lot of bounces across a lot of songs - and wanting them to organize into the correct project folders.. while being lazy...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136382571282976818",
    "author": "lystell",
    "date": "2023-08-02",
    "content": "Let's say you're doing a house beat and it's kind of a bass drone thing. Like staying on the same note and building a groove. Are there traditionally better keys to do that in that plays well?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137066080129515564",
    "author": "chrissorem",
    "date": "2023-08-04",
    "content": "I’ve also mangled drums before to sound under water or manipulate them in a way that the mics can sound like two separate performances in a cool way. And then brought that hifi hat mic in juts for a  time and you can make an organic kit sound like a programmed kit. This has to be for the right kind of song ect. But record all the damn drums so I can mute them or use them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1144659827004547083",
    "author": "Jeremy Klein",
    "date": "2023-08-25",
    "content": "kind of stumbled into something fun. \n\ni accidentally duplicated 8 instances of default RC-20 back to back on a piano. and it sounds the most like that deep fried 1930's radio broadcast sound that i've ever gotten from a plugin.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150864823551266957",
    "author": "stevestmartin",
    "date": "2023-09-11",
    "content": "The same way you don't have to learn to play drums, piano, guitar, or sing, etc.. digital audio has opened up a world to non player musicians to focus on the part of music that interests / excites them most. AI I think will create new styles/ideas as the interface artists use to express their musical ideas becomes less technically challenging.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154979195311632557",
    "author": "OJ",
    "date": "2023-09-22",
    "content": "Like is it being able to play the piano or is it being a good conversationalist with an artist",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155580910440304802",
    "author": "Rollmottle",
    "date": "2023-09-24",
    "content": "Nice job on this dude! Sketching today and your plugin came in really handy. Immediately usable. Some of the UI maybe needs some tuning, but once you play with it, you can figure it out. Pad and Rhodes in this from SKY Keys.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1155624807971434506",
    "author": "Slow Hand",
    "date": "2023-09-24",
    "content": "@Skyler Young This looks cool. A neat feature I'd love to see someday would be to add a simple EQ device and allow internal resampling of one-shot samples. The idea is that samples often have some boxiness or ringing that needs to be EQ'd out, but those problem-zones shift when the sample is transposed up and down, making any post-sampler EQ moves ineffectual.\n\nIf you could streamline the process of re-recording a static sample with the necessary EQ cuts committed into the one-shot then those cuts would be transposed along with the sample when you play it up and down the keyboard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155937180007551016",
    "author": "Skyler Young",
    "date": "2023-09-25",
    "content": "Let me know if you have any suggestions on which sound should be the default patch - I thought a simple sine keys patch was an agreeable place to start but very open to changing it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155957228562559068",
    "author": "Slow Hand",
    "date": "2023-09-25",
    "content": "Great point. Nobody wants another \"Ice World\" multi-layered evolving synth patch as their default. My personal preference for default patch is a polyphonic sine wave with a simple envelope, but a workhorse piano-esque sound is great too.\n\nBetter yet, make the default patch user-assignable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156055184238190633",
    "author": "Trolligator",
    "date": "2023-09-25",
    "content": "@Skyler Young btw i made this piece of garbage with your keys plugin today. everything that isn't an acoustic guitar in this is from your plugin which was just an absolute joy to use. there's a pad sound, a piano, a wurli, a soft pluck thing, and a guitar patch played super low masquering as a bass.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1159918601147527250",
    "author": "Chris Doms",
    "date": "2023-10-06",
    "content": "Realizing I never followed up, but I ended up tweaking the Rhodes preset a bit and using it on a project! Definitely gonna keep working with this. I was digging a lot of the sounds and the UI makes sense to my brain",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161013243263848539",
    "author": "xico1702",
    "date": "2023-10-09",
    "content": "Hi folks! Hope you're doing great! I want to ask you something. My name is Francisco, from Portugal, I'm 23 years old and I'm a self learner about music theory and music production. I know how to play piano and strumming acoustic guitar a bit. I started to using a DAW in my 14s (FL Studio, yeah I know xD) and in the last 3 years I've been using Logic Pro and last months Pro Tools (just for editing and mixing).\n\nI love to produce electronic pop with a mix between synths and acoustic instruments. I want to be more versatile and confortable producing other genres (genres that I can produce just in my bedroom studio without having a great recording gear). \n\nI'm feeling stuck, I'm trying to listen different genres. I'm feeling very limited because I don't have a great background as a music player or student (my bsc is physics engineering). The music industry is tough and I want to be more confortable to work in other genres.\n\nI tried to be as brief as possible. What advice do you have for this situation? If I forgot to say something, I am free to respond. Thank you for your attention! Sorry about my english. 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169257269578432552",
    "author": "youngteam",
    "date": "2023-11-01",
    "content": "The thought process is I want to be able to make beats in various styles very fast because I feel a lot of sessions are like this. You don’t have to use a sample for inspiration it can be a couple of piano or guitar chords. I’m trying to understand what producers are looking for in samples as I make them myself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171636961275039855",
    "author": "Deleted User",
    "date": "2023-11-07",
    "content": "these are all free by the way on pianobook",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171988395510202478",
    "author": "Yoel",
    "date": "2023-11-08",
    "content": "I have a yamaha piano and it can receive midi and transmit midi. Let’s say I have a midi file but I want to get the sound from the Yamaha keyboard, is it possible to send midi in and receive audio from it and record it in my daw? \n\nIt’s Yamaha Digital Piano CLP440 \n\nAnyone know how to do this in Pro Tools?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175265202279829535",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-17",
    "content": "Never used anything but their felt piano, but surprised the orchestra stuff is out of tune! Learning stuff on here as always.\n\n@LAPhill I was wondering about your thoughts on the CSS strings - I noticed the absence of them in your list of good ones. Are they hard to make sound good/program?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1176918559071404112",
    "author": "LAPhill",
    "date": "2023-11-22",
    "content": "I use faders on an iPad, but ideally you’d have some physical faders. I wouldn’t recommend anything too small, I prefer at least 60mm throw faders, but any MIDI keyboard with some built in would be fine. I like to ride expression and mod together, so the mod wheel on a keyboard wouldn’t cut it for my needs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179878463973376010",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-30",
    "content": "Songwriters who are also producers how do you balance songwriting and producing? As someone who writes songs but also likes producing for the sake of it and also does a lot of work for others I struggle to give it all the time it deserves. Especially my songwriting seems to suffer since I spend so much time on producing. \nFor the record I‘m a „sit down on a piano and write the song from start to finish“ instead of a „ let‘s make some loop and throw some toplines on it“ type of guy \nSo since I spend most of my time on producing I wonder if you have/had the same problem and any strategies to avoid it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181634799291609199",
    "author": "Josh",
    "date": "2023-12-05",
    "content": "Also helps me organize the clutter in my brain. I realized that a lot of issues with ADHD is I just have too much going on in this noggin and being able to organize those thoughts on paper kinda feels like I’m “letting go” of them. I’m 99% sure that’s a coping mechanism people teach to literal toddlers but it’s been a cool exercise for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181770602231636019",
    "author": "Zack Hames",
    "date": "2023-12-05",
    "content": "My MPC Live is my right hand man in the studio as a writing tool. But when im NOT making records and mixing and recording, I make industrial music entirely on hardware. So the MPC is the daw in this case. No computer. \n\nIf I’m using the MPC on a production where it isn’t the brain, it gets a little cumbersome, sometimes I make stuff on it and simply record it analog into pro tools. Other times I actually export the “stems” on the MPC as it’s very easy then take the sd card and drop the files into the session. This is a little time consuming but works and sounds great. \n\nThere is MPC software/plugin that works with it! I just haven’t integrated it with my daw yet, but it seems legit. \n\nI don’t program drums on a piano roll ever, I always hit the pads.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181770703100461188",
    "author": "Zack Hames",
    "date": "2023-12-05",
    "content": "(Or I do general MIDI keyboard drums)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183554168171003984",
    "author": "Deleted User",
    "date": "2023-12-10",
    "content": "it’s generally the orange if it’s something like palm muted guitars. But always listen and feel it. It can feel better to be early in certain styles but it can feel better to be late on other styles. it also depends on who else is doing what\n\nBut groove template is always there if you wanna line it up with other instruments. bounce and make the source and destination audio files the same length, make sure the markers are in the correct place then sync them up. \n\nI’m 90% manual editing though. Because aligning automatically can fix notes I didn’t want to fix. you can also go measure by measure to be more careful if you want to auto align with groove templates \n\nyou want to ask yourself “is this note late or early?” before making any moves. I like nudging with keyboard so I can fine tune how far it goes. \n\nNowadays I’m more committed to “the only way to make the groove feel good is to play it that way”. I hate having to edit and to be honest, nothing beats well played rhythm section… Especially because I do a lot of in between the groove stuff, 30% quantization can mess with the feel of well landed notes. So I’m doing a lot of metronome practice these days",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186742270221889566",
    "author": "jonmatteson",
    "date": "2023-12-19",
    "content": "on the hunt for a decent feeling 49 or 61 key midi keyboard again. \ndo you have one you dig?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186744556683796570",
    "author": "masteredbyjack",
    "date": "2023-12-19",
    "content": "Do knobs and whistles matter or is the feel of the keys the biggest factor?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197059035418071110",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "2. Vocal chops \n\nListen down to the main vocal and whatever really jumps out ….a little melody run or phrase ….chop up and replay on the keyboard\nThink of your vocal chops as a keys part . Play the chops backwards , re form a new melody , reverse etc . These chops are now a rythmic device",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197061149372448838",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "4. Bass and keys \n\n\nBass has to be the hook playing off the vocal chop \n\nIn logic the FM synth and I think it’s ES1 all have the house bass and organs and pianos (will check the modules and edit this if in correct )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202660277066145803",
    "author": "LAPhill",
    "date": "2024-02-01",
    "content": "An old composer friend of mine has something like that, and would play piano pieces with it. Pretty insane",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203367161561878568",
    "author": "Edward Rivera",
    "date": "2024-02-03",
    "content": "If you have the inputs for it, it saves you a lot of EQ (bright and dark) if you're doing more organic productions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204467367024005150",
    "author": "chrissorem",
    "date": "2024-02-06",
    "content": "Anyone ever had luck using poly tunning in melodyne when there is bleed in mics? For example I’ve got piano in my vocal mic and I need to touch a few spots up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204480568180474006",
    "author": "Ross Fortune",
    "date": "2024-02-06",
    "content": "Not a Melo guy, and obvs depends how exposed the piano and vox are plus how much of the vocal sound is being provided by the piano mics… but on a live thing I had good results taking LV out of the audience mics with RX. \n\nGrabbing the fundamental then getting RX to select the harmonics, and running spectral repair to bring them right down. \n\nIt was easy to be more heavy handed in that scenario though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207414795733704765",
    "author": "Zach Hughes",
    "date": "2024-02-14",
    "content": "Producer peeps, any recommendations for violin / strings vsts for demo'ing out parts? Closer to natural / organic sounds than overblown / processed / fake af sounds. I've got some Spitfire / NI options but wondering if there's something better out there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211676679815299115",
    "author": "esquinalee",
    "date": "2024-02-26",
    "content": "Absolutely. I’ve also been using it to bring some life into DI nord keys on a recent set of mixes and it’s been super helpful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217491751988625578",
    "author": "omarakrouche",
    "date": "2024-03-13",
    "content": "It’s definitely on the main piano in the song so I thought they just put her vox thru it too hahah",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222336842037461193",
    "author": "louisvie",
    "date": "2024-03-26",
    "content": "At some point I wanted him to try again and he felt like last take was good.\n\nI used the dry vocals and did a similar but more controlled/blended in the rest of the instrumental sound. We let the previously over-treated vocal sit in a right place for the song and then the whole narrative of the performance just showed itself to us when playing all of that back. He said he felt happy about what we got, I did too, and keyboardist came to the studio at the end and was excited.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1227912631327653991",
    "author": "cy (sigh)",
    "date": "2024-04-11",
    "content": "I produce /write  and mix. \nI'd say about 60% mix work but mostly cause the production stuff tends to make longer w my clients. \n\nI have no issues jumping from project to project but I personally HAVE TO have all ny task organized and planned in my head.  so either the night before or when I wake up (at 3am usually) I'll organize my tasks on Notion based on project urgency etc and pick 3 things I have to do and 3 things I'd like to do \n\nfrom then I just make sure to jump between what I have to do whenever I feel like there's no forward movement on something. the 3 extra things are backups that I jump to in case I'm really uninspired w the others for some reason.\n\nI will say I use a timer to take 5-15mns breaks regularly and will often do short workouts to get the blood flowing which I find helps me maintain more consistent energy on long hauls \n\nif it's production work specifically I'll write down the tasks as specifically as possible and try to hits check point whiting 20-30mns if the goal is spcific enough,",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240384479655235675",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "I feel ya . I’ve got all the Roland , linn and CR , the Akai mpc disks and the s1000 , 3000 sampler disks . Happy to organise sharing them for anyone who gets interested in future",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240518840731828274",
    "author": "Slow Hand",
    "date": "2024-05-15",
    "content": "Does anyone know if there's a program, synth, or protocol that allows you to modulate synthesizer envelope times based on the duration of the MIDI note?\n\nFor example, if I draw a quarter note (on the piano roll) and my synth plays a one octave downward sweep it would take a quarter note's worth of time to execute that sweep. But if I draw a MIDI note with a whole-note duration the synthesizer would modulate it's envelope time and that same sweep would descend over the course of a whole-note.\n\nThe synth would have to read upcoming MIDI note lengths from the the piano roll and modulate it's parameters on a note by note basis by reading the note duration before the note-on message. There would have to be some sort of communication between the synth and the DAW, and of course it would not work in real time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240524390106533888",
    "author": "Slow Hand",
    "date": "2024-05-15",
    "content": "It would be cool if there was an ARA-like integration where the synthesizer's sequencer could exist in place of the piano roll.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241148499383419101",
    "author": "Slow Hand",
    "date": "2024-05-17",
    "content": "Yeah. I'm excited to see what MIDI 2.0 can do, but I don't see many developers implementing it. Roland has released MIDI 2.0 keyboards, and the new line of NI keyboards seems to have it (though it may not be fully implemented).\n\nI wonder when DAWs will start implementing it. I'm curious to know if having more CC resolution is going to make an appreciable difference in performance.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244804713409679360",
    "author": "NoahNeedleman",
    "date": "2024-05-27",
    "content": "Every try band passing before going into decap on punish? \n\nI had some real fun with Filter Freak this past week, just absolutely destroying a piano sound.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247242598758875217",
    "author": "JakeTB",
    "date": "2024-06-03",
    "content": "Usually it’s taking a beat from somewhere like a Simon Harris compilation and right clicking to “extract groove”\n\nThen you can apply that groove to whatever you’ve cooked up in Life to give it a more organic, “played” feel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247600990585094174",
    "author": "SoundsLikeJoe",
    "date": "2024-06-04",
    "content": "True....   for film score jobs,  I've stolen tips from Randy Newman....  I'll sit at the piano and just watch the scene and \"church underscore\" it by playing free time around the dialog.  Then come back and tempo map the click to what I had played.  Write the parts to that. Print the charts, and send the click map to the players.  In that case, it's both without and WITH a click.   It's not YES or NO.  It's both.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247603342616563763",
    "author": "LAPhill",
    "date": "2024-06-04",
    "content": "Randy can also sit down at a piano and improvise something that will make you cry, I'm far too mediocre of a player for that. 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255763662971605073",
    "author": "spectrummasters",
    "date": "2024-06-26",
    "content": "U.K. garage did not have this sort of organisation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261071679384191077",
    "author": "Ross Fortune",
    "date": "2024-07-11",
    "content": "So rad. How did you mic the piano with lid closed here? I think I have a dim recollection of km86s rigged up in the body with duck tape, or I might be misremembering…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276409764301246486",
    "author": "lystell",
    "date": "2024-08-22",
    "content": "What sounds are you using for house piano? \nI'm doing a production in the style of Electricity - Silk City.\nAlways found it hard to find something that sits nice in a production and that has that weight but feels light at the same time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276624355836821644",
    "author": "lystell",
    "date": "2024-08-23",
    "content": "Thanks guys!. @Iwan Morgan @Edward Rivera @Matthew The Cooke🎄🎅🏻 \nThere's a M1 preset on the Nord but not super fond of it. I'll mess with filter and compression and see if I can make it fit.\nMight find a better sounding otherwise",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280285762914484366",
    "author": "Slow Hand",
    "date": "2024-09-02",
    "content": "@Rob Domos Do you own Reaktor, by chance? \n\nThe *Space Drone* by Martijn Zwartjes synth is wonderful, and I've never seen another approach to particle synthesis like it. I modded it many years ago to conform to keys and chords. I'll send you the patch if you want.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280945839266730076",
    "author": "Slow Hand",
    "date": "2024-09-04",
    "content": "I like the idea of using a softer palette so that the vocal diction cuts through. Maybe a simple felt piano is all that's needed.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280982773166899322",
    "author": "NoahNeedleman",
    "date": "2024-09-04",
    "content": "Excellent instincts. Write your themes on Piano and go from there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1281004184711200770",
    "author": "Chad Rodgers",
    "date": "2024-09-04",
    "content": "I did a thing for a new Duracell battery announcement video a few years ago, not as epic as the UN and world peace but it sounds like a similar vibe (two people in a clean corporate setting talking about their vision for the future, clean tech, innovation and legacy, nice B-roll etc). \n\nFor this I did a simple high-shelved felt piano piece where it glided up and down, sometimes layered to give body and tension, and used soft white noise and other relatively muted tones to create movement and moments in the form of risers and sweeps etc. It was relatively unobtrusive and tonally appropriate for the subject matter, whilst being a little bit uplifting too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1282004140951605439",
    "author": "Eric Martin",
    "date": "2024-09-07",
    "content": "As a player I like pushing air and haven’t found a vst that sounds like my 68 Bassman & Late 70’s Rhodes cab, BUT as a listener, I have recorded so many parts with the HX Stomp that almost no one would recognize in a mix isn’t an amp.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283888257515388969",
    "author": "kylem",
    "date": "2024-09-12",
    "content": "Apologies if this has been asked before - best piano vst for all around production needs? My friend is using stock logic piano for everything. Trying to get him to level up. Is addictive keys the move?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283889913649037322",
    "author": "Adam Thein",
    "date": "2024-09-12",
    "content": "Keyscape rocks, just finally caved and grabbed that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283890061733007371",
    "author": "Adam Thein",
    "date": "2024-09-12",
    "content": "For a total beginner with libraries I’d take a hard look at the UVI Key Suite, covers basically the same ground and a bit more than Keyscape for less $$",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283890235985629235",
    "author": "Adam Thein",
    "date": "2024-09-12",
    "content": "A full copy of Kontakt and a few hours combing pianobook.uk also a valid option if they dont mind doing some digging",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283895423597150218",
    "author": "Slow Hand",
    "date": "2024-09-12",
    "content": "Speaking of piano instruments, I'm in the market for a MIDI three pedal controller (sustain/sostenuto/soft) to go with my Korg SV-1. Does anyone have a three pedal sustain that they'd recommend?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283932891235094569",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-09-12",
    "content": "It‘s great if you need a „basic“ piano sound without a lot of fuzz that still holds its own",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283989922247610369",
    "author": "Skyler Young",
    "date": "2024-09-12",
    "content": "People keep telling me to check out pianoteq - crazy that’s it’s not sample based!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290038799941898302",
    "author": "youngteam",
    "date": "2024-09-29",
    "content": "tell this to stevie wonder who has his pianos and all the players in his band tune strictly to 442",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298783754277359738",
    "author": "Rollmottle",
    "date": "2024-10-23",
    "content": "I can hear a familiar time modulation on the sustain before the verse kicks in at :33 which makes me think it could also simply be a piano into Valhalla. My \"Eno piano\" move is piano directlly into Valhalla compressed to taste.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298926410341023796",
    "author": "Ross Fortune",
    "date": "2024-10-24",
    "content": "Yes, with that piano it got too aggressive sounding for the chillness. I don’t own omnisphere but I wonder if there’s a good patch in there that does the thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1303086652180140104",
    "author": "Bryan DiMaio",
    "date": "2024-11-04",
    "content": "bet you could use keyboard maestro to make a modifier key for the mouse wheel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308926786544865361",
    "author": "Ross Fortune",
    "date": "2024-11-20",
    "content": "I’ve sat down a few times to try assigning keyboard shortcuts and see how standalone feels like that, but end up getting frustrated by how slow I am and reverting to AT graphic. \n\nSome solid guidelines should help get into the swing of it though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310961103521447998",
    "author": "Sam Segarra",
    "date": "2024-11-26",
    "content": "Reverse reverb on an arpeggiated piano chord 100% wet has been a go-to for me. En verb in logic has a cool stock setting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319744935766921217",
    "author": "Zack Hames",
    "date": "2024-12-20",
    "content": "So, I think it’s superbly underrated. Especially the new Akai MPC lives, one, etc series.\n\nI use it as a drum machine/sampler/sequencer for all of my hardware synths. It’s the brain and controller for everything.\n\nBut you can also use it completely on its own, you can put any sample all the way across a keyboard/pads to the correct pitch automatically. \n\nThere are built in AIR effects. You can time stretch, etc do whatever with samples. \n\nLoad up any drum samples and go to town. \n\nIt also has some built in instruments / synths, but I rarely use those. \n\nIt’s essentially a portable DAW as far as music production. I prefer it to computer by far for producing / writing with samples and synths",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319757922934198354",
    "author": "Adam Thein",
    "date": "2024-12-20",
    "content": "Been kinda on the deep hunt for hardware arpeggiators that can do some specific things.  Got a Midicake ARP in the other day but was disappointed to find out it can't do keyboard splits on the input to allow you to have multiple arp patterns from different ranges on the same keyboard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1332508845100105799",
    "author": "NoahNeedleman",
    "date": "2025-01-24",
    "content": "This keyboard sound is scratching places in my brain I don’t know we’re itchy",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346576371056382054",
    "author": "Slow Hand",
    "date": "2025-03-04",
    "content": "Other strategies for re-vamping the feel and arrangement:\n1. Trying putting instruments in different registers (move the bass up/down an octave).\n2. Play the song in a neutral form like only piano and vocals and listen for what it might suggest.\n3. Substitute instruments (Ex: bowed bass instead of electric bass).\n4. Try a different key.\n5. Try half-time. Try double-time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1373093478828998707",
    "author": "Brian Reynolds",
    "date": "2025-05-16",
    "content": "Jazzy B-3 Tonewheel Organ makes for a dope sub bass",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1379069139720601684",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-06-02",
    "content": "Does anyone have free, royalty free samples of a train beat they could send over? Kinda like this one but less compressed/more organic sounding? would be of great help thanks",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1386477275276378122",
    "author": "chris_donlin",
    "date": "2025-06-22",
    "content": "Love this question, I’ve been on a big panning journey the last two months because I’ve always just doubled things and panned everything evenly. I was listening to an episode on Sonic Scoop about Nigel Godrich’s approach to mixing and it was really eye opening to hear how bold his mixes are. I used to get distracted when something was panned but not balanced but after just forcing myself to do it I’ve gotten more comfortable, and even fallen a bit in love with what panning can do. I’ve noticed I have a tendency to pan instruments a certain way, pianos sound better panned, electric guitars always feel better panned right, no reason why it just does. Find what feels good to you! I haven’t gotten bold enough to pan bass and drums to a side. One day",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387834486179368980",
    "author": "Brian Reynolds",
    "date": "2025-06-26",
    "content": "I'm always layering my melodic instruments in the stereo field. I imagine it like making a cold cut sandwich. Noah's comment unlocked something, I hadn't done before, moving the melody thru different layers. The main melodic guitar. I had it at like 60% where I normally leave it. But had it widen to over 80% in chorus. Then more narrow than I would normally have a doubled melodic at like 35%. Usually id just do one guitar, mono to scratch the scene change itch. I save hard panned left right area for chorus guitars or stereo stereo synths to swim in. That with dropping the piano for first half of verse 2 did the trick! Still hoping this is a catalyst for more sharing of ideas",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397217566237266083",
    "author": "Johnny I",
    "date": "2025-07-22",
    "content": "Are doubled lead vocals typically panned hard or just slightly left and right of center? \n\nIf you had a production with 2 acoustic guitars playing slightly different parts (hard panned L and R for width), a stereo upright piano, and a doubled lead vocal, how might you approach the panning of these 3 elements in the stereo field?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1398814968073289792",
    "author": "CamSoss",
    "date": "2025-07-26",
    "content": "__Q for the group:__\n**How do you stay organized with your various projects at different stages? Anything you've found particularly helpful?**\n\nFor me, my perspective is as a songwriter / recording artist / producer. Currently I'm heading into more of a production focus as opposed to songwriting. This go around I'm aiming for a simple and energizing workflow. Here are some tools I've used over the years.\n\nObviously the system that works for you may not work for the next person, but perhaps we can all share what works for us and gain inspiration!",
    "reactions": 0,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "1416052755272827041",
    "author": "Brian Reynolds",
    "date": "2025-09-12",
    "content": "Aksel Coe and Aaron Sterling make great sounding drum packs. I have success with using live loops and fills. Organize the performance I want. Then layer samples on top of the snare and kick as needed for fulfilling excitement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417224503871672492",
    "author": "diamndsdancin",
    "date": "2025-09-15",
    "content": "Does anyone have any ways to get inspired when sitting down to produce/create a song?\n\nFor example: I usually sit down with a piano sound and play with chords, but sometimes I’m not really feeling it like today. Sometimes just playing a drone sound in a certain key helps.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418316605963894904",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "I've got my prophet 6 going midi out to a MOTU midi USB interface...it doesn't matter if I use that, put a midi note in the piano roll with my mouse, or if I click the cell to hear the sound, it all behaves the same way.\n\nI am going to experiment with the files themselves and where the files live to see if it fixes anything.\n\n\"load into cell\" so far has not worked. it just sits there and nothing loads in. IDK if that's a sample rate issue of some kind",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429524902284886038",
    "author": "Brian Reynolds",
    "date": "2025-10-19",
    "content": "I know nothing about theory. But big fan lately of playing the two outside notes of a triad low on left hand. Then play the middle note one octave up and play some other notes with the right hand after main chord hits. Also stacking two chord progressions on top each other, most of the time ones that a more talented piano player could play at once.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465972295691669515",
    "author": "Rob Domos",
    "date": "2026-01-27",
    "content": "Appreciate the guidance! I produce less than 1% as much as I engineer so some things y’all take for granted in producing land can still be eye opening for me. \n\nTo answer - I play piano well and fuck around on everything else",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471319428594667713",
    "author": "diamndsdancin",
    "date": "2026-02-11",
    "content": "anyone recommend a more budget friendly plug in to put on top of piano to make it sound even more authentic / put in a room like Ocean Way Studios Deluxe\n\nI was watching tutorials on this and sounds beautiful but bit pricey for me right now",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472955764262961414",
    "author": "Ross Fortune",
    "date": "2026-02-16",
    "content": "Chaotic how? Just poor organisation, or there’s too much going on in the arrangement?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472961235887853588",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-02-16",
    "content": "poor organisation mainly, too many tracks etc, feels like 'technical debt'. \n\nSomeone suggested bouncing as stems into a new project, I'm curious if there's other approaches people are using. When a project has been going on for a while I sometimes get hit with this overwhelm",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472962380551164034",
    "author": "NoahNeedleman",
    "date": "2026-02-16",
    "content": "I wasn’t kidding about time. Dedicating a session not to recording or mixing but to thinking about the session and how to organize it for your brain to work well moving forward. \n\nchoosing what to print and what to leave live, how to organize the session. I know it ProTools, SAVE COPY IN, only selected tracks, including all audio files, is a great way to pare it down.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]