[
  {
    "id": "1196682595795210270",
    "author": "BatMeckley",
    "date": "2024-01-15",
    "content": "Couple things:\n1) no one is actually a perfectionist. It doesn’t exist. I heard a great story of someone telling (I want to say) Richard Marx that he hadn’t released his record yet cause he’s a perfectionist and RM replied “Bullshit. Name one thing you’ve ever done that’s actually perfect. You’re just scared to move on.”  That story has stuck with me.\n\n2) I’m a fairly decent guitar player, have made an actual career of being paid to do it. And I STILL am either constantly hiring people better than I or recording things note by note and then assembled in protools afterwards. Dr Luke might be the best guitarist I’ve ever been around (and I’ve hung with Blake Mills, Tim Pierce, Phil X), and he CONSTANTLY would just hit record, play the four chords of the song free time, and then cut them up and drop them on the ones or wherever they’re supposed to go in the song. My favorite thing about making records vs performing them live is that on record NO ONE CARES how you got there, just that you did. Unless your groove has something particularly magic to offer I’d get over the one take mentality pretty quick.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103454133257785384",
    "author": "BatMeckley",
    "date": "2023-05-03",
    "content": "I worked with a band at the very beginning that was a three piece with VERY specific rules. \n\n1) all songs had to be under 2:45\n2) guitars and vocals could be doubled for tone, but not parts.\n3) bassist sang lead, if there was a harmony the guitarist (not a gifted singer) had to sing it, if there was a third part the drummer had to sing it (couldn’t sing at all)\n4) record couldn’t take more than a week to record/mix \n\nIt was the project that convinced Luke I could be a producer; his fav record id done up to that point.\n\nThere’s a real value to putting strict limitations on your art, it often brings the most clarity and creativity. Side note: they were terrible technical musicians but just fucking AWESOME.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059568643878428843",
    "author": "NoahNeedleman",
    "date": "2023-01-02",
    "content": "@BatMeckley is the resident Grammy Loser on this topic, but I’ve made a decent living doing some indie and major label stuff as a vocal producer. \n\nDeliverables really depend on the producer you’re working with. In my experience it’s 50/50 whether they want tuned or raw, comped or all the takes- etc. \n\nThe key things that keep me getting called are, in no particular order:\n\nCommunication. Everybody knows what to expect and what is to be expected. \n\nProfessionalism. The room is clean, mics are up, lighting is right, session is loaded. \n\nIntuition. All the artistic/personal things. Making the artist feel safe enough to be dangerous, knowing how hard you can push them to get a take, knowing where the line is between their vision and yours, etc…\n\nSonics. I want my artists to feel expensive when they’re recording, so getting the mic and cue mix right is everything. \n\nSpeed. A comp up by the time they’re done tracking, a quick shine to make it feel special, and a bounce for them to take with them.\n\nEverything else is on a per session basis. I can deliver a fully mixed/tuned vocal and everything in between, so it all depends on communication ahead of time.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1376682277085380678",
    "author": "NoahNeedleman",
    "date": "2025-05-26",
    "content": "Really well framed and important questions here. \n\nI’ve heard your music, and so first let me say that you’re on the path. This is the work. This is the practice. Just like yoga or meditation or basketball. \n\nSecond, let me say, again, there’s no secret knowledge. There’s only showing up, paying attention, and doing the work consistently. \n\nConsistency is the only actual key to success. \n\nSo when you look at your finished projects you can’t think about them as failures, only as rungs on the latter you’re climbing. And the only way to see what’s what is to KEEP CLIMBING.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368611818746150934",
    "author": "Rollmottle",
    "date": "2025-05-04",
    "content": "I would never put rules around how a client wants to engage to give me the information I need to get the project done. People are wired differently and may communicate more effectively in certain modalities. I’ll trade that off every time for any personal inconvenience.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037560949273538661",
    "author": "popaganda.",
    "date": "2022-11-02",
    "content": "I’ll add kind of a different angle to this convo….everything mentioned is crucial…play a lot, record, play with others, just reps….but if you want to see big gains TECHNICALLY on something like guitar or piano, you need to break movements down and very very slowly drill the transitions….one note to the next. One chord to the next…really building muscle memory. For a new chord shape…form it very slowly and then let go completely. Repeat many times. Same thing for chord transitions….super slowly between the two. It may seem like it would take too long to practice like that, but doing micro work like that will completely transform your ability on an instrument if you’re judicious and persistent.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196612413320077415",
    "author": "LAPhill",
    "date": "2024-01-15",
    "content": "The hard truth is that, if you're going to be a producer recording your own parts, then it's your responsibility to figure out how to make them bang. And learning how to quickly and efficiently work around your limitations is part of the gig. Get really good at knowing where you can punch to hide the seams of comping, regardless of the type of part. Retune the guitar to make chord shapes easier. Split up the part. If you practice THOSE editing skills, your workflow will speed up tremendously. There's no need to concern yourself with being able to play it in one go, or at all, unless you're going to perform it live.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1311026460831645696",
    "author": "Slow Hand",
    "date": "2024-11-26",
    "content": "At the risk of stating the obvious, transitions can also be telegraphed through the instrumental writing too. Whether it's a drum fill, or a chord voicing that walks up/down into the next section, or tension in the melodic voices, or shortening the notes lengths (staccato, staccatissimo).\n\nThere's also idiomatic noises from the instruments. Guitars have string scrapes, headstock rakes, that cool chattering thing from tapping near the bridge with the edge of your pick. Pianos have big glisses, horns can squeal, bowed strings can sweep a fast legato scale up into the downbeat or do a large gliss.\n\nThen there's foley. I get a *lot* of mileage from sound libraries made for film audio. Foley artists are some creative people and you can go far layering their sounds into instruments at the transitions.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095856414871793764",
    "author": "Deleted User",
    "date": "2023-04-12",
    "content": "I didn't expect this to turn into a wild debate but I enjoyed reading this. Ended up re-tracking most of the song, I couldn't really recreate the feel of the outro so I just ended up leaving that one alone except the very last chord that didn't sustain long enough. \n\nThank you everyone for chiming in!",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142151095209185391",
    "author": "bobby k",
    "date": "2023-08-18",
    "content": "I will say this, on the topic of standing up for yourself -- I've seen a couple times in these threads now a general sentiment of accepting that people are gonna kick you around. It felt evident when we were riffing on sliding scale mixing rates last month and it felt evident this morning/last night in here. I'm all in on the greyhound sentiment, I've been a grafter through and through since I was in elementary school skipping homework to double up on piano practice. I once drove 7 hours to buy a Juno-60 on Craigslist and the guy didn't answer the door; I make DUMB life decisions all centered around this non-negotiable gravity towards the art. I can promise I have whatever that obsessive brain disorder thing is that we all keep riffing about (and believe the same for the grand majority here). But can we not practice a little self preservation along the way? Nobody besides your team is really gonna stick up for you; I believe that in line with the all the professional metrics there exists the opportunity/need to set  precedents on how you want to be treated. I don't think this is something that *comes* with being a great producer, I think it's something that *contributes* to someone becoming a great producer. And of course, knowing how to ask for that fairness with a kind/patient/assertive/flexible tone is critical. But if I believe something is a little crooked in the system, I'd rather not wait till I hopefully arrive a decade later on the other side of the fence to be able to do something about it. I would rather make an attempt at being heard now and see whether it makes any progress, even if it just gives some suit on an email thread something to think about. It's not for the sake of my own ego, it's for the sake of our entire breed.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180317656482590731",
    "author": "youngteam",
    "date": "2023-12-01",
    "content": "You know that feeling when you find someone who had a major role in a lot of your favorite music and you had no idea they existed? That's me right now with BJ Burton.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284218772487671991",
    "author": "LAPhill",
    "date": "2024-09-13",
    "content": "Not a dumb question. The distortion on power chords creates an octave below the fundamental pitch, which helps make them feel well, powerful. For intervals other than a 5th, it's not an octave below but some other pitch, and so yeah, you're likely creating unpleasant harmonics outside of the key.\n\nThe dumbest, but easiest way to avoid that is to let the bass be the inversion's lowest note while the plays a 5th from the root note. Otherwise, you're looking at dialing back the distortion on those inversions, or on the tone as a whole, which isn't necessarily what's desired.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453853636844195902",
    "author": "oaklandmatt",
    "date": "2025-12-25",
    "content": "Copying your favorite songs is actually a great way to learn! I've done it a lot and continue to do it periodically, even after making records for like 25 years. \n\nThink of this like practice, not as how to make *your* music. Trying to make a note for note, sound for sound copy of a song you like forces you to make moves and choose sounds you otherwise wouldn't choose.\n\nBy practicing in this way, you accumulate skills that become part of your subconscious creative arsenal.\n\nAgain, at this early point in your journey, there really are no right and wrong ways to make things. The key is to just make as much stuff as you can, trying as many different methods as possible.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108921383926382673",
    "author": "Slow Hand",
    "date": "2023-05-18",
    "content": "Wow. I'm making my way slowly through this Lanois/Beato interview and am amazed by what Lanois is describing from @ 52:24 to 53:45 regarding his approach to stacking modulations and special effects.\n\nAs he describes it, he's performing and printing his modulation effects (delay, verb, vibrato, pitch shifting, etc) one generation at a time as he iterates through the song. This allows him to fine-tune and perform the modulations on each successive pass so that every moment is honed and responsive enough that it becomes a part within the music, and not just a blanket effects chain.\n\nSo if he's doing pitch-shifted delays, he'll do a pass that goes up a fifth on certain notes and then layer another pass that modulates by a different interval at a select moment instead of leaving everything on throughout the entire section. He's honing each effect in sequence. It shows a tremendous care and sensitivity to the music that he would go through and *perform* each layer with so much intention.\n\nThis feels like a revelation to me and I can't wait to practice this.\n\n(I've cued up the video where they start talking about it)\nhttps://www.youtube.com/watch?v=vxP9kKzbCFA&t=3144s",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134940149403369544",
    "author": "LAPhill",
    "date": "2023-07-29",
    "content": "Not always that relevant in modern music, but our brains mostly hear the relationship between melody and bassline, with inner voices a distant second. So thoughtful voice leading and intervalic relationships between the bass and melody can negate the need for much other harmonic information.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210334836003184691",
    "author": "Skyler Young",
    "date": "2024-02-22",
    "content": "I was recording on an album and I heard a few tracks that a different bass player played on at the beginning of the session and the tone on his bass part was amazing so I asked the producer how he treated the bass to get that sound and he said he did nothing, it going through the same chain I was. And I was horrified cause my bass was sounding nowhere near as good and I knew the other player had the same type of bass. The only thing that could effect the sound was the tone knob and as soon as I moved it to around halfway it perfectly fit in the mix and sounded as good as the other bass player - has been the biggest key to getting a good sound in the studio",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280284103018676427",
    "author": "jonmatteson",
    "date": "2024-09-02",
    "content": "Play 4 octaves of C on a piano slowly and record that and drop it into simpler. Then play a chord into that simpler and you’ve got the 1975 “random piano”",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357597759493902559",
    "author": "oaklandmatt",
    "date": "2025-04-03",
    "content": "The law says \"any use\" needs to be cleared. One of the major legal cases even specified no minimum length.\n\nThat being said, nearly all drum one shots are commonly uncleared. There are some other exceptions that would fall under being a generic sound of some sort.\n\nThe short answer is, if someone can recognize it from their original recording, you can be sued. \n\nMost people don't bother trying to clear things because they don't have budget. Usually nothing ever happens because most songs don't get big enough for the copyright owner to care. Then again, I heard Gotye had to give away 80% of Somebody That I Used To Know because of the two chord uncleared bossa nova guitar lick.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204814597857611838",
    "author": "Ross Fortune",
    "date": "2024-02-07",
    "content": "Thanks to all the folks for suggestions on perc replays. I slept on it, had a listen and realised that I'd been ignoring a really key element in the loop. I'd already programmed a kick / hat / snare / clap pattern, but underestimated how much the filtered version of that in my borrowed loop was adding to the groove.\n\nStumbled upon an Oliver loop that did just what I needed in that department, and suddenly it all came together. The replay of the perc I'd already made was good, I just didn't see the glaringly obvious because I was so deep in the weeds with perc details.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "965756652911460442",
    "author": "jonmatteson",
    "date": "2022-04-18",
    "content": "I like to try and learn songs I like then use similar voicing's or chords in different orders to make something new!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1056277735812645014",
    "author": "Slow Hand",
    "date": "2022-12-24",
    "content": "One tip I'd give is to make your patch while you have a MIDI sequence playing. Not just some static, even arpeggio that you drew in, but a part that has different articulations, note lengths, velocities, and covers a range of notes.\n\nIt's easy when making a patch to just keep your finger on one key and go *doot doot doot* (tweak) *doot doot doot* (tweak again). What you can end up doing this way is optimizing the patch and parameters for a single note or handful of notes. And it gets old to listen to. By keeping the entire musical part playing you're going to move through building a well-balanced patch much quicker.\n\nIf you have a part in mind, record the MIDI with your starter/init patch, spend some time tweaking the patch while the sequence plays, and then once you get into the ballpark replay the MIDI part using your new patch. The new synth settings will influence your articulation and feel when you record the second time around. Then refine your patch as needed. Rinse and repeat until you're satisfied.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084887762995523665",
    "author": "Jeremy Klein",
    "date": "2023-03-13",
    "content": "2 helpful things come to mind:\n\n1) my go to technique for that sampled sound is too record the instrument an octave higher, and twice as fast. then based on your desired decade, put RC-20, sketch cassette, lossy, etc on that octave higher, twice as fast part. render this. Now stretch this rendered audio twice as long so its in the right octave and right speed. The key here is that your lofi plugin is on BEFORE you pitch around the audio.\n\n2) as you already keyed in on, the more mono you go, the more lofi / grungey / busted, something will sound.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103376473764667472",
    "author": "hyanrarvey",
    "date": "2023-05-03",
    "content": "Same way how i don’t wana hear a metal band winging it from chord charts",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150931584137039872",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-11",
    "content": "The AI sounds a lot better - and you can do it the melodyne way and then run it through AI to make it sound good enough to sit in front of the mix.\n\nThe more mind-blowing application of AI imo is recording the lead in a way lower key and pitching it up losslessly, or recording pickups on an iphone mic and upscale it with a model of yourself singing in the studio.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194332985999241317",
    "author": "Calvin Lauber",
    "date": "2024-01-09",
    "content": "Honestly just sounds like a fat harmony stack to me. I’m not sure that it’s even synthetic. Maybe some retuning in melodyne on some of the notes could be giving it a bit of that quality",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256422160331833426",
    "author": "BatMeckley",
    "date": "2024-06-28",
    "content": "People forget (or never knew in the first place) that he was an in demand session guitarist. It’s how he got in the gig. Today I played him this very jazzy expensive chord record I’m working on and he immediately picked up a guitar off the wall and played all the inversions properly and started suggesting new ones. First take, no hunting and pecking. When a guy like that with experience buys an amp or whatever it’s because it makes the sound he’s hunting for, not just an eh version of it. His wurli is a great wurli, his 330 is a great 330. If they’re not great he doesn’t keep them around.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258190900753072250",
    "author": "BatMeckley",
    "date": "2024-07-03",
    "content": "Yup, but also, depends how you’re tracking the distorted chord. Certain modelers and even pedals (h90) have a significant amount of latency. (If we’re getting nerdy about it). So if you’re splitting the signal, make sure to account for that.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310903150026424351",
    "author": "NoahNeedleman",
    "date": "2024-11-26",
    "content": "Love this q. Curious to hear everyone’s thought. \n\nI like Pitched elements, like a synth chord kinda raked, or high strung guitar.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "968192285290397706",
    "author": "Deleted User",
    "date": "2022-04-25",
    "content": "for toppers i like going to\n\n808 toms, hitting random objects with sticks or knocks on surfaces, short loop of vinyl crackle or any sort of rustling/scrambiling somewhat quantized to have a rhythm, mangling with found sound (this may or may not work cause they have such strong characters and very particular mid-high frequency content), timbale fills, congas and bongos, or any random noises into distortion (to just bring out every bit of low level stuff) going through gated filter sidechained from a drum loop (it can be the main drums or any other random rhythmic thing to key the filter envelope)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051663239022387220",
    "author": "BatMeckley",
    "date": "2022-12-11",
    "content": "Cian’s ability to make everyone uncomfortable is a key component of his success",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087102540505698344",
    "author": "Slow Hand",
    "date": "2023-03-19",
    "content": "Any polyphonic subtractive synth should be able to get you there. There's nothing so unique about the sound that you'd need a specific synth model. The characteristic sound of this patch is a saturated LPF with an ADSR filter sweep. It may actually be a monophonic synth with a second oscillator tuned to +7 and blended in at a lower volume. It doesn't sound like they're playing chords, so much as stacked oscillators.\n\nAs others mentioned, a Prophet is a good place to start, but it's not going to get you that heavy-grit saturation by itself that we hear on this record. Prophets don't get that dirty on their own. Maybe the Prophet X's with DSP effects will. I haven't used them.\n\nSomething like a Moog synth is going to lean heavier into the saturation capabilities. That record feels much more like a Moog filter. A Moog Matriarch is the first thing I'd reach for if it were available to use.\n\nThat said, you've probably got enough saturation boxes lying around that you can approximate that grit. But it's a very Moog-y saturation sound.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168804285660798996",
    "author": "Marshall",
    "date": "2023-10-30",
    "content": "1. Fully copy the structure of a song you like 2. rip the exact drum beat off from a different song you like 3. thrown down some chords 4. find the stems of a completely different song you really like the sonics of and try to copy the exact types of instruments/synth sounds/samples/etc and what purpose they serve in that song (ex: guitar in middle octave playing a rhythmic pluck, synth swell with reverb into the chorus, bright noise synth drones only on the last chorus)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1170114352402153614",
    "author": "Ingmar Carlson",
    "date": "2023-11-03",
    "content": "Toxic masculinity is key here. Honestly, even watching this clip years later, while I'm sure Bob Rock was and is a special kind of asshole, so much of this just reads as the culture of metal in the studio. He's largely just speaking their language, what we'd call \"vibing\" today. I grew up watching so many similar \"behind the scenes\" metal docs in which bands were just imitating/replicating this vibe in the studio. It's basically just all the boys who didn't/weren't gonna make the football team just doing the \"locker room\" thing in the studio. That's how it felt in the 2000s anyway.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247599960325754890",
    "author": "jonmatteson",
    "date": "2024-06-04",
    "content": "What everyone else said is great but I personally like fx printed onto the vocals if possible. Less tracks and if I choose to mute a harmony or double it’s not in the FX track. Also separate as much as you can but you can bounce similar parts together like “high doubles” “low doubles” etc. I like when all stems are bounced through the mix buss with limiting.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1250196776812679168",
    "author": "Slow Hand",
    "date": "2024-06-11",
    "content": "Easy! FM synthesis is simply vibrato that is super fast (greater than 20 Hz) - and often super deep (a semitone of pitch fluctuation or octaves of it). \n\nWhen you modulate the pitch at these rates and depths the vibrato is perceived as new harmonic sidebands that \"bloom\" out of the oscillator.\n\nGreat video.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1252830434841067615",
    "author": "tim adamson 🇦🇺",
    "date": "2024-06-18",
    "content": "With making a verb to use as a  big lush backdrop, I love having a send to a dark analog slap that feeds back into the main reverbs I'm building, it essentially doubles your reverb space with extra colour and a shit tonne of depth. Modulate the slap to taste, and use a bit of it dry if needed",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350358028695769089",
    "author": "spectrummasters",
    "date": "2025-03-14",
    "content": "Foundationally , to my ear it’s pure 80s electro / hip hop .speed up planet rock with the Kraftwerk sample removed and you’re there . \n\nIf you listen to 2 live crew throw the d you’ll hear how electro moves into Miami bass and then it’s influences imho can be heard more recently by way of the trigger man break from show boys drag rap which became a major break for New Orleans bounce . Drake gave his nod to New Orleans bounce music having queen freedie in the nice for what video . \nSooo, for me it’s electro . Just with todays production aesthetics",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1466182004960661664",
    "author": "BatMeckley",
    "date": "2026-01-28",
    "content": "Ehhh it’s more nuanced than that. Automating the mod wheel can drastically change the timbre of an orchestral vst, and is an essential part of humanizing your program, and I think a lot of people don’t really get that. They just open up the abbey road plugin and start hammering out chords. \n\nA lot of those instruments don’t use velocity info to  change the timbre of the instrument, they rely on the mod wheel, while the velocity means something else (often portamemto, or note glide for the not nerds)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1026970790375206992",
    "author": "wilhelmjosephk",
    "date": "2022-10-04",
    "content": "I love this sound and a lot of the other stuff that Jockstrap's come up with, and while this is a bit of a non-answer, I think the key is that these sounds are easier to arrive at than they are to aim for. I think a lot of what Taylor Skye is doing is taking sounds and then warping them/distorting them to shit using all of the \"wrong\" methods, and then just judging what comes out and deciding if it should be kept. I think there's a good hint of this in the lead sound at the start, where it's really out of rhythm and grainy, some notes seem to sort of \"break\" which reminds me of the results you get when you try to formant shift a verbed-out or polyphonic sound with little alterboy, or even abusing izotope RX on something that doesn't really need it (also, the RX de-reverb can do wild things to a sound you've put reverb on higher in the chain). Logic, which is what he uses, also has a lesser known formant shift that you can only get to by turning on flex pitch then adjusting in the side info bar, which can really take sounds into space. I haven't done this with melodyne, but I imagine there are some similar features.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037561769771679786",
    "author": "popaganda.",
    "date": "2022-11-02",
    "content": "Also, drill your triads. Triads everything, even in more complex harmony. Chord scales. Also, sing and play melodies at the same time. Form that bond between hearing and playing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087106884307271680",
    "author": "Slow Hand",
    "date": "2023-03-19",
    "content": "Lemme try again. 😄 I think you’d get very close with a Moog Matriarch or a Sub37. Turn the LPF filter down low and then use an ADSR envelope to modulate the filter cutoff frequency so that it sweeps open and closed every time you press a key.\n\nCrank up the saturation knob on the Moog LPF and then blend in a second oscillator that’s tuned to a 5th above the pitch of your 1st oscillator.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087111727084216370",
    "author": "Deleted User",
    "date": "2023-03-19",
    "content": "Polyphonic subtractive synth : subtractive synth is a synthesis mechanism that utilizes combination of oscillators and filters. So a synth with Osc, Filter  that can play more than one note at a time\n\nADSR filter sweep - ADSR is a type of enveloping shape. Attack time, Decay time, Sustain level, and Release time. Sweep here refers to when you make the envelope move the filter corner (cutoff) frequency. It acts like as if you are moving the filter by hand every time a key is triggered. \n\nStacked Oscillators : When you have OSC1 and OSC2 tuned differently. In this case Bradley is referring to OSC2 being 7 semitones higher and having it on lower volume relative to OSC1.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596544781434950",
    "author": "BatMeckley",
    "date": "2023-04-03",
    "content": "It doesn’t exist. What’s the key of the song? What’s the tempo? What’s the rest of the arrangement look like?\n\nToo many variables for one 808 to rule them all.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103375974957072535",
    "author": "hyanrarvey",
    "date": "2023-05-03",
    "content": "Like if you played james blake music with a live band the guitar player would probably quit from you telling them to stop playing untill that one chord at the end",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108479785992212572",
    "author": "Adam Thein",
    "date": "2023-05-17",
    "content": "It's really simple in Live (and I'm sure there's equivalent warp modes in other daws) - use the Repitch Warp mode, move the tempo down til you are slightly slower (the track will play back at a lower pitch), record at that new key and tempo, and warp it back up (Repitch mode on whatever you recorded).  The formants and the pitch and the tempo will all move together and playback smoothly.\n\nI think @Ross Fortune has mentioned this before but the iOS app MusicMath has a handy tool to input the BPM and how many semitones you want to transpose and it'll kick out the correct new BPM to get the transposition you want.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113250420870103080",
    "author": "Calvin Lauber",
    "date": "2023-05-30",
    "content": "I think my favorite/most musical way is the Antares harmony engine set to follow midi input, mapping the chords out with a few fun/weird voicings. Even better for vibe to play the midi input live along with the artists take so they can react to it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1115341894109634570",
    "author": "conor // wbotm",
    "date": "2023-06-05",
    "content": "me and a buddy figured a very scuff version out years ago with very few tools... created a big audio rack in ableton with a channel for each note in the scale across 2 octaves, each channel had an autotune instance (or graillon 2 in our broke case) hard tuned to a single note and a gate that was sidechained to the corresponding note on a MIDI track. The MIDI track was just a plain sine wave synth, but you could also get some cool gated effects by using different inputs",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135007947542507572",
    "author": "LAPhill",
    "date": "2023-07-29",
    "content": "For years when I was a young musician, I thought minor V was the \"normal\" one, and a major V sounded really hokey.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139357734131740794",
    "author": "NoahNeedleman",
    "date": "2023-08-10",
    "content": "@LAPhill was thinking of you today while doing some “scoring” for my wedding video (DIY slideshow / iPhone video montage.) \n\nI loaded up Keyscape cinematic grand, Spitfire BBC Orch on 4 tracks, (violins, violas, cellos, horns,) and went at like I would a vocal arrangement- one voice at a time, which was great for internal voice leading and lead to some beautiful & unexpected chords. \n\nCame together really fast too.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150533161596489869",
    "author": "LAPhill",
    "date": "2023-09-10",
    "content": "Oooh I have a theory here, about cultural values. Audiences in the 1800s, for instance, could go to a symphonic concert and recognize sonata form, key centers, etc. There was an appreciation for the form of the music and the virtuosity of the player first and foremost. Acknowledgement of skill. Making things seem effortless was the ideal.\n\nContemporary listeners seem to connect more with the struggle. They want to hear the grit in the vocal, the player at the edge of their ability (whatever it may be) holding on for dear life. The mix at the edge of distortion. In that breaking point, there is a lot of beauty and emotion that would have traditionally been considered bad form. Uncouth, even!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1176330354072756365",
    "author": "sethearnest",
    "date": "2023-11-20",
    "content": "Yeah that part’s coolness is 98% the performance and arrangement’s contrast. \n\nProduction wise, sounds like a lot of heavily pre-delayed verb and some long stereo delays swirly-twirling around the vocal, plus the double (mono double) and harms dipping in and out. The long pre-delay and tight double will be key to get that super-intimate-but-still-swirly feeling. \n\nBut yeah as you alluded to, the feeling of that part is so dope b/c of 1) the whispery performance itself and 2) the contrast of the bottom falling out from the previous section. Very effective.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209062551988731944",
    "author": "Deleted User",
    "date": "2024-02-19",
    "content": "Learn what different carrier to modulator ratios sound like by messing with them only using sine waves.  and then feel out what it feels like feedback carrier and/or the modulator. And then you can introduce envelopes to create shapes with them. \n\nTool wise- I would start with FM8, it’s pretty much DX7 but without the limitations of routing configuration like it does in Arturia DX7. And then you can learn with arturia DX7 in conjunction with how the different configuration work. +FM8 has patch morphing function which can be VERY useful when it comes to FM sounds. Another cool thing about FM8 is that it shows you all of the sidebands. \n\nFrom here, it’s all experimentation\n\nThat’s really all you need, FM looks intimidating but it’s really not that difficult. \n\n\nlinear FM is essentially really fast vibrato. Non linear FM is a fast trill between the two frequencies. AM is essentially fast *unipolar* tremolo, RM is fast *bipolar: meaning it shifts polarity too* tremolo. they all create sonic characters by creating sidebands. \n\none thing to keep in mind is most FM synths are actually not FM. it’s actually imitated by doing phase modulation- but results are almost identical. except in actual FM, you get more of the carrier frequency. So FM with a high-pass filtered modulator is essentially the same as PM with a low pass filtered modulator\n\n\nrun down on difference in sidebands between the most common audio-rate modulated synthesis:\n\nFM/PM creates equally spaced sidebands\n\nRM only produces sidebands (carrier frequency + modulator frequency & carrier frequency- modulator frequency)\n\nAM is carrier with side bands of c+m and c-m",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267201939356258457",
    "author": "Josh",
    "date": "2024-07-28",
    "content": "I’ve been trying to break out of my box with guitar. So instead of starting with guitar I’ll just find the chords and start with either piano or some kind of a bass and go from there. Been an easy way to kind of detour around the roadblock but not necessarily a great way to get better at my main instrument. 😅",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284222419288068208",
    "author": "Slow Hand",
    "date": "2024-09-13",
    "content": "Which now has me wondering about something else: What if you built a synthesizer or a sampled instrument that dynamically reduced the harmonic content of the middle voices in a chord or when it's voiced tightly? If your bottom note was full-spectrum and then you simplified the middle voices to something closer to a sine wave. That could be interesting.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284233069922091078",
    "author": "LAPhill",
    "date": "2024-09-13",
    "content": "Playing inversions on the A string, ime, is usually not a problem. The old G5, D/F#, E5 descending line type thing has never been an issue. But that same thing down around the lowest notes of the E string can get more thorny. Again, lower interval limits and muddying up the bass notes are more of a problem down there.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284338455341695037",
    "author": "BatMeckley",
    "date": "2024-09-13",
    "content": "There’s two things going on here… one is the natural rub of harmonics that normally occur no matter the instrument, but there’s something specific that happens when you do chords like that pre-distortion, meaning the way an amp (or pedal) distorts that rub willl usually be different sounding than if you hit those notes on individual takes and THEN blended them together. I’d give that a shot (the aforementioned mutt lang one note at a time chord theory, which supposedly has been overblown, though I’ve heard guys like MUSE have explored it later on) before you go too haywire looking at dramatic eq moves or what not.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284679908244717689",
    "author": "Eric Martin",
    "date": "2024-09-14",
    "content": "that’s the key, they’re voiced on these strings ADGB or DGBE, almost never on EADG and bass is always locking in the extensions of the chordal tones",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301955127967613029",
    "author": "LAPhill",
    "date": "2024-11-01",
    "content": "Why isn't editing possible? If you can't fix the spot in a way that sounds natural, you may need to grab that section from a different part of the track and replace it, if it appears anywhere else. Otherwise, sometimes you need to adjust the timing of a few bars before or after, even though they seem fine now, so that the amount of shift needed is spread out amongst a larger section than trying to move one chord by an eighth note or something musically egregious.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334322947069968495",
    "author": "Felix Byrne",
    "date": "2025-01-29",
    "content": "this just made me think of something i'll do on planes\n\nlisten thru to songs and do super super granular notes app breakdowns on everything that's happening at any point\n\nINTRO 8 Bars - first filtered sine synth pad comes in playing block chords, subtle seagull sounds in background, 4 bars in a bright distorted synth lead motif appears with tails running into next section\nVRS 1 16 Bars - same synth pad, but even more filtered etc etc etc\n\nkinda helps show what all is going on arrangement wise and how it changes or doesn't",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1338028436178075699",
    "author": "Nomograph Mastering",
    "date": "2025-02-08",
    "content": "Have always loved tracks that did this, whether with loops or players. Same with modulated intros that shift when the song proper starts",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387838457858228274",
    "author": "cian riordan",
    "date": "2025-06-26",
    "content": "Raking the first chord",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417229400054960170",
    "author": "Slow Hand",
    "date": "2025-09-15",
    "content": "Pick a something from a song that you like and teach it to yourself. Maybe a melody, some chords, or a cool voice leading thing.\n\nAs you try it, play around with transposing, changing the tempo, stretching it out, or compressing the time. I find that playing with something like this gets me in the mindset and before long I’m inspired enough to use the idea as a jumping-off point.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1431109344648237116",
    "author": "BakerBaker",
    "date": "2025-10-23",
    "content": "If you’re looking at an Omni chord Check out the telepathic instruments orchid too. I got one and love it. I use it mainly for chord exploration but the on board sounds are also really useful for recording",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470803943952224359",
    "author": "Will Trotman",
    "date": "2026-02-10",
    "content": "In addition to the diamonds like Noah said, just root notes chugging away or playing 8th notes can be helpful and non invasive if chords or power chords feel too informative. Octaves can be a cool halfway point. A lot of songs seem to have room for the clean “dinky” sort of electric parts (sometimes slightly melodic or sometimes just hanging out on a single note).\n\nIf it’s a matter of filling space, something that helped me on a pop track the other day was making a second track for echoes of the lead vocal where you can low pass it pretty hard and delay / verb it out.\n\nI often find myself introducing subtle sub basses later in the song, potentially doubling electric bass with synth bass, maybe layering snares to be fatter in later choruses. Then playing with some subtle percussion elements like triangle, clave, wood blocks, to differentiate later choruses.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000389456387391598",
    "author": "Zack Hames",
    "date": "2022-07-23",
    "content": "I composed/recorded a boy band track for an ad…it was only :30 so it was easy to do this, but we got everyone singing the lead lines as If they were the “lead singer” and we comped which singer we wanted for each line after. Then we had them do harmonies for all the lines as well (at least the lines we knew we wanted harmonies) \n\nThey were great enough singers they just did a bunch of harmony takes and it was super fast and easy to layer and edit. If the singers are good it’s honestly its super easy. \n\nSince it’s an actual group and not an ad, you might have to pre produce some of these concepts, who wants what “verses” as their lead section etc.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020845396823646279",
    "author": "ALXCPH",
    "date": "2022-09-17",
    "content": "think about if you want flams and how that feels, or do you want shit to be super tight and hit together. its two different emotions. Kinda like major and minor, but for rhythm.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1024044944337420308",
    "author": "ehutton21",
    "date": "2022-09-26",
    "content": "Learning how to program and/or play drums well is super super key for leveling up as a producer. I didn’t get really confident in my productions until I got one of those midi drum kit things and started learning how to just find a bounce like that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051603079960731719",
    "author": "Slow Hand",
    "date": "2022-12-11",
    "content": "If you're concerned about being too suggestive to the players about their parts then strip back the demo until it contains only the most essential parts. No fancy stuff. Just chords, melody, and lyric. *Maybe* a kick drum pattern. Lead sheet style.\n\nIf the song is good then it will still be compelling. The best songs tend to be very robust and can be played a dozen different ways because they are fundamentally compelling. If the demo doesn't feel good this way then the song may need more work.\n\nLesser songs will depend on the arrangement or production to be compelling, or only work in a narrow band of styles. Sometimes a song can only work one way. It's okay if this is the case for your song, but then it's up to you to present the demo with the arrangement or elements that are essential to make the song compelling, and that will close off more and more of the instrumental possibilities.\n\nSo if you want to increase the chances of a session player delivering an unexpected, brilliant, idea then set them up for success with a strong song that can be interpreted many ways.\n\n----",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080905745035448390",
    "author": "Jeremy Klein",
    "date": "2023-03-02",
    "content": "yo! welcome to the discord!\n\nYeah i'm a huge user of SD3. One of my gigs is making library rock/metal music and for all those tracks it's 100% SD3 and youd be hard pressed to tell they are programmed drums.\n\nThe real key for me was learning to use the pre-made MIDI grooves in SD3. If you start with those, and then just modify the kick to where you want it, you get some _very_ convincing drums.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095302356310175764",
    "author": "spectrummasters",
    "date": "2023-04-11",
    "content": "V true also what you heard about them working within specific ranges . Pretty much key of a through and up to d is the sweet spot for most of mine . Outside of this they don’t hit right",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113180419127521322",
    "author": "sukhuno",
    "date": "2023-05-30",
    "content": "Couple options: harmony engine, nectar 2/3, izotope vocal synth in poly mode, ableton stock max for live pitch tools has a poly one. Personally the closest I got to the bon iver sound was nectar 2 and after that is the stock ableton max for live polyvcoder after that. But different horses for different courses (that’s the saying right) depending on the context. If you got more specific questions I could guide you better",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1120111300001943682",
    "author": "Ross Fortune",
    "date": "2023-06-18",
    "content": "I wasn’t even thinking 1:1 lift, just gives me similar feels. Whatever it is they share in the harmony does the thing to my innards",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134993364576637058",
    "author": "Nomograph Mastering",
    "date": "2023-07-29",
    "content": "I’ve often described here how I was a fairly shitty band mate in my youth. One of the dumbest things I can remember believing was that the chords (and hence my guitar playing) were the most important thing. I later came to realize that they were most often the *least* important thing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134994910525784104",
    "author": "Deleted User",
    "date": "2023-07-29",
    "content": "inner harmonies are more textural than functional, they exist to fill the space in the middle, but they can also take up too much space. key players and guitarists are guilty of this too often. no need for a 7 note voicing in a dense pop song\n\nBut chord “progressions” are also underrated in a sense that it really shifts the emotional context. you can really make a pretty significant difference by carefully crafting them, but also that doesn’t mean you need all the stuff in between bass and the main melody on every songs\n\ninstruments like chord stabs can serve the function of percussion and drive the rhythm. it’s ‘rhythm sectio’  afterall",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135003946956619838",
    "author": "Slow Hand",
    "date": "2023-07-29",
    "content": "A great chord progression is my favorite thing to work on. They're the scaffolding for the entire song. They're the band's office for the day. A landscape for the musicians to dance over. The fixed point to push against and create effect through compliment or contrast. Good chords make me warm inside.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174039820750827520",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-14",
    "content": "The producer and the artist couldnt tell the instrumental was in the wrong key or tempo no \nI sent them a new version of the instrumental in 44.1 they might have time to rerecord it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179918374675939410",
    "author": "gatewoodsensei",
    "date": "2023-11-30",
    "content": "I’m not sure if this’ll help, but I tend to go with whatever hits me at the time. If it’s a melody, I’ll sing it, mumble words, and allow the music to form around that idea. If it’s lyrics, then i grab a guitar or sit in front of the keyboard and play the accompaniment. Or if I’m in front of my computer, and melody line hits, I’ll play the melody, or chords and allow it to loop while I write. So I don’t necessarily balance, because to me that means I’m shutting part of my creativity off i order to allow the other part to flow, and more often than not, that kills the creative flow. \n\nSo don’t try to balance anything. Whatever you feel, go with that and allow your creativity to flow.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196608704519344138",
    "author": "Rob Domos",
    "date": "2024-01-15",
    "content": "If the issue is chord shapes that are hard to finger, you could always break up different notes into different takes and stack them",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1208465032652918834",
    "author": "Bryan DiMaio",
    "date": "2024-02-17",
    "content": "Standalone with Studio is the vibe and every now and then if I need to zap something minor in ARA I’ll just render it and move on",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212248717189451786",
    "author": "Josh",
    "date": "2024-02-27",
    "content": "I have this insane pet peeve with people who are decent producers but can’t for the life of them get the chords right. Specifically when what feels right for the chorus is only used in the verses. It’s like… just use the same chords. You had em.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237778216979136523",
    "author": "Slow Hand",
    "date": "2024-05-08",
    "content": "I don't know of any libraries where the voices will glide independently when playing a chord. Typically you'd have to program each legato voice independently on it's own channel for that level of specificity. But if there's an option out there I'd love to hear about it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244772149114437685",
    "author": "Rollmottle",
    "date": "2024-05-27",
    "content": "I always forget about it because the individual plugins are so good, but chaining together many instances of plugins in the SoundToys effect rack always bears fruit. Not like you can't do that already just by chaining plugins together, but for me, it's a different modality and always makes me try wilder shit.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247429987452194898",
    "author": "spectrummasters",
    "date": "2024-06-03",
    "content": "Moving out of my previous genres , where AT was as much a necessary vocal toner as tuner , I’m now going to have to start dropping it as a tool for melodyne . I brought the vocal into melodyne and into the right key (a minor ) and it was pulling notes all over the gaff , where AT had them right . Much to learn . @BatMeckley  iirc you’re the melodyne wizard of life and had discussed the possibility of doing a deep dive for us here . Defo here for that if there’s any chance in future ✌🏼",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284222070108061798",
    "author": "Slow Hand",
    "date": "2024-09-13",
    "content": "Now it's got me thinking. If you wanted to get really surgical about reducing the dissonance (not eliminating it entirely) you could break the chord into single notes that are recorded individually, each with a carefully-adjusted distortion profile (say only a 2nd harmonic - maybe a 4th) so that there aren't so many clashing upper-harmonics.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284228565746843792",
    "author": "David Fuller",
    "date": "2024-09-13",
    "content": "I'll note that if it's typical power chord range you're also running into lower interval limits",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304896386667380786",
    "author": "cy (sigh)",
    "date": "2024-11-09",
    "content": "been playing  w stacks a lot fora few songs recently and often think of them as a chord arrangements. might even play it in on a piano for reference if I can't figure it out in my head. \n\nyou can often control density with the spacing of the harmonies - both in pitch and positioning in the track. \n\nusing different types of distortion on similar takes to bring in different /contrasting textures. \n\nbig stacks can take well to  really agressive EQ depending on how natural you need them.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308897960616005745",
    "author": "BatMeckley",
    "date": "2024-11-20",
    "content": "I don’t use polyphonic mode much, but can’t you correct the detection? In monophonic whenever it grabs the wrong option there’s a key command to bring up the detection “map” and you can correct where Melo got it wrong.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315375029839462400",
    "author": "Will Pragnell",
    "date": "2024-12-08",
    "content": "Serum is the big one for me. I've spent so many hours with it that it's just like speaking now. The modulation system (the envelope shaping, the way the matrix works, and the fact that almost everything can be modulated) is just a joy to use. I do still use other synths because it keeps things fresh, but if I didn't have Serum I'd miss it hugely",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1320166132002590800",
    "author": "BatMeckley",
    "date": "2024-12-21",
    "content": "I use as a chord generator a lot. Get into the keyboard mode. Good for idiot like me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1365722551204188250",
    "author": "chrissorem",
    "date": "2025-04-26",
    "content": "It’s an ai based music separator. Works miracle’s but regarding user agreement this is what I found: For regular users, the risk is relatively low.\nFor high-profile artists, major label acts, or artists with valuable unreleased material), using Moises (or any cloud-based AI separation tool) for unreleased or sensitive music would not be advisable without:\n    •    A strict, signed confidentiality agreement\n    •    Clear local storage-only options\n    •    Or using offline, on-device alternatives instead\n\nProceed with caution. @oaklandmatt",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369763029738324058",
    "author": "jonmatteson",
    "date": "2025-05-07",
    "content": "Antares harmony engine will get you pretty close to that sound as well",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387839455175639161",
    "author": "BatMeckley",
    "date": "2025-06-26",
    "content": "More strumming the chord than smacking it. \nCommon trick to be like “here’s the next part of the song”. \nGreat example of the little things great players do to help the production/mix",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392215976531071116",
    "author": "Rollmottle",
    "date": "2025-07-08",
    "content": "As others have said, recreating a beat you like is the school you need to go to. One of my favorite beats of all time is Fleetwood Mac's \"Hypnotized\" which is a swingy, triplet unchanging thing that is effectively a drum loop through the song, except Mick Fleetwood plays it. I recreated it using a sample pack of Mick Fleetwood's and turned it into a song after serious finagling, especially in the context of grid music. The insight into accent, velocity, swing, where in the grid things hit (or don't), which specific hits matter and how dropping just one or two key hits in a repetitive pattern can shift the groove entirely. It also tests your chops for figuring out choke groups, how to make closed and open hi hats sound \"real\" (if that's your goal) so on and so forth. I also love recreating a beat as a way in when musical inspiration may be lacking.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396235549911552191",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": "I want the mpc sound . Renaming the wav file to match the FAT12 mpc system is long . The transfer of files takes time in itself. \nI just resample everything into the mpc out of my daw system as audio and build up the program . You want the sound of the mpc right ? A major part of it is it’s a/d",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417228431803810043",
    "author": "Rollmottle",
    "date": "2025-09-15",
    "content": "- Random MIDI generator into a Scale filter\n- Same as above but add an Arpeggiator \n- Same as above but replace the Arpeggiator with a Chord filter \n- Mangle a drum loop\n- Mangle any loop\n-  Create a drum loop with differently timed Arpeggiators and midi generators controlling a  drum machine/drum rack \n- Modular synth patches",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1420357090374975589",
    "author": "Brian Reynolds",
    "date": "2025-09-24",
    "content": "I dont think there is any other way to learn Melodyne than be overwhelmed, frustrated, and struggle.\n\nI would read all the messages on the discord. \n\nSet up your speed key commands. Im a fan of zoom and mute blob moves. In addition to the ones mentioned by Beckley on here. \n\nIt took me many moons of overmelodying my vocals to learn less is more.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429552330587767076",
    "author": "Slow Hand",
    "date": "2025-10-19",
    "content": "*Then*, once you're comfortable with those chords, you can try substituting one of them with a different chord quality and listen to what happens.\n\n**For example:** Instead of Am, play an A chord.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430937853378035745",
    "author": "chrissorem",
    "date": "2025-10-23",
    "content": "They are great but having chords on the ready allows you to quickly hear chord sequences",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453656576500961364",
    "author": "oaklandmatt",
    "date": "2025-12-24",
    "content": "It sounds like you just need a lot of practice. You just gotta try things a lot of different ways. Trying making melodies and chords and then producing around them. Try writing and singing hooks yourself. Try chopping up samples (a capellas, your own vocals, whatever) and making hooks out of those.\n\nTry lots of different approaches. That will help you more than \"solving\" it one particular way",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941104264158261258",
    "author": "Maxim",
    "date": "2022-02-09",
    "content": "But generally better sound selection is the key imo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "949055944845848627",
    "author": "Deleted User",
    "date": "2022-03-03",
    "content": "the controller is called continuum. I believe it is an mpe (midi polyphonic expressions) device. I don’t know much about kyma but i would look into physical modeling because this is what the sound generation is based on. A lot of physical modeling is heavily based on delay lines, so I’d start there. Modal synthesis is also another cool concept where you would feed an impulse sample into a bank of parallel bandpass filters (very narrow q- which is also constructed with delay lines fundamentally). The idea is feedback and resonance from the filters would emulate acoustic modes. \n\nYou can emulate this with fairly cheap stuff like leap motion, I’ve done a different project (something much simpler) with leap motion for gesture controlled music concrète. But you can definitely use the gestures to do the same thing with physical modeling. I’d be down to work on something together if you’re interested!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "952317538635763763",
    "author": "frankieharper",
    "date": "2022-03-12",
    "content": "Oh no way haha that’s sick, Bruno Major man… he knows what’s going on 👌\n\nI’m at monkeyharpermusic@gmail.com\n\nMuch appreciated 🙏",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954088247989010433",
    "author": "ALXCPH",
    "date": "2022-03-17",
    "content": "Ahead of the Groove: listen JD Beck and domi, when they go off jd’s drums are Miles ahead. \n\nBehind the beat: anything by d’angelo with questlove(he is a wiz) \n\nStraight on beat: stay Justin and laroy. \n\nAnd thats just drums. \nVocals, bass, percs and every other instrument is able to push and pull on a Groove to make it feel different. Like Matt Said, urgency , laid back, danceable, hectic, tight, fun, sad. \n\nGroove is a master of emotion combined with harmony.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954088845190774796",
    "author": "ALXCPH",
    "date": "2022-03-17",
    "content": "In a lot of trad Brazilian music, the groove moves and modulates during passages.(very human) but also very powerful. African grooves are usually late, Indian grooves ahead. This is VERy generalised by the way. It’s such a nuanced and complex topic. But it is very worth learning about!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957452924118782023",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "The song is the underlying chords, melody, and lyrics. It's the essence of the music that can be re-shaped and interpreted many different ways.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "965743741639991348",
    "author": "1ggy",
    "date": "2022-04-18",
    "content": "What are your guys go to production techniques for chords/melodies if you're not a pro on keys or guitar? Mine for example is using Scaler as a midi instrument, finding a cool progression or pattern and then messing with the midi. Or, finding a cool sounding melody in Splice and then using Pitchmap and/or melodyine to get it in the correct key and chopping it up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "965745872900067348",
    "author": "Rollmottle",
    "date": "2022-04-18",
    "content": "Big fan of Ableton's Scale and Chord midi tools so the same dumb finger patterns I make on the keyboard come out much more interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982396495795998720",
    "author": "ehutton21",
    "date": "2022-06-03",
    "content": "feels like there’s a filter later on in the plucks that disappears, and it sounds like the piano at the intro takes some of the chords in the loop. would say if you’re having trouble with marimba sounds that don’t sound perfect a piano/organ layer is usually gonna round out the low mids in a way that feels like",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987334452751532092",
    "author": "jantrit",
    "date": "2022-06-17",
    "content": "My bud has trillian and it’s amazing. I’m a huge real instruments person and he’s fooled me on more than one occasion, thinking it was a real bass. Key scape, same thing. It really shines when you use it dynamically, all the Celeste and other bells just sound fantastic.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996056180864598046",
    "author": "NoahNeedleman",
    "date": "2022-07-11",
    "content": "https://youtu.be/AH8b7EynJ60\n\nOk synth gurus: you know what that instrument is hitting the downbeats of the chorus in this one? When they go to the V on the second chord of the chorus it hits me right in the feels…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1002315087001964714",
    "author": "cy (sigh)",
    "date": "2022-07-28",
    "content": "my personal stash is mostly divided into \n1. loops & parts \nmostly from productions that never see the light of day or I wasn't inspired enough to finish in the moment. each having their own subfoler w key and bpm on them.\nthis folder also includes melodic things usually\n\n2. kits\nI set time aside specifically to do sound design so those  get made into a kit usually. this includes one shots, loops and any FX I mightve made \n\n3. one shots \nany one shot sample I start using regularly enough ends up here eventually. in subfolders (kick. snare and claps, hats and cymbals, etc) \n\nbesides the one shots from design sessions I tend to use difference spice name and food items to help me distinguish the sounds that might go together (obviously this'll vary per person) ex. \"snare matcha\" and \"snare anís \" will usually work with\"kick milky\" and \"kick cocoa\" and so on. lol\n\noh if pull from alrwady mixed stuff it'll usually go in the one shots with a name that reminds me of the track it's from.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1004274081824252006",
    "author": "BatMeckley",
    "date": "2022-08-02",
    "content": "Honestly? Mostly because it’s just how I’ve always done it. I like to comp, print a two track instrumental, drop all of the vocals into melodyne, tune, sometimes time, sometimes de-ess, oftentimes re consonant words. I’ve got all my key commands etc dialed in standalone so I’m just much faster on it. Plus I like to commit things to tape (same way I like to often tack guitar with verb and delay etc).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009929060589248653",
    "author": "VESHZA",
    "date": "2022-08-18",
    "content": "any references would be dope too, i was thinking of maybe changing the chord progression and playing style for a chorus or something, or just leave it as it as an 'anti-chorus' vibe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1019033288632979496",
    "author": "Chris Doms",
    "date": "2022-09-12",
    "content": "Low key been having to restrain myself from getting a sub 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1026725092509618177",
    "author": "delwin",
    "date": "2022-10-03",
    "content": "any tips on designing super textural modulated pads like the one that opens this track? https://open.spotify.com/track/56t33y3bCn7ryKhziCx3QA?si=4eJ_Onz6QeikHu3JheEEtA",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1026725251880595468",
    "author": "delwin",
    "date": "2022-10-03",
    "content": "still digesting all of the sound design & chord changes from this album — it’s an absolute goldmine",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033433341015375963",
    "author": "ALXCPH",
    "date": "2022-10-22",
    "content": "For live these days ill usually just bring a 25 key midi keyboard to launch tracks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033433883884130384",
    "author": "gatewoodsensei",
    "date": "2022-10-22",
    "content": "This is exactly what I do. I have a novation launch key for triggering loops and stuff while I’m playing keys. The keybed is cheeks tho lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037480496441086042",
    "author": "noahc",
    "date": "2022-11-02",
    "content": "That’s where I’ve come to, learning basic chords and picking Melodies by ear. If I need a crazy solo or fancy add on chords I can call someone. But reached a boring plateau of it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051603180733079622",
    "author": "Slow Hand",
    "date": "2022-12-11",
    "content": "(Ok. Now I'm starting to run with this train of thought. Now would be a good time to step off if you've gotten what you need.)\n\nI don't want this to sound like the end-all be-all. One of my absolute favorites is James Brown, and there is no way that some of his songs would hold up to the level of scrutiny I'm describing. And those records *kill*. It's all vibe. It's vibe all the way down, bebe. Not a chord change in sight. Barely a melody in some cases. And that's alright.\n\nSo what did James do? More often than not James would get all of his band (real jazz killers) in the studio and he would sing the parts to them one by one and allow them to input their own feel.\n\nHe'd start with the drummer and have them play a pattern that James was feeling. Once the drummer was jamming on that he would move on to the bass player and sing them an idea. Once the bass player had that germ of an idea they would continue to jam on it with the drummer, refining and adding their own thing. Then James would move on to the horns, and so on, and so on.\n\nWhile James could be dictatorial and (from the perspective of music education) the least technically qualified person in the room he had *vision*. \n\nIf the song has a strong identity you can give your players a good (non-technical) prompt and they can interpret that through their own sensibilities. You can describe a mood, or a scene, or an abstract sensation.\n\nR. Kelly once said (I'm paraphrasing): \"RnB is supposed to feel like the best moment of your *life*.\" That simple description conveys so much about the feel, the pleasure, and the joy that he is looking for in his music. It also excludes a lot of possibilities as well. If you can give your players a prompt like *that* then you can get everyone aligned on the same wavelength and it will carry you so much further without the need to dictate parts.\n\n----",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055091018585874443",
    "author": "Ross Fortune",
    "date": "2022-12-21",
    "content": "Have you spent much time in original Massive? That seems pretty light, would be interested to know what the major differences are between that and X, GUI aside?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055270620004372631",
    "author": "Ross Fortune",
    "date": "2022-12-21",
    "content": "They break every element down in some video, almost certainly on the Sol State channel.\n\nI can’t remember his name, but the more producer dude (Howard?) does loads of great videos. The major takeaway though is that they use the same shit we all do, they just have an amazing chords/rhythm brain, and an amazing producer/sonics brain working in tandem and create fantastic records.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055568609872724150",
    "author": "austenballard",
    "date": "2022-12-22",
    "content": "So this is the kick drum: I've set the frequency to the root note of the key the song is in (in this case C), low feedback so that it just adds a *hint* of tone, low pass filter, and then I'm using the envelope to control the dry/wet so the attack of the unfiltered sample happens before the tone comes in to avoid messing with the transient - these are for drums, after all",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1057039796117192704",
    "author": "Ross Fortune",
    "date": "2022-12-26",
    "content": "@wilhelmjosephk Burning through Serum tuts and came across this one on making giant saw patches. Re your unison workaround for Massive - instead of using unison here, he modulates the coarse pitch of the two oscillators with the two independent chaos modulators. Is there a comparable way to achieve similar in Massive? https://youtu.be/IhvO8grER5s?t=92",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062385027645722744",
    "author": "NoahNeedleman",
    "date": "2023-01-10",
    "content": "Maybe a nashville thing- but getting the right feel shaker or perc loop going was key for me for a long time. Still a great hack for the less salty studio dogs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069028197414469758",
    "author": "ALXCPH",
    "date": "2023-01-28",
    "content": "A bit like a jazz progression, it’s usually easier to add extra chords when you know where you are going, rather than just plopping in random chords hoping to get somewhere. Like with so many things, it’s all about intention and having a goal in mind.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070835120845627413",
    "author": "GaspardMurph",
    "date": "2023-02-02",
    "content": "I’ve been getting into the habit of recording voice memos of song / chord / melody production ideas. They are very ridiculous and embarrassing (humming in the street and saying “then the drums will go like poom tchaka pshit pshit) so when I’m staring at the daw uninspired I try to re-create one of those ideas, even if it sucks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071555419203457104",
    "author": "jonmatteson",
    "date": "2023-02-04",
    "content": "Curious about this as well. I’m new here and have been trying to build my network with artists writing songs that they will hopefully release but I am just expecting to split master on those. Seems like clout is the only way to have a decent rate so I’m just going to play the long game of building that up until people are knocking at the door more. \n\nI’ve got friends in town who get 5-10k for major label songs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071898207149375600",
    "author": "ehutton21",
    "date": "2023-02-05",
    "content": "I also find value in it for me, when im the conduit from the first demo idea all the way up to the final mix. Telling them why I’m sequencing something the way I am or what im looking for might help someone cut a better vocal or think about chord voicing and structures differently.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073081986748530759",
    "author": "austenballard",
    "date": "2023-02-08",
    "content": "But also according to this, the difference is between non-ARA on the one hand, and ARA *and* standalone on the other.\n\nThere could be other documentation I'm missing, truth be told I've not really read the manual besides when I got all confused by the Snap to Chord Scale button",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073162285171879956",
    "author": "jonmatteson",
    "date": "2023-02-09",
    "content": "Damn. Is this with the new pro X or 9? I’m having all kinds of issues with pro X while bouncing tracks. It just decides to change the scale or key to the default while bouncing 😅\n\nAlso was it you that said classic sounds better than modern?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084546070102691850",
    "author": "Maxim",
    "date": "2023-03-12",
    "content": "One of the saddest moments in a session is when I see a (potentially awesome) song get lost because of overproduction. \n\nSo I’m pondering:\n\nWhat can I do when everything clicks (the vocal melody, lyrics in writing, vibe, drums & timing) to protect that? “Hey let’s record those vocals right now” (doesn’t work often). \n\nI’m recording on my phone to at least document. It’s just frustrating and something I’m seeing happen so frequently. It’s almost like the best can reach that point and execute while others dabble and major in minor things (that don’t move the song along).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088140148086161488",
    "author": "Slow Hand",
    "date": "2023-03-22",
    "content": "Hmmm. I wouldn't say that you *need* a Moog, but they're always a nice color to have in the kit. And it doesn't hurt that they're a \"classic\" sound, so having one around wouldn't be a bad investment and will likely see a lot of use over the years.\n\nThe last generation of Moog synths (from Sub37 onward) have been very gritty and have a lot of options for drive and feedback, which allows them to get very rough, in contrast to the Dave Smith synths which tend to be cleaner, buzzy, and articulate. These days Moogs are very warm, thick, and gritty. They're extremely easy on the ears, even when you're cranking the drive. The core components of Moog sound *really* good and there's a lot of care that's gone into the raw sound of these things. Namely the oscillators and the filter circuit. They are *very* well designed instruments. In fact, I'd say that they're *beautiful* instruments.\n\nMy recommendation for someone who's not super-deep into synthesis but wants to own a Moog would be to buy a *Subsequent 37*. It's got digitally recallable presets, whereas *Matriarch* and *Grandmother* are semi-modular and have little/no preset capability. The Subsequent 37 is plug and play, has a great set of unique features, wonderful grit, and is very fun to play.\n\nKeep in mind that the *Subsequent 37* is a monophonic synth. Technically it's paraphonic (can play up to *two* notes at a time), but you're not going to be playing any chords on it like on your Prophet.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090370274534363156",
    "author": "austenballard",
    "date": "2023-03-28",
    "content": "@BatMeckley Question if I may. I noticed a lot of the harmony vocals on *Femme Fatale* sound very synthetic, were these tracked in and then super hard-tuned or are they re-pitched leads/doubles or something?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596094921351281",
    "author": "Slow Hand",
    "date": "2023-04-03",
    "content": "We need to have an LA meetup to put our heads together and craft the best 808 patch we can muster. I would kill for a great 808 patch that doesn't have formant/length problems when I transpose it too far out of it's starting range.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092597094835036200",
    "author": "LAPhill",
    "date": "2023-04-03",
    "content": "But Matt.. what is a man who enjoys moving key centers to do???",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095801790873731142",
    "author": "NoahNeedleman",
    "date": "2023-04-12",
    "content": "@Edward Rivera you came in real hot on this one. I think the key is there’s a lot of grey area here and Marv is looking for guidance on whether it’s ever ok. You’re saying NEVER, Zack* says ALWAYS, Cian says sometimes….\n\nIt’s truly not that deep or dangerous is it? If I had a real bassist as my mixer and he said “I can play that part a little cleaner if you’re up for it” I’d says YES every time. If it loses the magic we’ll both know it. I trust a pro to be a pro.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095836459468066837",
    "author": "ehutton21",
    "date": "2023-04-12",
    "content": "I can’t speak to this on a scale that maybe some others can, but I know when I started offering to pitch something for a track or to help bring out a drum pattern a bit more/offer notes for the way the low end is translating were the moments that people who were initially just outside my orbit would actually come back into the orbit with frequency.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103387376304279673",
    "author": "Deleted User",
    "date": "2023-05-03",
    "content": "put that one last chord in a sampler. done ✅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103867125946400889",
    "author": "jordanmcleod_io",
    "date": "2023-05-04",
    "content": "Also coming from lego world and enjoyed this. I got into music by DJing dance music and eventually producing it for 5 years. My taste finally changed to live music and I started learning instruments. It’s still hard to get a good live feel but it’s a major focus on everything I work on now. I want to be playing full takes as much as I can. I don’t think I will ever be able to complete rid my brain of dance music workflows.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108838325088956578",
    "author": "Adam Thein",
    "date": "2023-05-18",
    "content": "The stuff on the left that sort of sounds like a guitar sounds like string noise to me - like it was played on a short scale with rounds and the low end is ultra crazy rolled off and compressed to hell and run through a pretty stable chorus like a dimension D type thing (pulls right slightly to me) and then the stuff high end is through an auto-wah that is chorused out in the opposite way, but the slides in those little moments where you can hear them seem too perfectly tracked against the low end to be a double to me, and it sounds like bass-octave stuff but the harmonics of it to me rather than a separate guitar layer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117857028270989383",
    "author": "spectrummasters",
    "date": "2023-06-12",
    "content": "Love it marv . You sir seem to be a fellow who knows his rhythms ! I feel you 💯 re your last paragraph . It’s a funny one , I get defensive when people criticise some of the articulated viewpoints and experiences of artists like the ones I record . I know their life and it’s struggles and realities , and often the people doing the criticising are imo often fully@morally corrupted and are receiving privileges they aren’t even aware of that keeps them away from these realities , instead looking down sanctimoniously , projecting and misinterpreting (lol I’ll wind my neck in now ) but also it frustrates me how unfortunately the image and language is perpetuated , given massive exposure and profited from by an industry that gives no fucks about the consequence on the community. Anyhoo . Life imitates art and vice versa and all that . At the end of the day I always think of it like this , if someone’s on a mic saying what’s on their mind or their heart that’s a major positive and I thank music for this transformative power",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119480116867768380",
    "author": "Slow Hand",
    "date": "2023-06-16",
    "content": "Maybe there's a solution to this problem where composers still sequence horns the old-fashioned way, using passable MIDI/sample mockups that don't get 100% there. Then the DAW does an offline pass when bouncing where it uses an AI model to fill in the blanks to make the legatos feel convincing. Or maybe it interpolates tongue-slaps into the performance in a way that carries over the resonance from the prior notes, or colors \"outside the lines\" by injecting a certain amount of \"frenzy\" into the playing that modulates pitch, intensity, timing, or overall \"vibe\". Or maybe it makes the timbre \"a little more Duke Ellington and less John Williams\". Or maybe it renders a double-tracked horn that's not just a pitch-modulated version of the source audio file.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119736564088586240",
    "author": "Slow Hand",
    "date": "2023-06-17",
    "content": "This sounds juvenile, but I would love for someone to physically model an ass that can fart. Model an airflow with variable air pressure and then an aperture to constrict that flow and a pair of cheeks that flap open and shut several times a second. You can modulate the resistance of the cheeks and play it like an instrument.\n\nAgain, it's juvenile on the surface, but I don't know another instrument that has the same properties. Maybe the embouchure on a brass instrument? But those are also resonating through the horn itself. It's got musical potential. I wanna rev it up like a motorcycle engine, and then make a stadium full of people listen to it. 😄",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123446174188314734",
    "author": "Deleted User",
    "date": "2023-06-27",
    "content": "Some examples I’m thinking of is anything from Tropzilla and Alabama Shakes - don’t wanna fight. On the latter the guitar parts are pretty simple, one main guitar doing longer chords and the other one doing single note rhythms.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1133107331115274287",
    "author": "suxpierre",
    "date": "2023-07-24",
    "content": "hey all, if this has been answered, point me the right direction. lurked for awhile, never posted. big fan tho. earlier this year I moved all my production over to Ableton from ProTools after like a decade and it's been amazing. still using PT for all the things it's better at, but now that I have key commands more nailed down in Ableton, been super happy producing there. so fast... but I need a little help with file management. coming from PT, the last bounce location is always recalled per session, so when you reopen a session, bounces go to the last designated location. with Ableton, the last bounce location seems to recall to wherever you last bounced in general... not by project. wondering what the best workaround for this is when bouncing many versions of a number of songs - i.e. I have six songs I'm working on, and bouncing versions for dubs, some stems, and roughs for the client. I would love to not manually select the bouces folder I have created per project, as it's a lot of menu diving.. I can't seem to find a bounce location settings in preferences.. so figured I would ask the ableton wizards here. or is it best to just create a master bounces folder per EP or record and add to it as I go? kind of annoying if so, but I have learned enough workflow changes, I can adopt something like that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134959939387920475",
    "author": "peterlabberton",
    "date": "2023-07-29",
    "content": "I’ve always felt chords are overrated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1134966697388945508",
    "author": "youngteam",
    "date": "2023-07-29",
    "content": "bassline + melody definitely can supply you with enough context to know what the harmony is tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135001503120248852",
    "author": "Slow Hand",
    "date": "2023-07-29",
    "content": "I love James Brown deeply. His innovation to strip the harmony way down is a baller move that I think we mostly take for granted today. Probably because 70% of bass product demos are whack single-chord funk grooves. 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135004105123835995",
    "author": "LAPhill",
    "date": "2023-07-29",
    "content": "Okay, but what's the best chord?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135006391854186588",
    "author": "youngteam",
    "date": "2023-07-29",
    "content": "melody is most important and rhythm frames the intensity of what’s being said but I think harmony is super important because it contextualizes the entire story that’s being told",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135006743101968455",
    "author": "NoahNeedleman",
    "date": "2023-07-29",
    "content": "IMO, the best chord is a minor V.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135007741677682778",
    "author": "LAPhill",
    "date": "2023-07-29",
    "content": "In all seriousness, I don't think that the function of melody, harmony, or rhythm is so clear-cut in modern music. It's also hard not to put arrangement/production/orchestration up there. Everything is contributing to the story, and it's worth exploring all aspects of music deeply so that we can be as articulate as we can.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135014596424519691",
    "author": "youngteam",
    "date": "2023-07-29",
    "content": "agreed on all this. everything is pretty heavily interacting with everything else at all times and lines get blurred along with function. I'm incredibly conscious of my top line and harmonic rhythm when i'm playing chords for song starters!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135022692865671309",
    "author": "tomtom",
    "date": "2023-07-29",
    "content": "Totally.. and that brings up the whole concept of harmonic rhythm and melody in harmony. Another reason McCartney deserves his knighthood.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136383559670710402",
    "author": "Deleted User",
    "date": "2023-08-02",
    "content": "with subs-there isn’t a specific key that works well, but you typically don’t want the bass notes to go down too low. Kick wants to be lower than bass in 4 on the floor house most of the times and if the bass is too low then the kick can’t be lower",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1149665878032523394",
    "author": "austenballard",
    "date": "2023-09-08",
    "content": "Nobody asked, but here's a zip of basic MIDI swing presets I made this morning for my own use. 8th and 16th notes at 1/8th and 1/6th intervals from 13% up to 88%.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1151515200441286656",
    "author": "Adam Thein",
    "date": "2023-09-13",
    "content": "Got RVC setup to mess with and trained a model overnight on my aging GPU.  Solved a hard problem for me where the artist sang a take full voice in a lower key and I was tasked with trying to bring it up to the key of the instrumental but I was having a tough time with the formants sounding natural.  Made a couple different takes with settings to comp and got much more convincing results than simply pitch and formant shifting.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154240960935510020",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-20",
    "content": "You can be quite fast + detailed with separate trill + the pitch correct macro tied to a key command, and dial in a good amount in %",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155587543933407332",
    "author": "Skyler Young",
    "date": "2023-09-24",
    "content": "The reverse effect I’m obsessed with - it syncs to your bpm and can make really cool pumping sounds or intresting swelling chords that would typically take a number of steps to do otherwise",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155624807971434506",
    "author": "Slow Hand",
    "date": "2023-09-24",
    "content": "@Skyler Young This looks cool. A neat feature I'd love to see someday would be to add a simple EQ device and allow internal resampling of one-shot samples. The idea is that samples often have some boxiness or ringing that needs to be EQ'd out, but those problem-zones shift when the sample is transposed up and down, making any post-sampler EQ moves ineffectual.\n\nIf you could streamline the process of re-recording a static sample with the necessary EQ cuts committed into the one-shot then those cuts would be transposed along with the sample when you play it up and down the keyboard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161013243263848539",
    "author": "xico1702",
    "date": "2023-10-09",
    "content": "Hi folks! Hope you're doing great! I want to ask you something. My name is Francisco, from Portugal, I'm 23 years old and I'm a self learner about music theory and music production. I know how to play piano and strumming acoustic guitar a bit. I started to using a DAW in my 14s (FL Studio, yeah I know xD) and in the last 3 years I've been using Logic Pro and last months Pro Tools (just for editing and mixing).\n\nI love to produce electronic pop with a mix between synths and acoustic instruments. I want to be more versatile and confortable producing other genres (genres that I can produce just in my bedroom studio without having a great recording gear). \n\nI'm feeling stuck, I'm trying to listen different genres. I'm feeling very limited because I don't have a great background as a music player or student (my bsc is physics engineering). The music industry is tough and I want to be more confortable to work in other genres.\n\nI tried to be as brief as possible. What advice do you have for this situation? If I forgot to say something, I am free to respond. Thank you for your attention! Sorry about my english. 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1161752412244152371",
    "author": "Adam Thein",
    "date": "2023-10-11",
    "content": "That new new would be to use AI to train a model and replace the transposed vocals.  Otherwise just the best possible formanting you can get away with.  Ideally just cutting more harmonies though!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169256852417163294",
    "author": "youngteam",
    "date": "2023-11-01",
    "content": "My thought process is “I want to make a beat like _” I’ll usually start by finding a sample I like and putting it to a bpm / key I’m feeling then go from there. I have folders of drum sounds I’ve curated from various packs that I’ll quickly go through then.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169257269578432552",
    "author": "youngteam",
    "date": "2023-11-01",
    "content": "The thought process is I want to be able to make beats in various styles very fast because I feel a lot of sessions are like this. You don’t have to use a sample for inspiration it can be a couple of piano or guitar chords. I’m trying to understand what producers are looking for in samples as I make them myself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169718140008157184",
    "author": "Nomograph Mastering",
    "date": "2023-11-02",
    "content": "The idea that there’s an objective scale of niceness in a session makes no sense to me. It can be a lot more caring to go off on someone if you have a shared mission than to smile and be nice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169727844071514142",
    "author": "Rollmottle",
    "date": "2023-11-02",
    "content": "this is right. the key is not to hold back because of the **possibility ** of somebody feeling hurt, but to find a way authentic to you to communicate it, even if after all that, it means somebody gets hurt.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174036102236090429",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-14",
    "content": "Wrong key and tempo I think - I tried aligning the vocal track with varispeed to the length of the instrumental - then key and tempo were more or less correct",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177987964945584339",
    "author": "Josh",
    "date": "2023-11-25",
    "content": "All of the key based stuff is crazy. Especially with meld. And then I’m really stoked for the note groups to have them trigger randomly. Also the midi generator is cool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181874216233082880",
    "author": "Slow Hand",
    "date": "2023-12-06",
    "content": "@Josh I owned an NI Maschine+ (the standalone hardware unit) for a year before I eventually sold it. My reasons were much like yours; to get away from software and have a standalone instrument to play with.\n\nI don't have many bad things to say about it, but ultimately it just wasn't a good fit for the way my brain works. NI have crammed a tremendous amount of features and functions into that thing. Most of which it does very well, but when it came time to do sequencing in the unit the interface was just too much of a hurdle for me. I found it hard to keep all of the key commands in my head to do simple commands. I think it's a little *too* efficient in how many options they've fit into it. Remembering the commands among it's unorthodox button layout was challenging and unintuitive for me.\n\nAs you might imagine, it integrates perfectly with the Maschine software, which is basically a DAW within a plugin that controls the hardware and vice-versa if you choose to use a computer. But I wasn't interested in that, because I can achieve the same things and more with plain old Ableton.\n\nIt *does* have a fantastic sample library and the NI sample packs you can purchase are very well done.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183502650885558272",
    "author": "jonmatteson",
    "date": "2023-12-10",
    "content": "i usually will just nudge around until it feel right but if you want it to be relaxed drag the pick scrape to the down beat. if you want it to rake do the “meat” of the chord. \n\nI would also recomend trying to split the audio on the grid and drag that around instead of quantizing because it can have less audible effect kind of like time aligning a vocal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186742270221889566",
    "author": "jonmatteson",
    "date": "2023-12-19",
    "content": "on the hunt for a decent feeling 49 or 61 key midi keyboard again. \ndo you have one you dig?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186803340156342342",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-12-19",
    "content": "going through the stems of blackbears \"hot girl bummer\" and once again I noticed that it doesn't take a lot to make a great song: there's only stack of harmonies in the chorus and it's I'm pretty sure made with melodyne or autotune bc of all the artifacts in there. There is one natural mono harmony in the second pre and it has crazy bleed. The sample they took from a tv show (\"you want me to change... f*** you) still has the background music from the show in it (you'd never notice it in the mix though) \nWhat makes his vocals so cool is the creativitiy, with all the formant shifting on the lead + the lower octave that's probably done with little alter boy or smthg similar. \nthe guitars are played super well but also there's the occasional scracth and bum note in there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187437387798810736",
    "author": "Ross Fortune",
    "date": "2023-12-21",
    "content": "Yes! I’ve got a playlist of The Penguins and The Four Freshmen, both of whom were inspirations for Brian’s harmony writing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189083720469196811",
    "author": "Rob Domos",
    "date": "2023-12-25",
    "content": "To be embarrassingly transparent, a lot of times I think a note is late by listening and then after looking find out it was early. Things just feel in time or out. Also, a lot of things that have loose rhythm in a way that people tend to love often bother me and sound out of time to me. Jay-Z is a perfect example of this. I spent years thinking his rhythm was terrible before I realized he was doing a shuffle time feel where the amount his vocal is off from the snare creates the shuffle. I just didn’t pick up on that for like… 15 years? And just wondered why nobody else was bothered him being “out of time”. Kind of like when people with an undeveloped sense of harmony think of jazz as simply being an excuse for allowing wrong notes. That’s how I hear people that are famous for stretching rhythm",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196609249531412510",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "I’ll try this, but I doubt it will  sound like someone playing chords",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196611313347076188",
    "author": "Adam Thein",
    "date": "2024-01-15",
    "content": "We’re in the age of producers being able to resing parts with AI replaced vocals, I think layering to build chords is way more than fair game!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207418315094630410",
    "author": "Slow Hand",
    "date": "2024-02-14",
    "content": "Yeah. I'm asking if you want samples of solo string instruments or a string section.\n\nFor ensemble I've been enjoying the *NI Session Strings 2*. I've also got the *Spitfire BBC Symphony* but I'm less fond of those because they're recorded from an orchestral perspective and have a lot of room sound baked in, whereas *Session Strings 2* have a closer perspective. If you want an ensemble sound plus some major grit and close-miking I *do* like the *Bernard Hermann* orchestral library from Spitfire.\n\nFor solo strings the *NI Cremona Quartet* instruments are really, really nice. They're a pleasure to play with and sound fantastic. These have maximum presence too, so you can get some very direct sounds with them. I'm really enjoying them. The articulation and tonal options are extremely thorough.\n\nA while back a few people recommended *Sunset Strings* by Realitone. While I haven't used it yet, they look very promising. They seem to be serving people who want a rock/pop string feel, which could be just the ticket.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211352274325217350",
    "author": "LAPhill",
    "date": "2024-02-25",
    "content": "As @Deleted User said, there should be a way to add a negative value to track delay. I only know how to do it in Logic and Cubase, but I'm sure the other major DAWs have a way, too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212230415633481798",
    "author": "Deleted User",
    "date": "2024-02-27",
    "content": "what do you mean when you say production? \n\nsome thing I can think of off the top of my head\nwriting process\narrangement\nsound selection & mangling\nworking with an artist or other humans\n\none thing that has been helping me lately with the writing portion is figuring out chords for all sections early on. this might be obvious for some folks but I’ve been way too focused on figuring out instrumentation and making new sections work by changing instrumentations. So I’ve been trying to pay more attention to linear development. \n\n@slow.hand prompted really good ideas on figuring out chord progressions. Speaking of which, I do need to put together a way to use google form and compile all the oblique strategy forms in one place sometime soon",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212313694189391923",
    "author": "Deleted User",
    "date": "2024-02-28",
    "content": "I am the opposite, I’m pretty good with chords that just work as a vamp so I lean on them heavily. Which made me develop a habit of just changing instrumentations in new sections to make the song go. But it also causes me to get stuck at times because I’m trying to find a way to create the arc with the wrong tool for what the song wants to be. after doing a few with different songs with different chords for pre chorus or verse and figuring out all the sections early on, it feels like a good way to get an idea of what the overall arc of the song may look like",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221906051641638982",
    "author": "JustinLeu",
    "date": "2024-03-25",
    "content": "What’s everyone favorite way to pitch instruments down to change the key of a song? I have an artist that had a large country production recorded and now wants it to come down a half step… 🙏🏻",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230987923352981554",
    "author": "markmaclure",
    "date": "2024-04-19",
    "content": "Saying “we” rather than “I” or “you” has been huge for me. Still working on it but this is key for sure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1234929821889597540",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-04-30",
    "content": "is it possible to modulate the frequency in Pro Q3 via external sidechain? Basically what I wanna do is that I have this choir and I want a synth pad to open up frequencies the more intense the choir sings. So I figured I'd make an envelope, route that to the choir, send it into pro q3 and have it modulate the frequency of a lowpass. Thing is, I only know you can modulate the dynamic eq in pro q3 but I haven't found anything online that allows to modulate the frequency itself. \nSo in short, I want the eq to open up with the intensity of the choir. \nIn essence, make the frequency dynamic to the sidechain.\nAnyone have any tips?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237775663524610109",
    "author": "crumley",
    "date": "2024-05-08",
    "content": "Does anyone know of any orchestral plugin / sound banks that behave like a real ensemble, in the way that individual string players don’t reiterate every single note, but each player portamentos from one note to the next within a chord? For example, if I had 3 string players playing a c major triad (C, E, G), and then they play an A minor triad (A, C, E), the C would portamento to an A, E to C, etc, without reiterating the beginning of the note.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237779317770162306",
    "author": "Ross Fortune",
    "date": "2024-05-08",
    "content": "Unless maybe it used a rule where the first note hit would always be assigned to bass, second to celli etc. So you’d play/program a chord like you might rake a pick across a guitar chord. Still tho, fuck that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237797084648706121",
    "author": "Ross Fortune",
    "date": "2024-05-08",
    "content": "Um, while we’re doing pester @LAPhill about libraries… What are real composers using for action style repeated fast staccato string figures? \n\nI’ve got reasonable results layering Kontakt Session Strings 2 with BBCSO, but it’s pretty laborious - key switching in BBC per note between staccato and spiccato to make it more exciting and less machine gun.\n\nI see Action Strings pop up. Is that old hat?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240518840731828274",
    "author": "Slow Hand",
    "date": "2024-05-15",
    "content": "Does anyone know if there's a program, synth, or protocol that allows you to modulate synthesizer envelope times based on the duration of the MIDI note?\n\nFor example, if I draw a quarter note (on the piano roll) and my synth plays a one octave downward sweep it would take a quarter note's worth of time to execute that sweep. But if I draw a MIDI note with a whole-note duration the synthesizer would modulate it's envelope time and that same sweep would descend over the course of a whole-note.\n\nThe synth would have to read upcoming MIDI note lengths from the the piano roll and modulate it's parameters on a note by note basis by reading the note duration before the note-on message. There would have to be some sort of communication between the synth and the DAW, and of course it would not work in real time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241854050677424170",
    "author": "Nomograph Mastering",
    "date": "2024-05-19",
    "content": "Current moral panics aside there will always be someone at one extreme who is listening to “transgressive” music as a way of social signaling or feeling heard, and there will always be someone protesting it (on a scale from this is wrong to look at me and how pure I am)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241855323409481949",
    "author": "Nomograph Mastering",
    "date": "2024-05-19",
    "content": "The key difference is that it can now be monetized!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255763586731479171",
    "author": "spectrummasters",
    "date": "2024-06-26",
    "content": "When jungle and (later ) drum and bass producers in England started to receive commercial radio plays and their productions were licensed onto major label compilations , every music and fashion journalists worth their fee was all over “the sound “ . How is it constructed , what is it made up of . The same thing a little after with uk garage . Jungle had and still has “a round table “ of gatekeepers who founded the music and who would meet to discuss the future of the music , the sounds , the vibe the bpm etc . If you knew the music and the people you’d know why some people would be excluded from the scene . I never had a problem with any of that . They invented the scene and they were protecting it from scene jumping fair weather productions .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255763894761291878",
    "author": "spectrummasters",
    "date": "2024-06-26",
    "content": "Daniel bedingfields and Victoria beckhams jumped into the music as soon as major label licensing deals started popping off",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277733216249450649",
    "author": "Slow Hand",
    "date": "2024-08-26",
    "content": "That would give you the most rhythmic control and then you can tweak the gate depth/atk/hold/release times to get the precise articulation you want, or even modulate them as the song progresses.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280285762914484366",
    "author": "Slow Hand",
    "date": "2024-09-02",
    "content": "@Rob Domos Do you own Reaktor, by chance? \n\nThe *Space Drone* by Martijn Zwartjes synth is wonderful, and I've never seen another approach to particle synthesis like it. I modded it many years ago to conform to keys and chords. I'll send you the patch if you want.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283890061733007371",
    "author": "Adam Thein",
    "date": "2024-09-12",
    "content": "For a total beginner with libraries I’d take a hard look at the UVI Key Suite, covers basically the same ground and a bit more than Keyscape for less $$",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284216940889509966",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-13",
    "content": "Dumb question time: Is there a trick to getting a consistent distorted power chord guitar tone with mixed in non-5th intervals? Like going from a C to a C/E (which will have a minor 6th in the bottom E+C) the intermodulation and breakup sounds entirely different with all settings I’ve tried. How would you approach it to make sure it sits similarly?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284219192576315443",
    "author": "LAPhill",
    "date": "2024-09-13",
    "content": "(Though, even if the bass is playing that inversion note, it can still get muddy if your guitar's chord is low enough that the added low octave is near the bass note)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284226087433539696",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-13",
    "content": "Thanks for the great answer man! \n\nWould it at all make sense to for C/E play a normal E power chord, and then reduce the most B sounding frequencies w/ tight EQ bells? \n\nIn the past I’ve dubbed single bass notes w guitar and automated that track in more when needed to try and make up the difference when things get wacky",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284233620898451527",
    "author": "LAPhill",
    "date": "2024-09-13",
    "content": "Couldn't you do this on a synth that's one oscillator per voice? If you're consistent about the amount of notes in a chord, it'd be pretty easy to try and see how it sounds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284260266812641395",
    "author": "Slow Hand",
    "date": "2024-09-13",
    "content": "Synths could easily do this, but they’re rarely designed in a way that would give you different oscillator timbres per note. \n\nThey’ll give you copies of the same oscillator setting for each note, but they don’t change the timbre based on which note is being played in a chord.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284673577949331466",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-14",
    "content": "Yeah that's surprisingly consistent, much more so than my attempts! Like on \"interstate love song\", those chords seem to break up similarily no matter the chord. Back into the cave twiddling buttons I guess...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301949773187776595",
    "author": "Johnny I",
    "date": "2024-11-01",
    "content": "Working on a track that's primarily acoustic guitar and vocals; a couple of sections where a chord or note on the guitar is a bit off timing, in a way that's distracting. What's a suggested method to best correct this if an edit or punch isn't possible? Since the guitar is so exposed, I'm not sure how to approach this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301959627839246376",
    "author": "Johnny I",
    "date": "2024-11-01",
    "content": "Yes I mean editing, but this is the first time I've encountered this particular situation, and wasn't sure how to go about it...I am in Pro Tools...I am used to replacing parts with a section from a different part of the track, when it appears elsewhere...this is the first time I've had to edit where there wasn't another similar section....so I wasn't sure how to take a chord or note, pull it back or forward without a space/silence in between...wasn't sure the best method (i.e. time stretching the tail, etc).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1303075635702399007",
    "author": "chris_donlin",
    "date": "2024-11-04",
    "content": "People have mentioned slip quite a bit in here and admittedly I haven’t used it a single time in all my PT years. What’s the advantage of slip mode? I find myself using the command key often if I want things off grid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1303080268931793068",
    "author": "Josh",
    "date": "2024-11-04",
    "content": "It’s just less pulling/pushing clip boundaries. Issue is PT only slips via a nudge hot key so unless you have stream deck dial mapped to it it’s a pain.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1303086652180140104",
    "author": "Bryan DiMaio",
    "date": "2024-11-04",
    "content": "bet you could use keyboard maestro to make a modifier key for the mouse wheel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1303100665576554649",
    "author": "Felix Byrne",
    "date": "2024-11-04",
    "content": "the command key in my understanding just puts u in temporary slip mode (or vice versa)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310961103521447998",
    "author": "Sam Segarra",
    "date": "2024-11-26",
    "content": "Reverse reverb on an arpeggiated piano chord 100% wet has been a go-to for me. En verb in logic has a cool stock setting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310990290047336449",
    "author": "Eric Martin",
    "date": "2024-11-26",
    "content": "before the downbeat no crash on the new section, filter sweeps do the thing for me, Juno chords raising the cutoff, drums through a EHX bass microsynth doing the sweep, anything to have fun",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318646368897597473",
    "author": "spectrummasters",
    "date": "2024-12-17",
    "content": "If anyone felt they could help me nail the guitar sound in this I’d be very grateful . If you listen from 2mins 20s in just before the big chorus drop , when it drops in a snaking guitar line  comes in . Not the chords the weaving melody line . Sounds like a chorus or flange ? And pitch flutter . I tend to get stumped between nailing chorus / flange / phase effects on guitar and really nailing them . https://music.apple.com/gb/album/conceited/1743250148?i=1743250259",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319757439008247912",
    "author": "Adam Thein",
    "date": "2024-12-20",
    "content": "couldn't find in the manual, but does the arpeggiator have an option to turn off key sync?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319758182381518899",
    "author": "Adam Thein",
    "date": "2024-12-20",
    "content": "was hoping to find a unified piece of kit that can send multiple channels of arpeggiators all on midi clock with switchable key sync but I cannot find that product for the life of me outside of just Ableton",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319766639453143203",
    "author": "Zack Hames",
    "date": "2024-12-20",
    "content": "I gotta think on that. I’ll try to experiment. I feel like you can adjust the arp to effectively turn key sync off. \n\nSeems like a pretty intense thing I’d never considered! May be hard to find hardware alone that does that. you could effectively do that on the Akai but you’d have to do it in passes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319767435611738223",
    "author": "Adam Thein",
    "date": "2024-12-20",
    "content": "Korg arps allow for key sync to be toggled, and also the Sequential stuff on the latest firmwares but not Moog.  Very niche need!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1327080346994479145",
    "author": "river",
    "date": "2025-01-09",
    "content": "yes, still have the physical blue plastic key as well lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1338592140128686214",
    "author": "Jeremy Klein",
    "date": "2025-02-10",
    "content": "but with all kinds of loops. Bass lines, key parts, fx, etc.\n\nSo simple, but just helps the song feel less like a Garageband demo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346577154531655732",
    "author": "Slow Hand",
    "date": "2025-03-04",
    "content": "Try a doing a rough key change to hear things in a different light. Just print the stereo mix and do a varispeed or granular pitch shift. That will help you to hear it with fresh ears.\n\nWhen I go off on these excursions I'll usually end up making two versions of the record and quite often there are really exciting elements of both and I end up fusing them together. The contrast can be really cool and exciting!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378425855319212115",
    "author": "diamndsdancin",
    "date": "2025-05-31",
    "content": "is there any good sites or something where i can download midi packs for chord progressions in styles of like gunna or travis scott?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387838315440636014",
    "author": "hyanrarvey",
    "date": "2025-06-26",
    "content": "As a layer? Like raking a chord under the downbeat or straight up a “chsck”on the mains",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396233597102592010",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": ", which makes major limitations on file names",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397836661630697513",
    "author": "Nomograph Mastering",
    "date": "2025-07-24",
    "content": "It’s ok to overcome minor inconveniences without telling the internet",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407759765500592228",
    "author": "Tristan",
    "date": "2025-08-20",
    "content": "You’re in until you’re out sure is it. Just hard to imagine not failing upwards after that on a few other key records, but ofc I’m sure he did financially.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410682416343023779",
    "author": "jonmatteson",
    "date": "2025-08-28",
    "content": "Run the sax through harmony engine and have the best of both worlds",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417224503871672492",
    "author": "diamndsdancin",
    "date": "2025-09-15",
    "content": "Does anyone have any ways to get inspired when sitting down to produce/create a song?\n\nFor example: I usually sit down with a piano sound and play with chords, but sometimes I’m not really feeling it like today. Sometimes just playing a drone sound in a certain key helps.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418310872975016097",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "I want a sampler that I can look at a browser, click and/or drag like Battery, but it just lands on the damn key, and when I hit it, it plays the fucking sample instead of forcing me to hold the key down for the entirety of the sample to play, and then starts looping it by default.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418311133202481182",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "I don't give a major fuck about being able to tweak the sounds other than pitch within a sampler. (don't need effects or EQ built in necessarily but it can be nice)\nI do like using battery for key-tracking samples. but again, it still loads everything as a fucking loop by default. I just read the *entire* manual, there is 0 way to change the default way it loads in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1420724144907091990",
    "author": "Ross Fortune",
    "date": "2025-09-25",
    "content": "This synth that starts 2.12 and ends up directly inside my brain at 2.24. \n\nThe most \"out of speaker\" parts cancel in mono, but the effect works both in headphones and speakers. I'm guessing it is some kind of phase inversion between the two speakers, but it feels like the effect modulates smoothly over time (rather than ON/OFF). \n\nIs there a tool that can shift phase per speaker over time so that it slides to 180 and back?\n\n@Slow Hand maybe this is something that can be accomplished in Serum somehow?\n\nhttps://open.spotify.com/track/7jq2d4lyn2WvP6m5v2Q4fD?si=6aad087b9d27491e",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1420825094485184552",
    "author": "Slow Hand",
    "date": "2025-09-25",
    "content": "It sounds like it may be a simple haas-effect spread by delaying one side by a few ms. \n\nThat would be easy enough to modulate with a stereo delay: Keep one channel at 0 ms and then automate the opposite channel in the range of 0-60ms\n\nThat would track with the collapse in mono that you're experiencing and explain why the rhythm starts to slur and get messy at the apex of the effect.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429511917814157313",
    "author": "diamndsdancin",
    "date": "2025-10-19",
    "content": "anyone have good techniques of creating chord progressions?\n\ni could play any major/minor chord pretty quickly but not sure how to choose what chord to play after unless i keep playing whatever lands on the fifth but thats only 1 chord progression really",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429523951469596954",
    "author": "diamndsdancin",
    "date": "2025-10-19",
    "content": "i guess to spice my chords up its to do with voicing too / inversions / multiple octaves or such as the simple triads dont give the same feel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429524902284886038",
    "author": "Brian Reynolds",
    "date": "2025-10-19",
    "content": "I know nothing about theory. But big fan lately of playing the two outside notes of a triad low on left hand. Then play the middle note one octave up and play some other notes with the right hand after main chord hits. Also stacking two chord progressions on top each other, most of the time ones that a more talented piano player could play at once.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429530373351538859",
    "author": "diamndsdancin",
    "date": "2025-10-19",
    "content": "haha this is exactly what ive been doing with the 1 and 5th on left hand and then 3rd on right hand, which i like the sound of a lot more than a standard triad i guess\n\nadding the 7th too\n\ni guess im just super slow switching chords doing this so need practice\n\n\n\nwhen u say u play other notes on the right hand after main chord hits, are you saying like a little melody on top of the chord rather than extra notes in the chord like a 9th or 11th?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429551621267783801",
    "author": "Slow Hand",
    "date": "2025-10-19",
    "content": "If you learn how diatonic chords work it can take you far. Every key has what are called it's diatonic chords. These are chords that are made from the notes in your major or minor scale.\n\n**For example:** In the key of F, your diatonic chords are these:\n\nF, Gm, Am, Bb, C, Dm, E dim.\n\nYou can play any of those chords and they'll fit right in. Those are your \"can't lose\" chords that will sound coherent no matter what. I would start here by chaining some of these chords together and seeing how they sound. They're like words in a sentence that you can rearrange to say different things.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429858239515857067",
    "author": "David Fuller",
    "date": "2025-10-20",
    "content": "Oh is this where we go into schillinger harmony",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430604685022335027",
    "author": "Skyler Young",
    "date": "2025-10-22",
    "content": "I have a playlist of my favorite 100 “hit” songs. I spent an afternoon writing down all of their chord progressions (most had 4 chords repeated whole time). Unsurprisingly many’s had the same progressions (just different keys). But if I’m ever in a pinch I just take a look at the list and go from there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430605205145124934",
    "author": "Skyler Young",
    "date": "2025-10-22",
    "content": "95% of them started with the 1 4 or 6 (minor key perspective)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430913613211631648",
    "author": "diamndsdancin",
    "date": "2025-10-23",
    "content": "right! seems to be that way from what ive seen - pretty normal chords then just spaced around with different voicings/9ths/11ths... is this chord sheet on sky studios?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444107548536869056",
    "author": "oaklandmatt",
    "date": "2025-11-28",
    "content": "Sort of, yes. But you don't need to take a chunk out of the middle of the note. The slowest way to do it (and the easiest for me to explain) is you just make two edit points: one in the middle of the held note and one after that note is finished. You then move that new clip later, drag out the end of either clip in the new space you just created, line up the waveforms, then add an equal gain crossfade.\n\nThere are several combinations of pro tools key commands to achieve this with many fewer clicks than I just described (nudging commands, option clicking and dragging, heal regions, etc), but those are easier to show than tell",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453661362659266622",
    "author": "Slow Hand",
    "date": "2025-12-25",
    "content": "@Akanksha Co-sign on what Matt has said here. Learning to write chord progressions is a strong skill to develop. Chords are what gives your song harmonic motion and a sense of going places. They can give it tension and release. A good progression will show you where to take the song next.\n\nOr you can write a melody first and then come up with chords underneath it. Whichever feels more natural to you. No wrong answers here.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1466268066714489029",
    "author": "Rollmottle",
    "date": "2026-01-28",
    "content": "Yup. I wasn’t trying to equate performing and mixing or even specifically talking about making orchestral VSTs go. Just reacting to the idea that turning off the performance (or mix or songwriting or some other inextricably linked piece of music)  is some major revelation…see how much better it is when it’s performed!? See how much better it is when you work on it!? Well…yeah.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469775764533543096",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-02-07",
    "content": "Anyone got any ideas on what they're using for the almost-real synthetic backing vocals here? I'm thinking antares harmony engine, there's a certain uniformity to it that doesn't sound melodyne to me, but Harmony Engine is buggy so I'd prefer something else https://youtu.be/-H_k7iwrWVY?si=U7Oyg_Yepok9UBqM&t=222",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471989101807796234",
    "author": "NoahNeedleman",
    "date": "2026-02-13",
    "content": "Production trick that's been working for me lately when I don't have a harmony but i need one:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472292821787480317",
    "author": "diamndsdancin",
    "date": "2026-02-14",
    "content": "i have this short basic sample, when putting it in ableton and converting to harmony\n\ni really want to take the whole chords by it but ableton isnt always spot on with it\n\ndoes anyone recommend the best way to convert samples to midi",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472302749310783629",
    "author": "diamndsdancin",
    "date": "2026-02-14",
    "content": "not sure if thats related but cant select analyze chords anyways",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472630956488659017",
    "author": "austenballard",
    "date": "2026-02-15",
    "content": "i have a chain that uses some of the multi-mod melda plugins to make the harmony sufficiently different from the vocal i copied and then more or less what you're doing with microshift \n\ni've been able to make reasonably passable full SATB from a lead vocal before with it\n\ni'll post it in here later if anyones interested",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]