[
  {
    "id": "1086418643308527747",
    "author": "austenballard",
    "date": "2023-03-17",
    "content": "https://chng.it/9XgwN5jn87",
    "reactions": 35,
    "categories": []
  },
  {
    "id": "1120081149407015012",
    "author": "Slow Hand",
    "date": "2023-06-18",
    "content": "As someone who mainlines a *lot* of music on the regular and has been doing so for two decades now let me say that it's a tradeoff. I consider myself to be a fan of music *foremost* and a musician second. Even though I rate being a musician *very* highly. The impulse to make music is secondary to the urge to discover and appreciate it.\n\nTime spent listening to records is time lost doing something else. Whether that's performing music, raising a family, pursuing a career goal, or saving the world. In some senses I think of myself as a very lopsided individual.\n\nLife, in all of it's variety, is too big to get your arms around it all. So don't feel bad about prioritizing certain things to the detriment of other stuff. We can't do it all. Lean into the aspects that you enjoy most and then team up with those who have chosen to specialize in the things that you rank second.",
    "reactions": 35,
    "categories": [
      "reference_inspiration"
    ]
  },
  {
    "id": "1208449940682969129",
    "author": "BatMeckley",
    "date": "2024-02-17",
    "content": "One day we should do a group hang and go over how to properly tune vocals in melodyne.",
    "reactions": 33,
    "categories": [
      "songwriting_arrangement",
      "vocal_production"
    ]
  },
  {
    "id": "1420258502567395470",
    "author": "Slow Hand",
    "date": "2025-09-23",
    "content": "Does anyone have any recommended resources for learning the finer points of Melodyne? It's a little overwhelming to start, and I can't afford Beckley's retainer, so I thought I'd ask here. I can't be the first person to struggle with this.",
    "reactions": 32,
    "categories": [
      "songwriting_arrangement",
      "vocal_production"
    ]
  },
  {
    "id": "1187106495469457580",
    "author": "Skyler Young",
    "date": "2023-12-20",
    "content": "https://www.dropbox.com/sh/37978jbrpj9lvjf/AACdYeJAN-jt_aPd2rQ8-Zuga?dl=0",
    "reactions": 29,
    "categories": []
  },
  {
    "id": "1204488670858584156",
    "author": "NoahNeedleman",
    "date": "2024-02-06",
    "content": "Quick shoutout to @Zack Hames for remote recording & delivering pro level drums. He saved me on that cranberries loop thing I was looking for and then absolutely smashed a full song performance for a country song. \nPro delivery, great communication, enthusiastic collaborator, reasonable rate, tight and tasteful performances.",
    "reactions": 28,
    "categories": [
      "sampling_libraries",
      "genre_production",
      "reference_inspiration"
    ]
  },
  {
    "id": "1078133908832534579",
    "author": "cian riordan",
    "date": "2023-02-22",
    "content": "Hard to reach anything when I’m hogtied in your childhood bedroom. The blacklight Sublime posters were a bit much at first, but but now I’ve managed to re-kajigger your Nintendo 64 and I’m able to play Goldeneye with my chin and mouth. Mummy brings me a Costco pizza every 48hrs… Ive figured out how to make it last. Might request a chicken bake next go around. But yea, I guess the ATC 20s sound pretty good in here.",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1446376706255622164",
    "author": "Nomograph Mastering",
    "date": "2025-12-04",
    "content": "“Perfect” with 10 questions is worse for many pros than “very good” with no interruptions",
    "reactions": 24,
    "categories": []
  },
  {
    "id": "1095822472739303496",
    "author": "LAPhill",
    "date": "2023-04-12",
    "content": "Just want to say, kudos to @Deleted User for leaving awhile ago to go work on his situation instead of getting stuck in the weeds.",
    "reactions": 23,
    "categories": []
  },
  {
    "id": "1004834468625924207",
    "author": "Slow Hand",
    "date": "2022-08-04",
    "content": "Last night it saved my ass when mixing a kick drum that was too muted and dark. I dialed in a little upper midrange noise tail to come in after each hit and it gave me just the right amount of decay and presence to feel right in the mix. I love this thing.",
    "reactions": 22,
    "categories": [
      "beat_making_drums"
    ]
  },
  {
    "id": "1089961055754653766",
    "author": "LAPhill",
    "date": "2023-03-27",
    "content": "Man... I've just started the recording process on a score I'm wrapping up next month. Got the first batch of tracks in, which were vibraphone parts. Very much a texture and not a featured instrument most of the time, and it's just incredible how even those background parts elevate the music beyond the samples that were in there. Getting goosebumps over here, a reminder that injecting humanity into our music is so important.",
    "reactions": 22,
    "categories": [
      "arrangement_orchestration"
    ]
  },
  {
    "id": "1266756505617829960",
    "author": "NoahNeedleman",
    "date": "2024-07-27",
    "content": "Just ruthless moderating here. 10/10 no notes.",
    "reactions": 21,
    "categories": []
  },
  {
    "id": "1267175404322689046",
    "author": "chrissorem",
    "date": "2024-07-28",
    "content": "This made me think of a production technique Ive stumbled on.  We all have our go to instincts that can lead to a similar feeling across a  record.  Generally there is a dominant instrument that the song was written on such as guitar or piano maybe a synth.  Take a filled out productions and mute all the main ingredients and leave the additive colors, only the sprinkles on top. And start rebuilding the production around that. It can take you to an entirely different  universe and provide contrast in the arch of the record",
    "reactions": 21,
    "categories": [
      "songwriting_arrangement",
      "sound_design_synthesis",
      "guitar_production",
      "keys_piano",
      "reference_inspiration"
    ]
  },
  {
    "id": "1362069466770313497",
    "author": "Nomograph Mastering",
    "date": "2025-04-16",
    "content": "It seems to me that 99% of Engineers and Producers have this arc. Initial freedom and playfulness, and then a significant period in the wilderness where “getting it right” or “being professional” takes over while they build their technical skills and experience\n\nSome much smaller percentage emerge from this period back into a playful lightness (while having integrated the skills). I would say less engineers than producers IME\n\nThe thing is that it really doesn’t need to be that way, and it’s probably my #1 motivator in posting here - to keep the focus on what matters. Art and play and the human connection it allows is the goal, and no 15 year old girl cares what mic you used on the hi hat",
    "reactions": 21,
    "categories": [
      "beat_making_drums"
    ]
  },
  {
    "id": "1073423525781704847",
    "author": "oaklandmatt",
    "date": "2023-02-09",
    "content": "The great @Bainz_ linked me with an Antares person to chat. I'm going to get on a call and share our collective set of issues.\n\nAnyone having a specific issue with the newest Autotune, please share it in a SINGLE response to this post, with as much detail as you like. If someone has already responded with an issue that you're dealing with, give it a 👆so I can prioritize a little.  @BatMeckley @Felix Byrne @hyanrarvey @sukhuno @ehutton21 @Tyler Graham @peterlabberton",
    "reactions": 20,
    "categories": [
      "vocal_production"
    ]
  },
  {
    "id": "1159910495701172236",
    "author": "Skyler Young",
    "date": "2023-10-06",
    "content": "And thanks to @Trolligator the favorite button is now where it should be - next to the sound name",
    "reactions": 20,
    "categories": []
  },
  {
    "id": "1196682595795210270",
    "author": "BatMeckley",
    "date": "2024-01-15",
    "content": "Couple things:\n1) no one is actually a perfectionist. It doesn’t exist. I heard a great story of someone telling (I want to say) Richard Marx that he hadn’t released his record yet cause he’s a perfectionist and RM replied “Bullshit. Name one thing you’ve ever done that’s actually perfect. You’re just scared to move on.”  That story has stuck with me.\n\n2) I’m a fairly decent guitar player, have made an actual career of being paid to do it. And I STILL am either constantly hiring people better than I or recording things note by note and then assembled in protools afterwards. Dr Luke might be the best guitarist I’ve ever been around (and I’ve hung with Blake Mills, Tim Pierce, Phil X), and he CONSTANTLY would just hit record, play the four chords of the song free time, and then cut them up and drop them on the ones or wherever they’re supposed to go in the song. My favorite thing about making records vs performing them live is that on record NO ONE CARES how you got there, just that you did. Unless your groove has something particularly magic to offer I’d get over the one take mentality pretty quick.",
    "reactions": 20,
    "categories": [
      "beat_making_drums",
      "guitar_production",
      "music_theory",
      "reference_inspiration"
    ]
  },
  {
    "id": "1095800870224007281",
    "author": "Ross Fortune",
    "date": "2023-04-12",
    "content": "Yo all y’all make room I heard someone needed me to fuck their wife",
    "reactions": 19,
    "categories": []
  },
  {
    "id": "1248393319164416102",
    "author": "Oli J",
    "date": "2024-06-06",
    "content": "Oosh thats a first take live in a room that one! Lemme pull open the session and take a look what we did",
    "reactions": 19,
    "categories": [
      "production_workflow"
    ]
  },
  {
    "id": "1255648003545628682",
    "author": "cian riordan",
    "date": "2024-06-26",
    "content": "I imagine this is a common occurrance for the Sex War General.",
    "reactions": 18,
    "categories": []
  },
  {
    "id": "1378011172728602625",
    "author": "Nomograph Mastering",
    "date": "2025-05-30",
    "content": "Have you tried keeping the doom and despair on separate tracks? Allows more creative control later!\n\n(Sometimes blending a little hopelessness in parallel can really make things pop)",
    "reactions": 18,
    "categories": [
      "creative_techniques"
    ]
  },
  {
    "id": "1076918045261451414",
    "author": "BatMeckley",
    "date": "2023-02-19",
    "content": "I would say it’s not one or the other. Like, I might do some big timing moves first, just to have the vocal 80% of the way there. I’m talking actually nudging things around, not stretching. Then I’ll consolidate and drop into Melodyne. In Melodyne I’ll turn the whole thing and also really pay attention to the timing. At this stage it’s a lot more stretching and/or compressing notes, or more importantly PARTS of words. Like I’ll separate the consonant, and time compress that and bring up the volume so ccchhhhhhhhair becomes CHaaaaiiirrrr. (If that makes any sense). Then back into ProTools. Double check for any weirdness, comp back in the untuned bits you can get away with if you want. Then I’ll do a final cleaning up of group Esses, do my little what I call Swedish time stretching technique, REALLY pocket and polish the vocals. Then I send it off to the label who needed it yesterday but somehow don’t get back to me for 6 months.",
    "reactions": 17,
    "categories": [
      "songwriting_arrangement",
      "vocal_production",
      "creative_techniques"
    ]
  },
  {
    "id": "1077734653559046204",
    "author": "BatMeckley",
    "date": "2023-02-21",
    "content": "With all due respect, I know guys who were the best at some aspect of music making that didn’t really take off til they were in their late 40s. “I’ve been working all year” is not going to get any sympathy in these parts. I’m talking DECADES. Keep at it. If you’re good at it things WILL happen for you, eventually.",
    "reactions": 17,
    "categories": []
  },
  {
    "id": "1266001324827349085",
    "author": "bobby k",
    "date": "2024-07-25",
    "content": "New thing I’ve been doing that I call “producer broth” (open to suggestions on this name). Came from the idea in restaurants when they take all the food scraps and boil them into a broth. When I’m putting together parts on a record and it starts to feel too busy, instead of muting the ones I don’t love I put them in a bus together that’s like -30db and has one of those long atmospheric verbs fully wet on it. Then now I have a big soft drone that can plop behind parts of the record and act as a glue or like a wash on a canvas.",
    "reactions": 17,
    "categories": []
  },
  {
    "id": "1362111650307506257",
    "author": "Rollmottle",
    "date": "2025-04-16",
    "content": "How to simultaneously operate as if there are no stakes, while being in the chair with real stakes at play? Some questions I ask myself:\n\nDo I instinctively know the tools I have? Do I operate whatever tools I choose as if they’re an extension of myself? Do they disappear? There’s never a question of what do we use here, you just know. You weren’t bound by your tools when you didn’t know them, why would you be bound by them knowing them cold? Embrace and commit to what you have. The new plug-in isn’t going to make you better. \n\nAm I operating from fear and scarcity? What will my engineer friends think of my snare? What if I release the song and nobody listens? What if I’m not as good as I think I am? What if I don’t get another client? What if I can’t make rent? These can all creep in to make what was once fun and playful, “work.” But you probably didn’t get into this to do “work.” Success is built over time, not whether you fucked the snare tone that one time. Be OK with failure. Embrace it. Then, ask yourself: do you *really* have anything to lose?\n\nDo you know who you are? You’re not Shawn Everett or Jon Castelli or Serban. You’re you. Stop trying to parse what Castelli would do and start knowing what you’re going to do. Run towards your idiosyncrasies. Embrace them. Become undeniably you because I bet whatever you did years ago was unmistakably you.",
    "reactions": 17,
    "categories": [
      "beat_making_drums",
      "reference_inspiration"
    ]
  },
  {
    "id": "988245806786158632",
    "author": "cian riordan",
    "date": "2022-06-19",
    "content": "I don’t think one should be exclusive of the other!",
    "reactions": 16,
    "categories": []
  },
  {
    "id": "1024512798912421989",
    "author": "cian riordan",
    "date": "2022-09-27",
    "content": "Also real talk, I've almost exclusively been mixing for the past two years and I'm a bit burned on it. I used to have a much more balanced life of recording & mixing and I'm really enjoying getting back into the studio and capturing things again. I find if I do one thing too long, I yearn to do something else in a different environment, with different people.",
    "reactions": 16,
    "categories": []
  },
  {
    "id": "1077740838102253618",
    "author": "BatMeckley",
    "date": "2023-02-21",
    "content": "Well you know, i was the top guy working for the top guy so the top guy called me and I just kept being the top guy.\n\n(Actually, I was doing assistant work for John fields because I’d helped him with a college buddy’s record, and then he taught me about melodyne, so i spent a year or two trying to get good at it, and then his drummer/bff was working for Rob Cavallo who was on their ninth engineer trying to tune the Paris Hilton record and the drummer guy recommended “Fields’s guy” and so I tuned vocals on a laptop in a studio kitchen for a long time, and worked my way up through robs team doing a bunch of work with them until as an exec at Warner bros he trashed the entire rock Paris Hilton record to start over as a pop record and I was in his office where he had his assistant call the top three writers on the billboard hot 100 that week, one of whom was Dr Luke. A month or two later I got a call at like 3am from Luke going “so hey, I hear you’re the guy that can do Paris vocals?” And that’s how. Much abbreviation, but basically.",
    "reactions": 16,
    "categories": [
      "songwriting_arrangement",
      "vocal_production",
      "genre_production"
    ]
  },
  {
    "id": "1077755625678831626",
    "author": "NoahNeedleman",
    "date": "2023-02-21",
    "content": "Assisting a top level mixer for a couple years I learned the most important thing is this:\nHe won’t let something out that doesn’t sound, to his ears, completely professional.  I watched him turn utter turds into songs that sounded important. And he’d do it time and time again. He’d bitch about it, but he’d do it, EVERY TIME. \nThere is a matter of taste of course, but everyone called him The Wolf (Harvey Keitel Pulp Fiction,) because no matter how bad it was, he’d fix it.",
    "reactions": 16,
    "categories": []
  },
  {
    "id": "1095833953635684463",
    "author": "cian riordan",
    "date": "2023-04-12",
    "content": "I just want to say I think we should differentiate between “intentionally imperfect” and “lazy”. Sometimes the imperfection is the heart of the song, and other times it’s someone who didn’t give enough shits to learn the part. Act accordingly.",
    "reactions": 16,
    "categories": []
  },
  {
    "id": "1095869605270016110",
    "author": "cian riordan",
    "date": "2023-04-12",
    "content": "I have it on good word that Albini re-cut all Dave’s drums parts on In Utero. Also changed the lyrics of “Grape Me” to something having nothing to do with wine. All worked out in the end.",
    "reactions": 16,
    "categories": [
      "songwriting_arrangement"
    ]
  },
  {
    "id": "1155246141085073439",
    "author": "Skyler Young",
    "date": "2023-09-23",
    "content": "https://www.dropbox.com/sh/37978jbrpj9lvjf/AACdYeJAN-jt_aPd2rQ8-Zuga?dl=0",
    "reactions": 16,
    "categories": []
  },
  {
    "id": "1376707792471199765",
    "author": "BatMeckley",
    "date": "2025-05-26",
    "content": "Someone in the mix channel had mused about what Serbian’s assistant’s do, and it brings me back to “The people that know how will always work for the people that know why”\n\nDo you know the actual reasons why you feel your work doesn’t measure up yet? Hint: it’s very rarely strictly the sonics and/or mix. That Olivia Rodrigo album sounded objectively terrible, but FELT awesome. And that’s what mattered in the end.  Benny Blanco became successful with a folder full of songs at 120 bpm cause he didn’t know how to change the tempo, and stacks of kick drums because he didn’t know how to eq (he just layers a brighter kick on top if it needs more snap). When I’d ask him why he pretty much did anything it was always “I dunno, man, it just sounds cool!”. Make sure you’re attacking the work with that kind of mindset. \n\nWhen I get lost in the minutiae I try to zoom out and just be like “does this whole track feel good? Am I instinctually bobbing my head?” And if not, why?\n\n95% of the songs that people have sent me here, the issue hasn’t been their space, or their monitoring, or whether they used a 60s or 70s guitar, or if they mixed analog or in the box. The issues almost always tend to be much less narrow in scope. Make sure you zoom out and just go “is this cool?”",
    "reactions": 16,
    "categories": [
      "beat_making_drums",
      "guitar_production",
      "arrangement_orchestration",
      "reference_inspiration"
    ]
  },
  {
    "id": "1004440981455765594",
    "author": "ehutton21",
    "date": "2022-08-03",
    "content": "Can we get a melodyne course the next time you get on the show??? Would be epic",
    "reactions": 15,
    "categories": [
      "songwriting_arrangement",
      "vocal_production"
    ]
  },
  {
    "id": "1051266028623106058",
    "author": "BatMeckley",
    "date": "2022-12-10",
    "content": "This might win for most ridiculous comment on this discord so far.",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1061736780845551616",
    "author": "oaklandmatt",
    "date": "2023-01-08",
    "content": "Oliver power tools and kshmr are the most useful and most modern packs. Not sure what kind of music you're making but for my workflow I like doing whatever I feel on a production and then having quick \"modern\" drum sounds I can reach for that immediately can put things into the present.\n\nI'm doing a production right now for a UK artist where they gave me a throwback sounding demo, but I know the artist is a young 2023 female pop star. So I did a bunch of organic shit (acoustic through my 67, some live claps, shit like that), then I threw some kshmr and oliver loops in to just see what the hybrid of classic and modern sounds like. Production is basically done now",
    "reactions": 15,
    "categories": [
      "keys_piano",
      "genre_production",
      "production_workflow",
      "reference_inspiration"
    ]
  },
  {
    "id": "1103454133257785384",
    "author": "BatMeckley",
    "date": "2023-05-03",
    "content": "I worked with a band at the very beginning that was a three piece with VERY specific rules. \n\n1) all songs had to be under 2:45\n2) guitars and vocals could be doubled for tone, but not parts.\n3) bassist sang lead, if there was a harmony the guitarist (not a gifted singer) had to sing it, if there was a third part the drummer had to sing it (couldn’t sing at all)\n4) record couldn’t take more than a week to record/mix \n\nIt was the project that convinced Luke I could be a producer; his fav record id done up to that point.\n\nThere’s a real value to putting strict limitations on your art, it often brings the most clarity and creativity. Side note: they were terrible technical musicians but just fucking AWESOME.",
    "reactions": 15,
    "categories": [
      "vocal_production",
      "guitar_production",
      "production_workflow",
      "music_theory"
    ]
  },
  {
    "id": "1203215559395774565",
    "author": "BatMeckley",
    "date": "2024-02-02",
    "content": "If you find yourself constantly collaborating with others you’ll probably notice that you start to lean towards stock plugins or the most ubiquitous 3rd party plugs (fab filter, sound toys, Valhalla). There’s only so many times you can go through the “wait I do t have that plug in” dance before you say fuck it and just make do with what you know everyone’s got.",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1257085785388224532",
    "author": "chrissorem",
    "date": "2024-06-30",
    "content": "This is the first prototype we brought jack joseph puig in for design consultation",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1282793496272699564",
    "author": "cian riordan",
    "date": "2024-09-09",
    "content": "Love this. Often when I'm recording drums I'll track the drummer at a higher BPM then varispeed everything down to tempo... great way to get deep low end.",
    "reactions": 15,
    "categories": [
      "bass_production"
    ]
  },
  {
    "id": "1359627446923821197",
    "author": "Josh Bowman",
    "date": "2025-04-09",
    "content": "This just unlocked something in me-\n\nWhen I read the word \"love\" in the context of taking about music and on the discord, i am thinking of it more like \"to like, or enjoy\" etc... maybe the way someone who hasn't experience really true love in the context of a long term relationship (romantic OR platonic) might think of love. I love some of my friends, sometimes some of them do things that might cause me to dislike them for a time or a moment, but I still love them. I cant express how profound this connect is. I love the work, but i dont always like it. Love takes real effort to cultivate and maintain. My brain just exploded a bit.",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1408571360732643469",
    "author": "Adam Thein",
    "date": "2025-08-22",
    "content": "I was hoping it was like \"I swear to god if you do any chops here\"",
    "reactions": 15,
    "categories": []
  },
  {
    "id": "1014998137871532216",
    "author": "Eric Martin",
    "date": "2022-09-01",
    "content": "I did a thing, let’s hope it’s fun",
    "reactions": 14,
    "categories": []
  },
  {
    "id": "1077733423722008646",
    "author": "BatMeckley",
    "date": "2023-02-21",
    "content": "And I wish I could change my number so Cians mom would stop calling me in the middle of the night, but we play the hand we’re dealt. Don’t wait for the opportunity, make the opportunity.",
    "reactions": 14,
    "categories": []
  },
  {
    "id": "1078124245755900015",
    "author": "cian riordan",
    "date": "2023-02-22",
    "content": "After I witnessed Eric V go deep down the rabbit hole of converter tests, clock tests, sample rate tests, etc… we all came to our own conclusions. But despite some controversial outcomes from some out testing, he stood by the premise that if a piece of gear, software, or technique helps you get out of your head and do your best work, it’s worth whatever their charging. Not having “x y or z” might not make any actual difference, but if it’s impeding you psychologically… then it’s worth addressing.",
    "reactions": 14,
    "categories": [
      "sampling_libraries"
    ]
  },
  {
    "id": "1084557378634125454",
    "author": "Slow Hand",
    "date": "2023-03-12",
    "content": "I learned quickly that in musical collaboration there's often little sense in *talking* about whether an idea will work. *Just do it* and then listen to the difference. It will probably be very obvious which one feels better.",
    "reactions": 14,
    "categories": [
      "reference_inspiration"
    ]
  },
  {
    "id": "1168891230969659432",
    "author": "NoahNeedleman",
    "date": "2023-10-31",
    "content": "This is an important question, with some boring answers usually. \n\n1) make sure you can trust your monitoring. Having to double check your sounds all day is a huge time/vibe suck. \n2) if you’re recording real instruments, optimize your studio space for simplicity. Occam’s Razor. Have chains setup and ready to go for easy grab & go recording. \n3) you don’t need as many elements in the recording if each sound/performance is excellent on its own. \n4) Chase the joy. Some elements are nuts & bolts, but if you find the joy in each part you’re working on, that shines through performances. \n5) remember that not everything needs to be done in a day. Sometimes things take longer and that’s ok.",
    "reactions": 14,
    "categories": [
      "vocal_production"
    ]
  },
  {
    "id": "1185105254677757982",
    "author": "cian riordan",
    "date": "2023-12-14",
    "content": "Enjoying this chat fellas.",
    "reactions": 14,
    "categories": []
  },
  {
    "id": "1189652778113568850",
    "author": "Slow Hand",
    "date": "2023-12-27",
    "content": "Cian's advice is good. It's hard to know where to start, so I'll just share three \"a-ha!\" moments that I've had over the years where the reverb sound that I had been chasing was unlocked. Some of these may already be obvious to you:\n\n1. **Pre-Delay Time:** The longer your pre-delay time is the farther away the \"back wall\" of your mix will sound. 120ms pre-delays (which are huge) will give you that Bruce Swedien depth. The longer your pre-delay the less wet the verb will need to be. \n\nA short pre-delay time will \"glue\" the verb to your dry signal, while pre-delays longer than 50ms will \"detach\" from the dry sound and give you a greater sense of depth *and* clarity.\n\nExperiment with pre-delay times of 20 ms, 50ms, 80ms, and 120ms and see what happens. As you try these settings re-balance your verb with the dry/wet knob and see how that changes the feelings of depth, rhythm, and clarity in your mixes.\n\n2. **Panning/Width/Band-Limiting:** Most verbs default to full-width. Recognize that most verbs don't need to be this massive and practice narrowing your tails. The more that you narrow a reverb towards the center the more it will feel like it's extending into infinity towards the vanishing point of your mix.\n\nAdditionally, don't be afraid to focus your verb by rolling off the high-end and the low-end. Verbs contribute to a lot of clutter in a mix.\n\n3. **Slap Echo:** This was a big one for me. The reverb sound that I was hearing on so many of my favorite records (Bowie, Prince, etc) was really just a single band-limited echo blended to taste. Slap echoes tend to live in the 50ms - 100ms delay range. Sometimes that's all that's needed for the feeling of ambience I'm seeking and it takes up *way* less space in a mix.\n\nOnce you master that you can start blending your slap echo with your reverb tails and the combination will give you a very expansive sound with minimal fuss.",
    "reactions": 14,
    "categories": [
      "creative_techniques"
    ]
  },
  {
    "id": "1313997644313526294",
    "author": "cian riordan",
    "date": "2024-12-04",
    "content": "Biggest takeaways were how great drums sound when you play them softly and light up the microphones.",
    "reactions": 14,
    "categories": []
  },
  {
    "id": "1324439663867461652",
    "author": "popaganda.",
    "date": "2025-01-02",
    "content": "No matter what I’d be trying to build off a live performance. Vocals and guitar at the same time if possible, make sure the artist is comfortable enough to really deliver the way they did on their videos. Sometimes when artists get in the studio they get way in their heads, and then the process of doing takes and dressing up a track piece by piece can really cloud up the original energy that the fans connected with. So no matter how you eventually dress it up, the core has to be as dynamic and connective as possible.",
    "reactions": 14,
    "categories": [
      "vocal_production",
      "guitar_production",
      "reference_inspiration"
    ]
  },
  {
    "id": "1383934468640866374",
    "author": "Nomograph Mastering",
    "date": "2025-06-15",
    "content": "What we are we even doing?",
    "reactions": 14,
    "categories": []
  },
  {
    "id": "954057387021594664",
    "author": "oaklandmatt",
    "date": "2022-03-17",
    "content": "omg i need to go on twitch and show this. \n\ni want to spend hours (maybe my whole life?) talking about groove.\n\nlet me try and make some time for this",
    "reactions": 13,
    "categories": [
      "beat_making_drums"
    ]
  },
  {
    "id": "1018624894713462804",
    "author": "peterlabberton",
    "date": "2022-09-11",
    "content": "Also I’ll say something that feels very redundant in this community but is so true: if you have your monitoring sorted out, these sub decisions become way more intuitive and effortless. If you’re just hearing a smeared mess in the low end, it’s understandably a mystery. But if you can get in a room where there is more clarity, it’s a whole lot easier.",
    "reactions": 13,
    "categories": [
      "bass_production"
    ]
  },
  {
    "id": "1059568643878428843",
    "author": "NoahNeedleman",
    "date": "2023-01-02",
    "content": "@BatMeckley is the resident Grammy Loser on this topic, but I’ve made a decent living doing some indie and major label stuff as a vocal producer. \n\nDeliverables really depend on the producer you’re working with. In my experience it’s 50/50 whether they want tuned or raw, comped or all the takes- etc. \n\nThe key things that keep me getting called are, in no particular order:\n\nCommunication. Everybody knows what to expect and what is to be expected. \n\nProfessionalism. The room is clean, mics are up, lighting is right, session is loaded. \n\nIntuition. All the artistic/personal things. Making the artist feel safe enough to be dangerous, knowing how hard you can push them to get a take, knowing where the line is between their vision and yours, etc…\n\nSonics. I want my artists to feel expensive when they’re recording, so getting the mic and cue mix right is everything. \n\nSpeed. A comp up by the time they’re done tracking, a quick shine to make it feel special, and a bounce for them to take with them.\n\nEverything else is on a per session basis. I can deliver a fully mixed/tuned vocal and everything in between, so it all depends on communication ahead of time.",
    "reactions": 13,
    "categories": [
      "vocal_production",
      "genre_production",
      "production_workflow",
      "music_theory",
      "reference_inspiration"
    ]
  },
  {
    "id": "1069461610126659605",
    "author": "oaklandmatt",
    "date": "2023-01-29",
    "content": "https://m.youtube.com/watch?v=FHUgKZlwMhE\n\nCheck out what the dude with the #1 song in the world says about it (tldr: prep some ideas, don't worry if you're scared to not do it well enough because we all feel that way much of the time, go make some music you're gonna do great)",
    "reactions": 13,
    "categories": [
      "reference_inspiration"
    ]
  },
  {
    "id": "1077743321851633754",
    "author": "LAPhill",
    "date": "2023-02-21",
    "content": "@BatMeckley and I chatted about this recently - if you ask 100 top-tier professionals how they got there, you'll get 100 different answers. You just can't see the roadmap ahead of time. But he got really good at a thing, and people started to notice, and he kept being REALLY good at that thing, which kept opening doors. @Nomograph Mastering is very vocal about how his unconventional path eventually coalesced into all the mastering work he's doing now.\n\nI sympathize with wanting to know how people got where they're at, but I think a lot of it boils down to being really fucking good, being easy to work with, and making a lot of connections. And I mean all sorts of connections - the person who calls you with a life-changing opportunity might be someone you shared a cigarette with outside a bar at 2am a year ago.",
    "reactions": 13,
    "categories": [
      "vocal_production"
    ]
  },
  {
    "id": "1093029134034284645",
    "author": "Nomograph Mastering",
    "date": "2023-04-04",
    "content": "Paris Hilton walked straight into me while texting on her phone at a party once. That’s all I got",
    "reactions": 13,
    "categories": []
  },
  {
    "id": "1093033210088271902",
    "author": "BatMeckley",
    "date": "2023-04-04",
    "content": "Things that I didn’t work on that blow my mind vocally: When the Circus Comes by Los Lobos. A lot of the 1975 stuff is really really well put together vocally. It’s Not Living if its Not With You is full of incredible vocal tricks. Worth repeated listenings. Youngblood by 5SOS is a modern song really well put together. Think Andrew Watt handled the vocals on that and did a fantastic job getting the take out of Luke. Dance Hall Days by Wang Chung is always a good reference. Mercy Street by Peter Gabriel (the whole SO record) pretty unfuckwithable. Bang Bang is always a great reference because you can really show a singer the difference between a Jessie J and an Arianna. Comes in handy in sessions a lot.\n\nIf you’re looking for creative, the whole Dissociatives record is a constant reference. I’d start with “Horror With Eyeballs”",
    "reactions": 13,
    "categories": [
      "vocal_production",
      "production_workflow",
      "creative_techniques",
      "reference_inspiration"
    ]
  },
  {
    "id": "1094318611922964520",
    "author": "popaganda.",
    "date": "2023-04-08",
    "content": "I’ve been deep-diving on Daniel Johns this last week and really been thinking about the toll that being creative can take on people. It came up yesterday in the VC too. In some ways our culture likes to reward artists being martyrs, but it’s never something to strive for. I think as producers one of the biggest parts of our job is to be a grounding presence and a support for artists who can sometimes have pretty wild swings. But we’re artists too in our own right with our own bipolar tendencies. In a way that can create an empathy bond between us…we can understand the manic exuberance of making an amazing thing and how there’s usually a pendulum swing in the other direction to compensate. But I kind of think our job as producers is to have our shit together enough to buffer that bipolar thing and make a sanctuary where an artist can feel at home. Just my random thought for the day.",
    "reactions": 13,
    "categories": [
      "beat_making_drums",
      "creative_techniques",
      "reference_inspiration"
    ]
  },
  {
    "id": "1120088518425841784",
    "author": "Slow Hand",
    "date": "2023-06-18",
    "content": "I had a similar moment when I moved to Los Angeles. I wrote Michael Beinhorn a really nice letter after I was inspired by his book, with the offer to be his assistant. The timing didn't work out because he had a newborn and was leaving LA, but I *did* get to sit down with him for drinks a few times. \n\nThe big moment for me in those discussions was realizing that I was never going to be a great pop music producer *in addition* to everything else that I wanted to do. There are people out there who are 100% bought-in to that idiom and are going to absolutely smoke me because they *love* it. My takeaway was that in order to excel you have to lean into the things only you can do because no one else cares about them as much as you do and no one else is prepared to put in the same effort to see it realized.",
    "reactions": 13,
    "categories": [
      "genre_production"
    ]
  },
  {
    "id": "1181635837021126717",
    "author": "Nomograph Mastering",
    "date": "2023-12-05",
    "content": "Let’s not make Nomo a thing, I prefer the letter R followed by a random selection of vowels and consonants",
    "reactions": 13,
    "categories": []
  },
  {
    "id": "1211787465568944188",
    "author": "cian riordan",
    "date": "2024-02-26",
    "content": "We should have a #hall-of-shame section where we can out these mopes.",
    "reactions": 13,
    "categories": [
      "arrangement_orchestration"
    ]
  },
  {
    "id": "1212099180697227404",
    "author": "Will Melones",
    "date": "2024-02-27",
    "content": "Oh no, don’t tell me they hired Master Bateman",
    "reactions": 13,
    "categories": []
  },
  {
    "id": "1256331669477003304",
    "author": "BatMeckley",
    "date": "2024-06-28",
    "content": "Nice of my tech to lend me this guitar and show me how to amp and mic it up properly to get the sound I’m looking for. Made me coffee too (I can currently see music and hear colors). Played me a bunch of stuff that made me want to light everything I’m working on on fire and start fresh and be better. If this is gatekeeping I hope he keeps all the gates. \n\n(Had nice things to say about a certain Matt Rad as well, go figure, no one’s perfect)",
    "reactions": 13,
    "categories": [
      "guitar_production"
    ]
  },
  {
    "id": "1256446284416548905",
    "author": "BatMeckley",
    "date": "2024-06-28",
    "content": "Quick reminder a click track doesn’t have to be a click track. Putting down a drum loop solved a singers timing issue today.",
    "reactions": 13,
    "categories": [
      "sampling_libraries"
    ]
  },
  {
    "id": "1258185370655264879",
    "author": "Nomograph Mastering",
    "date": "2024-07-03",
    "content": "Pre-empting @BatMeckley’s question “any tips for those of us who don’t need to edit?”",
    "reactions": 13,
    "categories": []
  },
  {
    "id": "1281690105634881630",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-06",
    "content": "Obvious for pretty much all of you I believe, but I spent so many hours over the last few years trying to make Guitar VST:s work for realism (for time/travel purposes), and it’s always a pain. Tracked real yesterday for first time in a while and even when it sounds bad, it sounds good. I want my guitar VST hours back 🥲",
    "reactions": 13,
    "categories": [
      "midi_virtual_instruments",
      "guitar_production"
    ]
  },
  {
    "id": "1291508932522803251",
    "author": "cian riordan",
    "date": "2024-10-03",
    "content": "That man knows how to POST",
    "reactions": 13,
    "categories": []
  },
  {
    "id": "1376682277085380678",
    "author": "NoahNeedleman",
    "date": "2025-05-26",
    "content": "Really well framed and important questions here. \n\nI’ve heard your music, and so first let me say that you’re on the path. This is the work. This is the practice. Just like yoga or meditation or basketball. \n\nSecond, let me say, again, there’s no secret knowledge. There’s only showing up, paying attention, and doing the work consistently. \n\nConsistency is the only actual key to success. \n\nSo when you look at your finished projects you can’t think about them as failures, only as rungs on the latter you’re climbing. And the only way to see what’s what is to KEEP CLIMBING.",
    "reactions": 13,
    "categories": [
      "production_workflow",
      "music_theory"
    ]
  },
  {
    "id": "1384326001215148043",
    "author": "Skyler Young",
    "date": "2025-06-16",
    "content": "In addition to hiring great people, his tendency to have minimal elements in a production allows for a ton of clarity and space in mixes\n\nUsed to work for him at shangri-la can confirm he’s not technical at all",
    "reactions": 13,
    "categories": []
  },
  {
    "id": "937550457465880597",
    "author": "oaklandmatt",
    "date": "2022-01-30",
    "content": "@everyone added a production channel. mostly because \"gear\" seemed a weird place to ask what people are using for piano these days. \n\nbut also seems good since we have \"songwriting\" \"recording\" and \"mixing\" channels already \n\ni'm sick of Alicia's Keys. i want some all purpose grand that sounds natural and has not too much built in eq and shit.\n\nwhat y'all using?",
    "reactions": 12,
    "categories": [
      "songwriting_arrangement",
      "keys_piano"
    ]
  },
  {
    "id": "1051614997966508062",
    "author": "Slow Hand",
    "date": "2022-12-11",
    "content": "Restraint? Not today!",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1062085186193457243",
    "author": "cian riordan",
    "date": "2023-01-09",
    "content": "Ruairi and I need to get 'Micks With The Masters' on ours. (Credit to him for the quip)",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1072642928872259665",
    "author": "spectrummasters",
    "date": "2023-02-07",
    "content": "Happy Accident : I accidentally Monod a sample i was using in the verse, but not in the Chorus......once i realised , i left it. Sounds great the way the chorus opens up....give it a whirl",
    "reactions": 12,
    "categories": [
      "songwriting_arrangement",
      "sampling_libraries"
    ]
  },
  {
    "id": "1090273913826713680",
    "author": "esquinalee",
    "date": "2023-03-28",
    "content": "Percussion is the sauce! I don’t think people have enough respect for how live perc brings life to the groove.\nAlthough I will say that every time someone picks up a tambourine, Uncle Ben’s “With great power comes great responsibility” should be better understood 😅 the wrong person can and has killed the groove",
    "reactions": 12,
    "categories": [
      "beat_making_drums"
    ]
  },
  {
    "id": "1090667184239415439",
    "author": "BatMeckley",
    "date": "2023-03-29",
    "content": "It seems there was a growing trend of people using the mom joke as an incentive to post more inappropriate content.\n\nIt felt a bit hypocritical to try and moderate the content I (we?) was trying to keep a lid on, so those paying attention might’ve noticed a steep decline in that kind of rhetoric over the last few weeks.\n\nThis place works best when it’s welcoming to all.",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1095818099355299840",
    "author": "Nomograph Mastering",
    "date": "2023-04-12",
    "content": "Holy shit, missed all this but I am arbiting the fuck out of a record over here and being paid American dollars for the work",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1155205427240378408",
    "author": "oaklandmatt",
    "date": "2023-09-23",
    "content": "The only common denominator to all the greats is taste and the ability to get to the finish line.",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1158152834894790686",
    "author": "chrissorem",
    "date": "2023-10-01",
    "content": "What sort of compression do you use for a tympanini?",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1191808027175702628",
    "author": "Slow Hand",
    "date": "2024-01-02",
    "content": "Following up on this to say that @NoahNeedleman (mensch that he is) sent me a recording of a cello through a piezo pickup and this is 100% the sound. It's all right there. Along with the Little Alter Boy that's it, folks. That's the sound. Case closed.",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1203549749613957160",
    "author": "oaklandmatt",
    "date": "2024-02-03",
    "content": "Most things that have been said, I agree with. But I think they are secondary to a much more fundamental thing. The producer is the one who gets it done to the highest standard. \n\nThis is what people get wrong about Rick Rubin. While he talks a lot about listening and \"ways of being,\" that's not what makes a great producer. That's his personal application. What people miss is when he says \"we work on the project until everyone involved thinks it's as good as it can possibly be. If we don't all think that *it's not finished*.\"\n\nPhil Spector's version was \"it's finished when *I* think it's as good as it can possibly be.\" But it's the same fundamental thing: across the finish line with highest possible quality.\n\nTaste but with a relentless will to execute at the highest level.",
    "reactions": 12,
    "categories": [
      "production_workflow",
      "reference_inspiration"
    ]
  },
  {
    "id": "1211803070422589450",
    "author": "Slow Hand",
    "date": "2024-02-26",
    "content": "I once had to do three revisions with a ME to keep their masters from distorting in unwanted places. *Then* we found out that their hardware routing was also flipping the L/R imaging because their cabling was patched wrong. That was an artist-recommended ME. Needless to say, we did not go with them again.",
    "reactions": 12,
    "categories": [
      "creative_techniques",
      "reference_inspiration"
    ]
  },
  {
    "id": "1216791665486991481",
    "author": "popaganda.",
    "date": "2024-03-11",
    "content": "An artist should never look for a “better” fanbase while leaving behind their diehards. Go ahead and piss your fans off with some challenging stylistic twist etc, but don’t suddenly start making music for a completely different audience at the expense of your current audience.",
    "reactions": 12,
    "categories": [
      "reference_inspiration"
    ]
  },
  {
    "id": "1255604619611082822",
    "author": "BatMeckley",
    "date": "2024-06-26",
    "content": "I remember being at Conway one day and the brand new receptionist greeted Max Martin, not knowing he was…\n\n“Welcome to Conway, it’s so nice to meet you. What’s your name?”\n\n*Hi!, I’m Max*\n\n“Hi max! Are you a writer or producer something like that?”\n\n*Yeah, I guess…*\n\n“That’s so neat! Is there anywhere I can hear your stuff?”\n\n*The iTunes top 10?*\n(6 of the songs at the time were him)\n\nIf only that guy had had a one sheet…",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1300899367481507873",
    "author": "cian riordan",
    "date": "2024-10-29",
    "content": "Aside from the usual discussion about headphone preferences and HRTF, I’ll give you my experience with them.\n\nI bought them a few years ago with the intention of just having a baller set of headphones for a bunch of travel I had coming up. I had tried them once at @oaklandmatt’s place and wasn’t super impressed... just thought they sounded like hyped headphones. But I really wanted something with killer noise cancellation and something to potentially reference Spatial mixes. After purchasing, the more I used them, the more I fell in love with listening to music on them. I realized quite early on that there was a lot of parity between how things sounded in the APMaxes vs. my PMC 6-2s… similar low end presentation, similar high end. But just genuinely enjoyed listening to music on them.\n\nI was traveling for thanksgiving last year and a last minute mix opportunity came up for some video game trailer. Not my normal speed but they were up shits creek with a deadline and the money was good… so I mixed the whole thing start to finish on my laptop with the Airpods. I was a little sheepish about sending off un-vetted mixes, but the clients loved it and I saved the day. I curiously took a listen when I got back to my studio after the holiday and was very surprised that the mix was 98% there. There was maybe a small low end tweak I could’ve made, but by and large, the mixes translated incredibly well. \n\nNow I use them much more for odd tasks, usually revisions and printing sessions. I can be on my couch on my laptop running files down with transparency mode on, still hanging with my family while watching a show, and lock in with noise cancelling when I need to focus.\n\nFor $600 they’ve been a massive value-add to my work flow.",
    "reactions": 12,
    "categories": [
      "bass_production",
      "production_workflow",
      "reference_inspiration"
    ]
  },
  {
    "id": "1302005790449602580",
    "author": "NoahNeedleman",
    "date": "2024-11-01",
    "content": "Def wasn’t trying to be condescending here. But explanations via text often aren’t as helpful as video examples. There’s a lot of bad info out there on complex topics, but editing, luckily, is not one of them!",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1407507322854441060",
    "author": "Slow Hand",
    "date": "2025-08-19",
    "content": "Yup! I'll often throw an instance of EchoBoy Jr. before my reverbs at 100% wet and 0% feedback. Then I can do all of the following:\n\n1. Tempo-sync my reverb pre-delay.\n2. Use the tone profiles to color the signal going into the verb.\n3. Apply a ping pong pan to the pre-delay.\n4. Apply saturation to the signal going into the verb.",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1416164506970751057",
    "author": "Zakhiggins",
    "date": "2025-09-12",
    "content": "I call this one the Hailey Bieber slide",
    "reactions": 12,
    "categories": []
  },
  {
    "id": "1014614000069247096",
    "author": "Will Melones",
    "date": "2022-08-31",
    "content": "I can just imagine this scenario. A producer sequences all the drum parts, they do the demos, write the song and whatever. Then they book a session and Matt Chamberlain shows up with a pristine Drum-Doctor tuned kit and an invoice for cartage. “Ok, we want you to play exactly what’s on the track, we like that.” He’s a pro, so of course he does. They quantize the performance, finish the song, and send the track off to @cian riordan  who DRTs the drums and replaces them all with Steven Slate one-shots and buries the cymbals.",
    "reactions": 11,
    "categories": [
      "sampling_libraries",
      "beat_making_drums",
      "production_workflow",
      "reference_inspiration"
    ]
  },
  {
    "id": "1017130871964315668",
    "author": "BatMeckley",
    "date": "2022-09-07",
    "content": "I mostly fuck with retune speed; adjusting it slows down how hard the tune snaps to the note and it can basically reduce the “severity” of the effect. Classic mode is because when they went from 5 to 7 we all threw a fit because they fucked heavily with the “sound” of the plug in. In an effort to increase transparency they actually messed with the high end artifacts we actually dug, and were using the plugin for (on a lot of the Luke records I worked on we were using melodyne for tune and AutoTune for tone). I clearly remember sitting on the phone with Antares brass for HOURS while they tried to convince us the new version was “better” and me having to explain to them that it wasn’t and we were now traveling with rigs that had the old version because the new version just didn’t have the sound we needed. They compromised by introducing “classic” mode which was their attempt to get the sound of v5 back.",
    "reactions": 11,
    "categories": [
      "songwriting_arrangement",
      "vocal_production",
      "arrangement_orchestration",
      "creative_techniques"
    ]
  },
  {
    "id": "1053044025441140746",
    "author": "Slow Hand",
    "date": "2022-12-15",
    "content": "For anyone who's seen *Everything Everywhere All at Once*, A24 and Son Lux just released all of the stems for the 'Opera Fight' cue.\n\nI don't know why they're doing this, but when I see stems for my favorite movie of 2022 by one of the most sonically interesting bands today I don't ask questions.\n\nhttp://eeaaooperafight.com/",
    "reactions": 11,
    "categories": []
  },
  {
    "id": "1064285174898110577",
    "author": "BatMeckley",
    "date": "2023-01-15",
    "content": "I’d genuinely argue that records without any limitations in time and or budget and or ability are rarely magic.",
    "reactions": 11,
    "categories": []
  },
  {
    "id": "1070262043233505371",
    "author": "Nomograph Mastering",
    "date": "2023-02-01",
    "content": "Make a template that has German polka music on a stereo channel. 1) Blank page fear is eliminated 2) If you can’t beat Polka music you should probably quit",
    "reactions": 11,
    "categories": [
      "beat_making_drums",
      "production_workflow"
    ]
  },
  {
    "id": "1070835288848466084",
    "author": "GaspardMurph",
    "date": "2023-02-02",
    "content": "Oh biggest production hack to avoid feeling stuck or having writers block: never be alone in the studio, I almost always get someone in that gives purpose to the moment and the creation",
    "reactions": 11,
    "categories": []
  },
  {
    "id": "1103456613504917635",
    "author": "LAPhill",
    "date": "2023-05-03",
    "content": "Just wrapped on a score and my self-imposed rule was \"no orchestra.\" Because we weren't going to have the budget for a live one and I'm 100% in the camp of making your limitations sound like intentional choices. \n\nThere were so many times I wanted to reach for the orchestral samples to sell an emotional moment, or fill out a part. Not letting myself do that forced me to come up with other solutions, and the results are so much more interesting than some Spitfire samples in the background.",
    "reactions": 11,
    "categories": [
      "sampling_libraries",
      "arrangement_orchestration"
    ]
  },
  {
    "id": "1137097720885157918",
    "author": "chrissorem",
    "date": "2023-08-04",
    "content": "Here’s  a mix I’m working on currently. It starts with mangled drums and the hat and ride mics creepy in and eventually the whole kit comes in",
    "reactions": 11,
    "categories": [
      "creative_techniques"
    ]
  },
  {
    "id": "1139358981605826591",
    "author": "LAPhill",
    "date": "2023-08-10",
    "content": "You probably should've been thinking about your wife, but I'm honored. 😉",
    "reactions": 11,
    "categories": []
  },
  {
    "id": "1150638119146758245",
    "author": "Nomograph Mastering",
    "date": "2023-09-10",
    "content": "I think our job is to love the record we have to work on, not master the imaginary record they describe over coffee",
    "reactions": 11,
    "categories": []
  },
  {
    "id": "1183957921697103913",
    "author": "BatMeckley",
    "date": "2023-12-11",
    "content": "Id take this a step further… bring out the beauty in the subject. Songs that artists do with Noah tend to be better than the songs they did with someone else because not only is he working with talented people, but they’re more talented because they’re working with him. Matt Rad is good at this too. Cian just makes them feel taller. \n\nBring value.",
    "reactions": 11,
    "categories": [
      "reference_inspiration"
    ]
  }
]