[
  {
    "id": "1089961055754653766",
    "author": "LAPhill",
    "date": "2023-03-27",
    "content": "Man... I've just started the recording process on a score I'm wrapping up next month. Got the first batch of tracks in, which were vibraphone parts. Very much a texture and not a featured instrument most of the time, and it's just incredible how even those background parts elevate the music beyond the samples that were in there. Getting goosebumps over here, a reminder that injecting humanity into our music is so important.",
    "reactions": 22,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376707792471199765",
    "author": "BatMeckley",
    "date": "2025-05-26",
    "content": "Someone in the mix channel had mused about what Serbian’s assistant’s do, and it brings me back to “The people that know how will always work for the people that know why”\n\nDo you know the actual reasons why you feel your work doesn’t measure up yet? Hint: it’s very rarely strictly the sonics and/or mix. That Olivia Rodrigo album sounded objectively terrible, but FELT awesome. And that’s what mattered in the end.  Benny Blanco became successful with a folder full of songs at 120 bpm cause he didn’t know how to change the tempo, and stacks of kick drums because he didn’t know how to eq (he just layers a brighter kick on top if it needs more snap). When I’d ask him why he pretty much did anything it was always “I dunno, man, it just sounds cool!”. Make sure you’re attacking the work with that kind of mindset. \n\nWhen I get lost in the minutiae I try to zoom out and just be like “does this whole track feel good? Am I instinctually bobbing my head?” And if not, why?\n\n95% of the songs that people have sent me here, the issue hasn’t been their space, or their monitoring, or whether they used a 60s or 70s guitar, or if they mixed analog or in the box. The issues almost always tend to be much less narrow in scope. Make sure you zoom out and just go “is this cool?”",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211787465568944188",
    "author": "cian riordan",
    "date": "2024-02-26",
    "content": "We should have a #hall-of-shame section where we can out these mopes.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017130871964315668",
    "author": "BatMeckley",
    "date": "2022-09-07",
    "content": "I mostly fuck with retune speed; adjusting it slows down how hard the tune snaps to the note and it can basically reduce the “severity” of the effect. Classic mode is because when they went from 5 to 7 we all threw a fit because they fucked heavily with the “sound” of the plug in. In an effort to increase transparency they actually messed with the high end artifacts we actually dug, and were using the plugin for (on a lot of the Luke records I worked on we were using melodyne for tune and AutoTune for tone). I clearly remember sitting on the phone with Antares brass for HOURS while they tried to convince us the new version was “better” and me having to explain to them that it wasn’t and we were now traveling with rigs that had the old version because the new version just didn’t have the sound we needed. They compromised by introducing “classic” mode which was their attempt to get the sound of v5 back.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103456613504917635",
    "author": "LAPhill",
    "date": "2023-05-03",
    "content": "Just wrapped on a score and my self-imposed rule was \"no orchestra.\" Because we weren't going to have the budget for a live one and I'm 100% in the camp of making your limitations sound like intentional choices. \n\nThere were so many times I wanted to reach for the orchestral samples to sell an emotional moment, or fill out a part. Not letting myself do that forced me to come up with other solutions, and the results are so much more interesting than some Spitfire samples in the background.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310998613047902288",
    "author": "Rollmottle",
    "date": "2024-11-26",
    "content": "adding stuff is always effective but i like trying to pare back the arrangement to see if i can get away with something. dropping the kick, the bass or snare for a bar, 1/2 a bar, or one beat can sometimes create the transition without adding anything.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196625414848786532",
    "author": "peterlabberton",
    "date": "2024-01-15",
    "content": "And on the flip side: I once stayed up until 2 am while working on a record I was producing and put together a killer guitar part that I was somehow able to nail (with some significant editing). I listen in the morning and think to myself, \"bite me, Blake Mills, I've got your fuckin' number asshole!\" Artist comes in, I play the song back... \"it's cool but it's not the vibe.\" And that was that—I think we put a Solina pad in there instead that took 3 minutes to do and we moved on.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310913603238363237",
    "author": "cy (sigh)",
    "date": "2024-11-26",
    "content": "I almost always use busy ambiences. like rainforests, a large transit station, large group convo (might accelerate x10 to get the right pitch and texture), crashing waves or just ocean sounds, crown applause. got some favorite textured impacts too but mostly use \"natural\" ambiences depending on the song.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051603332747243531",
    "author": "Slow Hand",
    "date": "2022-12-11",
    "content": "Ok. One last example (since I've already gone this far). Miles Davis. \n\nMiles had the technical chops. He had fathomless musical depth. He could write every single note of a big band chart if he wanted to, but he (with a few early exceptions) never did this.\n\nHis recipe for music making was this: \n\nA) Start with a great song (chords and melody)\nB) Curate a team of players with their own strong musical identities \nC) Bring them together and let them interpret the song\nD) Direct them on feel and how to listen to and respond to each other\n\nThat's it. Miles' music was never about big arranging moments, or written-out parts. He started with great raw material, great players, and great prompting and then he let them roam free and play.\n\nSo that's one more way to approach it. \n\nThere are two things that I keep coming back to in all of this: A great song and a vision. If you have those you can set your players free to surprise and astound you.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135910262516486174",
    "author": "tomtom",
    "date": "2023-08-01",
    "content": "Beatles playbook..acoustic guitars provide the clangy shit. I wish more people thought about their arrangements this way.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174759694271787118",
    "author": "LAPhill",
    "date": "2023-11-16",
    "content": "By far, the most important element in realistic orchestral sound is in the programming. You need a controller where you can automate cc1 and cc11 (modulation and expression). Instruments, especially strings, are constantly changing their volumes. Particularly on entrances and phrase-ends. If you don't have a controller for this, you can draw it all in, but that gets really tedious.\n\nIf you get that figured out, I can almost guarantee that just about any library out there will get you good results. So then it's just a matter of what sound do you gravitate towards, how elaborate of a feature set do you need, etc. Legatos are overrated and I'd take no legato over a poorly programmed one any day.\n\nIf you want a full orchestra, not just strings, I'd check out some of the all-in-one offerings from Spitfire (Albion, BBC Orchestra, or Abbey Road), East West, Orchestral Tools (Inspire), or VSL (Prime). They all will have several different articulations, a decent amount of dynamic layers, and a full set of orchestral instruments. Have a listen to them and see what sounds grab you. Spitfire and Orchestral Tools have a more prominent room sound baked in, but they all do to some extent. So be aware that, whichever library you choose, there's a certain amount of \"reverb\" (which is actually just the hall they're recorded in) that you will never be able to turn off.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183514215865143347",
    "author": "Slow Hand",
    "date": "2023-12-10",
    "content": "> \"How are y'all thinking about which part of this waveform should fall on which side of the beat?\"\nI'm listening and not looking. Nudge. Listen. Nudge. Listen.\n\nWhen it comes to groove or feel it's common for the ensemble to not line up perfectly or even *sound* as if they line up perfectly on transients. Quite often the band are flamming against each other in a way that is tasteful. Sometimes they're dead-on for a beat and the next moment they're doing a tight flam. \n\nDon't get lost solo'ing instruments. Keep the entire song section in perspective when you tweak. If you're having trouble making choices mute a few instruments, but don't solo.\n\nAlso, fader level has a massive influence on groove. Before you start editing too hard play with your fader balances and find the groove that way. Listen to how the proportion of instruments changes the groove. It may turn out you don't need to do much, if any, micro editing.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195016804305731764",
    "author": "Ross Fortune",
    "date": "2024-01-11",
    "content": "Confirmed by Phil Collen that 98% of the Hysteria guitars were Rockman (and Adrenalise, the following album - although that was with the later Rockman where you could switch the chorus/verb/delay in and out).\n\nThe *jang jang jang* I was looking for was Phil's 1978 Fender Stratocaster (nicknamed \"Felix\"), picking one string at a time through the clean setting on the Rockman, avoiding the arpeggio effect of actually strumming a guitar.\n\nSauce: https://www.youtube.com/watch?v=6pli9XTPHR8",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175269242405388358",
    "author": "cian riordan",
    "date": "2023-11-17",
    "content": "I always find in record production, where strings are usually less featured than film/tv compositions, even blending in a single real string recording with a VST bed makes a huge difference in making things sound convincing.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1311026460831645696",
    "author": "Slow Hand",
    "date": "2024-11-26",
    "content": "At the risk of stating the obvious, transitions can also be telegraphed through the instrumental writing too. Whether it's a drum fill, or a chord voicing that walks up/down into the next section, or tension in the melodic voices, or shortening the notes lengths (staccato, staccatissimo).\n\nThere's also idiomatic noises from the instruments. Guitars have string scrapes, headstock rakes, that cool chattering thing from tapping near the bridge with the edge of your pick. Pianos have big glisses, horns can squeal, bowed strings can sweep a fast legato scale up into the downbeat or do a large gliss.\n\nThen there's foley. I get a *lot* of mileage from sound libraries made for film audio. Foley artists are some creative people and you can go far layering their sounds into instruments at the transitions.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957402182024568903",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "In that sense they're like the RHCP who rarely record any overdubs that the band aren't capable of performing onstage themselves. \n\nI think that's a good ethos for a lot of bands, and it puts the emphasis back on the songwriting, by not being able to fall back on elaborate arrangements and sonic embellishments.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157507043578630204",
    "author": "Jeremy Klein",
    "date": "2023-09-29",
    "content": "the more you want it to sound like a \"crowd\" at like a soccer stadium or whatever, the more rhythmically and pitch off the layers should be. you can go as hard as hitting the wrong notes for this effect",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212866968206450709",
    "author": "Josh",
    "date": "2024-02-29",
    "content": "It’s like if you took a political Facebook comments section and  filtered out all of the people who know what an SM57 is.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1316901862615683152",
    "author": "Zakhiggins",
    "date": "2024-12-12",
    "content": "Im late to this, but for me it was Say It Right by Nelly Furtado, of course produced by Timbaland. Biggest take-away was that if you're layering drums samples, you can make them sound huge by not having all the transients hit at the exact same time.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051559803668938862",
    "author": "Zach Hughes",
    "date": "2022-12-11",
    "content": "Wanted to share some thoughts spurred on by a recent experience on here. So a local artist has hired me to produce two of her songs. Vibe is singer-songwriter, soul, RnB.\n\nWe tracked drums, bass, and keys live in the studio OD'd to scratch tracks we cooked up together. The scratch tracks / demos were just guitar vocal and we were really relying on the players to fill out the arrangements, but we knew more would be added down the line.\n\nAll the players were incredible. Could singe your eyebrows off with technical prowess and shredtastic chops. Tracks turned out great, still working on the arrangement, but..\n\nThis project has got me thinking more about the importance of how you present a song to session musicians and the 'space' you ask them to fill in a production. As well as the changing dynamics project to project affected by a revolving cast of participants, more fleshed out demos, etc... I find this a really interesting topic. Curious if anyone in the group has any unique experiences or insights whether as a producer or a musician.\n\nI've found that the more I flesh out demos with the artist beforehand the more bound and limited the session players we bring in are based off our decisions. This can make ODs more efficient, add a clearer direction, but can also remove the opportunity for the player to really add something special. Sometimes I don't want to be too suggestive b/c I want the players to have more of a blank canvas to work with.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075833124975562833",
    "author": "Zack Hames",
    "date": "2023-02-16",
    "content": "Also, COMP/EDIT before recording more layers!!\n\nIf you do drums before bass, edit that shit before the bassist records. You can’t just save all the editing for after recording when you go musician by musician one at a time",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090085972303159368",
    "author": "NoahNeedleman",
    "date": "2023-03-27",
    "content": "Went to track a live kit on a song at a buddy’s studio today. He offered to try a few perc things to layer on top of the conga splice loop I already had going. Played like 5 instruments in quick succession and it went from “that works” so “that’s fucking classic” in like 15 minutes.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108921383926382673",
    "author": "Slow Hand",
    "date": "2023-05-18",
    "content": "Wow. I'm making my way slowly through this Lanois/Beato interview and am amazed by what Lanois is describing from @ 52:24 to 53:45 regarding his approach to stacking modulations and special effects.\n\nAs he describes it, he's performing and printing his modulation effects (delay, verb, vibrato, pitch shifting, etc) one generation at a time as he iterates through the song. This allows him to fine-tune and perform the modulations on each successive pass so that every moment is honed and responsive enough that it becomes a part within the music, and not just a blanket effects chain.\n\nSo if he's doing pitch-shifted delays, he'll do a pass that goes up a fifth on certain notes and then layer another pass that modulates by a different interval at a select moment instead of leaving everything on throughout the entire section. He's honing each effect in sequence. It shows a tremendous care and sensitivity to the music that he would go through and *perform* each layer with so much intention.\n\nThis feels like a revelation to me and I can't wait to practice this.\n\n(I've cued up the video where they start talking about it)\nhttps://www.youtube.com/watch?v=vxP9kKzbCFA&t=3144s",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "940467708946944021",
    "author": "peterlabberton",
    "date": "2022-02-07",
    "content": "A friend of mine got to sit in on a San Francisco Symphony recording session—I think they do all their recordings in house, in the symphony hall. In any case, they'd run through a section of a piece, and the producer and/or conductor would hear, say, one of the violins was sharp on a passage. They'd just punch *that section* (i.e. first violins) with the spot mics in on top of the recording of the entire symphony, and apparently it all blended seamlessly with some volume rides. Then they'd hit the next chunk of the piece.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "962467055519535145",
    "author": "oaklandmatt",
    "date": "2022-04-09",
    "content": "getting them so the phase \"looks the same\" not correct. you want it to sound the best. \n\nwith live drums, you're phase aligning different mics on the same sounds, so the waveforms looking the same \"in\" phase is probably going to be best (line cian said).\n\nif you're layering samples, you only want what sounds best. the sounds you're layering will have different pitches and decays and timbres and whatnot, so you want to play with flipping the phases to see what sounds best for whatever you're trying to achieve",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987585206166908929",
    "author": "BatMeckley",
    "date": "2022-06-17",
    "content": "I had a record like this. Ended up using the over head compressed as the bulk of the sound and layered in snare kick and Tom with samples to fill out what I’m missing. Actually was the record that ended up launching my mix career, so maybe a blessing in disguise?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993962978447732799",
    "author": "delwin",
    "date": "2022-07-05",
    "content": "thanks for all the help here y'all. izotope vinyl on the string section did surprise me indeed, succeeded where my other lofi plugins failed me 🙂",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1017137533022388254",
    "author": "samvalentine",
    "date": "2022-09-07",
    "content": "@BatMeckley nailed retune and classic... Flex tune allows you to hit notes that aren't allowed in the key; higher the value, more time you're allowed on that note before it'll snap you to a note in the key. I'll keep it pretty low usually but it all depends on the vocalist. I've never really fucked with natural vibrato. Humanize is nice. Let's longer sustained notes wobble a bit even at high retune speeds. Sometimes I'll really crank it, but it does take away from the autotune effect if that's what you're going for.\nOne other tip is I like to flip to advanced mode and set major/minor in the bottom section (leave top drop down in chromatic). This allows you to bypass or allow certain notes that aren't in the key. So if you wanna hit that flat seven now and then, bingo",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018563046676889710",
    "author": "peterlabberton",
    "date": "2022-09-11",
    "content": "Under 40 hz? If we’re taking *that* low, in my experience usually kicks benefit from sitting just slightly above that range, especially in rock—somewhere around 50-60hz. Usually they sound punchier and less flabby with just a touch of the super low lows rolled off. Basses can move around a bit more, obviously, but I also find that usually even if you have a fundamental around or below 40 hz, the first harmonic an octave above is usually what you’re actually interested in. Also it’s very song/arrangement/tempo (!) dependent! A slower tempo or less busy kick pattern or song arrangement will let you get away with loads more super sub stuff. Faster patterns will just sound like flabby mush with tons of sub.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066813164085330051",
    "author": "Slow Hand",
    "date": "2023-01-22",
    "content": "I don't think anyone is going to mind if you layer another kick on top or replace it with something that feels the same. Unless they're some sort of acid-house purist, or something.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103478940800135239",
    "author": "LAPhill",
    "date": "2023-05-03",
    "content": "This reminds me of something totally random. On the score to Requiem for a Dream, Clint Mansell sampled punches from old Kung Fu movies in place of drums.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119343014221992036",
    "author": "Maxim",
    "date": "2023-06-16",
    "content": "If you want to get a kick properly, try isolating each section rather than fading. Izotope Imager is great for this. \n\nJust create 4 bands spread evenly and export all of these bands separately in solo. Then bring them back, stack the 4 layers and cut the noise from each band until you only hear the kick (transient). This will let you keep those long lows intact without the noise up top.",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1124102973002354718",
    "author": "NoahNeedleman",
    "date": "2023-06-29",
    "content": "Fewer elements means individual sounds can be much beefier. Arrangement is everything. Also what Ha said: use Decapitator- turn on the thump switch, roll up the high pass until it thumps in the right way.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129562652251783218",
    "author": "CameronKuwada",
    "date": "2023-07-14",
    "content": "Don't know if this the right section to share this (if not, Lmk!) but I made a small sample/grooves pack out of a bunch of live drum recordings I have, if anyone was interested 🙂 I set price as \"Pay what you want\" but no obligation. Feel free to cop it for free!! https://cameron-kuwada-mirthful.sellfy.store/p/ck-sounds/",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175285240114200606",
    "author": "LAPhill",
    "date": "2023-11-17",
    "content": "There’s a ton of this. His and Danny Elfman’s pizzicato strings are usually 100% samples. Same with string harmonics. And then there’s Hans, which is always a blend, sometimes 100% samples. We’re making recordings, not documenting live performances",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207419615555092510",
    "author": "LAPhill",
    "date": "2024-02-14",
    "content": "+1 for Cremona Quartet. If it's just for demoing out parts, prioritize ease of playing/programming over maximum realism. A solo string library is the equivelant of a human voice VST - unless you spend a ton of time and really write to the library's strengths, it's never going to fake anyone. Get the vibe in there and spend a couple hundred bucks on a real player.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328826018793914568",
    "author": "LAPhill",
    "date": "2025-01-14",
    "content": "IME it’s really hard to write anything you want with sax samples. They sound much better when you play to the library’s strengths. Session Horns is good, Project Sam’s Swing is good for a section sound",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "956935076799725658",
    "author": "Rollmottle",
    "date": "2022-03-25",
    "content": "I think “production” is the sum of all the choices as evidenced by the end product. This includes mastering, mixing, arranging, writing, recording, sound design, etc. Those all represent choices. \n\nThis Charlie XCX is generally well-produced and meets the threshold of what I would consider the minimum level of production value for an artist at her level and in her genre. Is it actually good or new (does that even matter?) or do the production decisions here support the intent of the song? I don’t know. On its own, it could just as easily be a stock piece of music from a library to my ears. \n\nI like well-produced music, but I’d rather have REALLY GREAT MUSIC above all else. The amount of well-produced hot-garbage these days is too damn high.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993926945169490090",
    "author": "NoahNeedleman",
    "date": "2022-07-05",
    "content": "RC-20 baby. Wow & flutter and the filter on the EQ section are magic on individual tracks, and on busses. But it’s MOSTLY about the performances! Making sure the parts are written in the style goes a really long way. Recently did this for a Batman Cartoon composer reel at it was so fun.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1027313791635050537",
    "author": "Will Melones",
    "date": "2022-10-05",
    "content": "Somebody actually did this…there’s a podcast episode about it but I strongly doubt I’d be able to find it. But this dude had a song stuck in his head and somebody (the podcast producers, maybe) paid to book a studio and a band and he literally dictated the whole arrangement to the band and made a demo from the bits and pieces he could remember.\n\nEdit: I lied, it’s a popular podcast and was very very very easy to find. https://gimletmedia.com/amp/shows/reply-all/o2h8bx",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093067167999737917",
    "author": "Ross Fortune",
    "date": "2023-04-04",
    "content": "There’s some reaaaally interesting and skilfully executed textures and details across Rosalia’s Motomami album. Starting with the deliberate clicking on the edges of the vocal edits in the first track 👌🏻",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099737931834470439",
    "author": "Adam Thein",
    "date": "2023-04-23",
    "content": "I'm guessing it's a few Roland D50 patches blended - released in 1987.  Maybe patch 30 \"Spacious Sweep\" modified with a slower attack with Patch 6 \"D50 Voices\" mixed on the left?  Maybe a third layer on another preset in there with a phaser in mono, you can hear that come in on the verses.  Could also be Emulator like @stefanmacc said but I'd just look at using some of the Arturia sample-based digi synths for a similar vibe! \n\nhttps://www.youtube.com/watch?v=sM6c_jxVVlM\n\nEDIT: another clue would be D50 would have been a lot more affordable, what I could find is that a lot of the keys were tracked in a home studio which I think would point toward D50.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103386895817383957",
    "author": "Deleted User",
    "date": "2023-05-03",
    "content": "Someone challenged me to make lego music work with just 4 instruments. And that was definitely where I’ve been falling short in arrangements. Subtraction and Addition is cool, but not knowing how to build up intensity and resolve with just one or two instrument is a crucial skill as an arranger/musician",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1163468064482926601",
    "author": "Adam Thein",
    "date": "2023-10-16",
    "content": "I was hoping it was stuff you recorded yourself.  I'd love to hear 500 layers of Ross cheering",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196616185538678874",
    "author": "peterlabberton",
    "date": "2024-01-15",
    "content": "And even more so, I'd echo at least one post above (from @Rollmottle?): I bet there's a good chance that if you, for instance, play it note by note, you might stumble on a more interesting sound or texture or voicing than if you just play a perfect take.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220861043102715925",
    "author": "BatMeckley",
    "date": "2024-03-22",
    "content": "So, alternative option that has worked for me: I’ve played a deering six string banjo at half speed an octave down. When varispeeded up to pitch it’s now in the right register and twice as fast, sounding like I actually know wtf I’m doing.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222058055626133545",
    "author": "itMIGHTbeNICK",
    "date": "2024-03-25",
    "content": "Today we were looking for a more textured dirty synth sound out of the Juno. We tried multiple different ideas until we came to a conclusion with a guitar amp.\nRan the 106 right into a Keeley rat style pedal for extra sizzle and then mic’d up one of the newer Bad Cat black cat amps (tremolo and reverb from the amp on) and it was absolutely the PERFECT sound for this track!\n\nThat is all.\n#trystuff",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1286004161460174909",
    "author": "NoahNeedleman",
    "date": "2024-09-18",
    "content": "Rubber bridge vibes, still a lot of texture but almost zero decay. It’s not exactly a rubber bridge but it’s instantly creativity-inducing",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336392551892127825",
    "author": "NoahNeedleman",
    "date": "2025-02-04",
    "content": "I’ve been thinking about @Joel \"Roomie\" Berghult‘s question re: mixing as you since he asked it. I think what Rauirí says about not knowing what we’re doing while we’re doing it is really true, so I’ve just been trying to dissect my process in my brain, away from the computer.  I think it comes down to 2 things for me. \n\nHere are my thoughts:\n\n\n1) Choosing Sounds. \n\nIn addition to vibe & genre & emotional intent, each instrument or sample that you pick covers a certain area of the overall picture. Knowing where that part is going to go in the overall arrangement changes how much hi end or low end or wetness (etc.) you want. It also steers performances. \n\n2) Actually Mixing As You Go \n\nOnce a part is recorded, do a quick adjustment so that you hear closer to a finished product. This helps you make better choices about what else needs to be added, (or not added,) and will likely inspire the next step.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366573229916815400",
    "author": "Slow Hand",
    "date": "2025-04-28",
    "content": "Three things come to mind: \n\n1) **Note length and envelope**. That's going to have a large influence on the feel. Electronic producers will spend a *lot* of time sculpting the volume envelope relative to the tempo. Trance producers have entire plugins that give them microscopic control over the pitch and volume envelopes of kick drums.\n\n2) **Presentation and proportion**. Is it up-front or does it sink into the back? It's easy for a 4x4 to feel hackneyed or overbearing. Sometimes all you need is a gentle *pat pat pat pat* to tie things together.\n\nA fresh or unconventional texture will open up drastically different feels. People can dance to anything if it's got a 4x4 click, so it doesn't necessarily *need* to be a kick. You can go far using samples and percussion that sit in different registers, but play the same role.\n\n3) **Complimentary instruments**. If the kick is the \"rock\" then the groove is going to come from how everything else swings over that. What's the friction like between the kick and the other elements? If the kick is a \"straight man\", then the other elements pushing off of it are where the magic comes from.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434665774949335080",
    "author": "chrissorem",
    "date": "2025-11-02",
    "content": "I was in a similar situation last week, and  there were a few times where I found myself thinking, “shit this has turned for the worse, how do I steer us back to main land”. What I concluded was you have to be patient and let them try the ideas hear them out and if you feel strongly about something, tell them what you feel in a way that makes them feel like you care and explain without it becoming a speech why you aren’t feeling the idea. And try to follow it up with an idea that you think works.  In my case I  said “ we all love the foundation and we landed somewhere and that feels good. Now we have to be disciplined and be sure that anything we add is truly adding and not taking us away from our northern star.”  And if you think they have bad ideas that they are glued to, ask questions, why do you feel this part has to be here, what is it doing for the song as a whole? Ect. For an arrangement you should be able to hash that out quickly, there are only so many options",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444132648179208282",
    "author": "BatMeckley",
    "date": "2025-11-28",
    "content": "I know I’m the other matt but when I’m doing that technique I’m usually just working on a single cycle of the waveform. It’s tedious, but to me it’s totally transparent, and I’m rarely cross fading because it just doesn’t need it at that microscopic level. But I have no doubt that the better matt is right about it on bigger sections. \n\nWhen I do it in protools (the slightly larger sections) I’ve found you can nudge one of the two things you’re cross fading sample by sample and you’ll watch the over lapping waveforms kind of level out at a specific spot where it’s the most transparent sounding fade. \n\nA majority of time I find if you’ve cut up your blobs properly in melodyne, melodyne works just fine, but on the really really delicate shit I’ll do the single cycle wave form duplication. \n\n(I hope this makes sense, I’m hurtling through the air at 35000 feet on a not insignificant amount of Xanax)",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987515205997183056",
    "author": "ehutton21",
    "date": "2022-06-17",
    "content": "Sometimes I think the best way to approach music is when you come at it from an old school “producer” mentality. Mixing, production, arrangement all at once. You may not implement every skill on each project the same way, but i can’t think of a time where my knowledge of one side hasn’t inherently shaped things on an adjacent side in the same project",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993912077997572116",
    "author": "Jeremy Klein",
    "date": "2022-07-05",
    "content": "I recently put izotope vinyl on a string section to make it sound like it was from the 50s and it worked surprisingly well. And it's free!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053738935181905931",
    "author": "popaganda.",
    "date": "2022-12-17",
    "content": "Also, don’t sleep on the weirder stuff that plays itself…I use British drama toolkit in productions a lot….great textures if your part isn’t super “partey”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053763659152752670",
    "author": "NoahNeedleman",
    "date": "2022-12-17",
    "content": "I’ll add something a little off the beaten path here. There’s a library called Indie from NI that’s kind of a pain in the ass to use, but has VERY real sections performing phrases. \nI’ve found a fair amount of the time I can use some of their phrases to better effect than programmed parts, as long as I don’t need specific Melodies. It’s worth looking at",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061720504475598868",
    "author": "1ggy",
    "date": "2023-01-08",
    "content": "Yea they’re trying to avoid people layering 3 slice loops with god particle on it and calling it your own",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596054035271764",
    "author": "BatMeckley",
    "date": "2023-04-03",
    "content": "It’s so funny to watch the people I know layer kick samples, then 2 years later another producer use their 8 layers as one layer, then add 5 more layers, then 2 years after that the original producer sample that 13 layer deep kick.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114512948673650738",
    "author": "cy (sigh)",
    "date": "2023-06-03",
    "content": "pretty sure it won't. some folks might lean on it less in a pop context but it won't die down overall.\n\nthe \"trap era\" started in early 2000s (Rubber Band Man - TI  being one of the breakthru songs)  mightve hit the pop world later. it's (808 subs) been in hiphop since the beginning (80s) just that the exact texture has been changing with time/tech but it was already in modern hip hop hits. \n\nthe shift to hip hop being the main musical influence in the world around the 2000s  (not necesarily the #1 genre) is what weighs more on it. if another genre managed to pull that influence from it.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1124419445956284578",
    "author": "KushKadett",
    "date": "2023-06-30",
    "content": "Yeah think yeezus. Minimal arrangements and production but maximalist mixing and tracking",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168980559050063993",
    "author": "NoahNeedleman",
    "date": "2023-10-31",
    "content": "You can invoke the Composers/Orchestrator’s Exemption",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171125153334308954",
    "author": "BatMeckley",
    "date": "2023-11-06",
    "content": "I actually listen to a lot of music from the 40s because the whole one mic, one take thing is a great lesson in dynamics and mix arrangement. You need the bass a little quieter? Tell that dude to BACK UP.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175266240047099914",
    "author": "LAPhill",
    "date": "2023-11-17",
    "content": "Out of tune, out of time, quality issues everywhere. I manually recut their whole string library back when they still let you get under the hood. Brass and some of the winds completely unusable for me, beyond salvaging.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194297860896862250",
    "author": "NoahNeedleman",
    "date": "2024-01-09",
    "content": "I mean… I said it all like I know exactly what I’m talking about. But it’s just my best guess. Chorus effect emulates a 12 string vibe but 12 string kinda does its own thing. I’ve gone for sounds like that by stacking a high strung with a standard guitar. \n\nI have 2 12 strings- a 1972 Martin and a 1982 epiphone. I took all the low strings off the epiphone and it’s a GREAT instrument for stacking strums.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196605922726912090",
    "author": "Rollmottle",
    "date": "2024-01-15",
    "content": "why tho? why not record it a phrase at a time and comp it together, even if you can't play the whole piece? i have also split the part up across multiple tracks playing parts cleanly and then putting them back together (low string parts, high string parts). the ability to do this is the backbone of my recorded musical output 😂",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202659052895862904",
    "author": "LAPhill",
    "date": "2024-02-01",
    "content": "This might finally be the project to get a 7 or 8 string guitar",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247538749005365328",
    "author": "Ross Fortune",
    "date": "2024-06-04",
    "content": "It’s a beautiful flowing thing. Obviously genre and context dependent, but it’s a flavour that I do really like. \n\nI went deep on the Beach Boys earlier this year and mapped out the tempo of Help Me Rhonda, then used the map to compose a track. The jumps could be as much as 3-5BPM from the verse into the pre, but in context it just feels like push and pull, tension and release, rather than “why’d it slow down so much?”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334327684289007690",
    "author": "Zach Hughes",
    "date": "2025-01-29",
    "content": "Ooo I love this question. I'm currently on a journey with this idea that 'arranging is mixing'. There are a few things I've learned / frameworks that have been helpful to me recently.\n\nI have noticed that in the past in my own approach to production (as well as with some clients who send me their productions to mix) the way I thought about building the track was like assembling / stacking static blocks on top of each other. This realized more as a mental construct and not fully so in practical application. Intuition still served. But this framing became problematic and I think is endemic in music created with primarily loops and samples.\n\nI remember hearing Jon's comments on his 'temporal approach' to mixing which he wrote about on his site (I believe a link surfaced here a few months back). Some of the language Jon used was helpful to me (i.e. painting with sound). I started to think about my productions instead like film. Each second of each section of the song is a new scene unfolding. Every type of processor then becomes a way to adjust and enhance the emotion of the characters in the story. Not static but changing and adapting to align with the central spirit of the song. I tried to find more useful metaphors (i.e. sommelier of sound, a song tour guide, like I was piloting a space ship and mix elements were asteroids). It's one thing to lay down some parts and call it a song and another to consider what is the experience of these parts through time. I think less experienced engineers and often artists who record themselves are not considering pretty much every one of @Slow Hand 's points which creates a real challenge for the mixer.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407740479457722449",
    "author": "Zakhiggins",
    "date": "2025-08-20",
    "content": "Im pretty much always messing with the length of kick, snare and hat trying to get them to fit in the grove better, you can make some unlikely pairs work when you do this.\n\nAlso always messing with the order in which transients are hitting on downbeats, nudging certain drums slightly before or after others can make things mesh together real nice. Typically the higher pitched/attacky things like hi hats come earlier than the sub kicks for example but experiment with it and see what sounds good. A song where this is really obvious is say it right by nelly furtado, listen to the way the layers are stacked on the downbeats of the chorus. Side note, when you're doing this, think of everything with a transient on that downbeat as a percussion instrument.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407996896177291264",
    "author": "andrew_yv",
    "date": "2025-08-21",
    "content": "Not the one true solution by any means, but when I did my first album, I settled on an ensemble after I had already produced a lot of disparate demos, and then rearranged the best ones for that ensemble. In my case, it was string quartet, nylon guitar, percussion, and electronics. That also led to cool “choices” that came from like, having my violist play a part I made the demo of on a semi-modular mono synth. Ensemble can be a unifying lens to capture your diverse ideas through and give them a sense of unity",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "956951340997816320",
    "author": "NoahNeedleman",
    "date": "2022-03-25",
    "content": "I’m with you on this, (as with most things you post & share on the discord.) Production rolls are so fluid, depending on the artist and the label or whatever team is in place, so honestly I agree that production choices encompass everything from beginning to end. Which is why we use more specific terms amongst our professional brethren- arrangements, instrumentation, performances, sonics, loudness, stereo field, depth, etc. Production really is the sum of all parts…",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957113606833569802",
    "author": "chloe corley",
    "date": "2022-03-25",
    "content": "and like comparatively, since they were released on the same day, i’ve been Loving the new rosalia songs, especially like la fama and hentai, all the arrangements on that album feel very meticulously coordinated and each instrument/sound serves just the right purpose.\n\nlike on La Fama i’m obsessed with how the chorus doesnt expand on the vertical arrangement at all and is just pushed forward in energy by the vocal melody, which obviously can only be done with really good writing, but its a really beautiful decision to just let the melody breathe and have the space to push the song/energy forward like that",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957394406065983528",
    "author": "David Fuller",
    "date": "2022-03-26",
    "content": "Doing more than that with a band like AC/DC just doesn't work. It's not music that works well with big arrangements.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957455128233930823",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "As a counterpoint to this idea, what you often see in many styles of electronic or 20th century classical music is that the arranging can, in fact, be an integral part of the composition and it doesn't have much of a \"song\" to speak of. In this case the arrangement and the song cannot be teased apart, because the overall musical effect is defined by and dependent on the unique qualities of the arrangement. Something like this: https://www.youtube.com/watch?v=wmrsud1PpRk",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "967410457575059466",
    "author": "cy (sigh)",
    "date": "2022-04-23",
    "content": "depends on the type of song but i like adding barely noticeabke delays. all v slightly off tempo.  can be useful to help give a push or pull feel to the groove, especially if it feels too quantized or you just want to loosen it up for a section. \n\ncan be v subtle but prioritising diff elements per section  has also worked great for me.  for example bringing down the kick a smidge and having a couple other rhythmic elements take the lead for a while then bringing back the previous balance.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987473653157474385",
    "author": "samvalentine",
    "date": "2022-06-17",
    "content": "Did a mix w a 2 mic set recently. Ended up blowing up the mono overheard/room and pretty much tossing out the kick mic they had. Layered in kick and snare samples to beef up the groove and provide some transients but the bulk of the work was the mono mic. Definitely not an ideal situation but you do what you can. Curious to know the position of the mics you got... Maybe two overheads?? 🤞",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994275444549505074",
    "author": "Will Melones",
    "date": "2022-07-06",
    "content": "https://decomposer.de/sitala/\nIt does next to nothing compared to most samplers, but that’s why I love it. I already have a huge hard drive of one-shots to drag and drop",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1024417077878063234",
    "author": "ehutton21",
    "date": "2022-09-27",
    "content": "That’s my early experience too. It’s like speaking another language. You inherently pick up the ability to understand more and more about cultures and other interactions. Learning to produce helps you understand what producers want out of a mix, learning to mix helps you understand how much can be done in the production process to make a good mix and how valuable arrangement is, learning how to songwrite helps you learn how to better work with the talent when you’re working through production",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054164784410546206",
    "author": "Deleted User",
    "date": "2022-12-18",
    "content": "Layering it on top of ensemble would add some serious realism. I think good solo strings would be really useful for both solo purpose and adding on top of a large orchestra size section.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055174557222314084",
    "author": "Slow Hand",
    "date": "2022-12-21",
    "content": "Yup! Massive was my go-to for years prior to Massive X.\n\nThe biggest change for me is that the raw oscillators sound far better. The original Massive had a lot of aliasing that could make it sound hazy and flat. Switching over to Massive X it is crystal clear and even buzzy saw waves feel warm, pure, and tactile.\n\nIt has extremely flexible modulation capabilities that I find to be very musical as well as some very comprehensive ADSHR envelopes. It also has four different keyboard tracking curves that you can assign and tweak, which is very important when fine-tuning your patch to make sure that it sounds even across the entire range of keys.\n\nIt has a lot of musical sounding filters that can inject a ton of vibe, or be completely neutral. The *noise* section is robust and very flexible. I use it a lot.\n\nFinally, it has a great-sounding set of internal effects (delay, chorus, saturation, verb, etc) that can be placed anywhere inside of the routing diagram. It's always a bummer when the on-board effects aren't very inspiring. But NI has a strong catalog of well-designed dsp to draw on and integrate into their products, so it's turned out great.\n\nOverall, it's a very robust and well-rounded synthesizer that also does a lot of things extremely well. It can be super clean (like Serum) but also get very dirty, which I appreciate in a synth.\n\nThe only thing I don't like is that the preset browser kind of sucks. I prefer the original Massive's browser. NI is well aware and they have been overhauling it and slowly adding new features, so I trust in time this will be made better.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057061192792817755",
    "author": "Slow Hand",
    "date": "2022-12-26",
    "content": "**Fun fact:** I hate pads. I couldn't program a synth pad to save my life. I've always found them to be kind of gross and *meh* from a compositional standpoint, so I never reach for them.\n\nNo ill-will though, if that's your thing. They're just not for me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057065445221474304",
    "author": "Slow Hand",
    "date": "2022-12-26",
    "content": "I think the best thing you can do when learning a synthesizer is to pick just one or two and really take the time to learn them inside and out. There's so much overlap between the feature set and if you can get very intuitive with one synth you'll go so much farther.\n\nBack in the day I bought NI's *Komplete* bundle and it was just way too many new instruments too fast. Too many options. I never got to know any of them very well. Most synths have all of the same features that you'll want, but there's still a learning curve for every single one that you have to get over before you can be really expressive. I wish it were as easy as picking up a guitar or a horn where everything is standardized and lies in the same place. But that's part of what makes synths great: Their plasticity.\n\nNowadays the only synths I reach for (unless I need a very specific sound) are *Massive X*, *Razor*, and my Moog Sub 37. The first two are very different and don't share many features. I use the Moog when I don't want to be tethered to my computer. Limiting my available tools has been a net benefit for me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066826580162257097",
    "author": "Ross Fortune",
    "date": "2023-01-22",
    "content": "Totally this. I've wasted far too many hours of my life trying to make a poorly chosen sample work by layering, EQing, compressing etc. when just picking a stylistically similar but better suited (tone, length, punch) would've been the move.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071199130728276119",
    "author": "Jeremy Klein",
    "date": "2023-02-03",
    "content": "i work on a lot of music that's supposed to sound \"spooky\" and sketch cassette is INTEGRAL to my workflow lolol. The dropout section is soooo sick. Love that plugin",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092594893181943879",
    "author": "cy (sigh)",
    "date": "2023-04-03",
    "content": "a large amount of hip-hop and R&B 808s are modified DJ spinz 808s from early 2000s. \nor they'll be layered along with them. I'm sure the % has gone down over the recent years w sublab and ANA going on but it was hard af to find any that weren't from those packs early on. unless you had access an 808 drum machine  of course.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596544781434950",
    "author": "BatMeckley",
    "date": "2023-04-03",
    "content": "It doesn’t exist. What’s the key of the song? What’s the tempo? What’s the rest of the arrangement look like?\n\nToo many variables for one 808 to rule them all.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103373035131637802",
    "author": "popaganda.",
    "date": "2023-05-03",
    "content": "There are some traps with Lego music that can be overcome with a little intention. For instance, we all kinda know the standard contours of a pop song….in Lego music you pretty much accomplish this by addition and subtraction of arrangement elements, but in the live days musicians would contour a song with the energy/intensity of their playing, and when a rhythm section is tracking together someone is usually leading that charge and everyone’s riding that energy wave together into the last chorus or whatever",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119447483207131166",
    "author": "LAPhill",
    "date": "2023-06-16",
    "content": "NI’s Session Horns Pro is useful for a lot of applications because the sound is pretty dry. Good amount of articulations and instruments. But I find brass so specific and articulation-heavy that every library I’ve heard eventually hits a wall with really idiomatic lines.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139357734131740794",
    "author": "NoahNeedleman",
    "date": "2023-08-10",
    "content": "@LAPhill was thinking of you today while doing some “scoring” for my wedding video (DIY slideshow / iPhone video montage.) \n\nI loaded up Keyscape cinematic grand, Spitfire BBC Orch on 4 tracks, (violins, violas, cellos, horns,) and went at like I would a vocal arrangement- one voice at a time, which was great for internal voice leading and lead to some beautiful & unexpected chords. \n\nCame together really fast too.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142133474594132038",
    "author": "austenballard",
    "date": "2023-08-18",
    "content": "gems like the one i screenshotted. And I'm reminded of your cookie story. Honestly that one should be pinned if it isn't because I think it's a great anecdote that says much the same thing.\n\nI don't consider myself a great producer at all. Maybe not even a good one. I'd like to think I'm on the way there but at any rate the sonics of my work aren't usually what people thank me for. \n\nThey thank me for responding promptly, for attending to their notes with care and clarifying when necessary, they thank me for having clearly labelled deliverables, etc etc.  but on the actual arrangement or mix itself I might just get a fire emoji in response. I know I have clients with the resources for better producers who keep coming back to me because they know they can rely on me for stuff like that.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1150531467936546867",
    "author": "Slow Hand",
    "date": "2023-09-10",
    "content": "I don't know that music being hard is necessarily a good thing for it's own sake. I'd rather have it be easy and lower the friction between conception and realization. A lot of tech these days enables that ease and has opened the door to more people writing and producing their records.\n\nBut a secondary side-effect that I think we can all observe - and I think this is more to your point - is that musicians are leaning into those methods and not pursuing the hard work and practice that is necessary to do things like singing well, or playing piano with more than a base level of proficiency, or orchestrating an ensemble well. The expressive unlock of being highly proficient isn't being pursued like it was in the past decades (before we had so may technological means). People are - broadly speaking - more satisfied these days to settle for records that don't push into that potential.\n\nWhat we lose are the heights of expression that virtuosity unlocks. Whether that's singing like Aretha Franklin, or playing a simple ballad like Bill Evans, or writing a song with as much sophistication and lyrical wit as Joni Mitchell.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1176077622971727932",
    "author": "Edward Rivera",
    "date": "2023-11-20",
    "content": "Just showed my girlfriend the empire strikes back (first time) and the score is immaculate.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1176330354072756365",
    "author": "sethearnest",
    "date": "2023-11-20",
    "content": "Yeah that part’s coolness is 98% the performance and arrangement’s contrast. \n\nProduction wise, sounds like a lot of heavily pre-delayed verb and some long stereo delays swirly-twirling around the vocal, plus the double (mono double) and harms dipping in and out. The long pre-delay and tight double will be key to get that super-intimate-but-still-swirly feeling. \n\nBut yeah as you alluded to, the feeling of that part is so dope b/c of 1) the whispery performance itself and 2) the contrast of the bottom falling out from the previous section. Very effective.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202681455453409370",
    "author": "BatMeckley",
    "date": "2024-02-01",
    "content": "There’s a lot that can be learned about the concept of “slippery slope” in this picture. That guy is CONVINCED he looks super cool in this photo. “If a guy who plays a 6 string is cool, a guy playing 18 is C O O L” \n\nI feel like he’s the kind of person who would talk AT someone instead of WITH someone.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217368188489306172",
    "author": "hamish",
    "date": "2024-03-13",
    "content": "The section about looking for a better fanbase really hit home - I think that’s such an insightful comment that really hits the nail of why so many Band Makes Album To Hit The Big Time scenarios end up feeling so hollow emotionally and ultimately alienating the diehards",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241778730511237191",
    "author": "Bryan DiMaio",
    "date": "2024-05-19",
    "content": "Good luck! If there’s anywhere I find nuance easy to get lost it’s in a YouTube comment section",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1269744778145431602",
    "author": "Slow Hand",
    "date": "2024-08-04",
    "content": "Follow your gut here. Better to leave 'em wanting more.\n\nThat said, you could make some fun alternate edits as a special release and really dive in on the extended version. Build that section up into it's own thing.\n\nAnd as Noah's about to suggest (I think) it's an opportunity to liven up the song in a live performance too.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284233069922091078",
    "author": "LAPhill",
    "date": "2024-09-13",
    "content": "Playing inversions on the A string, ime, is usually not a problem. The old G5, D/F#, E5 descending line type thing has never been an issue. But that same thing down around the lowest notes of the E string can get more thorny. Again, lower interval limits and muddying up the bass notes are more of a problem down there.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285630180148117554",
    "author": "Ross Fortune",
    "date": "2024-09-17",
    "content": "Good section on this at 31:30 https://youtu.be/pS-nZdYpMgo?si=V_HFl2uZCNn5RdFN",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301955127967613029",
    "author": "LAPhill",
    "date": "2024-11-01",
    "content": "Why isn't editing possible? If you can't fix the spot in a way that sounds natural, you may need to grab that section from a different part of the track and replace it, if it appears anywhere else. Otherwise, sometimes you need to adjust the timing of a few bars before or after, even though they seem fine now, so that the amount of shift needed is spread out amongst a larger section than trying to move one chord by an eighth note or something musically egregious.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315377280083824710",
    "author": "LAPhill",
    "date": "2024-12-08",
    "content": "Composer Jason Graves has a little mini-series where he walks through building a simple instrument. Some clever ideas in here I’ve stolen for my own sounds:\n\nhttps://youtu.be/THeeKCHo7tk?si=rEp8nZSyTGU9f4bP",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334322947069968495",
    "author": "Felix Byrne",
    "date": "2025-01-29",
    "content": "this just made me think of something i'll do on planes\n\nlisten thru to songs and do super super granular notes app breakdowns on everything that's happening at any point\n\nINTRO 8 Bars - first filtered sine synth pad comes in playing block chords, subtle seagull sounds in background, 4 bars in a bright distorted synth lead motif appears with tails running into next section\nVRS 1 16 Bars - same synth pad, but even more filtered etc etc etc\n\nkinda helps show what all is going on arrangement wise and how it changes or doesn't",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360330677740109986",
    "author": "minipops",
    "date": "2025-04-11",
    "content": "Ok not exactly what you're asking for but this is what came to mind when you first asked.  It's an acoustic kit made to sound like electronic 808 sounds. Could be layered with a real (electronic) 808 kit for a more electronic sound.  https://majetone.com/products/ac08?srsltid=AfmBOoowl8cU0O8AdqkZLT53l-S8Vfk7WnH_a-4oslEhJe2JlOYI3GiD",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1390029925293096990",
    "author": "andrew_yv",
    "date": "2025-07-02",
    "content": "I think often when people say this, they mean that the production is not serving the heart of the music. I hear it plenty still and I think it will always be relevant. Before recorded music, something could be “over-orchestrated”\n\nIf you’re getting fancy with it or “making it sound good” rather than focusing on the unique emotion and identity of the song, I think you’re probably at risk of something akin to overproducing. Not usually a critique of elaborate production per se",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411002720529285305",
    "author": "Ross Fortune",
    "date": "2025-08-29",
    "content": "As it goes, I'm looking for a Seinfeld bass sound today and came across this.\n\nThe composer, Jonathan Wolff, took the tempo for the theme tune from the cadence of Seinfeld's standup delivery. And he recorded a new theme tune intro for each episode, playing in bass licks in the pockets of Jerry's monologues https://www.instagram.com/p/CuH3KJosa2i/?utm_source=ig_web_copy_link",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1455184741681729557",
    "author": "Beck Nebel",
    "date": "2025-12-29",
    "content": "It may be worth focusing on producing first. You’ll get quicker wins without relying on your own sound design, and using high-quality Serum presets gives you material to reverse engineer.\n\nIf that doesn’t click, separate the two. Don’t sound design while starting a track. Set aside dedicated time to make patches, which can still inspire songs. Ultimately, even the best sounds do not matter if the arrangement and melodies are not strong.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465778151551402005",
    "author": "BatMeckley",
    "date": "2026-01-27",
    "content": "It’s super common in orchestral scoring to ride two faders at once, 1) being the same cc as the mod wheel which controls the intensity of the instrument, 2) a cc that usually represents the overall volume of the instrument. So, on a dense score like that you’re going to get massive amounts of micro automation, almost as if you were mapping the vibrato on a guitar solo (x25 different instruments).",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1467644568441983087",
    "author": "Chad Rodgers",
    "date": "2026-02-01",
    "content": "Yeah it sounds mad doesn’t it. There are like 3 or 4 different sections in that song that are dialled in completely differently to one another. It’s nuts. You’re like sucked into another space entirely each time. I’m thinking what you’re mentioning has to be a compression thing, but it could also be some hard EQ manoeuvres, mic choices and playing with space in various ways. But no idea really if I’m honest.\n\nIt’s a shame this album (and other post-Beatles / pre-Wings McCartney material) got such a bad rap at the time tbh. For me this is the sound of someone having a fuck load of fun and not really caring what anyone thinks about it. It’s a bit unhinged at times and a bit corny, but it’s joyful, and it’s the sound of someone growing awkwardly out of their old clothes and finding their way to something new. And it’s a super deep well of Beatlesque music to learn from.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470171051391586386",
    "author": "chrissorem",
    "date": "2026-02-08",
    "content": "I’ve  been waiting for a month for him to send me a string part.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470803943952224359",
    "author": "Will Trotman",
    "date": "2026-02-10",
    "content": "In addition to the diamonds like Noah said, just root notes chugging away or playing 8th notes can be helpful and non invasive if chords or power chords feel too informative. Octaves can be a cool halfway point. A lot of songs seem to have room for the clean “dinky” sort of electric parts (sometimes slightly melodic or sometimes just hanging out on a single note).\n\nIf it’s a matter of filling space, something that helped me on a pop track the other day was making a second track for echoes of the lead vocal where you can low pass it pretty hard and delay / verb it out.\n\nI often find myself introducing subtle sub basses later in the song, potentially doubling electric bass with synth bass, maybe layering snares to be fatter in later choruses. Then playing with some subtle percussion elements like triangle, clave, wood blocks, to differentiate later choruses.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941089234855542814",
    "author": "Deleted User",
    "date": "2022-02-09",
    "content": "alternating different samples can work really well. differences between the samples can give more to listen to in the groove than just changing the velocities.  I find my self alternating more than layering since a lot of the samples already come layered.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957392995316035604",
    "author": "Rollmottle",
    "date": "2022-03-26",
    "content": "This record sounds really good. There's a lesson there in the sparse instrumentation and arrangements.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957401689235791963",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "I think the arrangements on *Back in Black* are perfect for AC/DC. Super minimal and no-frills. Those instrumental tracks are big, clean, and have enough space to drive a mack truck through; which is something that absolutely slays when you're listening to the record loudly or performing it in a stadium with a massive backline.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957443784831021146",
    "author": "NoahNeedleman",
    "date": "2022-03-26",
    "content": "Radiohead fan here. 👋🏻 of course their songs are still dope, but they bury those fuckers in arrangements so deep it’s hard to hear ‘‘em sometimes. But fuck it if I don’t love ‘em for it AND despite it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957453360200548423",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "It's the difference between playing *Blackbird* by The Beatles with solo voice and acoustic guitar, versus arranging it for a big band or a symphony, or doing it as a gritty electronic dirge.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "967283203729653771",
    "author": "Zack Hames",
    "date": "2022-04-22",
    "content": "What are some cool “groove” / “body mover” percussion layers yall add to get a rhythm going harder? Like the classic tambourine or shaker in the chorus type thing but maybe a little different. Feeling a bit lost trying to get a track to groove harder.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "992428985466228828",
    "author": "Eric Martin",
    "date": "2022-07-01",
    "content": "We end up needing to notated lots of string parts for live players at shows so this will come in handy, that and midi doubling for that zimmer sound",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996074749618819202",
    "author": "Rollmottle",
    "date": "2022-07-11",
    "content": "Sounds like an Oberheim tbh. Either way, any brass pad from a Prophet, Juno, etc. will get you in the ball park.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996140577206841396",
    "author": "ALXCPH",
    "date": "2022-07-11",
    "content": "Im listening on my phone but all im hearing is a guitar and something like a lowpassed Juno maby? Try th me brass presets and lowpass them. Ill try headphones later its a bit Hard to hear when its so wide on my phone",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996928848803418152",
    "author": "Will Melones",
    "date": "2022-07-13",
    "content": "Certainly, I wouldn't recommend *just* a HDD backup, but it's good to have something immediately accessible with an additional cloud layer for emergencies. I've had more of those die than anything else, which has been where CrashPlan has saved my ass.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999391669935931502",
    "author": "ehutton21",
    "date": "2022-07-20",
    "content": "I feel like sound design is a wildly important process of production and mixing that gets overlooked. Most of my work is usually arrangement and sound design. Well at least the part I find that people really want my taste to be involved for. At some point, you can get a session player to play a part if you really need it played a certain way but knowing when to use it, when/how to build to that part, and how to shape a sound is a different set of skills.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000389456387391598",
    "author": "Zack Hames",
    "date": "2022-07-23",
    "content": "I composed/recorded a boy band track for an ad…it was only :30 so it was easy to do this, but we got everyone singing the lead lines as If they were the “lead singer” and we comped which singer we wanted for each line after. Then we had them do harmonies for all the lines as well (at least the lines we knew we wanted harmonies) \n\nThey were great enough singers they just did a bunch of harmony takes and it was super fast and easy to layer and edit. If the singers are good it’s honestly its super easy. \n\nSince it’s an actual group and not an ad, you might have to pre produce some of these concepts, who wants what “verses” as their lead section etc.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009911580147855360",
    "author": "Jeremy Klein",
    "date": "2022-08-18",
    "content": "I compose/mix a lot of library rock/metal music and I basically couldnt have that gig without superior drummer 3. \n\nFor it's variety of tones and realism I think it's the best out there. If you program with the predefined MIDI grooves as a base, you can get rock drums that sound _almost_ indistinguishable from the real thing. \n\nI've got a few of the SD expansions and honestly think the core library is still the best one.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020818854408106015",
    "author": "Daniel Ross",
    "date": "2022-09-17",
    "content": "I feel like groove is so subjective so we’re probably all wrong and all right to some degree…but I almost never let my bass be off grid. I always find the impact lessened when I do. Something about a lack of confidence in the low end makes me like the song less. There are exceptions but they are rare imo. And I hardly ever let the down beats of transitions be off grid too. I usually want the sections to be obvious. I also start with going behind the beat first. I have also recently in the last year or so found that if I start with getting the very basic part of the groove right first, I am less likely to overcrowd my production. So before I put hats in, I’ll just put in snare and kick and try and find the groove with just those 2 elements (unless there is some other clear rhythmic element at play) but I feel like if you can’t feel the groove with just the kick and (snare/clap/perc) then it’s not there.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1026974723172749372",
    "author": "Slow Hand",
    "date": "2022-10-04",
    "content": "@wilhelmjosephk Yeah. Sometimes sounds are such a fluke of using a particular processor in a certain way that you’d be lucky to reproduce it on another source or patch, even if you know how you got there originally (shoutout *Trash 2*).\n\nThat said, I believe I’m hearing three (maybe 4) layers that could very easily be overdubs, rather than played as a single patch:\n\n1. The dark, (relatively) clean, bass component.\n\n2. The midrangey portamento Prophet-type layer that’s most intelligible.\n\n2a. The blown-out grungy layer that could easily be Layer #2 slammed into a tape emulator with very skewed biasing.\n\n3. A 100% wet reverb/echo channel. It seems to mostly be fed by layer #2.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032260943335391282",
    "author": "isaac joel",
    "date": "2022-10-19",
    "content": "Best instruction manual ever. I laugh every time I read the section about drummers 💀",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033879647349395506",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "Went to play around with some hardware samplers today after not really being a sampler/drum pad kinda guy",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050475474675060827",
    "author": "Ross Fortune",
    "date": "2022-12-08",
    "content": "Has Logic’s drummer been mentioned yet? Maybe a no go since you’re in Ableton @oaklandmatt, but it’s very usable in lots of styles. Instant good presets, and the “producer kits” give you full access to mics (if you want to smash up a room etc). Having dynamics and “business” on an XY pad is pretty useful for knocking demos together, then you can convert those “drummer regions” to midi to tweak. Also the hi hats are usable, in a world where it’s still relatively difficult to program convincing 1/8 and 1/16 hat patterns",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051603079960731719",
    "author": "Slow Hand",
    "date": "2022-12-11",
    "content": "If you're concerned about being too suggestive to the players about their parts then strip back the demo until it contains only the most essential parts. No fancy stuff. Just chords, melody, and lyric. *Maybe* a kick drum pattern. Lead sheet style.\n\nIf the song is good then it will still be compelling. The best songs tend to be very robust and can be played a dozen different ways because they are fundamentally compelling. If the demo doesn't feel good this way then the song may need more work.\n\nLesser songs will depend on the arrangement or production to be compelling, or only work in a narrow band of styles. Sometimes a song can only work one way. It's okay if this is the case for your song, but then it's up to you to present the demo with the arrangement or elements that are essential to make the song compelling, and that will close off more and more of the instrumental possibilities.\n\nSo if you want to increase the chances of a session player delivering an unexpected, brilliant, idea then set them up for success with a strong song that can be interpreted many ways.\n\n----",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051632861150715975",
    "author": "Will Melones",
    "date": "2022-12-11",
    "content": "Oh no of course not. I was still just kind of thinking, the more money is on the line here, the more studio time costs, players, etc...we still have to get to that arrangement we were planning on at some point before we go home today. So you don't want to be in the position of applying extra pressure at the end of the session when everyone's tired, when you should have started there to begin with. That does just sound like being an effective producer.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053738529127145513",
    "author": "LAPhill",
    "date": "2022-12-17",
    "content": "I don't do the dry sound thing much, but what about Sunset Strings? Recorded at United, it's definitely got that record string sound. https://realitone.com/products/sunset-strings",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062080748917637130",
    "author": "THE44MOVEMENT",
    "date": "2023-01-09",
    "content": "I am doing a lot of what i would say is enhanced mixing lately. Mix + a lot of instrumental supplementation / layering. Vocal production/ candy etc. Its quite fun to get to the payoff a bit quicker.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080871190333247588",
    "author": "Deleted User",
    "date": "2023-03-02",
    "content": "1) Different tunings, Having clean vs processed, peaking at below -6, good velocity layers, round robin is good but not really necessary for me, I personally don’t need all mics separate but would like to have a separate room sample and the mixed sample as well.\n\n2) Yes please!! I hate it when samples peak at 0. I actually turn all of them down when I put them into a sampler to make it peak at -8 to -12\n\n3) small snippets of hihats or snare ghost notes and some tom loops. I’d probably prefer them mixed only\n\n4) for kits I think it is important. Round robin and velocity layers, and if you are doing rooms or separate mics having a kit makes an instantly playable and tweakable kit.\n\n5) I’m not sure. Anything between 44.1/16 and 48/24 should be fine! Anything beyond might be too much",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090006114449510491",
    "author": "LAPhill",
    "date": "2023-03-27",
    "content": "Read the EULA of the samples, but in most cases, it's totally fine to use samples and loops as long as you're not selling them on their own. As in, if you use a hi-hat loop in your track, you can't have a section that is JUST the hi-hat loop. That would also apply to delivering stems. Your \"percussion\" stem, for instance, should have other elements baked in with it.\n\nThat doesn't apply in all cases and there are certain samples out there that don't allow for sync use. I can't remember which ones offhand, but that's why it's worth checking the license agreement.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099735563218718890",
    "author": "stefanmacc",
    "date": "2023-04-23",
    "content": "Just off the top of my head it sounds like a choir pad on an Emulator. Depeche Mode used those a ton",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103392439827451924",
    "author": "Deleted User",
    "date": "2023-05-03",
    "content": "My understanding of lego music is when you have arrangement laid out on a DAW and it looks like blocks of things coming in and out",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103393719899664454",
    "author": "LAPhill",
    "date": "2023-05-03",
    "content": "I'm going to be honest then, I thought we were talking about lego music as being cobbled together from a bunch of overdubs/separate elements, vs. tracking together. Blocks of things coming in and out feels like.. arrangement?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108605583805911080",
    "author": "Deleted User",
    "date": "2023-05-17",
    "content": "You would have to load kontakt in multiple output mode to be able to mult it out. And then create channels in Kontakt’s mixer. I keep some multed kontakt instruments as presets so I won’t have to ever route things while making compositional/arrangement choices",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108805828535914637",
    "author": "Slow Hand",
    "date": "2023-05-18",
    "content": "It sounds like two layered basses to me: An electric for the deep stuff and an upright bass for the upper mids/highs and the string noise.\n\nThe string noises on the upright layer strongly make me suspect that it's a *Trilian* upright bass patch, and if it's not it sounds *very* similar to a few of the default patches.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119458631902048299",
    "author": "Slow Hand",
    "date": "2023-06-16",
    "content": "Yeah. A Spitfire horn library (no matter how gorgeous) is never gonna cut it when it comes time to play Punjabi music, or a James Brown record, or jazz.\n\nIt’s a constant source of frustration for me when sequencing horns. I always have to cheat it. \n\nIt’s no surprise that sampled libraries are going to lack expression but I think we really lose something in our music when we write *with* sample libraries out of necessity instead of going the extra mile to get players in the room who get it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119482439295848448",
    "author": "Slow Hand",
    "date": "2023-06-16",
    "content": "I'm reminded of Trey Spruance's directions to players when he only had one violinist to layer themselves to create a convincing string section. He'd give them roles to play so that the individual performances were different: \n\n\"Ok. Now pretend that you're second chair and you're pissed because you're not top chair, so you're gonna play *extra* hard to show off and prove you're actually the best.\" 😄 \n\n\"Ok. Now pretend that you're fourth chair and mildly hungover.\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123026404691415243",
    "author": "Zack Hames",
    "date": "2023-06-26",
    "content": "Might not be worth purchasing for this, but a program called Soundminer is really great for having a foley library that integrates with your DAW in a seamless way. Not sure if it works with Ableton though.\n\n\nDon’t be afraid to mangle sounds until they’re right. Don’t be afraid to record things yourself. Layers, layers, layers, layers.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142462055656456313",
    "author": "spectrummasters",
    "date": "2023-08-19",
    "content": "Actually , ill try messing with alterboy too ! Nice . It’s been ages since I used that plug in , might be cool to try it on bass as a weird layer 🤷🏼‍♂️",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150092642735095829",
    "author": "Eric Martin",
    "date": "2023-09-09",
    "content": "sometimes a lazy hit actually makes a section interesting in a way that editing it won’t",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171633167157960815",
    "author": "gatewoodsensei",
    "date": "2023-11-07",
    "content": "The symphony stuff, damage, analog dreams, and emotive strings off the top of my head. Sometimes the kontakt standard library gets usage when I’m layering string parts.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171636840172896327",
    "author": "Deleted User",
    "date": "2023-11-07",
    "content": "CineBrass\nBerlin Woodwind (I do not like them..)\nSession Horns/Strings\nLASS",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171794849104678953",
    "author": "Karim",
    "date": "2023-11-08",
    "content": "1) Valhalla Vintage\n2) Goodhertz Tupe\n3) Goodhertz Lossy\n4) Echoboy\n5) CLA-76 \n6) Imagiro autochroma\n7) Goodhertz Trem Control\n8) ProQ \n9) Archetype (Cory Wong)\n10) Pulsar Echorec\n\nShoutout Tupe “Craigslist Free Section”- the most fun I’ve ever had with a preset",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185100585679208498",
    "author": "Nomograph Mastering",
    "date": "2023-12-14",
    "content": "The drums were pivotal for me. The restraint. The sheer texture of the tones. It wasn’t a teenage fuck you, they were going to do it without us, regardless of what we thought or said",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185148080379662366",
    "author": "Deleted User",
    "date": "2023-12-15",
    "content": "https://youtu.be/0cmUQj3A_aM?si=1BiKf7NYYFBIzrm7\n\na lot of interesting ideas here. honestly I haven’t really layered anything besides rock snare drum in a minute",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187453865109508156",
    "author": "Slow Hand",
    "date": "2023-12-21",
    "content": "Depending on what era of Beach Boys you’re trying to channel, Van Dyke Parks would be a good detour. Check out his *Song Cycle* album for the orchestration and for the songs.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197071093786226718",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "And it just builds into a monster with clever layering and shuffles https://youtu.be/jzJ4cW4PmCQ?si=qPpFvQTHAMuNrQPa",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1215034554583359508",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-06",
    "content": "Haha yeah I think my brain straight up forgets what acoustic drums sound like without the omnipresent layered samples",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237784097334624348",
    "author": "montrose recording",
    "date": "2024-05-08",
    "content": "my buddy trey does strait ahead samples and is an arranger himself.  though ive never used his samples i believe there was care put into at least a brass pack that behaves more like a real ensemble",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237800007999160342",
    "author": "LAPhill",
    "date": "2024-05-08",
    "content": "There are a couple ways to think about this - do you want maximally realistic results with less control over the actual notes, or do you want to make it sound as good as possible while still maintaining compositional ownership? I pretty much always fall into the latter.\n\nAs long as you have a decent library with enough round robins, short string lines are one of the easiest things to make sound good. I haven't used BBCSO, but I know it's light on variations in exchange for having a full set of orchestral instruments and articulations at a budget price. Any of Spitfire's main libraries would be fine, or Cinematic Studio Strings, Orchestral Tools.. pretty much anything should do the job as long as it has enough round robins and hopefully at least 4 dynamic layers.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241764432808509460",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Also just to be clear, I don’t think splice loops are cheating, lazy, etc. I just think if you’re arranging splice loops and not changing anything, then it’s kinda whack that whoever made the loops isn’t getting anything from it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247577335780212861",
    "author": "Ross Fortune",
    "date": "2024-06-04",
    "content": "Definitely keep the lead separate. \n\nThink about how this artist might want to split things up. In most cases the doubles will want to be separate from the harmonies, but it depends on the arrangement. Sometimes big chorus harmonies don’t sound full without the doubles, for instance. But if you keep them separate they can choose what to keep and what to mute.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1251950955671322736",
    "author": "Slow Hand",
    "date": "2024-06-16",
    "content": "Yup. A pretty simple square wave will get you 90% of the way there. The demo Anthony posted also has a touch of bit reduction (start at 8 bit) that's bringing up the noise level and giving it that Casio / Speak N Spell texture. Maybe some sample reduction too to give you a little gritty aliasing. Hard to say cause I'm listening on laptop speakers right now.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1262445542219186310",
    "author": "spectrummasters",
    "date": "2024-07-15",
    "content": "Nexus moog patch plays one support role perfectly all the time for me . When I’m using my real moog for bass I’ll layer the nexus one quietly one octave up . Add a little stereo widener , sit it back in the mix …..let the real  mono moog do the low end lifting . Gabella 👌",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1272483249943478315",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-08-12",
    "content": "I always felt I got pretty perfect results with vocalign going section by section with Audiosuite, same with Revoice Pro. Sometimes you get some artifacts, but I'd just save the original take and splice in the glitchy word if needed. What settings are you using? I haven't used it in a hot minute and prefer Melodyne Studio multi-edit, perhaps it's gotten worse?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1273876019043897454",
    "author": "Slow Hand",
    "date": "2024-08-15",
    "content": "I mean, I'm ambidextrous when it comes to session vs. arrangement view at this point, and I love 'em both but I'm often surprised to meet long-time Ableton users who hardly know what session view is capable of because it's part of what makes Ableton so unique.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277691000155934731",
    "author": "Slow Hand",
    "date": "2024-08-26",
    "content": "Unless you really know what you want, writing and arranging *into* OTT from the beginning seems like a mistake because it will severely distort your ability to tell what moves you're making.\n\nYou're basically marrying yourself to the OTT sound up front if you start with it on, because If you try to dial it back later on in the process you're going to reveal all of the weird moves that you made to compensate for OTT's sound.\n\nIn general, I find OTT works best on individual instruments, and not on groups, except in extreme circumstances. If you want the OTT sound I'd advise you to apply it on individual tracks, rather than on your entire mix buss.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283577742809497612",
    "author": "chris_donlin",
    "date": "2024-09-11",
    "content": "I’m a huge duplicate playlist shortcut user in Protools when tracking. In an ideal scenario I’ll have most of a rough comp ready to playback after each section. If something stands out when we listen back, then we’ll listen to other takes. When I dive in to the production on my own time I might tweak a word or phrase but the rough comp tends to stay pretty close to the final",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1286447888284651542",
    "author": "Felix Byrne",
    "date": "2024-09-19",
    "content": "you kinda have to get lucky ish with string spacing for it to work perfect",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293336435780354058",
    "author": "Slow Hand",
    "date": "2024-10-08",
    "content": "Well the first thing that comes to mind is the middle section of *The Prophet’s Song* by Queen. \n\nIt’s Freddy singing a round with a whole note ping-pong echo, so it may not be a 1:1 match for what you’re seeking, but it should be plenty inspiring.\n\nStarts @ 3:22.\nhttps://open.spotify.com/track/1Ji1gZtpgMBepbNpyiLfgv?si=NPoEe376RNmMcSwJ_FvwhQ",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304896386667380786",
    "author": "cy (sigh)",
    "date": "2024-11-09",
    "content": "been playing  w stacks a lot fora few songs recently and often think of them as a chord arrangements. might even play it in on a piano for reference if I can't figure it out in my head. \n\nyou can often control density with the spacing of the harmonies - both in pitch and positioning in the track. \n\nusing different types of distortion on similar takes to bring in different /contrasting textures. \n\nbig stacks can take well to  really agressive EQ depending on how natural you need them.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312974549788266566",
    "author": "Felix Byrne",
    "date": "2024-12-01",
    "content": "reminds me of a string technique for layering with string trios and stuff\nset up all 30 chairs and the decca tree or whatever\n\nthen make each player move chairs for each take",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313313611401265243",
    "author": "Slow Hand",
    "date": "2024-12-02",
    "content": "Yeah. That hash-y texture seems consistent among a lot of neural net audio renderings. Though the recent Suno stuff I've heard sounds like a big improvement.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318435829408075798",
    "author": "Slow Hand",
    "date": "2024-12-16",
    "content": "And that recap performance of all the layers at the end...",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1319388958005923971",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-19",
    "content": "Awesome! It seems he heard people were using it this way, because there was a pretty recent update to Valhalla Room that adds a \"Space\" knob in the early reflections section that you can crank for great tight spaces",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1323729693903421532",
    "author": "Brian Reynolds",
    "date": "2024-12-31",
    "content": "I would grow into eventually doing everything above. But my impulse would be on the first one to stay true to original presentation that's already loved. Add some doubled Acoustics at points. Maybe a light pad or piano under parts. Then just vibe and grow from there. The guiding north star being where the artist is excited by",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328819956850229258",
    "author": "Slow Hand",
    "date": "2025-01-14",
    "content": "I like NI’s *Session Horns* for a pop horn section. Good selection of horns and articulations with an easy interface.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1333022892799295558",
    "author": "itamaramati",
    "date": "2025-01-26",
    "content": "Primaries sounds phenomenal! Thanks for recommending. I'm always inspired by wave alchemy revolution, always fun sequencing og drum machines and their effects section is really fun for experimenting and mainly sounds bonkers.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337602493865005096",
    "author": "montrose recording",
    "date": "2025-02-07",
    "content": "started raw and quickly cut out the weirdest ones.  it really ended up being like a developmental layer",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360293824605323424",
    "author": "jonmatteson",
    "date": "2025-04-11",
    "content": "Addictive drums is pretty good for this. You can layer electric sounds on kick and snare and mix them in to taste and play them in real time via midi",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386817489652027462",
    "author": "Gabriel Tyranny",
    "date": "2025-06-23",
    "content": "@Matthew The Cooke🎄🎅🏻 @cian riordan - I decided to add one more thing to hopefully clear this up. \n\nFocusing on vocal panning, I  have the music go down while the lead performs what’s about to be panned around with the intention of having it be easier to perceive after it’s panned and buried, proactively trying to train the listeners ear to understand the BGs in the section that follows without them having to focus their mental energy there, since the bridge before gave their brain enough dots to connect what’s being said on the sides while still able to focus on the middle.\n\nThat’s my intention at least, and I liked the outcome, and at the very least I hope me bringing this up spurs more thoughts around panning.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1389074169810915338",
    "author": "Will Melones",
    "date": "2025-06-29",
    "content": "Maybe with the Groovecell plugin? I'm not sure, I've never actually used it.\n\nI love Sitala for how dirt simple it is. It used to be free and it's so convenient that I paid anyway.\n\nhttps://decomposer.de/sitala/",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397687370383364287",
    "author": "Slow Hand",
    "date": "2025-07-23",
    "content": "Sounds like a vibe! I would embrace the tempo shifts. To map out the tempo in your DAW I would do the following steps:\n\n1. Identify the steady starting tempo at the beginning of each section (intro, verse, chorus) and get them aligned to a steady tempo as best you can.\n\n2.  Then start working out the tempo ramps between each section (start of Verse 1 to the start of Chorus 1) and keep an eye on how well the waveform is aligning with the grid as you adjust the tempo automation. You may have to curve the automation gently to match the shape of their automation ramp.\n\n3. RInse and repeat for each additional section until you have a completed tempo map for the entire song.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410615667253841920",
    "author": "Adam Thein",
    "date": "2025-08-28",
    "content": "More hooks/alternate hook, cut the section if the song doesn’t need it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1432523493567889428",
    "author": "Will Trotman",
    "date": "2025-10-27",
    "content": "Not sure how to ask this question concisely, but would love thoughts on this. I’m working with an artist who’s an awesome singer, but doesn’t have much experience recording, arranging, etc. Has lots of ideas for parts / song arrangements that have lived in his head for a while but dont make sense or feel awkward to me when we try them out - he seems pretty glued to some of them. For context, we’re doing two songs, and one seems to be coming together pretty easily, and the other is the tough one. Been trying to give all their ideas a shot thinking they’ll either work or it’ll be obvious that it’s not the one (which usually leads to a unanimous decision), but he’s concluded that a lot of these ideas will work “once more stuff is in the track.” Curious how to steer us in (what I believe is) a more viable direction in a non domineering way. ALSO want to do my best to serve their vision. Only have him in town through Wednesday as well so feeling some sense of urgency to establish the general arrangements before he’s gone.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434938128086335631",
    "author": "Will Trotman",
    "date": "2025-11-03",
    "content": "Love this thought and hear that completely. So funny enough, within the day or two after my original message, everybody was stoked about where we landed. And to your point about being patient, I think all we needed was a little more time to try stuff out and get on the same page. A good reminder not to sweat it too hard if I leave a session worried about the current state of the music. Putting it down for the evening and coming back with fresh ears does wonders. (Also should note that \"arrangement decisions\" was a massive oversimplification of the questions we were trying to answer lol).\n\nApologies if this turns into a novel, but would love to share some takeaways. I think the north star point you made is super important and well put. I think the artist I was working with got more comfortable trying new ideas the more he realized we were both aiming at the same thing (just approaching it differently). He's also only recorded / released one song before (and doesn't have much prior experience collaborating), so I totally understand the fear of things sounding different than he imagined. That's not a knock on the artist at all - I say that matter of factly and it's where everybody starts.\n\n@NoahNeedleman made an analogy about being a \"doctor vs a doula\" which I found super insightful. I think I was afraid that trying to be a \"doctor\" at all was somehow inherently an ego move or underestimating the artist's instincts. Ended up concluding that the project required a little bit of both, and that it's 100% okay and helpful to know where my experience could help us reach the artist's intention. I think interpreting the artist's intention is so much of the job, and if they don't yet have the tools or experience, that may push our job a little more to the doctoring side. There was definitely still some doulaing of course.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470171477633405019",
    "author": "Ross Fortune",
    "date": "2026-02-08",
    "content": "But what a string part it’s going to be",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937641215086718986",
    "author": "Maxim",
    "date": "2022-01-31",
    "content": "I can confirm Noire sounds veeery nice. The plugin doesn’t capture the atmosphere of being in the room at Funkhaus 100% but you can still get some really “felt” tones out of it. Especially if you’re looking for a more organic and thick texture. Couldn’t see myself use it much in a standard production setting though. But other NI pianos are fine for that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "939504650615414845",
    "author": "Maxim",
    "date": "2022-02-05",
    "content": "Try layering some pitched TR 808 sounds with Timbaland-esque vocal samples/beatboxing. Throw an acoustic kick underneath and find a rimshot that has the character you like and play with Valhallavintageverb or Tsar. Maybe download some free Reddit sample packs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941047275113812049",
    "author": "Zakhiggins",
    "date": "2022-02-09",
    "content": "Any production tips for making programmed drums sound more full? How do yall be layering things",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941090065499684904",
    "author": "cy (sigh)",
    "date": "2022-02-09",
    "content": "Great tip. also find that bringing higher or lower pitch elements in and out at different sections of the track can help make things denser and/or bigger without being overwhelming",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941099860294250546",
    "author": "Maxim",
    "date": "2022-02-09",
    "content": "Sounds like you’re looking for density without it being cluttered or overproduced. \n\nUsually “noise” (not literally but parts of the groove that you mainly feel but don’t make out specifically like you would a kick and snare or hi hat) serves this purpose for me. Elements which if muted would leave you feeling like something is missing but you can’t necessarily make them out when in. \n\nI guess this could be anything from a few percussion loops (maybe panned/verb with no pre-delay or less high end to place them at the back of the mix) to a subtle vocal or foley sample playing one note throughout the groove. \n\nLayering to me is part of this but my intent with it is usually to create a sound or get more out of an element (like layering the attack of a snap with a clap for a different transient / texture). But this doesn’t always add to “fullness” in my mind. It just makes one element better or more interesting. \n\nMaybe start with the loops and foley. Splice Bridge makes testing things really easy too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941100467667230731",
    "author": "Maxim",
    "date": "2022-02-09",
    "content": "That mostly depends on the rest of the arrangement as well though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "956822374169325628",
    "author": "Keegan",
    "date": "2022-03-25",
    "content": "Hey, what do **you **consider to be the difference between a song with 'good' production vs. one with 'bad' production? Recently I realized that the term \"production\" gets used in a lot of different ways. I used to think everybody meant more or the less what I consider production to be: the recording or engineering of the sounds in the song (so, sound design too), the layering or vertical arrangement of instruments and sounds, and (to a lesser degree) the way those sounds are balanced/mixed to fit together. What made me reconsider this definition was hearing a handful of reviews for the new Charli XCX album criticize the \"production\" on songs like this one:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "956864888444170270",
    "author": "sukhuno",
    "date": "2022-03-25",
    "content": "Imo production is all of the choices made before the song goes to the mixer - so all of the instrumentation, arrangement, sound design, etc. I personally wouldn’t expect a mixer to make those choices, simply to enhance the ones that are there already.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957112407149408308",
    "author": "chloe corley",
    "date": "2022-03-25",
    "content": "im in no way professional but i think of “production” in modern (pop) contexts to be arrangement, instrumental composition, sound design (real or synthetic), even the more artistic engineering decisions maybe. im a big fan of charli’s production (melodies, sound design, and arrangement specifically) but this new album just felt rly cluttered on a lot of the songs, so the arrangement felt a bit lacking (or maybe too overbearing is a better word)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957406342690250793",
    "author": "David Fuller",
    "date": "2022-03-26",
    "content": "Bands that get by with wowing via arrangement tend to not have much staying power",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957423491152494672",
    "author": "KushKadett",
    "date": "2022-03-26",
    "content": "Isn’t arrangement part of song writing?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957452894704119908",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "While every song has an arrangement, the arrangement is not the song.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957453017219739651",
    "author": "Slow Hand",
    "date": "2022-03-26",
    "content": "The arrangement is the choice of tempo, dynamics, instrument choice, density, and timbre.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957476380210237501",
    "author": "KushKadett",
    "date": "2022-03-26",
    "content": "ah i always thought of arrangement (in the non classical sense) as the song structuring - when do you introduce melody, shifts, themes and changes into sections in the timeline. That's why I was confused because to me arrangement IS a large part of the song. I always assumed most people nowadays don't mean classical arrangement when they use that word, or do they?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "962452775130779658",
    "author": "shinyisshiny",
    "date": "2022-04-09",
    "content": "ive often heard that you have to align kicks snares etc when layering so that their phase looks the same , is this true at all? supposedly it will be more punchy? or does it not really matter and if it sounds good it sounds good 🤷‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982395666871513119",
    "author": "ehutton21",
    "date": "2022-06-03",
    "content": "pretty sure there’s a bit of layering going on in “know no better”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982395748329086976",
    "author": "longstoryshort",
    "date": "2022-06-03",
    "content": "for sure, both have layering no doubt.  i think with an FM bass in the j lo song",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982396495795998720",
    "author": "ehutton21",
    "date": "2022-06-03",
    "content": "feels like there’s a filter later on in the plucks that disappears, and it sounds like the piano at the intro takes some of the chords in the loop. would say if you’re having trouble with marimba sounds that don’t sound perfect a piano/organ layer is usually gonna round out the low mids in a way that feels like",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984261380456742963",
    "author": "ehutton21",
    "date": "2022-06-08",
    "content": "anyone who uses/mixes a lot of saw/synth basslines. do you often find the sub bass region really lacking in those sounds, and if so are you layering in your own sub element to round out the overall arrangement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984311208033284106",
    "author": "Deleted User",
    "date": "2022-06-08",
    "content": "i haven’t heard the music but yeah, low end needs to be sculpted from the arrangement- sometimes I get confused on which one to favor when I arrange without thinking about it and end up having to redo the kick and bass",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987475418711990282",
    "author": "Jeremy Klein",
    "date": "2022-06-17",
    "content": "rest of the production is trap drums and 808 which is just hard to layer real drums even if they are recorded great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987476116170244137",
    "author": "ehutton21",
    "date": "2022-06-17",
    "content": "Ahhhhh yes. Okay, so maybe blow these drums up and distort a lot and see what you find in the mix. Sounds like these drums are pretty much band passed. Maybe you can try layering in your own samples but that’s usually some thing I do if I’ve been told I’ve got a green light to add production. Usually though, you can always save two copies and if what you do is dope, the people come around to it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987477438592344094",
    "author": "ehutton21",
    "date": "2022-06-17",
    "content": "For samples of you add your own you can try and layer in that really thin kick as a top layer if it doesn’t fuck up the phase",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "992156435632890007",
    "author": "Eric Martin",
    "date": "2022-06-30",
    "content": "OMG I’m just discovering audio to MIDI and it’s going to change my wife’s violin orchestrating life.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993888385007620216",
    "author": "Zack Hames",
    "date": "2022-07-05",
    "content": "You may know this already but I think a disco section had only violins - that may help you get closer in it of itself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993888832032362618",
    "author": "delwin",
    "date": "2022-07-05",
    "content": "@Shadowherb both, kinda. I'm doing pretty well with most of the instruments tone wise / mix wise. but the strings and horns are tricky. If I had more time / budget, I'd layer in a real trumpet/sax or real violin on top of the samples, but this is a quick & dirty job 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993891110072090645",
    "author": "Shadowherb",
    "date": "2022-07-05",
    "content": "^arrangement-wise I hear the horns & strings occupying two distinct registral spaces. just trombones/bass-trombones for horns and just violins for strings",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998797383745949906",
    "author": "1ggy",
    "date": "2022-07-18",
    "content": "Yep I use CLA bass too but end up having to layer with a bunch of other stuff. Basically what I’m trying to get to is the sound of the scarbee rickenbacker kontakt library sound. Haven’t been able to crack that with ITB tools.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999049300686426325",
    "author": "Deleted User",
    "date": "2022-07-19",
    "content": "And @Slow Hand is absolutely right about flatwounds. It’s really just smart arrangement. I personally don’t want much happening in my Bass above 1500k",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999375104083497012",
    "author": "cy (sigh)",
    "date": "2022-07-20",
    "content": "I seperate the sessions in my case. I won't mind doing a quick vocal rough in the same session but if we're working on on vocal arrangements or cutting the final vocals I'll do it ina clean session. I'll also do all my cleaning and editing there. Once it's ready I'd move it toa mix session.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000721212823048203",
    "author": "prodbyobseen",
    "date": "2022-07-24",
    "content": "Mate! Amazing advice thank you. I actually feel all of this, just working on a couple pitch tracks for the label right now but wanted to ask in preparation as it’s a label priority so want to absolutely nail it when it comes off.\nI also managed to go see a show last night which was actually helpful, took some notes one who excelled at which’s sections and they are already broken into SATB so that helps with that too!\n\nMight have to set up the Nintendo and get the mariokart rolling for this one, thanks so much for the advice! I’ll let you guys know how it goes! Thanks 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009126455113961603",
    "author": "Adam Thein",
    "date": "2022-08-16",
    "content": "In Ableton Live I’ll usually do whatever I need to do with Melodyne then immediately flatten it back to audio so I can do things like clip gain or timing.  The more I’ve used Melodyne the less I like the workflow of transferring into the plugin.  For heavy editing I’ll use an ARA enabled daw like Studio One or Reaper or the standalone Melodyne app.  For small corrections I’ll transfer into that one section and then freeze and flatten right away so I’m back working with audio.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012150259905986672",
    "author": "ehutton21",
    "date": "2022-08-24",
    "content": "Vocalign is really essential to my work flow because of how many harmonies i get from clients & collaborators. I also create doubles with it a lot & use melodyne/alterboy to enhance the texture. \n\nAs far as editing groove/timing, that’s hard cause I always cut that stuff until it feels right. Most of the time I’m gettin tracks where the artist or the producer or whoever (lots of times it’s the same person) has already agonized over the timing and cut it up so it’s solid. I’m mindful of words where the first syllable is cacophony or plosive-based (k, t, d) when it comes to sounds that hit on the quarter note (esp with snares). I usually let those sounds start just before the transient and end so that vowel is starting right on the note, depending on how it’s quantized if that makes sense. \n\nFeel like groove editing gets a weird wrap but i here songs where the timing could have used aligning after the amount of compression that got applied.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014589771307286569",
    "author": "Will Melones",
    "date": "2022-08-31",
    "content": "Yeah that’s definitely the sound for that genre. Incredibly powerful and consistent. But it feels different when you’re talking about a band that probably sat in a room, wrote, rehearsed, developed arrangements…and then those drums usually at least strive to sound convincing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020824609920135178",
    "author": "cy (sigh)",
    "date": "2022-09-17",
    "content": "yeah its very case by case. as far as groove in relation to other elements. I've had guitars recorded loosely toa click and worked the groove around that - lining up the downbeats of the drums/bass  with the guitars even if it's a bit early or late. that was for a more indie type of joint. and for something more trap /modern hip hop, I've nudged bass notes or samples to get them to either sync w drums up for impact  or nudge slightly off to hype of of pull back the energy in the groove. \n\nas far as programming. I'll play with forward swing and dragging notes a lot if I'm going for a more real/dynamic feel when programming. keeping in mind that if the goal is trying to stay \"on time\" any fwd swing that might happen at the start of a phrase will be compensated with some drag  after or vice versa.  keeping velocities in mind w drum hits + linking it to a filter env so that harder hits have more high end and softer hits end up a bit rounder.\n\nadding subtle layers that are similar   to the main drums but occupy a different texture or tone  in dif  sections to thicken up the groove or automate the attack /sustain of certain elements thru diff sections to help shift the listener  focus throughout",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020825030868877412",
    "author": "cy (sigh)",
    "date": "2022-09-17",
    "content": "also if using an 808 switching up the length of the sustain in diff sections can shift the groove a lot without needing to change up top much in the actual drums. especially if you've got parallel compression going between kick and subs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1026975302989140028",
    "author": "Slow Hand",
    "date": "2022-10-04",
    "content": "Also, all of these layers feel pretty congealed and reactive to each other, so it's possible that they're bussed together and have some group processing going on, like a bit of compression.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1027267146184659014",
    "author": "delwin",
    "date": "2022-10-05",
    "content": "@Slow Hand @wilhelmjosephk Thanks for the insight and tips! Yes, I do a lot of \"arriving\" at sounds as well, often can't explain to people how I got there. (I have a little modular synth that I set up for that entire purpose). \n\nBut it's specifically these kind of textured, expansive pad sounds that I have trouble making! I've heard this type of sound a lot in techno & ambient music (Leon Vynehall has some great pads as well) and they are so complex but controlled within tight parameters — like a huge amount of chaos squeezed into a very small space.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1027269453660037251",
    "author": "delwin",
    "date": "2022-10-05",
    "content": "It's the sharper, percussive, SOPHIE-esque sounds are easier for me to arrive at with the modular experiments, so I've been studying my pad sound design recently 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030942362299539577",
    "author": "satishkumar.26c",
    "date": "2022-10-15",
    "content": "The Grammy says this their folder arrangement standard : too complicated …how do u y’all arrange ur folders",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1030945651204309024",
    "author": "GaspardMurph",
    "date": "2022-10-15",
    "content": "I should screenshot the folder arrangement for deliverables on Universal Music contracts, it’s pretty funny",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031605520269836400",
    "author": "Johnny I",
    "date": "2022-10-17",
    "content": "Recommendations for a piano sample library for a convincible grand piano that works in a sparse vocal/piano arrangement? Kontakt, or Keyscape? I have access to a real baby grand at a friends house, but it needs some repair (some mechanical noises) and tuning and not sure if it’s worth the hassle.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033954712308957194",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "I am curious about an MPC. I had an akai base level drum pad but honestly the latency and usability of it wasn’t at all what I wanted",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035109669414391888",
    "author": "louisvie",
    "date": "2022-10-27",
    "content": "the song and arrangement call for this and already has some of it but i want to exaggerate it a lot",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035416279399538698",
    "author": "Slow Hand",
    "date": "2022-10-27",
    "content": "Ok, so this is going to be an unusual request: \n\nDoes anyone know of a program that will allow me to erase parts of an audio file's spectrogram (call it *Audio A*) and then combine it with another audio file (*Audio B*) such that the only parts that I hear of *Audio B* are in place of the frequencies that I erased from *Audio A*?\n\nThink of it like working in Photoshop where you have layers. You can cut a hole in Photo Layer A and then place a second photo layer (B) underneath so that you see Photo B peeking through the hole that you cut in layer A.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035420003144577144",
    "author": "Nomograph Mastering",
    "date": "2022-10-27",
    "content": "Works using the layers paradigm as you describe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050129655392370779",
    "author": "Deleted User",
    "date": "2022-12-07",
    "content": "That sound is on more processed side, but acoustic drum workshop has pretty organic sound (probably still processed) with 3 velocity layers and snare rolls. They also tell you the drum sizes so I find it pretty useful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050519938382700544",
    "author": "Deleted User",
    "date": "2022-12-08",
    "content": "the round robin and velocity layers help a lot with hats and cymbals.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051635038644609044",
    "author": "popaganda.",
    "date": "2022-12-11",
    "content": "I agree with much of what you’ve said, but with the caveat that sometimes it flows and sometimes it just doesn’t. Making a record is sometimes craft and sometimes art. lots of times a good song, good arrangement, good performances, great mix don’t actually add up to a great record. Sometimes it works backwards and the little accidental thing played by the tuba player you hired for a session sparks a vibe that it’s worth scrapping everything else for. Sometimes we all have to be wandering lost in the wilderness together….and that doesn’t really align with the constraints of hiring someone or renting space etc. but sometimes you just have to go into the abyss to find something special.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053731947865710623",
    "author": "Adam Thein",
    "date": "2022-12-17",
    "content": "Alright all, I'm looking for an upgrade for dry strings beyond NI Session Strings - what's everyone using for small sections in their productions when there's not a budget for real players these days?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053738018760044576",
    "author": "Adam Thein",
    "date": "2022-12-17",
    "content": "Yeah I'm looking for something that can just sit in a pocket in a mix with a lot of other things going on.  Session strings has been the go to for this for a long time but I just spot the fakeness a mile away now.\n\nWith spitfire Chamber can you split it out into sections of each instrument if you want to get real nerdy on it?  Or is it kind of an all-in-one patch?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053739095848915116",
    "author": "Adam Thein",
    "date": "2022-12-17",
    "content": "yeah i'm usually just doing a legato pad type thing, small section",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054834941088763954",
    "author": "youngteam",
    "date": "2022-12-20",
    "content": "Yup same experience here. I found a lot of string libraries cater to big Hollywood sound, Hans Zimmer stuff whereas I want dryness and string quartets. LASS is great at this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055272667479035955",
    "author": "Slow Hand",
    "date": "2022-12-21",
    "content": "Oh that's a great feature of *Serum*. You can really layer up the voices *super* thick *and* you can control the tuning spread between them all for some cool converging tone moves, ala the THX sound. Great feature.\n\nUnfortunately I haven't found a workaround for Massive X. It's unison section is definitely weak by comparison. But it does that cool tonal/chord unison feature. I just never use it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055319469225934899",
    "author": "Slow Hand",
    "date": "2022-12-21",
    "content": "Ahhh gotcha. That's a cool goal.\n\nSo it sounds like part of what you're seeking are techniques to add pitched resonance to samples that may be atonal?\n\nWell a resonator is a great start. If you're not already into it, I'd look into the karplus-strong theorem and physical modeling synthesis. That whole field has a lot of overlap with what you're describing. It's the kind of thing you'd hear Sophie or Jimmy Edgar do with their Elektron Monomachine.\n\n*AAS* have a whole suite of physical modeling products that function similar to *resonator*, but are third-party plugins. Doing percussion synthesis with *Chromaphone* can do a pretty convincing recreation of certain percussion tones with the added bonus of being as flexible as a synthesizer, because it is a synthesizer!\n\nYou could tune a high-feedback delay unit until it rings at the pitch you're seeking. I can elaborate if you need more explanation. Funnily, that's the entire basis for physical modeling synthesizers.\n\nAlternately, you could layer your samples with gently-blended sine tones. That's worth a try too. I know a lot of EDM producers are into this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055323064612696134",
    "author": "austenballard",
    "date": "2022-12-21",
    "content": "the reason i like using resonator specifically is because it uses the spectral content of what's already in the sample rather than layering another tone over the sample, which i have experimented with. i guess i'm mainly wondering if anybody else has done anything like this and knows of a quick and dirty way to do it in PT, Logic or other DAWs that don't have the same sound design capabilities as Ableton",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055332443000950794",
    "author": "Slow Hand",
    "date": "2022-12-21",
    "content": "I still think layering your perc sounds with a synth patch is gonna give the most control. You've got perfect control over pitch, release, waveshape, and you can do wacky shit like pitch modulations if the mood strikes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055340811706970213",
    "author": "Deleted User",
    "date": "2022-12-21",
    "content": "All of these methods suggested will yield in different results. \n\nResonators are made from delay using feedback to create tones. So you may need to resample to kill sustains - or not if you want it to have lengthiness. If you are going for SOPHIE kind of sound then you'd probably keep the feedback. \n\nBooms (filter resonance) are similar mechanisms but less tonal unless you turn up the feedback a lot more - it will certainly be more natural sounding as opposed to comb-filtery sound. \n\nLayering will give more focused pitch while maintaining the integrity of the layered sample sound, you would probably have the most control this way. \n\nVocoder will have inherently baked sound because of the synthesis mechanism, it can be desirable or not depending on the scenario. \n\nWith sampler looping, you will get grainier tail - dialing in the decay is necessary if you want the sound to be percussive because it will just continue sustaining. You can create pads this way too!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1056544156866072656",
    "author": "Ross Fortune",
    "date": "2022-12-25",
    "content": "On the 3-4 patches: what are they? I’m imagining one attacky bass, a pad that works in lower/mid/upper registers, a good playable poly keys patch with enough editable character to slot into different tracks… \n\nPresumably you find they cover enough bases, but I’d be wondering if having such a limited palette would narrow the variety of what I’m going to come out with. Often times it’s flipping through presets and finding something very unique sounding that will inspire a part that inspires a track for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062028931525517443",
    "author": "Deleted User",
    "date": "2023-01-09",
    "content": "anything with velocity layer helps! I’ve seen some folks buy a hihat and getting good results recording them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062042031796535406",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "Oh I’m talking about any part of the drum sound, not a whole kit just looped. 😅 could be a hihat, a ride, cowbell, or any other thing that’s part of the drum section",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062436187182223371",
    "author": "Will Melones",
    "date": "2023-01-10",
    "content": "Oh I don’t fault anyone and I don’t think egos really got involved, it was mostly a situation of changing a small variable that threw the composer for a loop. And the more experienced engineer knew how to minimize conflict and protect the vibe. My drummer friend LOVES it when I throw on the marimba click, because some other clicks are too “wide” (temporally). Just a funny anecdote about marimba 2.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069005017345957988",
    "author": "Slow Hand",
    "date": "2023-01-28",
    "content": "I've always wondered about a move that they pull in this Murray Head song. During the chorus @ 1:08-1:30 there's this effect where all of the depth gets sucked out of the track and it becomes super present. What is that? As far as I can tell they're muting the string pad and guitar, but it also sounds like they might be muting all of the effects returns so that it dries up.\n\nhttps://open.spotify.com/track/6erBowZaW6Ur3vNOWhS2zM?si=cd755dcd108f4583",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076926459983188099",
    "author": "austenballard",
    "date": "2023-02-19",
    "content": "I think one of the Ableton modes ostensibly works this way. Tones or Texture IIRC. But it's not as accurate as doing it by hand.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076928002685943828",
    "author": "austenballard",
    "date": "2023-02-19",
    "content": "paging @Slow Hand who I know did a bunch of testing on the warp modes a while back\n\nI haven't used them for vowels because either I do it by hand or I get lazy and just chop around the consants and turn on Complex Pro (with HiQ off, which should really be called LoQ IMO)\n\nBut it works great on drum samples, especially if you're pitching them around. I think it's texture now that I'm thinking back on it but I haven't really used Ableton for a few months now",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077624400058273793",
    "author": "austenballard",
    "date": "2023-02-21",
    "content": "There's also this from the \"Audio Fact Sheet\" section of the manual, which says exactly which resampling algorithm(s) have been licensed",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1084203392571809882",
    "author": "austenballard",
    "date": "2023-03-11",
    "content": "so e.g. pick one section leader for S/A/T/B each to have headphones and then a conductor with phones and you should be good to go",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087097045036322827",
    "author": "Deleted User",
    "date": "2023-03-19",
    "content": "The rubbery spongy texture on synth feels like prophet though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092236871742017656",
    "author": "Slow Hand",
    "date": "2023-04-02",
    "content": "This presentation by Trevor Horn just released in which he describes his strategies for vocal recording. It's full of great practical advice without fixating on the technical considerations. He really took the time to craft a good presentation, which is refreshing for someone at his level of accomplishment. There's loads of great advice in here: https://www.youtube.com/watch?v=EdVyHNVUy_s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092590592929824859",
    "author": "LAPhill",
    "date": "2023-04-03",
    "content": "@NoahNeedleman Basically, wondering where people source their 808s from, or what they use to design them. I've made my own in the past, but I don't live in a world that they're a regular thing and wasn't sure what the legit producers in the space use. I'm just a composer trying to be cooler than I am.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596515429683210",
    "author": "cy (sigh)",
    "date": "2023-04-03",
    "content": "I have some modified spinz 808s, a handful I made from scratch when I got to play at my friend's studio and a handful of random I've accumulated over time. aside from that I'll use a basic sinewave oscillator and choose the saturation depending my goal, layer any samples I need to texture/clicks. \n\nalso go through finished songs every few months and just keep the ones I really like.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596754400165968",
    "author": "cy (sigh)",
    "date": "2023-04-03",
    "content": "synth for the sustain/control and  sample for texture /tone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099720552010235984",
    "author": "Josh Bowman",
    "date": "2023-04-23",
    "content": "Heyyy random question, but any 80s synth nerds in here? I’m trying to re create this intro pad verbatim and having trouble finding the sound. Any leads would be super helpful!! Song was from 88. https://open.spotify.com/track/48p5E25cFPanxuwCTmTpuL?si=yR3_jPPxSqC9gxZedxTzHw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103368502271803423",
    "author": "Ross Fortune",
    "date": "2023-05-03",
    "content": "Is a rhythm section playing 12 bar blues like a pub landlord setting out tables and comfie chairs, getting the ambience right, serving a few drinks to get two friends in the mood for a chat?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103396299107221634",
    "author": "Deleted User",
    "date": "2023-05-03",
    "content": "Sounds like I misunderstood the context. I understood it as 4 piece band arrangement vs resource-non-limited arrangement which often varies the intensity by instruments coming in and out vs what the part is doing. It’s not whether it is one or the other, but where the base is. But I see what we are talking about now haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103397569968734309",
    "author": "Deleted User",
    "date": "2023-05-03",
    "content": "Still, you can do a whole lot with just 4. But if we’re arranging a pop song, then probably may not be the first move",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105075325790064680",
    "author": "Maxim",
    "date": "2023-05-08",
    "content": "Also on true pianos (which is that great crappy piano sound on almost all old Avicii songs btw) max out the ‘keyboard dynamics’ section to really get that upfront vibe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108498716614213723",
    "author": "BatMeckley",
    "date": "2023-05-17",
    "content": "I do this all the time to record banjo. Have a six string deering, and then I record it like a clod at half speed and at full speed it not only sounds more banjo-y but also I sound like I know what I’m doing ish.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108611439503093840",
    "author": "Deleted User",
    "date": "2023-05-17",
    "content": "What’s on those spreadsheets? Are they different “moments” in the game that call for different arrangement?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108612895920627773",
    "author": "NoahNeedleman",
    "date": "2023-05-17",
    "content": "A stable boy 🙌🏻 I was there to “teach” one of the composers about songwriting once. That place is a marvel.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108789252222898186",
    "author": "JakeTB",
    "date": "2023-05-18",
    "content": "I'm not 100% sure but I think it's another layer. Around 1:16 there's a particularly exposed higher note that seems to have a slight flam between layers. Banger track",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108806202936262666",
    "author": "Slow Hand",
    "date": "2023-05-18",
    "content": "It's conceivable that this is played live, but if it *was* you could recreate this exact patch very quickly using *Trilian*. The voicing and attack of these bass layers scream *Trilian* to me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108810108210786315",
    "author": "Slow Hand",
    "date": "2023-05-18",
    "content": "The more I listen the more I'm questioning whether it was sequenced or not. Getting the string sounds working rhythmically would be a little tedious, but doable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108838325088956578",
    "author": "Adam Thein",
    "date": "2023-05-18",
    "content": "The stuff on the left that sort of sounds like a guitar sounds like string noise to me - like it was played on a short scale with rounds and the low end is ultra crazy rolled off and compressed to hell and run through a pretty stable chorus like a dimension D type thing (pulls right slightly to me) and then the stuff high end is through an auto-wah that is chorused out in the opposite way, but the slides in those little moments where you can hear them seem too perfectly tracked against the low end to be a double to me, and it sounds like bass-octave stuff but the harmonics of it to me rather than a separate guitar layer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114514120708993124",
    "author": "Edward Rivera",
    "date": "2023-06-03",
    "content": "The 808s and hi hats are here to stay. But the general vibe of trap today (triplet vocals) has rung itself out and I think someone will take those textures to make new styles and then that's what we'll be vibing on for a while. Even rubber band man (deep cut !) doesn't bear resemblance to the mumble rap that came after it, and mumbling came out of fashion before the pandemic. Hip hops not dying, it'll be around forever I hope, but it's gonna change",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114667409748545647",
    "author": "Slow Hand",
    "date": "2023-06-03",
    "content": "*Naaaaaaaah* that ain't it. 😉 \n\nI want to splice things together. I want to Dr. Moreau that shit.\n\n\"*Behold!* A song with the delicacy and grace of a Ravel string quartet and the ugly horse-face of a gabber record.\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1115767052989370498",
    "author": "chrissorem",
    "date": "2023-06-06",
    "content": "I guess so , someone asked if I could do the prismizer effect  and I had never heard of that… to my ear it sounds like a layer of harmonizers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1118966898730729532",
    "author": "Rollmottle",
    "date": "2023-06-15",
    "content": "yes. first cuts too abruptly...but in context layered with other shit, not sure it matters. on its own though, i like the 2nd one.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119388243012620440",
    "author": "cian riordan",
    "date": "2023-06-16",
    "content": "Anyone got a line on some good horn sample libraries for vintagey Specials/Clash type stuff?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119393575667519538",
    "author": "Deleted User",
    "date": "2023-06-16",
    "content": "speaking of horns/brass, I’ve been searching for horn sample libraries that can start vibratos mid note with either mod wheel or other CC automation. same with strings and woodwinds. \n\nI’ve consistently felt like the vibrato is the biggest bottleneck in trying to get samples to sound realistic or have mojo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119395958397083733",
    "author": "Deleted User",
    "date": "2023-06-16",
    "content": "they also have all sorts of different horn section samples. Definitely check them out as well!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119450609142218753",
    "author": "austenballard",
    "date": "2023-06-16",
    "content": "8Dio Intimate Studio Brass and Studio Sax Trio are pretty usable",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119455298546040882",
    "author": "LAPhill",
    "date": "2023-06-16",
    "content": "Lines that play to the natural strengths of an instrument. Saxes and big band brass are so full of bends, glissandi, growls, flutters, different attacks.. basically, there are too many things that make a horn line groove and make people give the stank face for any library to really fully pull off.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119463108692430909",
    "author": "Slow Hand",
    "date": "2023-06-16",
    "content": "Yeah. I love Session Horns, for the record. It's my favorite horn library that I own. They did a great job, but unfortunately the task is huge and probably un-winnable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119463672289435678",
    "author": "Deleted User",
    "date": "2023-06-16",
    "content": "no mod wheel though. It’s pretty good for fp, staccato, some basic articulations, falls and shakes\n\nbut regular sustain samples sounds so fake. most of the time programming with fp or layering them with fp to get that attack and shape.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119474200609046570",
    "author": "LAPhill",
    "date": "2023-06-16",
    "content": "I’ve heard of it, but haven’t heard it in action. \n\nRegarding the former, I’d venture a guess that there’s more interest than you’d suspect. AI generated music will hit a wall without being able to go beyond what current sampling technology can do. Whatever technology is creating new songs with Eminem’s voice will inevitably be turned to make your string line sound more like a real player. I imagine it’s not conceptually very different, though how to package that for an end user is beyond my little composer brain.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119480116867768380",
    "author": "Slow Hand",
    "date": "2023-06-16",
    "content": "Maybe there's a solution to this problem where composers still sequence horns the old-fashioned way, using passable MIDI/sample mockups that don't get 100% there. Then the DAW does an offline pass when bouncing where it uses an AI model to fill in the blanks to make the legatos feel convincing. Or maybe it interpolates tongue-slaps into the performance in a way that carries over the resonance from the prior notes, or colors \"outside the lines\" by injecting a certain amount of \"frenzy\" into the playing that modulates pitch, intensity, timing, or overall \"vibe\". Or maybe it makes the timbre \"a little more Duke Ellington and less John Williams\". Or maybe it renders a double-tracked horn that's not just a pitch-modulated version of the source audio file.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119722261679706293",
    "author": "Deleted User",
    "date": "2023-06-17",
    "content": "Sculpture’s a beast. I’m getting a little tired of the string based synthesis though, they do have that same Karplus-Strong quality to it that kind of sounds old now. Kind of like the same Corpus sound we hear all the time now, except it’s way older now",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119736564088586240",
    "author": "Slow Hand",
    "date": "2023-06-17",
    "content": "This sounds juvenile, but I would love for someone to physically model an ass that can fart. Model an airflow with variable air pressure and then an aperture to constrict that flow and a pair of cheeks that flap open and shut several times a second. You can modulate the resistance of the cheeks and play it like an instrument.\n\nAgain, it's juvenile on the surface, but I don't know another instrument that has the same properties. Maybe the embouchure on a brass instrument? But those are also resonating through the horn itself. It's got musical potential. I wanna rev it up like a motorcycle engine, and then make a stadium full of people listen to it. 😄",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121753504168562798",
    "author": "Iwan Morgan",
    "date": "2023-06-23",
    "content": "I like the tambo and hat in Avid Groovecell’s Krautrock patch. Add a bit of spring and layer with other drums and they sound legit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123444044903764090",
    "author": "Deleted User",
    "date": "2023-06-27",
    "content": "What are your favorite ways of creating density in an arrangement with minimum instruments without parts being busy? Particularly harmonic elements. \n\nI’ve noticed certain songs have really dense feel in the harmonic instruments without too much movements but still have really crowding density. Unfortunately can’t think of any other examples at the moment… but some trap songs and dance music (brazilian moombaton, dancehall, reggaeton, soca) often have elements that crowd the upper mid range or midrange while letting the low end breathe.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123445531465760770",
    "author": "Deleted User",
    "date": "2023-06-27",
    "content": "I think it’s primarily loudness. Especially in Brazilian Moombahton, the harmonic instruments are screaming loud. Partially mixing but you probably can’t mix it like that without the arrangement that supports it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1124090110007320607",
    "author": "KushKadett",
    "date": "2023-06-29",
    "content": "When you distort stuff in the analog realm it kinda fattens the lower mids easier so you need less layers for it to sound full imo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1124132833414365334",
    "author": "Deleted User",
    "date": "2023-06-29",
    "content": "that makes sense. sometimes it’s kind of hard to know if it’s arrangement that needs more work or if it’s the sonics",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126346807144894505",
    "author": "Zack Hames",
    "date": "2023-07-05",
    "content": "Any and everything is on the table! Blending layers of real snare recordings, synth hits, aggressive EQ and other mixing techniques. There are no rules.\n\nEven If you take a plain snare recording and have it at a single velocity and program it, it suddenly sounds like a sample!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129454094952697906",
    "author": "Deleted User",
    "date": "2023-07-14",
    "content": "@LAPhill I’m struggling with making staccato string phrases sound lively with Midi strings. I don’t know why but for some reason, the string libraries I’m using wouldn’t let me control dynamics with modwheel. And round robin feels unnatural. \n\nI’m using LASS 2 and Cinematic Strings 1. \n\nI have to reference the strings in this song - at 1:30. The reference is very robust and energetic, smaller section- and I’m having a hard time achieving this\n\nhttps://www.youtube.com/watch?v=tsmPCi7NKrg",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129456261839212614",
    "author": "Deleted User",
    "date": "2023-07-14",
    "content": "The only small sections I have are LASS, but their round robin sounds really off for some reason",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135007741677682778",
    "author": "LAPhill",
    "date": "2023-07-29",
    "content": "In all seriousness, I don't think that the function of melody, harmony, or rhythm is so clear-cut in modern music. It's also hard not to put arrangement/production/orchestration up there. Everything is contributing to the story, and it's worth exploring all aspects of music deeply so that we can be as articulate as we can.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137116219837796562",
    "author": "chrissorem",
    "date": "2023-08-04",
    "content": "Thanks! It’s even cooler in the arrangement I’ll share when the song is out.  That thwacky bass drum!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141884101406773288",
    "author": "peterlabberton",
    "date": "2023-08-17",
    "content": "I had this happen once with a really rad band I worked with—we hashed out a bunch of parts/arrangement/etc., and then they re-did everything mostly note for note to get out of a deal, in order to own their master. Kinda can't blame 'em for wanting the master, but wish I'd been credited. Seemed at the time and now like there's no recourse.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141893394780659712",
    "author": "austenballard",
    "date": "2023-08-17",
    "content": "I have been on both sides of this situation\n\nOne example was that the producer had ghosted the artist, so I redid the instrumental note for note, matching synth patches and everything. Artist decided not to credit the original producer. He got mad and threatened to sue but the legal fees would probably be more than any royalties he made, so that all fizzled out\n\nAnother example was that the artist found someone who could finish the project plus mix and master it for less than they would have had to pay me for the final arrangement deliverables. At least I got my 50% down payment.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150092392553271326",
    "author": "Josh",
    "date": "2023-09-09",
    "content": "I actually really love editing because I’m a drummer. There’s so many instances where I just wanna leave it as is or making the rest match a section where the drummer was ahead or behind.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155580910440304802",
    "author": "Rollmottle",
    "date": "2023-09-24",
    "content": "Nice job on this dude! Sketching today and your plugin came in really handy. Immediately usable. Some of the UI maybe needs some tuning, but once you play with it, you can figure it out. Pad and Rhodes in this from SKY Keys.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1156055184238190633",
    "author": "Trolligator",
    "date": "2023-09-25",
    "content": "@Skyler Young btw i made this piece of garbage with your keys plugin today. everything that isn't an acoustic guitar in this is from your plugin which was just an absolute joy to use. there's a pad sound, a piano, a wurli, a soft pluck thing, and a guitar patch played super low masquering as a bass.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1156795179739652227",
    "author": "Zack Hames",
    "date": "2023-09-27",
    "content": "Hey ya'll. I am working on a Taylor Swift Reputation Era influenced track for this young artist, and i was wondering you all had any tips on how to achieve some of these vocal sounds. How do I go about this sort of pseudo group vocal sound. Big, clearly layered. Is it a matter of standing in different places in the room and recording several layers, simply singing different, harmonies, different mics... etc\n\nhttps://www.youtube.com/watch?v=kRJKB291Z1g\n01:00 vocals at the chorus\n\nhttps://www.youtube.com/watch?v=xYLxUJ9v6KU\n00:46 Vocals at chorus\n\n\nThis is out of my typical realm so any advice with ANY big pop vocal production would be really cool.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157493438686691448",
    "author": "austenballard",
    "date": "2023-09-29",
    "content": "Depending on the singer you might need to stack more than one layer of each part",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157506459706327081",
    "author": "Jeremy Klein",
    "date": "2023-09-29",
    "content": "ohhhhhhhhh this is right up my wheelhouse as im working on an entire album right now where most of the vocals sound like this. \n\nIt sounds really dumb, but simply recording a LOT of layers, and importantly, not tuning super hard and not correcting rhythmically super hard on the layers will give you that big group vocal sound.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157506538576019547",
    "author": "Jeremy Klein",
    "date": "2023-09-29",
    "content": "like 16 layers a lot",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157704344137896007",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-09-30",
    "content": "Do you usually do the kuk harrell thing with 4 layers (2 L/R each) for harmonies instead of the regular 2?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164026399837925527",
    "author": "youngteam",
    "date": "2023-10-17",
    "content": "love how textured these are. I'm surprised the price is so low",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175239517549109258",
    "author": "Rob Domos",
    "date": "2023-11-17",
    "content": "Oh for sure. The Karen score I just hit is off the charts. \n\nThis week I was in an unusual position where I was getting paid hourly to compose for a nonprofit I care about deeply, and so in this instance my confusion about why none of the instruments were in tune with one another cost my favorite charity money and decreased the quality of the result they got, so I got slightly miffed. But hey, part of that is on me for not being prepared and owning better tools right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175240024166506566",
    "author": "Rob Domos",
    "date": "2023-11-17",
    "content": "I also view those free samples as loss-leaders to drive people to buy more, and in this instance it discouraged me from buying more because I’m concerned i’d run into those issues later. The texture and expression of their samples are mega cool though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175315061200400404",
    "author": "Josh",
    "date": "2023-11-17",
    "content": "I ask that like I’m actually going to buy a string library lol.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177856417047248938",
    "author": "spectrummasters",
    "date": "2023-11-24",
    "content": "If you have a main melody and send it into the timeshaper …..try experimenting with the stutter 1 and 2 presets at different length settings ….and then play with the mix percentage . Sometimes you get some total gems 💎 that can work great for a breakdown section",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183500705135333376",
    "author": "Rob Domos",
    "date": "2023-12-10",
    "content": "As a dude who's musical education was mostly in accapella music and who's production has mostly been midi that was easily quantizable, my sense of rhythm is nowhere near tight enough for the tier of work that I've been entering into lately. This means if I play something, I'm going to need to be quantizing audio and I'm relying on the visual aid of the waveform because my inherent sense of groove is pretty weak. So I'm looking for advice on quick heuristics for quantizing audio. \n\nTodays example: I played some palm muted acoustic guitars, I've marked the scrape of the pick in red and the peak of the waveform where the note truly starts ringing in green. The waveform actually starts a little before the scrape as you can see where the pick touches the string wave over on the left . How are y'all thinking about which part of this waveform should fall on which side of the beat?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1183554168171003984",
    "author": "Deleted User",
    "date": "2023-12-10",
    "content": "it’s generally the orange if it’s something like palm muted guitars. But always listen and feel it. It can feel better to be early in certain styles but it can feel better to be late on other styles. it also depends on who else is doing what\n\nBut groove template is always there if you wanna line it up with other instruments. bounce and make the source and destination audio files the same length, make sure the markers are in the correct place then sync them up. \n\nI’m 90% manual editing though. Because aligning automatically can fix notes I didn’t want to fix. you can also go measure by measure to be more careful if you want to auto align with groove templates \n\nyou want to ask yourself “is this note late or early?” before making any moves. I like nudging with keyboard so I can fine tune how far it goes. \n\nNowadays I’m more committed to “the only way to make the groove feel good is to play it that way”. I hate having to edit and to be honest, nothing beats well played rhythm section… Especially because I do a lot of in between the groove stuff, 30% quantization can mess with the feel of well landed notes. So I’m doing a lot of metronome practice these days",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190232508751675392",
    "author": "Deleted User",
    "date": "2023-12-29",
    "content": "@RÜSSO Here a serum patch. It's close enough - but if you want it to be exactly the same then you'll likely have to find out what synth they used. You could try tweaking the waveform to a slightly different Saw wave, but this is probably as close you'll get with the Serum LPFs and enveloping. You'll need to mess around with pitch bend and attack time to get the performative aspect of this lead line, and especially when you do the pitch bend - you might need some help from the compressor to get the sustain out of that slow pitch bend,\n\nWhenever you hear buzziness it's usually LFO on OSC level on a faster rate. This same lead sound is all over different styles of EDM so it's a good patch to know. Kaskade - Atmosphere has the same lead but in square wave with other layers as well.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1190579756643647598",
    "author": "Slow Hand",
    "date": "2023-12-30",
    "content": "I've got a challenge for the sound design nerds: There's a cello motif that runs from 0:16 to 0:27 on this track and I cannot for the life of me figure out how the composer has achieved something so thick, distorted, and claustrophobic. I love it: https://open.spotify.com/track/7x4GzEMWQZrrSLbmWxu2hH?si=8d4ea18200424376",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190579777573236757",
    "author": "Slow Hand",
    "date": "2023-12-30",
    "content": "My working theory is that it's a cello pitched down an octave in Melodyne, perhaps with some formant shifting too. I'm trying to emulate it in Melodyne right now, but am not quite there.\n\nBut the distortion and dramatic dryness is a total mystery to me. I don't know this flavor of distortion at *all*. There also seems to be a *very* nice sub octave layered in there too. The funny thing is that it all sounds very natural to me. As if there's not a tremendous amount of processing going on. I feel like I'm missing something here.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190729160579105049",
    "author": "Calvin Lauber",
    "date": "2023-12-30",
    "content": "It really is. I use it all the time just to bring out texture on stuff that needs a little saturation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194249778595381258",
    "author": "Ross Fortune",
    "date": "2024-01-09",
    "content": "Guitar wizards, I'm experimenting with clean 80s tones and wondering how Mutt and the lads might've got the clean strums in the pre at 0.52.\n\n*jang jang jang*  \"I wanna know tonight\" *jang jang jang* \"Are you alone tonight\" *jang jang jang* \n\nFeels like there's layers of chorusy electric, but maybe a plasticy layer of DI'd acoustic or something in there too?\n\nhttps://open.spotify.com/track/2PFIZFcGry0po3ZfRZkzKc?si=c691d11446cf40e1",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194293132297252947",
    "author": "Ross Fortune",
    "date": "2024-01-09",
    "content": "Truly. Along with Animal, holy moly. \n\nReckon that 12 string Rickie is amped/mic on the strings or what?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194309066101624902",
    "author": "Zack Hames",
    "date": "2024-01-09",
    "content": "A danelectro 12 string would work as well",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196611313347076188",
    "author": "Adam Thein",
    "date": "2024-01-15",
    "content": "We’re in the age of producers being able to resing parts with AI replaced vocals, I think layering to build chords is way more than fair game!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196673563541909616",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "But I do want to clarify about my one take musician thing… \n\nI may have used the term too loosely. To me, most jazz musicians are one take players. They record everything together and calls it. (of course they do a few takes but I’m not trying to be a “first take and that’s it” player)\n\nBeing able to play through the whole song (unless arrangement calls for section by section) and just needing to punch in a few spots is what I want. I do not have any desires to go beyond that. \n\nBUT\n\nI don’t ever want to edit my timing other than micro adjustments that can be done by moving small part of audio clip or hitting quantize. \n\nThat + being more consistent with touch so I don’t have to punch in as much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196696952901996554",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "re: 1 \n\nI have gotten over the whole “perfectionism” thing. I still overthink all the time but I can confidently day I am free of perfectionism. I have no problem letting go when it calls for it. I believe there’s a difference between wanting to be better and working towards it vs not being able to move on out of fear and holding onto something without knowing the next move. If that was the case I wouldn’t have sent what I first recorded to the artist. I may have wasted some time thinking I would be able to get this part down, but I don’t think I was being a perfectionist by doing that. \n\nre: 2\n\nWhy would he do this if he’s a great guitarist? Is it a workflow preference or the aesthetic of edit/sampling? I can only imagine it being faster playing the parts in rather than stitching bits together. \n\n\n\nThe whole goal is to be able to consistently reproduce that magical groove, and being able to create great moments when I am with other people. I really believe I have a good sense of groove but can’t execute it just yet. \n\nI can see myself spending countless hours editing myself. (Which I already do daily). That time is better spent working on my chops. If I can hire other musicians so I can stop wasting time trying multiple takes, I would. But I don’t have that just yet. I go by sections or measures most of the time, I don’t just sit there trying to nail ONE perfect take.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197060142504624198",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "More hat and snare samples can then be used as quieter layers to start layering shuffles in other parts between the beats . The first 16th after the downbeat and a 16th before the the offbeat in beat 2 and 4 all work , but it’s then much more about velocity really . The idea is your hats and snares all start shuffling into each other , through the bar , again with the accent around the 3 . Resolving in beat 4 and back around for the next downbeat",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197061543129518190",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "5. Arrangement \n\nObvs we are talking risers / downers ……longgggggg Verbed out cymbal splashes , 909 clap delays , breakdowns and drops, preferably with filtered vocal chops …..hands up !!!!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202404872436195359",
    "author": "hyanrarvey",
    "date": "2024-01-31",
    "content": "The string arrangements in periphery’s new stuff is really cool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202660277066145803",
    "author": "LAPhill",
    "date": "2024-02-01",
    "content": "An old composer friend of mine has something like that, and would play piano pieces with it. Pretty insane",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203194936522969099",
    "author": "shaunobi",
    "date": "2024-02-02",
    "content": "I’ll layer in trigger samples sometimes under a kick but even that… I’ve mostly stopped",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203195043515473940",
    "author": "shaunobi",
    "date": "2024-02-02",
    "content": "But yeah, I layer them mixing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203195320704696340",
    "author": "Eric Martin",
    "date": "2024-02-02",
    "content": "I’m with you, I layer samples for an effect, not for the sound ¯\\_(ツ)_/¯",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203597659324158002",
    "author": "Deleted User",
    "date": "2024-02-03",
    "content": "Art is subjective, so there’s actually no “better” — This is something I need to remind myself of more. The amount of times that I showed something that I thought was good and was rejected, and the times I showed something I hated and got good reactions from  people. You really never know! \n\nI’ve been doing more writing sessions these days (once or twice a week or so), and I’m really falling in love with this because I can get out of my own head and look around to get a sense of whether an idea is working or not outside of my own opinions\n\nSpeaking of the relentless will to finish: would it be a producer’s job to stay on top of getting others in team to get their parts done? If I’ve done my part already and completed it, do I keep bothering them to get their parts done? (lyrics etc) \n\nI read your reply to someone asking about writing sessions, and you said your biggest goal is to get the vocals from the first spark of inspiration on that same day. I’ve had sessions where I get a basic bone of ideas with beat done, and top line is done but the lyrics are recorded in Gibberish and stream of consciousness. I would return, complete the arrangement on my own - send it back, they said they fuck with it and tells me they will finish the lyrics. How long do I wait, do I follow up at all, or do I just move on and keep making more? I don’t want to overstep or rush people (and.. I can’t get anyone to anything of course), but I also want to get the song done while I’m excited so I can keep moving forward. It’s hard to tell if I can even do about it or if I should just keep it moving and leave it be",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207418315094630410",
    "author": "Slow Hand",
    "date": "2024-02-14",
    "content": "Yeah. I'm asking if you want samples of solo string instruments or a string section.\n\nFor ensemble I've been enjoying the *NI Session Strings 2*. I've also got the *Spitfire BBC Symphony* but I'm less fond of those because they're recorded from an orchestral perspective and have a lot of room sound baked in, whereas *Session Strings 2* have a closer perspective. If you want an ensemble sound plus some major grit and close-miking I *do* like the *Bernard Hermann* orchestral library from Spitfire.\n\nFor solo strings the *NI Cremona Quartet* instruments are really, really nice. They're a pleasure to play with and sound fantastic. These have maximum presence too, so you can get some very direct sounds with them. I'm really enjoying them. The articulation and tonal options are extremely thorough.\n\nA while back a few people recommended *Sunset Strings* by Realitone. While I haven't used it yet, they look very promising. They seem to be serving people who want a rock/pop string feel, which could be just the ticket.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1208163853129486417",
    "author": "Rob Domos",
    "date": "2024-02-16",
    "content": "Only happening in one section of the song. TH’s have completely disappeared as well",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210608589753028628",
    "author": "SoundsLikeJoe",
    "date": "2024-02-23",
    "content": "It's the way they edit the samples imo.  ALL the SFA string products are missing the natural attack of the bow on the Long articulations. The shorts, spicc, marc, etc...  still have the bow attack and you can hear the difference in isolation.   In order to make their Symphonic series strings sounds rich and bite,  I use LASS from AudioBro to add definition.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210619644583481444",
    "author": "mariano",
    "date": "2024-02-23",
    "content": "interesting. so do you layer LASS with the SFA or just use LASS?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210621223923351622",
    "author": "mariano",
    "date": "2024-02-23",
    "content": "right, i was hoping to find one simple library to arrange all my orchestral stuff lol - like the free BBC Symphonic Orchestra. layering multiple libraries might result in a CPU overload and slow processing for me :/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212098292591362158",
    "author": "Nomograph Mastering",
    "date": "2024-02-27",
    "content": "Seriously though I would say that about half the time an artist sends me something that they’ve trimmed or edited in some way it gets mangled. I’ve had people accidentally time stretch, accidentally print through the mix bus processing again, chop whole sections off …",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212230415633481798",
    "author": "Deleted User",
    "date": "2024-02-27",
    "content": "what do you mean when you say production? \n\nsome thing I can think of off the top of my head\nwriting process\narrangement\nsound selection & mangling\nworking with an artist or other humans\n\none thing that has been helping me lately with the writing portion is figuring out chords for all sections early on. this might be obvious for some folks but I’ve been way too focused on figuring out instrumentation and making new sections work by changing instrumentations. So I’ve been trying to pay more attention to linear development. \n\n@slow.hand prompted really good ideas on figuring out chord progressions. Speaking of which, I do need to put together a way to use google form and compile all the oblique strategy forms in one place sometime soon",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212310244257177650",
    "author": "Deleted User",
    "date": "2024-02-28",
    "content": "@peterlabberton @Zack Hames \n\ntoday was a tough one. I finished the arrangement yesterday, got the vocals in at 7:30pm today. I had to tune and mix to get it done by 11pm today because of the time zones. These suggestions would have worked with a bit more time, I should have phrased the post differently. I said it’s not the lack of time, but clearly it was 😥\n\nLooking back, I could have used a quick walk- but i felt like I wouldn’t be able to finish it even if I took no breaks. I ended up turning it in without background vocals because i didn’t get to tune them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212313694189391923",
    "author": "Deleted User",
    "date": "2024-02-28",
    "content": "I am the opposite, I’m pretty good with chords that just work as a vamp so I lean on them heavily. Which made me develop a habit of just changing instrumentations in new sections to make the song go. But it also causes me to get stuck at times because I’m trying to find a way to create the arc with the wrong tool for what the song wants to be. after doing a few with different songs with different chords for pre chorus or verse and figuring out all the sections early on, it feels like a good way to get an idea of what the overall arc of the song may look like",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212569095921209384",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-02-28",
    "content": "If you want quick, I wouldn’t train a voice - things can unexpectedly go wrong and compromise your quality, especially if you’re trying to mix voices. Two products that seem quite mature right now are Ace Studio and Audimee. When you’re not on a deadline and if you are serious about this kind of thing I would recommend getting to know RVC on GitHub, as it’s the tech everyone is just building a layer on top of, it’s free, and you’ll know what’s going on under the hood.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212583949696766073",
    "author": "austenballard",
    "date": "2024-02-28",
    "content": "my arrangement template is set up so I can bounce out as a rough mix\n\nI'd say a solid 50% of the mixes I deliver to my lower-budget clients are just arrangement bounces",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1213980381682991154",
    "author": "Johnny I",
    "date": "2024-03-03",
    "content": "Working on a project where we just have the foundational acoustic guitar tracks for 9 songs, and are about to start overdubbing. Everything recorded to click, but would like to change the tempo on a couple of tracks, and in a couple of sections...most likely no more than 2bpm in either direction. Want to do this before we lay anything else down...what's the best time-stretching tool to accomplish this while preserving the audio as best as possible? I have access to RX, Melodyne, Pro Tools...haven't explore time stretching yet, so any advice is appreciated. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1215035730951147601",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-06",
    "content": "the mixwave drumkits has a \"boost\" button that turns on and off the additional layers and when it's off it's kinda close to SD3",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220507257737842729",
    "author": "Ross Fortune",
    "date": "2024-03-21",
    "content": "He’s got that 8 string beast for sure, but the white noise /sine wave stuff through whatever’s mangling it is incredible",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1229543217951670302",
    "author": "ehutton21",
    "date": "2024-04-15",
    "content": "I like arcade but I try to be unorthodox about using it. I guess that’s a pretty generic thing to say but I like the interface it has for layering vocal samples into production if that’s something you find as a staple of your work. I enjoy using their sample and sequence loops as a starting point, printing them, and fucking them up more",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1234929821889597540",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-04-30",
    "content": "is it possible to modulate the frequency in Pro Q3 via external sidechain? Basically what I wanna do is that I have this choir and I want a synth pad to open up frequencies the more intense the choir sings. So I figured I'd make an envelope, route that to the choir, send it into pro q3 and have it modulate the frequency of a lowpass. Thing is, I only know you can modulate the dynamic eq in pro q3 but I haven't found anything online that allows to modulate the frequency itself. \nSo in short, I want the eq to open up with the intensity of the choir. \nIn essence, make the frequency dynamic to the sidechain.\nAnyone have any tips?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237775663524610109",
    "author": "crumley",
    "date": "2024-05-08",
    "content": "Does anyone know of any orchestral plugin / sound banks that behave like a real ensemble, in the way that individual string players don’t reiterate every single note, but each player portamentos from one note to the next within a chord? For example, if I had 3 string players playing a c major triad (C, E, G), and then they play an A minor triad (A, C, E), the C would portamento to an A, E to C, etc, without reiterating the beginning of the note.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237797084648706121",
    "author": "Ross Fortune",
    "date": "2024-05-08",
    "content": "Um, while we’re doing pester @LAPhill about libraries… What are real composers using for action style repeated fast staccato string figures? \n\nI’ve got reasonable results layering Kontakt Session Strings 2 with BBCSO, but it’s pretty laborious - key switching in BBC per note between staccato and spiccato to make it more exciting and less machine gun.\n\nI see Action Strings pop up. Is that old hat?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239236709640704142",
    "author": "Josh",
    "date": "2024-05-12",
    "content": "Any sampler will work. You can even load one shots in the sample section of serum 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239255574550548561",
    "author": "Adam Thein",
    "date": "2024-05-12",
    "content": "https://decomposer.de/sitala/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240523344097575084",
    "author": "Slow Hand",
    "date": "2024-05-15",
    "content": "The *Massive X* sequencer is close, but you still need to trigger the sequence using a held MIDI note, so there's this extra layer of abstraction between drawing the gesture and triggering it.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1241771456577278063",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-05-19",
    "content": "Yeah agreed. Some people find premade cake layers wack. I do feel people have lower artistic expectations of cake generally lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243527967024480259",
    "author": "oaklandmatt",
    "date": "2024-05-24",
    "content": "I know there's the resources section on the website. Maybe a version of that?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244717561950507070",
    "author": "lystell",
    "date": "2024-05-27",
    "content": "Thanks for the tip! \nSay I get an arrangement down with sessions strings for instance.\nI’m looking into hiring a violin player to overdub some of the parts. \nIsn’t there a “magic” number on how many overdubs to do? I remember an arrangement teacher I had talking about that. Odd number or something.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244722060555583610",
    "author": "LAPhill",
    "date": "2024-05-27",
    "content": "We've covered tips for general string layering here before, but as far as disco specific - make sure your player knows what you're after. Disco style involves exaggerated portamentos and glides, but be very intentional about where you put them. It's easy to overdo it and it becomes tired, but putting them in the right moments will really sell the disco feeling",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244839450949713980",
    "author": "chris_donlin",
    "date": "2024-05-27",
    "content": "Question for synth bass heads! I've been into dirty synth bass sounds for a while but having a hard time making them sound big as they feel and sit in a track right. I have no problem getting a sound i dig, but once it's in the track, it either get's lost or gobbles up all the headroom. Should i go for a clean sound and get the grit in parallel? Or is it just an arrangement issue",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244842854430412853",
    "author": "Josh",
    "date": "2024-05-27",
    "content": "Hi pass it, saturate it, clip it, limit it, carve out space in the arrangement so it fits.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244845721979715644",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "Here's an audio example of the sound in three parts:\n1) Final Sound\n2) Dry Layer (sub)\n3) Grit Layer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244846400584552550",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "You can't see it, but I've dialed out all of the low end inside of the Manny Distortion plugin, so that it's not fighting against the dry layer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247600990585094174",
    "author": "SoundsLikeJoe",
    "date": "2024-06-04",
    "content": "True....   for film score jobs,  I've stolen tips from Randy Newman....  I'll sit at the piano and just watch the scene and \"church underscore\" it by playing free time around the dialog.  Then come back and tempo map the click to what I had played.  Write the parts to that. Print the charts, and send the click map to the players.  In that case, it's both without and WITH a click.   It's not YES or NO.  It's both.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254872042319380492",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-06-24",
    "content": "Yeah I like to reduce sample rate and then bring back some of the high end with anti aliasing. Then messing with the sample size and you get some interesting glitchy textures.\nTurning the distortion and saturation up miniscule amoubts (about 0.1-0.3%) also rly helps to make vocals more intelligible \nOn top of that, it‘s also rly great if u rly wanna f*ck up a sound. It truly is a great plugin",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255517273947504682",
    "author": "rawssx",
    "date": "2024-06-26",
    "content": "I just searched phoebe bridgers and this message of yours came up. Interestingly i haven’t seen this yet, but as for other vid clips i have seen, in one of them, tony is gatekeeping a plugin they used to get that smooth texture throughout the album Punisher, by phoebe bridgers. I love love love Halloween, the chorus just punches me in the guts, but what else punched me in the guts was that the gatekeeping by the guy. I mean music and art in general is supposed to be moving culture forward, right??. Old man has had his plate of cake throughout his career, whats wrong if he teaches the knowledge to a new generation, that way more talent comes out and we get to hear amazing music in the future. Not to degrade his work, Ethan Gruska and Tony has done a phenomenal job on the album.  I would never, Personally gatekeep any knowledge if i made something like Punisher, The Album Is THAT GOOD. Thats what i would do. Not judging anyone whatsoever, but felt bad to see a producer i look upto “Gatekeep” sauce just so no one is on his level soundwise.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255519007579050104",
    "author": "rawssx",
    "date": "2024-06-26",
    "content": "Shoutout to Audiohaze on youtube, Bro dug up articles and found the vst. Lossy by Goodhertz! What is funny, is ethan talked about using lossy on the upcoming phoebe album and after the album was out, they edited the article and cut that part out. Like bro!?!? I have been using it for a while now. Such a crazy beautiful audio manipulator and has definitely dressed me decently to use texture in songs, how better would it be if i found it earlier i tell myself.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256158471187857458",
    "author": "rawssx",
    "date": "2024-06-28",
    "content": "I was wrong about the tony berg thing, soo wrong. I dived into phoebe’s stuff just last week, funny that it took me 4 year to check out an Amazing album even thou i have been following her on instagram since 2020. What blew me up was, most of the modern productions in the pop side of industry, the sad songs, all of them are inspirationally ripping phoebe’s sound. I was mad at tony berg when i saw his interview where he gatekept a vst they used throughout the album to get that muffled texture. But in the past two days, i also realised he said “We are not going to tell you the vst just so you at home can not replicate the sound”. I thought that was asshollery until i realised that they are actually being ripped so hard in the industry and that they really gotta protect their sound. Tony, Phoebe, Ethan these guys are hidden unknown diamonds “i think (like me) a lot of people know phoebe as a celebrity than a music artist, or that was just me being lazy to check out her songs” but i feel like everyone needs to experience their music.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256373118847549562",
    "author": "BatMeckley",
    "date": "2024-06-28",
    "content": "It is now!\n(It was in some hipster open bs where one string was down a half step making everything minor)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261166399741755533",
    "author": "chris_donlin",
    "date": "2024-07-11",
    "content": "They gave me \"you should see me in a crown\" as a ref. sounds like there's an actual lfo on the bass, but i think the artist is reffing the synth layered with the bass",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261169525441691749",
    "author": "Slow Hand",
    "date": "2024-07-11",
    "content": "You may already be aware, but you can get very different textures by playing with the LFO shape on the tremolo. \n\nThe bass is more of a sine/triangle shape while those vocal samples have harder edges, closer to a square wave. The square wave modulating volume at high rates will give you that \"ripple\" I think you may be hearing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1269712854706294815",
    "author": "chrissorem",
    "date": "2024-08-04",
    "content": "I was working on a song I’m producing and it has section that I love so much and it makes you want to keep it going but I decided to keep it to 16 bars it’s satisfying but leaves you wanting more.  I’m curious how others feel about that? Do you like to give them the whole pie or just a slice so they come back for\nMore ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1272346312117063733",
    "author": "James Redfern",
    "date": "2024-08-11",
    "content": "Are you selecting the whole track at once or going section by section?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1272347677975248926",
    "author": "Beck Nebel",
    "date": "2024-08-11",
    "content": "When I’ve tried it I have done it section by section, starting and stopping the “recording” process into Vocalign",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1273841543492665426",
    "author": "Josh",
    "date": "2024-08-15",
    "content": "There has to be someone in here that understands what I’m about to say. \n\nI want a looper. But in my computer. \n\nI find myself always making a ton of layers of guitars and then bouncing them down. I don’t want to have to do that. I just want to hit a button and play over the parts over and over again until it’s a jumbled mess. This isn’t for performance or anything, I just like to make little loops and chop em up and throw them around projects I’m working on and I find myself doing it less and less with my free time becoming less common.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277732966281515118",
    "author": "Slow Hand",
    "date": "2024-08-26",
    "content": "I’d slap a gate on the pad channel and then SC it off of a rhythmic sequence on another channel that’s muted.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278119910626689056",
    "author": "Ross Fortune",
    "date": "2024-08-27",
    "content": "Using Drive to create rhythmic texture on a static sound where you might otherwise reach for tremolo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1281004184711200770",
    "author": "Chad Rodgers",
    "date": "2024-09-04",
    "content": "I did a thing for a new Duracell battery announcement video a few years ago, not as epic as the UN and world peace but it sounds like a similar vibe (two people in a clean corporate setting talking about their vision for the future, clean tech, innovation and legacy, nice B-roll etc). \n\nFor this I did a simple high-shelved felt piano piece where it glided up and down, sometimes layered to give body and tension, and used soft white noise and other relatively muted tones to create movement and moments in the form of risers and sweeps etc. It was relatively unobtrusive and tonally appropriate for the subject matter, whilst being a little bit uplifting too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283990533873602651",
    "author": "Josh",
    "date": "2024-09-12",
    "content": "I’ve been loving friction from Reason. It’s their strong modeling device and it gets that super close mic’d bow against string scraping sound so damn well and there are no samples.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293328054386688102",
    "author": "ehutton21",
    "date": "2024-10-08",
    "content": "In need of some additional inspiration creatively so I figured I’d give this to production talk.\n\nAnyone got reference material for (1) layering vocal stacks & vocals that are sang in a round [just looking to see how others have gone about it] and (2) effectively mixing a duet w/ two male leads. \n\nNot necessarily looking into the tips and problem solving. Right now the only reference I’ve had time to drum up was December by neck deep, if that helps narrow the field.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301949773187776595",
    "author": "Johnny I",
    "date": "2024-11-01",
    "content": "Working on a track that's primarily acoustic guitar and vocals; a couple of sections where a chord or note on the guitar is a bit off timing, in a way that's distracting. What's a suggested method to best correct this if an edit or punch isn't possible? Since the guitar is so exposed, I'm not sure how to approach this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301959627839246376",
    "author": "Johnny I",
    "date": "2024-11-01",
    "content": "Yes I mean editing, but this is the first time I've encountered this particular situation, and wasn't sure how to go about it...I am in Pro Tools...I am used to replacing parts with a section from a different part of the track, when it appears elsewhere...this is the first time I've had to edit where there wasn't another similar section....so I wasn't sure how to take a chord or note, pull it back or forward without a space/silence in between...wasn't sure the best method (i.e. time stretching the tail, etc).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304886119640465541",
    "author": "itaylerner",
    "date": "2024-11-09",
    "content": "Stacks stacks stacks, I think real vocal layers are like 90% of the size. With Effects I’ve had pretty good luck with izotope nectar for cool tuning/robotic voices, and soundtoys effects rack is my fave to build cool filtered delays and stuff. Also Saturn 2 for cool effects and honorable mention for Valhalla shimmer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304890289374236672",
    "author": "hendrick",
    "date": "2024-11-09",
    "content": "cool!! for stacks, do you have go tos besides adlibs, harmonies, unisons and oohs/aahs? and are you a 2 layer for doubles or 4 ?? 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310898089732870155",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-11-26",
    "content": "what do you guys use for transitions/impacts other than ye olde crash cymbals these days? \n\nIdk if it was Jack Antonoff but I heard someone say that they try to use different ways to transition into different sections than crash cymbals or the classic white noise-edm impacts to keep the production sounding fresh and modern without relying on sounds everyone has heard a million times before \n\nrly curious for your insights!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310990290047336449",
    "author": "Eric Martin",
    "date": "2024-11-26",
    "content": "before the downbeat no crash on the new section, filter sweeps do the thing for me, Juno chords raising the cutoff, drums through a EHX bass microsynth doing the sweep, anything to have fun",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312974334511288382",
    "author": "Bryan DiMaio",
    "date": "2024-12-01",
    "content": "Have you seen that picture of a bunch of speakers arranged as a string section in a big church?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313036038020661251",
    "author": "vostral",
    "date": "2024-12-01",
    "content": "I have a couple of That Sound acoustic drum sample packs (available on Splice and very fresh!), when i use the one shot kicks, snares... i'd like to use another layer using the Ableton effect rack on the Drum Bus. That second rack would be highpassed and equipped with a Room reverb. Thats how i emulate the overhead and the room  tracks of live drum recording. And Ableton Effect Racks allow me to layer more to make it not sound like one-shot samples playing!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313039315508658247",
    "author": "Slow Hand",
    "date": "2024-12-01",
    "content": "Gotcha. So you're saying on the drum buss you have a hi-passed verb running in parallel? Just to be clear, are you also using a second layer with different samples too? Or just the one layer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313041862969524295",
    "author": "vostral",
    "date": "2024-12-01",
    "content": "Just layer for effect, ableton is great at this. In terms of sample, i can layer more tracks (kick 1 kick 2 snare 1 2 3) inside that drum buss",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313044648641695785",
    "author": "vostral",
    "date": "2024-12-01",
    "content": "I highpass these Room & Overhead emulation layers because i once listened to the stems of a Polyphia record, that the Room & OH tracks do not have any sub information, that's the moment i came up with this verb layer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313282289714597899",
    "author": "Ross Fortune",
    "date": "2024-12-02",
    "content": "I haven’t used either myself, but listened to AG Cook on Tape Notes and there’s a section where he shows Synplant doing its thing on an 808 cymbal IIRC. Does exactly what @Slow Hand seemed to be describing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313405163528257587",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-02",
    "content": "You think so, in fully programmed beats? Idk I see people talk about humanizing/organic groove a lot, and people spend so much time pitch shifting handfuls of cents and varying layers/microtiming/velocity to get to a less machinegunny/real place",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318427091481530379",
    "author": "Slow Hand",
    "date": "2024-12-16",
    "content": "In the video they mention that Rod Temperton's demo came with each of these layers, voicings, and counterpoint already planned out. What a G. I love that kind of attention to detail.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318432160121618522",
    "author": "Slow Hand",
    "date": "2024-12-16",
    "content": "**#2**\n@ 24:42 - Anthony describes the two-voice \"falling star\" effect. This is such a cool approach to orchestration. \n\nI love this because it feels very in-line with how I think about sound design. Often a single sound is, itself, a well-crafted mini composition with multiple layers that create the composite effect. It really blurs the line between orchestration and sound design.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328122331436155053",
    "author": "Ross Fortune",
    "date": "2025-01-12",
    "content": "I soloed the drums in a track I’m working on and threw it over the whole master. The output of the limiter into it made it go brrrr. \n\nAlso then used it as an actual filter for a mix note. The filter/drive combo and a little envelope follower was just right for sending a perc element back but keeping the texture dynamic and interesting.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1329250062941028493",
    "author": "andrew_yv",
    "date": "2025-01-15",
    "content": "If you want realistic playability and flexibility of an instrument that can do basically anything you think of, the Audio Modeling SWAM saxes and brass are great, but they require some heavy handed processing to sound good. Otherwise, for more traditional sample based stuff that sounds better straight off I second @LAPhill on Swing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331562132621234278",
    "author": "vostral",
    "date": "2025-01-22",
    "content": "50% of time untouched. 40% of time enhanced with saturation or exciters. 10% of time blended with heavy distortion layer 👍👍pultec  would also be used every once in a while",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334277857714896966",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-01-29",
    "content": "Question for producers! How do you all approach arrangements that lend themselves well to mixes with good separation? (especially those of you who ”mix as you go”)\n\nFor a tidbit as common as ”arranging is mixing”, I’ve found very little concrete guidance on it (or maybe I’m looking in the wrong places). Do you have specific pockets you like to place things, and go-to instruments or approaches for them?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334280825327325204",
    "author": "Felix Byrne",
    "date": "2025-01-29",
    "content": "relevant modern example: p much anything bad bunny\nLOUD ASS DRUMS, LOUD ASS BASS, some synth pad taking up no space, some synth lead that's not overlapping with the pad and is transient enough to get out of the way of the vocal, LOUD ASS VOCAL",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334280980139216926",
    "author": "Felix Byrne",
    "date": "2025-01-29",
    "content": "if there's any kind of emotional change or new section, it becomes a new arrangement of just a few new exciting things for that section too - keeps it interesting without having to build and build and build and smush and smush and smush",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334294781441867796",
    "author": "Slow Hand",
    "date": "2025-01-29",
    "content": "There's a lot of ways to approach this topic, but you may get some inspiration by exploring the discipline of orchestration. Here's a screenshot I saved from Ella Feingold where she quickly lists some recipes for symphonic orchestration - to give you some ideas:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1335507047440977963",
    "author": "andrew_yv",
    "date": "2025-02-01",
    "content": "If anyone’s interested in traditional orchestration, The Study of Orchestration by Samuel Adler is an oldie but an excellent place to start",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337469082626166896",
    "author": "montrose recording",
    "date": "2025-02-07",
    "content": "exactly!  like the ballad was beautiful as it was so  there was a bit of a block adding to it, but extrapolating parts from what was played was a fun and fruitful window that got us excited and thinking of the arrangement in new ways",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346576371056382054",
    "author": "Slow Hand",
    "date": "2025-03-04",
    "content": "Other strategies for re-vamping the feel and arrangement:\n1. Trying putting instruments in different registers (move the bass up/down an octave).\n2. Play the song in a neutral form like only piano and vocals and listen for what it might suggest.\n3. Substitute instruments (Ex: bowed bass instead of electric bass).\n4. Try a different key.\n5. Try half-time. Try double-time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1349044276583202887",
    "author": "lystell",
    "date": "2025-03-11",
    "content": "I ran into this wonderful artist. Awesome songs and brilliant arrangements.\nCan someone please help me decipher the room/verb on the vocals on this one. Love that sound :",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360211353960186019",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-04-11",
    "content": "Anyone know of any sample libraries with modern sounding electric/acoustic hybrid sampled drum kits with many velocity layers/round robins?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360253363261804574",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-04-11",
    "content": "Maybe it's hard to explain, here's a rough example of some one shot kits for reference. Looking for something similar that has velocity layers and round robins",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1360262444060115064",
    "author": "Josh",
    "date": "2025-04-11",
    "content": "I started using SnapBack recently. It’s super cool for adding little digital layers to drums. That or trigger is kinda my go to",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1375279546148061286",
    "author": "Juliette",
    "date": "2025-05-22",
    "content": "Hey guys! Hope everyone is doing well. I have a question— when setting up to record vocals, what levels do you generally let the volume peak at, and how does one work with dynamic performances? And a specific question: what should I keep the gain at on my interface?\n\nThis recent project has a very whisper-like vocal section that requires a little more gain, and then a lot of loud vocals that require less gain. \n\nThis ends up leaving me having to either turn up the clip gain during mixing or turning up the bus, which leads to clipping. Or (something I really don’t like, because I tend to hear it a lot more) is adjusting the gain while tracking sections. There’s certainly a way to navigate this seamlessly, but I just don’t know it yet :stare:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1375753903878176780",
    "author": "Deleted User",
    "date": "2025-05-24",
    "content": "I want to chime in here, I mostly agree with what the others said and as long as you don’t unintentionally clip all is well. But I think we can dig a bit deeper.\n\nI like to work in a way during tracking/production that’s maybe a bit more old school with shooting for around -18dbFS on the average. It gives me a kind of fixed reference in my mind which gives me enough headroom for most dynamics. Now the important part is you have to turn up your monitoring/headphones volume to be adequately loud to work with those lower levels and then leave it there.That being said it might be necessary to bring down other pre existing tracks that are too loud.\n\nNow since the volume of the monitoring/headphones stays the same during that tracking session you can use the gain of your preamp (or the output gain of the compressor, if you’re using one on the way in) to adjust the vocal or instrument so that for every part of the arrangement it feels right. So in a sense you are pre mixing during the recording, taking off some work down the line",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386513951096963083",
    "author": "vostral",
    "date": "2025-06-22",
    "content": "Guitar & synth tracks panned wide and almost as loud as vocal. A ton of melody layers playing at the same time, i mean that's top-notch!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386801974447706122",
    "author": "Gabriel Tyranny",
    "date": "2025-06-23",
    "content": "My current approach to this involves a couple of principles, but this is the first that comes to mind:\n\n1. If there’s a part with bg vocals performing different lines than the lead and there’s a lot going on, I try to have a spot earlier in the song where the exactly lines those BGs are performing have a moment to shine. For example, if there’s a low energy bridge where they can be clearly understood before the big hook where they can be perceived but not understood as well in the midst of so much. \n\nWhat this does is allow the listeners brain to process what’s being said with little effort, and then later when it’s in a tornado they can still perceive what it’s saying because they recognize it as something their brain already knows, so it’s not overwhelming for their brain to understand the words of multiple vocals going at once if there are layers of lines being performed (usually syncopated) around each other.\n\nThis applies to instruments as well, but instead of intelligibility of words I focus more on cutting frequencies so everything can fit well in the big moments. If they head a synth at full power in the intro and it comes back for a final hook, you can get away with cutting a lot of meat off of it and still have it be perceived as the same synth, without muddying the mix and also creating a nice ‘bringing the song full circle’ feeling - If the track calls for that.\n\nI typed this off the cuff based in gut instinct so not standing by this message as full proof, but this all feels right to me as I explore what I have done for tracks, without having this much thought or words to it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386802246108450816",
    "author": "Gabriel Tyranny",
    "date": "2025-06-23",
    "content": "^For adlibs or purely musical BGs, AKA layers that add more vibe and don’t need to be understood to get that across, I don’t usually care about this for those.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386808111280558322",
    "author": "Gabriel Tyranny",
    "date": "2025-06-23",
    "content": "To stick with a song I made, MIRROR, I had the lead say anxieties earlier in the song in the middle, then later add those full lines as BGs that almost swirl around the last hooks lead. The lead is performing a part that’s trying to overcome anxieties, and the BGs are saying full lines with the anxieties from before.\n\nPanning was essential to create the effect of the anxieties around the lead, but I found that if I introduced them as panned BGs they were hard to make out behind the lead.\n\nBecause of this, knowing when to make a moment earlier in the song to spotlight what would later be panned made those lines more intelligible once they were in the BG to the sides, because the listeners brain recognized it from an earlier section.\n\nDoes that make sense? I can struggle to explain what I’m doing in practice and this is my attempt, so my bad if it sounds like gobrish",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387834486179368980",
    "author": "Brian Reynolds",
    "date": "2025-06-26",
    "content": "I'm always layering my melodic instruments in the stereo field. I imagine it like making a cold cut sandwich. Noah's comment unlocked something, I hadn't done before, moving the melody thru different layers. The main melodic guitar. I had it at like 60% where I normally leave it. But had it widen to over 80% in chorus. Then more narrow than I would normally have a doubled melodic at like 35%. Usually id just do one guitar, mono to scratch the scene change itch. I save hard panned left right area for chorus guitars or stereo stereo synths to swim in. That with dropping the piano for first half of verse 2 did the trick! Still hoping this is a catalyst for more sharing of ideas",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387838315440636014",
    "author": "hyanrarvey",
    "date": "2025-06-26",
    "content": "As a layer? Like raking a chord under the downbeat or straight up a “chsck”on the mains",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387840526316863589",
    "author": "cian riordan",
    "date": "2025-06-26",
    "content": "That’s arrangement + raked guitars + the compression trick all working together to kick you in the balls",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1388583386586681395",
    "author": "CamSoss",
    "date": "2025-06-28",
    "content": "What are y'all using to come up with horn parts?\n\nFor me it's more for pop and latin, and I love anything that has generative or pre-built phrases that can keep me in a flow, something that can just pin down the vibe quickly for likely hiring players for the final recording session. I am looking at getting NI Session Horns but wondering if there are other options I am overlooking.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389629195788878035",
    "author": "CamSoss",
    "date": "2025-07-01",
    "content": "Is their an EWI controller you recommend? You say wind, but it's not similar to brass? Is it the mouthpiece or fingering that makes it similar to brass or wind?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1391034656379371543",
    "author": "Jonathan Arnold",
    "date": "2025-07-05",
    "content": "What do you guys reach for when you want to add percussions/bongos/.. to add more texture and excitement to your tracks? Splice, Kontakt libraries or even AI Tools? Any recommendation?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1395122834174382242",
    "author": "aliberger",
    "date": "2025-07-16",
    "content": "snd is the mpc's native format for saving sounds, once you get the wavs loaded into memory i believe they can be saved as snd files. pgm files are programs (data like which sample is assigned to which pad and all the parameters around that) which you create on the mpc. programs don't contain any sound data themselves, they reference the sounds by filename",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397667816642973889",
    "author": "Josh",
    "date": "2025-07-23",
    "content": "Do people actually do tempo ramps for every section of a song?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397683784882589747",
    "author": "Josh",
    "date": "2025-07-23",
    "content": "I got stems for a song that literally has a 4 bpm ramp for every section of the song, sometimes it goes up and back down, sometimes it snaps back halfway through",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1398863442651385856",
    "author": "CamSoss",
    "date": "2025-07-26",
    "content": "Since I'm songwriting too I was thinking about having that separately... but I didn't think about just putting lyrics/form as a column on a production tracker like this haha, so that might be the perfect way to simplify, thanks for sharing!\n\nSome follow up questions:\nWhat do the X's mean? Do you find yourself collecting notes elsewhere for more specific production tasks? And what's your definition of arrangement in this context?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1416052755272827041",
    "author": "Brian Reynolds",
    "date": "2025-09-12",
    "content": "Aksel Coe and Aaron Sterling make great sounding drum packs. I have success with using live loops and fills. Organize the performance I want. Then layer samples on top of the snare and kick as needed for fulfilling excitement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417471328528760853",
    "author": "Iwan Morgan",
    "date": "2025-09-16",
    "content": "Make a random quick swipe comp of anything. Don’t listen to it. Loop it. Add complex fx chains. Keep adding sounds without listening. After 3 or 4 layers listen back and see the mess you’ve made. I guarantee there will be something to build on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430705119191760926",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-10-22",
    "content": "Does anyone have a loop of a 16th note snare roll/buildup that leads into another section like a chorus? \n\nLike in this song at 0:00 and at 2:19\n\nhttps://open.spotify.com/track/7s0xV4DZ7g4y3kd0FtSfIz?si=13991db0b0f64706\n\nI'm sure there are tons of other songs that do this but this one is the only one that comes to mind rn",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1431682915556655188",
    "author": "Adam Thein",
    "date": "2025-10-25",
    "content": "+1 for El Clapo, easy to use and it’s ended up on a fair few productions for me even if just to buff up live tracked layers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434892381618176010",
    "author": "BananErMat42",
    "date": "2025-11-03",
    "content": "Bit of a ramble here, guess its a little pushback to commonly seen advice on making music.\n\nLast night i again went at a song ive been working on for an album. I’m three years in by this point and this song is the one that has been the most difficult. Ive made huge rearrangements and changes to this song probably 5-6 times by this point, and always came back to it thinking it still isnt there. The basic concept is alluring but my execution is lacking. \n\nSo most people say \"scrap it\", if the song doesnt come easy then its not meant to be, and you’re better served making a new track entirely. Maybe integrate the best ideas, but start over. You’re in too deep and you’ll never hear it for what it is by this point.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441107449754161153",
    "author": "Jonathan Arnold",
    "date": "2025-11-20",
    "content": "And also how do you like AI tools to generate different voices to create different textures?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444102706435457294",
    "author": "oaklandmatt",
    "date": "2025-11-28",
    "content": "A significant enough difference in pitch or timbre between the two sections you're putting together will sometimes require a fade to sound natural, and also sometimes will require a slightly different alignment of waveforms where the zero crossing isn't the most transparent between those differences.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1445559943968329770",
    "author": "Will Trotman",
    "date": "2025-12-02",
    "content": "Just has a little less zing to it with the string tension a little looser",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453584698117718080",
    "author": "Akanksha",
    "date": "2025-12-24",
    "content": "I have a question for producers who make future bass. I love the genre but I really can never finish a song.\nMost of the time I'd lay down a drop arrangement and then try to create a lead or vocal chop melody but it never fits the vibe.\nHave you ever had this production block? What did you do to overcome it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453654576661135533",
    "author": "Akanksha",
    "date": "2025-12-24",
    "content": "You're so right! I always start with creating a Synth stack first, like layered rhythmic supersaws, then create drums and bass. After that I reach a dead end where I just don't know how to approach writing a melody on top.\n\nI guess I should first start with lead and then build everything around it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453655081101557873",
    "author": "Akanksha",
    "date": "2025-12-24",
    "content": "Like it sounds ok as a loop, but doesn't feel like it can go anywhere. Nothing in it that hooks, so arranging seems impossible.\n\nI made one yesterday. Can we share audio files in this chat?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453745152500699233",
    "author": "spectrummasters",
    "date": "2025-12-25",
    "content": "One of the most helpful things to break out of the 4/8 bar loop of death is to begin your project with the audio file of a track you love the arrangement for imported . \n\nMute it and set your project to its tempo (it’s just easier ) \n\nNow get to jamming away \n\nOnce you’ve built the loop you adore , \nMute it \n\nListen again from top to bottom the track you love the arrangements for . \n\nListen to how the different elements come in and out , where , how . \n\nHow are the motifs evolved . Any counter melody / rythms .\n\nDrops and breakdowns \n\nMake notes of it all . \nThen copy it exactly or to the degree you want with your own elements of your loop . \n\nVoila . You made a fully arranged track . \n\nRepeat",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453745308155514952",
    "author": "spectrummasters",
    "date": "2025-12-25",
    "content": "Now you’re an arrangement don",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453784054393602150",
    "author": "Akanksha",
    "date": "2025-12-25",
    "content": "I tried importing a favorite track of mine and then putting in markers to imitate sections for the song I was making. Failed horribly because then I started to copy every single element of the track which made me so annoyed with myself.\n\nWhat you said might be just the thing I needed to know to start arranging well. \nI should first create the loop and 'then' listen to the imported track to help with arranging. \nIt's so much more intuitive.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456006147898347551",
    "author": "diamndsdancin",
    "date": "2025-12-31",
    "content": "Is anyone here in the film/documentary/tv show/gaming composer category that would recommend where one would start if wanting to try get involved in that world?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456944100803870730",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-03",
    "content": "Yeah you're on the money, the cardboard feel is a mix of velocity mapping and the dynamic response of the samples, feels unnatural and unresponsive.\n\nStuff like Toontrack & Addictive feel great on the kit (ie more natural dynamic response, more layers and nuance), but aren't as mix-ready.\n\nGGD say that with M&M2 they explicitly addressed this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456949294321107076",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-03",
    "content": "Good shout, appreciate the thoughts!\n\nThe libraries have velocity curves per kit item built in, been mucking about with it but there's a mix of not enough velocity layers (which get even more uneven spread when changing velocity curves), few round robins, not enough variety in the samples, and just something else with the response I can't put my finger on. \n\nI starting to think there might be an inverse correlation between basic mix-readiness/consistency and play feel. \n\nCurious where M&M2 falls, but a bit daunted with the opportunity cost of familiarizing myself with another full-featured sampler/mixer 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456956786836770991",
    "author": "Ross Fortune",
    "date": "2026-01-03",
    "content": "Beyond the velocity layers etc, are there any steps you could try like easing off / bypassing onboard bus / individual compression?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456958492358348801",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-03",
    "content": "Good shout, gonna try messing around a bit more with that! \n\nAnother part of what makes these kits sound so good are boost layers/one shots that suddenly pop in at certain velocities, I might turn them off. But that also makes it sound entirely different, almost like tracking with a different guitar amp 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457006107699445884",
    "author": "hyanrarvey",
    "date": "2026-01-03",
    "content": "Also there’s like 20 layers and 15 round robin per layer or something extreme I def don’t think it sounds fake",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460692845068419228",
    "author": "Rob Domos",
    "date": "2026-01-13",
    "content": "I guess what I mean is that the Haley song sounds tighter than the circles stuff (which I own and have used on various projects) and I’d like to take it even further if possible but this is the closest I’ve heard. You may be right about the shortening with processing but I’m a huge sucker for no reflections at all. \n\nAlso not really going for a QOTSA rock kit thing which is a lot of what I’m finding. I’m interested in having the hyper tightness of modern hip hop / EDM drums but with the natural textures of real instruments being hit.\n\nWould be even more hyped about finding tablas and woodblocks than rock drums. \n\nI’ll check out the addictive one!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460734964453871834",
    "author": "Rob Domos",
    "date": "2026-01-13",
    "content": "I’ve used the ableton warp mode in the last and enjoyed the results I’ve gotten.  \n\nFor me it’s not just about shortening the sustain, but also about the complete lack of the source repeating over itself. The less reflections, the less blurry it is, and you get all of these fun extra details in the texture of the sound, and it just effortlessly pops forward more",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465778391470047508",
    "author": "LAPhill",
    "date": "2026-01-27",
    "content": "I know the Spitfire guys have done a few tutorials on string programming, can't say I've watched them myself. They should cover the basics though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1466530464125686008",
    "author": "Bryan DiMaio",
    "date": "2026-01-29",
    "content": "I think it's fine, I've recorded drummers who have two snare drums in their setup and use one for one section and another for another",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469848592117137468",
    "author": "youngteam",
    "date": "2026-02-07",
    "content": "also that horn sound... so that's where elliott smith got it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470639745163071509",
    "author": "Juliette",
    "date": "2026-02-09",
    "content": "I've run into a weird dilemma and I'd love some advice/guidance. A pop track I'm producing on sounds great on the ears instrumentally and vocally, but I keep thinking it could have *more* going on to compliment it. Kind of like adding sprinkles onto a cake. However, I go to to explore other elements (extra vocal layers, extra synths, etc.) and it just throws this feeling of balance off. It's probably a mental barrier after listening to what the demo sounds like so much, but at the same time, I think the track could objectively benefit from some filling out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472302398885069084",
    "author": "diamndsdancin",
    "date": "2026-02-14",
    "content": "i put it on the audio track of the brass sample and just recorded \"transfer\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472955764262961414",
    "author": "Ross Fortune",
    "date": "2026-02-16",
    "content": "Chaotic how? Just poor organisation, or there’s too much going on in the arrangement?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1473399518262198405",
    "author": "austenballard",
    "date": "2026-02-17",
    "content": "What about when _many_ tasks become easy, thereby clearing the path to do even harder things?\n\nAll the art we make now - music, film/tv, video games... all possible because lots of subordinate tasks became easier. \n\nI firmly subscribe to Wagner's concept of Gesamtkunstwerk (Total Artwork), my take on which is that as art forms become easier to do, they are subordinated to even greater, more total art forms\n\nThe example I like to use is a videogame. Making a AAA game needs writers, artists, composers, actors, programmers.... video games are (I think?) by far the largest form of cultural output in economic terms because they're so encompassing of so many human skills\n\nNow that those human skills are getting easier with AI assistance, what's next? How does art, culture, entertainment become even _bigger_, what does our next great format of cultural output look like?\n\nWent a little off-topic for this channel but I am constantly thinking about this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1473485249467121847",
    "author": "Slow Hand",
    "date": "2026-02-17",
    "content": "Maybe it's just my taste, but if I'm sequencing sampled instruments I'm not trying to sample guitars and I don't think we need another drum library, either. Drums and percussion already translate well to sampling (for the most part). \n\nI want strings and woodwinds, or brass. Gimme some of that, and make it something with some real energy and excitement. Their platform seems capable of expressing things that traditional sampled instruments cannot do, so lean into those strengths and make the parts a little more opinionated. A little more unique.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]