[
  {
    "id": "1004834468625924207",
    "author": "Slow Hand",
    "date": "2022-08-04",
    "content": "Last night it saved my ass when mixing a kick drum that was too muted and dark. I dialed in a little upper midrange noise tail to come in after each hit and it gave me just the right amount of decay and presence to feel right in the mix. I love this thing.",
    "reactions": 22,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362069466770313497",
    "author": "Nomograph Mastering",
    "date": "2025-04-16",
    "content": "It seems to me that 99% of Engineers and Producers have this arc. Initial freedom and playfulness, and then a significant period in the wilderness where “getting it right” or “being professional” takes over while they build their technical skills and experience\n\nSome much smaller percentage emerge from this period back into a playful lightness (while having integrated the skills). I would say less engineers than producers IME\n\nThe thing is that it really doesn’t need to be that way, and it’s probably my #1 motivator in posting here - to keep the focus on what matters. Art and play and the human connection it allows is the goal, and no 15 year old girl cares what mic you used on the hi hat",
    "reactions": 21,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196682595795210270",
    "author": "BatMeckley",
    "date": "2024-01-15",
    "content": "Couple things:\n1) no one is actually a perfectionist. It doesn’t exist. I heard a great story of someone telling (I want to say) Richard Marx that he hadn’t released his record yet cause he’s a perfectionist and RM replied “Bullshit. Name one thing you’ve ever done that’s actually perfect. You’re just scared to move on.”  That story has stuck with me.\n\n2) I’m a fairly decent guitar player, have made an actual career of being paid to do it. And I STILL am either constantly hiring people better than I or recording things note by note and then assembled in protools afterwards. Dr Luke might be the best guitarist I’ve ever been around (and I’ve hung with Blake Mills, Tim Pierce, Phil X), and he CONSTANTLY would just hit record, play the four chords of the song free time, and then cut them up and drop them on the ones or wherever they’re supposed to go in the song. My favorite thing about making records vs performing them live is that on record NO ONE CARES how you got there, just that you did. Unless your groove has something particularly magic to offer I’d get over the one take mentality pretty quick.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362111650307506257",
    "author": "Rollmottle",
    "date": "2025-04-16",
    "content": "How to simultaneously operate as if there are no stakes, while being in the chair with real stakes at play? Some questions I ask myself:\n\nDo I instinctively know the tools I have? Do I operate whatever tools I choose as if they’re an extension of myself? Do they disappear? There’s never a question of what do we use here, you just know. You weren’t bound by your tools when you didn’t know them, why would you be bound by them knowing them cold? Embrace and commit to what you have. The new plug-in isn’t going to make you better. \n\nAm I operating from fear and scarcity? What will my engineer friends think of my snare? What if I release the song and nobody listens? What if I’m not as good as I think I am? What if I don’t get another client? What if I can’t make rent? These can all creep in to make what was once fun and playful, “work.” But you probably didn’t get into this to do “work.” Success is built over time, not whether you fucked the snare tone that one time. Be OK with failure. Embrace it. Then, ask yourself: do you *really* have anything to lose?\n\nDo you know who you are? You’re not Shawn Everett or Jon Castelli or Serban. You’re you. Stop trying to parse what Castelli would do and start knowing what you’re going to do. Run towards your idiosyncrasies. Embrace them. Become undeniably you because I bet whatever you did years ago was unmistakably you.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376707792471199765",
    "author": "BatMeckley",
    "date": "2025-05-26",
    "content": "Someone in the mix channel had mused about what Serbian’s assistant’s do, and it brings me back to “The people that know how will always work for the people that know why”\n\nDo you know the actual reasons why you feel your work doesn’t measure up yet? Hint: it’s very rarely strictly the sonics and/or mix. That Olivia Rodrigo album sounded objectively terrible, but FELT awesome. And that’s what mattered in the end.  Benny Blanco became successful with a folder full of songs at 120 bpm cause he didn’t know how to change the tempo, and stacks of kick drums because he didn’t know how to eq (he just layers a brighter kick on top if it needs more snap). When I’d ask him why he pretty much did anything it was always “I dunno, man, it just sounds cool!”. Make sure you’re attacking the work with that kind of mindset. \n\nWhen I get lost in the minutiae I try to zoom out and just be like “does this whole track feel good? Am I instinctually bobbing my head?” And if not, why?\n\n95% of the songs that people have sent me here, the issue hasn’t been their space, or their monitoring, or whether they used a 60s or 70s guitar, or if they mixed analog or in the box. The issues almost always tend to be much less narrow in scope. Make sure you zoom out and just go “is this cool?”",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954057387021594664",
    "author": "oaklandmatt",
    "date": "2022-03-17",
    "content": "omg i need to go on twitch and show this. \n\ni want to spend hours (maybe my whole life?) talking about groove.\n\nlet me try and make some time for this",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094318611922964520",
    "author": "popaganda.",
    "date": "2023-04-08",
    "content": "I’ve been deep-diving on Daniel Johns this last week and really been thinking about the toll that being creative can take on people. It came up yesterday in the VC too. In some ways our culture likes to reward artists being martyrs, but it’s never something to strive for. I think as producers one of the biggest parts of our job is to be a grounding presence and a support for artists who can sometimes have pretty wild swings. But we’re artists too in our own right with our own bipolar tendencies. In a way that can create an empathy bond between us…we can understand the manic exuberance of making an amazing thing and how there’s usually a pendulum swing in the other direction to compensate. But I kind of think our job as producers is to have our shit together enough to buffer that bipolar thing and make a sanctuary where an artist can feel at home. Just my random thought for the day.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090273913826713680",
    "author": "esquinalee",
    "date": "2023-03-28",
    "content": "Percussion is the sauce! I don’t think people have enough respect for how live perc brings life to the groove.\nAlthough I will say that every time someone picks up a tambourine, Uncle Ben’s “With great power comes great responsibility” should be better understood 😅 the wrong person can and has killed the groove",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014614000069247096",
    "author": "Will Melones",
    "date": "2022-08-31",
    "content": "I can just imagine this scenario. A producer sequences all the drum parts, they do the demos, write the song and whatever. Then they book a session and Matt Chamberlain shows up with a pristine Drum-Doctor tuned kit and an invoice for cartage. “Ok, we want you to play exactly what’s on the track, we like that.” He’s a pro, so of course he does. They quantize the performance, finish the song, and send the track off to @cian riordan  who DRTs the drums and replaces them all with Steven Slate one-shots and buries the cymbals.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070262043233505371",
    "author": "Nomograph Mastering",
    "date": "2023-02-01",
    "content": "Make a template that has German polka music on a stereo channel. 1) Blank page fear is eliminated 2) If you can’t beat Polka music you should probably quit",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310998613047902288",
    "author": "Rollmottle",
    "date": "2024-11-26",
    "content": "adding stuff is always effective but i like trying to pare back the arrangement to see if i can get away with something. dropping the kick, the bass or snare for a bar, 1/2 a bar, or one beat can sometimes create the transition without adding anything.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331733580111548500",
    "author": "Skyler Young",
    "date": "2025-01-22",
    "content": "Also I’ve been building an 808/synth bass plugin because I think there’s a lot of room for improvement over 808 cooker and sublab",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020845158075465778",
    "author": "ALXCPH",
    "date": "2022-09-17",
    "content": "I've been a \"musician\" since way before i started recording and producing stuff. (Since i was 4 i think). It's such an integral part of how music can feel and make you move. Think about how someone like Anderson paak. can make you dance by just playing 8th notes on a highhat and nothing else(see tinydesk for ref.) or Pino Paladino, will make you break your neck with his bass, playing simple Quater notes. (anything D'angelo).  Even in a genre that is as quantized and on the grid as it gets like a lot of hiphop/trap is, notice how the artist(rappers) that really stand out, are the ones that make those beats really groove/hit because of how they themselves \"groove\" or flow on those beats. They might be slightly behind or in front of the beat, or they might even swing a little. \n\nYou can really get into the micro and macro dynamics of groove. Listen to guys like Led zeppelin, how they might start out a song a few BPM slower than they finish, because of the build up of energy through out the song, and it doesn't sound wrong or unnatural. \n\nA fun thing to do, when looking for inspiration for grooves, is record some foley, and look for naturally occurring rhythms in the sample. Try and build a grove around that probably a bit wonky rhythm. It can really be an eye opening experience once you realise how much fun rhythm and groove is, when you don't have to obey the grid in a daw like a machine. \n\nBut like anything music, it's really about listening and feeling. Really internalising what a forward or laid back snare feels like or a bass thats almost a 16th behind the beat.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168793470564044820",
    "author": "Zack Hames",
    "date": "2023-10-30",
    "content": "You’re gonna hate this. But the best way is to just get more reps to get faster and better. 10,000 hours, no shortcuts.\n\nBut more actionable advice - stick to a slim number of EQ and Compressor plugs and just use those. For example 99% of my mixes just use pro q3, API-2500, and Kush AR-1. The idea being minimize variables and decisions, and use stuff you know ridiculously well.\n\nProduction side, I find having go to sounds, samples, and instruments (hardware or software) well learned and ready to go shortens the path from opening your project to creating music. For me, this is taking my free time to mess with my MPC and explore samples, or to create patches on my synths to become more intertwined with my instruments. This is separate from the actual “I’m gonna make a song today” process.\n\nUltimately…make a song in 8 hours as many days as you can. If you TRY every day, that’s better than nothing. By the end of a month, even if you only made FOUR tracks…that’s better than nothing and it just adds up.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183514215865143347",
    "author": "Slow Hand",
    "date": "2023-12-10",
    "content": "> \"How are y'all thinking about which part of this waveform should fall on which side of the beat?\"\nI'm listening and not looking. Nudge. Listen. Nudge. Listen.\n\nWhen it comes to groove or feel it's common for the ensemble to not line up perfectly or even *sound* as if they line up perfectly on transients. Quite often the band are flamming against each other in a way that is tasteful. Sometimes they're dead-on for a beat and the next moment they're doing a tight flam. \n\nDon't get lost solo'ing instruments. Keep the entire song section in perspective when you tweak. If you're having trouble making choices mute a few instruments, but don't solo.\n\nAlso, fader level has a massive influence on groove. Before you start editing too hard play with your fader balances and find the groove that way. Listen to how the proportion of instruments changes the groove. It may turn out you don't need to do much, if any, micro editing.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334294937176375327",
    "author": "Slow Hand",
    "date": "2025-01-29",
    "content": "Granted, her examples are *very* specific to orchestra and not directly applicable to pop records, but the underlying principles here include:\n\n**1) **Think of instrument combinations as a single composite voice.\n\nOne instrument can function as the \"sustain\" portion of the sound and a second instrument gives the \"attack\". Together they create a single melodic voice.\n\n**2) **How do the instruments stack on each other? Do they clash? Cellos doubling a bass an octave up extend it's timbre into a higher register to make it read better. It's not so different from adding fuzz to an 808 so that it has more presence.\n\n**3) **Which instrument will cut through the music?\n\n---\n\nA few concepts that I'll add:\n\n**4) **Instruments in the foreground vs. the background. Know which part is the lead (focal point) at any given point in the record and then pare down the presence of the rest and push it into the back of the sound stage.\n\n**5)** (Piggybacking off of Felix's excellent post) What is the simplest way to achieve the desired effect? Reduce. Reduce. Reduce.\n\nCut instruments and parts ruthlessly and approach it with a minimalist's eye. Like writing a haiku: How few elements can you use to create an impression? Maybe a guitar part is carrying 90% of the groove and the drums only need to be a kick and a snare. Or maybe the guitar is covering the backbeat too, and you don't even need a snare!\n\nConstantly ask yourself \"What is the most important sensation in the record?\" and then focus it by cutting out everything that gets in the way.\n\n**6)** Hocketing. Pass the melody off between different instruments at different points in the song. Play it in different registers. Combine voices occasionally for special effect.\n\n**7)** Tonal contrast. Dark instruments plus bright instruments. Distorted and clean together. Near vs. distant.\n\nElements that sound same-y will gel together and elements that contrast tonally will pop.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "966040932275335198",
    "author": "BatMeckley",
    "date": "2022-04-19",
    "content": "This. Also at 171/173 I’d just skip the audition bit, save your time and xform up to 173. Things tend to hold up better going faster than going slower, and you’re talking about essentially a half percent difference in timing.   \n\n(Unless you’re talking about the snare reverb in Mr. Mister’s classic hit Kyrie where the verb is Conway A’s room at half speed to achieve such a deep and majestic result)",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169789222102769764",
    "author": "BatMeckley",
    "date": "2023-11-02",
    "content": "There’s one specific actress/singer I’ve worked with a few times, and the second time she brought her mom over while we were tracking. Every time I complimented her after a take, she screwed up the next one. If I said a take was bad the next one would be great. The session quickly devolved in to me just saying increasingly awful things after every take, much to her mom’s delight who was laughing on the back couch.\n\nI’ve said this over and over again on this server, but people skills and just sheer musical awareness and taste trump technical ability and gear every time (the how vs the why). If I’m needing Kirk to record an incendiary angry solo in the middle of a heavy, emotional song, I’m probably not gonna set up flowers in the studios and kick it off with a warm stone massage.  Your job as a producer is to get the best out of the artist, and a good producer will have a feel for what that specific artist needs.(A Rick Rubin specialty).",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241812975019364462",
    "author": "LAPhill",
    "date": "2024-05-19",
    "content": "We're not privvy to the conversations and the process that led to the results of finished songs. In the same way that sometimes the rough mix wins, sometimes that loop that you grabbed just to kick off ideas ends up unbeatable. Rerecord with different sounds, trying to match or improve the feel, but there was something about the way those Splice loops interacted that couldn't be beaten. Or just isn't worth the effort because now everyone is focused on making sure the vocal is perfect and the track is working. \n\nI'd take the best version of the song over some self-imposed creative high ground any day.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418242748632273089",
    "author": "Will Melones",
    "date": "2025-09-18",
    "content": "Please don't pee in the groove pool",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954057628785471588",
    "author": "jonmatteson",
    "date": "2022-03-17",
    "content": "Listen to D’angelo’s voodoo and listen to the placement of the notes in each instrument. Questlove tends to lay the hat behind and push the snare which makes a sort of flaming vibe which is very pleasing. Also pino’s bass is behind his kick and the guitar behind pino etc. all about push and pull of the elements!",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062453260826460221",
    "author": "peterlabberton",
    "date": "2023-01-10",
    "content": "I took a drum lesson from Victor Indrizzo a few years ago (which was super awesome), and one thing I remember is that he said he often does a pass with shaker or tambourine before doing the drums, even if it gets muted in the end. Then plays to that instead of the click. It’s more fun to play to, and it infused his feel in the track from the jump, AND it keeps him from doing too many unnecessary subdivisions on that hat or ghost notes on the snare that don’t need to be in there.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066841550031691817",
    "author": "Ross Fortune",
    "date": "2023-01-22",
    "content": "Also beware of obsessing over the phattest kick drum sound on the planet and patting yourself on the back when you finally nail it, only to discover 10 hours later when the chorus just isn’t taking off that your overweight kick is what’s been slowing down the groove and/or muddying the how the bass interacts with the drums",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075849563459555368",
    "author": "NoahNeedleman",
    "date": "2023-02-16",
    "content": "@mcneazy for pristine pop, edit the fuck outta them drums, get them gridded and feeling great. 9 times outta ten gridding them will actually improve the feel, and in the spots where it doesn’t you can always comp back in. \nThen edit bass to the kick & snare, when it’s right the bottom will tell you. \nThen call Beckley to edit your vocals.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142151095209185391",
    "author": "bobby k",
    "date": "2023-08-18",
    "content": "I will say this, on the topic of standing up for yourself -- I've seen a couple times in these threads now a general sentiment of accepting that people are gonna kick you around. It felt evident when we were riffing on sliding scale mixing rates last month and it felt evident this morning/last night in here. I'm all in on the greyhound sentiment, I've been a grafter through and through since I was in elementary school skipping homework to double up on piano practice. I once drove 7 hours to buy a Juno-60 on Craigslist and the guy didn't answer the door; I make DUMB life decisions all centered around this non-negotiable gravity towards the art. I can promise I have whatever that obsessive brain disorder thing is that we all keep riffing about (and believe the same for the grand majority here). But can we not practice a little self preservation along the way? Nobody besides your team is really gonna stick up for you; I believe that in line with the all the professional metrics there exists the opportunity/need to set  precedents on how you want to be treated. I don't think this is something that *comes* with being a great producer, I think it's something that *contributes* to someone becoming a great producer. And of course, knowing how to ask for that fairness with a kind/patient/assertive/flexible tone is critical. But if I believe something is a little crooked in the system, I'd rather not wait till I hopefully arrive a decade later on the other side of the fence to be able to do something about it. I would rather make an attempt at being heard now and see whether it makes any progress, even if it just gives some suit on an email thread something to think about. It's not for the sake of my own ego, it's for the sake of our entire breed.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1249472629056864338",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-06-09",
    "content": "I CANNOT BELIEVE the 909 hi hat/cymbal exist and are real https://www.instagram.com/reel/C7-UxxMvea3/?igsh=MzRlODBiNWFlZA==",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265646002292002877",
    "author": "Bryan DiMaio",
    "date": "2024-07-24",
    "content": "I'd go all chips in on this being about a hi hat mic",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429319170616594504",
    "author": "BatMeckley",
    "date": "2025-10-18",
    "content": "Brothers and sisters of the ‘cord, when you find yourself collaborating with other people on a project, for the love of God don’t send an mp3. Send a .wav whose master bus processing is properly compensated for so that your collaborator can drop your file into their session at beat one and it will line up perfectly. Do not make them guess. No, the transient of your kick isn’t exactly on the 1. \n\nLet it be written.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954060046235488256",
    "author": "oaklandmatt",
    "date": "2022-03-17",
    "content": "@Zack Hames yeahhhh. watch the questlove video on youtube where he talks about d'angelo asking him to play crazy laid back and flammy too.\n\nmy general thought on timing is: behind the beat is more groovy and laid back (vocals, percussion, bass against the kick drum, etc) and ahead is intense and anxious (especially vocals).\n\nthere are many examples of groove being behind the beat as that's something people talk about a lot. definitely dive into that concept and play with laying different elements back off the grid.\n\nbut i LOVE talking about being ahead of the beat. purists complain that a lot of modern hip hop vocals are ahead of the beat and \"off time.\" but when it's done well it makes the tracks SO exciting. lil durk, 21 savage, gucci, etc all have this excitement in some of the songs because the vocal are ahead. \n\ni've heard the argument that these guys are just amateurish in their skill. that might be true, but their natural groove and cadence works. also listen to kendrick on \"Family Ties\" where he goes in and out of being ahead of the beat and it sounds exciting as fuck when he does.\n\nalso \"Icky Thump\" by White Stripes is a song with vocals that are entirely ahead of the beat. clearly it's deliberate as jack white is a rhythmic genius (and the doubles are perfect). it adds this anxiety to the whole song that is SO dope.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211786101853782067",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-26",
    "content": "I‘m in a bit of a situation here\nProduced and mixed a song for an artist that starts with something akin to a tom roll into the one \nI put a bit of silence starting lne beat ahead at the beginning of the song so the ME can put it on the grid and just cut it out later which I thought would be no problem \nNow after 4 revisions he still hasn‘t managed to properly cut tje intro (3 times he left the silence the 4th time he made a fade at the beginning and cut away the attack of the roll) \nNow I sent the files edited in exactly the way I want it back to him but now he says he wants to charge an additional fee for that master\nDid I do the wrong thing? Should I just have cut the files the way ai want them? (files plural bc he wanted the vox and instrumental stem plural) \nI honestly thought properly cutting silence at the beginning wasn‘t gonna be this much of a problem",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987585206166908929",
    "author": "BatMeckley",
    "date": "2022-06-17",
    "content": "I had a record like this. Ended up using the over head compressed as the bulk of the sound and layered in snare kick and Tom with samples to fill out what I’m missing. Actually was the record that ended up launching my mix career, so maybe a blessing in disguise?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018563046676889710",
    "author": "peterlabberton",
    "date": "2022-09-11",
    "content": "Under 40 hz? If we’re taking *that* low, in my experience usually kicks benefit from sitting just slightly above that range, especially in rock—somewhere around 50-60hz. Usually they sound punchier and less flabby with just a touch of the super low lows rolled off. Basses can move around a bit more, obviously, but I also find that usually even if you have a fundamental around or below 40 hz, the first harmonic an octave above is usually what you’re actually interested in. Also it’s very song/arrangement/tempo (!) dependent! A slower tempo or less busy kick pattern or song arrangement will let you get away with loads more super sub stuff. Faster patterns will just sound like flabby mush with tons of sub.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050162938612293632",
    "author": "NoahNeedleman",
    "date": "2022-12-07",
    "content": "I love splice, but the amount of time it takes me to find the beat I’m looking for is usually greater than the time it would take me to program it.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059561821863944223",
    "author": "stefanmacc",
    "date": "2023-01-02",
    "content": "I usually loop 4 bars of a real hi hat and real cymbals and that usually takes the computer out of the situation. Even if the kick and snare are the same velocity and sample over and over . The hat being real usually does the trick.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066813164085330051",
    "author": "Slow Hand",
    "date": "2023-01-22",
    "content": "I don't think anyone is going to mind if you layer another kick on top or replace it with something that feels the same. Unless they're some sort of acid-house purist, or something.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073443477225996309",
    "author": "austenballard",
    "date": "2023-02-09",
    "content": "Test is done. Tl;dr they don't null completely. They don't even detect the same audio the same.\n\n**INTRODUCTION**\nBeckley, et al. (2023) reported differences in tuning results between the plugin and standalone versions of Melodyne. This investigator undertook a test of Melodyne plugin, ARA and standalone versions to determine whether the resulting tuned audio would null.\n\n**METHODS**\n\nAll testing was performed at a sample rate of 48kHz and with .wav files at a bit depth of 32 bits. Tuning was tested using two 2-second square wave tones generated with FabFilter One in Logic Pro X. Tone #1 was generated at a constant pitch of C4 +50ct. Tone #2 was generated at a pitch of C4 with the following settings: Modulation Generator (MG) Frequency set to 4.033 Hz,  MG waveform set to value 0.500, and Frequency Modulation MG set to value 0.123. Each tone was printed on a separate channel as a Bounce-in-place (bip). The two bips were then joined into a single, 6-second, mono .wav file with 2 seconds of silence between the bips. The 6-second .wav file was copied onto two new channels in Logic Pro X, and dragged out of Logic Pro onto the desktop for use in Melodyne standalone.\n\nAudio was transferred into Melodyne: one mono channel in Logic Pro X was loaded with an instance of Melodyne non-ARA, one mono channel in Logic Pro X was loaded with an instance of Melodyne ARA, and the copy of the .wav file on the desktop was loaded into Melodyne standalone. All transfers were completed using the Melodic (Standard) algorithm. \n\nTransferred audio was quantized to pitch C4, offset 0 ct, Pitch Modulation 0.0%, Pitch Drift 0.0%. All other settings were left at defaults; Note Assignment mode was checked to verify that Playback Type in each case was 'Tonal'. \n\nResulting audio was printed and imported into three new mono channels in Logic Pro X. Null testing was performed using the phase invert feature in Logic Pro X's stock 'Gain' plugin.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075830797652721796",
    "author": "Nomograph Mastering",
    "date": "2023-02-16",
    "content": "Could we at least tip our hats to the idea that these instruments could be played correctly, and that things could lock and groove at source?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119343014221992036",
    "author": "Maxim",
    "date": "2023-06-16",
    "content": "If you want to get a kick properly, try isolating each section rather than fading. Izotope Imager is great for this. \n\nJust create 4 bands spread evenly and export all of these bands separately in solo. Then bring them back, stack the 4 layers and cut the noise from each band until you only hear the kick (transient). This will let you keep those long lows intact without the noise up top.",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1150106912537460878",
    "author": "hyanrarvey",
    "date": "2023-09-09",
    "content": "It’s going to be a backlash to all the gridded beat music that’s been dominating the charts for a decade",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204814597857611838",
    "author": "Ross Fortune",
    "date": "2024-02-07",
    "content": "Thanks to all the folks for suggestions on perc replays. I slept on it, had a listen and realised that I'd been ignoring a really key element in the loop. I'd already programmed a kick / hat / snare / clap pattern, but underestimated how much the filtered version of that in my borrowed loop was adding to the groove.\n\nStumbled upon an Oliver loop that did just what I needed in that department, and suddenly it all came together. The replay of the perc I'd already made was good, I just didn't see the glaringly obvious because I was so deep in the weeds with perc details.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220446892773867661",
    "author": "NoahNeedleman",
    "date": "2024-03-21",
    "content": "Quick reminder that 808 cymbals are super useful",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246512908058361959",
    "author": "youngteam",
    "date": "2024-06-01",
    "content": "Field recordings on phone get uploaded to a cloud - app on computers generates inspiring patterns and rhythms with it that you can tweak",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1281006795309187103",
    "author": "LAPhill",
    "date": "2024-09-04",
    "content": "@Rob Domos I'm late to this convo, but @BatMeckley pretty much nailed it. Serve the needs of the project, not your ego. The important thing in a talking heads video is the content of the dialogue, not how unique your kick drum sounds. So support the emotional context of the script and everything else is gravy. \n\nThe dialogue is your lead vocal. Anything that's distracting from it has got to go.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328826018793914568",
    "author": "LAPhill",
    "date": "2025-01-14",
    "content": "IME it’s really hard to write anything you want with sax samples. They sound much better when you play to the library’s strengths. Session Horns is good, Project Sam’s Swing is good for a section sound",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994734853247471798",
    "author": "Slow Hand",
    "date": "2022-07-07",
    "content": "Strong second on the Ableton drum rack: (*chef's kiss*). *Big* fan. \n\nIf you want to go a step down the ladder of components I would also give big props to the Ableton sampler (Simpler). It's so refined and well-integrated into the DAW that it feels like my left hand at this point.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020827273697435658",
    "author": "Slow Hand",
    "date": "2022-09-17",
    "content": "This is a good point you bring up. Groove doesn't occur only at the onset of the note. It also matters where you choose to *end* a note.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062024127273242695",
    "author": "NoahNeedleman",
    "date": "2023-01-09",
    "content": "Perform them! I like Abbey Road 60s Dummer, then you can quantize to whatever swing you like. Logic 16a for a good natural feel. \n\nSo much faster than searching for a loop.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062042132174622720",
    "author": "hyanrarvey",
    "date": "2023-01-09",
    "content": "Also from my experience editing countless of drummers groove in the dynamics not the timing, and that helped bring my drum programming to near human level",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062376454685474896",
    "author": "Iwan Morgan",
    "date": "2023-01-10",
    "content": "All this Hi-hat chat reminds me of a method i’ve not seen used before anywhere else.  I made a record in Nashville a few years ago with engineer Mark Nevers (Bill Callahan, Bonnie Prince, Lambchop etc) and instead of using click tracks he had in his template a load of shakers, side sticks and percussion loops which he had recorded all set with Elastic Audio and Tick based processing. What this meant was he could create a shaker type click just by changing the blend between the samples and pushing the tempo up or down. It worked really well on what was an acoustic based record. The players loved it, and I swear they got master takes quicker without being bludgeoned by the normal click.  Anyone done this before? Is it a Nashville thing?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070334670664908902",
    "author": "austenballard",
    "date": "2023-02-01",
    "content": "Set up your slices, then right click > Slice to Drum Rack",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071897658131746856",
    "author": "LAPhill",
    "date": "2023-02-05",
    "content": "I've been on a project lately with a director I've worked with for years. We never talk in specific music terms. On this one, there's an outside producer involved who fancies himself a musician. He constantly talks to me in terms of \"the 808 needs more saturation\" or \"I think what we need is more 3K.\" And the director's body language visibly slumps until we get back to talking about emotions and intent. I'm here all day for conversations about the WHY, but I don't ever want to get bogged down in the HOW.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084558167536578663",
    "author": "Slow Hand",
    "date": "2023-03-12",
    "content": "That said. We're also trying to capture spontaneous magic.  I think there's a strong case to be made that as producer/engineer you need to be set up for a high-quality take at all times. Even if you decide to return to the original version of a song, it sucks to find that you can't beat the \"demo\" vocal and that the keeper take has someone talking in the background.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090803602576113755",
    "author": "Rob Domos",
    "date": "2023-03-29",
    "content": "Y’all working off of old spectrasonics cd’s from the 90s or drum machines or what?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093033912059559966",
    "author": "BatMeckley",
    "date": "2023-04-04",
    "content": "A team of very smart guys and some apeshit good singers. Think that was the record that beat me for the Grammy that year. Well deserved.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103332566234300506",
    "author": "Bryan DiMaio",
    "date": "2023-05-03",
    "content": "That's a lot of the reason why Terrace's stuff has so much of a vibe, he gets a lot of musicians together and sometimes we'll chop stuff around but always keep the context set. It's so live, even the 808 drum kit on Drones was an electric kit hooked up to an 808 machine lmao",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137093054629687377",
    "author": "Jeremy Klein",
    "date": "2023-08-04",
    "content": "4 years ago is when I started producing with my buddies in a niche of the rap world. we considered doing type beats to 'get our names out there'. But we discovered that the type beat world is basically one step removed from Gary V internet entrepreneur e-book salesmen-core and is just a volume business that would ultimately cheapen our yet to be established brand.\n\ninstead, we just cold DM'd artists who were a little bigger than us and asked them what kind of beat they wanted and we'd make it for them. \n\n4 years later, and those artists we dm'd are some of our closest friends. 2 months ago we just toured europe playing sold out shows with one of those artists we cold dm'd. Guaranteed we would not have built those relationships if it was just type beats that these artists were buying from us for $50 - $100.\n\nSorry this reads like a LinkedIn post lol",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214951414019653713",
    "author": "popaganda.",
    "date": "2024-03-06",
    "content": "Getting a real hi hat and ride will change your life if you’re doing a lot of realistic drum programming",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1249573155698245653",
    "author": "NoahNeedleman",
    "date": "2024-06-09",
    "content": "I’m on record saying the 808 cymbals are ubiquitously useful",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313564511353049141",
    "author": "NoahNeedleman",
    "date": "2024-12-03",
    "content": "Yeah. People performing kick & snare patterns & quantizing for time but not attending the velocities",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366573229916815400",
    "author": "Slow Hand",
    "date": "2025-04-28",
    "content": "Three things come to mind: \n\n1) **Note length and envelope**. That's going to have a large influence on the feel. Electronic producers will spend a *lot* of time sculpting the volume envelope relative to the tempo. Trance producers have entire plugins that give them microscopic control over the pitch and volume envelopes of kick drums.\n\n2) **Presentation and proportion**. Is it up-front or does it sink into the back? It's easy for a 4x4 to feel hackneyed or overbearing. Sometimes all you need is a gentle *pat pat pat pat* to tie things together.\n\nA fresh or unconventional texture will open up drastically different feels. People can dance to anything if it's got a 4x4 click, so it doesn't necessarily *need* to be a kick. You can go far using samples and percussion that sit in different registers, but play the same role.\n\n3) **Complimentary instruments**. If the kick is the \"rock\" then the groove is going to come from how everything else swings over that. What's the friction like between the kick and the other elements? If the kick is a \"straight man\", then the other elements pushing off of it are where the magic comes from.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366575657185837088",
    "author": "Slow Hand",
    "date": "2025-04-28",
    "content": "I love how detailed and deep something as simple as crafting a 4x4 kick can be. Bit of an art form in itself.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941768896900395028",
    "author": "Jeremy Klein",
    "date": "2022-02-11",
    "content": "i love blending splice percussion loops that have a lot of natural variation into my programmed drum parts. just chop them to fit your rhythms but try to use every part of the loop (i.e don’t just take one snare from the loop and paste it everywhere)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "968192285290397706",
    "author": "Deleted User",
    "date": "2022-04-25",
    "content": "for toppers i like going to\n\n808 toms, hitting random objects with sticks or knocks on surfaces, short loop of vinyl crackle or any sort of rustling/scrambiling somewhat quantized to have a rhythm, mangling with found sound (this may or may not work cause they have such strong characters and very particular mid-high frequency content), timbale fills, congas and bongos, or any random noises into distortion (to just bring out every bit of low level stuff) going through gated filter sidechained from a drum loop (it can be the main drums or any other random rhythmic thing to key the filter envelope)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994720969711169619",
    "author": "gatewoodsensei",
    "date": "2022-07-07",
    "content": "Honestly, the drum rack in Ableton is a slept on instrument. Back when I used Ableton, I was in there ALL THE TIME.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062442086642765996",
    "author": "Slow Hand",
    "date": "2023-01-10",
    "content": "Yeah, this is a really cool approach to metronome. I once worked with an engineer who had a drum machine/sequence set up where he could fade in and blend different rhythmic subdivisions. (1/4, 1/4t, 1/8, 1/8t, 16, etc...) The samples were all shakers and pleasant sounding percussion. It was way more musical than getting pummeled by the worlds crispest woodblock on the quarter-note pulse.\n\nHe said he'd developed it after doing a lot of slow doom-y metal records that grind along at ultra-slow tempos and where the players are playing very spacious but angular rhythmic parts that needed to come in on the \"+ e\" of beat 3 after a 4 bar rest. Stuff like that. Having 1/16t subdivisions alongside the 1/4 pulse was really helpful for the players to come in strong when they needed to catch a really tough entrance.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066827071940218940",
    "author": "Ross Fortune",
    "date": "2023-01-22",
    "content": "Bless the Linn kick from 24k Magic",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080821370277068800",
    "author": "GaspardMurph",
    "date": "2023-03-02",
    "content": "Producer friends! My good friend Tom Daveau (drummer in French band L’Imperatrice) and I want to make a drum sample and loop pack, mainly for fun and would be a good time doing this together. A few questions:\n1) what are the top 5 most important things for you in purchasing a drum sample pack ?\n2) I’m always annoyed that all samples are 0.0db normalized and I always have to turned them way down to keep my gain staging coherent, would I be crazy to have them peak at -8 ? Would people automatically hate it ? \n3) In acoustic drum packs, how interested would you be about having the mixed loop but always the stems from that loop (separate mics, or at least kick, snare, kit etc…)\n4) how important is it for there to be pre-made battery/drum rack/kontakt instruments of the library or are straight wav files cool ?\n5) what is the sample rate standard for sample librairies ?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596054035271764",
    "author": "BatMeckley",
    "date": "2023-04-03",
    "content": "It’s so funny to watch the people I know layer kick samples, then 2 years later another producer use their 8 layers as one layer, then add 5 more layers, then 2 years after that the original producer sample that 13 layer deep kick.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596735626444951",
    "author": "LAPhill",
    "date": "2023-04-03",
    "content": "I was working with an EDM guy who was like \"yeah, this 808 sample is only good for F and G.\" It was eye-opening how narrow the sweet spot is with these samples.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092608485155426404",
    "author": "sukhuno",
    "date": "2023-04-03",
    "content": "I’ve tried creating the “ultimate 808” patch but it just doesn’t hit the same as using a sample. Something about baking in the processing at a certain tone (the ideal tone for that sound) and pitching it seems to always sound better than the processing acting on it at all different tones. I’ll take the bait tho and make something in ableton that’s playable - should be a fun exercise",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103379848153530509",
    "author": "popaganda.",
    "date": "2023-05-03",
    "content": "I will add though-some of us here do live shit, some do exclusively Legos, and you can be shit or great at both, and one is not inherently better than the other. But if you want to add life to your Lego track YOU add the life. Play it in. Play the song all the way down. Quantize less. Get excited when you’re producing….Make it live-action rather than RPG. Remember that YOU are the most analog thing in your studio",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105155305807020062",
    "author": "Josh",
    "date": "2023-05-08",
    "content": "So I had a song that needed a played hi-hat, don't have access to a kit or a live room right now, but I do have access to those quiet cymbals, so I just voice noted me playing the part and it actually goes???",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135883026912522370",
    "author": "GaspardMurph",
    "date": "2023-08-01",
    "content": "There is no Hi Hat on “Hey Ya” by Outkast",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136015568936378489",
    "author": "BatMeckley",
    "date": "2023-08-01",
    "content": "I actually use snare bottom quite a lot. Compress to hell, and then gate triggered off the top snare, and use the release of the gate to basically dial in the desired length.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150161320268804146",
    "author": "Zack Hames",
    "date": "2023-09-09",
    "content": "As if drum machines replaced drummers entirely.  As if the electric guitar replaced acoustic guitar. As if tubes are actually obsolete in audio. \n\nAI is a trendy word. It used to be called “algorithm” 🙄 \n\n/rant",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150218878211850310",
    "author": "BatMeckley",
    "date": "2023-09-09",
    "content": "I disagree. Actually there are hits  on the radio right now where a decent portion of the lead vocal has actually been AI’d, and not sung by the artist… and I would posit things like drum machines (or at the least addictive drums or kontakt… etc) make up a significant chunk of the top 40 as well. You’re not going to be able to put the toothpaste back in the tube. There will always be room for humanity in music, and I agree with the idea that there will be a backlash towards overly quantized music resulting in at least the perception of real people playing “real” instruments, but AI is here to stay, like auto tune, or melodyne, or beat detective. It’s just how heavy handed will it be used.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1165757370970939542",
    "author": "youngteam",
    "date": "2023-10-22",
    "content": "I've been really enjoying this new series on youtube to check out what producers are up to these days re: sound selection, patterns and genre. I'm particularly impressed by this dude, very big range to these beats. https://www.youtube.com/watch?v=eIJnXw-6PGg",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168804285660798996",
    "author": "Marshall",
    "date": "2023-10-30",
    "content": "1. Fully copy the structure of a song you like 2. rip the exact drum beat off from a different song you like 3. thrown down some chords 4. find the stems of a completely different song you really like the sonics of and try to copy the exact types of instruments/synth sounds/samples/etc and what purpose they serve in that song (ex: guitar in middle octave playing a rhythmic pluck, synth swell with reverb into the chorus, bright noise synth drones only on the last chorus)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196908431366422528",
    "author": "Josh",
    "date": "2024-01-16",
    "content": "Genius Deconstructed is actually just a gross beat tutorial",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247562928731979777",
    "author": "Eric Martin",
    "date": "2024-06-04",
    "content": "Click is freedom, No click is freedom, it can be done well, but instrumental maturity to know when to and when not to.\n\nMy artist project gets a lot of tracks recorded without click and I always lock a tempo map in to the original performance. \n\nI always have a physical drum machine ready to program a beat because some people need that vs a static click to play along with, the feel can be transformative when there’s a downbeat and upbeat present with groove already in it, even if it IS on the grid and not swung.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255894073471012977",
    "author": "hyanrarvey",
    "date": "2024-06-27",
    "content": "Wait so you’re saying that my crazy beat with like 8 Melodie’s in the mid range where vocals would sit that I spent 8 hours on that the artist can’t sing too won’t get picked up??",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256451908827353188",
    "author": "Slow Hand",
    "date": "2024-06-28",
    "content": "Yessir. I knew an engineer who did a lot of doom-y sludge-y metal that moved at very slow tempos. \n\nHis pro-tip was to program a drum machine instead of a metronome that had 1/4, 1/8, and 1/16 subdivisions in the pattern so that the band could tightly snap to weird angular rhythms and hits at a very slow tempo. Worked like a charm.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1279127623540412498",
    "author": "Chris Lyon",
    "date": "2024-08-30",
    "content": "How much time are you guys spending cutting the vocals the first time? I would just recognize this pattern and make the first day about getting takes fast, experimenting but not overthinking. Don’t edit too much. Let them sit with it with fresh ears since that’s part of their process. Save the editing and detail work until after you have the performance you both love.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353173956059856928",
    "author": "Slow Hand",
    "date": "2025-03-22",
    "content": "Oh man. The included sample libraries sound *good* too. There's an 808 sampled kit that they included which is killer. You'd think that people can't improve on the sound of an old-fashioned 808 kit after all these years, but the samples sound great!\n\nI've got one song where I never quite got the 808 clap sound I wanted. Two days ago I booted up Serum 2... and there it was. So I resampled the clap, flew it into the existing session and now I'm done! This thing is paying off already 😄.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370868687330086994",
    "author": "Edward Rivera",
    "date": "2025-05-10",
    "content": "Any snare on any song of this album:\nhttps://open.spotify.com/album/3G36754KQVLyGuskraEAVA?si=qd6RPxW8RsGUnZSvl3oxkA",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1380798768844116099",
    "author": "Slow Hand",
    "date": "2025-06-06",
    "content": "Nope. I don't see why Ableton would be lacking in that way. It's perfectly capable of making great drums.\n\nA pre-made drum loop will usually be more polished and ready-to-go than making your own drum pattern from individual samples. The pre-made loop will likely have been EQ'd, compressed, and mixed to work harmoniously, whereas if you're building a loop from scratch using samples it is up to you to polish and sculpt the sounds so that they work well together.\n\nIf the pre-made drum loop is like having someone serve you a finished meal, building the drum part from scratch means you have to learn to \"cook\" using those ingredients. It'll be harder to do well at first, but once you get the hang of it you'll be able to be more expressive.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392201767269175432",
    "author": "oaklandmatt",
    "date": "2025-07-08",
    "content": "Here's one I did a last summer when I was on a 5 beats a day stretch. I think I found the main synth sound in some patch and was like \"I love the Kanye track that uses this synth\" so I did a copy. It's a super simple beat, but there are 3 different 808ish sounds, a very specific 808 snare, and then a roomy kick in it as well. Just spending 30 minutes trying to match each sample opened up a bunch of options in my brain for making beats in the future",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1392420051336040519",
    "author": "Rob Domos",
    "date": "2025-07-09",
    "content": "Let’s imagine songs as movies for a moment. \n\nYou’re scoring Breaking Bad, Walt is sweating in the desert in slow suspense waiting for someone to show up and they’re late, and he’s suspicious. Director says he wants a kick drum periodically interjecting throughout the scene to build tension. You have 2 options - a tappy Avicii kick or a dusty loose resonant acoustic kick. Which do you choose? \n\nIs your answer the same if instead the scene was a super cut of Barbie excitedly shopping and trying on different outfits?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404445156685516923",
    "author": "spectrummasters",
    "date": "2025-08-11",
    "content": "It’s giving steel banglez and the Afro swing sound he made popular about 6 or 7 years ago in London ? Then we got the trap wave . Interesting one imho because there’s an unsettled debate as to whether the dembow , soca and other clave and tresillo derived pulses gave rise to the Afro beats wave that popped off in london years back (and steel banglez finessed so successfully into his (great ) productions) or if those Afro Cuban / carribean forms that have existed for hundreds of years are fundamentally derivative of the west african forms (eg nyabinghi and early New Orleans drum lines being deliberately so ) and so even if Afro beat reappropriated some carribean forms for its own modern genesis , it was only using what it gave birth to in the first place . \n\nImho these beats today sit as a uk post modern take on the product of all of these wonderful rhythms from the diaspora, and like the people the rhythms themselves are all kin . I’m sure Interested also if that particular beat can be pinned down to an early african or Afro carribean form\n\nMy Mrs dad is sierra leonian creole . Which is to say his heritage is to have been the people that returned back to Sierra Leone from Jamaica . Much of the sierra leionian creole culture is a blend of carribean and west african and The music and culture tends to be somewhere along this journey most times . It travels with the people and their story is the story of the music",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407740479457722449",
    "author": "Zakhiggins",
    "date": "2025-08-20",
    "content": "Im pretty much always messing with the length of kick, snare and hat trying to get them to fit in the grove better, you can make some unlikely pairs work when you do this.\n\nAlso always messing with the order in which transients are hitting on downbeats, nudging certain drums slightly before or after others can make things mesh together real nice. Typically the higher pitched/attacky things like hi hats come earlier than the sub kicks for example but experiment with it and see what sounds good. A song where this is really obvious is say it right by nelly furtado, listen to the way the layers are stacked on the downbeats of the chorus. Side note, when you're doing this, think of everything with a transient on that downbeat as a percussion instrument.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418158194986979399",
    "author": "Ross Fortune",
    "date": "2025-09-18",
    "content": "From memory there’s a set of Logic grooves in Ableton. I think they might even be called Logic 16E etc.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418232434713039058",
    "author": "Rollmottle",
    "date": "2025-09-18",
    "content": "The Logic swing templates (along with many others) are in the groove pool.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "967410457575059466",
    "author": "cy (sigh)",
    "date": "2022-04-23",
    "content": "depends on the type of song but i like adding barely noticeabke delays. all v slightly off tempo.  can be useful to help give a push or pull feel to the groove, especially if it feels too quantized or you just want to loosen it up for a section. \n\ncan be v subtle but prioritising diff elements per section  has also worked great for me.  for example bringing down the kick a smidge and having a couple other rhythmic elements take the lead for a while then bringing back the previous balance.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "967799468147748944",
    "author": "Zakhiggins",
    "date": "2022-04-24",
    "content": "Honestly, *anything* other than 808 hi hats lol",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "967822846342611014",
    "author": "chadwahlbrink",
    "date": "2022-04-24",
    "content": "One of my all time fave tricks is putting tremolator on my reverb/delay returns in multi-mono mode, then unlinking the L and R channels, setting different tremolo times for each channel, then adjusting the depth to taste. It can add instant vibe and sometimes some groove to vocal throws.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984309418982252604",
    "author": "Deleted User",
    "date": "2022-06-08",
    "content": "usually saw/buzz basses can’t have much perceived subs without filtering because of the amount of upper harmonics. with shorter saw bass- I usually tend to favor the upper area for punch and get the low subs from kick and if I need lengths in the lows I double it with a sub or electric bass and not use the sub from the saw bass. on saw bass with longer sustain- I like to do band pass filtering (take out subs and filter out the sizzlely highs) and use a separate sub bass in the middle and use saw bass that spreads out on the sides. \n\nI wouldn’t do significant boost lows on saw bass, I find it just messes with the character of the sound too much",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986723861796093962",
    "author": "Slow Hand",
    "date": "2022-06-15",
    "content": "If they're loops I always include the tempo in parentheses at the end of the file name *ex: Plaque perc loop 1 (130)*.\n\nIf they're one-shot drums I always prepend them with  *kick, snare, HH, OHH, etc* An example would be *kick Plaque 1*, *kick Plaque 2*, etc.\n\nIf it's a collection of all the sounds and loops from a finished song I create a folder for that song (with the tempo in the name) and within that folder are subfolders for *loops, drums, SFX, etc*\n\nFinally, in addition to creating a folder with all of the assets for the songs (as I just mentioned), I copy all of the drum-hits to a single folder that has all of my custom *kicks, snares, HH, etc*. Same for any loops. This way I can search by song, but I can also go to a folder with *all* of my custom kick samples in one place.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987473653157474385",
    "author": "samvalentine",
    "date": "2022-06-17",
    "content": "Did a mix w a 2 mic set recently. Ended up blowing up the mono overheard/room and pretty much tossing out the kick mic they had. Layered in kick and snare samples to beef up the groove and provide some transients but the bulk of the work was the mono mic. Definitely not an ideal situation but you do what you can. Curious to know the position of the mics you got... Maybe two overheads?? 🤞",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998797902489071666",
    "author": "NoahNeedleman",
    "date": "2022-07-18",
    "content": "Honestly I almost always start a live bass with UAD’s Ampeg B15. It’s ballsy as hell and there’s a lot of options for cabs, presets are all super useful. Once I’m there I hit a decap or other saturation plug with a mix knob and dial in the upper mids to “growl” a la @Slow Hand’s CLA, the I compress the fuck out of it. Depending on how much thump or how smooth I want it, I usually go with either a UAD fairchild 660 or DBX160. Dyanmic eq Side chained to the kick right at the kik fundamental, and bobs your Fucken uncle. Usually. \n\nAnother trick that helps me usually is a static eq dip just above the fundamentals. Clearly out those lows usually helps the bottom and growl speak better for me. \n\nThat being said- a poorly recorded or performed bass isn’t just warfare, it’s heartbreak warfare. 😯😬🤪",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999048608940822628",
    "author": "Deleted User",
    "date": "2022-07-19",
    "content": "Sooo, on the recording side of things: if you’re going DI, most interfaces do not have a high enough input impedance to do passive pickups justice, especially if you want a decent amount of low end. Guitar pickups sound good with 1-2MOhm(the input impedance of a good tube amp), but if I want really clear modern low end that can compete with 808s, then I’ve had the best results with around 10MOhm on passive bass pickups. Another important thing is a transistor-based active DI will not get you a full low end. You will end up re-amping or using amp emulations etc. Octal tubes(the type of tubes IN the B15) will. Octal tubes have a lot more body(think U47, for example) and will get you there much much quicker. I have a Sarno V8, which isn’t perfect, but sounds clean, “finished” and modern from the get-go. No compression or emulations needed. It’s also comparatively affordable, so totally worth every penny.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018511870107320325",
    "author": "Eric Martin",
    "date": "2022-09-11",
    "content": "for me it depends on the bass part, if the bass isn’t playing low fundamentals the low end might not be tight, for example a picked fast bass might sound more like a guitar in which I’ll use more low end in the kick or synthesize a low fundamental if neither instrument is doing a good job at it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020805986128244816",
    "author": "Zack Hames",
    "date": "2022-09-17",
    "content": "I think the bass note falling after the kick usually sounds good (I think) because the kick is usually punchy and the bass is usually more tonal, they each have their own spot in the micro rhythm",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059446081060077578",
    "author": "Deleted User",
    "date": "2023-01-02",
    "content": "I feel you, especially in boom bap there's a lot that goes into that drunken swing feel. Same with tradition African groove. Easiest way is to load up a clip or loop from a drummer you like and extracting groove templates. You can quantize to the groove of your favorite drummer or a drum loop you dig. This will get you the results, but groove is a never ending journey of learning. Editing groove to make it feel the way you want to feel takes an understanding of what makes things groove one way or the other. It can be accents, dynamics, lengths of the notes, how much you deviate from the grid or what subdivisions you're on, and how the timing offsets rub and interact with each other in the whole instrumentation. Some drummers have really solid quintuplet swing, so instead of doing tripplet swing they'll play on the downbeat and the 3rd or 4th note of quintuplet. For this you can listen to guys like Nate Smith, he plays swings differently live than recordings- he drags and pushes the kicks and snares in recordings but for live, he only swings hats so there's more steady groove for other musicians to grab onto. \n\nOn the other hand, for playing the grooves yourself- I find it helpful to dance and groove to the rhythms as much as I can to absorb the feel and internalize them. But in order to play ahead or behind with authority, you need to know where the grids are and metronome practice is crucial. I'm not that great at timing either, so I'm trying to do as much reps in with metronomes as I can. Learning to play on the grid is a first step before learning how to deviate with clear intention. I hope this helps!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062041709090971709",
    "author": "Will Melones",
    "date": "2023-01-09",
    "content": "I could honestly leave all the drum loop packs alone and just take the hat patterns",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062045387638181959",
    "author": "popaganda.",
    "date": "2023-01-09",
    "content": "Buying a set of hi hats and playing them will 100% change your life and productions.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062432699194810459",
    "author": "Will Melones",
    "date": "2023-01-10",
    "content": "A professor in college told us that Marimba 2 was the “pro” click that everybody in the biz used. So when I started prepping scoring sessions at my first real world job, I thought I did everyone a favor by changing the default preset, and always set up the sessions with Marimba 2. For one session we had an outside engineer who knew the boss well, and I noticed the first thing she did was change all the clicks back to UREI or MPC. Apparently the boss’s response to the pro standard Marimba 2 was a “wtf is that shit” reaction.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080450297723371590",
    "author": "spectrummasters",
    "date": "2023-03-01",
    "content": "Logic Gang: quick share, Im finding the sample delay tool v useful in a few ways and reccommend for a few reasons. Picking up on the midi ticks convo last week, if youre programming in Logic , instead of dragging (and losing track of your moves) in the timeline/piano roll....throw one of these on an insert and increase the delay in tiny increments as you run down the track (typically hats and offbeat/ghost snares first) . You can quickly create the pocket youre looking for . Also added bonus...I believe under c. 12ms most people arent hearing a glaring time shift , (i dont go above 2ms ) so the delay is handy again just putting your hats , snares, percussive elements....just a millisecond or two behind/in front of each other so all your transient sounds are not hitting the 1/4,1/8, 16th counts at precisely the same instant. I find this helps with transients. Lastly, unlink the left and right on a stereo channel and youve got an instant width tool. Best for the transient and groove use tho imo.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1080936253161213972",
    "author": "Deleted User",
    "date": "2023-03-02",
    "content": "16 bits are still pretty common for samples, but can’t go wrong with either of them. \n\nI’ve seen some 32 bit float samples where the kick drum is clipping by 9db and when I turn it down it sounds weak as hell. That is problematic",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081159262954336256",
    "author": "Ross Fortune",
    "date": "2023-03-03",
    "content": "3) In acoustic drum packs, how interested would you be about having the mixed loop but always the stems from that loop (separate mics, or at least kick, snare, kit etc…)\n\nVery little. If I'm using a loop it's because I want a vibe to happen instantly. Any edits I make on the loop will have to be done across the mics anyway, and hopefully you'll have mixed the loop in such a way that rocks the intention of the part being played. I can see instances where having control over close mics / overheads/ rooms might be cool though.\n\n\n4) how important is it for there to be pre-made battery/drum rack/kontakt instruments of the library or are straight wav files cool ?\n\nWould definitely like this.\n\n\n\n5) what is the sample rate standard for sample librairies ?\n\n\nDunno, but I'd like to see 24/44 or 48, and I can't imagine why you'd go below this.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092594893181943879",
    "author": "cy (sigh)",
    "date": "2023-04-03",
    "content": "a large amount of hip-hop and R&B 808s are modified DJ spinz 808s from early 2000s. \nor they'll be layered along with them. I'm sure the % has gone down over the recent years w sublab and ANA going on but it was hard af to find any that weren't from those packs early on. unless you had access an 808 drum machine  of course.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596544781434950",
    "author": "BatMeckley",
    "date": "2023-04-03",
    "content": "It doesn’t exist. What’s the key of the song? What’s the tempo? What’s the rest of the arrangement look like?\n\nToo many variables for one 808 to rule them all.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095301946866417684",
    "author": "spectrummasters",
    "date": "2023-04-11",
    "content": "It’s worth considering different 808s for different parts to meet your needs  . Sometimes I’ll have three diff 808s and a Moog bass  . And they’ll obvs all be treated individually . Re : which 808s ? Ime I find the choice of 808 (in my genres ) is a trend thing , in the last 3-4 years its pretty much been a progression by producers through perhaps four or five 808 samples .....and when the sample changes its often in alignment with a new programming technique (like new multiple flams ....or conversely, sparse hits etc ) . If you’re searching for ready made samples I could point you to a few places or if you’d like a little pack of the ones I’m referring to in what I said previously ....hmu. Happy to pass on privately . If so, these ones are more contemporary rnb hip hop than the actual  old Skool electro Roland 808 kick",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103374529767677994",
    "author": "popaganda.",
    "date": "2023-05-03",
    "content": "Well yeah, doing anything won’t make you great unless you do it greatly. But my point is that if you feel you’ve been making boxy music a way out of that trap is to conceive parts more linearly and play down a whole take with an energy contour rather than add and subtract elements for the energy shifts",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108479785992212572",
    "author": "Adam Thein",
    "date": "2023-05-17",
    "content": "It's really simple in Live (and I'm sure there's equivalent warp modes in other daws) - use the Repitch Warp mode, move the tempo down til you are slightly slower (the track will play back at a lower pitch), record at that new key and tempo, and warp it back up (Repitch mode on whatever you recorded).  The formants and the pitch and the tempo will all move together and playback smoothly.\n\nI think @Ross Fortune has mentioned this before but the iOS app MusicMath has a handy tool to input the BPM and how many semitones you want to transpose and it'll kick out the correct new BPM to get the transposition you want.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108608436356268124",
    "author": "Slow Hand",
    "date": "2023-05-17",
    "content": "@NoahNeedleman I don't know if this will help at all, but here's a *very* quick video of the template that I have setup. I'd imagine that Pro Tools can swing something similar.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1117328178361421866",
    "author": "spectrummasters",
    "date": "2023-06-10",
    "content": "yes agreed, production wise you can follow those roland drum kits pretty much through every decade to this day. its amazing to me that a number of todays budding producers can name these things partially, for example referring to the Roland 808 Kick Long and not know anything about the Roland 808, let alone the other modules. ......and parrallel to the \"808 \", the 909 is still to this day, going strong in house with the likes of MK . From a production/mix viewpoint....i suppose these sounds themselves hit with such a charcter in the right frequencies that there must be something intrinsically appealing to us that will keep them forever relevant.Im diving back into the Linndrum Clap and the old Jermain Dupri / So So Def claps at the mo for a little diff sonic character .....they are all still in the same ilk as the rolands though. \n\nre: the drill hats.....thats another cyclical pattern there. In the uk thats been appearing and reforming for decades now. its a soca pattern that the uk appropriated into a period of uk garage production (about the same time that 2 step began to mutate into the hip-hop influenced So Solid style )......and then dipped into a scene we had follwing called UkFunky ( a mix of Us House and Carribean influenced drum patterns and bass) . Then it re-appeared again in those drill hats once the uk appropriated/re-mouldedd chicsago drill",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155601280291586230",
    "author": "Josh",
    "date": "2023-09-24",
    "content": "This is super sick. I think just making the saturation an actual knob (I didn't notice it at first), adding a delay, and having a mono toggle would be killer. Wanted to see if I could make a beat only using SKY and the Rhodes makes a pretty convincing bass!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169300636915998750",
    "author": "hyanrarvey",
    "date": "2023-11-01",
    "content": "Even better when the kick pattern is just 4 on the floor",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169798873003348059",
    "author": "BatMeckley",
    "date": "2023-11-02",
    "content": "At the end of the day, if you don’t make a song that does well enough you’re probably not going to have to worry about people booking you much anyway. I don’t know a single person in town who’s like, “I’m paying this guy for session after session even though he never delivers results but man is he a fun hang”. \n\nI would posit that your job as a producer would include (if you HAVE to invite over the temperamental yet always delivers results songwriter) making sure you’ve set up the session that her shitty attitude doesn’t ruin it for everyone else. Again, the job of the producer really comes down to maximizing the strengths and minimizing the weaknesses. That doesn’t just apply to a kick sound.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180178108750495859",
    "author": "Josh",
    "date": "2023-12-01",
    "content": "Kinda hard to sum it up into one message, but I’ll try my best. The easiest thing to start with is basses I think. So I’d pick different bass and 808 sounds and figure out what mine were missing. A lot of this was to stop using one shots I liked. And then from there it went onto different plucks, pads, etc.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187207410629218375",
    "author": "Rob Domos",
    "date": "2023-12-20",
    "content": "Very stoked to try this. Post your next 808 plugin that you’re working on here as well when it’s ready. I absolutely loved your work on 808 cooker",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189694978092437554",
    "author": "Deleted User",
    "date": "2023-12-27",
    "content": "I learned a lot from Haitian music. Haitian music is a good way to learn a lot of African rhythms as well because Haitian music compiles a lot of different African regional grooves.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196704706567876698",
    "author": "popaganda.",
    "date": "2024-01-15",
    "content": "Changing the subject here fir a sec, @spectrummasters I’ve been into the classic house thing for the past few months, everytime I go there in my dj sets it kills, now I want to do some remixes and productions. Any tips? I know you’ve rabbit holed on this. Learning resources, interviews, docs/history lessons,Best 909s? House piano? (I’m assuming m1) swing settings? Kinda broad I know, but wonder if some things can be distilled here from other people’s experiences",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196706630625132595",
    "author": "Edward Rivera",
    "date": "2024-01-15",
    "content": "I have some experience here. Question is very broad yes. Might be easier to post a tune that piques your interest and ask about what you hear. 909s are dope but sometimes you want an oberheim dmx. House piano is lovely but some songs don't even use it (it's the Korg M1 correct) swing settings can differ too, MPC 16 gets the job done in most cases. But also shifting around drums to be early or late is a vibe.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239465699777187921",
    "author": "Rob Domos",
    "date": "2024-05-12",
    "content": "@Skyler Young made a sick fucking plugin called 808 cooker that I like",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247570075851030721",
    "author": "Slow Hand",
    "date": "2024-06-04",
    "content": "Oh man. I love to see it. The first time I heard that groove my face cinched up like a drawstring pouch.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1262410190670794802",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-07-15",
    "content": "For slightly aged generic (but not original drum machine) stuff, Vengeance sample packs should do the trick. The Nexus 4 VST is also a library of impossibly generic patches and sounds (including drums) for electronic music. But honestly I feel like searching \"House Kick\" on Splice should get you there within the first few results",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278119408463511624",
    "author": "Ross Fortune",
    "date": "2024-08-27",
    "content": "Very sculptable non-lin reverbs (I’m sure the others are cool too, this is just what I’ve used it for)\n\nToday I used the filter to change the envelope of a kick sample that was nearly right - the length of the room was too long, and simply fading felt weird, but having a filter envelope triggered by audio input sculptable just how you need it is brill. Haven’t tried jt but it might be a lazy man’s alternative to the TLA tom thing",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1295859579686621257",
    "author": "Rollmottle",
    "date": "2024-10-15",
    "content": "firing up the MPC...",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1314012958027808870",
    "author": "Ross Fortune",
    "date": "2024-12-04",
    "content": "Not as cool for details as those above, but I did Yuck by Charli XCX a while back. It was fun because you have access to most of the exact ingredients they would’ve used (eg Kontakt scarbee bass or the other one, can’t remember which). The pocket of the bass was the tough part.\n\nLearned how to make The Message synth in Diva for it, and it was a nice exercise in balancing kick / snare / claps.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331605994173759589",
    "author": "NoahNeedleman",
    "date": "2025-01-22",
    "content": "@Skyler Young has a plugin called Ramzoid 808 Cooker and I love it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341878921863626802",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-02-19",
    "content": "also adding shuffle, swing options",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341918124957761579",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-02-19",
    "content": "Yeah sometimes you‘d type in something like „lead synth“ and it gives you trap hats…",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346575299277488230",
    "author": "Slow Hand",
    "date": "2025-03-04",
    "content": "And since you're already doing a re-model (so to speak) now is a good time to play with tempo and key. Sometimes slowing the feel down reveals new grooves that might be inspiring. Even doing a varispeed slowdown can be revealing.\n\nThe big caveat here is that this is going to be hella disruptive. It's a tear-down and that's a lot of work to start from the bottom. So probably don't open that door if you've got a pressing deadline.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360330677740109986",
    "author": "minipops",
    "date": "2025-04-11",
    "content": "Ok not exactly what you're asking for but this is what came to mind when you first asked.  It's an acoustic kit made to sound like electronic 808 sounds. Could be layered with a real (electronic) 808 kit for a more electronic sound.  https://majetone.com/products/ac08?srsltid=AfmBOoowl8cU0O8AdqkZLT53l-S8Vfk7WnH_a-4oslEhJe2JlOYI3GiD",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366574644819136687",
    "author": "Rollmottle",
    "date": "2025-04-28",
    "content": "taking a 4/4 kick away is as important as when it's in",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370865391173111971",
    "author": "Ross Fortune",
    "date": "2025-05-10",
    "content": "Love the kick and snare in this. Albini https://open.spotify.com/track/1gIDp1u5gR2vBbPIbCJOW1?si=GFRcuj5qSV2mBQkyvmbzMA&context=spotify%3Aalbum%3A3y1aPtqR1BkUXAaOUoDCRo",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1391968883161825310",
    "author": "Rob Domos",
    "date": "2025-07-07",
    "content": "I think when people say “over produced” they usual mean production choices that don’t support the emotion of the track. Counter intuitively, I’ve heard Adele records be accused of being overproduced, but I’ve never heard that accusation leveled at Charli XCX. \n\nI think the Laurence that Brian linked is a perfect example. When performing live, I think of them as Michael Jackson tier, and their produced singles are maybe 70th place on a playlist for a week. A lot of it comes down to production choices feeling arbitrary like “we need a kick so let’s throw a random kick in” and with no regard for how it carries the story of the record",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392191660120604824",
    "author": "Brian Reynolds",
    "date": "2025-07-08",
    "content": "Midi hi hat pattern packs. Two reasons. First, quick drag and drop building blocks. Second, go thru your favorites and look at them closely in the midi windows. What's their velocity, length, pitch, and place on the grid. How does each hit compare to the next so on and so forth.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392199215329050685",
    "author": "oaklandmatt",
    "date": "2025-07-08",
    "content": "Copy the placement of each sound and see it on the grid. Copy the swing and you'll learn a ton about grooves. Copy the sound of the samples and you'll learn unexpected things about sample choice. Copy the mix and you'll see how they all come together",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392202092415811736",
    "author": "BatMeckley",
    "date": "2025-07-08",
    "content": "It sounds so obvious, but… THIS. The absolute best way. \n\nI still put beats like up on the grid to see WHY I like them. I specifically remember when I was working a lot with Camila, bringing up the drums to trying and deconstruct that “Latin swing” and it was one single off the grid kick drum hit that transformed the entire beat.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392202172330147983",
    "author": "oaklandmatt",
    "date": "2025-07-08",
    "content": "I think it's important to copy the whole beat too, since so much groove is in the relationship between the drums and instruments. Also eye opening to be like \"fuck the drums are THAT simple??\" over and over.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1395123635227852840",
    "author": "aliberger",
    "date": "2025-07-16",
    "content": "there's probably some sample/program management software for the computer that you could use to create programs, but fwiw it's pretty fast doing it on the mpc once you spend a little time with it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1421181752671604858",
    "author": "spectrummasters",
    "date": "2025-09-26",
    "content": "Yep . U.K. garage actually used triplet time 1/24 grid . So it went past the logic settings  . \n\nLogic b works nice for just a taste ….d and e loosen things up …..against a straight kick and snare . \nEventually you’ll just start nudging stuff about your self and intuitively know what the different swing settings are gonna do to your hits anyway",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1462556614879088753",
    "author": "hyanrarvey",
    "date": "2026-01-18",
    "content": "That dude was my neighbor in the apartment I used to trap out of in Brooklyn",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470883344484139240",
    "author": "Adam Thein",
    "date": "2026-02-10",
    "content": "My mind goes to syncopation and interplay between bass and kick instead of locked together",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "938550925205860352",
    "author": "Zack Hames",
    "date": "2022-02-02",
    "content": "I think a lot of it is in the playing and the groove. \n\nOtherwise, some pretty heavy Compression can really fit the bill for something like that so it sort of sits in spot like percussion. (Just my two cents)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941089234855542814",
    "author": "Deleted User",
    "date": "2022-02-09",
    "content": "alternating different samples can work really well. differences between the samples can give more to listen to in the groove than just changing the velocities.  I find my self alternating more than layering since a lot of the samples already come layered.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954132945558462464",
    "author": "ALXCPH",
    "date": "2022-03-17",
    "content": "definitely. same as the silence in between. its all part of the web that is groove/feel.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "956992784550756472",
    "author": "Zakhiggins",
    "date": "2022-03-25",
    "content": "@KushKadett I think to be a good producer, you should be just able to make whatever sonic feeling you want - so if that means technically \"wrong\" things like grit and noise, so be it. They still give a certain vibe. \nYour technical ability doesn't get in the way of your creative vision is what I'm saying in short\n\nWhat good production is, is different. It's in the eye of the beholder imo.\n\nYou could have a kid who just downloads FL, loads up a splice loop and happens to find a perfect kick and snare to go on it, the beat slaps, (technically good production?) but does this make him a good producer??\nYou see where I'm going haha",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "957009290315583489",
    "author": "KushKadett",
    "date": "2022-03-25",
    "content": "Dub and raggae from that era was made on old BBC consoles (very hifi and not lofi gritty in my book) There's an engineer giving a masterclass on dub mixing on youtube (great video, highly recommend it!)  and he explains how it's kind of a misconception that their equipment was all ghetto when in actuality they had incredible world class stuff left over from the brits after they left, which rivals what the best studios use even today. Analog gear hasn't really progressed much and a pultec/Neve EQ is still one of the best EQs ever for instance. Those records still sound great for that reason. As for punk and hardcore it's interesting: do people genuinely still listen to those records? I've revisited a few old punk records which I used to think were amazing. The songs are great but the listening experience just isn't enjoyable for me anymore, in part due to messy playing  and bad recording/mixing. With bad I mean the playing distracts from the groove of the band and the mixing distracts from the song, where it does not support the dynamic shifts",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "962486599227174992",
    "author": "Slow Hand",
    "date": "2022-04-09",
    "content": "As a practical example of when not being in phase is the right move:\n\nJon Castelli did a live mix on Twitch on Wednesday that included live drums. He identified that one of the snare mics sounded fuller when he inverted the polarity and proceeded to mix with that. \n\nLater in that session when it came time for notes, the producer (who was present in the room) asked why the snare had lost a certain thin and \"woody\" character that they liked. Jon reverted the snare mic to it's original polarity and the producer went \"Ahh! There it is.\"\n\nSo the takeaway here is that while drums usually *do* sing the best and hit the hardest when they're all working in phase with one another, sometimes the creative intention overrides the need to align them in a way that makes them most \"full\".\n\nAs you say: If it sounds good, it is good.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "967283203729653771",
    "author": "Zack Hames",
    "date": "2022-04-22",
    "content": "What are some cool “groove” / “body mover” percussion layers yall add to get a rhythm going harder? Like the classic tambourine or shaker in the chorus type thing but maybe a little different. Feeling a bit lost trying to get a track to groove harder.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "976958266208821289",
    "author": "ALXCPH",
    "date": "2022-05-19",
    "content": "100% i almost always find my self nudging stuff around to give it more swing and be less on the grid perfect than the opposite!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984599661178396683",
    "author": "chris_donlin",
    "date": "2022-06-09",
    "content": "Like whatever the opposite of latency is haha, but probably a full beat or two ahead. I’m in PT",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987480573356429342",
    "author": "ehutton21",
    "date": "2022-06-17",
    "content": "Wide panning still has its place today! Wild that its so rare. Especially with all the panning automators and all the cool ways you can blend them. I hate it when percussion and hi hats are down the center. Boring and bland. Give me something that’s got a *little* life ya know?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994723346132516894",
    "author": "Jeremy Klein",
    "date": "2022-07-07",
    "content": "yeah once you use Drum Rack, basically all other drum sampler plugins feel terrible.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999414500635709560",
    "author": "ALXCPH",
    "date": "2022-07-20",
    "content": "(It’s all super project dependant) If I’m both producing and tracking I’ll often just get the production to a point where it’s good to write to and simple enough to have ideas flow. Then throw it into a vocal tracking session and get the demo vocals and get the song written and record a few too many parts. Then produce the song around the song and vocals. Usually I’ll have beat and vocals separate, but sometimes it makes more sense to have in the same session. Depends on the song. But I always track over a 2 track. Because it takes a lot of risk out of having some random synth or plug-in chain from the production mess up the session while trying to get good takes with the artist.(total buzzkill if you have to restart a session when the vocalist is in the zone) \nBut again soooooo project dependant. Depends on how the artist likes to work, time line, amount of sessions that are possible to have together and so on. Sometimes you’ll only have one day with an artist, and if you are also producing, leave all the cool production tricks til later and get the best vocals you can get.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000438756526014535",
    "author": "arjunrao",
    "date": "2022-07-23",
    "content": "I’ve been using maschine since I started producing! Will be back in LA for good in a few weeks if you still need guidance",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009911580147855360",
    "author": "Jeremy Klein",
    "date": "2022-08-18",
    "content": "I compose/mix a lot of library rock/metal music and I basically couldnt have that gig without superior drummer 3. \n\nFor it's variety of tones and realism I think it's the best out there. If you program with the predefined MIDI grooves as a base, you can get rock drums that sound _almost_ indistinguishable from the real thing. \n\nI've got a few of the SD expansions and honestly think the core library is still the best one.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020818854408106015",
    "author": "Daniel Ross",
    "date": "2022-09-17",
    "content": "I feel like groove is so subjective so we’re probably all wrong and all right to some degree…but I almost never let my bass be off grid. I always find the impact lessened when I do. Something about a lack of confidence in the low end makes me like the song less. There are exceptions but they are rare imo. And I hardly ever let the down beats of transitions be off grid too. I usually want the sections to be obvious. I also start with going behind the beat first. I have also recently in the last year or so found that if I start with getting the very basic part of the groove right first, I am less likely to overcrowd my production. So before I put hats in, I’ll just put in snare and kick and try and find the groove with just those 2 elements (unless there is some other clear rhythmic element at play) but I feel like if you can’t feel the groove with just the kick and (snare/clap/perc) then it’s not there.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020841105266319510",
    "author": "Slow Hand",
    "date": "2022-09-17",
    "content": "Man I’m down. Groove is such a dark art and doesn’t get enough of a spotlight for all of the impact it has.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050164931141570600",
    "author": "1ggy",
    "date": "2022-12-07",
    "content": "I like how musical it is and now they’ve made it pretty easy to make your own kit from all the different samples. So I’m finding I’m getting to a groove fast and going back later to replace/modify any of the samples.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050475474675060827",
    "author": "Ross Fortune",
    "date": "2022-12-08",
    "content": "Has Logic’s drummer been mentioned yet? Maybe a no go since you’re in Ableton @oaklandmatt, but it’s very usable in lots of styles. Instant good presets, and the “producer kits” give you full access to mics (if you want to smash up a room etc). Having dynamics and “business” on an XY pad is pretty useful for knocking demos together, then you can convert those “drummer regions” to midi to tweak. Also the hi hats are usable, in a world where it’s still relatively difficult to program convincing 1/8 and 1/16 hat patterns",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051602973593194587",
    "author": "Slow Hand",
    "date": "2022-12-11",
    "content": "I agree with @BatMeckley's approach on this. Have them execute your vision, and then once you have it let them go wild and swing big. Try something new.\n\nIt's up to either the artist or you, as the producer, to have a vision for what the song is, where it's going, and what it needs. One of you have to have a roadmap. *Someone* needs to have the vision. To be the leader. To steer the ship.\n\nIf the vision is not clear then perhaps the song itself needs to be refined some more until it has a strong identity. That will be your north star for creative decisions. \n\nIf you can convey the essence of the song to your players, the emotion behind it, then they can interpret that feeling in a way that is uniquely them without the need for you to dictate their parts. If you can give them an emotion and maybe some general contour of what you're hearing then they can fill in the spaces and bring their own qualities.\n\nAs producer, part of your job is curating the talent that you recruit to realize your vision. If you know what the song needs you can confidently pick a player with complimentary sensibilities. If you can pick the right person then very often most of the work is done by virtue of them being aligned with the song. Each of their contributions and ideas are likely to be excellent.\n\n----",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051603079960731719",
    "author": "Slow Hand",
    "date": "2022-12-11",
    "content": "If you're concerned about being too suggestive to the players about their parts then strip back the demo until it contains only the most essential parts. No fancy stuff. Just chords, melody, and lyric. *Maybe* a kick drum pattern. Lead sheet style.\n\nIf the song is good then it will still be compelling. The best songs tend to be very robust and can be played a dozen different ways because they are fundamentally compelling. If the demo doesn't feel good this way then the song may need more work.\n\nLesser songs will depend on the arrangement or production to be compelling, or only work in a narrow band of styles. Sometimes a song can only work one way. It's okay if this is the case for your song, but then it's up to you to present the demo with the arrangement or elements that are essential to make the song compelling, and that will close off more and more of the instrumental possibilities.\n\nSo if you want to increase the chances of a session player delivering an unexpected, brilliant, idea then set them up for success with a strong song that can be interpreted many ways.\n\n----",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055315488307167302",
    "author": "austenballard",
    "date": "2022-12-21",
    "content": "okay, yeah I should probably explain myself a little better. sorry haha\n\none of my mildly obsessive-compulsive tendencies is trying to 'tonalize' (for lack of a better word) percussion samples, à la pitched 808 kicks. i blame it on a brief stint as a school orchestra timpani player\n\nbasically i like for every percussion instrument to have an identifiable, if subtle, pitch, in order to be in tune with the rest of the song\n\nin ableton i do this by using the resonator to add a little bit of pitched ring to kicks, snares, toms (obviously), even hats and cymbals. i haven't quite worked out how one might do this in another DAW, though",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055389781913256046",
    "author": "Rollmottle",
    "date": "2022-12-21",
    "content": "Oops, beat me to it 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059456812304302100",
    "author": "Deleted User",
    "date": "2023-01-02",
    "content": "thing about a lot of older drum machines including MPCs is they have different number of ticks per quarter note (aka PPQN) and that also contributes to the groove because things can line up differently even when you play in the exact same thing.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062041833938636800",
    "author": "Zack Hames",
    "date": "2023-01-09",
    "content": "Sounds like you need a hihat and a mic! Haha. \n\nI agree, the human feel is awesome.\n\nAre there really not enough loops that can be edited to certain tempos? I feel like you can edit a hihat groove at 80bpm and speed it up/edit it up to anything else beyond that really easily",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062044428040163469",
    "author": "cy (sigh)",
    "date": "2023-01-09",
    "content": "same. i can work from anywhere really. a shitty person ia more likely to mess tmy abilities than where i am. ive beat boxed a whole sketch on my phone with an artist cauae the power went out for 3 hours 😂. ima make it work",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065349636413460501",
    "author": "ALXCPH",
    "date": "2023-01-18",
    "content": "Secret sauce is using it on 808s 👀",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075837635098067075",
    "author": "ALXCPH",
    "date": "2023-02-16",
    "content": "What this guy Said! 👆a great Groove by great players on the way in usually needs very little work. \nIf you do have to edit, going completely on grid i almost never the way to get “Groove”.\nIf you listen to how they interact try and feel why its not grooving. Are some beats rushed or maybe too sluggish? The best grooves are usually a little bit of very consistant not on beatness. \n\nOther than that you could have something that does Groove on the Way in, but if the rest of the material isnt grooving with it, things will still Sound off. \n\nGroove is instinctual and intentional. And like with anything its hard to why something is not grooving if your ears havent spent the reps listening and analysing what a good Groove sounds like. \n\nI know i might be over explaining. But incase someone else is reading and can get something from it. 🤓",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075839014705311839",
    "author": "ALXCPH",
    "date": "2023-02-16",
    "content": "Something that I almost always see (I hate saying that, but it is what it is) is very technical players does not = groovy players(lots of exceptions) fx bass players that are very technically proficient will usually almost be too on beat or even a little rushed. And I find usually nudging stuff back a little can do a lot for a groove. \n\nBut again it’s all about knowing the sounds of different grooves and knowing what it takes to get there",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080775656570363934",
    "author": "jonmatteson",
    "date": "2023-03-02",
    "content": "I use addictive drums and enjoy it. I’m sure superior drummer is great too. I like to use the build in midi packs for basic grooves then customize them to my liking if it’s a pop rock thing.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080823675579813999",
    "author": "cy (sigh)",
    "date": "2023-03-02",
    "content": "1. for sound i think one option would be a more functional pack that covered most \"meat and potatoes\" sounds. \nor a more stylized /specific sound. with a couple more flexible parts /sounds added. \n\n2. personally I set my own to aroun -8 too so id actually prefer  that\n\n3. having the stems seperate can definitely be useful for altering the groove (of loops)  ans modifying individual sounds when needed. \n\n4. not important at all to me. i tend to build from scratch anyway but would be down to make the Studio One instrument versions if you need it\n\n5. as far as o can tell  44/16  is what's most common but recently im finding 48/16 and 48/24 packs pop up, especially for more acoustic sounds. prefer those myself.\n44/16 by far the most common in my exp tjiugh",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080871146251104338",
    "author": "Zack Hames",
    "date": "2023-03-02",
    "content": "I’m probably an outlier in the usual drum pack consumer but I’ll give you my take:\n\n1. I found when there’s a million samples I get uninterested quickly. I’d prefer 2 snare sounds as opposed to 15 slight variations of nearly the same thing.\n\n2. I use an MPC, so the lower volume thing would be annoying for my personal use, but that’s an outlier.\n\n3. You could farm out the Battery / Kontakt / etc packs to friends who would be willing to do it or use those tools a lot, that way you’re not stuck making a ton of them (unless you want to of course) \n\n4. I don’t touch loops usually but I know tons of others do. \n\n5. That’s it. Sounds like a super fun and badass project! You should document it on the way on the discord\n\nEdit: I’m speaking to more electronic and supplemental use of drum samples. There are probably tons of folks out there who want all the options as if there was 100% a real drummer recorded in their studio.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080871190333247588",
    "author": "Deleted User",
    "date": "2023-03-02",
    "content": "1) Different tunings, Having clean vs processed, peaking at below -6, good velocity layers, round robin is good but not really necessary for me, I personally don’t need all mics separate but would like to have a separate room sample and the mixed sample as well.\n\n2) Yes please!! I hate it when samples peak at 0. I actually turn all of them down when I put them into a sampler to make it peak at -8 to -12\n\n3) small snippets of hihats or snare ghost notes and some tom loops. I’d probably prefer them mixed only\n\n4) for kits I think it is important. Round robin and velocity layers, and if you are doing rooms or separate mics having a kit makes an instantly playable and tweakable kit.\n\n5) I’m not sure. Anything between 44.1/16 and 48/24 should be fine! Anything beyond might be too much",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080905745035448390",
    "author": "Jeremy Klein",
    "date": "2023-03-02",
    "content": "yo! welcome to the discord!\n\nYeah i'm a huge user of SD3. One of my gigs is making library rock/metal music and for all those tracks it's 100% SD3 and youd be hard pressed to tell they are programmed drums.\n\nThe real key for me was learning to use the pre-made MIDI grooves in SD3. If you start with those, and then just modify the kick to where you want it, you get some _very_ convincing drums.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084901581025194086",
    "author": "hank01564",
    "date": "2023-03-13",
    "content": "My favorite plugins for something like this are Abletons Redux (I use the filters on the bottom to low pass), Softtube Dirty Tape (for the wobble), McDSP Futzbox (distortion, speaker emulation), Unfiltered Audio lofi-af, RX950 (emulation of MPC conversion) and Goodhertz Lossy",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089218014194434079",
    "author": "hyanrarvey",
    "date": "2023-03-25",
    "content": "Well the bendeth snare has part of superior drummer 3 altair supraphonic in there",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090006114449510491",
    "author": "LAPhill",
    "date": "2023-03-27",
    "content": "Read the EULA of the samples, but in most cases, it's totally fine to use samples and loops as long as you're not selling them on their own. As in, if you use a hi-hat loop in your track, you can't have a section that is JUST the hi-hat loop. That would also apply to delivering stems. Your \"percussion\" stem, for instance, should have other elements baked in with it.\n\nThat doesn't apply in all cases and there are certain samples out there that don't allow for sync use. I can't remember which ones offhand, but that's why it's worth checking the license agreement.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596426447523852",
    "author": "austenballard",
    "date": "2023-04-03",
    "content": "the thing I've found works really well is to have an 808 sound for the attack and then synth the sustain/release. ANA is great for this",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092598218229039236",
    "author": "BatMeckley",
    "date": "2023-04-03",
    "content": "Also, almost invariably, I’m tuning 808’s like a sampler, as in decreasing pitch increases length. Time correction always neuters them.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092606207111483502",
    "author": "Will Melones",
    "date": "2023-04-03",
    "content": "That Sound has some solid sounding chromatic 808 one-shots in their Future pack. I took those and mapped them into a Kontakt instrument, crossfading into a looped sine wave so you can play the sustain. Also made a version of this with portamento, which is lots of fun",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092855404410708039",
    "author": "LAPhill",
    "date": "2023-04-04",
    "content": "Honestly, I'm glad to see such variance in how people go about their 808s. Makes me feel better that there's not one go-to that everyone uses (aside from a couple of these secret samples)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1115747922995335188",
    "author": "stefanmacc",
    "date": "2023-06-06",
    "content": "Yeah you can’t beat those air records. Still are top 10 for me. Nigel’s new stuff with the smile is killer too",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116808418175483957",
    "author": "spectrummasters",
    "date": "2023-06-09",
    "content": "yes, i agree with this fully. i think what we've all witnessed perhaps over the last couple of years is the implosion of the atlanta sound and scene, the death of takeoff (rip) , trouble (rip) , the sale of QC , the rico of YSL , the fallout amongst collaborators......tory lanez getting banged up.....the list sort of goes on and on....all the cases and arrestys in NY drill, i think gun crime has unfortunately eviscerated hip-hop over the last few years (rip nipsey) and its impact is being truly felt. The oversaturation of lil-kim style shocke femal mc's is super dead as well imo. city girls, ice spice....sexxyred, meg the stallion.....its sinking the ship a bit imo. Louisiana and memphis still hitting tho IMO. love nba youngboy, toosie, rod wave, kodak black....i think it might just continue to go a bit more to the scattier, hyper drum patterns of some of these artists i mentioned. in the UK nines has just dropped a dope album , a lot of nice throwback 90s hiphop patterns that i didnt know i needed but apparently i do",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117624577426727043",
    "author": "Deleted User",
    "date": "2023-06-11",
    "content": "I actually didn’t know about UK Funky origin. Yeah the pattern itself is definitely a timeless Subsaharan dance music rhythm , which developed into clave that spread all over the world. What I was mentioning is the context (killing opposition and retaliation) of what Chicago Drill is, people play around like it’s just sports team rivalry but don’t really understand how this leads to people taking each other’s lives and how it’s real life shit. \n\nReal life shit transforming into art is cool and I support all the way, but real life shit becoming entertainment like some scripted reality show isn’t something I’m on board with.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1118965923290828901",
    "author": "austenballard",
    "date": "2023-06-15",
    "content": "sometimes i just take the attack of a sampled kick to get the general vibe and use rbass to beef it up",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119380523089932299",
    "author": "austenballard",
    "date": "2023-06-16",
    "content": "@LAPhill how did that journey of yours into 808s go? \n\nI'm doing an epic track right now and contemplating swapping the cellos and basses out for an 808 and was reminded of that conversation",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135021466958692383",
    "author": "Slow Hand",
    "date": "2023-07-29",
    "content": "Yup! MD for Bob, and rightly so. Dude is such a boss. He’s got the perfect marriage of groove and melody.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135894036046155778",
    "author": "GaspardMurph",
    "date": "2023-08-01",
    "content": "There is no Hi Hat on “Hey Ya” by Outkast",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136044449303122060",
    "author": "JakeTB",
    "date": "2023-08-01",
    "content": "I like the snare bottom... 🙃 but I'm not as good as the Cians or Beckleys around here.\n\nIf (when) having to sample replace a snare, having the bottom mic in just a little can help things not sound too sample-y",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136052148648558782",
    "author": "Edward Rivera",
    "date": "2023-08-01",
    "content": "That's what the other mics are for. The sound of a snare should be the sum of the mics. Snare mic is just *thwack*",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137099932164161639",
    "author": "Jeremy Klein",
    "date": "2023-08-04",
    "content": "yeah 100% hahaha dropshipping a beat is such a good analogy. 😂 \n\nif you are a born salesperson and love the grind of out-marketing your competitors and enjoy moving from one musical trend to the next, then do the type beat thing. \n\nBut if your ultimate goal is to just make great music with artists you like, it's not the way to go.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150530413022941275",
    "author": "LAPhill",
    "date": "2023-09-10",
    "content": "As with every music technology before, it opens new avenues, but doesn't shut down old ones. Drummers still play after drum machines. 808s haven't made real bassists obsolete. Tools have made some things way easier, or way more possible, but don't invalidate all previous methods. Jury's out how widespread AI vocals will be, and how people will connect with the technology (both on the artist and the listener side).",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157731554580254792",
    "author": "cian riordan",
    "date": "2023-09-30",
    "content": "As well as EQ on the kick and gating the snare",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168794414659932190",
    "author": "Zack Hames",
    "date": "2023-10-30",
    "content": "Templates can be deceiving - I tend to change things way too much every project for them to help me. I do have a template for my hardware synth rig, so all 12-16 of my channels are already named and built and input assigned and a reverb made. But then I’m just using PT as a tape machine. I have a template on my MPC that’s automatically routed to MIDI for all my synths, etc.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169285940833947722",
    "author": "youngteam",
    "date": "2023-11-01",
    "content": "that's a great method. I've seen multiple producers talk about feeling lost then stealing a kick pattern from a song they love. always good to analyze what we love and to ask - why?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169368911989460992",
    "author": "Josh",
    "date": "2023-11-01",
    "content": "Even if it doesn’t spark an immediate song or idea it’s like you’re gathering skill points to help you beat the next boss battle around the corner",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171156204932833280",
    "author": "Zakhiggins",
    "date": "2023-11-06",
    "content": "First and foremost (I’m sure you know this but saying it anyway) make sure it’s playing the right notes, and fitting right in the groove - other than that you can probably do the rest with eq and compression. I do like a bit of microshift though, can make it wrap around the vocal nicely",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172133292661817426",
    "author": "Edward Rivera",
    "date": "2023-11-09",
    "content": "Haven't bothered. Either drum bus or snare bus",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179920097247232090",
    "author": "Josh",
    "date": "2023-11-30",
    "content": "But you’re producing a lot? I see no problem. At some point you’ll swing back into writing more and you can enjoy the change up.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185148080379662366",
    "author": "Deleted User",
    "date": "2023-12-15",
    "content": "https://youtu.be/0cmUQj3A_aM?si=1BiKf7NYYFBIzrm7\n\na lot of interesting ideas here. honestly I haven’t really layered anything besides rock snare drum in a minute",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189066593221738526",
    "author": "Zack Hames",
    "date": "2023-12-25",
    "content": "@oaklandmatt gave me a super good thing to think about in regards to groove, in simple terms. \n\nFor example, Rushing/being ahead can add excitement and energy and anticipation. Being late can add relaxed/laid back/cool. That simple distinction helped me so much with how to play outside of the grid.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196871381174984755",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "Give me 24 hours to collate some resources and thoughts / principles on how to build a firm foundation to develop from sonically and groove wise",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197067913891414026",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "You’ve got your drums …..and built your vocal chops , the chops are like your keys part …..and then you’re gonna weave a stealthy , hooky baseline to syncopate and spin with your chops and drums . As an example ….you could do a dembow rhythm over your drums with your bass part and then jam your vocal chops into that feel …..or vice versa , a dem bow feel on the vocal chops and a stuttering walking bass line part with that .  \n\nYou ll quickly catch a groove between the drums vocal chops and bass hook \n\nTodd Edwards is the yoda of voxal chops",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203267292826439700",
    "author": "Zack Hames",
    "date": "2024-02-03",
    "content": "-I use 95% hardware synthesizers and drum machines. I truly cannot dig all software for synthesis.\n-full on drum recording for most things. Like 16 mics and hardware reverb full on. \n\nVery averse to loops for a lot of the same reasons @LAPhill said. I also don’t love Kontakt because everything is so pre-mixed sounding, kinda like @cianriordan referred to; I like to do the polish myself. Sampletank is really good for solid, mostly raw sounding real samples/instrument plugs.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204489558054412298",
    "author": "Zack Hames",
    "date": "2024-02-06",
    "content": "Fair warning. This is actually from an earlier session. But it’s identical to the mic-ing and drums I used for Noah, except I had a BFSD on the snare with a bandana on the edge.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1204793012245499904",
    "author": "Edward Rivera",
    "date": "2024-02-07",
    "content": "Is it now ? I never could get on with the puigchild. Agree with waves but on a drums and bass the UA seems to do what I want (smack / groove / bring out the power)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214720505857441803",
    "author": "Deleted User",
    "date": "2024-03-05",
    "content": "but also, I could get a few sets of hi hats and record it instead",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1215287411207184414",
    "author": "Ross Fortune",
    "date": "2024-03-07",
    "content": "Parts of the kit rather than whole bus. \n\nIt hasn’t tended to be helpful to have the Fambience around a mega punchy Oliver kick drum for instance, so I’ll make it easy to keep some elements bone dry by just sending whatever else needs melding to a verb on an aux.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220516072478740520",
    "author": "Herb🇮🇪",
    "date": "2024-03-21",
    "content": "I think anyone can fall in love with the classic drum machines in general with a bit of Aphex listening",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239073560375590993",
    "author": "Rollmottle",
    "date": "2024-05-11",
    "content": "No 808 or kick synth in your DAW?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239074141483569152",
    "author": "Zack Hames",
    "date": "2024-05-11",
    "content": "Battery is too drum beat oriented; and then processing doesn’t seem to help me get there. \n\nThen the like, more bass line centric 808s on my MPC are exactly that.\n\nDug through my other loose 808 samples, they just lack the length of note and decay, I know it sounds super simple and dumb but there’s this FEELING I am missing from all of it. Clean, long, deep, not overly bending the pitch. \n\nAn example would be good; I’ll try to find. Metal bands use them a lot and it’s sort of silly",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239256920146317352",
    "author": "BatMeckley",
    "date": "2024-05-12",
    "content": "A lot of that was taking off the “time correction” bit of pitch shifting and having your 808’s tuned by essentially adjusting the sample rate, almost like a varispeed.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240367985974186064",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "Ah late to this ….. just fyi and others ….search metro boomin 808s usually come up with the file name MB808 (1) ….(2) etc . They are very long and boomy as opposed to the Thugga and Spinz / Bricksdamane ones",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1253134511789576324",
    "author": "Nomograph Mastering",
    "date": "2024-06-19",
    "content": "I don't know anyone who's gone as deep on that thing as I have and the reality is I can beat it with a regular clipper and limiter every time",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255894544604594277",
    "author": "hyanrarvey",
    "date": "2024-06-27",
    "content": "Like what if you just found a great loop and a great drum beat and let song breathe and evolve",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264498838975283231",
    "author": "Ross Fortune",
    "date": "2024-07-21",
    "content": "Oh that’s rad! Sometimes the groove feels right however splice is doing it, then falls apart with Ableton modes. Thanks for the tip.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1281850538433970268",
    "author": "Zack Hames",
    "date": "2024-09-06",
    "content": "On the flip side, I do find that using a real amp head into a load box into an IR is better still. Doesn’t beat a real speaker but it’s a lot closer.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1302283073685164082",
    "author": "gatewoodsensei",
    "date": "2024-11-02",
    "content": "Separate plugins unless that singular plugin gave me the ability to edit the percussive-ness of the 808 if that makes sense.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1310915743725916190",
    "author": "conor // wbotm",
    "date": "2024-11-26",
    "content": "my fav recently was coming into a chorus, i bounced the whole track bar drums and vox down, cut out just beat one of the chorus, reversed it and stretched it out a lil with Paul Stretch. felt great in this instance for it to be a full spectrum riser",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312972976509026434",
    "author": "Brian Reynolds",
    "date": "2024-12-01",
    "content": "There is a video of Mick Guzauski on mixing i think Happy by Pharrell on Puremix. Where I learned this but can't find. But take the hi hat. Duplicate. Assuming drummer perspective with main. Duplicate in mono. Drop the volume a bunch. And blend in. To simulate the way you would hear the hat moving through the actual room.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313048266048536618",
    "author": "vostral",
    "date": "2024-12-01",
    "content": "A perfect example of this is 24k Magic by Bruno Mars, where Kick & Snare are from LinDrum, hi hats and crash are recorded.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1314200770819653653",
    "author": "Brian Reynolds",
    "date": "2024-12-05",
    "content": "The Weeknd Blinding Lights. Learned 88 Bpm, the drum pattern, variations, and breaks used. Can make an awesome intro sound and never use it in the song again. A few sounds can sound huge. Most important how much space, movement and excitement and be created by automating filter sweeps.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1316803473995599902",
    "author": "onanisland",
    "date": "2024-12-12",
    "content": "Modern trap flows are nu-metal riffs",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318371670402273290",
    "author": "Adam Thein",
    "date": "2024-12-16",
    "content": "A joy to watch, thanks for sharing!  Inspiring to see Greg Phillinganes make those synths groove so hard",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331646841300848766",
    "author": "Ross Fortune",
    "date": "2025-01-22",
    "content": "To disambiguate, are you talking about generating a kick that sounds like it came from an 808 drum machine?\n\nProcessing these kind of kicks after the fact?\n\nOr kicks that go well with 808 basses?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1333022892799295558",
    "author": "itamaramati",
    "date": "2025-01-26",
    "content": "Primaries sounds phenomenal! Thanks for recommending. I'm always inspired by wave alchemy revolution, always fun sequencing og drum machines and their effects section is really fun for experimenting and mainly sounds bonkers.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346990807386685450",
    "author": "Felix Byrne",
    "date": "2025-03-05",
    "content": "even just like adding a single extra beat using a measure set to 5/4 then back to 4/4 can be huge",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350178412001497108",
    "author": "kieronmenzies",
    "date": "2025-03-14",
    "content": "Atlanta bass which is an offshoot of Miami bass. Same general sound with the kick pattern and 808 but the Atlanta sound is a little more r&b leaning than the Miami thing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360293824605323424",
    "author": "jonmatteson",
    "date": "2025-04-11",
    "content": "Addictive drums is pretty good for this. You can layer electric sounds on kick and snare and mix them in to taste and play them in real time via midi",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370868646506795149",
    "author": "Rollmottle",
    "date": "2025-05-10",
    "content": "Unwound's snare was always its own thing https://music.apple.com/us/album/valentine-card/954008468?i=954008507",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1371047391150473227",
    "author": "spectrummasters",
    "date": "2025-05-11",
    "content": "Not really the assignment you gave , but still : \n\nHaven’t heard this for a back beat before or since \n\nhttps://youtu.be/pyLuh2wRBuM?si=KI4foGTC777QPESu",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1373736605990260869",
    "author": "Zakhiggins",
    "date": "2025-05-18",
    "content": "Pink and white by Frank ocean has a weird ass snare too",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1380852631098097717",
    "author": "Brian Reynolds",
    "date": "2025-06-07",
    "content": "The swing and changing of the velocity of midi hits, will help the feel and groove of a sample pieced together drum kit.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387802921432776904",
    "author": "NoahNeedleman",
    "date": "2025-06-26",
    "content": "You’re in production talk, so assuming we’re talking about instruments and not mixing…(even still remember that EVERYTHING is mixing.)\n\nSometimes all you need is a little 1/4 or 1/8 note stop before the chorus and the right downbeat impact. Might be a low end “forever boom” or 808 drop or the right crash. \n\nBut also, sometimes it’s helpful to just mute shit in that verse and see what’s actually needful.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389074169810915338",
    "author": "Will Melones",
    "date": "2025-06-29",
    "content": "Maybe with the Groovecell plugin? I'm not sure, I've never actually used it.\n\nI love Sitala for how dirt simple it is. It used to be free and it's so convenient that I paid anyway.\n\nhttps://decomposer.de/sitala/",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392199911444844734",
    "author": "Slow Hand",
    "date": "2025-07-08",
    "content": "I’m always down to hop on a call and trade notes on drum programming someday, if you’d like. Happy to share anything I know.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392215976531071116",
    "author": "Rollmottle",
    "date": "2025-07-08",
    "content": "As others have said, recreating a beat you like is the school you need to go to. One of my favorite beats of all time is Fleetwood Mac's \"Hypnotized\" which is a swingy, triplet unchanging thing that is effectively a drum loop through the song, except Mick Fleetwood plays it. I recreated it using a sample pack of Mick Fleetwood's and turned it into a song after serious finagling, especially in the context of grid music. The insight into accent, velocity, swing, where in the grid things hit (or don't), which specific hits matter and how dropping just one or two key hits in a repetitive pattern can shift the groove entirely. It also tests your chops for figuring out choke groups, how to make closed and open hi hats sound \"real\" (if that's your goal) so on and so forth. I also love recreating a beat as a way in when musical inspiration may be lacking.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392272697542840563",
    "author": "hyanrarvey",
    "date": "2025-07-08",
    "content": "So like knowing your accents is really gonna help but when I am programming like hardcore or rock drums and need it to sound natural I do these things. Learning how the hand dynamics work so like for a snare roll into a Tom roll it would be like 125 119 120 110 125 118 120 87",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396235549911552191",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": "I want the mpc sound . Renaming the wav file to match the FAT12 mpc system is long . The transfer of files takes time in itself. \nI just resample everything into the mpc out of my daw system as audio and build up the program . You want the sound of the mpc right ? A major part of it is it’s a/d",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407020567344713728",
    "author": "Will Melones",
    "date": "2025-08-18",
    "content": "Say you want an 8th note delay, but you want it to start a whole beat after the dry signal. I've found myself feeling around for this a few times. It would be a valuable plugin feature",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417228431803810043",
    "author": "Rollmottle",
    "date": "2025-09-15",
    "content": "- Random MIDI generator into a Scale filter\n- Same as above but add an Arpeggiator \n- Same as above but replace the Arpeggiator with a Chord filter \n- Mangle a drum loop\n- Mangle any loop\n-  Create a drum loop with differently timed Arpeggiators and midi generators controlling a  drum machine/drum rack \n- Modular synth patches",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418038705800876174",
    "author": "diamndsdancin",
    "date": "2025-09-17",
    "content": "interesting, i think ive heard about people trying to get a logic swing over in ableton so this might be it, will take a look",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418321628680683610",
    "author": "longstoryshort",
    "date": "2025-09-18",
    "content": "it's just a random thing, a lot of people obsess over Logic swing in the house/electronic world \n\nit's based on the Linn Drum swing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418322601616609393",
    "author": "Slow Hand",
    "date": "2025-09-18",
    "content": "Thanks for the heads up!\n\nSwing is something that I’ve largely neglected as a tool in the kit. Probably because the swing feel of garage makes me want to gag and I'm averse to anything adjacent sounding. I’ll try to incorporate it more.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418322778565640365",
    "author": "longstoryshort",
    "date": "2025-09-18",
    "content": "that is wild\n\ni cannot live without a lil swing in my stuff, literally\n\nhad a session a few weeks ago where every time i'd add a lil swing it was like \"nah dont do that\" and i felt PARALYZED haha",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1421933185817903134",
    "author": "Will Pragnell",
    "date": "2025-09-28",
    "content": "are we talking specifically about the grooves that are built in to ableton here?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1462915830869397588",
    "author": "Slow Hand",
    "date": "2026-01-19",
    "content": "Y'all think these are real hats, or simply Éric Serra programming the hell out of a drum machine? \n\nEither way, I love the proportion between the massive kick/snare and the tiny hats. Such a good feel. https://www.youtube.com/watch?v=d4yHZPH6NU0",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470916974258163804",
    "author": "Ross Fortune",
    "date": "2026-02-10",
    "content": "What they said 👆🏻 \n\nCould also be an element on an upbeat to bring the head back up after it nods on the downbeat. If the head nods to a four on the floor kick pattern, the hi hat on the 1/8 notes in between brings it back up. Guitar upstrokes in reggae. That kind of thing?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1471330597413720125",
    "author": "cian riordan",
    "date": "2026-02-11",
    "content": "can't beat free, baby",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937660293184647188",
    "author": "Maxim",
    "date": "2022-01-31",
    "content": "I see what you mean. I used to fall into the trap of letting Melodyne “do its thing” or trying to align things to its pitch grid. I’ve since moved on by getting the best performance out of an artist (with the sound of autotune) and will only use Melodyne if I can hear a specific problem on a note that needs to be changed. So I guess I’ve started getting better results with it after using it less and only after listening specifically for pitch errors. I know it can do a lot more but the many features rarely helped me make the vocal sound better.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "939504650615414845",
    "author": "Maxim",
    "date": "2022-02-05",
    "content": "Try layering some pitched TR 808 sounds with Timbaland-esque vocal samples/beatboxing. Throw an acoustic kick underneath and find a rimshot that has the character you like and play with Valhallavintageverb or Tsar. Maybe download some free Reddit sample packs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941067108400377856",
    "author": "Zakhiggins",
    "date": "2022-02-09",
    "content": "Hmm. Hard to say. Put it this way, imagine you just got any old kick snare and hat sample, and made a basic beat with just those 3 samples and no processing. How would you approach going from that to making it sound finished?\nI suppose I'm talking in about pop music mostly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941099860294250546",
    "author": "Maxim",
    "date": "2022-02-09",
    "content": "Sounds like you’re looking for density without it being cluttered or overproduced. \n\nUsually “noise” (not literally but parts of the groove that you mainly feel but don’t make out specifically like you would a kick and snare or hi hat) serves this purpose for me. Elements which if muted would leave you feeling like something is missing but you can’t necessarily make them out when in. \n\nI guess this could be anything from a few percussion loops (maybe panned/verb with no pre-delay or less high end to place them at the back of the mix) to a subtle vocal or foley sample playing one note throughout the groove. \n\nLayering to me is part of this but my intent with it is usually to create a sound or get more out of an element (like layering the attack of a snap with a clap for a different transient / texture). But this doesn’t always add to “fullness” in my mind. It just makes one element better or more interesting. \n\nMaybe start with the loops and foley. Splice Bridge makes testing things really easy too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "952190587744968734",
    "author": "frankieharper",
    "date": "2022-03-12",
    "content": "Does anyone have / know of any drum samples that are in a similar vein to this track \n\nhttps://open.spotify.com/track/3U8dhK8wiVtsdmj7jwUJlB?si=JmohhXz2SE-LvQCO_eciJQ\n\nCan’t find anything that comes close… that snare is wild 🤩",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "952604166361063484",
    "author": "isaac joel",
    "date": "2022-03-13",
    "content": "What is everyone's favorite beatmaking apps for iPad/iPhone? Ideally free or close to free. I'm helping a Montessori school with their spring inter-session and want to give them a few resources for the students 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954056626485227570",
    "author": "Zack Hames",
    "date": "2022-03-17",
    "content": "Jon and Matt have talked a lot about nudging performances ahead or behind the beat to make things groove more. (whether it's a hihat or a vocal or whatever)\n\nCan anyone substantiate why you would nudge ahead or behind and what the effect musically is? I understand what swing is but I can't seem to make a real decision on what really feels \"right\" when I attempt this technique. Sometimes it sounds fantastic and other times not but I cannot quantify it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954088247989010433",
    "author": "ALXCPH",
    "date": "2022-03-17",
    "content": "Ahead of the Groove: listen JD Beck and domi, when they go off jd’s drums are Miles ahead. \n\nBehind the beat: anything by d’angelo with questlove(he is a wiz) \n\nStraight on beat: stay Justin and laroy. \n\nAnd thats just drums. \nVocals, bass, percs and every other instrument is able to push and pull on a Groove to make it feel different. Like Matt Said, urgency , laid back, danceable, hectic, tight, fun, sad. \n\nGroove is a master of emotion combined with harmony.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954088845190774796",
    "author": "ALXCPH",
    "date": "2022-03-17",
    "content": "In a lot of trad Brazilian music, the groove moves and modulates during passages.(very human) but also very powerful. African grooves are usually late, Indian grooves ahead. This is VERy generalised by the way. It’s such a nuanced and complex topic. But it is very worth learning about!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954090054849024071",
    "author": "ALXCPH",
    "date": "2022-03-17",
    "content": "Also groove is much more than just timing. Dynamics and accents combined with placing certain beats ahead and behind is when it really starts to come together!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954132445127659562",
    "author": "Deleted User",
    "date": "2022-03-17",
    "content": "length and evolution of the sound throughout the duration of the note also adds significant amount to the groove",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "954421490298810409",
    "author": "spectrummasters",
    "date": "2022-03-18",
    "content": "Nice 👍🏼 That’s a good look . Congrats . ’Have you done any work with internet money/ taz Taylor ?  But yeah yachty , he’s a dope artist . Imo . Interesting also as I  thought gent memishi was his engineer and did all his tracking cause other engineers always try to nudge back his vocal and he didn’t like it . I like the ahead of the beat flow , nba young boy’s another one who takes it to the limit . Can be a bit of a nightmare keeping it in the right pocket if any latency starts happening later in the mix though I find.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "956823190829662249",
    "author": "Keegan",
    "date": "2022-03-25",
    "content": "To me, the production/sonics sound great. Stylistically, I think it's a little bit bland, but do stylistic choices like the type of instruments, the tempo, drum pattern, etc. count as production to most people? Or is it more about the specific way that those instruments sound (or would that more be a matter of *mixing* rather than *production*? One friend told me that they consider production to be what the instruments are playing rather than the sonic character of the instruments themselves (I would've normally considered that to be *composition* rather than production. There's no right or wrong answers for what production really *is* imo, but I'm just curious what others mean when they use the term.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "956921912775295097",
    "author": "KushKadett",
    "date": "2022-03-25",
    "content": "Tbh it feels to me that a lot of production choices are made by the mixers these days. Sometimes even  drastic ones. If you look at certain beat breakdowns on youtube its hard to even recognize the pre mix version to the finished one because the bare beat sounds so different",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "962530736236265472",
    "author": "Eric Martin",
    "date": "2022-04-09",
    "content": "I love that thing about snare mics when there’s a top and bottom mic people almost always flip the polarity of the bottom mic out of habit, and I find that how I mic the snare it’s always in phase(sounds the way I like it) without flipping polarity of the mic.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "965743741639991348",
    "author": "1ggy",
    "date": "2022-04-18",
    "content": "What are your guys go to production techniques for chords/melodies if you're not a pro on keys or guitar? Mine for example is using Scaler as a midi instrument, finding a cool progression or pattern and then messing with the midi. Or, finding a cool sounding melody in Splice and then using Pitchmap and/or melodyine to get it in the correct key and chopping it up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "965745872900067348",
    "author": "Rollmottle",
    "date": "2022-04-18",
    "content": "Big fan of Ableton's Scale and Chord midi tools so the same dumb finger patterns I make on the keyboard come out much more interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "971451685018927175",
    "author": "delwin",
    "date": "2022-05-04",
    "content": "I do this a lot!\n\nIn Ableton, you have soooo many options. Most often I put the sample on an Ableton Simpler and am able to slice / pitch / etc really fluidly — record that, and then edit by hand. This is my workflow for 90% of vocal chops. If it’s really simple I’ll do it by hand but I find I get more musical results if I can “play” the chop. \n\nThere’s also Buffer Shuffler and Beat Repeat in Ableton which can be fun and unpredictable. \n\nThe Glitch Machines plugins are also really nice if you’re going for something a bit crazy (two of them are free and very good). I don’t fully understand them yet so I just throw them on when I want something wacky to happen. \n\nAnd I’ll also second stutter edit — very fun for “playing” chops live too, and editing presets isn’t too hard either.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "971487579344109578",
    "author": "delwin",
    "date": "2022-05-04",
    "content": "tbh I don’t know how ppl “produce” in pro tools. as great as it is for editing and recording and mixing, it’s so cumbersome for beatmaking",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984310015022223390",
    "author": "ehutton21",
    "date": "2022-06-08",
    "content": "okay, brilliant, you’ve confirmed my instinct which i was telling the artist—we need to swap the other guy’s kick out, it’s not handling low end and has too much click/snap/pop at like 1.5k",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984311208033284106",
    "author": "Deleted User",
    "date": "2022-06-08",
    "content": "i haven’t heard the music but yeah, low end needs to be sculpted from the arrangement- sometimes I get confused on which one to favor when I arrange without thinking about it and end up having to redo the kick and bass",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984583022990983209",
    "author": "chris_donlin",
    "date": "2022-06-09",
    "content": "Anyone know how to solve the timing issue with vocal synth and/or alter boy in midi mode? They’re always way ahead of the beat which makes it hard to demo ideas",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987475081548681256",
    "author": "Jeremy Klein",
    "date": "2022-06-17",
    "content": "Yeah im thinking of trashing some of these mics.\n\nI have a kick mic which appears to have highs cut to like 150hz lolol. I have a snare that has more hi hat then snare and almost no low end. And then I have an overhead. Add to this that all these mics sound like they were the mic off an iPhone. (just not clipping)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987475418711990282",
    "author": "Jeremy Klein",
    "date": "2022-06-17",
    "content": "rest of the production is trap drums and 808 which is just hard to layer real drums even if they are recorded great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987477438592344094",
    "author": "ehutton21",
    "date": "2022-06-17",
    "content": "For samples of you add your own you can try and layer in that really thin kick as a top layer if it doesn’t fuck up the phase",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "992166082083307561",
    "author": "Eric Martin",
    "date": "2022-06-30",
    "content": "It works, we were just tracking something that had a written part and I was able to copy the audio to a MIDI track, make a few “quantization” edits and it was basically the same as the music the artist sent and I did about 2 minutes of work to it, both saying, “ I think this is a thing now” and then actually looking it up and trying",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994258628548759653",
    "author": "gatewoodsensei",
    "date": "2022-07-06",
    "content": "What’s you guys’ favorite vi drum machine? I’m mostly in battery 4 if I’m using Logic or FL’s channel rack.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994278039930277978",
    "author": "1ggy",
    "date": "2022-07-06",
    "content": "Battery or maschine(even if the hardware isn’t plugged). But, have almost pulled the trigger on XO a couple of times. Maybe Black Friday.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994679259392122972",
    "author": "gatewoodsensei",
    "date": "2022-07-07",
    "content": "I’m not sure when was the last time NI updated it. I tend to like the impact xt in S1 and use that most of the time. Actually. Now that i think about it, in logic, I use the drum machine designer. 🌚",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994680320588783656",
    "author": "ALXCPH",
    "date": "2022-07-07",
    "content": "I’ll use midi for synths, sample based keys and 808’s tho!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994720640290525335",
    "author": "Zack Hames",
    "date": "2022-07-07",
    "content": "I’ve yet to find a sampler plugin that is really fast and easy to use for me - Somehow using an AKAI MPC is easily the best and fastest way for me to use any electronic drum elements.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994733990244261988",
    "author": "Calvin Lauber",
    "date": "2022-07-07",
    "content": "Yup. Drum Rack is just better than anything else I’ve tried. I need to find an easy way to use drum rack in protools.. I’m sure some of you guys know how to do that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994791533574369361",
    "author": "Calvin Lauber",
    "date": "2022-07-07",
    "content": "This seems to be an easy solution for using the drum rack or midi instruments from ableton within Protools, but less sure about how using the Effects Rack with this method would work? https://youtu.be/k0HWeGQKdQg",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996193493150072832",
    "author": "Will Melones",
    "date": "2022-07-11",
    "content": "Isn’t it!? I was hoping to find something really low-cpu to mimic the ableton drum rack in pro tools, that I could quickly and easily map to my nanopad. And this hit the spot",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999371584282304692",
    "author": "gatewoodsensei",
    "date": "2022-07-20",
    "content": "For the producer/engineers out there - do you guys do all of the production and recording in one session? Or do you bounce out the beat and do all of your recording in a separate session?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000201519481757716",
    "author": "BatMeckley",
    "date": "2022-07-22",
    "content": "Is anyone here in LA and good with maschine?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000209585698775070",
    "author": "Slow Hand",
    "date": "2022-07-22",
    "content": "I know a guy who's *amazing* with Maschine, but he may not be in LA at the moment. Is it critical that he be in person, or would a phone call or Zoom work? We can talk details in the DM's if you prefer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1002315087001964714",
    "author": "cy (sigh)",
    "date": "2022-07-28",
    "content": "my personal stash is mostly divided into \n1. loops & parts \nmostly from productions that never see the light of day or I wasn't inspired enough to finish in the moment. each having their own subfoler w key and bpm on them.\nthis folder also includes melodic things usually\n\n2. kits\nI set time aside specifically to do sound design so those  get made into a kit usually. this includes one shots, loops and any FX I mightve made \n\n3. one shots \nany one shot sample I start using regularly enough ends up here eventually. in subfolders (kick. snare and claps, hats and cymbals, etc) \n\nbesides the one shots from design sessions I tend to use difference spice name and food items to help me distinguish the sounds that might go together (obviously this'll vary per person) ex. \"snare matcha\" and \"snare anís \" will usually work with\"kick milky\" and \"kick cocoa\" and so on. lol\n\noh if pull from alrwady mixed stuff it'll usually go in the one shots with a name that reminds me of the track it's from.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1002781899820912661",
    "author": "Tyler Graham",
    "date": "2022-07-29",
    "content": "I think its a really good starting point. Committing it down and chopping / processing it further can lead you to some really cool drum grooves. Esp slicing the loop and playing it as midi",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012127089832505404",
    "author": "NoahNeedleman",
    "date": "2022-08-24",
    "content": "Who wants to share their fav tools or general philosophies for Groove Editing vocals in pop/bedroom pop?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012150259905986672",
    "author": "ehutton21",
    "date": "2022-08-24",
    "content": "Vocalign is really essential to my work flow because of how many harmonies i get from clients & collaborators. I also create doubles with it a lot & use melodyne/alterboy to enhance the texture. \n\nAs far as editing groove/timing, that’s hard cause I always cut that stuff until it feels right. Most of the time I’m gettin tracks where the artist or the producer or whoever (lots of times it’s the same person) has already agonized over the timing and cut it up so it’s solid. I’m mindful of words where the first syllable is cacophony or plosive-based (k, t, d) when it comes to sounds that hit on the quarter note (esp with snares). I usually let those sounds start just before the transient and end so that vowel is starting right on the note, depending on how it’s quantized if that makes sense. \n\nFeel like groove editing gets a weird wrap but i here songs where the timing could have used aligning after the amount of compression that got applied.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018474257174495303",
    "author": "louisvie",
    "date": "2022-09-11",
    "content": "hiya everyone. sub bass question : how do i decide which instrument is going to take the under 40hz frequencies between kick and bass ? for a rock song with hybrid drums and hyped up real bass gtr. i personnaly prefer bass to hit me rather than kick cuz i like the longer rumble, but i feel like the other way might be the best. for this one. i will A/B but any tips are appreciated 🙏",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1018602900592791613",
    "author": "Calvin Lauber",
    "date": "2022-09-11",
    "content": "Totally agreed . On a quicker kick pattern you really don’t need or probably want much under 40 happening. However on a nice slow song with a fat open kick drum having it extend all the way down can feel amazing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020802074918793349",
    "author": "Slow Hand",
    "date": "2022-09-17",
    "content": "Does anyone have any rules-of-thumb that they rely on when programming groove?\n\nThings like \"I like my bass notes to be ___ in relation to the kick because...\" or \"I put my hats (blank) the snare because...\" or \"My (instrument) is 100% locked to the grid all of the time.\" \n\nOf course, everything is context dependent, so we're talking generalities here. But if you make nothing but trap music or lo-fi beats it would be good to mention that as well, for context.\n\nI'm curious to know what approaches everyone else has arrived at. For better or worse, I like to start with a blank slate each time and it ends up being an exploratory process for me every time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020805692094947358",
    "author": "Zack Hames",
    "date": "2022-09-17",
    "content": "I asked a similar question a while ago, and @oaklandmatt had a great answer basically to the effect of: \nSomething rushing ahead adds energy or anxiousness (a punk bass line or fast trap hihats, maybe a rock guitar solo)\nSomething late adds groove/swagger (Lofi hip hop snare, a lazy vocal, a funky bass line)\nI think that’s a really cut and dry way to view it; but what you said obviously applies, every context is different.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020824609920135178",
    "author": "cy (sigh)",
    "date": "2022-09-17",
    "content": "yeah its very case by case. as far as groove in relation to other elements. I've had guitars recorded loosely toa click and worked the groove around that - lining up the downbeats of the drums/bass  with the guitars even if it's a bit early or late. that was for a more indie type of joint. and for something more trap /modern hip hop, I've nudged bass notes or samples to get them to either sync w drums up for impact  or nudge slightly off to hype of of pull back the energy in the groove. \n\nas far as programming. I'll play with forward swing and dragging notes a lot if I'm going for a more real/dynamic feel when programming. keeping in mind that if the goal is trying to stay \"on time\" any fwd swing that might happen at the start of a phrase will be compensated with some drag  after or vice versa.  keeping velocities in mind w drum hits + linking it to a filter env so that harder hits have more high end and softer hits end up a bit rounder.\n\nadding subtle layers that are similar   to the main drums but occupy a different texture or tone  in dif  sections to thicken up the groove or automate the attack /sustain of certain elements thru diff sections to help shift the listener  focus throughout",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020825030868877412",
    "author": "cy (sigh)",
    "date": "2022-09-17",
    "content": "also if using an 808 switching up the length of the sustain in diff sections can shift the groove a lot without needing to change up top much in the actual drums. especially if you've got parallel compression going between kick and subs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1020839926662692904",
    "author": "ALXCPH",
    "date": "2022-09-17",
    "content": "This is one of my favourite subjects and would love to go deep on this at some point. maybe in VC one day or something? Groove really Isnt as simple as \"i always do xxx\" But one good rule of thumb is, always make sure your 1 lands on 1, not before, not after. that will be your anchor. After That, the fun begins 🥳",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032032631971397732",
    "author": "peterlabberton",
    "date": "2022-10-18",
    "content": "No hardware controller, but the softube spring reverb has a feature where you can virtually beat the thing up for crazy spring effects. Unfortunately it doesn’t sound very good.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033915726370705509",
    "author": "1ggy",
    "date": "2022-10-23",
    "content": "The hardware is really slick, great for sampling, great for beat making. Check out some of the YouTube or IG videos. Not cheap but it’s quality.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033945535507333130",
    "author": "Zack Hames",
    "date": "2022-10-23",
    "content": "If you haven’t used an MPC, and you liked those, you should try one. I’m obsessed with mine. (MPC Live II)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033945891381461012",
    "author": "kidcutler",
    "date": "2022-10-23",
    "content": "MPC pads are fun, it’s a pain in the ass but I always enjoy my mpc2000 when i feel like dealing with floppy discs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033954712308957194",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "I am curious about an MPC. I had an akai base level drum pad but honestly the latency and usability of it wasn’t at all what I wanted",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033954798468337674",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "The MPC’s seem nothing like that though. Much more useful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033956742792495215",
    "author": "Rollmottle",
    "date": "2022-10-23",
    "content": "Miraculous to me what got made on those early MPC 2000's. I found the interface so impenetrable for my brain.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1045845878595932230",
    "author": "popaganda.",
    "date": "2022-11-25",
    "content": "That’s just the pattern with Waves. You get them free or for $30, and then you upgrade your computer and need the new versions and it costs $240 to upgrade your whole collection. It’s fine until you need new versions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1048297214037991494",
    "author": "louisvie",
    "date": "2022-12-02",
    "content": "||The hihat groove changes slightly.||",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1048312938764709969",
    "author": "NoahNeedleman",
    "date": "2022-12-02",
    "content": "Honestly i didn’t notice a change, then I read your comment and realized my brain was just filling in the pattern from the beginning anyway. ¯\\_(ツ)_/¯",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050123554450063471",
    "author": "Adam Thein",
    "date": "2022-12-07",
    "content": "I use both AD and SD.  \n\nAD was easier for me to learn and jump into, but I'd say it's also a little more limited in how realistic you can get depending on the ADpaks you have.  Great for getting something in quickly, and I still use it quite a bit.\n\nSD definitely had a learning curve for me but DAMN you can go deep if you really want to tweak out on drum programming.  There are tons of articulations, tons of microphones, and the expansions are all super in depth as well so you can shop around and figure out what is best.  It's definitely at a premium though for price, and I don't reach for it as often if I'm trying to get an idea out quickly, but I just used it today to play in some hihats because it sounds closer to real to my ears than AD.\n\nThe other thing I'd add about SD is the install size is pretty massive.  I have the core library with all the mics installed and their EZX kick and snares library and it's taking 250GB on one of my externals.  Oh by the way you can use any EZ Drummer libraries in SD which are more similar in depth to Addictive Drums stuff and they put out a few new libraries a year.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050128023208345744",
    "author": "popaganda.",
    "date": "2022-12-07",
    "content": "I like addictive. But then I bought a kit and me + beat detective has gotten me better results than any plugin. But some of the addictive kits are lovely.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050129655392370779",
    "author": "Deleted User",
    "date": "2022-12-07",
    "content": "That sound is on more processed side, but acoustic drum workshop has pretty organic sound (probably still processed) with 3 velocity layers and snare rolls. They also tell you the drum sizes so I find it pretty useful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050142597814964384",
    "author": "jonmatteson",
    "date": "2022-12-07",
    "content": "I like addictive drums a lot. Their presets sound great, it’s easy to use, and has great sounding fx. My favorite part about it is the midi packs. You can spend a day going through and favoriting patterns you like and when you’re in a session you can audition them with the song tempo and adjust the midi info then drag and drop the midi file into your session. Makes building realistic sounding grooves much faster/easier!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050163467379814411",
    "author": "Zakhiggins",
    "date": "2022-12-07",
    "content": "I think there's a knack to searching on splice to be honest, often when you seach for jazz/folk snares, it doesn't give you jazz/folk snares, but a particular kind of snare that's something else, and once you figure out what that is, I think it's kinda useful. That's been the case for me anyway. Just make sure you only use it for one shots, or else you'll be chasing your tail.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1051603180733079622",
    "author": "Slow Hand",
    "date": "2022-12-11",
    "content": "(Ok. Now I'm starting to run with this train of thought. Now would be a good time to step off if you've gotten what you need.)\n\nI don't want this to sound like the end-all be-all. One of my absolute favorites is James Brown, and there is no way that some of his songs would hold up to the level of scrutiny I'm describing. And those records *kill*. It's all vibe. It's vibe all the way down, bebe. Not a chord change in sight. Barely a melody in some cases. And that's alright.\n\nSo what did James do? More often than not James would get all of his band (real jazz killers) in the studio and he would sing the parts to them one by one and allow them to input their own feel.\n\nHe'd start with the drummer and have them play a pattern that James was feeling. Once the drummer was jamming on that he would move on to the bass player and sing them an idea. Once the bass player had that germ of an idea they would continue to jam on it with the drummer, refining and adding their own thing. Then James would move on to the horns, and so on, and so on.\n\nWhile James could be dictatorial and (from the perspective of music education) the least technically qualified person in the room he had *vision*. \n\nIf the song has a strong identity you can give your players a good (non-technical) prompt and they can interpret that through their own sensibilities. You can describe a mood, or a scene, or an abstract sensation.\n\nR. Kelly once said (I'm paraphrasing): \"RnB is supposed to feel like the best moment of your *life*.\" That simple description conveys so much about the feel, the pleasure, and the joy that he is looking for in his music. It also excludes a lot of possibilities as well. If you can give your players a prompt like *that* then you can get everyone aligned on the same wavelength and it will carry you so much further without the need to dictate parts.\n\n----",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054880976028839957",
    "author": "LAPhill",
    "date": "2022-12-20",
    "content": "One really powerful thing that it has that I'm not sure Massive X can do is MSEGs. You can create some pretty complex patterns and lots of internal modulation easily. Massive had a simple version of that with its Perform mode, and I noticed that Dune 3 (my latest favorite softsynth) has MSEGs, too. \n\nTBH I haven't spend a ton of time with Massive X, I should probably do a deeper dive into that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055270407210541096",
    "author": "Ross Fortune",
    "date": "2022-12-21",
    "content": "Yessir. And the drums are the Battery Jack Kit 808 bits",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055271890123509870",
    "author": "Ross Fortune",
    "date": "2022-12-21",
    "content": "Yeah I mean they’re just straight down the line 808 world-ish drum sounds, but I think he mentions that they were the temp sounds for the writing session, but they were working so they stuck. I love also that the lovely synth that introduces the song is a free plugin (can’t remember name), with some logic stock chorus. Super stuff.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055331900056682516",
    "author": "sukhuno",
    "date": "2022-12-21",
    "content": "Yeah I find tuning stuff tends to cause the transient to change so I almost always will have my kick sound as a transient and boom. Might be useful to try the same thing with your percs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055333218108325928",
    "author": "austenballard",
    "date": "2022-12-21",
    "content": "I've actually gone to using Kick 2 to sort out this problem as far as kicks are concerned, but plugins like the ones you mentioned (VOG ftw) are definitely useful there!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055352872755269674",
    "author": "austenballard",
    "date": "2022-12-21",
    "content": "the method needs a little refinement as I can tell I'm losing some transients but the premise is there; the kick, snare and hat are all tuned to C",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055568609872724150",
    "author": "austenballard",
    "date": "2022-12-22",
    "content": "So this is the kick drum: I've set the frequency to the root note of the key the song is in (in this case C), low feedback so that it just adds a *hint* of tone, low pass filter, and then I'm using the envelope to control the dry/wet so the attack of the unfiltered sample happens before the tone comes in to avoid messing with the transient - these are for drums, after all",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1057320214385143940",
    "author": "Ross Fortune",
    "date": "2022-12-27",
    "content": "From a cursory Synthtopia scan:\n\n\"So it seems that Luis Fernando Zepeda is part of the Organist generation of 60s-70s Mexico City with others like Evaristo Enriquez or Juan Torres.\nThis technique was “invented” by Tito Enriquez but perfected by Ernesto “Hill” Gil Olvera, whom was blind, and recorded LPs under the advertising that he played “the Organ that Talks!”\n\nI found on a random blog that the drawbar configuration was something like this, you started with:\nA = 88 8000 000 00\nE = 80 8080 000 00\nI = 80 0080 000 00\nO = 80 8000 000 00\nU = 80 0000 000 00\n\nAnd you worked them with your left hand as you played with your right hand and play bass with with left foot and expression with right foot. It is a Hammond X66\"\n\n\nThere's lots of Ernesto Gil Olvera stuff on YT, but I (and my nephew) don't like it is as much as this Luis Fernando Zepeda track. Can't find anything else by him unfortunately.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057706916685561929",
    "author": "Zack Hames",
    "date": "2022-12-28",
    "content": "That makes sense. I've got a fender twin and it's hard to beat - but I am running this marshall JMP and wanting something more for live / a committed rig. Going for more live than studio, or perhaps writing if that makes sense.\n\nI have heard the surfy bear is amaaazing. I'll check out the source audio true spring pedal. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059435449292161034",
    "author": "conor_i997",
    "date": "2023-01-02",
    "content": "What are people’s main techniques for creating groove when programming drums. I know it depends but something I’ve heard is moving the hi hats slightly behind the grid and the snare slightly ahead. I also humanise the midi in logic to create more human like velocities and also mess with the swing. Just wondering if there’s any other ways of going about it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059437571266056212",
    "author": "Deleted User",
    "date": "2023-01-02",
    "content": "Playing it or you can take a drum loop with groove you like and map out a groove template. Playing it is much faster and more feel, but often times it will need editing unless you have great timing. If it’s something loose then I’d definitely go ahead and move each notes because quantizing even 50% is going to change the feel. This is real nerdy but when there’s a really good moment in groove, I use logic’s event editor to look at how many ticks they are off by and snap other notes to somewhere near. For example, if I liked the feel of it being 40 ticks late then I’m gonna move everything (or some select notes that are in the same spot of the groove cycle) to somewhere nearby. Ticks are tempo relative so 50 ticks in 90bpm is different than 50 ticks in 120bpm. But it’s still in same relative timeline, but it’s going to feel different in different tempos. \n\nIf you want it to groove like a drummer played it, best thing to do is play it in. You might end up quantizing or fixing velocity to al 127 later, but it’s going to be better than clicked in sequence if that is the style. Clicked in sequenced drums is its own groove too, you don’t want them having looseness so you quantize them all to 0 but you can still mess around with nudging them to be a bit behind or ahead of the grid.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059439807077556295",
    "author": "conor_i997",
    "date": "2023-01-02",
    "content": "Appreciate the advice. I always find it so hard to play it in live in midi. Can never really get the groove I’m looking for 🥲",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059454932186579055",
    "author": "Ross Fortune",
    "date": "2023-01-02",
    "content": "Great stuff above. One tiny thing I think I originally got from (gasp!) *Pensado* is the MPC 16 55 groove. Represented in all daws I know, it works great when you need to keep a straight pattern straight (without apparent swing), but when straight straight (100% quantised) feels too robotic. It can be just enough to get things moving.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059589239022559295",
    "author": "KushKadett",
    "date": "2023-01-02",
    "content": "what do you mean specifically about ppqn? Curious to hear because the new MPC lives and X's have the option of changing the PPQN",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061658965181726842",
    "author": "KushKadett",
    "date": "2023-01-08",
    "content": "Is it better to use a midi cable vs usb midi when interfacing your midi keyboard with say your mpc and other pieces of gear?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061740288231604364",
    "author": "ALXCPH",
    "date": "2023-01-08",
    "content": "Wait so you don’t want the 300000th reiteration of the same 808 clap sample? Are you sure?!?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062014381816295474",
    "author": "Ross Fortune",
    "date": "2023-01-09",
    "content": "I'm on the same tip as you, just dropped 4800 credits on whatever Oliver and KSHMR stuff I didn't already have.\n\nDo you (or anyone) know if you can still use the splice interface to navigate your library once you've unsubscribed? Their folder directory system makes sense, but without the app interface it'd make more sense to dump everything into one folder than to have to dive 5 levels to find the one Chromeo kick sample you downloaded for a session",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062022723620044892",
    "author": "Ross Fortune",
    "date": "2023-01-09",
    "content": "While we’re talking samples… I find good, useable acoustic hi hat 1/8, 1/16th etc loops at multiple tempos challenging to find. \n\nAny top tips?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062041492337725500",
    "author": "Will Melones",
    "date": "2023-01-09",
    "content": "There’s a way a practiced drummer can finesse a hi hat and play 8th notes with feel. I don’t want super robotic loops, and I’m personally not interested in trying to redesign that groove with MIDI programming. That’s just me though. A simple hat loop seems like a great way to add some humanity to a mostly programmed track. And if it’s recorded for a few bars live, you’re not hearing the same exact sound twice.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062049004860477440",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "That makes sense! \n\nTo me being outside the studio is much more about finding the vision, than being able to execute it. I don’t care if my kick is 15db too loud and everything is distorted to hell. If there’s a vibe that’s inspiring that’s all that matters. Once the vision is clear it’s usually easy to reign it in and start making sense of thing once you get back into the studio, because now the goal is clear. Looking for a goal in a studio is just not as inspiring to me. \n\nI can always re-record stuff, and that part can also inspire immensely. But I find it much easier when the vision is already there, that doesn’t mean we have to be locked to it 😇",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062070224813310003",
    "author": "NoahNeedleman",
    "date": "2023-01-09",
    "content": "For my producer/mixers: You guys know that feeling when you’re done with tracking, and you’re just leaning into the minutiae? Like how much poof should the kick have? How does the low mid in the bass effect the groove in the vocal? \nWhat’s your overarching feeling about that part of the process?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062330551450742875",
    "author": "Ross Fortune",
    "date": "2023-01-10",
    "content": "Woah. This is what I was doing 10 years ago with Addictive Drums 1 and it worked great.\n\nI think having Splice somehow caused me to just forget that. \n\nOddly I keep a Kontakt kit in my template for cymbals (third chorus in a rock song type stuff - 1/8 note bashing that doesn’t sound machine gun, with a gentle sidechain from the kick to simulate overhead compression), but I forgot about the hats approach. Thank you for the reminder!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062331979590271087",
    "author": "Ross Fortune",
    "date": "2023-01-10",
    "content": "This is my current solution for productions when no one else is around (actually I borrow my studio neighbour’s hats, until I buy my new kit), but I’m thinking of laptop writing sessions where I just need something useable quick.\n\nI find that simply speeding up/slowing down a hat groove (that I’ve played, or someone else) doesn’t work very well, especially beyond a BPM or 2. Maybe something to do with the dynamics and how the change in tempo would affect how a human would play.\n\nSo I guess what I want is to build a folder of sick sounding hihat grooves, with interesting sounds, different weights and tones etc, maybe cool processing, all at multiple tempos in steps of 2-3BPM so I can just throw that shit in and warp from there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062501581192441896",
    "author": "Zack Hames",
    "date": "2023-01-10",
    "content": "I find the kick sounds worse at the end and the snare sounds better at the end. (Detuned just right)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062501773539016755",
    "author": "Zack Hames",
    "date": "2023-01-10",
    "content": "for sure. Kick drums drive me crazy, they're the easiest and hardest thing to get right at the same time. Either it lands perfectly or it's a nightmare.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064167007513223219",
    "author": "OJ",
    "date": "2023-01-15",
    "content": "say you got yourself a nice drum pattern, do you ever group em together and lob something on the group to give em something extra - like saturator, bit of reverb type sh?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066374738039025726",
    "author": "KushKadett",
    "date": "2023-01-21",
    "content": "same boat. Although I'm discovering new things about both daws atm. Does Pro Tools actually allow you to import your own grooves like ableton?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066812294312509490",
    "author": "ehutton21",
    "date": "2023-01-22",
    "content": "The kick is what bothers me right now. I know I need to change it but right now we have a stock ableton kick that sounds like a basketball",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066830853877022790",
    "author": "Adam Thein",
    "date": "2023-01-22",
    "content": "Also Com Truise drum programming is so sick, in a way that stands out to me against a lot of Synthwave",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070323426104979546",
    "author": "KushKadett",
    "date": "2023-02-01",
    "content": "true, but for some reason ableton doesnt allow you to change the envelope settings for each chop. What plugin sampler let's you do this? So far I only know of the MPC but that's a hardware sampler",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1071149987402109019",
    "author": "VESHZA",
    "date": "2023-02-03",
    "content": "hella op on 808s wtf",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075829377327190126",
    "author": "mcneazy",
    "date": "2023-02-16",
    "content": "For pop tracks that need to sound “perfect”, when y’all track live drums and bass, are y’all recording a bunch of takes and then comping until the drums and bass line up, or are y’all using beat detective. And if you are using beat detective, are you moving the bass to line up with the drums or moving the drums to line up with the bass. I just struggle to get the drums and bass tracks to lock in together like the pros",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075831513414897786",
    "author": "hyanrarvey",
    "date": "2023-02-16",
    "content": "Its actually both, i’ll comp to avoid edits and make it as tight as possible then beat detective what i just can’t fix w comping",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075837916829458472",
    "author": "hyanrarvey",
    "date": "2023-02-16",
    "content": "Also if your editing, start backwards so you never fuck up the groove",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075839723991470101",
    "author": "hyanrarvey",
    "date": "2023-02-16",
    "content": "Yeah and it won’t fuck the groove as opposed to left to right",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078366395978485893",
    "author": "KushKadett",
    "date": "2023-02-23",
    "content": "Yeah i know of that but it’s really unreliable and messes up grooves all the time imo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079459238566428732",
    "author": "hyanrarvey",
    "date": "2023-02-26",
    "content": "Nah, but its hard to beat a bunch of bad ass pedals infront of a bassman",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080726225548492820",
    "author": "Nick Hatzakos",
    "date": "2023-03-01",
    "content": "Thanks @philbarnes !\n\n@Slow Hand I think just good sounds that I don't need to play with very much to get a vibe. \nThink co-write sessions with artists in the room, smash the drum pattern out in 10 minutes and then continue to work on the song without having to enter \"Engineer\" mode playing with plugins to make the drum sound passable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081159249117331467",
    "author": "Ross Fortune",
    "date": "2023-03-03",
    "content": "1) what are the top 5 most important things for you in purchasing a drum sample pack ?\n\n\nI never purchase drum sample packs - not since having Splice. I do like a clear identity in a pack though - for instance, The Kount's sample pack has all those lo-fi/saturated kicks and snares, wonky grooves and crusty hi hats etc that sit very much in his genre, so if I'm reaching for that sound, I know exactly where to go. \n\nI don't know your drummer or his band, but I'd wonder what distinctive character you could capture in your pack? So that I know exactly where to go when I want \"that\" sound in a writing session instant. \n\n\n2) I’m always annoyed that all samples are 0.0db normalized and I always have to turned them way down to keep my gain staging coherent, would I be crazy to have them peak at -8 ? Would people automatically hate it ? \n\nI produce largely in Ableton now, and when you drop a sample in the drum rack, the instance of Simpler it creates defaults to -12dB. With the velocity:volume dial at default (45%), this causes a 0dB sample to play back at -6dB when velocity=100 (the default). My template has all mixer faders (including a basic drum rack + instance of Drum Buss) trimmed to -9dB (similar to my mix gain staging strategy I detailed previously), allowing me to mash stuff up if needed, and still have headroom to not have to max out vocals when it comes to cutting them. What I'm saying in a roundabout way is... I've already made allowances for 0dB samples, so I don't care - but you probably should, because if you're selling on Splice, they could sound dwarfed against the next pack.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089130318608482374",
    "author": "Ross Fortune",
    "date": "2023-03-25",
    "content": "On phone speaker feels like something one of the good drum plugins (EZ Drummer etc) might do better than individual samples. @hyanrarvey ?\n\nTravis Barker pack might get you close on the kick though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089218115914698923",
    "author": "hyanrarvey",
    "date": "2023-03-25",
    "content": "If you want the riot snare i got you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089218248467292180",
    "author": "hyanrarvey",
    "date": "2023-03-25",
    "content": "Bendeth is snare is like 5 samples stacked",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089254177231880192",
    "author": "jonmatteson",
    "date": "2023-03-25",
    "content": "I like addictive drums for this and i'll add an electronic snare that links to the acoustic snare for that extra high and low. Will also add a sample on top of that if it needs it. This shit is honestly way easier and more fun with real drums in a nice studio though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089543209929154680",
    "author": "austenballard",
    "date": "2023-03-26",
    "content": "speaking of drum programming",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1092581849873797160",
    "author": "LAPhill",
    "date": "2023-04-03",
    "content": "Who are the resident 808-making experts here? I have a couple of questions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092590592929824859",
    "author": "LAPhill",
    "date": "2023-04-03",
    "content": "@NoahNeedleman Basically, wondering where people source their 808s from, or what they use to design them. I've made my own in the past, but I don't live in a world that they're a regular thing and wasn't sure what the legit producers in the space use. I'm just a composer trying to be cooler than I am.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092593625529069719",
    "author": "austenballard",
    "date": "2023-04-03",
    "content": "between FAW SubLab and the 808 presets in ANA 2 I haven't actually made one from scratch or used a straight-up 808 sample in like 3 years",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092594004434112654",
    "author": "austenballard",
    "date": "2023-04-03",
    "content": "But there are also people who aggregate 808 samples and sell them for slightly ridiculous prices, easy enough to find if you go just a little bit down the producergram wormhole",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092594871241560164",
    "author": "Slow Hand",
    "date": "2023-04-03",
    "content": "I'm very interested in this question too. I've tried synthesizing my own 808s and it's surprisingly difficult to recreate something as satisfying as the best samples in my collection.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092595617714421871",
    "author": "LAPhill",
    "date": "2023-04-03",
    "content": "Sublab seems promising. I've heard positive things about 808 Studio 2, but this might be a better fit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596094921351281",
    "author": "Slow Hand",
    "date": "2023-04-03",
    "content": "We need to have an LA meetup to put our heads together and craft the best 808 patch we can muster. I would kill for a great 808 patch that doesn't have formant/length problems when I transpose it too far out of it's starting range.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596515429683210",
    "author": "cy (sigh)",
    "date": "2023-04-03",
    "content": "I have some modified spinz 808s, a handful I made from scratch when I got to play at my friend's studio and a handful of random I've accumulated over time. aside from that I'll use a basic sinewave oscillator and choose the saturation depending my goal, layer any samples I need to texture/clicks. \n\nalso go through finished songs every few months and just keep the ones I really like.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092597434925989948",
    "author": "gatewoodsensei",
    "date": "2023-04-03",
    "content": "I mostly if not always create my 808s and basses from scratch unless i have an idea that I’m tryna get out super fast. I do it that way because 9/10 i hear some bullshit in my head and I’m like “hmmm. Idk if that exists” and i fuck around until i get it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092599692258447400",
    "author": "Slow Hand",
    "date": "2023-04-03",
    "content": "This server oughta crowdsource a bounty for the \"best\" 808 synth patch. People submit, we all vote and the winner takes the pot with donations from everyone on the server.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092604827130920981",
    "author": "Slow Hand",
    "date": "2023-04-03",
    "content": "Haha. That one made me pause too. I thought for a moment \"Well, I've never LPF'd my 808s before\" and then I immediately remembered why.\n\nIf only it were that easy. The devil is all in the details on something like this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092609584973230120",
    "author": "youngteam",
    "date": "2023-04-03",
    "content": "Agreed. I also phase align 808s with kicks differently each pitch. “There is no one 808 to rule them all” is my philosophy too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092626659586359316",
    "author": "Josh",
    "date": "2023-04-03",
    "content": "It depends on the genre. Like for super over the top genres it’s great. But it just doesn’t have the attack that 808s normally have in hip hop, and it’s rather bothersome trying to dial in the release and sustain properly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092626807485898852",
    "author": "Josh",
    "date": "2023-04-03",
    "content": "The best 808 patch I’ve ever used is by the archetype 808 from cymatics for serum.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092641447183917086",
    "author": "Slow Hand",
    "date": "2023-04-03",
    "content": "My go-to synthesized 808 is the 'Punch In the Balls' preset on NI *Razor.* It's great for modern aggro 808s, but less good for boomy, fluffy classic 808s. It's super tight with it's articulation, though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092792874606805002",
    "author": "Josh",
    "date": "2023-04-04",
    "content": "I also have the 808 that everyone is using after Way Bigger came out if anyone wants it. 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092904754256019556",
    "author": "Ross Fortune",
    "date": "2023-04-04",
    "content": "I saw the start of this conversation and took a gander in my 808s folder. There’s fucking thousands, and I still only ever really use 808 warfare. \n\nTbf I don’t use a lot of 808s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092909128294346883",
    "author": "ehutton21",
    "date": "2023-04-04",
    "content": "I feel like I used to care tons about 808 samples, but I don’t use 808 samples the way I used to. I’ve got a handful of 808s I really like and if I hear a record where I think “wow I don’t think I can get there within my framework but that would open up new ideas” I’ll dig for it, but being able to manipulate a set range of samples has given me much better workflow",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092957974164672632",
    "author": "Josh",
    "date": "2023-04-04",
    "content": "I actually went through my entire library recently and moved all the ones i use consistently and it was only like… 1400 files? For drums, 808s and some effects. And that was me moving entire folders. Shits wild.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093677826391150702",
    "author": "louisvie",
    "date": "2023-04-06",
    "content": "guys, what's a dampened snare ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093682490536906894",
    "author": "austenballard",
    "date": "2023-04-06",
    "content": "Like if you put one of those dampening rings, or sticky gel things, or tape some paper towel to the snare to make the head resonate less",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093682999888990270",
    "author": "austenballard",
    "date": "2023-04-06",
    "content": "Actually hey, fun question for everyone\nMost ridiculous thing you've seen used to dampen a drum? Mine has to be giving the bass player's girlfriend some earplugs and cramming her into the kick drum",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093693276596486215",
    "author": "ehutton21",
    "date": "2023-04-06",
    "content": "I just can’t imagine that story not being something that gets told as “yeah, I mean it sucks that we broke up but he did have me crawl inside a kick drum for his band one time so what am I really missing”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095836459468066837",
    "author": "ehutton21",
    "date": "2023-04-12",
    "content": "I can’t speak to this on a scale that maybe some others can, but I know when I started offering to pitch something for a track or to help bring out a drum pattern a bit more/offer notes for the way the low end is translating were the moments that people who were initially just outside my orbit would actually come back into the orbit with frequency.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1096773814681079878",
    "author": "Zakhiggins",
    "date": "2023-04-15",
    "content": "Yeah he's also done some of my favourites. There's definitely a pattern there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099790757126217859",
    "author": "Deleted User",
    "date": "2023-04-23",
    "content": "I dig that beat box that shows up at around 3:05",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103322638350286868",
    "author": "Zakhiggins",
    "date": "2023-05-03",
    "content": "Do you mean music without a click or music not made with patterns FL studio or ableton style?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103332991259901963",
    "author": "Eric Martin",
    "date": "2023-05-03",
    "content": "I mean, drum machines rule, but without people playing around the static, it’s less emotional to me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103381261810143343",
    "author": "LAPhill",
    "date": "2023-05-03",
    "content": "Everything has a place, and knowing what music can feel like, what performances can be, will elevate everything from a track with an 808 and a vocal to a symphony.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103385337255956611",
    "author": "LAPhill",
    "date": "2023-05-03",
    "content": "For many, it's about efficiency. It's quicker to grab a Splice loop, load up some samples, to edit the guitar instead of retracking. Which comes back to showing people a better way - working with artists and showing how much better it feels when a real drummer plays that same hi hat pattern. The nuance of working with a brilliant session guitarist. Everyone should have the experience of that, spend the money to splurge once, and see if they hear it, or if it resonates with them. And it doesn't necessarily take that much longer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105156134240800828",
    "author": "Josh",
    "date": "2023-05-08",
    "content": "A little distortion and transient designing and it sounds like a real hi hat",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105158487136293014",
    "author": "Edward Rivera",
    "date": "2023-05-08",
    "content": "There are a few free drum kits out there that will give you realistic hi hat too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108515553561292891",
    "author": "peterlabberton",
    "date": "2023-05-17",
    "content": "Yeah, had a real pro tools “varispeed” kick a year or two ago, super fucking cool trick in the right context",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108602095101284434",
    "author": "NoahNeedleman",
    "date": "2023-05-17",
    "content": "Had to rock a quick turnaround for a sync pitch today. Used Studio Drummer in Kontakt- chose some stock drum grooves, dragged the midi onto the channel and adjusted velocities of the kik & snare. I couldn’t figure out how to mult it out without googling so I just mixed it in the plug-in. It’s legit not cool sounding at all, but honestly it was useful and it got me to a pitchable place. \nAnybody else using workflows in and around kontakt that allow you to mult & trigger more interesting samples?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108604819737956352",
    "author": "NoahNeedleman",
    "date": "2023-05-17",
    "content": "I guess if I’m only replacing kick & snare it wouldn’t be too tedious to copy those to a fresh track",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114442257794351106",
    "author": "louisvie",
    "date": "2023-06-02",
    "content": "is the 808 era coming to an end anytime soon ? i feel like i'm starting to get tired of trap sounds, even the weird ones, even when used by experimental / alt artists and producers in good songs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114452364905160764",
    "author": "Slow Hand",
    "date": "2023-06-03",
    "content": "Man I hope so. As much as I enjoy 808s, they're a bit overplayed. \n\nI think the way out is to create an alternative. Show people something different and they'll follow.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114514120708993124",
    "author": "Edward Rivera",
    "date": "2023-06-03",
    "content": "The 808s and hi hats are here to stay. But the general vibe of trap today (triplet vocals) has rung itself out and I think someone will take those textures to make new styles and then that's what we'll be vibing on for a while. Even rubber band man (deep cut !) doesn't bear resemblance to the mumble rap that came after it, and mumbling came out of fashion before the pandemic. Hip hops not dying, it'll be around forever I hope, but it's gonna change",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114514888505688114",
    "author": "cy (sigh)",
    "date": "2023-06-03",
    "content": "agreed there. took the origibal comment as the 808 sound as a whole. but as far as the style changing, that's exactly what's going to keep happening. \n\nalso I've been tied of the triplet thing a year after  its statted. i was actually upset it was that people were associating w trap 😂 trap is originally defined by the content not the sound lol (trap house music)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114515575473967124",
    "author": "cy (sigh)",
    "date": "2023-06-03",
    "content": "True. as humans we want things to seem as simple as possible.  \n\nunderstand it  now back then but I was going crazy the first time edm folks were saying they were making trap 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117237312561102918",
    "author": "Deleted User",
    "date": "2023-06-10",
    "content": "808 and 808 drums are like maple drum kit at some point. I don’t think they’ll ever go out of fashion. The characters of the samples are going to change and shift the sonic trend but they’re not going anywhere. \n\n\nI do think the hihat patterns are gonna go out of fashion and rotate trends in different patterns. Right now it’s all about the drill pattern but I think that will probably go out of fashion soon.\n\nWhen I say go out of fashion though, I only mean it won’t be the thing everyone’s chasing anymore",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1118964617482346556",
    "author": "louisvie",
    "date": "2023-06-15",
    "content": "hi everyone, i need your ears. i'm stealing a kick from a record i like and am now doing fade ins/out to get the audio clip right.\n\ni feel like i'm at a point where if if shorten the clip more, i'm losing bass (full xx hz cycles can't properly develop or something like that, right ?)\n\ni can't tell if i'm hallucinating or not.\n\nso one of these is the 'full' length, one is slightly shorter. \n\ndo y'all hear any difference with proper sub monitoring and fresh ears ?",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1119455298546040882",
    "author": "LAPhill",
    "date": "2023-06-16",
    "content": "Lines that play to the natural strengths of an instrument. Saxes and big band brass are so full of bends, glissandi, growls, flutters, different attacks.. basically, there are too many things that make a horn line groove and make people give the stank face for any library to really fully pull off.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121726629945802832",
    "author": "Ross Fortune",
    "date": "2023-06-23",
    "content": "Just thinking how effective even Fruit Shaker is, is there a library that does live hi hats in a similar way?\n\nI know this has been covered here before, and there are methods, but a library like that could solve a problem I still haven’t worked around",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121753504168562798",
    "author": "Iwan Morgan",
    "date": "2023-06-23",
    "content": "I like the tambo and hat in Avid Groovecell’s Krautrock patch. Add a bit of spring and layer with other drums and they sound legit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123444044903764090",
    "author": "Deleted User",
    "date": "2023-06-27",
    "content": "What are your favorite ways of creating density in an arrangement with minimum instruments without parts being busy? Particularly harmonic elements. \n\nI’ve noticed certain songs have really dense feel in the harmonic instruments without too much movements but still have really crowding density. Unfortunately can’t think of any other examples at the moment… but some trap songs and dance music (brazilian moombaton, dancehall, reggaeton, soca) often have elements that crowd the upper mid range or midrange while letting the low end breathe.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126309007833956442",
    "author": "OJ",
    "date": "2023-07-05",
    "content": "Does anyone have advice on creating sample packs? Like do I go record a real snare and then put distortion on etc to get like a Lex Luger Snare for example, how is something that clean made, not like a real sounding snare but these trap snares for examples, or just unique sounds??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126346807144894505",
    "author": "Zack Hames",
    "date": "2023-07-05",
    "content": "Any and everything is on the table! Blending layers of real snare recordings, synth hits, aggressive EQ and other mixing techniques. There are no rules.\n\nEven If you take a plain snare recording and have it at a single velocity and program it, it suddenly sounds like a sample!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135001503120248852",
    "author": "Slow Hand",
    "date": "2023-07-29",
    "content": "I love James Brown deeply. His innovation to strip the harmony way down is a baller move that I think we mostly take for granted today. Probably because 70% of bass product demos are whack single-chord funk grooves. 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135002360981237780",
    "author": "Slow Hand",
    "date": "2023-07-29",
    "content": "Perfect blend of groove and melody. Always working in counterpoint to the vocal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136382571282976818",
    "author": "lystell",
    "date": "2023-08-02",
    "content": "Let's say you're doing a house beat and it's kind of a bass drone thing. Like staying on the same note and building a groove. Are there traditionally better keys to do that in that plays well?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136383559670710402",
    "author": "Deleted User",
    "date": "2023-08-02",
    "content": "with subs-there isn’t a specific key that works well, but you typically don’t want the bass notes to go down too low. Kick wants to be lower than bass in 4 on the floor house most of the times and if the bass is too low then the kick can’t be lower",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136386308470734849",
    "author": "lystell",
    "date": "2023-08-02",
    "content": "Had to google reese bass :). \nThat's interesting. Is it the depth and length of the kick that determines the low end then?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137098758644039680",
    "author": "OJ",
    "date": "2023-08-04",
    "content": "Feels like a \"sales\" world in a way where you're selling a product, dropshipping a beat almost lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140004142811721840",
    "author": "Rob Domos",
    "date": "2023-08-12",
    "content": "All postulating and math talk aside, for me it just comes down to the fact that I prefer the sound of not randomizing the bottom bit in a 24 bit file. At 16 bits that noise is preferable to the audible quantization error but at 24 it’s not for me. After 3 EDM dudes with solid careers (including luca pretolesi) said this exact same thing to me about dithering, I tried it and agreed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1149665878032523394",
    "author": "austenballard",
    "date": "2023-09-08",
    "content": "Nobody asked, but here's a zip of basic MIDI swing presets I made this morning for my own use. 8th and 16th notes at 1/8th and 1/6th intervals from 13% up to 88%.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1150090834683895838",
    "author": "Josh",
    "date": "2023-09-09",
    "content": "We got this super unique artist trying to work with us and I’ve been brain storming and everything is like “kick behind, snare ahead?? Or kick ahead snare behind??”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150092666541985863",
    "author": "chrissorem",
    "date": "2023-09-09",
    "content": "Nice! Lay it out on the mpc and get all J Dilla with it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150194740189483049",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-09-09",
    "content": "There‘s a difference btw a 2:30 min club banger and a 10 min half folk / half trap beat with lana vocals over it though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150632688261279764",
    "author": "Nomograph Mastering",
    "date": "2023-09-10",
    "content": "Aside from a genuine compliment like \"I love the way the hook grooves\" I'm rarely saying anything",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154236669814390875",
    "author": "markmaclure",
    "date": "2023-09-20",
    "content": "Melodyne wizards, how often are you guys using the Pitch Modulation tool to clean up wobbly notes versus separating the wobbly bits into different blobs and manually adjusting? I tend to do it manually but I can't always beat the (much faster) PM tool. Am I wasting time dialling it in manually?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154441174703157299",
    "author": "isaac joel",
    "date": "2023-09-21",
    "content": "How long till this is the next *it* sample for beat makers? \nhttps://youtu.be/L5KKRFQ_mxg?si=e5rXzRyKw3IvHs8L&t=38",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155896747063771197",
    "author": "Josh",
    "date": "2023-09-25",
    "content": "Honestly I don’t even need anything besides a snare that sounds like this. If anyone has TCIs or NKIs that’d be insane.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1165764562113540106",
    "author": "youngteam",
    "date": "2023-10-22",
    "content": "yeah I fully agree. puts a lot of memes about hi hat adders and snare selection to bed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1166115822805205052",
    "author": "chris_donlin",
    "date": "2023-10-23",
    "content": "Anyone have trouble with Arturia stuff not arpeggiating well? Im trying to use the Mini V it's sounding like it's falling in and out of a swung rhythm just every so slightly. The track is kick snare drum machine so everything needs to be tight. this arp bass is throwing everything off. I tried programming the midi and triggering my Poly D but im digging the sound of the Mini V more for the first time. Anyone try UAD's version?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169256852417163294",
    "author": "youngteam",
    "date": "2023-11-01",
    "content": "My thought process is “I want to make a beat like _” I’ll usually start by finding a sample I like and putting it to a bpm / key I’m feeling then go from there. I have folders of drum sounds I’ve curated from various packs that I’ll quickly go through then.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171154950714294382",
    "author": "chris_donlin",
    "date": "2023-11-06",
    "content": "Anyone have tips on using vocoders? Getting them to pop out, wrap around a vocal nicely, not sound too brittle, etc. My first thoughts are taking unnecessary high end out of synths and hi hats but im not sure where to start",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172292232208994455",
    "author": "Josh",
    "date": "2023-11-09",
    "content": "But also if it’s anything like the M1 Max then the fans won’t kick on. But since it’s so much faster I was wondering about thermals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181714060002209792",
    "author": "kidcutler",
    "date": "2023-12-05",
    "content": "I use an MPC 2000 and a little pocket operator, both fun, but “feeding” them is a chore. Had the 2000 linked to logic but that midi configuration was a pain. The little pocket operator KO is quick and has the mic, if you want to dabble and quickly unlock an idea it crushes, mine was like $40",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181770602231636019",
    "author": "Zack Hames",
    "date": "2023-12-05",
    "content": "My MPC Live is my right hand man in the studio as a writing tool. But when im NOT making records and mixing and recording, I make industrial music entirely on hardware. So the MPC is the daw in this case. No computer. \n\nIf I’m using the MPC on a production where it isn’t the brain, it gets a little cumbersome, sometimes I make stuff on it and simply record it analog into pro tools. Other times I actually export the “stems” on the MPC as it’s very easy then take the sd card and drop the files into the session. This is a little time consuming but works and sounds great. \n\nThere is MPC software/plugin that works with it! I just haven’t integrated it with my daw yet, but it seems legit. \n\nI don’t program drums on a piano roll ever, I always hit the pads.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181770654312304691",
    "author": "Zack Hames",
    "date": "2023-12-05",
    "content": "So MPC has been so much better for drum programming for me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181770988829020260",
    "author": "Zack Hames",
    "date": "2023-12-05",
    "content": "God I adore my MPC. It is truly an instrument.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181774580411539478",
    "author": "Josh",
    "date": "2023-12-05",
    "content": "Yeah MPCs are very sick.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181786284121919488",
    "author": "BatMeckley",
    "date": "2023-12-05",
    "content": "Does the Maschine have any utility in this conversation?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181854366966235206",
    "author": "Deleted User",
    "date": "2023-12-05",
    "content": "I think the tactile workflow aspect is really nice on Maschine. From what I’ve heard from those that’s both been on AKAI and Maschine, they have better velocity response than AKAI. Which is why a lot of Akai users mod the drum pads to make them more velocity sensitive. I’m thinking about doing one myself for my Akai controller",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181856185591287808",
    "author": "ehutton21",
    "date": "2023-12-05",
    "content": "I’ve heard cool things about maschine and their surfaces as it relates to their software but it might not be the solution we’re looking for here, I’ve admittedly never used it, just heard that I should be lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181856559119212635",
    "author": "Deleted User",
    "date": "2023-12-05",
    "content": "Are you looking for sampler or drum machine?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181857179494526976",
    "author": "Deleted User",
    "date": "2023-12-05",
    "content": "But it’s more sequence based as opposed to MPC or SP series that are more live performative",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181858294097252392",
    "author": "Deleted User",
    "date": "2023-12-05",
    "content": "I’m trying to get my DAW to have the same workflow as MPC of ASR. The thing that I have the most trouble with is changing sample start point with a controller so I can chop samples with a dial instead of using the mouse",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181874216233082880",
    "author": "Slow Hand",
    "date": "2023-12-06",
    "content": "@Josh I owned an NI Maschine+ (the standalone hardware unit) for a year before I eventually sold it. My reasons were much like yours; to get away from software and have a standalone instrument to play with.\n\nI don't have many bad things to say about it, but ultimately it just wasn't a good fit for the way my brain works. NI have crammed a tremendous amount of features and functions into that thing. Most of which it does very well, but when it came time to do sequencing in the unit the interface was just too much of a hurdle for me. I found it hard to keep all of the key commands in my head to do simple commands. I think it's a little *too* efficient in how many options they've fit into it. Remembering the commands among it's unorthodox button layout was challenging and unintuitive for me.\n\nAs you might imagine, it integrates perfectly with the Maschine software, which is basically a DAW within a plugin that controls the hardware and vice-versa if you choose to use a computer. But I wasn't interested in that, because I can achieve the same things and more with plain old Ableton.\n\nIt *does* have a fantastic sample library and the NI sample packs you can purchase are very well done.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181874879927164999",
    "author": "Slow Hand",
    "date": "2023-12-06",
    "content": "This Loop Op review might be helpful if you're trying to decide between a *Maschine* or a contemporary MPC. He does the best electronic instrument reviews on the internet. All killer, no filler. Quick and to the point: https://www.youtube.com/watch?v=gPxQpcJxbJg",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183500705135333376",
    "author": "Rob Domos",
    "date": "2023-12-10",
    "content": "As a dude who's musical education was mostly in accapella music and who's production has mostly been midi that was easily quantizable, my sense of rhythm is nowhere near tight enough for the tier of work that I've been entering into lately. This means if I play something, I'm going to need to be quantizing audio and I'm relying on the visual aid of the waveform because my inherent sense of groove is pretty weak. So I'm looking for advice on quick heuristics for quantizing audio. \n\nTodays example: I played some palm muted acoustic guitars, I've marked the scrape of the pick in red and the peak of the waveform where the note truly starts ringing in green. The waveform actually starts a little before the scrape as you can see where the pick touches the string wave over on the left . How are y'all thinking about which part of this waveform should fall on which side of the beat?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1183508322687668405",
    "author": "Rollmottle",
    "date": "2023-12-10",
    "content": "In Ableton, I like fucking with the groove via the groove pool by mixing varying degrees of quantization and feel. Sometimes that can pocket something just right or pocket it in an interesting way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183554168171003984",
    "author": "Deleted User",
    "date": "2023-12-10",
    "content": "it’s generally the orange if it’s something like palm muted guitars. But always listen and feel it. It can feel better to be early in certain styles but it can feel better to be late on other styles. it also depends on who else is doing what\n\nBut groove template is always there if you wanna line it up with other instruments. bounce and make the source and destination audio files the same length, make sure the markers are in the correct place then sync them up. \n\nI’m 90% manual editing though. Because aligning automatically can fix notes I didn’t want to fix. you can also go measure by measure to be more careful if you want to auto align with groove templates \n\nyou want to ask yourself “is this note late or early?” before making any moves. I like nudging with keyboard so I can fine tune how far it goes. \n\nNowadays I’m more committed to “the only way to make the groove feel good is to play it that way”. I hate having to edit and to be honest, nothing beats well played rhythm section… Especially because I do a lot of in between the groove stuff, 30% quantization can mess with the feel of well landed notes. So I’m doing a lot of metronome practice these days",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1183771624076476436",
    "author": "Josh",
    "date": "2023-12-11",
    "content": "The old sturgis way is to make sure the pick attack is before, depending on genre though I’ll often have the pick attack on the beat. Remember when we were doing drums and we just sort of listened to how we it should placed when the drummer flammed the kick and snare? This is the same thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185101853894123650",
    "author": "Nomograph Mastering",
    "date": "2023-12-14",
    "content": "I think your take is factually accurate, I was ready for the doors to swing open and you were still enjoying the party",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186396444475797574",
    "author": "cian riordan",
    "date": "2023-12-18",
    "content": "If you're building the song around the HH sound, then you might get snazzier with room mics and effects. But hi hats have a small window in which they don't sound terrible, best to just aim for that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186591708327194634",
    "author": "Nomograph Mastering",
    "date": "2023-12-19",
    "content": "Hi hats are our wabi sabi",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186675626510401546",
    "author": "esquinalee",
    "date": "2023-12-19",
    "content": "Might not be appropriate for the specific sound you’re looking for but as someone who used to mostly disdain miking hi hats I’ve been very happy with the results from the R92.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189083720469196811",
    "author": "Rob Domos",
    "date": "2023-12-25",
    "content": "To be embarrassingly transparent, a lot of times I think a note is late by listening and then after looking find out it was early. Things just feel in time or out. Also, a lot of things that have loose rhythm in a way that people tend to love often bother me and sound out of time to me. Jay-Z is a perfect example of this. I spent years thinking his rhythm was terrible before I realized he was doing a shuffle time feel where the amount his vocal is off from the snare creates the shuffle. I just didn’t pick up on that for like… 15 years? And just wondered why nobody else was bothered him being “out of time”. Kind of like when people with an undeveloped sense of harmony think of jazz as simply being an excuse for allowing wrong notes. That’s how I hear people that are famous for stretching rhythm",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189088707836383262",
    "author": "Deleted User",
    "date": "2023-12-25",
    "content": "makes me wonder if you were hearing other instrument that was on the grid - which was later the other instrument that is early, which led to a confusion of perceiving that the other instrument is late. \n\nalso regarding the off-the-grid feel, listening isn’t to james brown or j-dilla isn’t going to do that for you. only playing along to it will get you used to the feel of pushing and pulling thing back and forward. \n\nbut the fundamental is always on the grid stuff. I was in a huge J-Dilla phase for a while and I would try basically play things off for the feels. But it would sound like a mistake as opposed to intentional feel. and that was because I haven’t really mastered being right on the grid yet. I’m still working on being right on the grid by playing with metronome, and I found that actually improved my feel for all kinds of styles of groove. I still need to work on it, but it’s definitely better than before and I need less takes now. \n\nI know your question was about editing but I think there’s no better way to improve the sense of time and feel than to grab instruments and learn being what on time/late or early feels like.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189669619531780257",
    "author": "cy (sigh)",
    "date": "2023-12-27",
    "content": "I remember a Haitian bassist I was on tour with said most Haitian musicians naturally play in 1/1 - just at different speeds-  if they've been playing haitian music a lot and I didnt understand at first but it slowly started to click. \nand I feel you on the initial confusion.  I recently worked ona track where we just couldn't get my drums to hit how we wanted. I ended up shifting everything 1/16th backwards and everyone in the room (including myself)  was floored at how eveything just tightened up and grooved together 😂.  felt amazing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189696363328442409",
    "author": "cy (sigh)",
    "date": "2023-12-27",
    "content": "yup. a lot of blends of regional  African grooves and some indigenous stuff from tainos/arawaks (though those are more present in vodou rhythms) \nI'm always coming back to those things  whether it's to study or take inspiration",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194714010227060736",
    "author": "georget113",
    "date": "2024-01-10",
    "content": "Yea I am just curious as to how they did these beat camps for engieears",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1196673563541909616",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "But I do want to clarify about my one take musician thing… \n\nI may have used the term too loosely. To me, most jazz musicians are one take players. They record everything together and calls it. (of course they do a few takes but I’m not trying to be a “first take and that’s it” player)\n\nBeing able to play through the whole song (unless arrangement calls for section by section) and just needing to punch in a few spots is what I want. I do not have any desires to go beyond that. \n\nBUT\n\nI don’t ever want to edit my timing other than micro adjustments that can be done by moving small part of audio clip or hitting quantize. \n\nThat + being more consistent with touch so I don’t have to punch in as much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196696952901996554",
    "author": "Deleted User",
    "date": "2024-01-15",
    "content": "re: 1 \n\nI have gotten over the whole “perfectionism” thing. I still overthink all the time but I can confidently day I am free of perfectionism. I have no problem letting go when it calls for it. I believe there’s a difference between wanting to be better and working towards it vs not being able to move on out of fear and holding onto something without knowing the next move. If that was the case I wouldn’t have sent what I first recorded to the artist. I may have wasted some time thinking I would be able to get this part down, but I don’t think I was being a perfectionist by doing that. \n\nre: 2\n\nWhy would he do this if he’s a great guitarist? Is it a workflow preference or the aesthetic of edit/sampling? I can only imagine it being faster playing the parts in rather than stitching bits together. \n\n\n\nThe whole goal is to be able to consistently reproduce that magical groove, and being able to create great moments when I am with other people. I really believe I have a good sense of groove but can’t execute it just yet. \n\nI can see myself spending countless hours editing myself. (Which I already do daily). That time is better spent working on my chops. If I can hire other musicians so I can stop wasting time trying multiple takes, I would. But I don’t have that just yet. I go by sections or measures most of the time, I don’t just sit there trying to nail ONE perfect take.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197059203584512010",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "3. Groove / feel \n\nFocus the groove  on a shuffle around beat 3 in every bar .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197059445922988052",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "Once you’ve got that shuffle around the 3 with hi hats and extra snare samples you’re moving .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197060142504624198",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "More hat and snare samples can then be used as quieter layers to start layering shuffles in other parts between the beats . The first 16th after the downbeat and a 16th before the the offbeat in beat 2 and 4 all work , but it’s then much more about velocity really . The idea is your hats and snares all start shuffling into each other , through the bar , again with the accent around the 3 . Resolving in beat 4 and back around for the next downbeat",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197060397732208651",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "Because it’s an open and minimal drum production listen to Calvin harris and the disciples how deep is your love \n\nIn this house style you want to really experiment with note velocities and swing settings (how far you push the swing ) to get it spinning. U.K. producers wrote early house and garage with the grid on 1/24 (triplets ) for the snares and hats . So we are talking take your swing potentially all the way to triplet time  . \n\nKick is to have subtle little syncopations and doubles to push the groove (before transitions/ on turnarounds  for example )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197060624702775306",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "Listen to the accent around beat 3 in every bar",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197070991919165461",
    "author": "spectrummasters",
    "date": "2024-01-16",
    "content": "This record is by grant Nelson who is one of the originals who took US New York garage and removed the kick on beats 2 and 4 to create the first U.K. 2 step garage tracks . On this record he returned to mainstream house and you should hear immediately the dem bow pulse on the baseline hook",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1201643018340532234",
    "author": "NoahNeedleman",
    "date": "2024-01-29",
    "content": "Hey all, anybody have a cranberries “linger” style snare loop they can point me toward? Happy to pay for it, just gotta figure out where to look",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203194936522969099",
    "author": "shaunobi",
    "date": "2024-02-02",
    "content": "I’ll layer in trigger samples sometimes under a kick but even that… I’ve mostly stopped",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203198736507863070",
    "author": "shaunobi",
    "date": "2024-02-02",
    "content": "I'm a little with you on not using stock plugins. Then again, I'm using Reaper and Pro Tools... Reaper especially has, um, pretty bare bones stock plugs. (For some stuff they're great - the quick drag and drop for sidechaining bass to kick if you're into that is just so quick). I mostly use paid plugins tho...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203376784758939730",
    "author": "Edward Rivera",
    "date": "2024-02-03",
    "content": "E22 top and bottom back when I could swing it. 421 is actually ok since you're not contending with hardware and cymbals for optimal placement. But I  try to be matched pair",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203597659324158002",
    "author": "Deleted User",
    "date": "2024-02-03",
    "content": "Art is subjective, so there’s actually no “better” — This is something I need to remind myself of more. The amount of times that I showed something that I thought was good and was rejected, and the times I showed something I hated and got good reactions from  people. You really never know! \n\nI’ve been doing more writing sessions these days (once or twice a week or so), and I’m really falling in love with this because I can get out of my own head and look around to get a sense of whether an idea is working or not outside of my own opinions\n\nSpeaking of the relentless will to finish: would it be a producer’s job to stay on top of getting others in team to get their parts done? If I’ve done my part already and completed it, do I keep bothering them to get their parts done? (lyrics etc) \n\nI read your reply to someone asking about writing sessions, and you said your biggest goal is to get the vocals from the first spark of inspiration on that same day. I’ve had sessions where I get a basic bone of ideas with beat done, and top line is done but the lyrics are recorded in Gibberish and stream of consciousness. I would return, complete the arrangement on my own - send it back, they said they fuck with it and tells me they will finish the lyrics. How long do I wait, do I follow up at all, or do I just move on and keep making more? I don’t want to overstep or rush people (and.. I can’t get anyone to anything of course), but I also want to get the song done while I’m excited so I can keep moving forward. It’s hard to tell if I can even do about it or if I should just keep it moving and leave it be",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204490185308372992",
    "author": "Zack Hames",
    "date": "2024-02-06",
    "content": "My room is so gnarly, I apologize;\nKick: WA-47jr, ATM 25\nSnare: SM57\nK/S: Groove Tubes GT40\nOHs and Tom’s: Austrian audio OC18’s\nCenter OH: Coles\nHihat: AKG 451\nRooms: m160’s on floor\nGreen bullet mic for dirt\nHad a random RCA 74B in the room I recorded as well.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1208900206536687626",
    "author": "OJ",
    "date": "2024-02-18",
    "content": "I always felt the dt990pro kick frequencies were always too heavy, like my kicks would be louder on speakers vs the headphones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214719753848098858",
    "author": "Deleted User",
    "date": "2024-03-05",
    "content": "they are decent, but I honestly just use drum libraries for cymbals now and use samples from kick snare and toms",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214719967379984384",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-05",
    "content": "yeah I'm with you. I think SD3 is hard to beat for cymbals, they really went ham sampling those and the programming around the smoothing and stuff is solid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214719986602479677",
    "author": "Deleted User",
    "date": "2024-03-05",
    "content": "I don’t find round robin necessary with those. And round robin only brings marginal improvement in human feel when it comes to kick and snare especially with how compressed they get at times",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221601664256053288",
    "author": "louisvie",
    "date": "2024-03-24",
    "content": "Anyone has a tip for quantizing 2 kick drum mic tracks (basically hi-end track & low-end tracks) in Ableton Live ?\nSo far I lined up each hit in Beats mode with the default settings.\nDo y'all have a go-to, something that usually sounds better in this context ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221626398955929600",
    "author": "Adam Thein",
    "date": "2024-03-24",
    "content": "The only way I trust time editing multitrack sources like drums in Ableton is linking the channels (right click menu option when you have multiple tracks selected) and like Josh said slicing manually in front of each transient and sliding the audio to where you’d like it to be.\n\nOther daws are much better suited to automating this workflow like Beat Detective in Pro Tools or a similar style workflow in Logic I forget the name of.  Studio one has a similar workflow that I also forget the name of.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221652397525565541",
    "author": "Adam Thein",
    "date": "2024-03-24",
    "content": "Beat Detective is pretty easy to pick up with a tutorial even if you don't use much else in Pro Tools.  I will say I think Logic's drum editing features are a little closer in style to the way warp markers work in Ableton, but you can also use it similarly to beat detective which makes it another good option, especially on a budget.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1234948579416866896",
    "author": "Brian Reynolds",
    "date": "2024-04-30",
    "content": "@joshbonanno I don't have a single idea what a single dot/button does yet. But just gave this melody width and groove in this subtle beautiful way. Good hearts once again earning the good in their name",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239066325750382714",
    "author": "Zack Hames",
    "date": "2024-05-11",
    "content": "Anyone have some reliable 808 bass drop samples they'd be willing to share? Scouring all of my samples and just none of them feel right.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239073399133966428",
    "author": "Zack Hames",
    "date": "2024-05-11",
    "content": "Honestly for this particular thing I just need a big long 808 that feels huge, doesn’t need to be that dramatic bend - not “BYEEEOOoooo” \n\nJust a fat clean BOOM with a long tail",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239078318293127260",
    "author": "Slow Hand",
    "date": "2024-05-11",
    "content": "It's funny. I've tried synthesizing my own 808s so many times over the years, and there's something about a good 808 sample that I've been unable to replicate. It's vexing, because they're really not that complicated. I feel like I could chase that goal for the rest of my life and never achieve it. Why are synthesized 808s so elusive?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239169195896475710",
    "author": "sinaigimenez",
    "date": "2024-05-12",
    "content": "Same here! I've been running in circles with this for days before I gave up. What's your fave source for great 808 samples? Any sample library in particular? Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239229525326434364",
    "author": "montrose recording",
    "date": "2024-05-12",
    "content": "also would love to know best way to play tuned 808 kicks in protools",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239488562173317121",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-13",
    "content": "https://initialaudio.com/product/808-studio/ I saw finneas using this - his 808s sound sick so it can't be that bad. Quite affodable too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240363238454071499",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "Re : 808s it always helps jf you know “the street names “ lol for the 808s you like before searching libraries",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240363947778117703",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "I’m currently having fun with the RD8 analogue drum machine sampling it into  my MPC2000 and syncing an Akai 3000 to it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240378343417843812",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "so many of recent years in the packs......some packs are clearly sampling enthusiasts...some of the neptunes/boom bap ones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240378706011361310",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "...i used to sample a lot of my fav hiphop songs and producers on my mpc , wherever i could grab a single iso hit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240379902197497866",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "The games first album is great for kicks and snares , Jdupri produced Mariah Carey tracks have lovely drums to sample  And if anyone’s after a good snare and rim shot collection …..d angelo voodoo . The end",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240384479655235675",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "I feel ya . I’ve got all the Roland , linn and CR , the Akai mpc disks and the s1000 , 3000 sampler disks . Happy to organise sharing them for anyone who gets interested in future",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241767813677584516",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Very true. checking the credits and not seeing the person who made the majority of the beat just feels gross to me. Especially because we can draw parallels to most hip hop songs but all of those kids who make loops all day every day are on the credits.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241767960822153317",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Well. The hip hop songs that aren’t cymatics loop into gross beat lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241768082222088214",
    "author": "Maxim",
    "date": "2024-05-19",
    "content": "\"Person who made the majority of the beat\", do you mean the beat maker or the sample pack creator?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242976058773606400",
    "author": "chris_donlin",
    "date": "2024-05-22",
    "content": "Even better than tab to transient for this is beat detective, clip seperation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244848982786703441",
    "author": "Slow Hand",
    "date": "2024-05-27",
    "content": "There's more. Here's another deep 808 where I needed it speak better in the track. So I doubled it with a sawtooth patch on a synth (dry) and then added verb to the synth double to make it sink into the back of the mix, but still have that hair.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247081996958830592",
    "author": "JakeTB",
    "date": "2024-06-02",
    "content": "Life is dope and plays really well with Ableton’s groove feature",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247242598758875217",
    "author": "JakeTB",
    "date": "2024-06-03",
    "content": "Usually it’s taking a beat from somewhere like a Simon Harris compilation and right clicking to “extract groove”\n\nThen you can apply that groove to whatever you’ve cooked up in Life to give it a more organic, “played” feel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247542922749153431",
    "author": "Bryan DiMaio",
    "date": "2024-06-04",
    "content": "When I record stuff without a click I like to go back in and roughly identify beat (for at least the 1) so things like delays will be more or less synced, but yeah sometimes stuff just doesn't need a click or goes through too many meter and tempo changes to constrain it to a pre-mapped click",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1253430056911634453",
    "author": "spectrummasters",
    "date": "2024-06-20",
    "content": "Just dropped into say (apologies for the 808 talk ) but we all know about the fabled fl sound , but you can actually blow the shit out of a logic multi sampler channel turn off the channel output then send that to. 3 buses , blow the shit out of them (‘Make that 32 bit float do workkkkkk ) and then send those parallels all to a bus , stick big clipper on it and take that absurd overloaded bus back down to 0db , set ya bus fader to level of choice for your mix and we’ll golly gosh that sounds dense intense and immense with the right 808 . Or just print ya drums in fl but hey , 👋",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255904263217876992",
    "author": "rawssx",
    "date": "2024-06-27",
    "content": "sampling use to be a thing back in the day, now its just how to make a hiphop beat in 33 seconds (i’ve seen guys do that on instagram reels lol)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261162785627439247",
    "author": "chris_donlin",
    "date": "2024-07-11",
    "content": "Looking for tips on how to make 808's shake. I have a vague memory of a video showing how to do it with dramatically fast attack on a compressor but cant totally remember. Finneas style 808's",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1262397206506242182",
    "author": "Sam Segarra",
    "date": "2024-07-15",
    "content": "This might sound a bit noob-y, but does anyone have some very generic/stock-sounding house kick samples that they can send me or a sample pack they can point me to? Thanks in advance!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264608063009198193",
    "author": "Ross Fortune",
    "date": "2024-07-21",
    "content": "True that. The little reverse whip into every kick is a bummer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265064657467609210",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-07-22",
    "content": "not sure if this is the right place or #📚book-talk, however: For my master thesis, I'm looking at why and how pop music production of the early 2020s has adapted so many elements of 1980s pop music, including instruments (most notably analog synths and their software emulations, drum machines), sounds and samples. As part of my thesis I'm looking to analyse songs of both eras to showcase if and how they are similar. \nAnyone got recommendations for literature that might help with the analysis of songs in that regard. Unfortunately, I can't just wing and say \"that MJ synth kinda sounds similar to the The Weeknd used on Blinding Lights\".🫠 \n\nAny recommendations highly appreciated!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270136060529344753",
    "author": "Chad Rodgers",
    "date": "2024-08-05",
    "content": "Yeah that’s the one! I feel like the sound itself is staring me right in the face and I’ll kick myself once I know where it’s from / how it’s made.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1273846150117462087",
    "author": "Rollmottle",
    "date": "2024-08-15",
    "content": "delaying your inevitable purchase of the MPC",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277728192152600759",
    "author": "Rollmottle",
    "date": "2024-08-26",
    "content": "My buddy and I are working on a remix. It's being done in Ableton. He tinkers with parts on his own in Logic against the rough and he added a great part with a Logic instrument that is good...but it has a very specific effect that I'd like to recreate in Ableton. Anybody have any thoughts on how to get this rhythmic gating effect using Ableton effects or know of a plugin that makes this trivial? I've included a sample of the audio, a screenshot of the Logic patch and a screenshot of the very straightforward MIDI from which it is derived. (Worse comes to worse we can use an export of the audio, but would like to see if I can crack it for maximum flexibility).\n\nI tried fucking with Beat Repeat and it's close, but not quite the same. Anybody have any bright ideas?",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1278920917074051188",
    "author": "chris_donlin",
    "date": "2024-08-29",
    "content": "Need some advice here! I've been working with an artist for a little over a year, have made 8 or 9 songs. We've had to retrack vocals for nearly every song because the performance just isn't quite there yet, but we always get it where we want it in the second session. I'm noticing a pattern of him sitting with the vocal and realizing he wants to sing it differently/better, but only feels this after we've tracked it once. Today was day 1 tracking vocals on a new song and it got to the point where i realized we were going to have to try again another day, I was felt fed up. I tried to discern what exactly i was frustrated at. Part of me was frustrated because it doesnt seem like he is ever truly prepared to track vocals, in the sense of being warmed up, having ideas of how he wants to sing, practicing ahead of time, singing random stuff in between takes, etc. The other part of me was frustrated with myself because im aware some of the responsibility falls on me as the producer/coach. I have no problem taking time to edit the vocal, i know it's part of the job, i enjoy it in fact haha - but is it fair to have certain expectations from him as the artist? I want to have a conversation with him about it but also be clear that i want to be better at my job too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1302254096534994945",
    "author": "Skyler Young",
    "date": "2024-11-02",
    "content": "Question for you all: would you rather a plug-in that did 808s and synth bass in one plugin - or have them as two separate plugins? Does something like that make a difference to you workflow wise?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308926786544865361",
    "author": "Ross Fortune",
    "date": "2024-11-20",
    "content": "I’ve sat down a few times to try assigning keyboard shortcuts and see how standalone feels like that, but end up getting frustrated by how slow I am and reverting to AT graphic. \n\nSome solid guidelines should help get into the swing of it though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312998472537866281",
    "author": "Rukie",
    "date": "2024-12-01",
    "content": "Tony Maserati has mentioned using a room sample to go with the drum machines to make it feel more like someone playing drum in a room on one of the MWTM interviews. \n\nI’ve also seen people approach it the other way around where you take a drum recording, keep the overheads/Room but replace the close mics with drum machine samples. \n\nI have a feeling that the latter might be the move for what you are looking for.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313033016024633415",
    "author": "vostral",
    "date": "2024-12-01",
    "content": "On this video, John Mayer says he blends the drum machine with the overhead track from the drum recording.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313041862969524295",
    "author": "vostral",
    "date": "2024-12-01",
    "content": "Just layer for effect, ableton is great at this. In terms of sample, i can layer more tracks (kick 1 kick 2 snare 1 2 3) inside that drum buss",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313282289714597899",
    "author": "Ross Fortune",
    "date": "2024-12-02",
    "content": "I haven’t used either myself, but listened to AG Cook on Tape Notes and there’s a section where he shows Synplant doing its thing on an 808 cymbal IIRC. Does exactly what @Slow Hand seemed to be describing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313405163528257587",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-02",
    "content": "You think so, in fully programmed beats? Idk I see people talk about humanizing/organic groove a lot, and people spend so much time pitch shifting handfuls of cents and varying layers/microtiming/velocity to get to a less machinegunny/real place",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313454013215412256",
    "author": "NoahNeedleman",
    "date": "2024-12-03",
    "content": "¯\\_(ツ)_/¯ as a mixer/finisher, one of the most consistent problems with young producers is too much variation in kick & snare velocities",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313895468383604789",
    "author": "Tyler Graham",
    "date": "2024-12-04",
    "content": "Hey great! Glad you found it. Funny enough, I really learned the inside out of the daw by watching tons of livestreams of trap producers working during quarantine. It’s a daw i know just as well as Pro Tools and it works.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319743002343637035",
    "author": "Zack Hames",
    "date": "2024-12-20",
    "content": "My fav is always the classic Akai MPC.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319743503005122580",
    "author": "Jeremy Klein",
    "date": "2024-12-20",
    "content": "Ahhh the classic. I admit i dont really know what the MPC is capable of. I always assumed it was just a way to play drums. What fun stuff do you like to do with it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319744935766921217",
    "author": "Zack Hames",
    "date": "2024-12-20",
    "content": "So, I think it’s superbly underrated. Especially the new Akai MPC lives, one, etc series.\n\nI use it as a drum machine/sampler/sequencer for all of my hardware synths. It’s the brain and controller for everything.\n\nBut you can also use it completely on its own, you can put any sample all the way across a keyboard/pads to the correct pitch automatically. \n\nThere are built in AIR effects. You can time stretch, etc do whatever with samples. \n\nLoad up any drum samples and go to town. \n\nIt also has some built in instruments / synths, but I rarely use those. \n\nIt’s essentially a portable DAW as far as music production. I prefer it to computer by far for producing / writing with samples and synths",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319746852165255178",
    "author": "Jeremy Klein",
    "date": "2024-12-20",
    "content": "casually laid down an absolutely filthy beat in the middle of this vid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319757922934198354",
    "author": "Adam Thein",
    "date": "2024-12-20",
    "content": "Been kinda on the deep hunt for hardware arpeggiators that can do some specific things.  Got a Midicake ARP in the other day but was disappointed to find out it can't do keyboard splits on the input to allow you to have multiple arp patterns from different ranges on the same keyboard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319868344421060618",
    "author": "BatMeckley",
    "date": "2024-12-20",
    "content": "I’m REALLY digging my OXI One. \n\nDoing a lot of the fun things I was using my MpC controller for, in terms of idea generation. \n\nThere’s actually an amazing randomizer that I use nearly every day to spark ideas. I’m only using it to probably 2% of its potential but it’s AWESOME.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1320131094510833797",
    "author": "Will Pragnell",
    "date": "2024-12-21",
    "content": "You can get a used mk1 Elektron Digitakt for under $400 these days and in my mind that incredible value for a very cool very fun sample based groovebox. Super creative, sounds great, can't go wrong!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1329250062941028493",
    "author": "andrew_yv",
    "date": "2025-01-15",
    "content": "If you want realistic playability and flexibility of an instrument that can do basically anything you think of, the Audio Modeling SWAM saxes and brass are great, but they require some heavy handed processing to sound good. Otherwise, for more traditional sample based stuff that sounds better straight off I second @LAPhill on Swing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330258267682771098",
    "author": "SoundsLikeJoe",
    "date": "2025-01-18",
    "content": "Also...   Agree with the guys. I'm a big fan of Swing, Swing II, and Animator.  Those are cheap and very usable for fast deliverable writing (kids music jobs, games, etc)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331424987902382122",
    "author": "chris_donlin",
    "date": "2025-01-21",
    "content": "What's everybody like using for 808 kicks?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331686580313653351",
    "author": "chris_donlin",
    "date": "2025-01-22",
    "content": "Using 808 kicks as the bass",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331687402959274005",
    "author": "Ross Fortune",
    "date": "2025-01-22",
    "content": "If I'd known 808 Cooker was our boy @Skyler Young 's before I bought Sublab XL I would've gone with that. Sublab rocks too though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331733204654100593",
    "author": "Skyler Young",
    "date": "2025-01-22",
    "content": "Ramzoid is a YouTuber who hired me to make a few plugins for him! 808 cooker was the first plugin I made and I did not have the skills to pull off but having the pressure of a contract forced me to figure it all out quickly and set me up to make sky keys",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334670724736090183",
    "author": "BatMeckley",
    "date": "2025-01-30",
    "content": "Blackhole works for me to sample things off of Apple Music or YouTube direct into my MPC program",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336838904447369270",
    "author": "Josh",
    "date": "2025-02-05",
    "content": "Worked with a dude who was more ADHD than you and me combined. He’d be holding his phone near my head playing songs that he thought were cool while I was tuning and what not. I’d purposely ignore him and then go “I’m sorry dude, this is giving me trouble” or something like that and he’d get the message. Then I’d swing around when I was done and wipe the annoyance from my face and continue as per usual.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1338021799748702240",
    "author": "Jeremy Klein",
    "date": "2025-02-08",
    "content": "Reminder to myself: instead of starting a new loop on the downbeat, it can feel way cooler to take the last beats of the loop and start it on the 3rd or 4th beat before the loop’s entrance",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346996112212496486",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-03-05",
    "content": "Ive done this before but I‘m rly interested in the making the last bar 1 BPM slower method \n\nFeel it‘s much more subconcious snd subtle than „okay the producer added an extra beat at the end“ \n\nBoth methods are great when they work ofc but I‘m a sucker for doing stuff you don‘t notice but rather feel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350170905682247740",
    "author": "diamndsdancin",
    "date": "2025-03-14",
    "content": "yoo\ni have this drum loop that is in like a similar genre we're hearing today and i want to know the name of it, does anyone know? i think drake has some little boogie songs to this kinda pattern right now, other artists too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366243845452464199",
    "author": "longstoryshort",
    "date": "2025-04-27",
    "content": "the ensemble mode splits stems quite well, it beat UVR most of the time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366561830020976681",
    "author": "NoahNeedleman",
    "date": "2025-04-28",
    "content": "This kick drum is SO satisfying when it hits",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366561935197343826",
    "author": "NoahNeedleman",
    "date": "2025-04-28",
    "content": "What are the combination of choices that make a 4 on the Floor kick work or not work?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366834639670345861",
    "author": "spectrummasters",
    "date": "2025-04-29",
    "content": "My fav denizen of the 4/4 kick will always be Dennis Ferrer . He is the connoisseur.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369703225195892850",
    "author": "lystell",
    "date": "2025-05-07",
    "content": "I'm doing a production, where in my head it's kind of early Springsteen but in shuffle/swing (that man doesn't like swing, from listening to his catalog) \nAnyone got a good track for inspiration to that?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370815491765043230",
    "author": "Zach Hughes",
    "date": "2025-05-10",
    "content": "What are some great pop / rock records with weird snare sounds? Funky tunings or strange presentations, anything a bit out there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370866977471729775",
    "author": "Nomograph Mastering",
    "date": "2025-05-10",
    "content": "I would describe this snare as “consequential”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1371186224664019036",
    "author": "spectrummasters",
    "date": "2025-05-11",
    "content": "The tom for the kick drum in drop it like it’s hot",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1379069139720601684",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-06-02",
    "content": "Does anyone have free, royalty free samples of a train beat they could send over? Kinda like this one but less compressed/more organic sounding? would be of great help thanks",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1380748899110883398",
    "author": "diamndsdancin",
    "date": "2025-06-06",
    "content": "Has anyone found programming trap drums into Ableton can feel a bit bland/generic, it's almost like they need to all be glued together or something - I'm not sure exactly but it just doesn't feel right and almost feels basic when I add some 2 step hi hats, kick and snare. Even when I enjoy the sounds selected and the drum pattern. They don't really fit aswell on melody I've made VS if I drag and drop a drum loop.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1380749005734019112",
    "author": "diamndsdancin",
    "date": "2025-06-06",
    "content": "Looking to improve this as working on some trappy stuff with 808s and want to have it knocking and everything sounding good together",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1380752865898922105",
    "author": "JakeTB",
    "date": "2025-06-06",
    "content": "Ableton has lots of workflows- how are doing your programming?\n\nThe playback should be the same as any other daw, but there are a couple traps that come up. \n\n-If you’re doing drag-and-drop, check that automatic fades at clip edges is turned off in your preferences\n-If you’re using Drum Rack/Simpler, try turning off the filter  in the bottom left",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1384380153676959776",
    "author": "vostral",
    "date": "2025-06-16",
    "content": "Here are two samples including a static loop and a groovy loop.\n- On the static loop, I use DX drum machine HiHat and just barely put them 1/8 on the grid\n\n- On the programmed loop, I adjust the gain up & down for each hat piece, fade in/out to get varied length, time adjusting, and finally a Tremolo.\n\n=> These make such a big improvement in the feel. This is crucial for anyone using samples instead of real drum machines or Kontakt…",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1384380692544225402",
    "author": "vostral",
    "date": "2025-06-16",
    "content": "P/s: I use Oberheim DX Hihat from Samples From Mars. They have a huge collection of drum machines samples!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387840526316863589",
    "author": "cian riordan",
    "date": "2025-06-26",
    "content": "That’s arrangement + raked guitars + the compression trick all working together to kick you in the balls",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389083428867014696",
    "author": "Will Melones",
    "date": "2025-06-29",
    "content": "It looks like Groovecell might have the same functionality for free--check that out first!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389109208217161728",
    "author": "BatMeckley",
    "date": "2025-06-29",
    "content": "We’ve been having luck with groove cell for that over here.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392188676737470547",
    "author": "Ross Fortune",
    "date": "2025-07-08",
    "content": "I want to dig in on my drum programming / non-live drum production chops, in every way - sound choice, parts, groove, sonics.\n\nI’m studying existing productions and doing lots of it, but I want to know what I don’t know.\n\nCan anyone recommend good resources focusing on this stuff?\n\nEg learning about dilla time was a game changer for groove, and I don’t think I would’ve arrived at that technique unguided.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392198316565069836",
    "author": "thegreatcarsoni",
    "date": "2025-07-08",
    "content": "In what ways could someone regard a kick drum choice to specifically carry the story of the record? Any examples of this consideration? I hear the idea of production choices supporting the story but rarely broken down as A) what is the story and how do we find it? B) how can a kick drum or percussion loop or compressor choice support that story? What should we be thinking about to make those connections intentional?\n\nHow does one go beyond “this element fits the frequency and dynamic space I need filled”?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392204135335464980",
    "author": "Juliette",
    "date": "2025-07-08",
    "content": "What differences do you guys find between working with analog vs working with DI, in terms of sound quality? \n\nI’ve been on a kick recently trying to really hone in the quality of tracking with production with DI tracking (as to eliminate stress during mixing), and I’m finding that a lot of my personal qualms are because it doesn’t sound *organic* (whatever that means.) Do you think it’s possible to achieve the same clarity of sound with DI that you would with micing up instruments?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392273118072017008",
    "author": "hyanrarvey",
    "date": "2025-07-08",
    "content": "Something for highhat grooves it would be like",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392273358703300801",
    "author": "hyanrarvey",
    "date": "2025-07-08",
    "content": "110 ( 1) 65 ( and ) 112 ( 2) 61 ( and ) 111 (3) 64 ( and ) on a close highhat beat \n\n\nIn that example the snare is on 2 so the hands are gonna hit a bit harder together when they match",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392273451330568363",
    "author": "hyanrarvey",
    "date": "2025-07-08",
    "content": "Also turn off the grid and program the 16th notes maybe keep down beat and eigth notes on grid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1394814672762441858",
    "author": "Isaac Diskin",
    "date": "2025-07-15",
    "content": "Does anyone have any knowledge regarding creating PGM/SND files for an MPC 2000? Producer I work with asked me to figure this out but info online is quite contradictory so if anyone has any experience with this I would love to chat.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1395099629888077975",
    "author": "Isaac Diskin",
    "date": "2025-07-16",
    "content": "Oh cool! I want to bring wav files from computer onto the MPC, and I know they need to first be converted to SND / PGM files. Studio computer is a Mac running Ventura and the MPC has a SD drive as well.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1395121996962074634",
    "author": "aliberger",
    "date": "2025-07-16",
    "content": "the mpc2000 reads wav files! if they're not working i'd check that they're 16 bit/44.1khz",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1395122834174382242",
    "author": "aliberger",
    "date": "2025-07-16",
    "content": "snd is the mpc's native format for saving sounds, once you get the wavs loaded into memory i believe they can be saved as snd files. pgm files are programs (data like which sample is assigned to which pad and all the parameters around that) which you create on the mpc. programs don't contain any sound data themselves, they reference the sounds by filename",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396233497416433684",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": "You are going to run into a problem between the mpc and the computer when transferring files . The mpc runs FAT 12",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396234020588884109",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": "Build a new naming protocol for the MPC",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396234125655937135",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": "Remember all files transferred to the MPC can only be 16 bit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396234626753888288",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": "You can choose save all\nPrograms and sounds once you’ve transferred them in and you can set to save the waves as .snd format . I would not recommend using .snd  at all . There’s no gain to be made . You’re building a sound library in a format that’s incompatible with your computers finder \nThe Mpc and your computer share compatibility for wav . That’s the format that will allow you to always preview your mpc built sound libraries in the future on a computer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396237142182854728",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": "So , you can do computer wavs ->mpc .snd via digital transfer (floppy / flash card or spdif) but you’re circumventing perhaps the best part of the mpc (the sampler ) and gonna run into file naming and format problems",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396237522522083500",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": "But , it is a YES. To what your producer wants to do and if you get stuck just ask I’ll talk you through it . Do you have a copy of the MPC 2000 xl manual ? It’s v v good and will explain all this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404121661439086632",
    "author": "Ross Fortune",
    "date": "2025-08-10",
    "content": "Is there a broad name for the rhythm in this beat? Or a genre this kind of beat generally lives in?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1404592196237398098",
    "author": "cian riordan",
    "date": "2025-08-11",
    "content": "I've had good luck picking the more consistent kick and anchoring the low end in the center, then having the rest hard panned. Things can get a little seasick otherwise.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405790452904366206",
    "author": "spectrummasters",
    "date": "2025-08-14",
    "content": "Ha ! This is 🎯. Great find . I love how he’s articulated everything we did and much more , but with no words and just two hands . Great find ! \nThat second Jamaican beat there had its day big time in the 2000s taking uk garage into a post 2 step phase that led into early grime eg. “Wiley - what do you call it “ and dubstep\n\nThose african American beats are pure timbo and Neptunes also . The first ones giving tweet oh my and the second one I’m hearing clipZ grindin in there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1416046289900011552",
    "author": "SoundsLikeJoe",
    "date": "2025-09-12",
    "content": "Sanity check...    I came up producing with sampled drums, and always seemed to get fine sounds.  The last 5yrs, I've done almost exclusively live drum sessions.  Today I'm back to programming, and EVERY SINGLE snare and kick sample just sound squashed and hyped.  Over compressed?  High shelf boost? Very clicky kicks. Very flat snares. Idk...   just doesn't sound very satisfying and I want my drummer here, please. This is after digging through Addictive Drums 2 and the basic Superior Drummer. \n\nCan you confirm?  Should I look to upgrade my samples or find other kits?  What's your go to drum samples for programming rock?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1416052755272827041",
    "author": "Brian Reynolds",
    "date": "2025-09-12",
    "content": "Aksel Coe and Aaron Sterling make great sounding drum packs. I have success with using live loops and fills. Organize the performance I want. Then layer samples on top of the snare and kick as needed for fulfilling excitement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417247100928004116",
    "author": "longstoryshort",
    "date": "2025-09-15",
    "content": "i dont know if anyone gives a shit about this but Logic Swing is Notator Swing in Ableton\n\ni exported it out and confirmed it today because i've always wondered 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418030112624087130",
    "author": "diamndsdancin",
    "date": "2025-09-17",
    "content": "is there something specifically good about the logic swing?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418311177280426067",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "so quickly trying to go through say kick or snare or hihat samples is a fucking nightmare",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418319249050570772",
    "author": "Will Melones",
    "date": "2025-09-18",
    "content": "I'm loving Sitala for a much leaner drag n drop sampler, but GrooveCell may also fit the bill for free",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418320330958573610",
    "author": "Slow Hand",
    "date": "2025-09-18",
    "content": "So the takeaway here is to use *notator* swing when you want to match Logic's actual swing, right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418407049456255099",
    "author": "longstoryshort",
    "date": "2025-09-18",
    "content": "it won't swing 8th note items when using 16B/C/D/E/F so usually it applies to percs and hats\n\npeople swing everything tho, esp in UKG",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430705119191760926",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-10-22",
    "content": "Does anyone have a loop of a 16th note snare roll/buildup that leads into another section like a chorus? \n\nLike in this song at 0:00 and at 2:19\n\nhttps://open.spotify.com/track/7s0xV4DZ7g4y3kd0FtSfIz?si=13991db0b0f64706\n\nI'm sure there are tons of other songs that do this but this one is the only one that comes to mind rn",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452274237183098941",
    "author": "baccwardshead",
    "date": "2025-12-21",
    "content": "Hey guys! I'm in the market for MIDI Drum Pads for finger drumming/playing drums live or during production. Torn between the Maschine Mikro Mk3, the simple Akai MPD218 and splurging for the Push 2/3 or bigger Maschine. Analysis paralysis :/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452354187844390942",
    "author": "BatMeckley",
    "date": "2025-12-21",
    "content": "The machine series kinda locks you into the machine architecture and software. You can KINDA use it as regular midi pads but it’s very very limited outside maschine. The mpd 218 you can setup to work with any software.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452357109302825020",
    "author": "Mike Tierney",
    "date": "2025-12-21",
    "content": "I’ve had some clients that are maschine users and I agree w Matt here, while the maschine software is cool the maschine ecosystem really doesn’t play well with others in a way that ended up bottlenecking those projects to a degree. While those clients were still happy with it, it left a pretty bad taste in my mouth compared to just using something more typical with whichever DAW you’re in",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452357157033873574",
    "author": "Rollmottle",
    "date": "2025-12-21",
    "content": "Maschine is a total pain in the ass as anything other than Maschine",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452375178238754816",
    "author": "BatMeckley",
    "date": "2025-12-21",
    "content": "This is true for the akai MpC studio too, FWIW. But the mpd 218 is just a good set of assignable pads",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457005954217414707",
    "author": "hyanrarvey",
    "date": "2026-01-03",
    "content": "Also you may need to check your e kits dynamics too 127 in ggd is like hitting the snare as hard as a human can so like make sure you’re machine isn’t pushing out high velocities and use the parabolic curve for velocities in ggd",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460557256843329703",
    "author": "Rob Domos",
    "date": "2026-01-13",
    "content": "What’s the driest possible drum samples I can find? Not looking for a towel over the snare in a mostly dead room. I want anechoic chamber levels of zero room tone of every type of percussion imaginable. I want everything from triangle to timpani to cowbells to gongs to sound like they were recorded in an infinite vacuum. \n\nSome inspiration here that mostly scratches the itch: https://m.youtube.com/watch?v=8lSj5k2K7w0",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460595945011150940",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-13",
    "content": "To me those drums kinda do sound like towel over the snare in a mostly dead room, with some processing (mainly shortened decay/release).\n\nYou could get that kind of sound with many libraries, but the ones that come to mind are\n\nhttps://www.circlesdrumsamples.com/dead\nhttps://www.xlnaudio.com/products/addictive_drums_2/adpak/vintage_dead\n\nThe addictive drums pack is a bit of a weird one, it contains a lot of samples from their previous libraries, just with shortened decays/releases",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460704027950973041",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-13",
    "content": "Yeah I feel that! \n\nIf you're looking for an in-between between hiphop and real drums this is a weird library where they tried to get 808/909/Linn sounds through acoustic means: https://youtu.be/YZj1iYd7Vys?si=mnwwTfA4IP6b0qNF\n\nStill prob not dry enough for you though 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1466529209827590256",
    "author": "NoahNeedleman",
    "date": "2026-01-29",
    "content": "Programming drums to sound live, how do we feel about changing the snare from verse to chorus?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1466530464125686008",
    "author": "Bryan DiMaio",
    "date": "2026-01-29",
    "content": "I think it's fine, I've recorded drummers who have two snare drums in their setup and use one for one section and another for another",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1466530545847632137",
    "author": "Bryan DiMaio",
    "date": "2026-01-29",
    "content": "alternatively, you could just turn up the snare a little in the chorus",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1466602554753286306",
    "author": "NoahNeedleman",
    "date": "2026-01-29",
    "content": "When I toured, my drummer had 2 snares. The main snare sounded like a shotgun, but the one I called the “verse 2 snare” was real gushy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]