[
  {
    "id": "1204488670858584156",
    "author": "NoahNeedleman",
    "date": "2024-02-06",
    "content": "Quick shoutout to @Zack Hames for remote recording & delivering pro level drums. He saved me on that cranberries loop thing I was looking for and then absolutely smashed a full song performance for a country song. \nPro delivery, great communication, enthusiastic collaborator, reasonable rate, tight and tasteful performances.",
    "reactions": 28,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078124245755900015",
    "author": "cian riordan",
    "date": "2023-02-22",
    "content": "After I witnessed Eric V go deep down the rabbit hole of converter tests, clock tests, sample rate tests, etc… we all came to our own conclusions. But despite some controversial outcomes from some out testing, he stood by the premise that if a piece of gear, software, or technique helps you get out of your head and do your best work, it’s worth whatever their charging. Not having “x y or z” might not make any actual difference, but if it’s impeding you psychologically… then it’s worth addressing.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256446284416548905",
    "author": "BatMeckley",
    "date": "2024-06-28",
    "content": "Quick reminder a click track doesn’t have to be a click track. Putting down a drum loop solved a singers timing issue today.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072642928872259665",
    "author": "spectrummasters",
    "date": "2023-02-07",
    "content": "Happy Accident : I accidentally Monod a sample i was using in the verse, but not in the Chorus......once i realised , i left it. Sounds great the way the chorus opens up....give it a whirl",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014614000069247096",
    "author": "Will Melones",
    "date": "2022-08-31",
    "content": "I can just imagine this scenario. A producer sequences all the drum parts, they do the demos, write the song and whatever. Then they book a session and Matt Chamberlain shows up with a pristine Drum-Doctor tuned kit and an invoice for cartage. “Ok, we want you to play exactly what’s on the track, we like that.” He’s a pro, so of course he does. They quantize the performance, finish the song, and send the track off to @cian riordan  who DRTs the drums and replaces them all with Steven Slate one-shots and buries the cymbals.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103456613504917635",
    "author": "LAPhill",
    "date": "2023-05-03",
    "content": "Just wrapped on a score and my self-imposed rule was \"no orchestra.\" Because we weren't going to have the budget for a live one and I'm 100% in the camp of making your limitations sound like intentional choices. \n\nThere were so many times I wanted to reach for the orchestral samples to sell an emotional moment, or fill out a part. Not letting myself do that forced me to come up with other solutions, and the results are so much more interesting than some Spitfire samples in the background.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237802322743267489",
    "author": "LAPhill",
    "date": "2024-05-08",
    "content": "Spitfire libraries are fantastic when you don't want things to be in time, in tune, or consistent",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341908427563204689",
    "author": "Slow Hand",
    "date": "2025-02-19",
    "content": "I’m amazed that people are able to find anything that they are searching for when using Splice.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174759694271787118",
    "author": "LAPhill",
    "date": "2023-11-16",
    "content": "By far, the most important element in realistic orchestral sound is in the programming. You need a controller where you can automate cc1 and cc11 (modulation and expression). Instruments, especially strings, are constantly changing their volumes. Particularly on entrances and phrase-ends. If you don't have a controller for this, you can draw it all in, but that gets really tedious.\n\nIf you get that figured out, I can almost guarantee that just about any library out there will get you good results. So then it's just a matter of what sound do you gravitate towards, how elaborate of a feature set do you need, etc. Legatos are overrated and I'd take no legato over a poorly programmed one any day.\n\nIf you want a full orchestra, not just strings, I'd check out some of the all-in-one offerings from Spitfire (Albion, BBC Orchestra, or Abbey Road), East West, Orchestral Tools (Inspire), or VSL (Prime). They all will have several different articulations, a decent amount of dynamic layers, and a full set of orchestral instruments. Have a listen to them and see what sounds grab you. Spitfire and Orchestral Tools have a more prominent room sound baked in, but they all do to some extent. So be aware that, whichever library you choose, there's a certain amount of \"reverb\" (which is actually just the hall they're recorded in) that you will never be able to turn off.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033939905086226472",
    "author": "Slow Hand",
    "date": "2022-10-23",
    "content": "I couldn't speak to the current state of samplers, but I've always wished that someone would build a bold sampler that wasn't afraid to be really wacky and full of unique characteristics. For starters:\n\n1. Include a radio tuner. \n2. Maybe some really nice - but heavily colored - preamps.\n3. Include all kinds of weird peripheral sensors like devices that pick up EMF signals or a few contact mics. Include a suite of effect plugins that are specially geared towards these input methods.\n4. Super-intuitive resampling, time-stretching, and pitch-shifting features.\n5. An algorithm that analyzes the dominant pitch of a loop and auto-maps it to a keyboard. It should be capable of re-orienting itself as the dominant pitch of a loop is adjusted.\n6. Tracker-style sequencing capabilities.\n7. An OTT-style compressor. Maybe something really trashy and blown-out like Devil-Loc or Vulf Compressor. Something that really messes with the proportions of a sample.\n8. Easy and flexible integration of feedback loops.\n9. Intuitive integration of polyrhythmic looping or sequencing.\n10. A feature for easy implementation of Steve Reich 'It's Gonna Rain' style tape loop phasing.\n11. Auto-bpm detection keyed off of designated inputs (ala Ableton).\n12. Automated master tempo effects.\n\nI could go on.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103477593837150218",
    "author": "NoahNeedleman",
    "date": "2023-05-03",
    "content": "Interesting, and to your point, I just finished a production where I reached for Spitfire *instead* of guitars or synths in the same spirit of limitation / creativity. Turns out the BBC horns make a killer pad.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241812975019364462",
    "author": "LAPhill",
    "date": "2024-05-19",
    "content": "We're not privvy to the conversations and the process that led to the results of finished songs. In the same way that sometimes the rough mix wins, sometimes that loop that you grabbed just to kick off ideas ends up unbeatable. Rerecord with different sounds, trying to match or improve the feel, but there was something about the way those Splice loops interacted that couldn't be beaten. Or just isn't worth the effort because now everyone is focused on making sure the vocal is perfect and the track is working. \n\nI'd take the best version of the song over some self-imposed creative high ground any day.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405042432306843808",
    "author": "Rob Domos",
    "date": "2025-08-12",
    "content": "Omnisphere is a great rompler with pretty bad effects. IMO the best way to use it is to initialize it and then dive through the sample library",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1024816875126927360",
    "author": "1ggy",
    "date": "2022-09-28",
    "content": "I think we should turn the collab track into a sample pack",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1332281791616389162",
    "author": "Rob Domos",
    "date": "2025-01-24",
    "content": "Splice just announced subscription price is about doubling to $12.99 a month. I don’t really produce anymore and use maybe 30 samples a year so I’m ending my subscription. My question is:\n\nWhat am I blowing these 7000 credits on before I cancel? Hit me with all of the best packs. I’m just gonna buy a ton of stuff blind and walk away with a library I can peruse.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062454965907501226",
    "author": "peterlabberton",
    "date": "2023-01-10",
    "content": "I was wearing out that Willie Nelson record Teatro that he played on around the time we did that lesson—but hadn’t told him that. When I showed up, he had two drum kits setup mirror image of each other, sharing a floor tom, as I’m lefty. I walk in and he goes, “I figured to start we could just jam a bit and play together, this is how I did this Willie Nelson record with Tony Mangurian” (another lefty). It was pretty rad to just rock out with him, and then we ended up hanging for a while and just chatting about whatever. Gem of a guy.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090085972303159368",
    "author": "NoahNeedleman",
    "date": "2023-03-27",
    "content": "Went to track a live kit on a song at a buddy’s studio today. He offered to try a few perc things to layer on top of the conga splice loop I already had going. Played like 5 instruments in quick succession and it went from “that works” so “that’s fucking classic” in like 15 minutes.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150123913536356553",
    "author": "Eric Martin",
    "date": "2023-09-09",
    "content": "all of this, I agree, all the splice loop music gonna make people retreat to instruments and people playing together 🤞🏻\n\nsplice is the demo, and then people with instruments play the song",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239237105343791124",
    "author": "Rollmottle",
    "date": "2024-05-12",
    "content": "808’s were recorded to tape back in the day. And were sampled with 8 and 12 bit samplers (and then also recorded to tape). A bit reducer and a tape sim should get you in a tonal world that maybe you guys are looking for.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241765619167137924",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-05-19",
    "content": "Ah Andy and his splice loops",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357597759493902559",
    "author": "oaklandmatt",
    "date": "2025-04-03",
    "content": "The law says \"any use\" needs to be cleared. One of the major legal cases even specified no minimum length.\n\nThat being said, nearly all drum one shots are commonly uncleared. There are some other exceptions that would fall under being a generic sound of some sort.\n\nThe short answer is, if someone can recognize it from their original recording, you can be sued. \n\nMost people don't bother trying to clear things because they don't have budget. Usually nothing ever happens because most songs don't get big enough for the copyright owner to care. Then again, I heard Gotye had to give away 80% of Somebody That I Used To Know because of the two chord uncleared bossa nova guitar lick.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050162938612293632",
    "author": "NoahNeedleman",
    "date": "2022-12-07",
    "content": "I love splice, but the amount of time it takes me to find the beat I’m looking for is usually greater than the time it would take me to program it.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059561821863944223",
    "author": "stefanmacc",
    "date": "2023-01-02",
    "content": "I usually loop 4 bars of a real hi hat and real cymbals and that usually takes the computer out of the situation. Even if the kick and snare are the same velocity and sample over and over . The hat being real usually does the trick.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061694045216329799",
    "author": "ALXCPH",
    "date": "2023-01-08",
    "content": "Just realised that not everything on Splice is Free to use. Some packs have descriptions on how to license them for commercial use",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1063142146384855040",
    "author": "sukhuno",
    "date": "2023-01-12",
    "content": "So basically what i did was i set up an ableton multisampler with all of my favourite linn drum sounds + some others that i liked (did this for snares and kicks) - so about 127 each. then i made 4 versions of that in an instrument rack and split them using multiband to only certain freq ranges (low, low mid, mid, high) - i think i used shaperbox for this. then i used an ableton random midi effect so it would trigger random samples in each of the 4 instrument racks... so you create a new sound from the seed sounds you choose. you get sounds that are in the linn drum ballpark but just a little different - which is the cool thing. https://we.tl/t-MxppdXPQlf here are some of the ones i liked (kicks, pitched snare, snares) that i made using this method",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065749261695848508",
    "author": "brasstracks",
    "date": "2023-01-19",
    "content": "no real rules here except the ones you set for yourself- make a read me to throw in the pack, include the option of making it an exclusive loop if they use it but they’ll either have to pay a fee or give you more publishing or something",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073443477225996309",
    "author": "austenballard",
    "date": "2023-02-09",
    "content": "Test is done. Tl;dr they don't null completely. They don't even detect the same audio the same.\n\n**INTRODUCTION**\nBeckley, et al. (2023) reported differences in tuning results between the plugin and standalone versions of Melodyne. This investigator undertook a test of Melodyne plugin, ARA and standalone versions to determine whether the resulting tuned audio would null.\n\n**METHODS**\n\nAll testing was performed at a sample rate of 48kHz and with .wav files at a bit depth of 32 bits. Tuning was tested using two 2-second square wave tones generated with FabFilter One in Logic Pro X. Tone #1 was generated at a constant pitch of C4 +50ct. Tone #2 was generated at a pitch of C4 with the following settings: Modulation Generator (MG) Frequency set to 4.033 Hz,  MG waveform set to value 0.500, and Frequency Modulation MG set to value 0.123. Each tone was printed on a separate channel as a Bounce-in-place (bip). The two bips were then joined into a single, 6-second, mono .wav file with 2 seconds of silence between the bips. The 6-second .wav file was copied onto two new channels in Logic Pro X, and dragged out of Logic Pro onto the desktop for use in Melodyne standalone.\n\nAudio was transferred into Melodyne: one mono channel in Logic Pro X was loaded with an instance of Melodyne non-ARA, one mono channel in Logic Pro X was loaded with an instance of Melodyne ARA, and the copy of the .wav file on the desktop was loaded into Melodyne standalone. All transfers were completed using the Melodic (Standard) algorithm. \n\nTransferred audio was quantized to pitch C4, offset 0 ct, Pitch Modulation 0.0%, Pitch Drift 0.0%. All other settings were left at defaults; Note Assignment mode was checked to verify that Playback Type in each case was 'Tonal'. \n\nResulting audio was printed and imported into three new mono channels in Logic Pro X. Null testing was performed using the phase invert feature in Logic Pro X's stock 'Gain' plugin.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090310201535627295",
    "author": "BatMeckley",
    "date": "2023-03-28",
    "content": "I will say there is a single percussion loop that’s probably been on over half the number 1 pop songs of the last 15+ years.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171637146810073138",
    "author": "NoahNeedleman",
    "date": "2023-11-07",
    "content": "INSTRUMENTS:\nBattery\nKeyscape \nKontakt vintage machines & vintage organs, scarbee bass\nArturia Mellotron + Minilab \nMIXING:\nProQ3\nKramer PIE\nDecapitator\nValhalla Delay\nOzone 9 or 10 covers a lot of basses\n\nThe majority of my shit is real instruments but I think I could make a record with just those. And a midi keyboard",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1176838718414405652",
    "author": "oaklandmatt",
    "date": "2023-11-22",
    "content": "https://instagram.com/stories/letmeseeyou/3241454844068637834?utm_source=ig_story_item_share\n\nNic Nac (huge producer and all around stand up guy) showing all the duplicate sounds from various sample kits that producers sell. I suppose I knew this but have never seen it shown like this.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1204814597857611838",
    "author": "Ross Fortune",
    "date": "2024-02-07",
    "content": "Thanks to all the folks for suggestions on perc replays. I slept on it, had a listen and realised that I'd been ignoring a really key element in the loop. I'd already programmed a kick / hat / snare / clap pattern, but underestimated how much the filtered version of that in my borrowed loop was adding to the groove.\n\nStumbled upon an Oliver loop that did just what I needed in that department, and suddenly it all came together. The replay of the perc I'd already made was good, I just didn't see the glaringly obvious because I was so deep in the weeds with perc details.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241804535530520596",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-19",
    "content": "The espresso producers rn when people are calling them frauds bc they used splice loops:",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994734853247471798",
    "author": "Slow Hand",
    "date": "2022-07-07",
    "content": "Strong second on the Ableton drum rack: (*chef's kiss*). *Big* fan. \n\nIf you want to go a step down the ladder of components I would also give big props to the Ableton sampler (Simpler). It's so refined and well-integrated into the DAW that it feels like my left hand at this point.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031608726345494601",
    "author": "NoahNeedleman",
    "date": "2022-10-17",
    "content": "Try Felt Piano by Spitfire. It’s only $29 and if it’s not right for this it’ll be right for something.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057313816901320826",
    "author": "Ross Fortune",
    "date": "2022-12-27",
    "content": "And it's consistently hypnotising my 5 month old nephew. Second loop now. His mother is very thankful 👍",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090797760380407949",
    "author": "BatMeckley",
    "date": "2023-03-29",
    "content": "Fun fact: I’ve never used splice.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095138699924213840",
    "author": "NoahNeedleman",
    "date": "2023-04-10",
    "content": "You can also pull edited Tom hits into separate tracks, and replace them to taste. Especially if you got one shots at the end of your session (always a good move, as stated previously on the discord, though I can’t remember who said it first.)",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103332566234300506",
    "author": "Bryan DiMaio",
    "date": "2023-05-03",
    "content": "That's a lot of the reason why Terrace's stuff has so much of a vibe, he gets a lot of musicians together and sometimes we'll chop stuff around but always keep the context set. It's so live, even the 808 drum kit on Drones was an electric kit hooked up to an 808 machine lmao",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119459891946475540",
    "author": "LAPhill",
    "date": "2023-06-16",
    "content": "Sample modeling can get closer. But it’s so much work, and you really have to know the instrument inside and out to program it convincingly. So much easier to just hire a damn player.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1159908395852242996",
    "author": "Skyler Young",
    "date": "2023-10-06",
    "content": "Yo! Just uploaded the updated version of the sampler instrument plug-in I’m working on",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164017350270517248",
    "author": "NoahNeedleman",
    "date": "2023-10-17",
    "content": "Pretty strong loop collection from one of my fav producers in LA\n\nhttps://sanpedrosounds.gumroad.com/l/CelebritySmoothie?fbclid=PAAaY6MUPRmeuspgGMEuTxs-pxXhCt5eNI7Z8xweVIs9fQOd5bX4iqCAhjU-w_aem_AdDemQ2yH5PjI_FgjzpXhxLZRaVMB95BTSjg58SYRTO2onJgbILIlB3puLBMAhntH6o",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172282473388982312",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-09",
    "content": "M3 Max is blowing my mind. Was on a Razer Laptop before, couldn’t work in 32 sample latency at all. Now I’m running 10s of VSTi:s, Ozone, while recording 4K footage in OBS, 32 sample buffer, using 30% of CPU/GPU. This actually changes everything, VSTi:s are actually PLAYABLE",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175235899999649822",
    "author": "BatMeckley",
    "date": "2023-11-17",
    "content": "I mean, spitfire definitely can have their quality control problems but going after them for their <checks notes> free sample libraries that undoubtedly cost them money and man hours yet they provide at no cost for the community feels way harsh Tai.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197753163890032661",
    "author": "Nomograph Mastering",
    "date": "2024-01-18",
    "content": "Drum sample replacement plug in?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1215233574110892032",
    "author": "Ross Fortune",
    "date": "2024-03-07",
    "content": "Just while it’s in my brain, for programmed “real-ish” drums I’ve been having good luck with drum samples + hihat and ride loops (Splice). \n\nHaving a little sidechain action on the loops (keyed from whatever elements would be causing things to squish in compressed mics on real drums - usually the weight of the kick) can help the loops feel part of the kit. \n\nStir in some faux ambience (Raum, SP2016, sometimes Ocean Way) and whatever bus processing you might do on a real kit helps with the smush.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336392551892127825",
    "author": "NoahNeedleman",
    "date": "2025-02-04",
    "content": "I’ve been thinking about @Joel \"Roomie\" Berghult‘s question re: mixing as you since he asked it. I think what Rauirí says about not knowing what we’re doing while we’re doing it is really true, so I’ve just been trying to dissect my process in my brain, away from the computer.  I think it comes down to 2 things for me. \n\nHere are my thoughts:\n\n\n1) Choosing Sounds. \n\nIn addition to vibe & genre & emotional intent, each instrument or sample that you pick covers a certain area of the overall picture. Knowing where that part is going to go in the overall arrangement changes how much hi end or low end or wetness (etc.) you want. It also steers performances. \n\n2) Actually Mixing As You Go \n\nOnce a part is recorded, do a quick adjustment so that you hear closer to a finished product. This helps you make better choices about what else needs to be added, (or not added,) and will likely inspire the next step.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444132648179208282",
    "author": "BatMeckley",
    "date": "2025-11-28",
    "content": "I know I’m the other matt but when I’m doing that technique I’m usually just working on a single cycle of the waveform. It’s tedious, but to me it’s totally transparent, and I’m rarely cross fading because it just doesn’t need it at that microscopic level. But I have no doubt that the better matt is right about it on bigger sections. \n\nWhen I do it in protools (the slightly larger sections) I’ve found you can nudge one of the two things you’re cross fading sample by sample and you’ll watch the over lapping waveforms kind of level out at a specific spot where it’s the most transparent sounding fade. \n\nA majority of time I find if you’ve cut up your blobs properly in melodyne, melodyne works just fine, but on the really really delicate shit I’ll do the single cycle wave form duplication. \n\n(I hope this makes sense, I’m hurtling through the air at 35000 feet on a not insignificant amount of Xanax)",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460714943186866260",
    "author": "Rob Domos",
    "date": "2026-01-13",
    "content": "2027 Rob owns a sample company I guess",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461624163931394110",
    "author": "Chad Rodgers",
    "date": "2026-01-15",
    "content": "Jake Reed’s “Super Dead Drums” sample packs are excellent. Use them all the time",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941768896900395028",
    "author": "Jeremy Klein",
    "date": "2022-02-11",
    "content": "i love blending splice percussion loops that have a lot of natural variation into my programmed drum parts. just chop them to fit your rhythms but try to use every part of the loop (i.e don’t just take one snare from the loop and paste it everywhere)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "967445874953297970",
    "author": "Eric Martin",
    "date": "2022-04-23",
    "content": "I added a typewriter typing sample and gated it to the toms of a rock song to great affect once the band thought I added a motorcycle sample",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "968192285290397706",
    "author": "Deleted User",
    "date": "2022-04-25",
    "content": "for toppers i like going to\n\n808 toms, hitting random objects with sticks or knocks on surfaces, short loop of vinyl crackle or any sort of rustling/scrambiling somewhat quantized to have a rhythm, mangling with found sound (this may or may not work cause they have such strong characters and very particular mid-high frequency content), timbale fills, congas and bongos, or any random noises into distortion (to just bring out every bit of low level stuff) going through gated filter sidechained from a drum loop (it can be the main drums or any other random rhythmic thing to key the filter envelope)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "970792778378407976",
    "author": "oaklandmatt",
    "date": "2022-05-02",
    "content": "effectrix is a cool plugin for that. also, triggering a gate with midi or loading a vocal sample into a sampler is an easy way to generate ideas.\n\ntbh, the people i've seen do it best just edit edit edit by hand.   i think a lot of people read about BT doing a couple thousand edits on n sync's song \"pop\" and realized that you just spend the time to get it right",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050481590024798208",
    "author": "BatMeckley",
    "date": "2022-12-08",
    "content": "This. I often times treat a virtual drummer like a real one, where I then go in and sample replace etc.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053738706768511046",
    "author": "BatMeckley",
    "date": "2022-12-17",
    "content": "Spitfire really prides itself on 38 mic options and the rooms they’re recorded in, it’s just in their DNA. If you want violinist in a closet with a contact mic I might look at another company.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062039017769676820",
    "author": "Adam Thein",
    "date": "2023-01-09",
    "content": "If someone came out with like a hihat specific multi sample plugin I’d be all over that.  Like tons of options from Zildjian, Meinl, Istanbul, Paiste, etc",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062042470654951495",
    "author": "Zack Hames",
    "date": "2023-01-09",
    "content": "The only thing worse to me than trying to find the right sample is finding the right LOOP. Lord. \n\nAgain, that’s my kryptonite  - I hate that shit",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080821370277068800",
    "author": "GaspardMurph",
    "date": "2023-03-02",
    "content": "Producer friends! My good friend Tom Daveau (drummer in French band L’Imperatrice) and I want to make a drum sample and loop pack, mainly for fun and would be a good time doing this together. A few questions:\n1) what are the top 5 most important things for you in purchasing a drum sample pack ?\n2) I’m always annoyed that all samples are 0.0db normalized and I always have to turned them way down to keep my gain staging coherent, would I be crazy to have them peak at -8 ? Would people automatically hate it ? \n3) In acoustic drum packs, how interested would you be about having the mixed loop but always the stems from that loop (separate mics, or at least kick, snare, kit etc…)\n4) how important is it for there to be pre-made battery/drum rack/kontakt instruments of the library or are straight wav files cool ?\n5) what is the sample rate standard for sample librairies ?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091489445502525541",
    "author": "Adam Thein",
    "date": "2023-03-31",
    "content": "~~weird one, but anybody out there got a pan flute library that I could send you a little midi to run and print for me?~~\n\nrealized i could source some one shots on Splice and build a quick multisampler, cancel!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596054035271764",
    "author": "BatMeckley",
    "date": "2023-04-03",
    "content": "It’s so funny to watch the people I know layer kick samples, then 2 years later another producer use their 8 layers as one layer, then add 5 more layers, then 2 years after that the original producer sample that 13 layer deep kick.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596735626444951",
    "author": "LAPhill",
    "date": "2023-04-03",
    "content": "I was working with an EDM guy who was like \"yeah, this 808 sample is only good for F and G.\" It was eye-opening how narrow the sweet spot is with these samples.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108490241469317220",
    "author": "BatMeckley",
    "date": "2023-05-17",
    "content": "I used to do this all the time in ProTools by importing the session and lying about the sample rate. Would speed it up and down like tape. Vocals, and drums was fun with too. \n\nNowadays I’m pretty sure that the legacy pitch plug-in in ProTools does the same thing if you unclick the time correction box. It was how Luke and Benny would re pitch drums and synth samples. Sounded (to us) way better.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150218878211850310",
    "author": "BatMeckley",
    "date": "2023-09-09",
    "content": "I disagree. Actually there are hits  on the radio right now where a decent portion of the lead vocal has actually been AI’d, and not sung by the artist… and I would posit things like drum machines (or at the least addictive drums or kontakt… etc) make up a significant chunk of the top 40 as well. You’re not going to be able to put the toothpaste back in the tube. There will always be room for humanity in music, and I agree with the idea that there will be a backlash towards overly quantized music resulting in at least the perception of real people playing “real” instruments, but AI is here to stay, like auto tune, or melodyne, or beat detective. It’s just how heavy handed will it be used.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1159868213736247336",
    "author": "Trolligator",
    "date": "2023-10-06",
    "content": "does anybody have as much trouble with the spitfire software manager as I do? it seems like every once in a while one of their libraries will just fuck up for *reasons* then I have to either repair / relocate / nuke and re-install it completely",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171632266133393419",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-07",
    "content": "Kontakt almost feels to broad, that",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203050786364465152",
    "author": "sethearnest",
    "date": "2024-02-02",
    "content": "Same thing if it was a vinyl rip or something -- I'd get it feeling like the original sample. Add vinyl to that stereo print. Then use that stereo print w/baked-in vinyl sound as the sample and manipulate from there to help the 'ripped-from-vinyl' feeling.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203142596113858586",
    "author": "LAPhill",
    "date": "2024-02-02",
    "content": "Honestly, it's a practical call - too many ways loops become untenable. If it's going to be played by a human later, it's a bitch to notate. If it's score-to-picture and I need to break out of the loop for some reason, it can sound annoying. If I get a note from a director that says \"I like that sound, but can you change the rhythm here?\" it becomes a problem.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211787039712870450",
    "author": "cian riordan",
    "date": "2024-02-26",
    "content": "Yes, just make sure session sample rate/bit depth are correct",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239285075246579876",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-05-12",
    "content": "808 Warfare is a kontakt library that a lot of talented producers swear by. Little bit old by now but still really hits https://youtu.be/aKQl7k8W_tc?si=02Zl0QpPixbI1Y1o",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241752980860960871",
    "author": "NoahNeedleman",
    "date": "2024-05-19",
    "content": "I use splice loops all the time. I’ve done shit that’s 20, 30, 40, 90% splice. But the top line, the vocal production, the *song*, that’s the part that matters.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241773165902958733",
    "author": "Rollmottle",
    "date": "2024-05-19",
    "content": "I love the stories behind the art. “I found this dope Splice loop and started cooking” is no less valid than “I spent two years in the studio with top tier musicians cooking.” Both are interesting to me. All roads that lead to a desired outcome that fulfills an artist’s vision is dope.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255897699819978832",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-06-27",
    "content": "If Oliver is getting paid I’m assuming it’s out if courtesy. Technically all splice loops are royalty free",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1273684489700118609",
    "author": "Adam Thein",
    "date": "2024-08-15",
    "content": "This is a random nugget but if you ever find yourself trying to convert multisamplers from one format to another, I found this great little freeware conversion tool.\n\nhttps://mossgrabers.de/Software/ConvertWithMoss/ConvertWithMoss.html\n\nFormats listed on the link but you can convert from SF2 to Ableton to Logic EXS24 to Kontakt",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1282410619986772021",
    "author": "Ross Fortune",
    "date": "2024-09-08",
    "content": "I’d just be searching Splice tbh",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315231464958197781",
    "author": "Slow Hand",
    "date": "2024-12-08",
    "content": "I think the next thing I'm going to do is a deep dive on is Kontakt. I've been using Kontakt for over a decade, but only to load up the commercial instrument packs. Some of those instruments I know well.\n\nHowever, I'm really looking to get into the guts of that sampler over the holiday break and see what it's capable of. Been paging through the manual tonight and am gonna start exploring once things settle down.\n\nSo if anyone here feels like a Kontakt power user I'd love to hear from you and how and why you're using it. No wrong answers.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350358028695769089",
    "author": "spectrummasters",
    "date": "2025-03-14",
    "content": "Foundationally , to my ear it’s pure 80s electro / hip hop .speed up planet rock with the Kraftwerk sample removed and you’re there . \n\nIf you listen to 2 live crew throw the d you’ll hear how electro moves into Miami bass and then it’s influences imho can be heard more recently by way of the trigger man break from show boys drag rap which became a major break for New Orleans bounce . Drake gave his nod to New Orleans bounce music having queen freedie in the nice for what video . \nSooo, for me it’s electro . Just with todays production aesthetics",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353173956059856928",
    "author": "Slow Hand",
    "date": "2025-03-22",
    "content": "Oh man. The included sample libraries sound *good* too. There's an 808 sampled kit that they included which is killer. You'd think that people can't improve on the sound of an old-fashioned 808 kit after all these years, but the samples sound great!\n\nI've got one song where I never quite got the 808 clap sound I wanted. Two days ago I booted up Serum 2... and there it was. So I resampled the clap, flew it into the existing session and now I'm done! This thing is paying off already 😄.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1380798768844116099",
    "author": "Slow Hand",
    "date": "2025-06-06",
    "content": "Nope. I don't see why Ableton would be lacking in that way. It's perfectly capable of making great drums.\n\nA pre-made drum loop will usually be more polished and ready-to-go than making your own drum pattern from individual samples. The pre-made loop will likely have been EQ'd, compressed, and mixed to work harmoniously, whereas if you're building a loop from scratch using samples it is up to you to polish and sculpt the sounds so that they work well together.\n\nIf the pre-made drum loop is like having someone serve you a finished meal, building the drum part from scratch means you have to learn to \"cook\" using those ingredients. It'll be harder to do well at first, but once you get the hang of it you'll be able to be more expressive.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392201767269175432",
    "author": "oaklandmatt",
    "date": "2025-07-08",
    "content": "Here's one I did a last summer when I was on a 5 beats a day stretch. I think I found the main synth sound in some patch and was like \"I love the Kanye track that uses this synth\" so I did a copy. It's a super simple beat, but there are 3 different 808ish sounds, a very specific 808 snare, and then a roomy kick in it as well. Just spending 30 minutes trying to match each sample opened up a bunch of options in my brain for making beats in the future",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1397828227120238624",
    "author": "Slow Hand",
    "date": "2025-07-23",
    "content": "Oh that's super easy to fix. Under *Resolve Manually* click *Browse for Folder* and then point it to the folder where you keep the sample library. Shouldn't take more than 60 seconds to resolve. If that. You got this!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1431667630737068183",
    "author": "Ross Fortune",
    "date": "2025-10-25",
    "content": "That Sound - Boots and Claps, on Splice. Usually does what I’m after in stomps n claps world",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "952610177557880862",
    "author": "cy (sigh)",
    "date": "2022-03-13",
    "content": "koala sampler and flip sampler are probably the most complete in my opinion. I think they're both free but offer additional features for a one time payment and they work prettt well on smaller screens \n\nmedly is also decent but i find it overwhelming for small screens. sound selection is meh. and I personally don't think the paid upgraded is worth it. \n\nauxy is paid only I think but pretty intuitive to me. \n\nntrack studio is more of a daw situation and can be overwhelming on small screens. \n\nbandlab is another daw. a bit easier to flow with.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984075297240547338",
    "author": "rse",
    "date": "2022-06-08",
    "content": "They just moved locations and started a new YouTube channel that looks very promising. Spitfire really seems to have put some more resources into it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986723861796093962",
    "author": "Slow Hand",
    "date": "2022-06-15",
    "content": "If they're loops I always include the tempo in parentheses at the end of the file name *ex: Plaque perc loop 1 (130)*.\n\nIf they're one-shot drums I always prepend them with  *kick, snare, HH, OHH, etc* An example would be *kick Plaque 1*, *kick Plaque 2*, etc.\n\nIf it's a collection of all the sounds and loops from a finished song I create a folder for that song (with the tempo in the name) and within that folder are subfolders for *loops, drums, SFX, etc*\n\nFinally, in addition to creating a folder with all of the assets for the songs (as I just mentioned), I copy all of the drum-hits to a single folder that has all of my custom *kicks, snares, HH, etc*. Same for any loops. This way I can search by song, but I can also go to a folder with *all* of my custom kick samples in one place.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994275444549505074",
    "author": "Will Melones",
    "date": "2022-07-06",
    "content": "https://decomposer.de/sitala/\nIt does next to nothing compared to most samplers, but that’s why I love it. I already have a huge hard drive of one-shots to drag and drop",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030789353196232734",
    "author": "Zakhiggins",
    "date": "2022-10-15",
    "content": "A channel for drum sample sharing would actually be pretty cool",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031610748306198549",
    "author": "NoahNeedleman",
    "date": "2022-10-17",
    "content": "Love Noire. All the kontakt pianos work for me for different vibes. Wonder if I can share presets, cause my preset for the gentlemen gives me 90% of what I ever need from a piano in a track.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032127642725527622",
    "author": "longstoryshort",
    "date": "2022-10-18",
    "content": "try sononym.  it's an AI based sample organizer, it organizes everything based on tags/tonality/type of sound.  the best part of it is you're able to find something similar at just one click, so say you have a sound that has a unique character, and you want stuff like it....it suggests it. obviously this isn't always super on point but i've found by chance it gives me some inspiring stuff that leads me to new decision making.  i like it a lot.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053733903887769620",
    "author": "popaganda.",
    "date": "2022-12-17",
    "content": "Spitfire Chamber or LCO",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053735442207473704",
    "author": "LAPhill",
    "date": "2022-12-17",
    "content": "I haven't used it, but Spitfire's Abbey Road Two looks promising for this.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053739315781435432",
    "author": "BatMeckley",
    "date": "2022-12-17",
    "content": "Very much this. The originals line is stupid good value and can cover 90% of most people’s needs. \n\nAlso, again with spitfire, working the cc11 is an absolute must. \n\nThe aperture selections are great too.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059446081060077578",
    "author": "Deleted User",
    "date": "2023-01-02",
    "content": "I feel you, especially in boom bap there's a lot that goes into that drunken swing feel. Same with tradition African groove. Easiest way is to load up a clip or loop from a drummer you like and extracting groove templates. You can quantize to the groove of your favorite drummer or a drum loop you dig. This will get you the results, but groove is a never ending journey of learning. Editing groove to make it feel the way you want to feel takes an understanding of what makes things groove one way or the other. It can be accents, dynamics, lengths of the notes, how much you deviate from the grid or what subdivisions you're on, and how the timing offsets rub and interact with each other in the whole instrumentation. Some drummers have really solid quintuplet swing, so instead of doing tripplet swing they'll play on the downbeat and the 3rd or 4th note of quintuplet. For this you can listen to guys like Nate Smith, he plays swings differently live than recordings- he drags and pushes the kicks and snares in recordings but for live, he only swings hats so there's more steady groove for other musicians to grab onto. \n\nOn the other hand, for playing the grooves yourself- I find it helpful to dance and groove to the rhythms as much as I can to absorb the feel and internalize them. But in order to play ahead or behind with authority, you need to know where the grids are and metronome practice is crucial. I'm not that great at timing either, so I'm trying to do as much reps in with metronomes as I can. Learning to play on the grid is a first step before learning how to deviate with clear intention. I hope this helps!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061720323592044676",
    "author": "Deleted User",
    "date": "2023-01-08",
    "content": "this is why a lot of sync companies say \"no splice samples except for drums\"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062041709090971709",
    "author": "Will Melones",
    "date": "2023-01-09",
    "content": "I could honestly leave all the drum loop packs alone and just take the hat patterns",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062043241719017522",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "I think that’s just about having a good collection of sounds you know well and can call upon when you know you need it. Fx if you need a live sounding hihat loop, you have a folder that has maby 5-6 straight 8th hihat loops that have different timbres. So you don’t have to dig through splice for bours😅",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062414612139610152",
    "author": "Zack Hames",
    "date": "2023-01-10",
    "content": "Not this exact thing - but I’ll play anything musical instead of a click any day for someone recording. I’ll program the entire song on drums ahead of time if I need to. Or at least a drum loop that is in the feel.\n\nI always have the click as an option. And I always use “marimba 2 accent” in the pro tools click plugin. It feels more “on” than the default",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066190946447917076",
    "author": "jordanmcleod_io",
    "date": "2023-01-20",
    "content": "anyone here move from ableton to pro tools and actually enjoyed pt more after the learning curve? i came up making edm loop based music in ableton but have been using more instruments and synths over the past couple years and enjoy recording myself live instead of programming notes. i've been using ableton since i started 10 years ago so i'm very much in my comfort zone using it, but have always thought about a change into pt. i use pt for mixing so it's not completely foreign to me. just curious if anyone else has an experience that would encourage me to try it out.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066826580162257097",
    "author": "Ross Fortune",
    "date": "2023-01-22",
    "content": "Totally this. I've wasted far too many hours of my life trying to make a poorly chosen sample work by layering, EQing, compressing etc. when just picking a stylistically similar but better suited (tone, length, punch) would've been the move.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080450297723371590",
    "author": "spectrummasters",
    "date": "2023-03-01",
    "content": "Logic Gang: quick share, Im finding the sample delay tool v useful in a few ways and reccommend for a few reasons. Picking up on the midi ticks convo last week, if youre programming in Logic , instead of dragging (and losing track of your moves) in the timeline/piano roll....throw one of these on an insert and increase the delay in tiny increments as you run down the track (typically hats and offbeat/ghost snares first) . You can quickly create the pocket youre looking for . Also added bonus...I believe under c. 12ms most people arent hearing a glaring time shift , (i dont go above 2ms ) so the delay is handy again just putting your hats , snares, percussive elements....just a millisecond or two behind/in front of each other so all your transient sounds are not hitting the 1/4,1/8, 16th counts at precisely the same instant. I find this helps with transients. Lastly, unlink the left and right on a stereo channel and youve got an instant width tool. Best for the transient and groove use tho imo.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1080895863792087141",
    "author": "Will Melones",
    "date": "2023-03-02",
    "content": "2) who would you see using the sample pack? Are you going to share it with bedroom beatmakers, or send it to high level rock/pop/indie producers? Desires and expectations may be different depending on the audience.\n\n5) At least 24-bit seems to make sense, right? I don’t use a ton of samples right now, but I *feel* like it’s been a while since I saw one at 16-bit.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081159262954336256",
    "author": "Ross Fortune",
    "date": "2023-03-03",
    "content": "3) In acoustic drum packs, how interested would you be about having the mixed loop but always the stems from that loop (separate mics, or at least kick, snare, kit etc…)\n\nVery little. If I'm using a loop it's because I want a vibe to happen instantly. Any edits I make on the loop will have to be done across the mics anyway, and hopefully you'll have mixed the loop in such a way that rocks the intention of the part being played. I can see instances where having control over close mics / overheads/ rooms might be cool though.\n\n\n4) how important is it for there to be pre-made battery/drum rack/kontakt instruments of the library or are straight wav files cool ?\n\nWould definitely like this.\n\n\n\n5) what is the sample rate standard for sample librairies ?\n\n\nDunno, but I'd like to see 24/44 or 48, and I can't imagine why you'd go below this.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088565804360028250",
    "author": "NoahNeedleman",
    "date": "2023-03-23",
    "content": "@jonmatteson @popaganda. @Maxim Y’all know I’m a UAD fan. That filter is fantastic. Already on a production. Honestly that’s the sound I’ve been looking for, just used it with what I thought was an already dialed Kontakt Sub Bass. 🙌🏻",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095301946866417684",
    "author": "spectrummasters",
    "date": "2023-04-11",
    "content": "It’s worth considering different 808s for different parts to meet your needs  . Sometimes I’ll have three diff 808s and a Moog bass  . And they’ll obvs all be treated individually . Re : which 808s ? Ime I find the choice of 808 (in my genres ) is a trend thing , in the last 3-4 years its pretty much been a progression by producers through perhaps four or five 808 samples .....and when the sample changes its often in alignment with a new programming technique (like new multiple flams ....or conversely, sparse hits etc ) . If you’re searching for ready made samples I could point you to a few places or if you’d like a little pack of the ones I’m referring to in what I said previously ....hmu. Happy to pass on privately . If so, these ones are more contemporary rnb hip hop than the actual  old Skool electro Roland 808 kick",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108609232061870152",
    "author": "Slow Hand",
    "date": "2023-05-17",
    "content": "I spent a few hours one afternoon doing the tedious labor of routing everything and now I have it saved as a series of presets for each Kontakt kit that I can drag into a session at any time. This is one task that you definitely *don't* want to do on the fly because it will bring your flow grinding to a halt.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108779025444392972",
    "author": "NoahNeedleman",
    "date": "2023-05-18",
    "content": "I checked it to be sure cause I assumed that would be the case. Ultimately any differences were negligible. At least for Modern Drummer in Kontakt.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1115696936683589693",
    "author": "chrissorem",
    "date": "2023-06-06",
    "content": "This is dope!  What sort of sound did the voices do? Were they words or vowels ?  I recorded a cover of  the song “I’m not not in love” by 10cc with the local natives and we recorded all their voices 9time per note across two Octaves and I put them in a sampler for continuous loop and those spilled out across 16 channels of the console. I wonder if I could use that?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117328178361421866",
    "author": "spectrummasters",
    "date": "2023-06-10",
    "content": "yes agreed, production wise you can follow those roland drum kits pretty much through every decade to this day. its amazing to me that a number of todays budding producers can name these things partially, for example referring to the Roland 808 Kick Long and not know anything about the Roland 808, let alone the other modules. ......and parrallel to the \"808 \", the 909 is still to this day, going strong in house with the likes of MK . From a production/mix viewpoint....i suppose these sounds themselves hit with such a charcter in the right frequencies that there must be something intrinsically appealing to us that will keep them forever relevant.Im diving back into the Linndrum Clap and the old Jermain Dupri / So So Def claps at the mo for a little diff sonic character .....they are all still in the same ilk as the rolands though. \n\nre: the drill hats.....thats another cyclical pattern there. In the uk thats been appearing and reforming for decades now. its a soca pattern that the uk appropriated into a period of uk garage production (about the same time that 2 step began to mutate into the hip-hop influenced So Solid style )......and then dipped into a scene we had follwing called UkFunky ( a mix of Us House and Carribean influenced drum patterns and bass) . Then it re-appeared again in those drill hats once the uk appropriated/re-mouldedd chicsago drill",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1124815044828479528",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-07-01",
    "content": "Hey @louisvie\nI hope I'm not late for the reply but Here are some workflow tips(with an assumption that you are doing foley first time).\n1.Download Your Sounds from https://sonniss.com/gameaudiogdc . They have almost 150-160 GB's of free Library of Pre Recorded sound which are royalty free which has almost everything  you'll need.\n2. Download Soundly(it's Free) and Use it as your Sample Browser for faster workflow as it's search functionality is specifically designed for searching foley sound,sfx,ambience etc(make Sure to Run it as Administrator for windows or it won't drag sounds to ableton) .\n3. Run Ableton in Gridless Mode for perfect timings for placing foley.\n4. Make sure to level and organise similer sounds together on the Go as it will help in later stages for sending stems for mixing.\n5. Going Scene by scene helps for preventing the overwhelm of the Huge Film.\nand all the Best for this Gig🍻",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139357734131740794",
    "author": "NoahNeedleman",
    "date": "2023-08-10",
    "content": "@LAPhill was thinking of you today while doing some “scoring” for my wedding video (DIY slideshow / iPhone video montage.) \n\nI loaded up Keyscape cinematic grand, Spitfire BBC Orch on 4 tracks, (violins, violas, cellos, horns,) and went at like I would a vocal arrangement- one voice at a time, which was great for internal voice leading and lead to some beautiful & unexpected chords. \n\nCame together really fast too.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155587694274035813",
    "author": "Skyler Young",
    "date": "2023-09-24",
    "content": "With analog synths I almost always record 2 mono takes and pan each left and right and the small timing difference in performance make it wide and more intresting imo- this has a doubler effect which humanizes the timing on one side for every note and plays a different sample which gives the same effect and saves time from having to do multiple takes",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1162973575939100704",
    "author": "LAPhill",
    "date": "2023-10-14",
    "content": "Spitfire libraries have chair creaks and coughing built into the samples, it's now a feature, not a bug",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174811638696775841",
    "author": "BatMeckley",
    "date": "2023-11-16",
    "content": "You should absolutely take Phil’s advice over mine on this, as he’s a scoring guy, and I’m a hack rock guy that occasionally needs orchestral stuff… but having said that I’ve found the spitfire stuff both useful and inspiring. That’s where I’d start if I had to do it all again.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1180178108750495859",
    "author": "Josh",
    "date": "2023-12-01",
    "content": "Kinda hard to sum it up into one message, but I’ll try my best. The easiest thing to start with is basses I think. So I’d pick different bass and 808 sounds and figure out what mine were missing. A lot of this was to stop using one shots I liked. And then from there it went onto different plucks, pads, etc.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1196615229656793210",
    "author": "peterlabberton",
    "date": "2024-01-15",
    "content": "@Deleted User i was gonna write a whole thing but everyone above said it better. It’s just music, edit or sample or farm it out or find a loop on splice, it doesn’t matter that much. Nobody’s going to jail for getting a part down in a sub-optimally authentic way.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210620472790876301",
    "author": "SoundsLikeJoe",
    "date": "2024-02-23",
    "content": "Imho...   ALL sample libraries will have a weakness, and the solution is always blending vs switching.  LASS and SFA are opposites, and blend more easily imo.  It's like LASS becomes the spot mics in my mix session.  Raise it up to add focus and attack, or bring out a melodic line.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239257460343050392",
    "author": "Adam Thein",
    "date": "2024-05-12",
    "content": "Also I've been loving my Teenage Engineering KO2 for this workflow.  Takes a little bit to get your head wrapped (at least for me that hasn't had a hardware sampler before) but a very fun and inspiring tool that got my eyes off a screen more often.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241765132204507167",
    "author": "SoundsLikeJoe",
    "date": "2024-05-19",
    "content": "In the scoring and stock music production world,  Splice has had some negative blowback due to watermarking, rights issues,  and lack of insurance that content on Splice is 100% clear.  There are many who have reported take downs or etc due to the heavy usage of those samples and/or conflicting clearance debates.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241766860870127636",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-19",
    "content": "The only thing that bums me out is that I haven‘t yet written a song as good as espresso using 90% splice loops hahaha",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241778511849455658",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-05-19",
    "content": "Great question. My feeling is that it comes back to not only labour, what you said, artistic vision. I think a lot of people will have a hard time believing a collection of unmodified splice loops made by someone else express any one artists’ artistic vision. \n\nI’m gonna take the temperature with some segments of my YouTube audience on this. I think it’s an interesting question.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241798457308610581",
    "author": "SoundsLikeJoe",
    "date": "2024-05-19",
    "content": "That last sentence of the first paragraph has weight imo. It also brings up a HUGE philosophy consideration that most musicians are uncomfortable wrestling with....\n\n\nCraft vs Art.  You can be a music craftsman that has huge success and have never made personal artistic output. Art doesn't equal market value and market value doesn't rank art. \n\nMaking with Splice can be rewarding and make a craft product of market value....  and it might even be transformative and unique enough to be art...  but it could just as easily be basic craft work without any intrinsic artistic value or personal expression.  It's a wide gradient of subjective value judgements.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255897459390025759",
    "author": "rawssx",
    "date": "2024-06-27",
    "content": "Interesting, i did my research on this splice loop thingy in 2022, when the justin bieber splice loop thing happened. his producer was getting attacked on twitter “you stole the loooppp cheaterrr type shit” and something very Crazyyy happened. The guy, who made the loop put up a tweet saying “ my loops on splice are royality free, and i dont mind ANYONE using it.” JB retweeted the thing saying You are a part of this!!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1262410190670794802",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-07-15",
    "content": "For slightly aged generic (but not original drum machine) stuff, Vengeance sample packs should do the trick. The Nexus 4 VST is also a library of impossibly generic patches and sounds (including drums) for electronic music. But honestly I feel like searching \"House Kick\" on Splice should get you there within the first few results",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278119408463511624",
    "author": "Ross Fortune",
    "date": "2024-08-27",
    "content": "Very sculptable non-lin reverbs (I’m sure the others are cool too, this is just what I’ve used it for)\n\nToday I used the filter to change the envelope of a kick sample that was nearly right - the length of the room was too long, and simply fading felt weird, but having a filter envelope triggered by audio input sculptable just how you need it is brill. Haven’t tried jt but it might be a lazy man’s alternative to the TLA tom thing",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1314012958027808870",
    "author": "Ross Fortune",
    "date": "2024-12-04",
    "content": "Not as cool for details as those above, but I did Yuck by Charli XCX a while back. It was fun because you have access to most of the exact ingredients they would’ve used (eg Kontakt scarbee bass or the other one, can’t remember which). The pocket of the bass was the tough part.\n\nLearned how to make The Message synth in Diva for it, and it was a nice exercise in balancing kick / snare / claps.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315375565414334465",
    "author": "Will Pragnell",
    "date": "2024-12-08",
    "content": "I haven't used the most recent version, but I used to live in Kontakt, treating it more like an old school sampler rather than this sample driven workstation thing that it seems to have become. Always happy to jump on VC and show some workflows and stuff. Might be cool to do a show and tell where we all bring our favourite instruments and show off a patch or something",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1333921043768803422",
    "author": "kieronmenzies",
    "date": "2025-01-28",
    "content": "Spitfire LABS is lots of fun",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342979194686148709",
    "author": "Slow Hand",
    "date": "2025-02-22",
    "content": "*Breakdown* and *Smear* mode are cool (I just tried them out). I put them in parallel on a drum loop and it sounded great! Am going to try when I get home tomorrow.\n\nHowever, Saturn as a distortion box still hasn't clicked in my brain. Every time I try it out I end up bypassing it because things end up sounding dull and gauzy and I lose definition. Also, it feels like it doesn't get mean or hairy enough for my taste.\n\nI think I need to see how someone else uses it for it to finally click.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1348268484035084362",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-03-09",
    "content": "Lmao I got one drum loop and one if his screams haha \nDidnt know it was discontinued, bummer",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392199215329050685",
    "author": "oaklandmatt",
    "date": "2025-07-08",
    "content": "Copy the placement of each sound and see it on the grid. Copy the swing and you'll learn a ton about grooves. Copy the sound of the samples and you'll learn unexpected things about sample choice. Copy the mix and you'll see how they all come together",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411883291493273724",
    "author": "andrew_yv",
    "date": "2025-08-31",
    "content": "Identical external drives, if I add something new, I’ve got a CCC task set up for it. At work, we have sample libraries on an Avid Nexus that all the computers just stream from",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460747717843222761",
    "author": "BatMeckley",
    "date": "2026-01-13",
    "content": "(In all seriousness, it actually sounds great and you should probably bundle together some one shots and and a folder of loops. You complained to me about how your room sounds with drums and it’s actually pretty awesome)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465786352787521723",
    "author": "oaklandmatt",
    "date": "2026-01-27",
    "content": "Definitely. So many cool ways to articulate an instrument.\n\nI think @Rob Domos (and anyone else who hasn't really ever explored a mod wheel) might do best to just start doing it. Almost every instrument has some articulation built in (from analog synths to orchestral patches to drum kits), and they should just start using them. Treat it like a performance. Then from there explore all the ways to do fancy, multi knob articulations",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937557545302757406",
    "author": "Slow Hand",
    "date": "2022-01-30",
    "content": "*Keyscape* has some fantastic sounding (and unorthodox) sampled keyboard instruments. That said I'm not particularly fond of the sound of it's LA Custom C7 grand piano. Which is a little too hi-fi for my taste.\n\nLately I've been very impressed by NI's/Kontakt's *The Maverick* grand piano. I believe it's a vintage Bechstein grand. The sound is robust and rich without all of the \"zing\" that I see in a lot of full-scale sampled grand pianos. It sounds \"woody\" to me. I think it would make for a very nice jazz piano.\n\nThey did a really good job of sampling every facet it and it has enough flexibility that you can dial in the really intimate Nils Frahm-style damper/pedal/mechanical noises, which I like.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941071239487823902",
    "author": "Zack Hames",
    "date": "2022-02-09",
    "content": "In this context, honestly blending multiple samples, even in the mix phase, can be incredibly helpful. Missing low end in the kick? Missing a certain smack in the snare? Find a sample with those attributes. Even if you’re just hired as a mixer I think it’s valid. \n\nOtherwise, EQ…saturation….blended distorted, reverbs, go nuts.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "953649749926506556",
    "author": "kidcutler",
    "date": "2022-03-16",
    "content": "Arturia rent to own through splice is an affordable way of immediately having every old synth, you still need to put some elbow grease in either making your own patches or wading through presets, but once you do they sound pretty damn good",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "956992784550756472",
    "author": "Zakhiggins",
    "date": "2022-03-25",
    "content": "@KushKadett I think to be a good producer, you should be just able to make whatever sonic feeling you want - so if that means technically \"wrong\" things like grit and noise, so be it. They still give a certain vibe. \nYour technical ability doesn't get in the way of your creative vision is what I'm saying in short\n\nWhat good production is, is different. It's in the eye of the beholder imo.\n\nYou could have a kid who just downloads FL, loads up a splice loop and happens to find a perfect kick and snare to go on it, the beat slaps, (technically good production?) but does this make him a good producer??\nYou see where I'm going haha",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982656610516226048",
    "author": "isaac joel",
    "date": "2022-06-04",
    "content": "Omnisphere has great presets but they also have an incredible sample library under the hood for building your own sounds and lots in this vein 🙂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984077849260601456",
    "author": "rse",
    "date": "2022-06-08",
    "content": "I've found that Kontakt seems really interesting for scoring film, orchestra stuff, but it's not really my thing in a song production setting. Only things I really use are the Rickenbacker bass and some piano's from native instruments",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984098024303239178",
    "author": "gatewoodsensei",
    "date": "2022-06-08",
    "content": "I feel that. Most of my music is orchestral and electronic heavy so I’m in kontakt a lot. That rickenbacker bass is killer tho.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994723346132516894",
    "author": "Jeremy Klein",
    "date": "2022-07-07",
    "content": "yeah once you use Drum Rack, basically all other drum sampler plugins feel terrible.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996936463033839626",
    "author": "Deleted User",
    "date": "2022-07-13",
    "content": "My main work drive is SSD, and I also have a sample drive. All of those are synced to three copies of local archive HDDs using CarbonCopy Cloner. The work drive, sample drive and primary archive drive is synced with backblaze.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1024044944337420308",
    "author": "ehutton21",
    "date": "2022-09-26",
    "content": "Learning how to program and/or play drums well is super super key for leveling up as a producer. I didn’t get really confident in my productions until I got one of those midi drum kit things and started learning how to just find a bounce like that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031059131395752046",
    "author": "satishkumar.26c",
    "date": "2022-10-15",
    "content": "Hey guys whoever requested for drum kit drive access…has been accepted so sorry for the delay i live in a different time zone (IST)\n More than 60 request 🙏anybody know how to keep the access open for all in google drive link ?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031609357403688971",
    "author": "ALXCPH",
    "date": "2022-10-17",
    "content": "or the free one called soft piano in the free Labs plugin by spitfire",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033879647349395506",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "Went to play around with some hardware samplers today after not really being a sampler/drum pad kinda guy",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050814630605361283",
    "author": "Fatherbobbytownsend",
    "date": "2022-12-09",
    "content": "Aaron sterling sample packs are also fire. And the Reddit Jack Antonof one shots",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053737478776959166",
    "author": "BatMeckley",
    "date": "2022-12-17",
    "content": "I’m a spitfire junky, and LOVE the ar2 stuff, but I don’t know if this is the answer.\n\nChamber is better. There’s some really good intimate stuff in Albion NEO. In terms of sitting them in productions I’ve found that libraries you wouldn’t expect like the olafur stuff works really well in a dense track. If you’re trying to make an actual orchestral track it’s different.  In the same way if I was doing a pop song I’d reach for a Taylor acoustic but if it was solo acoustic singer songwriter I might reach for an old Gibson or Martin, if that makes any sense",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055322606552760403",
    "author": "austenballard",
    "date": "2022-12-21",
    "content": "pitched resonance to atonal samples? precisely. and yes, i am all over physical modeling and abusing delay to create SOPHIE sounds. there was a hot second back when hyperpop was exploding where i became the sample dealer for my circle of producer friends lmao\n\ni never bought chromaphone because i figured i could just use tension and corpus to achieve similar results built into Live, but yeah that would be a logical third party solution",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062039363359350825",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "There is also one disco pack I don’t remember the name of on splice that has a bunch of different 8th and 16th hihat loops that were pretty decent",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1063064705435971584",
    "author": "Ross Fortune",
    "date": "2023-01-12",
    "content": "There’s a heap o’ stuff on Splice (Oliver and Chromeo have stuff in that world).\n\nSamples From Mars everything bundle might still be $50 on sale too, they cover a lot of classics.\n\nDMX, 707, Linn, TR505, Drumtraks are all machines in that world.\n\nGot a bunch of classics free from a site called kb6 years ago, probably worth a google",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080871146251104338",
    "author": "Zack Hames",
    "date": "2023-03-02",
    "content": "I’m probably an outlier in the usual drum pack consumer but I’ll give you my take:\n\n1. I found when there’s a million samples I get uninterested quickly. I’d prefer 2 snare sounds as opposed to 15 slight variations of nearly the same thing.\n\n2. I use an MPC, so the lower volume thing would be annoying for my personal use, but that’s an outlier.\n\n3. You could farm out the Battery / Kontakt / etc packs to friends who would be willing to do it or use those tools a lot, that way you’re not stuck making a ton of them (unless you want to of course) \n\n4. I don’t touch loops usually but I know tons of others do. \n\n5. That’s it. Sounds like a super fun and badass project! You should document it on the way on the discord\n\nEdit: I’m speaking to more electronic and supplemental use of drum samples. There are probably tons of folks out there who want all the options as if there was 100% a real drummer recorded in their studio.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080871190333247588",
    "author": "Deleted User",
    "date": "2023-03-02",
    "content": "1) Different tunings, Having clean vs processed, peaking at below -6, good velocity layers, round robin is good but not really necessary for me, I personally don’t need all mics separate but would like to have a separate room sample and the mixed sample as well.\n\n2) Yes please!! I hate it when samples peak at 0. I actually turn all of them down when I put them into a sampler to make it peak at -8 to -12\n\n3) small snippets of hihats or snare ghost notes and some tom loops. I’d probably prefer them mixed only\n\n4) for kits I think it is important. Round robin and velocity layers, and if you are doing rooms or separate mics having a kit makes an instantly playable and tweakable kit.\n\n5) I’m not sure. Anything between 44.1/16 and 48/24 should be fine! Anything beyond might be too much",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089251394629931130",
    "author": "jonmatteson",
    "date": "2023-03-25",
    "content": "The Travis Barker pack on splice does this sound really well. His engineer when he made this was Matt Malpass who did a lot of late 2000's rock stuff and gets awesome drum sounds",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089253447485898873",
    "author": "hyanrarvey",
    "date": "2023-03-25",
    "content": "Its hard to make one shots sound real tho",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090006114449510491",
    "author": "LAPhill",
    "date": "2023-03-27",
    "content": "Read the EULA of the samples, but in most cases, it's totally fine to use samples and loops as long as you're not selling them on their own. As in, if you use a hi-hat loop in your track, you can't have a section that is JUST the hi-hat loop. That would also apply to delivering stems. Your \"percussion\" stem, for instance, should have other elements baked in with it.\n\nThat doesn't apply in all cases and there are certain samples out there that don't allow for sync use. I can't remember which ones offhand, but that's why it's worth checking the license agreement.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092598218229039236",
    "author": "BatMeckley",
    "date": "2023-04-03",
    "content": "Also, almost invariably, I’m tuning 808’s like a sampler, as in decreasing pitch increases length. Time correction always neuters them.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092606207111483502",
    "author": "Will Melones",
    "date": "2023-04-03",
    "content": "That Sound has some solid sounding chromatic 808 one-shots in their Future pack. I took those and mapped them into a Kontakt instrument, crossfading into a looped sine wave so you can play the sustain. Also made a version of this with portamento, which is lots of fun",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102629466888470650",
    "author": "LAPhill",
    "date": "2023-05-01",
    "content": "(Also, Spitfire has become one of those companies that does sales all the time, so don't feel too pressured to get in on it now)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105905304673202176",
    "author": "youngteam",
    "date": "2023-05-10",
    "content": "I’ve been using blooper for sample making the past week - incredible inspiration tool",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108504424286003330",
    "author": "Bryan DiMaio",
    "date": "2023-05-17",
    "content": "I did that on guitar to make like a bass-sounding loop for a song lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108605583805911080",
    "author": "Deleted User",
    "date": "2023-05-17",
    "content": "You would have to load kontakt in multiple output mode to be able to mult it out. And then create channels in Kontakt’s mixer. I keep some multed kontakt instruments as presets so I won’t have to ever route things while making compositional/arrangement choices",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108606289174593556",
    "author": "LAPhill",
    "date": "2023-05-17",
    "content": "I'd be happy to help you setup the Kontakt side, but you should probably ask one of the Pro Tools guys here, since it's been a looooong time since I've dealt with MIDI in PT",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119361109963579494",
    "author": "Maxim",
    "date": "2023-06-16",
    "content": "It's how you got those juicy kicks before Splice and sample packs became commonplace. 😬",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119458631902048299",
    "author": "Slow Hand",
    "date": "2023-06-16",
    "content": "Yeah. A Spitfire horn library (no matter how gorgeous) is never gonna cut it when it comes time to play Punjabi music, or a James Brown record, or jazz.\n\nIt’s a constant source of frustration for me when sequencing horns. I always have to cheat it. \n\nIt’s no surprise that sampled libraries are going to lack expression but I think we really lose something in our music when we write *with* sample libraries out of necessity instead of going the extra mile to get players in the room who get it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123010538671194212",
    "author": "Deleted User",
    "date": "2023-06-26",
    "content": "With footsteps DIY is a way to go. It’s hard to find samples that match all the circumstances and with wrong match it will throw off the immersion. but also, realistically- getting all the right shoes and correct surfaces might be a bit costly\n\nwith ambience make sure you use the time appropriate ones, don’t put crickets in the morning for example. \n\nFor samples try prosoundeffects \n\nsplice foleys and ambience tends to be over baked",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126649080379084820",
    "author": "Will Melones",
    "date": "2023-07-06",
    "content": "I’d start by putting yourself in the position of the user. You’re a producer, right? What do you wish a sample or sample pack could offer you that you may not already have? What experiences have you had that were positive, and what experiences could you improve upon? Then make yours in such a way that you’re excited to share it with your peers because you know it’s designed to be useable.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1136044449303122060",
    "author": "JakeTB",
    "date": "2023-08-01",
    "content": "I like the snare bottom... 🙃 but I'm not as good as the Cians or Beckleys around here.\n\nIf (when) having to sample replace a snare, having the bottom mic in just a little can help things not sound too sample-y",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1140002806875574312",
    "author": "Rob Domos",
    "date": "2023-08-12",
    "content": "Bit depth truncation is not the same thing as down sampling. Sample rate shouldn’t really play a role in a conversation about bit depth",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171631834728251442",
    "author": "gatewoodsensei",
    "date": "2023-11-07",
    "content": "Say less:\nWaves rComp\nAntares Efx\nAntares Throat (pause)\nKontakt\nSerum\nOmnisphere\nSeventh Heaven\nPro Q3\nBattery 4 (if i had no choice)\nC4\n\nBonus\nAll my samples lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171633167157960815",
    "author": "gatewoodsensei",
    "date": "2023-11-07",
    "content": "The symphony stuff, damage, analog dreams, and emotive strings off the top of my head. Sometimes the kontakt standard library gets usage when I’m layering string parts.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174042988205330543",
    "author": "NoahNeedleman",
    "date": "2023-11-14",
    "content": "When sharing files among producers I always put bit & sample rate and tempo in the file name. Feels redundant but saves answering questions sometimes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174798798615224376",
    "author": "mariano",
    "date": "2023-11-16",
    "content": "had a quick try with the Spitfire BBC orchestra discovery, which is free, and it does a really good job already!!!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179918374675939410",
    "author": "gatewoodsensei",
    "date": "2023-11-30",
    "content": "I’m not sure if this’ll help, but I tend to go with whatever hits me at the time. If it’s a melody, I’ll sing it, mumble words, and allow the music to form around that idea. If it’s lyrics, then i grab a guitar or sit in front of the keyboard and play the accompaniment. Or if I’m in front of my computer, and melody line hits, I’ll play the melody, or chords and allow it to loop while I write. So I don’t necessarily balance, because to me that means I’m shutting part of my creativity off i order to allow the other part to flow, and more often than not, that kills the creative flow. \n\nSo don’t try to balance anything. Whatever you feel, go with that and allow your creativity to flow.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203267292826439700",
    "author": "Zack Hames",
    "date": "2024-02-03",
    "content": "-I use 95% hardware synthesizers and drum machines. I truly cannot dig all software for synthesis.\n-full on drum recording for most things. Like 16 mics and hardware reverb full on. \n\nVery averse to loops for a lot of the same reasons @LAPhill said. I also don’t love Kontakt because everything is so pre-mixed sounding, kinda like @cianriordan referred to; I like to do the polish myself. Sampletank is really good for solid, mostly raw sounding real samples/instrument plugs.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214235904781062194",
    "author": "GaspardMurph",
    "date": "2024-03-04",
    "content": "Remember that if you have one shot samples in the session that are placed on the grid and not overlapping, you can simply put the track in samples and it will follow tempo",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237800007999160342",
    "author": "LAPhill",
    "date": "2024-05-08",
    "content": "There are a couple ways to think about this - do you want maximally realistic results with less control over the actual notes, or do you want to make it sound as good as possible while still maintaining compositional ownership? I pretty much always fall into the latter.\n\nAs long as you have a decent library with enough round robins, short string lines are one of the easiest things to make sound good. I haven't used BBCSO, but I know it's light on variations in exchange for having a full set of orchestral instruments and articulations at a budget price. Any of Spitfire's main libraries would be fine, or Cinematic Studio Strings, Orchestral Tools.. pretty much anything should do the job as long as it has enough round robins and hopefully at least 4 dynamic layers.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239072207028621332",
    "author": "NoahNeedleman",
    "date": "2024-05-11",
    "content": "I feel like I’m always on the hunt for this. Try splice?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239237591140663306",
    "author": "Josh",
    "date": "2024-05-12",
    "content": "There’s definitely something magic about the pitch shifting a sampler does vs using a synth. Also when I discovered the SP1200 kits from samples from mars my life was changed",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239238889919746079",
    "author": "montrose recording",
    "date": "2024-05-12",
    "content": "sweet.  my pt sampler game has been woeful.   maybe ill just use sky keys tho lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239256920146317352",
    "author": "BatMeckley",
    "date": "2024-05-12",
    "content": "A lot of that was taking off the “time correction” bit of pitch shifting and having your 808’s tuned by essentially adjusting the sample rate, almost like a varispeed.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239264634192658624",
    "author": "Adam Thein",
    "date": "2024-05-12",
    "content": "Got turned onto it by John Rooney, it's sort of a very stripped down Ableton sampler, drag and drop and it'll prompt you to slice the transients across the pads, and I think it's free so it's just a no-frills plugin to load some samples and chop up some loops fast",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241534270410068119",
    "author": "jonmatteson",
    "date": "2024-05-18",
    "content": "I don’t but have had good luck with logics built in auto sampler for this then drag the exs file into ableton to create a sampler instrument.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241764432808509460",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Also just to be clear, I don’t think splice loops are cheating, lazy, etc. I just think if you’re arranging splice loops and not changing anything, then it’s kinda whack that whoever made the loops isn’t getting anything from it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241766989412831242",
    "author": "Bryan DiMaio",
    "date": "2024-05-19",
    "content": "If you can make something compelling out of ingredients in front of you, does it lessen the art? Listen to a lot of old school hip-hop, it's mostly rapping over a sample or combination of samples of released music but the art is still art",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241777469875556433",
    "author": "Rollmottle",
    "date": "2024-05-19",
    "content": "Is there an inherent judgement being made here that the Splice loop song was “easier” to make and therefore less valid than other songs that are mechanically “harder” to make. Not labored over = not enough struggle and therefore less good?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241823109603131402",
    "author": "spectrummasters",
    "date": "2024-05-19",
    "content": "The splice loop might not have the allure of a crate digging vinyl junkie, but it’s pretty much exactly the same process as dr Dre used",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1251950955671322736",
    "author": "Slow Hand",
    "date": "2024-06-16",
    "content": "Yup. A pretty simple square wave will get you 90% of the way there. The demo Anthony posted also has a touch of bit reduction (start at 8 bit) that's bringing up the noise level and giving it that Casio / Speak N Spell texture. Maybe some sample reduction too to give you a little gritty aliasing. Hard to say cause I'm listening on laptop speakers right now.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255894544604594277",
    "author": "hyanrarvey",
    "date": "2024-06-27",
    "content": "Like what if you just found a great loop and a great drum beat and let song breathe and evolve",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255896516271538228",
    "author": "Adam Thein",
    "date": "2024-06-27",
    "content": "I'm also interested in if/how Oliver is getting paid for that.  I see on Genius he's credited for \"Sample Source\" but Julian Bunetta is credited for playing all the instruments.  I kind of assume they cleared it with Oliver as a courtesy/made a deal?  Always wondered about Splice loops and how it shakes out when a track hits that widely.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255906395895627858",
    "author": "cy (sigh)",
    "date": "2024-06-27",
    "content": "Melanie Charles (jazz / heavy hiphop influence)  is a good recent example. she put an album out on Verve a couple of years back. she's sampling /reinterpretating a bunch of classic songs written /performed by black women in jazz (all from the same label) . she uses 4 Roland SP samplers in her process on top of live instruments. there's is very intentional use of sound bites too. all to guide the listener through specific narratives. \n\nit's a different approach/intention  in captivating a listener in those ways than most chart topping music. both valid and both necessary imo. but very different",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264496681144156192",
    "author": "Ross Fortune",
    "date": "2024-07-21",
    "content": "I use splice bridge in Ableton. The time stretching does often sound different in splice to when it’s dropped in, but that’s to be expected. I always attributed perceived tonal differences to simple gain mismatch, but didn’t look too deep.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264498286778384436",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-07-21",
    "content": "You can drag in with the splice applied timestretch applied as well I believe! If I remember correctly there's like a document icon down in the player you can drag from\n\nRe: alternative to splice, I got nothin, but in Cubase I use Media Bay which is great and tightly integrated",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264498838975283231",
    "author": "Ross Fortune",
    "date": "2024-07-21",
    "content": "Oh that’s rad! Sometimes the groove feels right however splice is doing it, then falls apart with Ableton modes. Thanks for the tip.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265087373365219340",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-07-22",
    "content": "For anderson Pak stuff you have Make Pop Music's \"Anderson Pack\". On splice for live drums, \"that sound\" is very good and has lots",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270484181528608789",
    "author": "Josh",
    "date": "2024-08-06",
    "content": "Superior and addictive are great! GGD has great offerings for all genres. As far as importing your own, are you talking about multi sampled or one shots? Trigger comes to mind for both of those and can be fed midi",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1272483249943478315",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-08-12",
    "content": "I always felt I got pretty perfect results with vocalign going section by section with Audiosuite, same with Revoice Pro. Sometimes you get some artifacts, but I'd just save the original take and splice in the glitchy word if needed. What settings are you using? I haven't used it in a hot minute and prefer Melodyne Studio multi-edit, perhaps it's gotten worse?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280283345799876689",
    "author": "Rollmottle",
    "date": "2024-09-02",
    "content": "Ableton Simpler and Sampler are very powerful",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283894577606164501",
    "author": "Slow Hand",
    "date": "2024-09-12",
    "content": "@kylem Yeah, Keyscape is an excellent choice with some truly excellent sampled instruments, though a bit of an up-front investment ($400).\n\nIn fact, I just spent the last fifteen minutes practicing piano with Keyscape before taking a break here on the DIscord. It must be a decade old at this point, but Spectrasonics do a good job at supporting it. They're constantly patching it and a few months ago they added a fully-sampled felt piano instrument that sounds excellent.\n\nKontakt wouldn't be a bad investment either, since it's the backbone of NI's entire business model at this point, it comes with a sizeable sample library (not just piano), and new sample instruments are constantly being developed for the platform.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283900074237231215",
    "author": "Spencer Broschard",
    "date": "2024-09-12",
    "content": "Pianobook has some amazing free kontakt sample libraries. For piano, this guy's Yamaha and NY Steinway sound incredible: https://www.pianobook.co.uk/profile/dore_m/\n\nAlso the UAD Ravel piano is pretty nice",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298925962745876570",
    "author": "Ross Fortune",
    "date": "2024-10-24",
    "content": "Nice. I think my chain was Kontakt The Giant with the tone all the way to “Hard”, Taj Mahal reverb setting built into the piano > pro-Q > cla-76 (or maybe faraday?) > OTT",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312948441701421186",
    "author": "Nomograph Mastering",
    "date": "2024-12-01",
    "content": "I had a day dream once where all samples were sent to different monitors, speakers and guitar amps. Positioned as per a drum kit and then mic’d up as normal in a good room",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312980590404042774",
    "author": "Will Pragnell",
    "date": "2024-12-01",
    "content": "this exists! i can’t remember the name of it though. it’s marketed as an AI driven sample generation tool but pretty sure it has an option where you give it a seed sample and it generates variations. will try to find it when i’m back at a computer",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315223124756660316",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-12-07",
    "content": "I have Kontakt 7 and Kontakt 8, but 8 was buggy as hell as well. It would load in a sample, and then delete it almost immediately after",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315351378821906473",
    "author": "andrew_yv",
    "date": "2024-12-08",
    "content": "Kontakt, but mostly just for some of the excellent third party libraries. I find very few of NI’s own Kontakt instruments to be satisfactory except to set way back in a track for vibe. Most of their samples just don’t hold up under the microscope and the patches (hilariously) aren’t programmed as well as good third party ones (especially when it comes to orchestral stuff)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315351765561905192",
    "author": "vostral",
    "date": "2024-12-08",
    "content": "Essentially Spectrasonics & Kontakt cover a lot of stuff i've been producing. These two are my go-to tools for every song making. Lately i've started to jam with Roland &u-he stuff, their plugins are infinitely better than Arturia emulations IMO.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1338618741696762008",
    "author": "Slow Hand",
    "date": "2025-02-10",
    "content": "Funny that both the Crazy Town and Spacehog songs are built around samples. Maybe an unspoken lesson here is to sample more often 😄.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341878787436187739",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-02-19",
    "content": "I'm assuming since Splice used to be used mostly my hip hop and edm people, they didn't rly feel a need to add a time signature option. but it's long overdue imo",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341913298601377914",
    "author": "onanisland",
    "date": "2025-02-19",
    "content": "I just search for drum packs / one shots 😅",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1380852631098097717",
    "author": "Brian Reynolds",
    "date": "2025-06-07",
    "content": "The swing and changing of the velocity of midi hits, will help the feel and groove of a sample pieced together drum kit.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392215976531071116",
    "author": "Rollmottle",
    "date": "2025-07-08",
    "content": "As others have said, recreating a beat you like is the school you need to go to. One of my favorite beats of all time is Fleetwood Mac's \"Hypnotized\" which is a swingy, triplet unchanging thing that is effectively a drum loop through the song, except Mick Fleetwood plays it. I recreated it using a sample pack of Mick Fleetwood's and turned it into a song after serious finagling, especially in the context of grid music. The insight into accent, velocity, swing, where in the grid things hit (or don't), which specific hits matter and how dropping just one or two key hits in a repetitive pattern can shift the groove entirely. It also tests your chops for figuring out choke groups, how to make closed and open hi hats sound \"real\" (if that's your goal) so on and so forth. I also love recreating a beat as a way in when musical inspiration may be lacking.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396235549911552191",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": "I want the mpc sound . Renaming the wav file to match the FAT12 mpc system is long . The transfer of files takes time in itself. \nI just resample everything into the mpc out of my daw system as audio and build up the program . You want the sound of the mpc right ? A major part of it is it’s a/d",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411888700207665314",
    "author": "Slow Hand",
    "date": "2025-08-31",
    "content": "A few things:\n\n1. What kind of samples are we talking about syncing here? Short samples like drums and loops? Or heavy sampled instruments like a piano/string library? Or both? \n\n2. I think the equivalent syncing feature in Dropbox would be \"make available offline\". If you right click a folder and \"make available offline\" it will continually update when it receives uploads from the other computer. Have you used that before? It doesn't have the lightning speed of a local network/ethernet connection, but if you can wait a few minutes it's good.\n\n3. I assume these are Ableton sessions. Do you ever use the 'collect all and save' feature when saving sessions? It will gather every external sample (but not sampled instrument libraries) and save them to the project folder, which will save you the trouble of having to point your Ableton session to any external directory, because it will all be in the project folder. Very good when it comes to archiving sessions and opening them up years later.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417226054732611634",
    "author": "Brian Reynolds",
    "date": "2025-09-15",
    "content": "Playing to a drum loop of some kind is my catalyst.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417228431803810043",
    "author": "Rollmottle",
    "date": "2025-09-15",
    "content": "- Random MIDI generator into a Scale filter\n- Same as above but add an Arpeggiator \n- Same as above but replace the Arpeggiator with a Chord filter \n- Mangle a drum loop\n- Mangle any loop\n-  Create a drum loop with differently timed Arpeggiators and midi generators controlling a  drum machine/drum rack \n- Modular synth patches",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453656576500961364",
    "author": "oaklandmatt",
    "date": "2025-12-24",
    "content": "It sounds like you just need a lot of practice. You just gotta try things a lot of different ways. Trying making melodies and chords and then producing around them. Try writing and singing hooks yourself. Try chopping up samples (a capellas, your own vocals, whatever) and making hooks out of those.\n\nTry lots of different approaches. That will help you more than \"solving\" it one particular way",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1473402967188177027",
    "author": "austenballard",
    "date": "2026-02-17",
    "content": "There are two sides to that though\n\nI am grateful that I only ever had to splice tape in school and that I don't need a six-seven figure analog studio and the Wrecking Crew to make a track\n\ndrag-and-drop samples, vocal comping, time stretching... these are things people who came before me spent days or weeks doing. VST synthesizers! Kontakt! \n\nwe can do more, faster, because we don't have to muddle through every little thing. but this also means we have an obligation to learn how to combine the things that have become easy into new challenges and adventures\n\nin 50ish years we went from Sgt Pepper to Skrillex because of this\n\nit's the drive that humans who want to achieve and accomplish and push beyond possess",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937556522962157608",
    "author": "colinrowe",
    "date": "2022-01-30",
    "content": "Preach 🙌🏽 Thought about tryin the spitfire stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937612070579494932",
    "author": "jonmatteson",
    "date": "2022-01-30",
    "content": "I’m really digging ableton’s upright by spitfire for most stuff.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "937643733481050113",
    "author": "Zakhiggins",
    "date": "2022-01-31",
    "content": "Keyscape is great, but if you want a really natural, real piano sound, basically anything in the spitfire libraries is insanely good",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "939504650615414845",
    "author": "Maxim",
    "date": "2022-02-05",
    "content": "Try layering some pitched TR 808 sounds with Timbaland-esque vocal samples/beatboxing. Throw an acoustic kick underneath and find a rimshot that has the character you like and play with Valhallavintageverb or Tsar. Maybe download some free Reddit sample packs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941099860294250546",
    "author": "Maxim",
    "date": "2022-02-09",
    "content": "Sounds like you’re looking for density without it being cluttered or overproduced. \n\nUsually “noise” (not literally but parts of the groove that you mainly feel but don’t make out specifically like you would a kick and snare or hi hat) serves this purpose for me. Elements which if muted would leave you feeling like something is missing but you can’t necessarily make them out when in. \n\nI guess this could be anything from a few percussion loops (maybe panned/verb with no pre-delay or less high end to place them at the back of the mix) to a subtle vocal or foley sample playing one note throughout the groove. \n\nLayering to me is part of this but my intent with it is usually to create a sound or get more out of an element (like layering the attack of a snap with a clap for a different transient / texture). But this doesn’t always add to “fullness” in my mind. It just makes one element better or more interesting. \n\nMaybe start with the loops and foley. Splice Bridge makes testing things really easy too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "944806908093681704",
    "author": "longstoryshort",
    "date": "2022-02-19",
    "content": "That particular hit is from one of those older romplers. I'm sure digging in sample folders. Fairlight Orch5 stab maybe. Vsynth D50 memory card. Korg m1. The Zero G data file CDs. Roland SC 88 pro",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "949055944845848627",
    "author": "Deleted User",
    "date": "2022-03-03",
    "content": "the controller is called continuum. I believe it is an mpe (midi polyphonic expressions) device. I don’t know much about kyma but i would look into physical modeling because this is what the sound generation is based on. A lot of physical modeling is heavily based on delay lines, so I’d start there. Modal synthesis is also another cool concept where you would feed an impulse sample into a bank of parallel bandpass filters (very narrow q- which is also constructed with delay lines fundamentally). The idea is feedback and resonance from the filters would emulate acoustic modes. \n\nYou can emulate this with fairly cheap stuff like leap motion, I’ve done a different project (something much simpler) with leap motion for gesture controlled music concrète. But you can definitely use the gestures to do the same thing with physical modeling. I’d be down to work on something together if you’re interested!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "949165135182852097",
    "author": "Deleted User",
    "date": "2022-03-03",
    "content": "I believe these are sample based. And the physical world aspect comes from the modeling DSP.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "965743741639991348",
    "author": "1ggy",
    "date": "2022-04-18",
    "content": "What are your guys go to production techniques for chords/melodies if you're not a pro on keys or guitar? Mine for example is using Scaler as a midi instrument, finding a cool progression or pattern and then messing with the midi. Or, finding a cool sounding melody in Splice and then using Pitchmap and/or melodyine to get it in the correct key and chopping it up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "971052207636119552",
    "author": "jantrit",
    "date": "2022-05-03",
    "content": "Tend to either do it manually by chopping and pasting on the grid. Or using an sp404!! This is probably the quickest and most fluid/inspiring and the onboard effects are sick",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "971451685018927175",
    "author": "delwin",
    "date": "2022-05-04",
    "content": "I do this a lot!\n\nIn Ableton, you have soooo many options. Most often I put the sample on an Ableton Simpler and am able to slice / pitch / etc really fluidly — record that, and then edit by hand. This is my workflow for 90% of vocal chops. If it’s really simple I’ll do it by hand but I find I get more musical results if I can “play” the chop. \n\nThere’s also Buffer Shuffler and Beat Repeat in Ableton which can be fun and unpredictable. \n\nThe Glitch Machines plugins are also really nice if you’re going for something a bit crazy (two of them are free and very good). I don’t fully understand them yet so I just throw them on when I want something wacky to happen. \n\nAnd I’ll also second stutter edit — very fun for “playing” chops live too, and editing presets isn’t too hard either.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982393317604077578",
    "author": "Slow Hand",
    "date": "2022-06-03",
    "content": "If you want literal marimbas/plucks I'd reach for a Kontakt sample library. If you're talking about synthesized pluck sounds, post an audio example to help us understand the sound you're looking for.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982393590753923072",
    "author": "oaklandmatt",
    "date": "2022-06-03",
    "content": "yes to organic sounds in kontakt like bradley said. also check out chromaphone. super underrated pluck plugin",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982394936827707402",
    "author": "longstoryshort",
    "date": "2022-06-03",
    "content": "word, i usually go thatroute w kontakt, everything feels a lil cinematic but ill keep digging.  chromaphone is fire also, good rec, ill try",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983695111391154176",
    "author": "rileybrewer",
    "date": "2022-06-07",
    "content": "thinking of buying kontakt! anyone have any free/inexpensive sample library recommendations??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983780383244046407",
    "author": "sukhuno",
    "date": "2022-06-07",
    "content": "Started by Christian Henson, co founder of spitfire audio",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983792967917649962",
    "author": "rse",
    "date": "2022-06-07",
    "content": "Do they use Kontakt? I thought they used a different sampler?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983793170766778418",
    "author": "rse",
    "date": "2022-06-07",
    "content": "Oh apparently they have stuff for Kontakt too, my bad",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983793891398549614",
    "author": "rse",
    "date": "2022-06-07",
    "content": "The other one they use is \"decent sampler\", I've heard good things about it and it's completely free",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984016518809518100",
    "author": "rileybrewer",
    "date": "2022-06-08",
    "content": "True, Ive used a bunch of their decent sampler stuff (a bit hit and miss) forgot they have loads of kontakt libraries as well!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984076944092045423",
    "author": "rileybrewer",
    "date": "2022-06-08",
    "content": "you guys are really trying your best to talk me out of buying kontakt 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984109846578200646",
    "author": "rileybrewer",
    "date": "2022-06-08",
    "content": "yeah im just moving interstate and leaving my studio setup so thinking the extra sample instruments will be more valuable now, although always hard to tell how much you'll use it. I could probably make do with decent sampler tbh",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986509697395863642",
    "author": "itaylerner",
    "date": "2022-06-14",
    "content": "Don’t own trillian but have used it several times and it’s so great for fat expensive sounding bass sounds - one of the best imo. Keyscape is incredible too but I haven’t found it doing anything that i couldn’t get from a kontakt library",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986718704869990410",
    "author": "jonmatteson",
    "date": "2022-06-15",
    "content": "When you guys make sample packs for yourself, how do you name/categorize them? I’ve been trying to put some of my favorite things in folders but am curious as to how other producers are doing this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993882997189263520",
    "author": "delwin",
    "date": "2022-07-05",
    "content": "any tips on making Kontakt horns & strings, drum samples, bass guitar, etc. sound like the 70s? working on a period piece for a client. I'm usually doing more synthpop / electro pop but this one they want to sound like an early 70s disco piece. Humanizing the horns & strings is particularly difficult.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "993908595227898016",
    "author": "Will Melones",
    "date": "2022-07-05",
    "content": "I like to take those sample instruments and slap a convolution reverb right on the channel or bus. Really short studio-style room reflections. I think something about that fools the ear into hearing real players…even though there would have been carpet on all the walls in the ‘70s. Kontakt instruments seem to either be bone dry with exaggerated proximity effect or drenched in long hall reverb for a cinematic application.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994493308409753621",
    "author": "Deleted User",
    "date": "2022-07-06",
    "content": "On that note, does anybody know any sick free sample packs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994680320588783656",
    "author": "ALXCPH",
    "date": "2022-07-07",
    "content": "I’ll use midi for synths, sample based keys and 808’s tho!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "994720640290525335",
    "author": "Zack Hames",
    "date": "2022-07-07",
    "content": "I’ve yet to find a sampler plugin that is really fast and easy to use for me - Somehow using an AKAI MPC is easily the best and fastest way for me to use any electronic drum elements.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "995681358884118579",
    "author": "KushKadett",
    "date": "2022-07-10",
    "content": "Or do i need to export the chops to a sampler and go from there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996107207294861404",
    "author": "Josh",
    "date": "2022-07-11",
    "content": "I use pigments a lot as a sampler with way more options as far as sound design goes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "996666201172348988",
    "author": "prodbyobseen",
    "date": "2022-07-12",
    "content": "Legends, what’s everyone’s backup strategy? I just upgraded from a 2012 Mac Pro to a max studio and don’t have access to Sata drives. Have been in chats with splice about project backups (why can’t these be organised into folders like my prod disk RIP) but now looking into backblaze. Thoughts?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "997780593758703636",
    "author": "prodbyobseen",
    "date": "2022-07-16",
    "content": "Yes! Essentially did this so a system drive, one project drive, sample drive and an archive drive. Each drive is backup to a physical disk and cloud (backbaze) - legends!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "998797383745949906",
    "author": "1ggy",
    "date": "2022-07-18",
    "content": "Yep I use CLA bass too but end up having to layer with a bunch of other stuff. Basically what I’m trying to get to is the sound of the scarbee rickenbacker kontakt library sound. Haven’t been able to crack that with ITB tools.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000201537085259806",
    "author": "RUDI",
    "date": "2022-07-22",
    "content": "Honestly i wish you could use the splice app with your own samples n sub groups. That’d be a dope update",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1002315087001964714",
    "author": "cy (sigh)",
    "date": "2022-07-28",
    "content": "my personal stash is mostly divided into \n1. loops & parts \nmostly from productions that never see the light of day or I wasn't inspired enough to finish in the moment. each having their own subfoler w key and bpm on them.\nthis folder also includes melodic things usually\n\n2. kits\nI set time aside specifically to do sound design so those  get made into a kit usually. this includes one shots, loops and any FX I mightve made \n\n3. one shots \nany one shot sample I start using regularly enough ends up here eventually. in subfolders (kick. snare and claps, hats and cymbals, etc) \n\nbesides the one shots from design sessions I tend to use difference spice name and food items to help me distinguish the sounds that might go together (obviously this'll vary per person) ex. \"snare matcha\" and \"snare anís \" will usually work with\"kick milky\" and \"kick cocoa\" and so on. lol\n\noh if pull from alrwady mixed stuff it'll usually go in the one shots with a name that reminds me of the track it's from.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1002781899820912661",
    "author": "Tyler Graham",
    "date": "2022-07-29",
    "content": "I think its a really good starting point. Committing it down and chopping / processing it further can lead you to some really cool drum grooves. Esp slicing the loop and playing it as midi",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1009646594154573944",
    "author": "Zeuswayn3",
    "date": "2022-08-17",
    "content": "I have superior drummer 3 with a lot of expansions. It does a really great job, but im trying to sell the licenses to fund a real drum kit. Feel free to DM me if you’re interested or have any questions!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014578119841169408",
    "author": "Jeremy Klein",
    "date": "2022-08-31",
    "content": "hahahaha i just mixed a rock/metal-ish record that had \"live\" drums, but the only thing real was the overheads. Everything else in the stems was completely 100% sample replaced. It actually sounded great lol. (for that sound)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014603468960444456",
    "author": "ehutton21",
    "date": "2022-08-31",
    "content": "Yeah, drummers still get work for those kinda records if the budget is big enough, although I think splice + sample replacement and midi has made that somewhat enhanced/fabricated too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014874746539753502",
    "author": "gatewoodsensei",
    "date": "2022-09-01",
    "content": "Y'all... Fucking Waves Cr8 and Cosmos is a gamechanger. Best sample browser I've ever used.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1024744603083083787",
    "author": "TheBlur",
    "date": "2022-09-28",
    "content": "Yoooooo where’s sample pack producers? Anyone in here making packs on the reg? Would love to pick your brains a bit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030763209143103589",
    "author": "satishkumar.26c",
    "date": "2022-10-15",
    "content": "DRUMS FROM POPULAR PRODUCERS\n\nA drum kit that has only the best sounds from top billboard genre/producers (should I drop ) ?\n\nYou will find sounds used by : Louis bell,ilya Salmanzadeh,circkut,josh fountain,stargate,benny blanco,ian Kirkpatrick,dmile85,dr Luke,max martin crew(wolf cousin),Charlie puth,yeti… This list goes on…\n\nEverything that you will not find in lunch77 pack😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030827979825233950",
    "author": "satishkumar.26c",
    "date": "2022-10-15",
    "content": "@all shared the drum kit on the thread have fun 🙏",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031605520269836400",
    "author": "Johnny I",
    "date": "2022-10-17",
    "content": "Recommendations for a piano sample library for a convincible grand piano that works in a sparse vocal/piano arrangement? Kontakt, or Keyscape? I have access to a real baby grand at a friends house, but it needs some repair (some mechanical noises) and tuning and not sure if it’s worth the hassle.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031609560613527592",
    "author": "ALXCPH",
    "date": "2022-10-17",
    "content": "everything Spitfire makes is pretty great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031609797759488080",
    "author": "BatMeckley",
    "date": "2022-10-17",
    "content": "Noire fantastic too and more versatile than the spitfire free stuff. Just takes more dialing in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031610284353273987",
    "author": "ALXCPH",
    "date": "2022-10-17",
    "content": "did you update to NI 14 yet? i'm still on 13. The 40 keys and that vocal sample plugin look cool, but also like something that will sound super dated in about 5 minutes...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031611501380898816",
    "author": "Johnny I",
    "date": "2022-10-17",
    "content": "That would be great! Having a good upright would be nice as well. The Gentleman and The Grandeur seem like solid options, along with Noire. Any thoughts on Keyscape compared to NI and Spitfire?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031612950991093840",
    "author": "ALXCPH",
    "date": "2022-10-17",
    "content": "This might get me banned of this discord, But i've in certain productions actually prefered the stock ableton piano, to kontakt, spitfire and arturia when A/B ing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031745138122305607",
    "author": "NoahNeedleman",
    "date": "2022-10-17",
    "content": "I probably just use the kontakt pianos most",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031746076409086002",
    "author": "Will Melones",
    "date": "2022-10-17",
    "content": "I’m most definitely not saying you’re wrong. It would make sense that a huge sampler like keyscape might fall behind and get stuck more often than a small one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032013171168383066",
    "author": "GaspardMurph",
    "date": "2022-10-18",
    "content": "Ok here we go! What is everyone methodology for keeping samples organized ? I’m old school and do not use a sampler plugin so I’m basically dragging and dropping wave files into pro tools. If I want something I like I’m searching spotlight or important track data from an old session. It’s complete chaos + I’m planning on using Ableton more and more for sketching and I really hate having all those duplicate .asd files 😦 how do ya’ll do it ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033442214841426040",
    "author": "samvalentine",
    "date": "2022-10-22",
    "content": "I like it for chopping samples",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033882394794655894",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "I have gone from mostly working around hip hop to actually being able to put my theory knowledge to more use with alternative material, esp synth pop, so like I’m kinda re-assessing what I have on deck as a producer.  Any recommendations on fun items to demo in the synth or sampler world that might be useful would be a massive plug",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033925945800802335",
    "author": "samvalentine",
    "date": "2022-10-23",
    "content": "What are some other popular samplers? The push talk above made me realize all I use my push for is sampling and maybe it makes more sense to swap it for a dedicated sampler",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033957402279686205",
    "author": "ehutton21",
    "date": "2022-10-23",
    "content": "Some of my workplace is about the fact that I work best when I’m steady, not when I’m trying to blaze through things, but I would like to be able to articulate my instrumental ideas and my sample based skeletons quickly and naturally",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034178592420143205",
    "author": "1ggy",
    "date": "2022-10-24",
    "content": "Mostly describing an op-1 here. It has a radio tuner you can sample directly! And a built in mic for easy field recordings.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047265760491343882",
    "author": "Adam Thein",
    "date": "2022-11-29",
    "content": "Anyone have a good tip for a solid upright bass kontakt library?\n\nFollow up: Pulled the trigger on Orange Tree Corebass, did the trick for me!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047656140328149052",
    "author": "louisvie",
    "date": "2022-11-30",
    "content": "I've got a fun quizz for y'all.\n\nDo you hear a change happening at some point in this loop ? If you do, what does it sound like ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050121435412172911",
    "author": "oaklandmatt",
    "date": "2022-12-07",
    "content": "What are y'all liking for drum plugins/ libraries these days. I've got plenty of samples and loops, and I've got all the kontakt drum kits (which I use a lot and are great). But I want some new shit. Addictive Drums? Superior Drummer? Slate?\n\nI really want live drums. I can make shit sound hard and programmed, so I'm not looking for pristine clean. Apologies to live drummers but I want those live drummer sounds in various sonic configurations.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050130312325234789",
    "author": "Deleted User",
    "date": "2022-12-07",
    "content": "I put them in sampler and have the instrument loaded up in my template. They don't really have separated room samples though. It's blended in. \n\nRight now, I'm kind of looking for samples with just room so I can mix them in even though it doesn't match up with the dry sample.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050160151614730301",
    "author": "Zakhiggins",
    "date": "2022-12-07",
    "content": "@oaklandmatt youd be surprised what great live drums sounds you find on splice if you search under \"jazz\" \"folk\" or \"rock\" genres",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050163467379814411",
    "author": "Zakhiggins",
    "date": "2022-12-07",
    "content": "I think there's a knack to searching on splice to be honest, often when you seach for jazz/folk snares, it doesn't give you jazz/folk snares, but a particular kind of snare that's something else, and once you figure out what that is, I think it's kinda useful. That's been the case for me anyway. Just make sure you only use it for one shots, or else you'll be chasing your tail.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050164462692352090",
    "author": "oaklandmatt",
    "date": "2022-12-07",
    "content": "Yeah splice has some great stuff. I'm looking for playable kits",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050204220260888666",
    "author": "baileybonds",
    "date": "2022-12-07",
    "content": "I’ve been having a lot of fun with kits by PastToFutureSamples. They are kontakt instruments with nice little GUIs. Super playable and they sound great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050814277814067240",
    "author": "Fatherbobbytownsend",
    "date": "2022-12-09",
    "content": "My housemate happens to be my favourite drummer and we mic’d up a drum kit in the living room so I’m kinda spoiled there though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050899548899377272",
    "author": "hyanrarvey",
    "date": "2022-12-09",
    "content": "If you end up giving that sample pack ago let me know how it works for you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053738018760044576",
    "author": "Adam Thein",
    "date": "2022-12-17",
    "content": "Yeah I'm looking for something that can just sit in a pocket in a mix with a lot of other things going on.  Session strings has been the go to for this for a long time but I just spot the fakeness a mile away now.\n\nWith spitfire Chamber can you split it out into sections of each instrument if you want to get real nerdy on it?  Or is it kind of an all-in-one patch?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053738361157849119",
    "author": "Adam Thein",
    "date": "2022-12-17",
    "content": "I'll check out Spitfire's stuff - I really enjoy their BBC freebie they gave out a couple years ago and the labs stuff, they do great.  Just looking for something that sounds like it was in a dry room and less hall",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055323064612696134",
    "author": "austenballard",
    "date": "2022-12-21",
    "content": "the reason i like using resonator specifically is because it uses the spectral content of what's already in the sample rather than layering another tone over the sample, which i have experimented with. i guess i'm mainly wondering if anybody else has done anything like this and knows of a quick and dirty way to do it in PT, Logic or other DAWs that don't have the same sound design capabilities as Ableton",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055331394315890778",
    "author": "Slow Hand",
    "date": "2022-12-21",
    "content": "Ah, thought of another one: Do the old sampler trick where you create an ultra-short, tuned, loop. So you'll get the transient smack up front and then the loop brackets ring out at a pitched tone from the ultra-fast repetitions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055334064380444742",
    "author": "Slow Hand",
    "date": "2022-12-21",
    "content": "It's really simple. It's basically creating a loop within a sampler and reducing the loop length to such a small window of time that the looped audio is perceived as a pitch. You \"tune\" it by adjusting the loop length shorter or longer.\n\nI think the biggest issue is that vanilla samplers don't tend to give you very fine control unless they're built for sound design. Their loop length parameter will often go from 5 ms - 5000 ms, when what you really need is a loop in the 1 ms - 100 ms range.\n\nSo it might involve a custom-built device in *Reaktor* or something equivalent.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055340811706970213",
    "author": "Deleted User",
    "date": "2022-12-21",
    "content": "All of these methods suggested will yield in different results. \n\nResonators are made from delay using feedback to create tones. So you may need to resample to kill sustains - or not if you want it to have lengthiness. If you are going for SOPHIE kind of sound then you'd probably keep the feedback. \n\nBooms (filter resonance) are similar mechanisms but less tonal unless you turn up the feedback a lot more - it will certainly be more natural sounding as opposed to comb-filtery sound. \n\nLayering will give more focused pitch while maintaining the integrity of the layered sample sound, you would probably have the most control this way. \n\nVocoder will have inherently baked sound because of the synthesis mechanism, it can be desirable or not depending on the scenario. \n\nWith sampler looping, you will get grainier tail - dialing in the decay is necessary if you want the sound to be percussive because it will just continue sustaining. You can create pads this way too!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055568609872724150",
    "author": "austenballard",
    "date": "2022-12-22",
    "content": "So this is the kick drum: I've set the frequency to the root note of the key the song is in (in this case C), low feedback so that it just adds a *hint* of tone, low pass filter, and then I'm using the envelope to control the dry/wet so the attack of the unfiltered sample happens before the tone comes in to avoid messing with the transient - these are for drums, after all",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1056253470765748254",
    "author": "gatewoodsensei",
    "date": "2022-12-24",
    "content": "Mr. Bill is a genius. \n\nWhat i like doing is creating “authentic-ish” type sounds by resynthesizing natural sounds. Flume does this a lot. Like taking a kontakt instrument, recording the midi to audio, and dragging that audio into serum. Smoothing out the shape in the settings, and cycling through the wav form with an lfo can produce some interesting results.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059437571266056212",
    "author": "Deleted User",
    "date": "2023-01-02",
    "content": "Playing it or you can take a drum loop with groove you like and map out a groove template. Playing it is much faster and more feel, but often times it will need editing unless you have great timing. If it’s something loose then I’d definitely go ahead and move each notes because quantizing even 50% is going to change the feel. This is real nerdy but when there’s a really good moment in groove, I use logic’s event editor to look at how many ticks they are off by and snap other notes to somewhere near. For example, if I liked the feel of it being 40 ticks late then I’m gonna move everything (or some select notes that are in the same spot of the groove cycle) to somewhere nearby. Ticks are tempo relative so 50 ticks in 90bpm is different than 50 ticks in 120bpm. But it’s still in same relative timeline, but it’s going to feel different in different tempos. \n\nIf you want it to groove like a drummer played it, best thing to do is play it in. You might end up quantizing or fixing velocity to al 127 later, but it’s going to be better than clicked in sequence if that is the style. Clicked in sequenced drums is its own groove too, you don’t want them having looseness so you quantize them all to 0 but you can still mess around with nudging them to be a bit behind or ahead of the grid.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061653682489405620",
    "author": "Adam Thein",
    "date": "2023-01-08",
    "content": "Alright folks, I'm trying to pare back any subscriptions I have that I can live without and Splice is on the chopping block.\n\nI have ~1200 credits built up but don't want to lose them.  I mostly use Splice to grab one shots of drums, transitional effects, percussion, etc.\n\nDoes anyone have some packs that they'd recommend for that type of stuff?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061719262345052240",
    "author": "cian riordan",
    "date": "2023-01-08",
    "content": "I've never used Splice but the business model seems wild (and very much in their favor).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061733220066017400",
    "author": "1ggy",
    "date": "2023-01-08",
    "content": "I’ve never seen that, is there one you can reference? Splice T&Cs legally should supersede anything written in those pack descriptions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061742953011355738",
    "author": "1ggy",
    "date": "2023-01-08",
    "content": "I’ve seen older packs on sounds.com that had royalty verbiage in there but that was a carryover from when people sold them on their own websites. So it might be just an old carryover on Splice as well that is superseded by Spices rules.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061764537356922900",
    "author": "Zack Hames",
    "date": "2023-01-08",
    "content": "@cian riordan should make a LWMR drum sample pack",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061764679946477608",
    "author": "Zack Hames",
    "date": "2023-01-08",
    "content": "But in all seriousness a collab LWMR sample pack would be actually cool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061781774201532416",
    "author": "ALXCPH",
    "date": "2023-01-08",
    "content": "Could very well be. I’m not the legally inclined 😇 but I know a lot of labels aren’t too fond of splice loops. And I’ve seen disputes from people using the same splice loop on different songs and it being a takedown nightmare. So I’d encourage anyone using them just to be a little weary when doing so",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062014381816295474",
    "author": "Ross Fortune",
    "date": "2023-01-09",
    "content": "I'm on the same tip as you, just dropped 4800 credits on whatever Oliver and KSHMR stuff I didn't already have.\n\nDo you (or anyone) know if you can still use the splice interface to navigate your library once you've unsubscribed? Their folder directory system makes sense, but without the app interface it'd make more sense to dump everything into one folder than to have to dive 5 levels to find the one Chromeo kick sample you downloaded for a session",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062015484448489483",
    "author": "Adam Thein",
    "date": "2023-01-09",
    "content": "Good question - I hadn’t even thought about that.  Right now I use their system but I should probably move the samples into my own directories and start using the Ableton file browser for searching.\n\nSince I only had about 1200 stashed up I have just been grabbing drum one shots for the most part so I don’t really need the Splice app with its tags.\n\nOne thing I really appreciate about Splice samples is the consistent file naming conventions!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062041400855773245",
    "author": "ALXCPH",
    "date": "2023-01-09",
    "content": "I think it’s more a “I want 100% live drums” thing. I can’t imagine a whole genre that has never used a form of loop in their drum sound.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062041492337725500",
    "author": "Will Melones",
    "date": "2023-01-09",
    "content": "There’s a way a practiced drummer can finesse a hi hat and play 8th notes with feel. I don’t want super robotic loops, and I’m personally not interested in trying to redesign that groove with MIDI programming. That’s just me though. A simple hat loop seems like a great way to add some humanity to a mostly programmed track. And if it’s recorded for a few bars live, you’re not hearing the same exact sound twice.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062050715029229668",
    "author": "Deleted User",
    "date": "2023-01-09",
    "content": "but you have a good point. have the loop “Segments” of different rhythms all ready to go then you have hihat feel of amazing drummers you can load in anytime quickly.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062330551450742875",
    "author": "Ross Fortune",
    "date": "2023-01-10",
    "content": "Woah. This is what I was doing 10 years ago with Addictive Drums 1 and it worked great.\n\nI think having Splice somehow caused me to just forget that. \n\nOddly I keep a Kontakt kit in my template for cymbals (third chorus in a rock song type stuff - 1/8 note bashing that doesn’t sound machine gun, with a gentle sidechain from the kick to simulate overhead compression), but I forgot about the hats approach. Thank you for the reminder!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062384388706414705",
    "author": "Ross Fortune",
    "date": "2023-01-10",
    "content": "That’s rad. I’ll occasionally throw a shaker loop in with a click to get things grooving alright, but never thought to have it templated with faders for different blends. Noice.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062385027645722744",
    "author": "NoahNeedleman",
    "date": "2023-01-10",
    "content": "Maybe a nashville thing- but getting the right feel shaker or perc loop going was key for me for a long time. Still a great hack for the less salty studio dogs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062492252150177813",
    "author": "Zakhiggins",
    "date": "2023-01-10",
    "content": "Funny you say this, I just made a sample pack of the drums you sent me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062501268670660669",
    "author": "Zack Hames",
    "date": "2023-01-10",
    "content": "Fuck yeah, you use the one shots i did?!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065697597588787281",
    "author": "ehutton21",
    "date": "2023-01-19",
    "content": "Especially when guys are sourcing unique sample material",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066806315822891128",
    "author": "ehutton21",
    "date": "2023-01-22",
    "content": "Okay so I’m doing a production, and a client sent me their demo with 707 drum kits and their admitted production and mix knowledge is limited",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066827343886286889",
    "author": "ehutton21",
    "date": "2023-01-22",
    "content": "Is that one splice ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070319647670407199",
    "author": "ALXCPH",
    "date": "2023-02-01",
    "content": "If you are using sampler/simpler you could just mess with the adsr settings",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070323426104979546",
    "author": "KushKadett",
    "date": "2023-02-01",
    "content": "true, but for some reason ableton doesnt allow you to change the envelope settings for each chop. What plugin sampler let's you do this? So far I only know of the MPC but that's a hardware sampler",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070334122922348685",
    "author": "KushKadett",
    "date": "2023-02-01",
    "content": "afaik even serato sample doesnt allow to do that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073016104366116874",
    "author": "gatewoodsensei",
    "date": "2023-02-08",
    "content": "LOL nah i feel ya. I get in a plug-in loading loop a lot and guess what the culprit is when  I debug? - metatune",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073349801774682194",
    "author": "ehutton21",
    "date": "2023-02-09",
    "content": "Idk if splice will have them but I think if you google you can find some transitions if you need a chop or something there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076920992192008324",
    "author": "JakeTB",
    "date": "2023-02-19",
    "content": "I believe he’s talked about it- something about chopping and duplicating at the sample level at a point where the samples on either end are at zero.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1076986883768328292",
    "author": "ALXCPH",
    "date": "2023-02-19",
    "content": "What I think it is doing, is actually oversampling the audio really high to get a more accurate waveform read and then resampling that to the original sample rate.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077581939957051514",
    "author": "ALXCPH",
    "date": "2023-02-21",
    "content": "I think it does actually. HiQ from what I understand just interpolates the signal. So when you are stretching it, it upsamples the audio to have more sample points for more accurate stretching and then Downsamples it to the original again for playback so you get less distortion after the fact. At least it’s how my brain understands it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077626516004937749",
    "author": "ALXCPH",
    "date": "2023-02-21",
    "content": "maybe the stretching algorithm functions, by pitching and samplerate conversion, som somehow end up at the original pitch?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078035302913937458",
    "author": "austenballard",
    "date": "2023-02-22",
    "content": "@BatMeckley do you know if there's there any benefit to using Melodyne at higher sample rates? Intuition says there might be, but I wonder if you have any arcane knowledge about it one way or the other?\n\nedit: I specifically mean like tracking vocals at 96/192 and editing there before bringing them back into a project at 48 or 44",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078048807251619840",
    "author": "austenballard",
    "date": "2023-02-22",
    "content": "Fair enough, thanks! I just remembered reading you talking about certain editing things being easier at higher sample rates and wondered if tuning was one of them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078050161932107856",
    "author": "cian riordan",
    "date": "2023-02-22",
    "content": "I mean, technically there is more source information for tracking purposes (assuming Melodyne is operating at the native sample rate and not up/down sampling for whatever reason). But if you're not stretching audio, I can't see any real benefit. There's *plenty* of pitch based information for it to work with @ 44/48... but it really comes down to how savvy the code is. I'm an Autotune graphical mode user and I'm pretty sure that tech is stuck firmly in 1998.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078053280896254014",
    "author": "austenballard",
    "date": "2023-02-22",
    "content": "I'm trying to find out if Melodyne does the same thing internally or not. I can't find any info on it, and it does run (standalone as well) at higher sample rates so... maybe not?\n\nBlack box problem, again, as usual",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078054140510490694",
    "author": "Rob Domos",
    "date": "2023-02-22",
    "content": "A friend of mine, who I consider the best vocal producer I know, explicitly told me recently that melodyne is significantly more transparent at higher sample rates. So much so that he used to try to avoid using melodyne before finding this out, and now he runs his whole sessions at 88khz so he has the editing flexibility and uses it all the time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078078720981614592",
    "author": "Deleted User",
    "date": "2023-02-22",
    "content": "https://sethares.engr.wisc.edu/vocoders/phasevocoder.html\n\nfor reference. But it would also depend on how melodyne handles processing FFT in higher sample rate, which I do not have any information on unfortunately",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078085654296133682",
    "author": "JakeTB",
    "date": "2023-02-22",
    "content": "Method: Recorded vocal at 192kHz into Pro Tools. Exported via Shift+CMD+K at 192kHz and again at 48kHz. Vocals were both imported into Melodyne application in monophonic mode. Administered time stretching (both lengthened and shortened) via the time tool. Also administered pitch shifting via pitch tool and checked detection of tuning via correct pitch macro. After exporting these, they were reimported to see if detection had changed.\n\nObjective Results:\n-Upon import, vocal tempo detection was different. (One detected in 5/4, the other in 3/4, at drastically different tempos).\n-For short notes, when using the time tool to stretch, there were audible differences in results.\n-For long notes, when using the time tool to shorten, there was significantly less audible difference (subjectively: no difference)\n-For pitch detection, the algorithm detected pitch differently both audibly and visually.\n\nSubjective Opinions:\n-Time stretching yielded reduced artifacts in extreme settings when done at 192kHz. It did not eliminate all artifacts, but did reduce them.\n-When time stretching in a more nuanced way, the differences in artifacts were negligible.\n-When adjusting pitch manually, there was no audible difference in the quality of the pitch shifting at different sample rates. (For this test, everything was shifted up half an octave before any adjustments made)\n-When detecting pitch, both behaved quite differently. This was partially due to detection of select blobs being different at either sample rate. (This was most surprising to me of all the results)\n-When blobs were adjusted to match as closely as possible by hand, the tuning seemed to behave identically, including locations and levels of artifacts. (My gut says they “felt” different but that is most likely either placebo or the slight differences in true blob locations)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078086704226914434",
    "author": "austenballard",
    "date": "2023-02-22",
    "content": "Generated 2x 5-second sine waves at 110 Hz; one at 48k32, the other at 96k32\n\nImported each sine wave into Melodyne, set to matching sample rate, and pitched down by 1 octave\n\nObserved the resulting pitched-down sine waves for evidence of aliasing with Voxengo SPAN",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078087079587745872",
    "author": "austenballard",
    "date": "2023-02-22",
    "content": "Now, I'm really very dumb when it comes to all this, but I'm pretty sure reduced aliasing means that Melodyne is actually running at the sample rate it says it is, and not downsampling internally like Auto Tune and then re-upsampling",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078088285013946430",
    "author": "JakeTB",
    "date": "2023-02-22",
    "content": "I forgot to close Melodyne, and when I opened a real PT project back up, I got a sample rate error due to Melodyne and PT conflicting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078088765991563334",
    "author": "austenballard",
    "date": "2023-02-22",
    "content": "So it seems like running Melodyne at a higher sample rate may indeed be better",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078089304376619218",
    "author": "austenballard",
    "date": "2023-02-22",
    "content": "I didn't doubt Md *running* at the native sample rate, but whether it's performing the pitch correction calculations relative to native SR or downsampling THEN performing them like AT, my under-educated interpretation is that it's doing whatever it's doing relative to native",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078090698361929738",
    "author": "austenballard",
    "date": "2023-02-22",
    "content": "I think the takeaway is that @Rob Domos 's friend is probably right about it being better at higher sample rates, although the differences are slight. But sometimes a slight difference is all it takes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078092041919135785",
    "author": "JakeTB",
    "date": "2023-02-22",
    "content": "My gut says he had bad detection luck on a previous instance, and then had good detection trying it a higher sample rate and attributed it to that when it was likely just source material that was more friendly to the detection algorithm.\n\nI don’t mean to be dismissive of him or his friend, and could certainly be proven wrong. 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078099251818680361",
    "author": "Deleted User",
    "date": "2023-02-22",
    "content": "Thank you for this test! Shortening or pitching up will make no difference in higher same rate because those processes are truncation which will toss out samples rather than adding more. It may or may not make differences with stretching or lowering pitch in higher sample rates, but with same thing upsampled- I am not sure how much of a difference it would make.\n\nDetection differences is likely due to FFT window size in relation to sampling rate.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078360463768830043",
    "author": "KushKadett",
    "date": "2023-02-23",
    "content": "i know there's sample delay but that isn't tick based",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078363607588421683",
    "author": "Slow Hand",
    "date": "2023-02-23",
    "content": "Sort of. But it doesn't work the same way because Ableton doesn't do ticks.\n\nIf you want to nudge an audio file left or right by tiny amounts in Ableton hold *Cmd* and press left or right arrow to nudge in that direction.\n\nThe amount of the nudge is dependent on how zoomed in you are on the waveform. Being zoomed far out may give you 10ms nudges and being zoomed in farther will give you nudges closer to sample rate.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079505109769257111",
    "author": "BatMeckley",
    "date": "2023-02-26",
    "content": "Switchfoot has something like that too… a bunch of drawers all patched in to loop selectors, so you can kinda just stick with drawer A or B (or c or d or whatever) or combine.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081159249117331467",
    "author": "Ross Fortune",
    "date": "2023-03-03",
    "content": "1) what are the top 5 most important things for you in purchasing a drum sample pack ?\n\n\nI never purchase drum sample packs - not since having Splice. I do like a clear identity in a pack though - for instance, The Kount's sample pack has all those lo-fi/saturated kicks and snares, wonky grooves and crusty hi hats etc that sit very much in his genre, so if I'm reaching for that sound, I know exactly where to go. \n\nI don't know your drummer or his band, but I'd wonder what distinctive character you could capture in your pack? So that I know exactly where to go when I want \"that\" sound in a writing session instant. \n\n\n2) I’m always annoyed that all samples are 0.0db normalized and I always have to turned them way down to keep my gain staging coherent, would I be crazy to have them peak at -8 ? Would people automatically hate it ? \n\nI produce largely in Ableton now, and when you drop a sample in the drum rack, the instance of Simpler it creates defaults to -12dB. With the velocity:volume dial at default (45%), this causes a 0dB sample to play back at -6dB when velocity=100 (the default). My template has all mixer faders (including a basic drum rack + instance of Drum Buss) trimmed to -9dB (similar to my mix gain staging strategy I detailed previously), allowing me to mash stuff up if needed, and still have headroom to not have to max out vocals when it comes to cutting them. What I'm saying in a roundabout way is... I've already made allowances for 0dB samples, so I don't care - but you probably should, because if you're selling on Splice, they could sound dwarfed against the next pack.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087433516721123481",
    "author": "LAPhill",
    "date": "2023-03-20",
    "content": "The main reason I've never gone down the rabbit hole is recallability. I'd have to extensively sample every sound I made in case there were revisions down the line. But it does look like a lot of fun.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089254177231880192",
    "author": "jonmatteson",
    "date": "2023-03-25",
    "content": "I like addictive drums for this and i'll add an electronic snare that links to the acoustic snare for that extra high and low. Will also add a sample on top of that if it needs it. This shit is honestly way easier and more fun with real drums in a nice studio though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090796283603726376",
    "author": "Rob Domos",
    "date": "2023-03-29",
    "content": "*deactivates splice account*",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090927353733066815",
    "author": "louisvie",
    "date": "2023-03-30",
    "content": "i'd really love to know what that perc loop is :derp:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092593625529069719",
    "author": "austenballard",
    "date": "2023-04-03",
    "content": "between FAW SubLab and the 808 presets in ANA 2 I haven't actually made one from scratch or used a straight-up 808 sample in like 3 years",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092596754400165968",
    "author": "cy (sigh)",
    "date": "2023-04-03",
    "content": "synth for the sustain/control and  sample for texture /tone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092598576598753280",
    "author": "LAPhill",
    "date": "2023-04-03",
    "content": "That's a good tip. I've had decent luck throwing one-shots in Kontakt and doing the sampler thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1092848720539815966",
    "author": "Josh",
    "date": "2023-04-04",
    "content": "Eh more so regarding some of the one shots. Their EDM stuff seems legit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093152611336724541",
    "author": "Josh",
    "date": "2023-04-05",
    "content": "I copied them and they’re all one shots so there’s no way they didn’t get imported to the pool when I used them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1096141929097474239",
    "author": "Nomograph Mastering",
    "date": "2023-04-13",
    "content": "But framing mastering as an almost one shot event could be useful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100514671515156570",
    "author": "Deleted User",
    "date": "2023-04-25",
    "content": "I think granular verb means it uses granular scrolling on sample buffer pre-reverb",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101278162115113000",
    "author": "NoahNeedleman",
    "date": "2023-04-27",
    "content": "Kontakt Komplete gets you into a pretty good world of most of these things. Arturia for Synths",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102628168403263579",
    "author": "esquinalee",
    "date": "2023-05-01",
    "content": "Anyone have experience with Spitfire BBC orchestra? I have the Core and am debating whether or not to make the jump to Professional while their sale is still on. Are the different miking setups and flexibility with instruments worth it from your experience?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103385337255956611",
    "author": "LAPhill",
    "date": "2023-05-03",
    "content": "For many, it's about efficiency. It's quicker to grab a Splice loop, load up some samples, to edit the guitar instead of retracking. Which comes back to showing people a better way - working with artists and showing how much better it feels when a real drummer plays that same hi hat pattern. The nuance of working with a brilliant session guitarist. Everyone should have the experience of that, spend the money to splurge once, and see if they hear it, or if it resonates with them. And it doesn't necessarily take that much longer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103387376304279673",
    "author": "Deleted User",
    "date": "2023-05-03",
    "content": "put that one last chord in a sampler. done ✅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103727216908570624",
    "author": "Deleted User",
    "date": "2023-05-04",
    "content": "Making music with rules(restrictions) is really interesting. When Ableton Loop was happening people were sharing a whole bunch of interesting prompts on their discord",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105158487136293014",
    "author": "Edward Rivera",
    "date": "2023-05-08",
    "content": "There are a few free drum kits out there that will give you realistic hi hat too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108487613062586369",
    "author": "Ross Fortune",
    "date": "2023-05-17",
    "content": "Oh that’s rad! I have the app but didn’t know it had that function. I’ve done so many bullshit chipmunk sample replays recently, that *really* would’ve come in handy 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108505824055275610",
    "author": "LAPhill",
    "date": "2023-05-17",
    "content": "Do you record at a higher sample rate when doing this, or not bother?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108602095101284434",
    "author": "NoahNeedleman",
    "date": "2023-05-17",
    "content": "Had to rock a quick turnaround for a sync pitch today. Used Studio Drummer in Kontakt- chose some stock drum grooves, dragged the midi onto the channel and adjusted velocities of the kik & snare. I couldn’t figure out how to mult it out without googling so I just mixed it in the plug-in. It’s legit not cool sounding at all, but honestly it was useful and it got me to a pitchable place. \nAnybody else using workflows in and around kontakt that allow you to mult & trigger more interesting samples?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108602708140769300",
    "author": "LAPhill",
    "date": "2023-05-17",
    "content": "I usually just duplicate the MIDI to individual Kontakt instances and mute/delete everything but the drum I want.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108605066350432307",
    "author": "LAPhill",
    "date": "2023-05-17",
    "content": "It's pretty quick to reassign outputs in Kontakt for the different drums (usually, I can't say I've tried this with Studio Drummer). So if I'm doing what I listed, it's because I'm being extra lazy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108605626860458075",
    "author": "LAPhill",
    "date": "2023-05-17",
    "content": "Are you in Pro Tools? I'd do what @Slow Hand suggests and create a Kontakt template with audio outs as you desire, then you can import it into new sessions. If you have it saved with Kontakt as well, even if you swap out your drum instrument, it'd be short work to reassign because all the outputs are already created.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108759580072218684",
    "author": "NoahNeedleman",
    "date": "2023-05-18",
    "content": "@LAPhill after mucking about with tryna set up output routing in kontakt, I tried your trick. Duplicated the Instrument channel like 10 times, clicked through and solo’d each channel I wanted, then hit commit. A/Bd with the full performance and it adds up flawlessly. GOOD FUCKING LOOK PHIL.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108763304089886800",
    "author": "NoahNeedleman",
    "date": "2023-05-18",
    "content": "It was a lot faster than I expected cause all the plugs are right next to each other. So I’d just select the kontakt plug on the adjacent channel, solo a channel in the kontakt mixer, repeat until done. \n\nTriggering didn’t work great cause the performances are SO dynamic, but eq and distortion goes a long way. I’m not making any hits like this, but for a hallmark Christmas movie? Golden.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114667409748545647",
    "author": "Slow Hand",
    "date": "2023-06-03",
    "content": "*Naaaaaaaah* that ain't it. 😉 \n\nI want to splice things together. I want to Dr. Moreau that shit.\n\n\"*Behold!* A song with the delicacy and grace of a Ravel string quartet and the ugly horse-face of a gabber record.\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114909569127284767",
    "author": "louisvie",
    "date": "2023-06-04",
    "content": "also been sampling every one shot i could find in them and it's a lot of fun",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117237312561102918",
    "author": "Deleted User",
    "date": "2023-06-10",
    "content": "808 and 808 drums are like maple drum kit at some point. I don’t think they’ll ever go out of fashion. The characters of the samples are going to change and shift the sonic trend but they’re not going anywhere. \n\n\nI do think the hihat patterns are gonna go out of fashion and rotate trends in different patterns. Right now it’s all about the drill pattern but I think that will probably go out of fashion soon.\n\nWhen I say go out of fashion though, I only mean it won’t be the thing everyone’s chasing anymore",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1118966121857548318",
    "author": "austenballard",
    "date": "2023-06-15",
    "content": "bonus of doing that, you can tune the sample to whatever key",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119388243012620440",
    "author": "cian riordan",
    "date": "2023-06-16",
    "content": "Anyone got a line on some good horn sample libraries for vintagey Specials/Clash type stuff?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119393575667519538",
    "author": "Deleted User",
    "date": "2023-06-16",
    "content": "speaking of horns/brass, I’ve been searching for horn sample libraries that can start vibratos mid note with either mod wheel or other CC automation. same with strings and woodwinds. \n\nI’ve consistently felt like the vibrato is the biggest bottleneck in trying to get samples to sound realistic or have mojo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119469941641445397",
    "author": "Will Melones",
    "date": "2023-06-16",
    "content": "Speaking of sample modeling, have you used The Trumpet by the company Samplemodeling? It feels pretty limited to solo lines, but can be convincing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119480116867768380",
    "author": "Slow Hand",
    "date": "2023-06-16",
    "content": "Maybe there's a solution to this problem where composers still sequence horns the old-fashioned way, using passable MIDI/sample mockups that don't get 100% there. Then the DAW does an offline pass when bouncing where it uses an AI model to fill in the blanks to make the legatos feel convincing. Or maybe it interpolates tongue-slaps into the performance in a way that carries over the resonance from the prior notes, or colors \"outside the lines\" by injecting a certain amount of \"frenzy\" into the playing that modulates pitch, intensity, timing, or overall \"vibe\". Or maybe it makes the timbre \"a little more Duke Ellington and less John Williams\". Or maybe it renders a double-tracked horn that's not just a pitch-modulated version of the source audio file.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1123006812598308894",
    "author": "stefanmacc",
    "date": "2023-06-26",
    "content": "All I know is splice can be your friend if you need something super specific in a hurry aka animal sounds or crowd yelling ect…\n\nOther than that footsteps are a bitch to do by yourself… but a good workaround is to buy a couple diff types of surfaces from a hardware store… like a little tile .. square of grass … dirt in a tray… and set them under your desk with some mics . And do all the footsteps yourself.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126309007833956442",
    "author": "OJ",
    "date": "2023-07-05",
    "content": "Does anyone have advice on creating sample packs? Like do I go record a real snare and then put distortion on etc to get like a Lex Luger Snare for example, how is something that clean made, not like a real sounding snare but these trap snares for examples, or just unique sounds??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1127964264460718150",
    "author": "Zakhiggins",
    "date": "2023-07-10",
    "content": "What the guys have already said is good info, but one thing I'll add is that if you're making a drum kit, giving all of the samples the same bus processing will make everything sound a bit more like the same kit, as opposed to miscellaneous samples",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129210861366542517",
    "author": "Deleted User",
    "date": "2023-07-13",
    "content": "I’ve been looking for instruments like Xpand and just found out that these sample based instruments are called Romplers through some forum search. \n\nLFG. I gotta wait until Xpand2 goes on sale again for 20 bucks. I know it’s free on PT but I barely go on PT these days except for recording and edits.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139975627911479348",
    "author": "jonmatteson",
    "date": "2023-08-12",
    "content": "the moment you add a plugin to a track in ableton it processes the audio at 32 bit so you are technically always downsampling if you are producing/mixing in ableton unless you are bouncing out 32 bit files. Even then most samples are at 44.1 24 and maybe you are recording vocals at 48. I usually leave it on triangular unless I am bouncing 32bit stems or bouncing at the same sample rate and bit depth.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1147702447050076230",
    "author": "jantrit",
    "date": "2023-09-02",
    "content": "When loading in your own samples from their patch builder do you ever have issues with it pitching down the hits? Sounds like a sample rate thing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150092100818448475",
    "author": "Josh",
    "date": "2023-09-09",
    "content": "This is me actually just placing one shots bc there isn’t a drummer involved",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150640784677285888",
    "author": "Nomograph Mastering",
    "date": "2023-09-10",
    "content": "One of the reasons that I feel strongly about this is becuase we get one shot to hear the record for the first time, just one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154441174703157299",
    "author": "isaac joel",
    "date": "2023-09-21",
    "content": "How long till this is the next *it* sample for beat makers? \nhttps://youtu.be/L5KKRFQ_mxg?si=e5rXzRyKw3IvHs8L&t=38",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155245630206251028",
    "author": "Skyler Young",
    "date": "2023-09-23",
    "content": "Hey guys! \nI’ve spent most of the last year building essentially my dream sampler instrument plug-in. Basically what I wish omnisphere and nexus were",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155587891318247566",
    "author": "Skyler Young",
    "date": "2023-09-24",
    "content": "The tone shift effect is something that I was thinking about for a long time - it manipulates which samples you access for each note played. For example you shift it +12 and play C1 it will take the sample from C0 and play it at double speed - changing the character of the sound sometimes drastically. If the range knob is at 50% and shift is at 0 and you play C0 it will use the sample from G0 (because it’s 50% the distance from C0) and if you play C2 it will use the sample from G1 - also has interesting effects on the sound. I still haven’t figured out the best way of explaining this function but I find it really usable and I’ve never seen sometime implement it before.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155624807971434506",
    "author": "Slow Hand",
    "date": "2023-09-24",
    "content": "@Skyler Young This looks cool. A neat feature I'd love to see someday would be to add a simple EQ device and allow internal resampling of one-shot samples. The idea is that samples often have some boxiness or ringing that needs to be EQ'd out, but those problem-zones shift when the sample is transposed up and down, making any post-sampler EQ moves ineffectual.\n\nIf you could streamline the process of re-recording a static sample with the necessary EQ cuts committed into the one-shot then those cuts would be transposed along with the sample when you play it up and down the keyboard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155625529957953617",
    "author": "Josh",
    "date": "2023-09-24",
    "content": "Also depends on what you’re using it for tho. If I’m using one shots samples then I want those weird artifacts. If I want something to be perfect I’d just reach for a multi sampled instrument.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155640595549790270",
    "author": "Skyler Young",
    "date": "2023-09-24",
    "content": "Intresting! Actually my filters follow the pitch of the sample so changing the function into a peak wouldn’t be too hard…..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1162950477898600589",
    "author": "Slow Hand",
    "date": "2023-10-14",
    "content": "Does any company make an \"audience\" sample pack for orchestral mockups? It would include coughing, chairs creaking, the quiet sniff of 1st violin, and 40+ flavors of applause - from polite bewilderment to Cannes-level indulgence. And of course... a dozen different ringtones.\n\n**Tagline:** *Break the spell. Never the illusion.*",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1162970705126752396",
    "author": "Garth Tim",
    "date": "2023-10-14",
    "content": "actually a pretty good idea lol. you could always sample 4:33",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169256852417163294",
    "author": "youngteam",
    "date": "2023-11-01",
    "content": "My thought process is “I want to make a beat like _” I’ll usually start by finding a sample I like and putting it to a bpm / key I’m feeling then go from there. I have folders of drum sounds I’ve curated from various packs that I’ll quickly go through then.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169257269578432552",
    "author": "youngteam",
    "date": "2023-11-01",
    "content": "The thought process is I want to be able to make beats in various styles very fast because I feel a lot of sessions are like this. You don’t have to use a sample for inspiration it can be a couple of piano or guitar chords. I’m trying to understand what producers are looking for in samples as I make them myself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171632192380743791",
    "author": "Deleted User",
    "date": "2023-11-07",
    "content": "Software instrument wise\n\nArturia\nKontakt\nSerum\nKorg stuff\n\ndone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171632306960736387",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-07",
    "content": "any specific kontakt stuff?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174036292028334254",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-14",
    "content": "She just sent me a video of the session with the producer  - seems to be a sample rate issue - in his session the instrumental was slower and lower😢",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174124207215484929",
    "author": "Josh",
    "date": "2023-11-14",
    "content": "Me being even more paranoid, I label the sample rate and tempo just in case 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175233490942439424",
    "author": "Rob Domos",
    "date": "2023-11-17",
    "content": "So I do care about things being in tune and consistent and I just did a whole production using spitfire stuff because I’m not deep into this particular world and labs is free, and boy was I disappointed and frustrated at how out of tune and inconsistent some of it was. To the point where I wrote a support ticket saying some of the patches are a full quarter step out of tune, and support hit me back sounding all confused like, which ones? And I’m like… are you serious? This was just in the last day",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175521662754627646",
    "author": "esquinalee",
    "date": "2023-11-18",
    "content": "LA Scoring Strings has also been really great for me so far especially for the option to have really dry tracks to put in your own space. Definitely need to perform the tremolo and dynamics like Phil was mentioning.  Using LASS for first chairs or “lead” splits on top of spitfire stuff is cool too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1179878463973376010",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-30",
    "content": "Songwriters who are also producers how do you balance songwriting and producing? As someone who writes songs but also likes producing for the sake of it and also does a lot of work for others I struggle to give it all the time it deserves. Especially my songwriting seems to suffer since I spend so much time on producing. \nFor the record I‘m a „sit down on a piano and write the song from start to finish“ instead of a „ let‘s make some loop and throw some toplines on it“ type of guy \nSo since I spend most of my time on producing I wonder if you have/had the same problem and any strategies to avoid it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181710148897616024",
    "author": "Josh",
    "date": "2023-12-05",
    "content": "Debating if a hardware sampler would be a fun route for me. Anyone running that sorta thing? How are you integrating it into your “DAW setup”?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181714069103845516",
    "author": "lystell",
    "date": "2023-12-05",
    "content": "Don’t have a hw sampler (yet) but I do lots of recording with iPhone and boom bada bang into quick sampler in Logic. Works like a charm and really fun.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181714785054752828",
    "author": "cy (sigh)",
    "date": "2023-12-05",
    "content": "use a volca sample to get quick samples /loops /ideas going. the v2 is easy enough to load. though you have to downsample sampels to fit (mine is packed with all my own stuff).  only one stereo out but the fact its limited in track amounts I don't mind just recording each seperately. \n\nalso using something like koala on your phone or ipad would also come in clutch. a lot of flexibility in those and you can even sequence note by note if you pay for the add on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181728002804039731",
    "author": "Josh",
    "date": "2023-12-05",
    "content": "It currently just has a fart on it that I made a fart loop out of.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181856559119212635",
    "author": "Deleted User",
    "date": "2023-12-05",
    "content": "Are you looking for sampler or drum machine?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181856781341818952",
    "author": "Deleted User",
    "date": "2023-12-05",
    "content": "Octatracks are great samplers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181858294097252392",
    "author": "Deleted User",
    "date": "2023-12-05",
    "content": "I’m trying to get my DAW to have the same workflow as MPC of ASR. The thing that I have the most trouble with is changing sample start point with a controller so I can chop samples with a dial instead of using the mouse",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181874216233082880",
    "author": "Slow Hand",
    "date": "2023-12-06",
    "content": "@Josh I owned an NI Maschine+ (the standalone hardware unit) for a year before I eventually sold it. My reasons were much like yours; to get away from software and have a standalone instrument to play with.\n\nI don't have many bad things to say about it, but ultimately it just wasn't a good fit for the way my brain works. NI have crammed a tremendous amount of features and functions into that thing. Most of which it does very well, but when it came time to do sequencing in the unit the interface was just too much of a hurdle for me. I found it hard to keep all of the key commands in my head to do simple commands. I think it's a little *too* efficient in how many options they've fit into it. Remembering the commands among it's unorthodox button layout was challenging and unintuitive for me.\n\nAs you might imagine, it integrates perfectly with the Maschine software, which is basically a DAW within a plugin that controls the hardware and vice-versa if you choose to use a computer. But I wasn't interested in that, because I can achieve the same things and more with plain old Ableton.\n\nIt *does* have a fantastic sample library and the NI sample packs you can purchase are very well done.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181874879927164999",
    "author": "Slow Hand",
    "date": "2023-12-06",
    "content": "This Loop Op review might be helpful if you're trying to decide between a *Maschine* or a contemporary MPC. He does the best electronic instrument reviews on the internet. All killer, no filler. Quick and to the point: https://www.youtube.com/watch?v=gPxQpcJxbJg",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1186803340156342342",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-12-19",
    "content": "going through the stems of blackbears \"hot girl bummer\" and once again I noticed that it doesn't take a lot to make a great song: there's only stack of harmonies in the chorus and it's I'm pretty sure made with melodyne or autotune bc of all the artifacts in there. There is one natural mono harmony in the second pre and it has crazy bleed. The sample they took from a tv show (\"you want me to change... f*** you) still has the background music from the show in it (you'd never notice it in the mix though) \nWhat makes his vocals so cool is the creativitiy, with all the formant shifting on the lead + the lower octave that's probably done with little alter boy or smthg similar. \nthe guitars are played super well but also there's the occasional scracth and bum note in there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1189621972963950622",
    "author": "simplersounds",
    "date": "2023-12-27",
    "content": "One thing I like to do is send the dry signal to an Early Reflections patch or delay and then send the early to a diffuse instead of the dry to a diffuse, can go further leftfield by creating a feedback loop where diffuse are fed back to early.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194684399489405070",
    "author": "LAPhill",
    "date": "2024-01-10",
    "content": "MTC and MMC are likely your best bets. But MIDI is not sample accurate, so you can expect some milliseconds of drift at least, different each time you hit play. Might be fine for coming up with parts, but it’s not a great solution for a whole project. \n\nThe only tech I’ve seen that gets around that is Avid’s Satellite Link, but that’s just for syncing Pro Tools rigs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1201643018340532234",
    "author": "NoahNeedleman",
    "date": "2024-01-29",
    "content": "Hey all, anybody have a cranberries “linger” style snare loop they can point me toward? Happy to pay for it, just gotta figure out where to look",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203047292366495794",
    "author": "Ross Fortune",
    "date": "2024-02-02",
    "content": "Made a track using a perc loop sample (from an existing song) to get a vibe going, but now I’m having a hard time matching the feel by reconstructing the sample, and it’s really integral to the track (groove based, 106BPM funk/house thing). \n\nWe’re talking hats, congas, tambourine - classic top loop type stuff. \n\nAny suggestions to get there?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203048461549699133",
    "author": "sethearnest",
    "date": "2024-02-02",
    "content": "Had the original sample you used been manipulated overall pitch- or timing-wise by you at all?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203050333845069954",
    "author": "sethearnest",
    "date": "2024-02-02",
    "content": "You might already be doing this, and might be the way everyone else has always done it, but a light bulb moment for me when I've re-created samples: I needed to match the *original* sample's tempo and pitch, instruments, feel, etc etc, get it sounding like the original sample fully at it's original everything, *then* manipulate as a \"sample\" the same way I did the original manipulation. Helps it feel more like the sample. \n\nSeemed especially important with any pitching happening -- something about the whole being pitched was different than trying to match the already-pitched-down version.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203059723029450752",
    "author": "Ross Fortune",
    "date": "2024-02-02",
    "content": "That’s great, thank you for jogging the memory. Weirdly I’ve done so many vocal sample replays in the last year, and this is exactly how I’d approach it. Can’t believe I didn’t think to start there 🤦🏻‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203142231158952009",
    "author": "NoahNeedleman",
    "date": "2024-02-02",
    "content": "Phill goes first: “no loop based libraries.”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203143036260057119",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-02-02",
    "content": "That was what I was talking about - it wasn't loop based. I can see where the misunderstanding came from, perhaps I should have said \"sequencer cycle\" or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203206627499573308",
    "author": "Deleted User",
    "date": "2024-02-02",
    "content": "but… his studio is definitely a dungeon of synths, mallet instruments, drum kits, and a lot of 500 series modules",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203268043367514132",
    "author": "Zack Hames",
    "date": "2024-02-03",
    "content": "I avoided splice for years. I got it a couple months ago to try for a super “pop” production. My wife literally said “these drum sounds are completely wrong, they’re terrible”. I’ve never had anyone say that to me until I used Splice.\n\n(Not that splice is bad; it’s just clearly not a conducive way for me to work)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1203380260129734786",
    "author": "Zach Hughes",
    "date": "2024-02-03",
    "content": "I've never used Splice. Though I've been on the brink visiting the site maybe half a dozen times. That and I like to record real instruments played by humans together in a room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207251640441245757",
    "author": "Chad Rodgers",
    "date": "2024-02-14",
    "content": "That drum sample trick is v cool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207414795733704765",
    "author": "Zach Hughes",
    "date": "2024-02-14",
    "content": "Producer peeps, any recommendations for violin / strings vsts for demo'ing out parts? Closer to natural / organic sounds than overblown / processed / fake af sounds. I've got some Spitfire / NI options but wondering if there's something better out there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1207418315094630410",
    "author": "Slow Hand",
    "date": "2024-02-14",
    "content": "Yeah. I'm asking if you want samples of solo string instruments or a string section.\n\nFor ensemble I've been enjoying the *NI Session Strings 2*. I've also got the *Spitfire BBC Symphony* but I'm less fond of those because they're recorded from an orchestral perspective and have a lot of room sound baked in, whereas *Session Strings 2* have a closer perspective. If you want an ensemble sound plus some major grit and close-miking I *do* like the *Bernard Hermann* orchestral library from Spitfire.\n\nFor solo strings the *NI Cremona Quartet* instruments are really, really nice. They're a pleasure to play with and sound fantastic. These have maximum presence too, so you can get some very direct sounds with them. I'm really enjoying them. The articulation and tonal options are extremely thorough.\n\nA while back a few people recommended *Sunset Strings* by Realitone. While I haven't used it yet, they look very promising. They seem to be serving people who want a rock/pop string feel, which could be just the ticket.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210536204790013963",
    "author": "mariano",
    "date": "2024-02-23",
    "content": "Hey there, been playing with the free BBC Symphony Orchestra Discovery from Spitfire Audio. Is it just me, or does anyone else find that the attack on the sounds is rather too slow, giving an overall sense of weak sound? There's something about it that feels overly smooth, even when listening to the demos provided on their website: https://www.spitfireaudio.com/bbc-symphony-orchestra-discover#listen. I don't think it's a matter of compression... What do you think? - I reckon @LAPhill could be the expert on this topic 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212073937324744835",
    "author": "Nomograph Mastering",
    "date": "2024-02-27",
    "content": "If you have RX I would do the trim there and use Export function to export at the original sample rate and bit depth and no dither",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212076391802081301",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-27",
    "content": "I did it now in Pro Tools - just putting the file into a session, cutting the silence at bouncing it out again using the matching bit depth/sample rate\nDo you think this might cause problems? Already sent the edited master to the artist so unless it‘s a big deal I‘d like to keep it at that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214716586527555626",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-05",
    "content": "Re: BFD, I have no experience with that library - haven't seen anyone talk about them for a long time. Most talk about acoustic drum sample libraries seems to be around GGD & MixWave, though those are quite rock-centric",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220856807107596360",
    "author": "Slow Hand",
    "date": "2024-03-22",
    "content": "This may be an odd request, but does anyone have recommendations for a sampled banjo that they recommend? Ideally as a Kontakt instrument, but not essential.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221036635991310398",
    "author": "Chad Rodgers",
    "date": "2024-03-23",
    "content": "This new Spitfire pack “Hearth and Hollow” is supposed to be pretty good. Haven’t tried it myself yet but there’s a banjo in there. It’s discounted at the moment too!\n\nhttps://www.spitfireaudio.com/hearth-and-hollow-plucked-folk-ensemble",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1229543217951670302",
    "author": "ehutton21",
    "date": "2024-04-15",
    "content": "I like arcade but I try to be unorthodox about using it. I guess that’s a pretty generic thing to say but I like the interface it has for layering vocal samples into production if that’s something you find as a staple of your work. I enjoy using their sample and sequence loops as a starting point, printing them, and fucking them up more",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1234933136102522970",
    "author": "Slow Hand",
    "date": "2024-04-30",
    "content": "Not sure how to with stock Pro Tools, but since you're doing a lowpass sweep with an envelope follower, it's possible that one of your more generic LPF plugins would have that feature built in.\n\nIs the choir a VST instrument? Depending on the sampler you may be able to configure a LPF in the sampler that responds to that behavior.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237791145572962455",
    "author": "Slow Hand",
    "date": "2024-05-08",
    "content": "Great! Looks like a pretty reasonable price too. I'm gonna have to pick your brain on sample libraries sometime. I'll be you've got a lot of helpful insights.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237797084648706121",
    "author": "Ross Fortune",
    "date": "2024-05-08",
    "content": "Um, while we’re doing pester @LAPhill about libraries… What are real composers using for action style repeated fast staccato string figures? \n\nI’ve got reasonable results layering Kontakt Session Strings 2 with BBCSO, but it’s pretty laborious - key switching in BBC per note between staccato and spiccato to make it more exciting and less machine gun.\n\nI see Action Strings pop up. Is that old hat?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239078318293127260",
    "author": "Slow Hand",
    "date": "2024-05-11",
    "content": "It's funny. I've tried synthesizing my own 808s so many times over the years, and there's something about a good 808 sample that I've been unable to replicate. It's vexing, because they're really not that complicated. I feel like I could chase that goal for the rest of my life and never achieve it. Why are synthesized 808s so elusive?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239169195896475710",
    "author": "sinaigimenez",
    "date": "2024-05-12",
    "content": "Same here! I've been running in circles with this for days before I gave up. What's your fave source for great 808 samples? Any sample library in particular? Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239236709640704142",
    "author": "Josh",
    "date": "2024-05-12",
    "content": "Any sampler will work. You can even load one shots in the sample section of serum 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239251698908795062",
    "author": "Calvin Lauber",
    "date": "2024-05-12",
    "content": "Is there a recommended plug-in/vst for super quickly dropping in an audio file (say a drum loop) and assigning different bars of it to midi pads on my controller? I know most sampler plugins can do this but sometime it feels too clunky and like, too many options. I’d love to record a drum loop and then fairly immediately be able to play pieces of it on a sampler. I’m in pt",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240363016114012304",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "This was the joy and beauty of dr Rex player and recycle back in the day . Nothing has worked like that since . Reasons NNXT (I think ?) was a great sampler and you could bridge the audio to use pro tools audio engine (reason sounded ish imo)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240378706011361310",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "...i used to sample a lot of my fav hiphop songs and producers on my mpc , wherever i could grab a single iso hit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240379902197497866",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "The games first album is great for kicks and snares , Jdupri produced Mariah Carey tracks have lovely drums to sample  And if anyone’s after a good snare and rim shot collection …..d angelo voodoo . The end",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240384479655235675",
    "author": "spectrummasters",
    "date": "2024-05-15",
    "content": "I feel ya . I’ve got all the Roland , linn and CR , the Akai mpc disks and the s1000 , 3000 sampler disks . Happy to organise sharing them for anyone who gets interested in future",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241190375121616979",
    "author": "Jeff Dunne",
    "date": "2024-05-17",
    "content": "idk PT somehow allows MIDI to be sample based instead of tick, and MasseyDRT doesn't have a VST. I still don't fully understand how the first one works but I want it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241325870660980817",
    "author": "Iwan Morgan",
    "date": "2024-05-18",
    "content": "Technically probably not but if they are one shots probably OK? DJ Premier’s been doing it for nearly 30 years",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241492950652031086",
    "author": "Adam Thein",
    "date": "2024-05-18",
    "content": "Anyone here have experience with SampleRobot 6?  Seems like exactly what I could use for building out some multisampled instruments for live use but wondering if there's any downside that I'm blind to.  Tried the limited demo and all seems good.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241735557046861924",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "How do yall feel about splice loops? I’ve made a point to stop using them almost entirely simply because I want to get better at the craft and always give someone something that’s unique. But do yall get bummed when you find out your favorite songs are splice loops? Because I’m kinda bummed espresso is 90% splice loops.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241752546708815922",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Not saying I like judge producers who use splice loops, do ya thang. Get it done.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241759287596941322",
    "author": "Iwan Morgan",
    "date": "2024-05-19",
    "content": "On a theoretical level it does bother me, and i feel it limits ideas. But then I remember how most electronic music comes from the purposeful misuse of equipment and crucially that Rihanna’s Umbrella is based on a Garageband loop so 🤷‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241760331823452200",
    "author": "Edward Rivera",
    "date": "2024-05-19",
    "content": "Noah on the mark as usual. _Espresso_ wasn’t _on_ splice. Can’t just buy the song in the shop. Yet",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241762101438185583",
    "author": "Maxim",
    "date": "2024-05-19",
    "content": "A lot of my favorite songs are mostly samples that were arranged and processed in a new way. \n\nSplice Bridge has opened up that world for me without any hassle. After setting the pitch/tempo I can fully focus on what feels good, sounds interesting, sparks new ideas and works in the context of the song. \n\nSometimes it feels like cheating, but is it? Is it really that far away from having session musicians improvising and me saying “that’s it”?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241765296121974925",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "I got the ol’ copyright strike from splice and haven’t used it since 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241765524413612127",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Core question was “do yall get bummed when your favorite songs are splice loops?”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241765685928136835",
    "author": "Maxim",
    "date": "2024-05-19",
    "content": "Literally was just typing a version of this out. It's one of the most popular Splice packs. I've probably maybe even heard the sample but I didn't make a hit with it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241767685319168142",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-19",
    "content": "98% of people listening to espresso probably don‘t even know what splice is🤷‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241767960822153317",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Well. The hip hop songs that aren’t cymatics loop into gross beat lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241767984138031146",
    "author": "Bryan DiMaio",
    "date": "2024-05-19",
    "content": "I'd say splice is obscuring any blatant sampling from the average listener more so than traditional sampling because it's less recognizable than previously released hit songs being chopped up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241768082222088214",
    "author": "Maxim",
    "date": "2024-05-19",
    "content": "\"Person who made the majority of the beat\", do you mean the beat maker or the sample pack creator?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241768350045044757",
    "author": "Josh",
    "date": "2024-05-19",
    "content": "Sample pack creator.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241768666001969304",
    "author": "Edward Rivera",
    "date": "2024-05-19",
    "content": "I’m not familiar with splice IP (for lots of reasons) is this pack royalty free ? Does a splice membership grant you use of this pack ? Did the pack creator specify what constitutes fair use of their material ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241768719198322738",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-19",
    "content": "Everything on splice is royalty free",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241770084893065216",
    "author": "Maxim",
    "date": "2024-05-19",
    "content": "I think Splice mostly lives in scenario 1 and 2 depending how you use it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241770746569556088",
    "author": "Edward Rivera",
    "date": "2024-05-19",
    "content": "I specifically use this because the main sample isn’t even chopped up for the important part",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241770923535765545",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-05-19",
    "content": "Did they get em all from the prodigy sample pack vol 1",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241771487136972890",
    "author": "Maxim",
    "date": "2024-05-19",
    "content": "To make things a bit bigger, Shopify makes almost 3 billion in revenue every year, yet the companies built on top of Shopify make close to 200 billion combined. The company that makes 100 million a year using Shopify doesn't pay that much more than the company that only makes 100k a year. What I mean by that, Oliver created a sample pack that thousands of people can use the way they want to. Why should they by default get credit when someone comes along and builds something that's widely successful with that? Didn't everyone win? (Of course it's not the same but I'm trying to get to the source which is I think what we believe to be artistic integrity).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241771625863712838",
    "author": "Bryan DiMaio",
    "date": "2024-05-19",
    "content": "Okay so where is the line for you? If you heard a song you liked but then found out the drums and bass were from a sample pack do you like the song less?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241821335366144040",
    "author": "SoundsLikeJoe",
    "date": "2024-05-19",
    "content": "Just like samples.... Qtip could flip a sample like a Picasso imo. There are musicians I know who swear that using samples like that has no musical merit. We both think the other are crazy af. Cest la vie.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242971719921045625",
    "author": "chris_donlin",
    "date": "2024-05-22",
    "content": "Does anyone have a quick way to take a melodic riff on guitar/keys/etc and have each note play in reverse? I dont want the whole clip to just play backwards. I want the melody the same. Slice to new midi track in ableton almost gets me there but i cant reverse the samples within each sampler... or can i?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242976352748044378",
    "author": "chris_donlin",
    "date": "2024-05-22",
    "content": "Well shit, praying to the DAW Gods for something to solve this. I thought *maybe *some sort of granular sampler could do it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242977046913744956",
    "author": "Slow Hand",
    "date": "2024-05-22",
    "content": "Yeah, unlikely. Granular samplers are more about shredding the audio into tiny slices, regardless of the rhythmic content of the audio sample.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247552674329792591",
    "author": "Ross Fortune",
    "date": "2024-06-04",
    "content": "I’m not good enough to record *with* a click. Praise be to loop mode and comping.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248916178169102427",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-06-08",
    "content": "does splice not have MIDI files anymore? I swear they used to be on there but I can't find them anywhere anymore",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248982621334147132",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-06-08",
    "content": "I googled it and I found threads from 5 years ago that mentioned finding MIDI on splice. Nothing recent thougj",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1253430056911634453",
    "author": "spectrummasters",
    "date": "2024-06-20",
    "content": "Just dropped into say (apologies for the 808 talk ) but we all know about the fabled fl sound , but you can actually blow the shit out of a logic multi sampler channel turn off the channel output then send that to. 3 buses , blow the shit out of them (‘Make that 32 bit float do workkkkkk ) and then send those parallels all to a bus , stick big clipper on it and take that absurd overloaded bus back down to 0db , set ya bus fader to level of choice for your mix and we’ll golly gosh that sounds dense intense and immense with the right 808 . Or just print ya drums in fl but hey , 👋",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254868053041086546",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-06-24",
    "content": "Which one is that? Messing with the sample rate and stuff?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254868984159801475",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-06-24",
    "content": "been a while since I used PT, someone else can chime in but I think it's mainly sample rate degradation to focus the top end, some people mess with the anti-aliasing too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254872042319380492",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-06-24",
    "content": "Yeah I like to reduce sample rate and then bring back some of the high end with anti aliasing. Then messing with the sample size and you get some interesting glitchy textures.\nTurning the distortion and saturation up miniscule amoubts (about 0.1-0.3%) also rly helps to make vocals more intelligible \nOn top of that, it‘s also rly great if u rly wanna f*ck up a sound. It truly is a great plugin",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255765134845149215",
    "author": "spectrummasters",
    "date": "2024-06-26",
    "content": "I remember roni size being asked how he came up with brown paper bag and the full cycle sound . He said he’d sit in his bedroom for months reading the manual to his sampler over and over and over",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255765198426472510",
    "author": "spectrummasters",
    "date": "2024-06-26",
    "content": "Just him.  His sampler . His manual",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255893463128346787",
    "author": "hyanrarvey",
    "date": "2024-06-27",
    "content": "I think it’s funny producers are all up in arms about the espresso splice loop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1261168700564967455",
    "author": "Slow Hand",
    "date": "2024-07-11",
    "content": "Now that I'm listening closely there's heavy tremolo *all* over every element of this record:\n\nThe synth melody @ 0:52\nVocal sample @ 2:09\n\"One\" @ 2:19\nVocal sample @ 2:21",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1262397206506242182",
    "author": "Sam Segarra",
    "date": "2024-07-15",
    "content": "This might sound a bit noob-y, but does anyone have some very generic/stock-sounding house kick samples that they can send me or a sample pack they can point me to? Thanks in advance!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264456507341144074",
    "author": "Rob Domos",
    "date": "2024-07-20",
    "content": "What’s your favorite splice alternative where the samples sound in browser how they actually sound in DAW? The playback on splice is so inaccurate that it makes picking a sample more of a crapshoot",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264521677275136000",
    "author": "oaklandmatt",
    "date": "2024-07-21",
    "content": "I use loopcloud as well as splice. Loopcloud is nice. It has a slightly different library/ style/ sound.\n\nYeah the splice algorithm is a little strange. I actually find it most strange with one shots, where it adds that little pre-transient sound to a lot of samples.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264591278805483631",
    "author": "Josh",
    "date": "2024-07-21",
    "content": "Cubase and Ableton browser filled with splice samples",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264593904506900490",
    "author": "Maxim",
    "date": "2024-07-21",
    "content": "Sometimes the stretching does something that can't be copied even with that feature. In that case gotta resample the audio coming from Splice Bridge in a separate Ableton track.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264608855040458922",
    "author": "Ross Fortune",
    "date": "2024-07-21",
    "content": "Yeah good point. It’s just that usually when I’m auditioning parts from splice, it’s early on in a writing / prod context and I just want to keep moving without engaging the engineer brain",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264609279370068110",
    "author": "Maxim",
    "date": "2024-07-21",
    "content": "Ah yeah I'm auditioning mostly within the context of the song letting Splice change the pitch/tempo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264653579898327060",
    "author": "Rob Domos",
    "date": "2024-07-21",
    "content": "This type of solution assumes that I’ve already downloaded the sample no? Currently I like the ability to scroll through all samples in existence and just download what I need. I just want it to not have insane monitoring processing on it at the same time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264665972124422265",
    "author": "Josh",
    "date": "2024-07-21",
    "content": "Oh loop cloud looks very sick",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265086994015326314",
    "author": "Keegan",
    "date": "2024-07-22",
    "content": "Anybody know of good sample pack makers doing live drum loops? I used to use The Loop Loft stuff but I guess they aren't making new stuff anymore. I know Circles is good, but I'm hoping to find stuff that's less rock oriented than that. Ideally groovy Anderson Pak style stuff but open to checking out whatever!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265087675686326312",
    "author": "Slow Hand",
    "date": "2024-07-22",
    "content": "Not sure where the best place is to hear audio examples. I guess there are several free or trial sample packs you can download first.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265088357919363205",
    "author": "Keegan",
    "date": "2024-07-22",
    "content": "Thanks @Joel \"Roomie\" Berghult @Slow Hand !! Excited to check these out. I actually remember looking at the Kount stuff a few years ago but I assumed it was mostly one-shots for some reason",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265089772947243028",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-07-22",
    "content": "Seconding That Sound \n@Keegan check sean hutchinson (bleachers drummer) if u like it a bit dirty. On splice.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270134222849310740",
    "author": "Chad Rodgers",
    "date": "2024-08-05",
    "content": "Does anyone know what that stabby synth sound is, that you hear on some of those classic 1990s Max Martin records like Hit Me Baby One More Time? You can also hear it in this too at points, and I’m sure a tonne of other songs from the late 80s/90s…\n\nhttps://youtu.be/OAwaNWGLM0c?si=PvIF550SPBWLEVqj\n\nI’ve got an artist who wants to throw jt on one of her new ones but I don’t want to half ass it and just sample or w/e…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270445897238712495",
    "author": "FlugeBluge",
    "date": "2024-08-06",
    "content": "I've heard good things about Superior Drummer, but I'm also interested in something where I could occasionally import or use external sample packs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270588480665292830",
    "author": "FlugeBluge",
    "date": "2024-08-06",
    "content": "I'd like to have a detailed library like SD but would also like the option of importing one shots, external samples, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1273278552485396671",
    "author": "conor // wbotm",
    "date": "2024-08-14",
    "content": "Ugh having a nightmare trying to get the new spitfire labs up and running on my old macbook... the new version only supports OS11 and above, I was able to install and open on 10.13 but am just greeted by a blank white screen. Anyone else tried to get the new version running?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276541181400191118",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-08-23",
    "content": "Some of the kontakt stuff (Giant and Grandeur) could work too. Just turn the hard/soft knob all the way to hard and the transient/sustain fade all the way towards transients and it should get you there combined with the stuff Noah and Josh already said",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277728192152600759",
    "author": "Rollmottle",
    "date": "2024-08-26",
    "content": "My buddy and I are working on a remix. It's being done in Ableton. He tinkers with parts on his own in Logic against the rough and he added a great part with a Logic instrument that is good...but it has a very specific effect that I'd like to recreate in Ableton. Anybody have any thoughts on how to get this rhythmic gating effect using Ableton effects or know of a plugin that makes this trivial? I've included a sample of the audio, a screenshot of the Logic patch and a screenshot of the very straightforward MIDI from which it is derived. (Worse comes to worse we can use an export of the audio, but would like to see if I can crack it for maximum flexibility).\n\nI tried fucking with Beat Repeat and it's close, but not quite the same. Anybody have any bright ideas?",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1277740902353469460",
    "author": "Edward Rivera",
    "date": "2024-08-26",
    "content": "Mostly just the transientshaper and the limiter. I was using the gate for a while but found that it somehow introduced a lot of phase shift. Could be wrong there, but yeah didn’t like what it was doing when trying to mult out close mics of a drum kit with some gating.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277762269924556874",
    "author": "youngteam",
    "date": "2024-08-26",
    "content": "going to give the limiter and gate a shot! not doing much multi mic drum kit work over here so I might not run into the same problems",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278120636148879372",
    "author": "Ross Fortune",
    "date": "2024-08-27",
    "content": "Use the half time thing to half speed a drum loop and have it play behind its full speed self. Sometimes is a vibe and you can audition in real time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1280282346167468224",
    "author": "Rob Domos",
    "date": "2024-09-02",
    "content": "Whats a good plugin that can do OP-1 style sample manipulation to make drones/arps/ambient 1975/fred again types background shit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1282776261604671598",
    "author": "Zach Hughes",
    "date": "2024-09-09",
    "content": "It is interesting. More beginner oriented. I've seen many selling VST packs, sample packs, presets, etc... Could make sense to bundle it all up and make available across multiple DAWs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283890235985629235",
    "author": "Adam Thein",
    "date": "2024-09-12",
    "content": "A full copy of Kontakt and a few hours combing pianobook.uk also a valid option if they dont mind doing some digging",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283989922247610369",
    "author": "Skyler Young",
    "date": "2024-09-12",
    "content": "People keep telling me to check out pianoteq - crazy that’s it’s not sample based!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312946187795697754",
    "author": "Slow Hand",
    "date": "2024-12-01",
    "content": "What do y'all do to bring sonic coherence to drum kits made from one-shot samples? I'm regularly building up my kits from disparate samples (no live drums) and often struggle to make them sound like one kit. Of course I don't have the benefit of ambience from drum mics in a room. So how do you make it all gel and not feel so disconnected?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312972900285808763",
    "author": "Slow Hand",
    "date": "2024-12-01",
    "content": "What would be really helpful would be a way to inject variations into static samples. I'd like an AI tool that takes a static drum sample and renders 10+ variations that can be used for velocity or round-robin variations. *That* would be a cool tool.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312977875997163551",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-01",
    "content": "Got a few options for you, spent a lot of time on this kinda thing\n\nKlevgrand OneShot has a really comprehensive humanization tool\nXO has a setting where it cuts off more and more of the start of the sample as volume goes down. Works surprisingly well\nVisco can re-synthesize and morph between drum sounds, as can Backbone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312980990846566511",
    "author": "Will Pragnell",
    "date": "2024-12-01",
    "content": "when you say “sound like one kit”, do you literally mean sound like a drum kit, or do you just mean sound like they fit together in some harder to describe way (e.g. like many of the best electronic beats)?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312983253589823591",
    "author": "Slow Hand",
    "date": "2024-12-01",
    "content": "Good question. I'm interested in both: How do you make disparate \"acoustic\" drum samples or one-shot synthesized/hybrid drum samples cohere into sounding like a unified kit?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312983680154599475",
    "author": "Slow Hand",
    "date": "2024-12-01",
    "content": "Glad to see people doing new paradigms for drum samplers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312998472537866281",
    "author": "Rukie",
    "date": "2024-12-01",
    "content": "Tony Maserati has mentioned using a room sample to go with the drum machines to make it feel more like someone playing drum in a room on one of the MWTM interviews. \n\nI’ve also seen people approach it the other way around where you take a drum recording, keep the overheads/Room but replace the close mics with drum machine samples. \n\nI have a feeling that the latter might be the move for what you are looking for.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312998472646918276",
    "author": "Josh",
    "date": "2024-12-01",
    "content": "Have you tried using a multi-sampled instrument as the “base” and then using your one shots to build it out further?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313036038020661251",
    "author": "vostral",
    "date": "2024-12-01",
    "content": "I have a couple of That Sound acoustic drum sample packs (available on Splice and very fresh!), when i use the one shot kicks, snares... i'd like to use another layer using the Ableton effect rack on the Drum Bus. That second rack would be highpassed and equipped with a Room reverb. Thats how i emulate the overhead and the room  tracks of live drum recording. And Ableton Effect Racks allow me to layer more to make it not sound like one-shot samples playing!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313297780831424532",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-02",
    "content": "(for the drum sample variation stuff)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313311471073103944",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-02",
    "content": "Haha that’s fair. Got some bitcrushing artifacts on the higher levels so that’s why. I always throw in some Oliver sample with some reverb, stereo spread and crisp high end to stress test it. Resynthesis is hard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315098785294061630",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-12-07",
    "content": "anyone else running into this even though you a have a full, upgraded version of Kontakt? For context: I was trying to pull a sample into Kontakt to play and then this popped up",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1315100760114991247",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-12-07",
    "content": "I ran Pro Tools in Rosetta to run OG Kontakt and it works so lord knows what's happening here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315214431118032917",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-07",
    "content": "only thing I can think of is the annoying \"Kontakt\" vs \"Kontakt 7\" installations if you have both. \"Kontakt\" (6) was supposed to be the last update I believe (similar to Windows 10) and then they changed their minds, the naming scheme drives me nuts",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315345479235538964",
    "author": "gatewoodsensei",
    "date": "2024-12-08",
    "content": "I’m actually looking at doing the same thing. I keep wanting to buy more samplers instead of really learning the shit I already have. Kontakt is super powerful. Just need to dig into it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315369551575384135",
    "author": "LAPhill",
    "date": "2024-12-08",
    "content": "Wouldn’t call myself a power user since I haven’t done much scripting in it, but I’ve built my own sample libraries and use it constantly. If you’ve got questions, hit me up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315384068283695176",
    "author": "hyanrarvey",
    "date": "2024-12-08",
    "content": "I have a friend that is fantastic at kontakt scripting I can give you his info and ya’ll can chat it up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315392117991936051",
    "author": "Slow Hand",
    "date": "2024-12-08",
    "content": "This is great. Exactly the kind of stuff I'm looking for. I want to see people who are using Kontakt every day doing musical stuff that works for them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319741715711529053",
    "author": "Jeremy Klein",
    "date": "2024-12-20",
    "content": "Hey!! Im looking for a creative piece of hardware gear that will spur new musical ideas. Preferably with sample manipulation, but open to anything. \n\nThink Korg Kaoss Pad, OP-1, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319744935766921217",
    "author": "Zack Hames",
    "date": "2024-12-20",
    "content": "So, I think it’s superbly underrated. Especially the new Akai MPC lives, one, etc series.\n\nI use it as a drum machine/sampler/sequencer for all of my hardware synths. It’s the brain and controller for everything.\n\nBut you can also use it completely on its own, you can put any sample all the way across a keyboard/pads to the correct pitch automatically. \n\nThere are built in AIR effects. You can time stretch, etc do whatever with samples. \n\nLoad up any drum samples and go to town. \n\nIt also has some built in instruments / synths, but I rarely use those. \n\nIt’s essentially a portable DAW as far as music production. I prefer it to computer by far for producing / writing with samples and synths",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1320131094510833797",
    "author": "Will Pragnell",
    "date": "2024-12-21",
    "content": "You can get a used mk1 Elektron Digitakt for under $400 these days and in my mind that incredible value for a very cool very fun sample based groovebox. Super creative, sounds great, can't go wrong!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328819332456910919",
    "author": "ehutton21",
    "date": "2025-01-14",
    "content": "Bit of a niche request here but does anyone have a VST recommendation for a saxophone or horns ? Doing a really specific thing, and as much as I would love to do a real sax I’m not sure that’s within our framework. Playing around with a sample idea or two but not sure if we’ll find what we want",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1329250062941028493",
    "author": "andrew_yv",
    "date": "2025-01-15",
    "content": "If you want realistic playability and flexibility of an instrument that can do basically anything you think of, the Audio Modeling SWAM saxes and brass are great, but they require some heavy handed processing to sound good. Otherwise, for more traditional sample based stuff that sounds better straight off I second @LAPhill on Swing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1332692368003956830",
    "author": "esquinalee",
    "date": "2025-01-25",
    "content": "I was thinking the same thing. Do you know if you will still have access to the samples in the splice application after canceling or will it be necessary to offload them into a separate folder?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1332877572161146963",
    "author": "Jonathan Arnold",
    "date": "2025-01-25",
    "content": "What are your favorite vsts/kontakt libraries/… that spark often some new ideas for you?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1332878131836751893",
    "author": "Jonathan Arnold",
    "date": "2025-01-25",
    "content": "For me it is Slate + Ash Primaries, Spitfire Cells and realitone nightfall. Additionally the Arturia Fragments plugin",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334360531028414464",
    "author": "oaklandmatt",
    "date": "2025-01-29",
    "content": "What are y'all using to record audio from the internal computer? I'd love to sample more easily off the internet, but I don't have a good current app/ plugin.\n\nWhat's the latest version of this y'all like?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334670724736090183",
    "author": "BatMeckley",
    "date": "2025-01-30",
    "content": "Blackhole works for me to sample things off of Apple Music or YouTube direct into my MPC program",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1338021799748702240",
    "author": "Jeremy Klein",
    "date": "2025-02-08",
    "content": "Reminder to myself: instead of starting a new loop on the downbeat, it can feel way cooler to take the last beats of the loop and start it on the 3rd or 4th beat before the loop’s entrance",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1338591929503584437",
    "author": "Jeremy Klein",
    "date": "2025-02-10",
    "content": "how those drums come in on the 4 before the loop starts.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1338597870604914860",
    "author": "kieronmenzies",
    "date": "2025-02-10",
    "content": "Wait have you heard the sample source from Penguin Cafe Orchestra because it IS a pickup on the original. https://www.youtube.com/watch?v=RWZ4pve5Mkc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340219182830321685",
    "author": "OJ",
    "date": "2025-02-14",
    "content": "what are some recent unique high quality sounds / sample packs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341869816318791852",
    "author": "NoahNeedleman",
    "date": "2025-02-19",
    "content": "Yall have any insight for finding 6/8 loops on splice?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341906127952281663",
    "author": "Zakhiggins",
    "date": "2025-02-19",
    "content": "I was thinking this the other day, it's a pain in the arse that you cant filter by time signature. I've had luck just typing in 6/8 or 3/4 and searching like Matthew and Chad said, but not always. Tried to find something in 5/4 last week and nothing. \n\nWhat works for me though is just finding something in any time signature and chopping it up a bit to make it what you want. Slice it and fade it in the right places and it'll sound good as new.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1347102214555963443",
    "author": "diamndsdancin",
    "date": "2025-03-05",
    "content": "has anyone paid to learn how to create samples/loops like people like crptc, nami, reske, any of these great sample makers?\ntrying to upgrade my skills and wonder if any are worth investing into",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1348255858189926440",
    "author": "louisvie",
    "date": "2025-03-09",
    "content": "Anyone had gotten the Splice pack  Serj Tankian made ? I had grabbed a dozen sounds from it and wanted to get some more, but It seems discontinued, unavalaible / cancelled. Can't find it in France at least. 😢 \n\nhttps://splice.com/sounds/splice/serj-tankian-pack",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1350170905682247740",
    "author": "diamndsdancin",
    "date": "2025-03-14",
    "content": "yoo\ni have this drum loop that is in like a similar genre we're hearing today and i want to know the name of it, does anyone know? i think drake has some little boogie songs to this kinda pattern right now, other artists too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353172953939972188",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-03-22",
    "content": "Only barely. But I’ve realized I want to use it as a drum sampler/layering tool. Built a crude humanize/dynamics/etc patch from one shots and the sky is the limit, even compared to drum plugs and kontakt",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353174385216847872",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-03-22",
    "content": "Awesome! I was a little bummed there’s no proper multi sample creation support in the app and .sfz is a wacky format, but working with single samples is all I need generally",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360211353960186019",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-04-11",
    "content": "Anyone know of any sample libraries with modern sounding electric/acoustic hybrid sampled drum kits with many velocity layers/round robins?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360253363261804574",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-04-11",
    "content": "Maybe it's hard to explain, here's a rough example of some one shot kits for reference. Looking for something similar that has velocity layers and round robins",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1366422148884860928",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-04-28",
    "content": "You been messing with it? What’s your read on the fluid sample transitions or whatever they called it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1384380153676959776",
    "author": "vostral",
    "date": "2025-06-16",
    "content": "Here are two samples including a static loop and a groovy loop.\n- On the static loop, I use DX drum machine HiHat and just barely put them 1/8 on the grid\n\n- On the programmed loop, I adjust the gain up & down for each hat piece, fade in/out to get varied length, time adjusting, and finally a Tremolo.\n\n=> These make such a big improvement in the feel. This is crucial for anyone using samples instead of real drum machines or Kontakt…",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1388726830244040776",
    "author": "NoahNeedleman",
    "date": "2025-06-28",
    "content": "Splice is a great start- there’s a few phrase based instruments for Kontakt that might be worth looking at. INDIE is my fav for more folk shit but I bet that have Latin ones too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389065497022304257",
    "author": "Juliette",
    "date": "2025-06-29",
    "content": "Is it possible to make your own drum kit within ProTools by dragging and dropping samples onto an empty set?\n\nBasically how Ableton does it. But with the new addition of the Splice integration, I’m wondering if I can drag and drop these samples directly onto the drum kit (if creating one is even a possibility).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389071102873174088",
    "author": "Juliette",
    "date": "2025-06-29",
    "content": "Nevermind. Figured it out and it looks like that is gonna be a no-go from Splice.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389075982614270075",
    "author": "Juliette",
    "date": "2025-06-29",
    "content": "I saw Sitala pop up as well, I’m definitely going to give it a shot, thank you for the recommendation! \n\nIt’s not a huge deal but I will admit, I like Ableton’s workflow a little better when it comes to drum kits. But it becomes inconvenient when I’m doing basically everything else in ProTools 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1391034656379371543",
    "author": "Jonathan Arnold",
    "date": "2025-07-05",
    "content": "What do you guys reach for when you want to add percussions/bongos/.. to add more texture and excitement to your tracks? Splice, Kontakt libraries or even AI Tools? Any recommendation?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1391066032101392537",
    "author": "Jonathan Arnold",
    "date": "2025-07-05",
    "content": "Do you have a recommendation for a splice pack?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1391349480682422334",
    "author": "Ross Fortune",
    "date": "2025-07-06",
    "content": "Fruit Shaker is a free option by In Session Audio - they also make Shimmer Shake that Beckley mentioned \n\nI’m generally reaching for splice for congas etc, or just tracking my own shakers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392198316565069836",
    "author": "thegreatcarsoni",
    "date": "2025-07-08",
    "content": "In what ways could someone regard a kick drum choice to specifically carry the story of the record? Any examples of this consideration? I hear the idea of production choices supporting the story but rarely broken down as A) what is the story and how do we find it? B) how can a kick drum or percussion loop or compressor choice support that story? What should we be thinking about to make those connections intentional?\n\nHow does one go beyond “this element fits the frequency and dynamic space I need filled”?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1395122834174382242",
    "author": "aliberger",
    "date": "2025-07-16",
    "content": "snd is the mpc's native format for saving sounds, once you get the wavs loaded into memory i believe they can be saved as snd files. pgm files are programs (data like which sample is assigned to which pad and all the parameters around that) which you create on the mpc. programs don't contain any sound data themselves, they reference the sounds by filename",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396237142182854728",
    "author": "spectrummasters",
    "date": "2025-07-19",
    "content": "So , you can do computer wavs ->mpc .snd via digital transfer (floppy / flash card or spdif) but you’re circumventing perhaps the best part of the mpc (the sampler ) and gonna run into file naming and format problems",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1397828510034296843",
    "author": "Slow Hand",
    "date": "2025-07-23",
    "content": "I get that error from Kontakt all the time. There's nothing to it. Barely a bump in the road.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404615948593397893",
    "author": "BatMeckley",
    "date": "2025-08-11",
    "content": "This. \nIt for some reasons gets a lot of guff from synth heads, but between it and the kontakt synths I feel I have more sw synth than I’ll ever need. \n\nPlus with arturia, for like $100 you can get their cheapest little midi controller and the physical knobs integrate well with the software, giving you more of a hardware synth experience",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404616167703711764",
    "author": "Zack Hames",
    "date": "2025-08-11",
    "content": "I’ve got all the kontakt stuff which feels a little hit or miss for me. Everything’s so “done” sounding, it’s tough coming from “build sound from scratch” brain",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1404740797567471686",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-08-12",
    "content": "Besides everything else mentioned (Arturia, Serum, Kontakt) I found Omnisphere to be a very underrated and powerful synth rather than just a pre set machine what 99% of the people who have it are using it as \n\nTo me it still has the best sounding oscillators and unison out there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411881767358435459",
    "author": "Rollmottle",
    "date": "2025-08-31",
    "content": "For those working across two computers, how are you dealing with your sample libraries...you putting them in something like Dropbox and having that feed the computers?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411885213461512202",
    "author": "Rollmottle",
    "date": "2025-08-31",
    "content": "I just discovered Syncthing...allows me to push from the Samples library folder on my stationary computer and have it be consumed by N computers i add to the share (namely my mobile one). does peer to peer syncing too. my hesitation with the Dropbox solution was the prospect of moving my Sample library to Dropbox and re-linking every project or creating a second copy of the Sample library.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411899489060520016",
    "author": "Rollmottle",
    "date": "2025-08-31",
    "content": "1. Yup, just my years and years of one shot drums and short loops. \n2. Have used that before, but I would have had to either move the existing folder or create a new shared one. I use this for all my masters on my mastering rig.\n3. And there's the rub...I haven't historically used that until recently because I never thought about it. Now I do it religiously. Everything would probably open fine and I'd just have to relink, but it did give me pause.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1416046289900011552",
    "author": "SoundsLikeJoe",
    "date": "2025-09-12",
    "content": "Sanity check...    I came up producing with sampled drums, and always seemed to get fine sounds.  The last 5yrs, I've done almost exclusively live drum sessions.  Today I'm back to programming, and EVERY SINGLE snare and kick sample just sound squashed and hyped.  Over compressed?  High shelf boost? Very clicky kicks. Very flat snares. Idk...   just doesn't sound very satisfying and I want my drummer here, please. This is after digging through Addictive Drums 2 and the basic Superior Drummer. \n\nCan you confirm?  Should I look to upgrade my samples or find other kits?  What's your go to drum samples for programming rock?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417471328528760853",
    "author": "Iwan Morgan",
    "date": "2025-09-16",
    "content": "Make a random quick swipe comp of anything. Don’t listen to it. Loop it. Add complex fx chains. Keep adding sounds without listening. After 3 or 4 layers listen back and see the mess you’ve made. I guarantee there will be something to build on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418298971817906196",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "Does anyone have any Sampler plugin alternatives they prefer over Battery? It *works* but I have constantly struggled with the workflow and the way everything is set up by default (and seemingly can't be changed). It slows me down dramatically.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418301574047858698",
    "author": "Slow Hand",
    "date": "2025-09-18",
    "content": "What are the three most important things that you need to prioritize in a sampler?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418310705106387166",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "-Pro Tools\n-when i load samples they 99% of the time automatically load as loops. and it takes at least 3 clicks or more to get it to just be a normal *one shot* that is triggered.\n-when I try to move the knobs for things like velocity or pitch, it gets stuck/doesn't work. I just found that if I use the scroll wheel, that seems smoother/consistent, but I hate the feeling of doing that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418310872975016097",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "I want a sampler that I can look at a browser, click and/or drag like Battery, but it just lands on the damn key, and when I hit it, it plays the fucking sample instead of forcing me to hold the key down for the entirety of the sample to play, and then starts looping it by default.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418311133202481182",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "I don't give a major fuck about being able to tweak the sounds other than pitch within a sampler. (don't need effects or EQ built in necessarily but it can be nice)\nI do like using battery for key-tracking samples. but again, it still loads everything as a fucking loop by default. I just read the *entire* manual, there is 0 way to change the default way it loads in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418312427656708166",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "here's the workflow:\n\nI don't use many of the preset kits anymore. Just not really the sounds I'm looking for. I have a massive library of samples that i like to use. Accessing those is easy.\nThe problem is I don't make preset kits. Every session, every kit, is a different combination of things, always starting fresh. So I am in the Library view constantly going through samples/files to load into any Cell of Battery.\n\nWhen I find a sound I like, I can click it or drag it to the cell I want. This is all great.\n\nBut, the second i drop it in, I have to change the velocity from 0-100% (I saved my default preset to have all cells at 0% velocity which seems to be working). and then *every time i add a new sample or replace a sample* it makes it a loop in the \"Editor\" window. There is no shortcut, no preference, no saving a preset, that allows me to essentially remove that behavior.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418314216774959278",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "which just shows you how to make every individual cell not a loop. but the second you drop a new file in, boom, loop activated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418314309938712677",
    "author": "cian riordan",
    "date": "2025-09-18",
    "content": "Ya I’ve never had this loop thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418314514310500383",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "And I'm guessing you're using any number of samples from anywhere, not just their built in sample library?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418316605963894904",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "I've got my prophet 6 going midi out to a MOTU midi USB interface...it doesn't matter if I use that, put a midi note in the piano roll with my mouse, or if I click the cell to hear the sound, it all behaves the same way.\n\nI am going to experiment with the files themselves and where the files live to see if it fixes anything.\n\n\"load into cell\" so far has not worked. it just sits there and nothing loads in. IDK if that's a sample rate issue of some kind",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418316725568667781",
    "author": "Zack Hames",
    "date": "2025-09-18",
    "content": "thanks for all the help ya'll. I am going to try to fuss with it, I'm sure I can find some work around or solution or just use a dif sampler for this specific use-case.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418319249050570772",
    "author": "Will Melones",
    "date": "2025-09-18",
    "content": "I'm loving Sitala for a much leaner drag n drop sampler, but GrooveCell may also fit the bill for free",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1421180935591694436",
    "author": "spectrummasters",
    "date": "2025-09-26",
    "content": "When I was in pro tools I used to use reasons nnxt via re-wire into pro tools so it used pro tools audio engine . (And dr Rex player for chops) . NNXT sounds great , intuitive , drag and drop and great proper  sampler behaviour . These days it’s multi sampler in logic .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1425460889922048232",
    "author": "Iwan Morgan",
    "date": "2025-10-08",
    "content": "Has anyone found a decent ipad app/sample set of the Suzuki Omnichord? I’m gutted I sold mine about 10 years ago and an artist I work with mentioned wanting to try the sounds out on the new record we are making together.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430705119191760926",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-10-22",
    "content": "Does anyone have a loop of a 16th note snare roll/buildup that leads into another section like a chorus? \n\nLike in this song at 0:00 and at 2:19\n\nhttps://open.spotify.com/track/7s0xV4DZ7g4y3kd0FtSfIz?si=13991db0b0f64706\n\nI'm sure there are tons of other songs that do this but this one is the only one that comes to mind rn",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430896399180103812",
    "author": "Ross Fortune",
    "date": "2025-10-23",
    "content": "You also have a clean couple of bars of it at the top of that song if you can sample it direct, or use that as a guide to recreate",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1431660790124908634",
    "author": "Jonathan Arnold",
    "date": "2025-10-25",
    "content": "What do you guys reach for when you want to add stomps or claps to your Production? A VST Library? Splice? I am on the fence of getting: https://www.bozdigitallabs.com/el-clapo/?utm_campaign=Prospecting+%2F%2F+CBO+%5B9.10.25%5D&utm_source=facebook&utm_medium=paid&hsa_acc=137005211&hsa_cam=6972048258009&hsa_grp=6972048258209&hsa_ad=6972055249009&hsa_src=fb&hsa_net=facebook&hsa_ver=3&fbclid=IwY2xjawNpvJZleHRuA2FlbQEwAGFkaWQAAAZXUTzJWQEetOEKPsfVAGeYdiO1M0OtBFYAltqLJ8FooLIevMKJu2tsrPHkwhRy3v7tJ_Y_aem_kAUUJRDqJTLc0SLIv7L9Tg&utm_id=6972048258009&utm_content=6972055249009&utm_term=6972048258209",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1444098766310215750",
    "author": "cian riordan",
    "date": "2025-11-28",
    "content": "Single sample nudge club",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453745152500699233",
    "author": "spectrummasters",
    "date": "2025-12-25",
    "content": "One of the most helpful things to break out of the 4/8 bar loop of death is to begin your project with the audio file of a track you love the arrangement for imported . \n\nMute it and set your project to its tempo (it’s just easier ) \n\nNow get to jamming away \n\nOnce you’ve built the loop you adore , \nMute it \n\nListen again from top to bottom the track you love the arrangements for . \n\nListen to how the different elements come in and out , where , how . \n\nHow are the motifs evolved . Any counter melody / rythms .\n\nDrops and breakdowns \n\nMake notes of it all . \nThen copy it exactly or to the degree you want with your own elements of your loop . \n\nVoila . You made a fully arranged track . \n\nRepeat",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1453784054393602150",
    "author": "Akanksha",
    "date": "2025-12-25",
    "content": "I tried importing a favorite track of mine and then putting in markers to imitate sections for the song I was making. Failed horribly because then I started to copy every single element of the track which made me so annoyed with myself.\n\nWhat you said might be just the thing I needed to know to start arranging well. \nI should first create the loop and 'then' listen to the imported track to help with arranging. \nIt's so much more intuitive.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1455192624586686476",
    "author": "Ross Fortune",
    "date": "2025-12-29",
    "content": "Are folks just grabbing serum presets from Splice, or are there any other choice sources I’m missing?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456949294321107076",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-03",
    "content": "Good shout, appreciate the thoughts!\n\nThe libraries have velocity curves per kit item built in, been mucking about with it but there's a mix of not enough velocity layers (which get even more uneven spread when changing velocity curves), few round robins, not enough variety in the samples, and just something else with the response I can't put my finger on. \n\nI starting to think there might be an inverse correlation between basic mix-readiness/consistency and play feel. \n\nCurious where M&M2 falls, but a bit daunted with the opportunity cost of familiarizing myself with another full-featured sampler/mixer 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1456958492358348801",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-03",
    "content": "Good shout, gonna try messing around a bit more with that! \n\nAnother part of what makes these kits sound so good are boost layers/one shots that suddenly pop in at certain velocities, I might turn them off. But that also makes it sound entirely different, almost like tracking with a different guitar amp 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457005506307817534",
    "author": "hyanrarvey",
    "date": "2026-01-03",
    "content": "Ggd has features like this in its sampler",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457018628552658945",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-03",
    "content": "Yeah!! No kontakt and some kinda modeling to make it more expressive",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457019239637454991",
    "author": "hyanrarvey",
    "date": "2026-01-03",
    "content": "Yeah the built in mixer is interesting esp with the one shots",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460733432211574804",
    "author": "Slow Hand",
    "date": "2026-01-13",
    "content": "Unfortunately the Ableton beats mode algo (simple though it may be) doesn't really exist in any other product that I know of. It sounds like that would be a worthwhile script for someone to write themselves. Then - if you're feeling ambitious - you bulk process an existing sample library to strip the ambience.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460735156255064348",
    "author": "Rob Domos",
    "date": "2026-01-13",
    "content": "So like, I may actually see what it takes to make an anechonic sample pack",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465778391470047508",
    "author": "LAPhill",
    "date": "2026-01-27",
    "content": "I know the Spitfire guys have done a few tutorials on string programming, can't say I've watched them myself. They should cover the basics though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465778568415150121",
    "author": "BatMeckley",
    "date": "2026-01-27",
    "content": "To be fair to the original “content creator” when I first started composing I didn’t really know this, and the spitfire tutorials really helped me learn what I’m sure was obvious to most pros.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1466636293231476747",
    "author": "Will Trotman",
    "date": "2026-01-29",
    "content": "Depends on the use case but sometimes I like using just the verb from another sample too. Not helpful for “impact” necessarily but can add perceived tonal differences to the original sample.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472300300676366557",
    "author": "Beck Nebel",
    "date": "2026-02-14",
    "content": "Not quite following here. You have a sample that’s tonal and a single note?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472300526988300514",
    "author": "Beck Nebel",
    "date": "2026-02-14",
    "content": "And you don’t really covert a sample to midi - you can use midi to play a sample by using a sampler as your instrument",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472302398885069084",
    "author": "diamndsdancin",
    "date": "2026-02-14",
    "content": "i put it on the audio track of the brass sample and just recorded \"transfer\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1473485249467121847",
    "author": "Slow Hand",
    "date": "2026-02-17",
    "content": "Maybe it's just my taste, but if I'm sequencing sampled instruments I'm not trying to sample guitars and I don't think we need another drum library, either. Drums and percussion already translate well to sampling (for the most part). \n\nI want strings and woodwinds, or brass. Gimme some of that, and make it something with some real energy and excitement. Their platform seems capable of expressing things that traditional sampled instruments cannot do, so lean into those strengths and make the parts a little more opinionated. A little more unique.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]