[
  {
    "id": "1370166472554582087",
    "author": "Nomograph Mastering",
    "date": "2025-05-08",
    "content": "I think all other mastering engineers should follow the -2dB peak standard",
    "reactions": 35,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461871659974791451",
    "author": "jonmatteson",
    "date": "2026-01-16",
    "content": "Yall I just got a master back from @Berlin and he made my mix/production sound so much better it’s blowing my mind. Not sure what voodoo he put on it but just wanted to take a moment to celebrate a badass mastering engineer in the chat",
    "reactions": 28,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1326303979118002340",
    "author": "cian riordan",
    "date": "2025-01-07",
    "content": "Hey mastering engineers, please don't do this to us.",
    "reactions": 27,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1284694760107278408",
    "author": "masteredbyjack",
    "date": "2024-09-14",
    "content": "This is great to see. And something I think is really great about Ruairi is not only does he do amazing work, but he really, truly helps people in the real world. I've said it before, but he's the most consequential person I've met in my music journey. And a lot of what I've gotten from him he probably doesn't even realize, but he really cares and puts time into the music and people. \n\nA huge inspiration both as a mastering engineer and human. Thanks Ruairi!",
    "reactions": 26,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068282247939096626",
    "author": "Nomograph Mastering",
    "date": "2023-01-26",
    "content": "The dedication with which a Mastering Engineer advocates -14  is inversely proportional to the amount of records they’ve done that you’ve heard of",
    "reactions": 21,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1100508635794247832",
    "author": "peterlabberton",
    "date": "2023-04-25",
    "content": "Hiring a mastering engineer seems like hiring string players: either get a fucking pro, or don’t bother",
    "reactions": 21,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374918201317785722",
    "author": "sethmanchester",
    "date": "2025-05-21",
    "content": "@hebakadry  taught my dumb ass over many years of patience that loudness is built in the mix which really shook up my workflow 8-10 years ago... that being said, after many years of working together we've recently collaborated on a few projects where I intentionally didn't take it easy on the mix bus but still encouraged her to push it further and get as creative & collaborative with the master as she wanted to. It's resulted in some of my favorite sounding records I've ever been a part of. She respected the mix, but took chances and didn't just hand me back my mix. Out the door they were some of my favorite mixes I've ever done and Heba brought something else to them that I couldn't or wouldn't have thought to. I trust her taste & I asked for her imprint. I think there's a way to do both... you can 100% encourage a mastering engineer to push things further and forward without undercooking a mix... but it definitely requires an alignment of taste and trust.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028204422431518760",
    "author": "cian riordan",
    "date": "2022-10-08",
    "content": "Ruairi fishing for deep cuts! The best experience I ever had was over a decade ago. Having spent a considerable chunk of time recording an album for & with my best friend -- we asked Eric Valentine to master the record and he said yes. Having worked under for him for a few years at this point, it felt like a bit of a reckoning... having him critically listen to something I had really poured my all into. Needless to say, he treated it as he treated everything... with genuine curiosity and actionability. He sized up the mixes in no time, told me the strengths, the weaknesses, even sent me into the other room to re-print versions slightly quieter, fix this pop here, maybe put the guitar solo up here. He gave it his full 12 hours (what felt like 100 hours to me) and the end product leveled up in so many ways. Granted he is not really a 'mastering engineer', but he approached this little project like he approached everything in his music career, with a deep sense of giving a fuck and knowing that there's no real excuse to not fix the obvious issues in front of you. The album sounded fantastic and it really spoiled me for what a mastering experience could be.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469786098652938485",
    "author": "cian riordan",
    "date": "2026-02-07",
    "content": "A new day, a new me… having to do the mastering engineers job.",
    "reactions": 14,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1164231468109791272",
    "author": "chrissorem",
    "date": "2023-10-18",
    "content": "I know what  this mastering engineer needs for Christmas",
    "reactions": 13,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1054834657868390460",
    "author": "hebakadry",
    "date": "2022-12-20",
    "content": "Hey, pretty stoked about this new plugin.  Safe to say there hasn’t been much innovation in the lathe world until this plugin came around…was checking it out a bit in the beta testing phase…for those who aren’t cutting engineers the reference edition is absolutely amazing.  You can get a general sense of how your master will sound to cut and even audition various turntables and cartridges to see how it could sound.  Better language and tools when you’re communicating with your cutting engineer as well.  It also has an amazing visual emulation so you can actually see what’s going on with your grooves.  This is such a special plugin…i don’t get behind a lot of stuff but this is pretty game changing, esp for mastering engineers that don’t cut but actually care about the translation to LP. It was developed with Helmut Erler who was at Dubplates for many years…really amazing dude and friend of mine.  He's cut some really important techno records.  I think the visualization of the cutter head and the grooves will start to make sense to a lot of people that are a bit in the dark about cutting and modulation and how program material can really affect how things sound ultimately…also how you process your master esp when it goes to plants that do in house cuts that are a bit on the safe/boring side.  You can get ahead and provide a master that counteracts some of the wide processing moves they make to avoid distortion at all cost.  Also send your client a ref of what your cut could sound esp when people push back on super long programs that don't translate well https://www.tokyodawn.net/tdr-simulathe-ref/",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1347392792510599269",
    "author": "NoahNeedleman",
    "date": "2025-03-06",
    "content": "Just wanna drop a quick note to my mastering engineers who leave their links active even after the song has been released. \n\nNot all heroes wear capes. Y’all know who you are.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441930393442975957",
    "author": "Rollmottle",
    "date": "2025-11-22",
    "content": "I think having deeply formative experiences with music and records as a normie, way before you knew anything about music and records is a pre-requisite for being a mastering engineer. I don't think you can do the job without understanding what records are capable of doing to normal humans.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377098502181486622",
    "author": "Nick Stetina",
    "date": "2025-05-27",
    "content": "Mastering engineers in 2024: the mix came in smashed and I didn’t get to you use my compressor.\n\nMastering engineers in 2025: the mix came in 100% wet and I didn’t get to use my reverb.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411856006035800065",
    "author": "chrissorem",
    "date": "2025-08-31",
    "content": "Serious question. How does one have an opinion on a mastering engineer if they have never worked with them?  For example if you hear a record for the first time and people say “the masters sounds great” but they never heard the mix before it was mastered. \n👆Sounds like a riddle",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044378603024023653",
    "author": "Rollmottle",
    "date": "2022-11-21",
    "content": "What can record makers (producers, mixers, artists, etc.) learn from mastering engineers? What can mastering engineers learn from record makers?",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1251002055171117196",
    "author": "Slow Hand",
    "date": "2024-06-13",
    "content": "A quick search turned up someone sharing this bank of Ozone presets. They've re-created JJ's patch and saved it as a preset for every available instance of Ozone (v4-v11). Maybe start there and see how it compares.",
    "reactions": 8,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1293259481207017504",
    "author": "cian riordan",
    "date": "2024-10-08",
    "content": "But if it were me, and I've chosen a mastering engineer to finish a project, I'm assuming positive intent on their part and sending them whatever they ask for.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1296848426960552016",
    "author": "chrissorem",
    "date": "2024-10-18",
    "content": "I’m assuming the artist was happy with the mix before it was mastered? If so, I’d ask the mastering engineer to kindly work with what you sent and if they can’t I’d hire someone different",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090824379006464090",
    "author": "masteredbyjack",
    "date": "2023-03-29",
    "content": "Seems to me the market for people wanting to use AI mastering at the moment are those who wouldn’t (and I’d argue are not at the place to) pay a mastering engineer. They just want it to be better, and fast.\n\nI’m with Ruairi, there will be a day that AI will be as good or “better” than almost all mastering engineers, at least in bringing things to center of bell curve. But @Barbara has it exactly right to me — mastering is just shades of “different”…we all react emotionally to different stuff\n\nSo I’ve been chewing a lot on the thought of…how can we be singular? And irreplaceable? In the mastering role, it is much more than sonics. It is communication, enthusiasm, taste, vision, patience, challenging ideas when it’s right, being open to new ones…all of it. A trusted and reliable link in the chain that ideally lets the rest of the creative team focus on what they do best.\n\nSo I’m focusing on developing a singular skill set. Part of that is sonics, sure. But there is also so much more that I think we can bring to the table. If we are singular then we matter and can add something to the art. If we just make things brighter and louder, AI is gonna beat us, and in my estimation, should.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104423070665547808",
    "author": "Nomograph Mastering",
    "date": "2023-05-06",
    "content": "Too many mastering engineers are playing the mastering processing without listening to the song arc",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121092667720343572",
    "author": "Nomograph Mastering",
    "date": "2023-06-21",
    "content": "4) As Jack says I think a lot of Mastering Engineers are a little obsessed with consistency when what listeners care about is “great”. 4 great songs in a row with varying tones and levels are much more likely to get listened to than 4 shitty songs with perfectly matched EQ and perceived level",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1149033502042505246",
    "author": "Jeremy Klein",
    "date": "2023-09-06",
    "content": "LMAO my friend LAST NIGHT was asking me about my ozone preset, and he made this joke",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1332782372051091537",
    "author": "Rollmottle",
    "date": "2025-01-25",
    "content": "Zooming out a bit, part of at the bigger theme of my answer above about Dropbox and my take on forms is about not treating your clients like they are dumb or that they don’t know what they’re doing (I’m not saying anybody here is doing this). I fight against the pervasive idea in the online discourse that the mastering engineer is some elevated wizard who knows more than anybody. We don’t and I want to do everything to not perpetuate that idea, even down to the extremely subtle things like how you deliver files. I think it all matters.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405590070077165732",
    "author": "Gerhard Westphalen",
    "date": "2025-08-14",
    "content": "Why do mastering engineers like the worst possible DAWs? Wavelab, Sadie, Sequoia, Pyramix... It's not 2002 anymore",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411203306176512114",
    "author": "Halliemmelton",
    "date": "2025-08-29",
    "content": "Split mastering feels like such a silly concept from a technical aspect. It’s only the last step, after all.\n\nI get excited when a record is done really well with multiple mix/mastering engineers. It’s proof of pros—from both the creative standpoint and also the less exciting standpoint of good collaboration & relationships. Y’all did great—I love it when pop sounds like freakin good pop",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441834367092527124",
    "author": "Rollmottle",
    "date": "2025-11-22",
    "content": "I don't think what you're describing in the first song is a techincal issue. It's what the team was happy with. If they are happy with whatever they deliver to mastering, the role as mastering engineer is not to transform it into something it's not, but to honor what it is and make it the best version of itself. \n\nThe second example, it's likely how the mix was delivered. Gehringer is no slouch.\n\nIn either scenario, you play the hand you are dealt and do the best to honor what's there.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033036076429873264",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "I realize that it constantly sounds like I’m trying to shut down experimentation or limit people, bind them in some way. But there are these key moments in my life, in the room with Lanois, or Amy Winehouse, or Trent Reznor where it becomes so so clear that we (mastering engineers) don’t make this thing, we are just trusted with it",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050623123663372298",
    "author": "cian riordan",
    "date": "2022-12-08",
    "content": "Yea Ruairi, what Ozone presets did you use?",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086758320280436856",
    "author": "BillyC",
    "date": "2023-03-18",
    "content": "Mastering engineers HATE him for this one weird trick",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100639238145441792",
    "author": "stefanmacc",
    "date": "2023-04-25",
    "content": "I like to send the “rough” as well. Just to give the mastering engineer a REAL challenge",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169769508156735578",
    "author": "Andy Lawson",
    "date": "2023-11-02",
    "content": "Just reading all the mastering/mixer chat above. In my world I am generally the one communicating with the ME (either being mixer or producer/mixer). Over time I’ve just taken to this being my roll. It definitely takes up more of my time without upfront payment but I feel that comes back to you with trust from your client.\n\nMy first listen to the master is what I try to work from. Does the song feel good? (It’s deeper than that but you get my drift). Communicate my thoughts with the artist and ask for there feedback. (I feel like me giving the thumbs up can really elevate their fears and listen freely 🤞)\n\nReasons for being the middle man\n 1. I hopefully can communicate well with both (translating what the artist may want into actual terms) 2. Taking the stress away from the artist 3. taking stress and needless revisions away from the mastering engineer..\n4.hopefully a better end product!.\n\nThat is where I’m at currently but always open to evolving",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293321862943867001",
    "author": "chrissorem",
    "date": "2024-10-08",
    "content": "I had a mastering engineer whom the producer hired recently asking me to check if my non limited mix was in fact non limited I went back to check and it was not limited and then they came back with notes, I think the cymbals and the guitar…….  Which then I responded “please master what I sent you thanks” \n I’m always happy to see if there is something that can be done better etc. But there are many people out there with taste I don’t agree with. Not every master is need me to be “The Savior” and I’ve found this sort of behavior comes from less experienced ME’s.  Sometimes you got to push back and just have them do their best with what was sent for many reasons",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334958790558355589",
    "author": "Nomograph Mastering",
    "date": "2025-01-31",
    "content": "TLDR if vinyl is important to you (it's not to everyone and that's ok - some bands just need merch to survive)\n\n- HIre a Mastering Engineer who understands the format, the stages of production and can QC effectively\n- If you can at all hire a dedicated cutting engineer recommended by your ME over the all in package from plant\n- Choose where your vinyl is pressed based on the most current info your Mastering engineer can access on who is doing mostly good work this year (\"I had a great pressing from URP 3 years ago\" is basically useless info)\n- Be realistic about what's possible",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1335376475804667987",
    "author": "Rollmottle",
    "date": "2025-02-01",
    "content": "I attended quite a few mastering sessions of my own records in my younger days, well before I was a mastering engineer. When I've attended, I stayed out of the ME's way, sat back, stayed quiet, just listened and watched. I had no expectations of learning anything specific, but it was worth it to me just getting a chance to watch an experienced pro do their thing in their environment.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385394717767761932",
    "author": "Nomograph Mastering",
    "date": "2025-06-19",
    "content": "I recommend all mastering engineers argue with their clients, talking down to them etc",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "972303886461313102",
    "author": "Eric Martin",
    "date": "2022-05-06",
    "content": "seriously, the “ozone preset jockeys” here’s the EQ curve for pop music irritate me",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984570848528715898",
    "author": "Iwan Morgan",
    "date": "2022-06-09",
    "content": "For those of you with Mix with the Masters subs, there’s so much knowledge in the new John Davis video series.  Love his approach, reminds me of my long since passed Mastering engineer friend John Dent.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038276529370706001",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "Build a relationship with a good mastering engineer and let them sweat this stuff",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095393778904350790",
    "author": "Nomograph Mastering",
    "date": "2023-04-11",
    "content": "As a Mastering Engineer i never do it and think it’s way overrated in mixing and mastering",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152992602736570449",
    "author": "Chris Doms",
    "date": "2023-09-17",
    "content": "For an album I mixed, the mastering engineer asked me to send everything over at -18dbTP, I was mixing into a limiter so my mixes were “loud” but the band loved where were the mixes were at, I hear the masters on streaming when it comes out and they’re at -18 LUFS.. felt like they asked me to turn things down and then just didn’t rebuild the loudness?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222745160006373387",
    "author": "cian riordan",
    "date": "2024-03-27",
    "content": "The mastering engineers: \"+.0003 dB @ 19k really doing that work\"",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267951005052440719",
    "author": "masteredbyjack",
    "date": "2024-07-30",
    "content": "Of course not, isn’t it their mission to spite mastering engineers?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300844554311827578",
    "author": "Nick Stetina",
    "date": "2024-10-29",
    "content": "Seen in the Mastering Engineers Worldwide group on FB. Probably not the answer Bill was looking for, ha. Still gonna 'cast a vote' with a like on James' post, one can hope it at least gets airtime in a team meeting or email thread at Izotope 😬",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1382465528760766554",
    "author": "Edsel Holden",
    "date": "2025-06-11",
    "content": "I have referenced this many times since it was shared because it does a great job cutting through all the technicalities and putting the focus on the music and output. I realize this info maybe more helpful for mastering engineers fielding questions about loudness, but I was hoping @lystell  could find some good info in this !",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028174127984549888",
    "author": "itaylerner",
    "date": "2022-10-07",
    "content": "For me, I had an experience where a mastering engineer responded to a note of mine (“I’m hearing what sounds like (digital) clipping every time the kick hits with the 808”) with an astute observation as to why it is happening, a recommendation to fix it in the mix process, and then a step by step guide on how to address the issue with minimal affect on other aspects of the mix. This level of flexibility, nuance, and care, was something unprecedented for me in MEs.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067177041998397551",
    "author": "kylem",
    "date": "2023-01-23",
    "content": "I don’t really like to change mastering engineers on a project to project basis if I can control it. I kinda feel like once I’m locked in with someone, I like to keep using them (if we're getting good results) unless there is a budget or time constraint.  It has also really helped me to have 1 person that I trust to get feedback from.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156798240990183546",
    "author": "Gerhard Westphalen",
    "date": "2023-09-27",
    "content": "Probably expected it to be something any competent mastering engineer would do 🤷‍♂️",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1274411424583651361",
    "author": "Nomograph Mastering",
    "date": "2024-08-17",
    "content": "If we’re truly honest, like truly … most masterers can’t master very well and they *definitely* can’t mix. I think a lot of mastering engineers think that giving advice on what makes mastering easier is mixing advice, it is not. I think a lot of mastering engineers thinking giving advice on how to make your thing sound like other things is mixing advice, it is not. Mixing is hard, I can’t do it and I have decent ears and 30 years of experience in record making",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1274428583842152458",
    "author": "NoahNeedleman",
    "date": "2024-08-17",
    "content": "I have a thought for you- your mastering engineer is likely the wrong place to look for mix feedback. \n\nI thought a ME would be THE person to ask for feedback from  for a long time, but consider the fact that you want *them* to do *their* job well too- asking them to unpack your mix while simultaneously trying to make it work… it’s just the wrong place to go looking for feedback. \n\nRather we should be looking for feedback during the mixing stage, and when it goes to master, just notice what’s different. YOU pay attention to what’s new, how they heard your shit and what they found in it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293259327993548832",
    "author": "cian riordan",
    "date": "2024-10-08",
    "content": "Maybe they don't wanna spend $25 on something they can just have you print, lol. Seems like if you're feeling the ick from the mastering engineer now, imagine how you're gonna feel when they send you refs to listen to. Might be worth exploring another option...",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396662530927099986",
    "author": "Berlin",
    "date": "2025-07-20",
    "content": "Mastering Engineers are not meant to give mix or prod notes.\n\nIf there is a technical issue, that is 1 thing… to suggest someone change their mix is another.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396830800737206282",
    "author": "Nomograph Mastering",
    "date": "2025-07-21",
    "content": "Is there one answer for every genre, for every level of client from beginner to Top 5? Are there different “styles” of Mastering Engineers that approach the work and client’s needs differently?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "972283542480515133",
    "author": "h3x",
    "date": "2022-05-06",
    "content": "Ya i tell my clients when they ask for mixing/madtering that i can make it loud enough to put out on my mix bus, but am absolutely not doing a proper master like a mastering engineer would. Thats a whole other step they should be taking. Unfortunately artists (and even some engineers) rnt giving mastering the credit it deserves",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028345918623334460",
    "author": "Nomograph Mastering",
    "date": "2022-10-08",
    "content": "I suppose to flip that, a good test of a mastering engineer is how they treat a record (or the client) on a project they don’t vibe with",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028355480239747182",
    "author": "Nomograph Mastering",
    "date": "2022-10-08",
    "content": "It’s definitely been an important puzzle piece for me. And honestly there was no shortcut, I had to gain trust from people I respect, and beat out mastering engineers I respect. I had/have a very high standard for what good is",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079562197048508416",
    "author": "Nomograph Mastering",
    "date": "2023-02-26",
    "content": "If you are mixing into a clipper or compressor cool, but don't add it for your self master",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079951104017715260",
    "author": "masteredbyjack",
    "date": "2023-02-27",
    "content": "On the more general topic of what @macca should do (or anyone else in their situation)...I'd say just forget about mastering at all. The approaches and mindset I'm using, if you have access to the mix...makes them irrelevant IMO. I'm also sorta opinionated on this though. Like...why worry about making a tiny .3 db cut with .7 Q to clear up the vocal range....when you could just cut the actual elements that are the problem...or just raise the vocal?\n\nAnd almost certainly your monitoring won't let you hear these tiny moves enough to even learn probably. But I suppose there is some value is understanding the subtle balance shifts.\n\nFor me, many people can \"master\" their own track just fine for where they are at. It's not helpful at all for them to learn what a pro mastering engineer is doing day-to-day if they ever are only going to be \"mastering\" their mix. Why? It's like saying it's useful to learn the trumpet if you're ever only going to play piano IMO. Sure, it's still music but almost no skills will actually translate across. \n\nYou can always fix it better on an individual track than on the stereo file.\n\nI also sorta bristle at the what is \"mastering\" convo...we just finish records. That's it. Whatever it takes. Of course there are some broad approaches that will be applicable to everyone, but most of them would be better forgotten by mixers so they can make bolder and more creative moves.\n\nAgain, this is all just in my opinion, perhaps Ruairi is rubbing off on me lol? (notice strategic placing of lol @Nomograph Mastering )",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095900180051660850",
    "author": "masteredbyjack",
    "date": "2023-04-12",
    "content": "Again, I have to qualify that I’m sorta a new mastering engineer, so just keep in mind I’m no Ruairi/Rollmottle/etc…\n\nI’d absolutely be honest with them. In the long run it’s the best policy, the truth is just the truth in this case! And I’ve really found people appreciate the honesty and straight-forward ness hugely, especially when it’s coming from the place of making the art the best it can be\n\nCan you just ask your bud to fix it?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100529921023037440",
    "author": "Rollmottle",
    "date": "2023-04-25",
    "content": "mastering engineers don't want you to know about this one weird frequency",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102735529260351579",
    "author": "Nomograph Mastering",
    "date": "2023-05-01",
    "content": "You can put that into the translator and it will spit out “why don’t we have the confidence we’d have if we’d hired a real mastering engineer”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168935841113059479",
    "author": "cian riordan",
    "date": "2023-10-31",
    "content": "(That’s some Pushback on my mastering notes from a notable mastering engineer who has yet to grace us on this discord with his presence)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1181146941690748948",
    "author": "Deleted User",
    "date": "2023-12-04",
    "content": "I would recommend separating mixing and mastering into another task from composition and arrangement. \n\nPrinting all the instrumentation before moving onto mixing process can help you separate your brain a bit too. I also usually “save as” the session and name it this way\n\nArtist - Songtitle Mix YYYYMMDD\n\nthe challenge in doing everything yourself is splitting the brain. once you get that together, it becomes easier. Limiting the Mix process into one to three days maximum can also help overthink less. After producing, you’ve heard the song so many times and it will be very easy to start second guessing.\n\nCLA said “a mixer’s greatest weapon is our fresh perspective”. And it’s probably the same for mastering engineers too. Switching modes takes practice, and it can’t be done without practicing it at least in my experience. What helped me personally is mixing less while producing. Not putting too much time into processing individual elements unless I know exactly what I’m doing next. I try not to troubleshoot and figure out why the mix isn’t there yet because the arrangement isn’t done yet. \n\nHow could I possibly make the drums work with vocals if the vocals aren’t there yet?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232833263031156767",
    "author": "Berlin",
    "date": "2024-04-24",
    "content": "Friendly check in.. how are my fellow mastering engineers doing?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232860259001962496",
    "author": "Edsel Holden",
    "date": "2024-04-24",
    "content": "\"Too many mastering engineers don’t ever even meet the song\nThey have ideas of what something should be before even hearing it\"\n\nThis is a very important point that was broken into two messages that I wanted to preserve for future generations",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242268035956478095",
    "author": "Slow Hand",
    "date": "2024-05-20",
    "content": "Eh, who are these people and what does it matter to any of us what they think? Do they have any bearing on what the rest of us do? It sounds like Dave may be in a bubble of mastering engineer discourse where these advocates for massive dynamic range have an outsized voice. Clearly most of the world has moved on and don't heed the opinions of these people advocating for massive dynamic range.\n\nCompetitive loudness is a skill that we all have to learn, but people regularly push it too far and the best mixes will still crumple if they're pushed beyond their limit. Some records would have been better if people exercised restraint with how hard they push loudness. You can overcook loudness and you can undercook it as well.\n\nAs with so many things, the optimal solution is context dependent and somewhere in the middle. Neither too loud nor too quiet. You simply use your ears and do what's best for the record.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275160873433960449",
    "author": "Nomograph Mastering",
    "date": "2024-08-19",
    "content": "I recently watched an IG mastering engineer proudly share a reel where he shows how he is \"spreading the load\" across 16 ... yes 16 plug ins on the master",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298692881762091129",
    "author": "Nomograph Mastering",
    "date": "2024-10-23",
    "content": "How does it sound?\n\nHave you asked the Mastering Engineer about this?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328471722982248510",
    "author": "Gerhard Westphalen",
    "date": "2025-01-13",
    "content": "Makes sense. A mixing engineer's job is to take a dozen tracks and turn it into one. Mastering engineer's job is take a dozen mixes and turn it into one",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1349468930569277481",
    "author": "Nomograph Mastering",
    "date": "2025-03-12",
    "content": "That said I would sooner jump from an airplane without a parachute than try to serve the needs of mastering engineers",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359589913569530019",
    "author": "Grover",
    "date": "2025-04-09",
    "content": "I've always liked the fact that mastering engineers (generally) have the highest resolution system most pieces will ever be played on. sort of the ultimate audience member experience",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361438258818584817",
    "author": "Rollmottle",
    "date": "2025-04-14",
    "content": "If that's the route you want to take, I would still ALSO send it off to a pro ME so you can hear and understand the difference between the two. Even better if you can find a local ME who you could do an attended session with. I learned more from 1 attended session than all the DIY master attempts I ever made.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1388159516801110186",
    "author": "mcsnare",
    "date": "2025-06-27",
    "content": "It’s very much like mixing to please a mastering engineer. Sure, good engineering should be the goal but mixing for the client/song I think we all agree is key. Mastering for the artist and mixer is also a great strategy. So yeah there are a few best practices when mixing/mastering for a cutting scenario but I feel like the artistic process should take precedent. The mixer does their job, the ME does their job, and the cutter does their job.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1390102431316316303",
    "author": "Nomograph Mastering",
    "date": "2025-07-02",
    "content": "I’ve heard way too many projects where a mastering engineer in pursuit of mastering brownie points knocks all the corners off tracks that had real personality",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1393707367270449192",
    "author": "Nomograph Mastering",
    "date": "2025-07-12",
    "content": "Re a mastering engineer who Doesn’t have the tools to time stretch a track in 2025 ….",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396921692688879780",
    "author": "Berlin",
    "date": "2025-07-21",
    "content": "But also! I have had artists over the years ask me to listen to their album and give them feedback on their productions and mixes before mastering.. I usually tell them that that is not something that I typically do as a mastering engineer, but to also trust their gut, the stuff they have previously sent me has been great and I don’t see them working backwards. Give some encouragement.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410052427306107001",
    "author": "masteredbyjack",
    "date": "2025-08-26",
    "content": "Have not heard of it or tried yet. Read very quickly just now. Is it bad that I'm skeptical of plugins made by mastering engineers?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1458413944874995918",
    "author": "Jasper Boogaard",
    "date": "2026-01-07",
    "content": "People on here who were once a 'jack of all trades' and transitioned into mastering full time, I'd love to hear your perspectives/stories! I've been thinking about it for a long time and today I changed my socials/website to at least make it more clear that mastering is my main gig.\n\nI was hesitant at first because I love all parts of the record making process, but I've realised that positioning myself as a mastering engineer doesn't mean I can't work on the occasional recording or mix project at all. And I will always be making music so that means I'm not 100% boxed in. It's a new territory for me and I would love to hear other perspectives.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1458542550016196781",
    "author": "Jasper Boogaard",
    "date": "2026-01-07",
    "content": "Love reading this! For some reason I’d created the idea in my head that calling myself a mastering engineer would mean I’d never mix a song again, of course reality isn’t that black and white.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1462645515303915796",
    "author": "SawyerM",
    "date": "2026-01-18",
    "content": "Coming here from general. I've been wondering about the importance of restraint in mastering. I am of the mind that a song shouldn't be reinvented in mastering. But then I hear an Emily Lazar master and see heavy handed work being done at the highest level. So what is the role of restraint in a mastering engineer's toolkit?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465801746126475559",
    "author": "Halliemmelton",
    "date": "2026-01-27",
    "content": "hey y'all! sorry that this is random, I'm bringing up an old convo here that I missed the first time around, regarding objectivity  vs perspective in mastering! Wanted to give a little context--i made my post about perspective mostly from the standpoint of understanding that a master does also need to have objectivity. My main motive with that post was mostly stressing the importance of getting an additional set of ears on it when possible, rather than just using the mix engineer or producer to master the project--not necessarily when budget doesn't allow the expense, but rather when the undervaluing of how a good master can serve the project prevents people from hiring an actual mastering engineer/third set of ears. My statement was kinda broad, with the intention to get attention and start conversations! also why it was prefaced as a hot take. Ruairi is absolutely right though, restraint and objectivity is the most important; I think i just didn't touch on that because hopefully, in theory, if you hire a mastering engineer, they know this and practice this. The post itself was strong-worded & also pretty nuanced but I just wanted to be clear to my mastering fellows what point I was intending to make!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469350480919662653",
    "author": "masteredbyjack",
    "date": "2026-02-06",
    "content": "Maybe I'm a skeptic of most mastering engineers broadly but I would not want mastering rebuilding tracks. Ruairi I would trust, Randy too. Get \"I run everything through 6 analog pieces standard\" guy outta here. As if they have the final word on what sounds good and is musical. Almost without exception (and I've heard the A/Bs) these types tend to have bad taste.\n\nI want the most musical people closest to the record doing it. The ones with the vision in their veins. It's better for the song. Sometimes we need to do it mastering and I will not hesitate to do so if it's pulling that way. But just listening to a lot of music the ones that come in and you can tell were built through the level and processing close to an end product, and the decisions based on that, on balance speak much more to what they are. Obviously this doesn't go for everything. Broad observation.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "971959353324240897",
    "author": "Eric Martin",
    "date": "2022-05-05",
    "content": "I agree, with MORE mix engineers and more people making music than ever before, the amount of work that’s not up to par vast out weighs the music that’s actually up to standards.\n\nThis might skew how engineers work on stuff daily in that they are expecting to have to work hard and just do.\n\nI also think that ME’s asking for Non-Limited bounces of the final mix are asking for trouble from the people that are knowingly using limiting. Not all Mix engineers are created equal and neither are mastering engineers.\n\nAlways listen to the Limited version before reaching to the Non-Limited mix because sometimes it sounds good. I have one client that doesn’t listen to his “limited mixes” and the client approves that version. So the situation is basically fucked and he has to trust me in what I do",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028219645750157323",
    "author": "Nomograph Mastering",
    "date": "2022-10-08",
    "content": "I suppose? A great mastering engineer can typically do it on a good nearfield but mid or far field “looking at” the record rather “being in” the record certainly seems to help",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059616862285078578",
    "author": "ALXCPH",
    "date": "2023-01-02",
    "content": "Me too, got the thumbs up 22 mins ago 🤟 (Well, it was my mix, and they didn't want to budget for a separate mastering engineer)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064836594286219304",
    "author": "Ross Fortune",
    "date": "2023-01-17",
    "content": "Says the Grammy nominated mastering engineer 😉",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065649775732605029",
    "author": "Eric Martin",
    "date": "2023-01-19",
    "content": "I’ve been making DDP’s at least a few times a year over the last few years and I’m not even that busy of a mastering engineer, it’s just the format the duplication companies use to print the CD’s and yes DDP is where you designate the text that will appear in the printed CD during duplication.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075165032826028063",
    "author": "Nomograph Mastering",
    "date": "2023-02-14",
    "content": "1) There are no standards for tops and tails. I’ve seen everything from 0 mS to 500 mS from high end mastering engineers. Old cd players used to take a period to unmute and this mattered, not sure it does now. I’m at 200 mS as my default",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079591351265546240",
    "author": "Nomograph Mastering",
    "date": "2023-02-26",
    "content": "As you probably heard me talk about on the video I don’t really think it’s possible to master your own mixes - the main missing ingredient being objectivity. The second missing ingredient is different/hopefully better monitoring",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082565629267148820",
    "author": "spectrummasters",
    "date": "2023-03-06",
    "content": "...so, the short answer jack is yes , the wide q eq moves are definitely advantageous and applicable outside of the mastering stage (for my workflow)....very much so. I think in a way , the broad eq is sort of like a painter taking a few steps back from the canvas having been working up close on a detailed brushstroke (which I’d suggest for example is like a surgical eq move in a mix or saturating a sound at the production stage etc).....”stepping back” and listening not just to The minutiae but the overall tone i think is a discipline that is potentially easy to forget in mix mode ......and in a sense this is how the broad EQ is serving me . I find the eq points ruairi shared work v well at the group bus stage also......for light touches\n\nWith regards to whether I’m only mastering . No, currently my most common paid work comes from local / independent artists in my network I’ve built mostly from my local community outwards through word of mouth. This is primarily in the rnb/trap/hip-hop genres and for better or worse it appears to have been normalised that when someone wants a mix....what they want is a mixter. I’m with Derek Ali’s Enginears platform and even there they are promoting a free master from us as mixers on the platform.\nPersonally, I’m not against certain mixers mastering as well....but i think this is more genre specific.....and also v much down to the individual. I think you spoke about your arc on here into mastering and others have too. ....i believe there is much to benefit from having professional mastering engineers, with thousands of hours under their belt listening to thousands of tracks in excellent environments......take the final listen and make the final adjustments on a mix..and for me, i consider myself on a career arc towards becoming that .",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122938602112946176",
    "author": "Will Melones",
    "date": "2023-06-26",
    "content": "The way I see it, the mastering engineer, much like the insurance salesman, is the ultimate con artist. *Con* being short for *confidence*, of course. You've gotta sell peace of mind. It's tough to earn, but only takes that one email to lose it all.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143936310315339860",
    "author": "Nomograph Mastering",
    "date": "2023-08-23",
    "content": "The challenge here is that the phrase means different things to different people. To the Euro kidz it’s basically mixing with no mastering after, in the U.S. it generally but not always means something done by mastering engineers. Just like the word mastering on Gearslutz often means “things on my mix bus”",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152977494471889087",
    "author": "hyanrarvey",
    "date": "2023-09-17",
    "content": "Yo it’s incredibly funny when the mastering engineer blows it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164401013537648670",
    "author": "masteredbyjack",
    "date": "2023-10-18",
    "content": "Highly recommend this and @Nomograph Mastering energy. Sure, maybe the master is a disaster and I know that’s disappointing but moving with kindness and openness behind the scenes (and everywhere) can only be a plus!\n\nKnowing you, I’m sure you do this I just say it here for the whole crew.\n\nIt can feel good to vent, believe me I have my moments like the rest of us but it never solves anything or helps us learn, or more importantly connect with people and make the art better.\n\nWho knows…it’s not ideal but maybe you can actually help this mastering engineer see some light and save some other artists heartache down the road! There have been several cases where kindhearted souls shared insight with me when they could have just looked down on me or gave a spicy quip and it helped me extremely",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199834253391822958",
    "author": "Josh",
    "date": "2024-01-24",
    "content": "I know Nick personally and while I rarely check out his videos, I can say he's a killer mastering engineer and I hope this video passes the test haha",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211494737060827186",
    "author": "Eric Martin",
    "date": "2024-02-25",
    "content": "that’s the thing, there’s space for me to be a Mastering Engineer because every one of them locally is busy",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216126594096300042",
    "author": "Berlin",
    "date": "2024-03-09",
    "content": "Hell, I just did a program last month, it was all over the place sample rate wize, some songs previously mastered, and one of them was an mp3 because they lost the master wav from a previous engineer. All they had was the mp3 for it from their publicist (oof). Their original link was dead and when they asked their previous mastering engineer for the file, they wanted to charge them $320 for the hr to make an \"archive pull\".",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1219834862584991824",
    "author": "masteredbyjack",
    "date": "2024-03-19",
    "content": "Makes sense you are a mastering engineer then!\n\nGot a great note on a master I did today by one of my fav mixers (both of who I work with and legit generally), just reminded me how much I love the process of collaboration and learning from others’ insight",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222648208329801730",
    "author": "Berlin",
    "date": "2024-03-27",
    "content": "i love how mastering engineery we all are",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222709244067840120",
    "author": "David Fuller",
    "date": "2024-03-27",
    "content": "god I feel like mastering engineer get togethers must be the single nerdiest thing on the planet",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223352790978658344",
    "author": "masteredbyjack",
    "date": "2024-03-29",
    "content": "I know some mastering engineers who ALWAYS (or so they say) give an A/B. I won't say who they are, but they are doing just fine",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242278628545396866",
    "author": "Nick Stetina",
    "date": "2024-05-20",
    "content": "Speaking of misguided I read this on GS re: how to pick out a mastering engineer. Has everyone uploaded some program material passed through their compressors to that forum yet? You might be leaving some work on the table.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1242888617077248030",
    "author": "Nomograph Mastering",
    "date": "2024-05-22",
    "content": "For mastering engineers It’s worth taking some time to understand the physical process and constraints of cutting",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245815327758090281",
    "author": "Berlin",
    "date": "2024-05-30",
    "content": "Sometimes I have friends (who are… mastering engineers), come to me asking how to do this and i then i explain and then they just ask me to do the program for them 😅",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1250998405564600422",
    "author": "Nomograph Mastering",
    "date": "2024-06-13",
    "content": "If I had time I’d like to jam on an effective and good sounding ozone preset to replace it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1274373200158920725",
    "author": "Berlin",
    "date": "2024-08-17",
    "content": "no cross fade, compressor smack, macaroni mouth, pants rustling..? digital glitches.\n\nat what point would you give feedback to the client regarding this? \n\nthere are pops and clicks present on every mix i receive. literally every mix. i just knock it out with RX and keep on rockin in the free world.\n\nthere are some mastering engineers that never open RX and have very fruitful and successful careers.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276001424416833557",
    "author": "NoahNeedleman",
    "date": "2024-08-21",
    "content": "You’re making me think I could be a mastering engineer at some point.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1311217980742307871",
    "author": "Slow Hand",
    "date": "2024-11-26",
    "content": "The only thing I can think of is that when you drag the audio files into Ableton to double check that they've printed correctly you're creating a new .asd analysis file for every audio file. Maybe your ME accidentally received an .asd file where they should have received an audio file.\n\nThen again, it sounds like you're covered since you checked on your friend's laptop. Are you sure the ME didn't receive an .asd? You would know not to upload that file, but the mastering engineer might not think to look for that if they're dragging in 30 files all at once.\n\nYou're printing in .wav or .aiff right? There shouldn't be any problem with the audio files on different OS's because audio files today are all OS agnostic and should function the same.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328456760742121503",
    "author": "masteredbyjack",
    "date": "2025-01-13",
    "content": "From my side I always want to keep working with people -- you never know how the relationships evolve (I know you know this, you are more experienced than me). I just tackle the notes -- it's rare I would ever say it wasn't a great experience. I want to master as many records as I can. At the very most I would let them come back again, say it's not the right fit and suggest someone I know to be a good fit (I've done this before). But always with the art and their vision first, if I truly don't understand it.\n\nThat said -- I did get really close to walking on a recent project, we were way down a rabbit hole, I think I legitimately did 15 masters. And we were caught up on dither, comparing to pink noise, etc. It was wild. We got it across the line - but I went way out of what would be constituted by us as what the \"mastering role\" should say, because the music was great and I thought the artist could understand my perspective. And I think it actually hit, to refocus on the art and feeling. \n\nIt's a fine line. Sometimes I get the impression that I do step out of what is supposed to be said by mastering engineers -- but people seem to connect with that on my side. \n\nAlso if things are going that way I will just stream it to them -- often they are looking for control or are having a hard time making decisions -- something I see in this new crop of record makers who only have ever worked in a DAW. Hard to know without actually knowing the humans\n\nThen again, many many times I get a note and it's great and insightful and I love it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330702803911442492",
    "author": "Nomograph Mastering",
    "date": "2025-01-19",
    "content": "I do care, but it’s just not something a mastering engineer can control",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1332807311345061970",
    "author": "Berlin",
    "date": "2025-01-25",
    "content": "Love everything that’s been said from everyone already.. if I may add…\n\nMost folks on the indie side don’t know what a lot of this means.. They just want to know their job is finished. So in conversation you could just ask what they are going to do? Make CDs? Make Vinyl? You know what they need for these things.. they may not.\n\nAlso, in regard to deliverables like vinyl premasters or CD DDPs.. sometimes I’ll master something, digital only, and they’ll come back and ask if they NEED a DDP or NEED a vinyl premaster from me. I am always transparent and tell them the truth that they could order CDs and Vinyl with WAVs only and that would be fine, lots of folks do that, but you are back to proofing new masters with the manufacturer now as a QC mastering engineer. You’ll save some money, but if you want, I can do them and you can show up to your manufacturer ready 100% to go. No pressure. Either way will work. Different means to the same end. And that’s the truth.\n\nMost of the time, they have me do it anyway because they want to call it done when they are done with me and not worry about it. High 5s all around.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374805946890715147",
    "author": "Nomograph Mastering",
    "date": "2025-05-21",
    "content": "If it’s as simple as “I like the mastering engineers taste” then unshackle them from a specific role and have at it!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "971857762218819615",
    "author": "BillyC",
    "date": "2022-05-05",
    "content": "I can't help but feel like there are quite a few mastering engineers out there that just can't get over the fact that there's generally a lot less for them to do these days processing-wise.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028217564431646741",
    "author": "Maxim",
    "date": "2022-10-08",
    "content": "Viewing the song as a whole and not separated is so difficult for me and the reason I love a good mastering engineer.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038154988167381104",
    "author": "Deleted User",
    "date": "2022-11-04",
    "content": "I’m not a mastering engineer but -1dbfs is quite a bit of room. And from my own listening experience, .1 db difference in ceiling can actually make a quite a bit of difference in listening experience while little ISPs don’t really affect my listening experience that much.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038522627465158656",
    "author": "masteredbyjack",
    "date": "2022-11-05",
    "content": "Need to run but let’s circle back. Would love to hear. Also it was very very hard like discussed but I feel like I grew more in a day as a mastering engineer than I have my whole life",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042629838558740520",
    "author": "Nomograph Mastering",
    "date": "2022-11-16",
    "content": "But how loud a master can go while sounding good is almost entirely defined by the arrangement and mix, good mastering engineers can unlock that potential where an amateur might squander it. But ultimately it can only go as loud as the arrangement will let it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054829949590188142",
    "author": "cian riordan",
    "date": "2022-12-20",
    "content": "Interesting about the metering, @Nomograph Mastering. This makes a lot of sense to me in a room you know, but I do find visual metering tools (VU, spectral analyzer, LUFS, L/R balance) very useful in helping me get acclimated in a room I don't know very well. Obviously more of a tracking engineer problem than a mastering engineer problem.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064313078746976257",
    "author": "Slow Hand",
    "date": "2023-01-15",
    "content": "I think there's may be an unspoken assumption here that the punch in your record is going to come from your master buss processing, when in fact you'll get more punch by balancing your mix and your arrangement.\n\nCorrect me if I'm wrong, but you're not a mastering engineer right? I gather that you're more of a producer/mixer who is trying to learn about 2-buss processing because you think that's how to make a record punchy.\n\nWhile 2-buss compression can give you a little punch and impact, you're going to get 90% of your mix's punch through good balance, arrangement, and sound selection. You've got way more control over the impact of your mix by addressing these things. Not your master buss.\n\nIf you're new to this, poor or overcooked setting on your stereo buss will work against you and can turn your mix to mush.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064413851543674940",
    "author": "Zack Hames",
    "date": "2023-01-15",
    "content": "I really love the idea that mastering is about a fresh perspective from someone in a great room with great ears/experience.\n\nI’ve said it before, I’d pay a mastering engineer just to give me a thumbs up. Just as worthwhile as any actual changes being made.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064418232959778876",
    "author": "Zack Hames",
    "date": "2023-01-15",
    "content": "I should clarify - hearing what you or @Rollmottle do for mastering, has made me realize I’ve never really mastered in my life, not in a real way, and I don’t think it’s something I’m as qualified as I maybe thought I once was; I didn’t think I was amazing but I was that idiot like “I’ve got fabfilter and I know what LUFS are, I got this”.\n\nTruly, you guys made me appreciate mastering engineers more than I ever could. It’s a must have, and anything I record or mix from now I on I am going to insist it gets mastered by someone on the level",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064764264230965318",
    "author": "masteredbyjack",
    "date": "2023-01-16",
    "content": "Ruairi, to both you and @Gerhard Westphalen …I find both of your mindsets, expertise, and curiosity inspiring, especially as someone who truly understands the physical principles underlying the audio/technology we discuss but approximately 0% of its actual implementation in real world…\n\nDo you find that as you’ve become very in demand mastering engineers you want to leave the technical stuff behind? Or think more deeply about where your time is best spent?\n\nI ask because I’m a super intuitive-type when I master, but I like to devote very focused some time to rendering my tools to deep knowledge “available” in that intuitive flow. Probably on the @Rollmottle tip. But my science brain craves the technical understanding. \n\nThere is only so much time in our lives and I’m curious if you think about how you time is best spent — mastering vs working on very technical things that I would argue offer no value to the actual artistic mastering process (minus having a good listen environment).\n\nTrying to tie this back to the “makes a difference” vs “matters” thing…I think it’s great that there is so much enthusiasm for deep dives (ala @Zack Hames ) on here but I can’t help but think there would be little to no actionable info for most of us in what you two discuss! Sometimes I wonder if reading these threads gives me a false sense of accomplishment…like I now understand something that will never matter for me (and I could have just mastered a song instead)\n\nAs always, there is a balance and I’m trying to find my own…you two are just doing both the mastering and acoustics at such a high level I had to ask!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079116981099298856",
    "author": "Nomograph Mastering",
    "date": "2023-02-25",
    "content": "I spent time with a well known mastering engineer who shall remain nameless that has every piece of gear under the sun. Mastering for him was sitting there just trying different gear on tracks, looking for complimentary accidents",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079929473601917011",
    "author": "Will Melones",
    "date": "2023-02-27",
    "content": "It sounds to me like they may not have been looking for overcooked, but they were looking for mastering to magically transform their mixes, (which they didn’t even like).\n\nThat’s what I look for in a mastering engineer 😏",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097432557546643507",
    "author": "spectrummasters",
    "date": "2023-04-17",
    "content": "Streakys next vid : Secrets of the mastering engineers : The Full Moon master. .",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102989609325051915",
    "author": "Bryan DiMaio",
    "date": "2023-05-02",
    "content": "As a mixer, I don't enjoy when the whole tonality of my mix is fundamentally altered, so be careful what you do the more drastic moves to! On an indie project I was working on, the mastering engineer that we originally had was distorting/scooping/harshing my mix so I had to hire Fuller, who did a great job",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152334728633000107",
    "author": "Gerhard Westphalen",
    "date": "2023-09-15",
    "content": "Most of my knowledge is in the music side of things, not the technical. Starting to read music before learning to read, all the school bands, 10 years playing in orchestras, learning many different instruments, having a teacher who pushed me through it all, composition degrees, working as an orchestrator, arranger… that plus some time working on listening skills is what makes me a half decent mastering engineer IMO. Everything else you just pick up as needed. Don’t know what a LUFS is and where to get one? Just a Google search away",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153004369525080265",
    "author": "Nomograph Mastering",
    "date": "2023-09-17",
    "content": "My manager used to be on the label side, and he commented one day that sometimes they’ll just get a Dropbox link from a mastering engineer - no email, no thanks",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164045841582002276",
    "author": "cy (sigh)",
    "date": "2023-10-17",
    "content": "hey yall. need a lil advice. recently mixed a pop track and sent my suggestions for mastering engineers. producer /artist ended up using someone else for budget reasons and the mastering guy's first comment is that the unlimited mix was hitting -2  and he doesn't have enough headroom.  this is also a 32 bit file.\n\nsomeone correct me if I'm wrong but this shouldn't be an issue right? they should be able to just bring the input level/clip gain down on their end if they want more headroom or am I bugging?\n\n(a bit burned out and doubt has taken over my mind rn)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199395981914034317",
    "author": "Rollmottle",
    "date": "2024-01-23",
    "content": "Are you interested in becoming a mastering engineer? \n\nHis spin on some good kernels of truth is pretty terrible advice IMO (yes get reps, but if you’re trying to do it full time, working for a year for free is dumb, yes know your tools but you needn’t be seeking new ones on a weekly basis, yes seek knowledge but anything truly valuable to the practice of mastering records won’t be in those books, etc). \n\nNo facts detected, just one man playing the content game’s take.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1238644082134487123",
    "author": "masteredbyjack",
    "date": "2024-05-10",
    "content": "I know this isn’t really what you’re getting at, since I know you to be a wonderful kind hearted human and killer mastering engineer, but honestly moving fast and off intuition IMO almost always leads to better results\n\nSo if non-real deadlines remove the uncertainty loop from the equation maybe it’s a net positive",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1248360544231227433",
    "author": "Rollmottle",
    "date": "2024-06-06",
    "content": "ain't nobody but an Ozone preset operator mastering shit for £2.50 per.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265032628286001316",
    "author": "stefandurandt",
    "date": "2024-07-22",
    "content": "Love Nick Franklin - he’s a mastering engineer here in Sydney - mostly builds gear now though - Franklin Audio https://www.instagram.com/franklin_audio?igsh=ZWlzdDlwaWpodmYy - pretty funny content there too",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1268403817175584809",
    "author": "Slow Hand",
    "date": "2024-07-31",
    "content": "Makes me wonder what it would mean for there to be a feral, bad boy mastering engineer out there giving interviews. What shape would the enfant terrible of mastering take if they existed?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276636663501553755",
    "author": "masteredbyjack",
    "date": "2024-08-23",
    "content": "We are just a very specific use case -- the extra features are more hassle to me than help -- but running this type of business for mastering engineers. only...wouldn't be a business so I appreciate the work Samply is doing!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290413043427184692",
    "author": "cian riordan",
    "date": "2024-09-30",
    "content": "Just blindly assuming that -14 made sense based on what people were saying about streaming normalization. It's also when I began to work with less heavy-handed mastering engineers who were more likely to maintain the level of the mix that I sent them. I go back and listen to some stuff now and I think there'd be real merit in pushing things against the glass a little more.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1296882951216304169",
    "author": "chrissorem",
    "date": "2024-10-18",
    "content": "It’s definitely one way to never get a referral. If I was the mastering engineer and I felt strongly about it I’d ask to have a conversation with the mixer.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298493148955148421",
    "author": "masteredbyjack",
    "date": "2024-10-22",
    "content": "I’ll probably say what a lot of us would — find records you love the sound of, find out who did them and reach out. Whoever you work with would be the one to ask about the file deliverables! Also there are many great mastering engineers here\n\n@Nomograph Mastering is as A list as they come these days",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300845155372241028",
    "author": "Ted Whitten Media",
    "date": "2024-10-29",
    "content": "Yep I'm dropping that in the beta survey when they send it out for sure",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328810442419601511",
    "author": "Matt Huber",
    "date": "2025-01-14",
    "content": "All this talk of stem mastering\n\nBoy does Dolby have a treat for mastering engineers",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330699798776647864",
    "author": "cian riordan",
    "date": "2025-01-19",
    "content": "Same. But it’s a valid question for a budding mastering engineer fielding mixes from people who don’t mix the biggest songs.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331403506137043038",
    "author": "Nomograph Mastering",
    "date": "2025-01-21",
    "content": "A lot of mastering engineers seem to think mastering would be perfect if it wasn’t for pesky clients and their mistakes",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334301149691641976",
    "author": "Josh Bowman",
    "date": "2025-01-29",
    "content": "Ok glad I wasn’t missing something this was helpful and totally in line with my thoughts. I’ll find a way to communicate to the mastering engineer without the artist so i don’t throw anyone under the buss or introduce any fear/worry",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334302063189823621",
    "author": "Nomograph Mastering",
    "date": "2025-01-29",
    "content": "The prevailing wisdom is \"labels are dumb\" but IME there are more dumb Mastering Engineers when it comes to these topics",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346925785939836969",
    "author": "Théo Quayle",
    "date": "2025-03-05",
    "content": "Pretty sure his podium of choice is Mastering Engineers Worldwide",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369373585550086154",
    "author": "longstoryshort",
    "date": "2025-05-06",
    "content": "i think mastering engineers in the dance space realized there's a between\n\ninstead of charging for a full mix just to rebalance a few obvious things that cant be done in the two track file it was \"send me these 8 stems\"\n\nthere is such a stigma for edm people and having help",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374370697278656653",
    "author": "masteredbyjack",
    "date": "2025-05-20",
    "content": "I am still early in my journey but I'd just lean the fuck in to whatever I find cool about it! Whatever speaks. No rules.\n\nFor some reason I feel I've been lucky to have been spared the feeling of \"why isn't this better\" that a lot of persnickety mastering engineers are afflicted with\n\nI suspect that's actually a benefit of my produce/mix background",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376972777025830972",
    "author": "Paris Lee",
    "date": "2025-05-27",
    "content": "When navigating revisions for me (had to go to a rev 3 recently with someone I’d label ‘eccentric’, and had parted ways with the original mastering engineer before me) \nI think the best practice is to always establish what you did verbally from rev to rev, being careful not getting into the weeds of ‘well you wanted me to widen but that kinda affects this and that bla bla…\n\ndon’t confuse them..! \n\nDon’t talk about frequencies or gain reduction numbers or LUFS etc…\n\nBe concise and confirm you performed their notes point by point, and, get a conformation back that- did you actually accomplish what you set out to do?  To what degree? Did you nail two of the three notes? 1 of the three? 3 of 4? Or all of them? \nWhatever it is- this should help them focus and get the conversation so it’s not just them coming back with things that you weren’t even aware of what they were thinking.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385395337052557435",
    "author": "Iwan Morgan",
    "date": "2025-06-19",
    "content": "About time we had fewer woke mastering engineers",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412620300696420424",
    "author": "masteredbyjack",
    "date": "2025-09-02",
    "content": "For real though, @Rollmottle does great work in Reaper and Mike Cervantes, one of the most monstrous mastering engineers I know, is also in reaper. It’s possible",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440072626486902916",
    "author": "Rollmottle",
    "date": "2025-11-17",
    "content": "There are many things to learn about RX that will be invaluable to learn, but if you're not looking to be a mastering engineer, I wouldn't worry about it. You have the mix, fix it in the mix.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "972237991194021978",
    "author": "h3x",
    "date": "2022-05-06",
    "content": "that def also is a monitoring issue too cuz i always will think i nailed a mix, but then when taken to the car it sounds either under-cooked or over-cooked and its cuz my speakers r so hyped up that its super hard to gauge what's \"ready\" for the mix to be sent off to either streaming or a mastering engineer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "972290540995481660",
    "author": "Eric Martin",
    "date": "2022-05-06",
    "content": "Lots of people aren’t even mastering because there “isn’t budget” and I think that’s a mistake personally, it’s not gonna be as good as it can be.\n\nThere are some mastering engineers just getting started that will charge $50 a track and do a bang up job, but you gotta find that right person and it might take some trial and error",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "974447733471580191",
    "author": "ALXCPH",
    "date": "2022-05-12",
    "content": "Honestly I think the most value you get from an ME is the relationship you build through continuously working together and the trust that follows. \nPaying a random ME 50bucks for a master can turn out great if your are lucky but it can also turn out like dogsht. So many people these days are calling themselves mastering engineers. The amount of times I’ve seen the mixer/producers version get chosen over xx mastering engineers version is pretty wild. (In situations where the label wants a random master asap, with out communicating with the producer/mixer first or during)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "981400857457340416",
    "author": "Deleted User",
    "date": "2022-05-31",
    "content": "I started putting it after my final limiter from this year to give some extra push like a final bit of salt sprinkles before serving. I don’t touch the gain parameter, effect rarely goes beyond 6-7% and curve at +- 3-4. If I set the ceiling on the limiter right, it doesn’t clip other than ISPs or a few samples clipping. I start at 2 range and tweak it at the end. But I only do this when I’m doing a bounce, I don’t master so interested in hearing now mastering engineers use it. \n\nOr if there’s an individual instrument that needs some lift, I would use inflater more aggressively.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "991152768704315454",
    "author": "jordanmcleod_io",
    "date": "2022-06-27",
    "content": "apologies if this has been talked about. i tried searching but couldn’t get a phrase of keywords to reveal anything… i also think it was talked about on an episode. but is it now pretty common for mastering engineers to received limited mixes with no headroom. and they create headroom just by pulling the mix down however many dBs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999346696834261182",
    "author": "mixedbywong_my",
    "date": "2022-07-20",
    "content": "Mastering engineers , how’s your workflow when you’re working on an album ? Do you go in n fix stuff in rx at one go ? Or do you work on the levels , eq , compression if any first ? Assuming all the tracks are at different integrated loudness when sent in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1011665453871005756",
    "author": "conor // wbotm",
    "date": "2022-08-23",
    "content": "put simply, what attributes are you looking for when choosing a mastering engineer for a project? of course past relationships, budget, timeframe, and credits are the main quantifiers.. but really is there anything else you can or should go off of?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033033527631036567",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "If I had to really call it, I would say that my experience of recording and mixing made me a more empathetic but worse mastering engineer for a long time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033047491156906014",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "Bummer! I’m not sure it’s useful for us to be graded by other mastering engineers. Feedback from artists, producers and labels is what matters",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033098707383619725",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "I once sat with a mastering engineer who many of you will have heard of. Nice guy. His mastering strategy is to basically try patching in and out different pieces of gear until he likes it. Basically random. He has probably 30 processors.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034564711674564711",
    "author": "hebakadry",
    "date": "2022-10-25",
    "content": "Very quick take on the vinyl gripes some people have.  I am of the younger cutting generation and I can definitely assure you guys that cutting engineers today are way better than the nostalgia people have about cutting “back in the day”.  We have amazing tools now…plugins to manually de-ess the program material cutting engineers get from mastering engineers that have had ZERO sibilance mitigation, totally blasted material at -6LUFS with clipped transient information, distortion, you name it….we actually have tools now to fix these issues that people 20 years ago had only one knob to process it.  We even had a tiny amount of innovation on pitch computers which were last made in the early 80s.  That being said..there has been very little innovation in lathes otherwise…we are still working with lathes from 1970 or earlier because literally NO ONE has been able to improve upon the sheer magnitude of incredible feat of engineering lathe machines that Neumann and Scully made 50 years ago.  There have been kickstarters…many many dudes tried, they literally all failed.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037924322070773800",
    "author": "Zach Hughes",
    "date": "2022-11-03",
    "content": "Folks, I have a question for the group. Would love to get a mastering engineers perspective. I'm curious what is the rationale behind masters clipping output converters and leaving in true peaks that exceed 0dBFS? I get that clipping converters can sound cool / desirable, but why not achieve the clipping you want and then print a final master under zero? Why risk a consumer product crapping out during playback and adding potential distortion and why totally disregard pretty much every DSP's recommendation that true peaks not exceed -1 for the encoding process? I'm noticing that a ton of major label releases are peaking above zero with loudness normalization turned off on Spotify.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038245257827061820",
    "author": "Zach Hughes",
    "date": "2022-11-04",
    "content": "So are mastering engineers printing different masters for different DSPs and there different codecs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038672343574261870",
    "author": "Nomograph Mastering",
    "date": "2022-11-05",
    "content": "Very few of the great Mastering Engineers talk about their work and even then, it's impossible to describe. The last person I would ask to describe Tiger Wood's golf swing is Tiger Woods. A phenom is not necessarily a good parser of their ability or a good teacher",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040426246057758831",
    "author": "youngteam",
    "date": "2022-11-10",
    "content": "I dug that line - it's also worth mentioning he added to it that if the master sounds waaay better he has to know what the mastering engineer did, lmao",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041084805401559071",
    "author": "ALXCPH",
    "date": "2022-11-12",
    "content": "I get where you are coming from. But i'm mostly thinking of the thousands of young kids putting out GREAT music that they worked super hard on, but don't have the money for big knowledgeable mastering engineers, and then they try and \"master\" their own music, because they feel they have to becasue of all the miss information out there, and end up with weird surprises because, they arent able to test it, easily. A simple plugin or program could eliminate that completely. maybe let people worry less about loudness and putting random plugins and limiters on their mixes, because they know exactly what it will sound like once its released",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042546963880624288",
    "author": "Zack Hames",
    "date": "2022-11-16",
    "content": "You’re not wrong - I’m NOT a mastering engineer, but I have to master for audio post every day (and have “mastered” records).\n\nI always look forward to you giving the real deal answers even if I look like a dunce in the process.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042574889250463784",
    "author": "ALXCPH",
    "date": "2022-11-16",
    "content": "I’m am not a mastering engineer, but I always found it very interesting, and always felt like I wanted to get into it once, i don’t have enough production work anymore. And I have started working at consistent levels when im in my own studio, but I work out of many different studios, so it’s not as locked into my ears as I wish it was",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044367910237384755",
    "author": "itaylerner",
    "date": "2022-11-21",
    "content": "Anybody mess with Sequoia? I worked once with a mastering engineer who used it and spoke extremely highly of it, but haven't really heard of it much at all",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044690219800211516",
    "author": "Eric Martin",
    "date": "2022-11-22",
    "content": "it’s just an interesting thing to me, more as a producer not a mastering engineer, it speaks to the variety of impact in the sections of the songs, it’s a lagging indicator of something that was well thought out during production",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044702928650375178",
    "author": "JakeTB",
    "date": "2022-11-22",
    "content": "This really seems to be the most common number mastering engineers are advertising. Why *specifically* -.3?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1052338769736503427",
    "author": "ALXCPH",
    "date": "2022-12-13",
    "content": "Nerd question. I just Got the latest rx10. And im being asked to also do the master and deliverables(budget reasons, i am by no means a mastering engineer) on a project im quite excited about. I usually work in 48k and Will have to convert to 44.1/16 & 24bit at the end. Ive been seeing you guys rave about the rx10 Src and dithering options. I know its something that keeps being Said not to worry about, but i would still like for it to be as good as possible. I am trying to develop my knowladge on these subjekts my self, but knowing i have the wealth of knowladge at my fingertips, any direction on these to subjects is greatly appreciated. ❤️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054984951151460373",
    "author": "Deleted User",
    "date": "2022-12-20",
    "content": "Wouldn't this introduce more distortion as opposed to revising the original EQ setting? It may not matter as much if it's minimal but part of the reason why I've been committing a bit less in the early stage of production is that I find I get cleaner result revising the setting rather than putting another one on top. But again, I'm not mastering so I'm curious to hear mastering engineers' experience on the changes or differences noticed between the two different way of revisions",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1060624488443691118",
    "author": "Nomograph Mastering",
    "date": "2023-01-05",
    "content": "But the problem is …. Mastering Engineers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062796266502881301",
    "author": "LAPhill",
    "date": "2023-01-11",
    "content": "Yes, and the other OTHER reality is that the studio is treating these vinyls as collectors' items instead of caring about the listening experience. My pushback is always - why not both? (But if they don't care enough to use an actual mastering engineer for the soundtrack release, what hope do I have for the vinyl?)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064313721918345266",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-01-15",
    "content": "Yep,You are Right \nI'm not a Mastering Engineer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064415352747999322",
    "author": "Zack Hames",
    "date": "2023-01-15",
    "content": "That said - at the level that you, Matt, Cian, Jon, and every other person who’s been on the live, youre not getting completely fucked mixes.\n\nA lot of us still get mixes or recordings that are not fully realized. I know some people in here have said they’d never edit or tune what they were given to mix. There was a time that’s what I spent the majority of my time doing because it was unlistenable until I did. (Happens less and less now 🙂 ) #\nI mastered a track recently, the vocal reverb was so whack. They didn’t EQ the reverb at all, it was insanely sibilant just in the reverb, etc. you guys know what I’m talking about. The artist mixed it themself and they’re NOT a mixer, so I kindly prodded and got her to EQ it out. She was thankful and it made it significantly better. \n\nAlso, I did use compression on the bus on that master - but I would never expect a mastering engineer to put that on my mix because I’m compressing my mix already.  \n\nMixing pop, mixing well produced tracks from seasoned folks who make decisions well before the mixer is involved, is way different than mixing a local bands home recorded ep. Both need totally different perspectives and tools and focuses.\n\nThis got derailed…point is, my view on mastering’s role has changed dramatically since listening to LWMR. I hope I never have to “master” my own own mixes again because  I think it’s fundamentally, in some ways, not even truly mastering.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064420782161276948",
    "author": "masteredbyjack",
    "date": "2023-01-15",
    "content": "Oh I definitely do! I was curious if you referencing literal artistic moves or like an approach to navigating as a mastering engineer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064771994513584178",
    "author": "masteredbyjack",
    "date": "2023-01-16",
    "content": "I don’t know Gerhard…I’ll take your word for it 😂 but I really enjoy your mastering and your credits speak for themselves.\n\nI love that people like you exist in the world and push boundaries of what’s possible. But to tie to maybe a literal example…I have a Massive Passive. It’s like 75 percent of what I wish it was. And it may well be possible for me to learn and build a better version of it with my background knowledge, not constrained by the variables Manley is.\n\nBut as you know, it would take YEARS of studying, trial/error/etc. maybe I end up with a better EQ. But I could also argue that I could have spent all that time just making records and I’d be much better off as a mastering engineer in long run, even with a “worse” EQ.\n\nThat’s an extreme black/white example, but I’ve got some big life changes coming and I’m really trying to reevaluate where my time is best spent and how it relates to my long term goals.\n\nYou and Ruairi straddle two very specific and niche worlds so was just looking for insight on how you handle your balance! How specific are you with your time management when you go down rabbit holes? And how that relates to your mastering goals",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065661606907887667",
    "author": "spectrummasters",
    "date": "2023-01-19",
    "content": "Ive had a batch of mixes this week with audible pumping at only -12lufs which caused me to ask them to take the limter and any compression off and send them again. Turns out it was The God Particle. What I’ve got back now obviously lacks the harmonic exciters in the TGP and is a v different sounding mix .Which is fine, but it has me thinking, what use is something like TGP practically? You’re not gonna master with it on...and taking it off the mix collapses into something else....firmly a “self mastering tool” ? In which case , we could be hearing a lot more pumping on records if so. My 2 pence  on. TGP",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067151751511277639",
    "author": "Eric Martin",
    "date": "2023-01-23",
    "content": "How do you choose the right mastering engineer for a project?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067176845759500340",
    "author": "Nomograph Mastering",
    "date": "2023-01-23",
    "content": "Kidding obv but I won’t say anything until you actually get input from people who hire Mastering engineers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067177263445065808",
    "author": "kylem",
    "date": "2023-01-23",
    "content": "Does everyone here find themselves constantly changing mastering engineers? I should also say I have control over who I use less than half the time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067205961091121162",
    "author": "Nomograph Mastering",
    "date": "2023-01-23",
    "content": "Every mastering engineer will make mistakes, it’s just about care and systems to minimize",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067314866274193438",
    "author": "Nomograph Mastering",
    "date": "2023-01-23",
    "content": "Is there some secret agreement I’m not aware of that locks young female Mastering Engineers out of all the other ways to grow their businesses?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067492466174992394",
    "author": "hebakadry",
    "date": "2023-01-24",
    "content": "As far as the numbers are concerned, the only real study we have is the Annenberg study, which is important but also wildly skewed…it only looks at how many women there are in production in Billboard top 200…not anywhere else.  And that is notoriously male dominated…9 guys that write all the music, same 3-5 mastering engineers that do all the major top 100 stuff etc.  I have been critical of this study, did an interview on NPR about this actually…but it's like, there are other genres...they need to look elsewhere because it brings with it a lot of clickbait articles and it doesn’t really advance the cause.  There are way more women in production just based on my experience…how many records I master that were mixed or produced by women every month.  It’s a start of course, but the survey needs to be better.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067881545400066120",
    "author": "Zack Hames",
    "date": "2023-01-25",
    "content": "are you the artist or the mastering engineer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070464840361058488",
    "author": "Zach Hughes",
    "date": "2023-02-01",
    "content": "I could use some advice from the mastering crew here. I received a master back today of a song I produced and mixed for a young and relatively inexperienced artist. Been working with this mastering engineer for a few years now but it's the first time the artist has ever interacted with their work. I had a few notes / small tweaks on the master I wanted to share. Was wondering if I should share with the artist first, get their thoughts, and then share mine with the artist / corroborate before sending notes back to the ME or discuss it first with the ME, get a version that could be the final, and then share with artist? I don't know if this artist has ever had a song mastered before and they have pretty much deferred all engineering elements of this project to me. Probably thinking about it too much but I want to instill confidence in this artist and in them believing they have a finished product. Hard to do that when I don't believe it's there yet. Any thoughts?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072972280356933702",
    "author": "austenballard",
    "date": "2023-02-08",
    "content": "That will probably give the mastering engineers in here a seizure but yknow",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072976056224579727",
    "author": "austenballard",
    "date": "2023-02-08",
    "content": "You'll be the #1 sped up and slowed+reverb version mastering engineer in no time and inundated with TikTok songs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1073649283619893319",
    "author": "georget113",
    "date": "2023-02-10",
    "content": "For the Mastering Engineers if you were say in an interview what are some questions would you want to be asked",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075594156157702215",
    "author": "THEAUX ELLIOT",
    "date": "2023-02-15",
    "content": "My mastering engineer is in SLC Utah and needs a room to work out of @Nomograph Mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079794837953458187",
    "author": "Nomograph Mastering",
    "date": "2023-02-27",
    "content": "That’s a great question. I’ve seen people make a deal with their homie where they always master each others tracks, so at least there’s a little objectivity. It’s hard to have a real sense of where beginner dedicated mastering engineers are at",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079865707396866049",
    "author": "Nomograph Mastering",
    "date": "2023-02-27",
    "content": "Not a lot to argue with there. But… how do we help @macca move forward in his situation. He doesn’t want to be a mastering engineer, he wants to make his mixes sound finished enough that they can be released",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082212336175173662",
    "author": "Nomograph Mastering",
    "date": "2023-03-06",
    "content": "I think a lot of mastering engineers like to infantilize their clients ... \"ugh, another shitty mix that's over saturated from a mindless band with no vision... I know better\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1083054407752630315",
    "author": "Deleted User",
    "date": "2023-03-08",
    "content": "I would love to hear him talk about time and relationship management. Mastering engineers work a whole lot more songs and spend less time on one, and wider range of clientele. So I was curious how mastering engineers would maintain the relationships with possibly larger number of people\n\nHow does he work with time to make it possible to turnaround a lot of songs, especially when they are time sensitive? And how does the life outside of work fit into his schedule. \n\nAlso would be curious to hear about this from mastering engineers on here as well!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086747324660842688",
    "author": "cian riordan",
    "date": "2023-03-18",
    "content": "If a mastering engineer asks to work from the ref, I’m not necessarily saying no. I’m just asking they give it a crack from the unlimited mix",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086747534145372170",
    "author": "cian riordan",
    "date": "2023-03-18",
    "content": "But 99.9% of the time, the mastering engineers I hire smoke my ref… so the system is working.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086749050809884732",
    "author": "cian riordan",
    "date": "2023-03-18",
    "content": "It’s just an extra file I know they’re not gonna use. Not saying it’s for everyone, but no mastering engineer has ever pushed back.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086758753904365598",
    "author": "Nomograph Mastering",
    "date": "2023-03-18",
    "content": "Mastering engineers hate everyone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090742894853357619",
    "author": "ehutton21",
    "date": "2023-03-29",
    "content": "I don’t understand the urge to integrate AI from a creative & musical stand-point. Could AI sort my samples (it can) or prep my sessions? That would be dope. But I don’t want AI replacing mastering engineers as a whole, or mixers, or producers—I’m not sure being neutral or indifferent about the people who routinely insert its utility keeps in line with the fundamental idea that good work from good people is a worthwhile pursuit in and of itself.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090744005127581696",
    "author": "ALXCPH",
    "date": "2023-03-29",
    "content": "Id love to stear the conversation away from good vs bad, but maybe towards, \n\nWhat is the point of a mastering engineer today? \n\nIs it technical skill? Is it a creative input? Is it psychological? Is it monitoring? All of the above? \n\nWhich of these things can be replaced? Because i have no doubt that some of the skill sets Will be replaced. And others will change in function",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090744293364334703",
    "author": "ehutton21",
    "date": "2023-03-29",
    "content": "I think the idea of positing AI as a replacement for the human element is different than talking about how AI will change what it means to be a mastering engineer or a mixer, or what have you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090752626670448740",
    "author": "Nomograph Mastering",
    "date": "2023-03-29",
    "content": "I’m not all that interested in being aligned with what most mastering engineers do",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091843266586103828",
    "author": "CK",
    "date": "2023-04-01",
    "content": "To all the Mastering Engineers, I appreciate you. I had to Master an album today that I mixed for an artist because he did not have the budget for an ME, and he was gonna have a \"friend\" do it. I said please god no, I will do it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097345354019655691",
    "author": "gab",
    "date": "2023-04-16",
    "content": "Hello! Was just wondering what people's thoughts are on separate streaming + digital masters vs one set of digital masters across both? A mastering engineer I've never worked with before just delivered separate ones (-9 lufs streaming and -5 lufs digital) which I've never seen before and doesn't fill me with the largest amount of confidence - the feeling of the record changes a bit when it's more / less slammed and I feel a bit weird about the idea of two different feeling versions of one record existing in the world. Is there a technical advantage to the separate digital masters approach?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097357525667553280",
    "author": "gab",
    "date": "2023-04-16",
    "content": "but seeing it as a default made me wonder if it was just a development that my go-to mastering engineers haven't kept up with or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1098977754726289448",
    "author": "masteredbyjack",
    "date": "2023-04-21",
    "content": "Okay another Q here for @Nomograph Mastering  @Rollmottle or of course anyone else...have an artist that's asking for a radio master...her previous mastering engineer was also apparently super insistent on the whole separate streaming master, Apple Digital Master, etc...but is this a thing? I've never been asked for it and I'm trying to figure out if it's actually necessary and a thing or if it was just the previous engineer not knowing what's going on in the real world.\n\nI have successfully conveyed the idea that one master for everything is the right way to go, which is great. She's very open and receptive! But I do not know about the radio thing...and trying to guess at whatever the heck, in Ruairi's words, \"multiband fuckery\" is going on at a radio station seems hard. Could see how leaving it more dynamic would work though or be somehow beneficial",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099302692892966952",
    "author": "Deleted User",
    "date": "2023-04-22",
    "content": "I recently did a remix and the producer who produced the original version is saying he will master all the remixes. I asked him if I can send it to my own mastering engineer but he said he'd like to do it himself so he can master the whole remix compilation with coherence. It makes sense, but I have a hard time trusting him because he's not a mastering engineer... How should I go about this situation?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100611376780693575",
    "author": "Nomograph Mastering",
    "date": "2023-04-25",
    "content": "Blame Mastering Engineers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100627027268218953",
    "author": "cian riordan",
    "date": "2023-04-25",
    "content": "A mastering engineer in another life, no doubt.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100654167682469928",
    "author": "stefanmacc",
    "date": "2023-04-25",
    "content": "Do that , tell the mastering engineer it’s the actual mix. Tell the artist the mastering has got it covered and CC them both on the email together. See how it plays out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100677802426109982",
    "author": "Nomograph Mastering",
    "date": "2023-04-26",
    "content": "Perceived Level potential is mostly defined in arrangement and finished in mixing. As I said on the live with Matt, it’s like a check written, and a good mastering engineer can cash it for it’s full value. A bad mastering engineer with either fall short on level, or break it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102809408221757460",
    "author": "matthewrederburg",
    "date": "2023-05-01",
    "content": "I have a silly question for all the mastering engineers out there. Is it bad form to hire a ME to work on material that will never see a release?\n\nThe majority of my current work is recording/mixing live sessions for a radio station, an endeavor that has no budget or consideration for the mastering stage. I’m looking to build a relationship with a mastering engineer and it would be well worth it for me to pay for a few masters myself, in lieu of any actual client, in order to find a mastering engineer that I like.\n\nThe mixes sent will likely be from my work on these live sessions. It’s contractually fine for me to send this material for mastering, but nobody is asking for it and therefore none of the mastered material will be released.\n\ntl;dr I want to pay professionals for services but I’m worried that the context is weird. Am I good?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102828797591564388",
    "author": "matthewrederburg",
    "date": "2023-05-01",
    "content": "I freelance outside of my radio job. These projects are more likely to make it to mastering. My work history leaves me unable to recommend a mastering engineer to clients when they ask, and I'm looking to change that.\n\nThe radio recordings go like this:\n\n1. Record artist performing live\n2. Edit and mix for broadcast\n3. Sessions gets broadcast. This is the primary \"release\" of the material\n4. Copies of lossless mixes get sent to artist after broadcast. They do with them what they like, including the possibility of release. My involvement here amounts to no more than a credit.\n\nI mention these radio recordings because they represent the bulk of my recent work, and they happen within a fixed process with no consideration for mastering. I started this job without a working relationship with a ME, and the scope of these sessions don't enable me to ever send my work to mastering engineers. Nobody is paying for it basically. I'd love to though!\n\nTo answer your question @Nomograph Mastering , the material sent for mastering would have already reached all of its expected stages of release. I would only be hiring a mastering engineer to work on it so I may hear their work. The mastering is for me, not the radio station or the artist - it just so happens that these live session mixes are the most frequent and current projects I work on.\n\nIt's a weird situation and that's why I ask the question. I'd just like to be able to recommend a ME to future enquiring clients, and seeing as I have no recent history with any mastering engineer, hiring them to work on the material I have seemed like the best way to get to know their work.\n\nWhew. Appreciate your time. That was really hard to chew through for some reason.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103006961487859712",
    "author": "David Fuller",
    "date": "2023-05-02",
    "content": "I'm very used to mastering engineers totally fucking mixes I've done in the past and have absolutely been guilty of it too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106270708004298823",
    "author": "masteredbyjack",
    "date": "2023-05-11",
    "content": "Ohhhhh snap! I hired Merrill years ago when he was $150 a song for my own stuff, the second proper mastering engineer I’d ever heard. He crushed it. Tough bar to beat after that start haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109217809965264956",
    "author": "Jodonny",
    "date": "2023-05-19",
    "content": "Yeah, it all really depends who you're talking to and context of the conversation. Some people would define it as prepping the mix for final delivery to distributors, or processing done to the entire mix, or making a song competitively loud. Mike Dean talks about how he often \"masters\" his own songs he's working and not using another objective party because he trusts his ears more. Producer/mixer/mastering engineer blurred into one.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109220496542810142",
    "author": "Jodonny",
    "date": "2023-05-19",
    "content": "Does that ever bum you out as a mastering engineer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122674738184073286",
    "author": "cian riordan",
    "date": "2023-06-25",
    "content": "If you own RX, the easiest way would be the plugins within the daw. RX declick comes to mind. Should you master your own tracks? That comes down to confidence and experience… and all of the questions you’re asking indicate neither. Hit @Rollmottle to see how much it would cost to have someone with some chops bring it over the line for you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122682427756785816",
    "author": "Deleted User",
    "date": "2023-06-25",
    "content": "That’s how I feel as well. I’m getting mix notes- and he asked me if I wanna hire a mixer, which I am down for but I doubt they’d have enough money to hire a good mixer if they don’t have money to hire a mastering engineer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122911553163886612",
    "author": "Zach Hughes",
    "date": "2023-06-26",
    "content": "I have a client who sent off a mix I did for him to a mastering engineer I’ve never worked with and the mastering engineer has complained that my mix is too loud. He told the artist that if the mix were closer to -3 or -4 dbFS that would be better for mastering. I’m wondering now do I turn this into a teaching moment or simply acquiesce to the request? The mix is precisely how I want it and was approved by the client and I am now a smidge concerned with this ME.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1127265866657046643",
    "author": "Reedy",
    "date": "2023-07-08",
    "content": "I’m shaming for providing professional mastering services from a bedroom studio, that shouldn’t happen…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1131412151421112340",
    "author": "sethearnest",
    "date": "2023-07-19",
    "content": "Question to the mastering minds on here from a mixer who has to self-master often: when pushing a solo piano (or piano-focused arrangement) into 'very loud' territory, limiters seem especially sensitive to pianos and get to crackling faster than with most any other instrument. \n\nMy thoughts as to why: \n1) the inherent dynamic range of the instrument (attack vs sustain of it)\n2) The amount of midrange frequency build up inherent to the instrument and overtones created\n3) Often, the music styles I'm referring to will be orchestral or film score ish, so any amount of distortion is noticed more quickly than the natural masking that can occur in something like a rock track\n\nFF ProL2 seems especially sensitive to pianos, and I'll often reach for something else when it's a piano-heavy arrangement.\n\nIs there something else I'm not thinking about in this area? \n\n(This is all under the umbrella of knowing how to do loud well w/the understanding that often times our solo piano Icaruses don't need get that close to the sun, and I can just back it off a couple dB. I'm just trying to understand why limiters seem to fall apart so quickly specifically w/pianos.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132346386491375697",
    "author": "Gerhard Westphalen",
    "date": "2023-07-22",
    "content": "It was funny to see how closely Dale’s process is to mine down to not having multiple finder windows open. No way to be a good mastering engineer and not be paranoid about this stuff. Only difference is it’s not so fun when you have to do it all on your own 😬",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132352602080821268",
    "author": "Gerhard Westphalen",
    "date": "2023-07-22",
    "content": "Is that not the general trend in all music production based on all of the YouTube tutorials etc? I know plenty of mastering engineers who are the complete opposite and lack some of the organizational skills or attention to detail",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1142402313705754655",
    "author": "Maxim",
    "date": "2023-08-19",
    "content": "I’m not a mastering engineer but my first move would be trying to highlight the hihat in RX with the brush tool and gaining it down + maybe using some spectral repair. \n\nIf that doesn’t work I’d probably try isolating the hi hat on a seperate track (RX music rebalance to get drums) and only for those offensive sections automate a sidechain that ducks the hihat signal from the mix with something like Soothe.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143721112769941505",
    "author": "Nomograph Mastering",
    "date": "2023-08-22",
    "content": "Some mastering engineers see themselves as mistake/distortion/level/phase police",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143721207670263828",
    "author": "Eric Martin",
    "date": "2023-08-22",
    "content": "I also understand that @cian riordan delivers mixes to his mastering engineers with the limiter not “turned off” but turned down",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143725244213891072",
    "author": "hebakadry",
    "date": "2023-08-22",
    "content": "1. more dynamics, 2. treated sibilance, 3. shorter sides, and 4. smarter sequencing…those are all good things to know about.  And if you’re at the forefront of that as a mastering engineer you will certainly have a better sounding cut, especially if you make very informed decisions about where it’s cut, plated and sometimes bargaining with the label about where it’s pressed.  It empowers the artist to know they have some control on how their LP will sound instead of just throwing hands up in the air and saying modern vinyl sucks, which is not true.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143788752133705799",
    "author": "Reedy",
    "date": "2023-08-22",
    "content": "Reading this has reminded me of a horror story I had earlier this year with a client / mastering engineer. It's hardly relevant but I'd like to share it as it's public forum and I'm curious if other people have gone through similar experiences. \nI said to client I could master the record, they said they had read online that the mixer should never master the record and to get a different mastering engineer. I said sure, but I would be happy to give them a test master to compare against the master from the engineer. Sent it off to mastering with the mix, test master and stems for stem mastering. Mastering engineer came back and had *completely changed the character of the record*. Did not sound like the mix I had done and definitely didn't sound like the test master I had done (which was mainly a louder version of the mix). Fine if it doesn't sound like the test master, but not fine if it didn't sound like the mix. We must have sent it back to this guy 3 times and every time it returned the same wildly different character. I told artist let me have another go at the mastering, they agreed and I did another master. All was good until the client brought it into their car and apparently there was something really wrong with the master... To this day I still don't know what exactly was wrong, I tested and tested and did absolutely everything I could to eliminate the problem the artist was talking about, but I couldn't hear the problem they were talking about and every time I changed stuff and sent it back to them to test, the main issue at hand was still there. In the end, they went with the mastering engineer's master. I didn't care that they went with someone else, I cared that my mix work was undone and I went above and beyond to try and repair it and it was all for nothing. Kick in the teeth is that it wasn't really that great a record either and I did far too much work for something I should have declined to work on in the first place.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143801985091522673",
    "author": "Reedy",
    "date": "2023-08-23",
    "content": "To add, it was wasn't clear if the mastering engineer did a stem master or mastered the mix, he never said... But I'm gonna go with it was a stems master. (I only provided the stems because the artist asked me to send it because the mastering engineer told him to do it).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143802001570922526",
    "author": "Nomograph Mastering",
    "date": "2023-08-23",
    "content": "So now we have a mastering engineer trying to solve arrangement problems …",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143802414751809567",
    "author": "Reedy",
    "date": "2023-08-23",
    "content": "I think the headspace the mastering engineer was in was: this record is bad, I'm gonna change it to give it some character and spice it up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143805362152153098",
    "author": "Maxim",
    "date": "2023-08-23",
    "content": "Oh no worries bro this topic hits close to home. Germany is dominated by stem mastering. It’s very common and I think it’s needed for the type of stuff that’s made here too. \n\nLex Barkey for instance gets credits as a mastering engineer but is practically mixing. Heck he’s even adding delay throws at this point. Same for me too at this point I guess.\n\nNobody cares they just want the record to sound as good as it can. \n\nProducer is the mixer…mastering engineer finishes it all.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143807479369695232",
    "author": "Reedy",
    "date": "2023-08-23",
    "content": "I know a mastering engineer who won a major contract (was 10th in the line of mastering engineers that this record had already been sent to) by literally doing nothing. Sent the masters back to the producer and said there is nothing I can do to this to make it sound better. Producer chose his masters as final and he’s the one who got the credits lmao.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143917271367024740",
    "author": "Maxim",
    "date": "2023-08-23",
    "content": "Yeah I guess figuring out credits and compensation can be a bit confusing sometimes. I’m seeing more co-credits these days. Producer and mastering engineer both listed as mixers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152329708202119239",
    "author": "JakeTB",
    "date": "2023-09-15",
    "content": "One intimidating thing I’ve noticed is that many of my favorite mastering engineers have a greater technical know-how than the average, say, mixer.\n\nOf course the artistic skill trumps the technical, but does that technical knowledge have unique utility in mastering? And is it a prerequisite to being a “legit” ME? \n\nI always feel weird when people ask “do you master too?”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152604933489709197",
    "author": "Nomograph Mastering",
    "date": "2023-09-16",
    "content": "Don’t let the technical knowledge thing distract you if you are interested in mastering. I’m not sure most Mastering Engineers are anywhere near as technically able as you imagine, though many like to project it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152606864622751836",
    "author": "Nomograph Mastering",
    "date": "2023-09-16",
    "content": "However possible it is to be a great mixer and mastering engineer at the same time I’m pretty convinced that it’s impossible to master your own mixes, I went into this on my last Live with Matt. For reasons of objectivity. Take a break, different speakers etc etc and you might get close but fresh trusted ears will always be better",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152710463579246632",
    "author": "Jonathan Jetter",
    "date": "2023-09-16",
    "content": "I've also been on the receiving end of some really difficult experiences w/ fairly name mastering engineers, and I know with certainty I can give a better service experience than that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152985092424212541",
    "author": "hyanrarvey",
    "date": "2023-09-17",
    "content": "I guess this just reinforcing the fact that mastering engineers: producers and mixers lives are at stake when it comes to this so like you’re the last line of defense 🫡",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153391373970587648",
    "author": "Zach Hughes",
    "date": "2023-09-18",
    "content": "Curious to get some other mastering engineer's takes on how they handle revisions when the artist wants to swap mix files? I've worked with one mastering eng in the past who charged extra to send a new mix file. What do other folks do?\n\nTwo recent examples: I had a mix rev sent back (new file) that the artist told me the bass was turned down a few dB but the mixer had actually turned everything else up a few dB and I also got a BGVs up mix but the lead vocal level was changed and tone altered.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154810884552663253",
    "author": "Rollmottle",
    "date": "2023-09-22",
    "content": "Don’t think you’re going to find anybody here who can help. Post in the Mastering Engineers Worldwide group on Facebook",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155196311721750750",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-09-23",
    "content": "Since I have the utmost privilege to work with a mastering engineer who prefers to do stem mastering for the first time, how should I proceed regarding my mix bus chain? Just tell them what I got on there or let them do their thing? Bc the artist is really happy with the mix and I honestly don‘t want the sound to change too much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155228693979988113",
    "author": "Nomograph Mastering",
    "date": "2023-09-23",
    "content": "We had a good lesson here with @AJ recently on being a little more open minded with how new/different mastering engineers approach things. If there isn’t some crazy deadline and if the mix will stem out well then why not move forward with an open mind",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156501694629298178",
    "author": "markmaclure",
    "date": "2023-09-27",
    "content": "Pretty sure I'm fine but I thought I'd check: If I print a mix with a sample peak of -0.2 and a true peak of +0.5,  the intersample peaks above zero are not destructive right? Like a mastering engineer could just clip gain that down and have no data loss or distortion? This is a 24 bit file",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164071019464626266",
    "author": "Will Melones",
    "date": "2023-10-17",
    "content": "Im amazed how often this comes up. Like the Internet should just hand every mastering engineer a card that says “The fastest way to lose client confidence is to ask for the mix to be turned down.”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164071035092602920",
    "author": "Nomograph Mastering",
    "date": "2023-10-17",
    "content": "Why are mastering engineers like this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168786379292024932",
    "author": "cian riordan",
    "date": "2023-10-30",
    "content": "Some mastering engineers I don’t feel the need to babysit (yourself included) but definitely if it’s going to people I don’t work with often or Joe-what’s-his-face with the Waves bundle and some HS8s.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171995162835165214",
    "author": "Deleted User",
    "date": "2023-11-08",
    "content": "How do you choose what mastering engineer to go to?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171996552315813968",
    "author": "Nomograph Mastering",
    "date": "2023-11-08",
    "content": "Some genres can have more specialist Mastering Engineers  like EDM, Metal etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171997571980476456",
    "author": "Nomograph Mastering",
    "date": "2023-11-08",
    "content": "No one Mastering Engineer is perfect for every client, so being clear about what it is that matters to you will help you make a good call",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178105422255759441",
    "author": "Rollmottle",
    "date": "2023-11-25",
    "content": "True! Our audience aren’t other mastering engineers in trick rooms listening to whether I zapped the resonances enough.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195838440051327029",
    "author": "Nomograph Mastering",
    "date": "2024-01-13",
    "content": "I’ve said many times I think most mastering engineers over index on “consistency”, regular listeners care way less about this than geeky folk imagine",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199459479637463151",
    "author": "markmaclure",
    "date": "2024-01-23",
    "content": "As someone who hires mastering engineers, I wouldn’t be very impressed if someone mastered my song in that environment. Pretty easy to recommend  someone else for this one no?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202855200512278559",
    "author": "aidanthillmann",
    "date": "2024-02-01",
    "content": "Hi, I’m not a mastering engineer but I did a sort of mastering experiment recently:\n\nI was watching the Mix with the Masters videos with Randy Merrill and Idania Valencia, and I noticed that they were using plain old input gain before their limiter to push it instead of increasing the threshold of the limiter itself, so their limiter thresholds/gains were at 0. I thought maybe they knew something I didn’t.\n\nSo I tried it. I put a gain plugin before my limiter and pushed the limiter with it. The results? It sounds awful. All the punch and width is gone. Change back to using the limiter’s threshold, sounds great.\n\nAny technical reason for this? I was using the Kilohearts Gain plugin in to Ozone Maximizer, but I would be hard pressed if it was one of those plugins at fault. Maybe the threshold of the limiter has an internal signal flow that changes its behavior as opposed to gain coming in to it or something? Maybe this workflow makes better sense in Sequoia for the Sterling engineers for some reason?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211483294986670142",
    "author": "Eric Martin",
    "date": "2024-02-25",
    "content": "It’s what I do most, I like being involved early on in the process of making music, but I’ll take being the trusted last set of ears also.\n\nI got into it after I got together with a Mastering Engineer friend to listen to his PMC MB2-XBD’s and after 2 hours of conversation he said, “you talk like a Mastering Engineer” I told a few “producer” friends the next day and have been getting more work mastering every year since.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212418610291810326",
    "author": "mariano",
    "date": "2024-02-28",
    "content": "i've just read this: \"Actually, some of the top mastering engineers put upwards expansion after a limiter to punch in the transients and then another limiter after that\" - what do u think?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1216191217608429610",
    "author": "Herb🇮🇪",
    "date": "2024-03-09",
    "content": "Well done on all the recent success these last few years, you're doing the country and Kerry a great credit. Mastering engineers are on the same level as real life shamans, it's almost a blood thing, born into it. Huge respect to anyone that does it at your level",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217500427889938613",
    "author": "Gerhard Westphalen",
    "date": "2024-03-13",
    "content": "One of the prominent mastering engineers who I won’t name once posted on GS about how changing the clock in his system changed how files sounded when exported (all ITB). Even posted audio files. They all nulled. I think he eventually took it down after so many people were point out that it’s impossible for there to be a difference. DAW has nothing to do with clocking",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217665366151397376",
    "author": "Berlin",
    "date": "2024-03-13",
    "content": "I went through a time where I enjoyed reading invoices from other mastering engineers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220499162546569226",
    "author": "Berlin",
    "date": "2024-03-21",
    "content": "obviously we value RX as mastering engineers, but dam i still feel like it’s so undervalued",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1224084417597935688",
    "author": "andresm",
    "date": "2024-03-31",
    "content": "Hola amigos!! always a pleasure to read all of your wisdom in here.\n\nSince 50% of my clients dont have the budget to master with a mastering engineer after I do the mix I end up doing mastering more than I would like but I am intrigue on what would be your process when you do this yourselves. Would you Master in the same session that you are mixing (this is what I have always do) or do you guys mix in one session and then open a mastering session to do the master?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1224085662186213397",
    "author": "Nomograph Mastering",
    "date": "2024-03-31",
    "content": "On my last live with Matt I talked some about this issue and I really still believe that when self mastering keeping it minimal is the key - EQ and limiter (clipper if useful)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232853446692962304",
    "author": "Nomograph Mastering",
    "date": "2024-04-24",
    "content": "Too many mastering engineers don’t ever even meet the song",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1236333462756130856",
    "author": "Will Melones",
    "date": "2024-05-04",
    "content": "Pity the mastering engineer who hears a click in an Aphex Twin song",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243757288821358653",
    "author": "masteredbyjack",
    "date": "2024-05-24",
    "content": "As we here know it’s of course mostly down to arrangement that a given song will sound loud or not for a certain measurement. Yes mixing can get some apparent level, and we should be able to get a little more. As long as it’s not at the expense at the feel of the art.\n\nThat’s my issue with the RX thing…it’s optimizing a number and not feel, not what’s moving me\n\nAlso important to remember that the streaming services normalize stuff specifically so that songs won’t sound much louder or quieter than one another. So another point to maximize the feel and interest of the music first\n\n(I say this not to the fellow mastering engineers here but to others who peruse)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245814835078496367",
    "author": "Berlin",
    "date": "2024-05-30",
    "content": "You’re killing it. Glad u saw it before I did. \n\nI’ve done a lot of live albums in my time and so many of them are gapless programs. But of course, some DSPs work and some don’t… and it always comes back to the mastering engineer with the big question of why, even worse, Blame.\n\nBut the Master WAVs and DDPs are great.. Hit or miss elsewhere. But More often than not it works.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1250880058193874964",
    "author": "Zach Hughes",
    "date": "2024-06-13",
    "content": "Question to the mastering engineers: Better to receive REF mixes and unlimited / less limited mixes of alts in addition to the mains? Or would only unlimited / less limit alt mixes suffice?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1253716513052033126",
    "author": "Eric Martin",
    "date": "2024-06-21",
    "content": "remember when every mastering engineer had their own web uploader coded into their website with dedicated FTP and didn’t rely on 3rd party components?\n\nIt’s easier now, no?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255525120303431720",
    "author": "mixedbywong_my",
    "date": "2024-06-26",
    "content": "Yes to this and there's so much A to Z videos for Wavelab officially made by mastering engineer Justin Perkins , I went from knowing nothing about mastering to almost average in no time really.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258066082887893214",
    "author": "Conah Tucker",
    "date": "2024-07-03",
    "content": "Hey there how's it going!\n\nJust wanted your thoughts on advice on something I'm currently trying to tackle with my own mastering buisness.\n\nCurrently on my 2nd year, and at the moment I'm contacting lots of UK dance/electronic labels to try get some consistent work coming in. All is well until the majority of labels I contact all get mastered by the same engineer who charges £10 a track, which I think is such a low rate and seems like a race to the bottom.\n\nIs it worth it at my stage to take on these lower paying gigs? \n\nMy thoughts are:\n- It could be damaging to the clients I already work with that pay my full rate.\n- These bottom clients will never be full rate if they've had a £10 deal for years\n- It gets more work in for me = my name gets spread out a bit more. But, these labels never seem to credit the mastering engineer.\n\nWhat are your thoughts? What would you do?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258439885254037605",
    "author": "Conah Tucker",
    "date": "2024-07-04",
    "content": "Fella called Rob Small, huge mastering engineer seems to master a lot of the big names in the electronic scene. Tried to get in contact with him a few times to no avail",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1262417879056384102",
    "author": "Nick Stetina",
    "date": "2024-07-15",
    "content": "I mastered a single for a young band, its their first time hiring a dedicated mastering engineer. The singer sent over a revision request with a screenshot of an EQ with boosts and cuts ranging from +/- 3-5db in various places using headphones for review (not sure what model). I checked out the requests this morning and it truly feels like we’re EQing for this guys specific headphones, the master really suffers from it, imo.\n\nHow would you toe the line on this one from the low friction, “how high?” attitude on one end of the spectrum to opening up a dialogue about “rather than specific EQ points, can you describe what it is you’re trying to achieve from each of these? Can you share if there are any references your A/Bing agains that may be insightful?”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1268400431982313602",
    "author": "Nick Stetina",
    "date": "2024-07-31",
    "content": "Binged this along with most of the other interviews with mastering engineers on a long car ride last week. Chris’ was a good one! Pretty sure the Andrew Maury episode you shared was the catalyst for digging in.\n\nDamn, I think I missed the Giamatti effect listening at like 1.5 speed. You think Chris would charge his rate for a single to record himself saying, “I am NOT drinking any fucking MERLOT!”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1272333582815465504",
    "author": "Spencer Broschard",
    "date": "2024-08-11",
    "content": "I’m curious what you spend the majority of time on in RX for mastering? Manually de-essing and other micro adjustments like that? I haven’t heard many other mastering engineers talk about RX as much as on here so just wondering!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1272338396672561204",
    "author": "Nomograph Mastering",
    "date": "2024-08-11",
    "content": "I love RX and depend on it but it’s not where the ball is for a typical mastering engineer coming up - monitoring, room, EQ and client relationships are 100 times more important",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1274420891601866773",
    "author": "Will Pragnell",
    "date": "2024-08-17",
    "content": "Which is totally fair! Maybe what we're uncovering here is that what I wanted in that context as an artist wasn't really mastering, I wanted mix feedback, and I happened to try to ask mastering engineers for it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275681007034699787",
    "author": "thegreatcarsoni",
    "date": "2024-08-20",
    "content": "I’ll admit I’m kind of afraid to overuse limiters in the mix because I don’t want to bake in a choice that limits (pun intended) the mastering engineer’s options. Because most mastering engineers I’ve worked with know their way around a limiter better than I do. But I think I’m slowly undoing this habit as I get better",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1276133856784809995",
    "author": "Karim",
    "date": "2024-08-22",
    "content": "Interesting- in our convos we found a lot of mastering engineers wanted to skip projects entirely and just see the player that clients are getting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283932460811423786",
    "author": "aidanthillmann",
    "date": "2024-09-12",
    "content": "I have a funny question, but it's something I've always wanted to ask a pro mastering engineer. When I (a mixer) get hired to do a mix/master for an indie client, I often feel like I lack some knowledge about the technical side of *delivering* a proper master. Is there a sort of checklist that I could have in terms of making sure the master file I deliver goes through a similar QC process as a pro master would? Things like dithering, sample and bit rate stuff, fades, and then the realm of things I've never thought about like metadata come to mind. Or an answer could be I shouldn't worry too much about all this and just deliver a file at same sample rate/bit depth as it was and hand over the .wav? Just wondering if I can step up my \"mastering\" game in a technical sense (quotations because I will never call myself a real mastering engineer lol)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1286973754978730058",
    "author": "Deleted User",
    "date": "2024-09-21",
    "content": "Hi I’m new here and don’t want to offend anyone if you’re an amazing mastering engineer…. At the moment I’m going to sterling sound and having them master our songs, is it worth it? I do like Joe LaPorta",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1296843658070589513",
    "author": "Nick Stetina",
    "date": "2024-10-18",
    "content": "Good morning mastering friends. Friendly Friday reminder to love thy mix, or as nomo has said \"the job is to love what's in front of us\". \n\nKicking off my day navigating a conversation with an artist I mixed for (who is new to this) and has a mastering engineer in their ear asking if I have a \"less compressed/limited\" mix. I guess already backed off version at 12 LUFS with no overs isn't enough room to use their new compressor the way they wanted today 🙃 \n\nWhat would this person do if they got a mix from Serban thats at -6LUFS with peaks over 0? ( *spoken in bad Chrisopher Walken impression *) “Serban, babyyy, you’ve got it all wrong.”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1298704351111413891",
    "author": "Berlin",
    "date": "2024-10-23",
    "content": "I think the main question is where I'm hung up - I'm still curious about the mix. Even with the response \"it's not like removing clicks from a vocal in the mix\". Why are we sending mixes with DC offset and sub harmonic LF information and clicks and pops in the vocal in a mix to the mastering engineer and then asking why they are present on the master?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301990970312622151",
    "author": "Will Pragnell",
    "date": "2024-11-01",
    "content": "if becoming a mastering engineer is the thing that gets me to sign up for tiktok… 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308484048431222854",
    "author": "JJ",
    "date": "2024-11-19",
    "content": "I hope this is an okay question to ask in here, but who are some amazing \"rock\" oriented mastering engineers I should check out? Interested in digging a little for amazing mastering people that aren't the obvious big names and maybe fly a little under the radar. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313505554714329189",
    "author": "Dereck Blackburn",
    "date": "2024-12-03",
    "content": "A client recently shared her experience with AI mastering services like Landr and Maastr. While she appreciated the loudness and convenience, she felt something was missing—like the \"thump\" and clarity were overhyped and didn’t translate well in the final product. She noticed a clear difference when comparing AI to professional mastering and now considers using these services as more of a 'gut check' than a final step. I would love to see the data on overall satisfaction with online mastering vs using a real professional. Any insights or resources regarding this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1327526502782210108",
    "author": "cian riordan",
    "date": "2025-01-10",
    "content": "Certainly common for mixing, but I’ve never experienced it from a mastering engineer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328453449112752219",
    "author": "Gerhard Westphalen",
    "date": "2025-01-13",
    "content": "This might be more suited to biz talk but looking specifically for input from mastering engineers where your involvement in a project might just be a few emails rather than months of working closely together - when you have a project with a new client and it's rather painful on your end from not very helpful notes, going back and forth on what they want, thrilled with v1 but just a few \"small\" notes than ends up with countless revisions, \"we liked how the snare sounded in v1 and how the vocals sounded in v2 but v3 had the nicest texture\" type comments, etc but it was all pleasant interactions, not tense in any way (at least based on email exchange), and they might thank you afterwards for the great work etc - do you respond back saying \"it was great working with you\" etc or would you push back and offer some kind of feedback on it not having been a great experience working with them?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328463103754502299",
    "author": "Ted Whitten Media",
    "date": "2025-01-13",
    "content": "I feel like a good mastering engineer has to be part psychologist when it comes to dealing with artists.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328463188655865966",
    "author": "onanisland",
    "date": "2025-01-13",
    "content": "100% true with recording engineers, mixing engineers & mastering engineers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328464383696961567",
    "author": "onanisland",
    "date": "2025-01-13",
    "content": "I recently had a mastering engineer friend ask me to help them by listening (they were going crazy in a similar situation), so I asked them to send me  10 seconds of the mix and I sent back what I'd do just as an experiment, he redid he master the client loved it,  problem solved. He had done way much more fixing than I would. Mine had problems but was less intrusive...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328467565546307586",
    "author": "cian riordan",
    "date": "2025-01-13",
    "content": "@masteredbyjack is a great mastering engineer and a pleasure to deal with. Everyone should be more like Jack.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328562785180844034",
    "author": "masteredbyjack",
    "date": "2025-01-13",
    "content": "I ask because I often find people who do stem mastering…what do you know think it’s great\n\nSo I wonder if the mastering engineer is saying it’s better, etc or any other number of things that don’t have to do with your mix",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1329871152818163713",
    "author": "Will Pragnell",
    "date": "2025-01-17",
    "content": "For mastering projects with more than just one or two tracks, what are folks thoughts on delivering one track before doing the rest, vs the whole lot at once? Thinking about this from the perspective of the client and how it makes them feel and could add / remove confidence. On one side, it gives them an early indication of direction and an early opportunity to give feedback, which some may enjoy. On the other, it could communicate less confidence on the part of the mastering engineer, and I feel like a big part of what we are trying to do here is make them feel confident about releasing the record. Found myself wondering about this over my morning coffee... anyone thought about this much?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330695292663758908",
    "author": "Will Pragnell",
    "date": "2025-01-19",
    "content": "Great question. Let me try to answer. I suspect this may be where the learning opportunity lies...\n\nI think what matters to me is that 1) the piece is presented in the best way possible to maximise its impact or essence 2) the piece is listenable and that impact is not lost in a wide range of environments / contexts (i was tempted to say \"it translates well\" but I think that's a subtly different thing) 3) the client is happy with the result, and feel confident releasing their art, feeling good about it, feeling it's the best version of what it could be.\n\nI think it's point 3 that gives me pause. You can count my paying mastering clients on one hand, so I'm as \"beginner level\" as it gets, but that said, when i talk to those clients, they share with me that they want a mastering engineer to ensure that their music is going to \"sound right on streaming platforms and translate well to lots of systems\". There's a lot of FUD about loudness normalisation, LUFS, etc. I don't think it's a huge leap to feel that we should also be thinking about common playback devices such as airpods, and bluetooth speakers. For clients who aren't seasoned mixers or record makers, I wonder how they would feel if they listened to their mastered record on a bluetooth speaker and heard that whole parts had practically vanished. Of course I'm also sensitive to not wanting to introduce doubt in their minds unnecessarily.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1332052972452188232",
    "author": "Will Pragnell",
    "date": "2025-01-23",
    "content": "Since we're on the topic of vinyl. When did folks first start seeing the separation of the mastering engineer and the cutting engineer? Back when I was regularly pressing records and working with others who did the same, the two roles were always one and the same thing. That may have just been specific to the UK dance music world, though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334193395052314797",
    "author": "Nomograph Mastering",
    "date": "2025-01-29",
    "content": "How likely is is that the Mastering Engineer has QC’d all of those versions?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334301219799433316",
    "author": "Nomograph Mastering",
    "date": "2025-01-29",
    "content": "Mastering Engineers>?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1334948778679209994",
    "author": "Eric Martin",
    "date": "2025-01-31",
    "content": "I think the cutting engineers job has to turn it down so that the cutting head doesn’t jump, but from my understand just turning down a crazy limited digital mastering is going to result in a bad sounding vinyl, I could be way off, but a cutting/mastering engineer that I work with essentially told me the best practice prep is to EQ and level for a master but don’t limit or compress if the mixes were already compressed sounding, the end result vinyl will sound better that way.\n\nI recently did exactly this and mastered a record essentially to -16 doing the EQ that made things sound right but didn’t limit at all because it didn’t need it, and the cutting engineer will do the transfer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1335370972160856196",
    "author": "samvalentine",
    "date": "2025-02-01",
    "content": "Hey yall, I’m attending a mastering session for an album I mixed. It’s not a mastering engineer I’ve used before, but he is whom the label has a history with. Any tips on how I can get the most out of the experience? I’ve never attended a mastering session before.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1335391876227928084",
    "author": "samvalentine",
    "date": "2025-02-01",
    "content": "Hahah. Good question. The artist & A&R asked me to. Seems like they frequently do attended sessions with this mastering engineer… and if I’m going to be there I hope I can use it as an opportunity to learn something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337574475264430191",
    "author": "Paris Lee",
    "date": "2025-02-07",
    "content": "…don’t get me started about Samply…and I have no desire to. I’ve said my peace to them, I’ll just leave it at that and live my life. \nTheir problem really is they update the software way too much  and also IMO promised something and then had unanticipated issues scaling up. But that’s pure conjecture. \n\nI use it for internal playback because it’s still the best, but I no longer send it out as a review method for clients \n\nFor the record though, one time i had a record on Apple Music have a bad pop on a song intro , in the same spot every time when i rewound it, I was horrified and felt like a complete asshole. \n\nI restarted Apple Music and played it again\nIt was fine. \nShit happens…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1354485530238390272",
    "author": "Nomograph Mastering",
    "date": "2025-03-26",
    "content": "Too many Mastering Engineers get hung up on details and make their client’s day harder",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359943392506675453",
    "author": "Gerhard Westphalen",
    "date": "2025-04-10",
    "content": "Vinyl mastering question from a complete vinyl noob - what's the overall process? I've always passed off vinyl to other mastering engineers when it comes up for a project I've mastered but I've just been asked for \"vinyl ready masters\".\n\nWhat's the process usually like? I would prepare files with attention paid to bottom/top end which then get sent to an engineer with a lathe? Do they do any subsequent processing? Or do I submit just the regular digital masters and they handle everything?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359946493934702814",
    "author": "Elaine Rasnake",
    "date": "2025-04-10",
    "content": "Generally when I've had to master files for someone to press to vinyl, I will take the limiter off and create  designated A side / B Side files along with a PQ sheet of all of the start/stop times, album order, and things like that via HOFA DDP Maker.\nI leave all of the high end low end adjustments to the pressing engineer since they will know best what needs to be adjusted, if at all. \n\nI know of some folks who also just send the limited \"digital distro\" files but I prefer to give a more dynamic version and the pressing engineer can adjust it.\n\nUsually an artist will go through test pressings and if there are issues, usually (or at least ideally) the pressing engineer, the artist, and the mastering engineer are all communicating about things and next steps",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359948305727230223",
    "author": "Elaine Rasnake",
    "date": "2025-04-10",
    "content": "Usually the mastering engineer that made the digital distro files will also provide the vinyl pre-master side a/b files",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359958778694471890",
    "author": "Grover",
    "date": "2025-04-10",
    "content": "If that much limiting is happening then sure, it's part of the music. My experience is mainly with two situations:\n\n1. The digital mastering engineer is the same as the cutting engineer. Artists were not bypassed in getting the vinyl cut approved. They listened to and signed off on both. \n\n2. The digital and cutting engineer were working closely together. \n\nNow, a lot of these artists were not making music that required massive amounts of limiting to sound the way they do. \n\nThat said, I disagree. Vinyl is already changing the sound so radically that if sonic faithfulness to the digital master is required - why make vinyl? A record will NEVER sound like the digital original or even the tape master for that matter. No two lathes sound anything alike, and the differences can be astonishing. I have heard a lathe amp turn a wretched sounding track into a brilliant one. And vice versa. Vinyl is an unfaithful medium. If you don't care about the cut's sound that's fine. Submit whatever is submitted for the digital master and let the pressing house sort it out. Why even bother with a proper 3rd party cutting engineer at that point?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359959544733896794",
    "author": "Grover",
    "date": "2025-04-10",
    "content": "I suppose the philosophy as I understand is that the vinyl cutting engineer is much like the digital mastering engineer. Trying to preserve as faithfully as possible, but also dealing with the fact that they will have to alter the sound.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360307031499870289",
    "author": "Stefan",
    "date": "2025-04-11",
    "content": "most underground dance that goes vinyl only isn’t crushed like this and sounds better but Ruari is right a mastering engineer isn’t hired to changed the aesthetic in most cases so making things sound better although counterintuitive would ruin the vibe. Gotta know the sub culture or in this case the mainstream",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361395753242722569",
    "author": "Grover",
    "date": "2025-04-14",
    "content": "That was kind of my point, my (and only my) understanding of mastering is \"do no harm.\" I produce and write quite a bit too and I'd be a little cross if a mastering engineer was mucking about making massive changes. If an artist and team have made choruses 3dB louder than verses for example, and 3dB or more of limiting is in place, is it appropriate for the mastering engineer to turn up the verses? Sometimes that's what is needed to achieve loudness. My question is less about whether loudness is the goal and more an attempt to describe the philosophy that I was taught, as I understand it. \n\nI think we're saying the same thing?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361396652874666334",
    "author": "cian riordan",
    "date": "2025-04-14",
    "content": "I’m not sure what you’re saying! I guess I’m saying that there are mastering engineers that will hem and haw and try to change what’s in place by peeling back limiting or making changes that change the overall composition and density of the song… and then there are the ones that I want to hire.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361398601913208893",
    "author": "Grover",
    "date": "2025-04-14",
    "content": "I'm not sure what \"peeling back limiting\" means exactly. But I would say that if the client asks for -9LUFS then that is the job, to make it -9LUFS. If they want -14LUFS then that is the job. And in doing so only to pass through as transparently as possible what the creative team has done. The challenging part in mastering is that at a very minute level all of the tools a mastering engineer has do affect the sound. The skillful balance thereof is what makes the craft fascinating fun and challenging. I suppose I was a bit caught off guard by Nomograph's positing that heavy limiting at the mastering stage to affect the groove (maybe I misunderstood that comment) is pretty much the standard. I don't find that much limiting to be very transparent personally. Doesn't make it wrong. clients are free to work with whomever does work they like best, as you say.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361399702104440892",
    "author": "Grover",
    "date": "2025-04-14",
    "content": "sure of course. I guess personally find it a little outside my experience for a mastering engineer to use limiters to get a tone or style though. \nI guess I also don't understand how a mastering engineer can or would want to undo limiting at the mix stage if they're working with a stereo file that's already been mixed...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361403600173269096",
    "author": "Grover",
    "date": "2025-04-14",
    "content": "ahhhh. I was only referring to the final output limiter/clipper that the mastering engineer puts in place when targeting digital loudness. The cutting engineer will just turn your master down if you submit a clipped/heavily limited master.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361434791798505646",
    "author": "Rollmottle",
    "date": "2025-04-14",
    "content": "Any particular reason why? \n\nIf this is your first commercial release, I'd advise NOT trying to DIY. You're too close to it to have any objectivity about it, and that ultimately is one of the key benefits of hiring a mastering engineer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362856255902716214",
    "author": "Nomograph Mastering",
    "date": "2025-04-18",
    "content": "Also, earlier in the mastering journey a good dose of humility around your playback scenario is best practice. I have mixer friends with phenomenal rooms and speakers getting notes from junior mastering engineers with objectively worse monitoring about things like “too much low end in mix”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1367094649365205054",
    "author": "Jasper Boogaard",
    "date": "2025-04-30",
    "content": "I see it as a part of the process. It always helps me to put myself in the shoes of the artist: I've been in many situations with my own music where I asked more of X, got it back from a mix or mastering engineer, and upon hearing the result I realise I actually want the opposite to happen. It's all push and pull trying to find the right result and it's only natural that your clients are the same.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374076059690991626",
    "author": "Nomograph Mastering",
    "date": "2025-05-19",
    "content": "Good mastering work is walking along a thin ledge. On one side you fall into the fussy, amateur thing of mastering engineers sending notes back to mixers/artists. on the other is the deep chasm of fussy, old school Mastering wizards who have super set ideas on who should do what",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374078821556555838",
    "author": "Nomograph Mastering",
    "date": "2025-05-19",
    "content": "I mixed for 10 years before I mastered and did both at the same time for another 5. On balance I would say it made me a worse mastering engineer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374084185790349412",
    "author": "hyanrarvey",
    "date": "2025-05-19",
    "content": "Yo this conversation should be saved or archived cause I think it’s extremely helpful to see this back and forth for newer mastering engineers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374251153549955113",
    "author": "Nomograph Mastering",
    "date": "2025-05-19",
    "content": "Or to sharpen it further if you had the career of 10 beginner mastering engineers in your hand, and you could shape an ideal career path would you have them spend 5 years in the recording/mixing trenches first?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374594065961713674",
    "author": "masteredbyjack",
    "date": "2025-05-20",
    "content": "It’s totally fine as long as the distro takes the 96k from my experience (both independent artists and major label)\n\nThe 44k thing is probably just mastering engineers playing it safer with a format that is for sure accepted everywhere.\n\nAlso “44.1k for streaming”, with the advent of lossless on Apple, etc isn’t so cut and dry anymore!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374772121305223270",
    "author": "Rollmottle",
    "date": "2025-05-21",
    "content": "Not my preferred way of working as a “mastering engineer” but have done it and it’s fine. But I also am comfortable in a production and mix context. I don’t know that I’d call it mastering but it also doesn’t really matter if you get the record across the line. \n\nThe idea that the ME wants or needs more creative freedom as a matter of course, therefore leave decisions of the shape of the record to them, I find to be somewhat dubious. I don’t feel constrained by playing my role as an ME.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374803087247675493",
    "author": "Nomograph Mastering",
    "date": "2025-05-21",
    "content": "A mastering engineer like you still mixes could just jump the fence and be a partner, but I can’t see an upside to avoiding the use of mix tools",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374805581654786180",
    "author": "Nomograph Mastering",
    "date": "2025-05-21",
    "content": "Lots of mastering engineers love the idea of more control, of doing more, of being able to add color/mojo/tone etc. I only care about connection. If the work needs that I’ll do it, but I don’t exactly have my finger over the trigger",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376313108829569174",
    "author": "An Hero",
    "date": "2025-05-25",
    "content": "Regarding my workflow, I produce, mix and master my own music. I also mix and master for record labels, and my workflow and approach are largely unchanged. I get the most out of the mix, and try to apply the least amount of processing necessary down the line (referring to the master chain).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382454635582980188",
    "author": "lystell",
    "date": "2025-06-11",
    "content": "I am not a mastering engineer but I could use some guiding thoughts regarding mastering.\n(I am not a mixing engineer either but I mix some songs of ours that get released)\n\nI have noticed that some of these songs are/are perceived as low in level in comparison with some others on Spotify. \nI know I got lots to learn when it comes to perceived loudness etc, but I feel that are some aspects of the mastering for streaming that I need to understand better. \n\nFor example. I got a song mastered where the master measures at ca -8dB. I like how it sounds/feels. \nAs an experiment I tried uploading it on the site loudnesspenalty.com. After analyzing the result is showing that Spotify is lowering it by 5,5dB. That being that Normalization is on in app I suppose.\n\nI'd appreciate some advice in this subject:\n-  what should I draw as conclusion for me as a mixer in this case\n-  what should I think of in the dialogue with ME",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382458997306687509",
    "author": "Nomograph Mastering",
    "date": "2025-06-11",
    "content": "I would say get the very best Mastering Engineer you can muster and trust them to make the calls",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1393708785675272385",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-07-12",
    "content": "I‘m not a mastering engineer nor a mixer and I have the tools I need in elements most of the time unless it‘s hyper specific stuff that happens once every blue moon and in many cases isn‘t even my turf to begin with \n\n400 bucks for standard rn is a bit too hefty for something that‘s not an absolute necessity for me/ I‘d use everyday",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1393736569227313256",
    "author": "Nomograph Mastering",
    "date": "2025-07-12",
    "content": "Like what is it reasonable to be able to expect someone who calls themselves a mastering engineer be able to deliver",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1393736659312443493",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-07-12",
    "content": "For what it’s worth, I put it in pro tools and did the pitch shifting myself. \n\nBut this goes back to a convo that ppl had in here a while ago - I - not being a mastering engineer - can’t guarantee with absolute certainty that this will be a flawless product that is ready to be released \n\nI did my best and it sounds decent to me but I dont have the skillset to sign this off 100% in good faith",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1393747460580704359",
    "author": "masteredbyjack",
    "date": "2025-07-12",
    "content": "IMO — they should be able to finish the record. And put the stamp on it that it is good for release. Any of the greats will gladly go above and beyond to do so, you being one.\n\nI don’t think that’s “reasonable” but I also think people should know that the ones at the top are killers who have a skill set that is much wider than what you’d at first expect of a mastering engineer, and generous and caring and can solve a million problems outside of their expected scope",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396447042863239250",
    "author": "TEYAH",
    "date": "2025-07-20",
    "content": "Question for mastering engineers:)\n\nWhat are (if any) things you wish more mixing engineers\npaid attention to before sending you the final mix to master?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396669524421509121",
    "author": "tinkerjef",
    "date": "2025-07-20",
    "content": "Depends on the situation no? Often times mixers and producers look for affirmation from the mastering engineer and would prefer to be given an honest opinion",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399805509439193238",
    "author": "Nomograph Mastering",
    "date": "2025-07-29",
    "content": "Are you trying to master your own music in this case?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410630096473296937",
    "author": "masteredbyjack",
    "date": "2025-08-28",
    "content": "Depends how you do it — if you fade in a DAW the file will go up to 32bit probably, so that’s something to know. And you’d have to export or dither down to a releasable bit depth (see above discussion on dither a bit ago). Certainly not sacrilege though.\n\nThe way you describe their response makes it seem ridiculous to me\n\nIf you are asking if as a mastering engineer I would ever advise someone I shipped a master to that they do such a thing on their end, I would say no, simply since I cannot put my stamp on it that it’s been done correctly. I’d do it and provide the file (maybe this is what they meant)\n\nBut what happens when files are out of our hands is not in our control",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411872872405925951",
    "author": "Elaine Rasnake",
    "date": "2025-08-31",
    "content": "I feel like it can be a combination of:\n\nthe client knows another artist that the mastering engineer has worked with and through their word-of-mouth, heard that the engineer was really great to work with \n\nand/or \n\nthe client makes similar music to notable artists in the mastering engineers discography so they can get a (very general) sense that the mastering engineer knows what to do with their genre/music, and thus is trustworthy",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412873953839419497",
    "author": "itaylerner",
    "date": "2025-09-03",
    "content": "I’m not a mastering engineer but I am working on a mixtape for a rapper and They’re going straight from me to CD duplication. Anything particular I need to know about printing for CDs? 16/44.1 of course but anything CD-specific about headroom, metadata, track spacing? Anything I’m not thinking of?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415556187608322089",
    "author": "Jon Tan",
    "date": "2025-09-10",
    "content": "Anyone know if there is an advantage to rendering wav files with the BWF ‘bext’ chunk? Or is it just going to increase file size without useful metadata for clients? A quick lookup tells me that it’s more useful for film and TV and archiving but wondering if any of you mastering engineers leave that box checked in Reaper 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1423152749381550211",
    "author": "Gerhard Westphalen",
    "date": "2025-10-01",
    "content": "Aside from a couple of integrated utilities like DDP and metadata, is there anything that sets the mastering DAWs apart from anything else? Ever since I switched from Sequoia to Nuendo I never needed anything I didn’t have and when looking into things like Wavelab I don’t see anything I’d want or that would be enticing to a mastering engineer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1425024945347367042",
    "author": "danrobinson30",
    "date": "2025-10-07",
    "content": "Hey guys, looking for some advice.  I’ve worked exclusively in Logic to produce and mix and now I’m making a move towards becoming a mastering engineer.  Long road ahead.  Wondering if there is a particular platform for mastering that will be an easier transition from Logic? I know I can master in Logic but it does have its limitations when it comes to metadata and DDP.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429175546419478551",
    "author": "Jonathan Jetter",
    "date": "2025-10-18",
    "content": "Just had a fairly established mastering engineer send back a “revision” that wasn’t actually different.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429924529697849515",
    "author": "Mike Tierney",
    "date": "2025-10-20",
    "content": "Wow that’s actually so smart and solves the perennial mastering engineer problem of needing to do the rx pass again if the client sends a mix swap. Idk about wavelab but in reaper you can bring in a new file and have it populate all existing objects linked to the old file\n\nAs I understand it that works for like, declick and whatnot, but wouldn’t work for spectral repair->attenuate?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429976777291468955",
    "author": "kalpipal",
    "date": "2025-10-20",
    "content": "can I ask, re: mix swaps, how often that happens for you mastering engineers? and for what reasons? i've  submitted swaps because an artist had a last minute mix revision, and i've submitted swaps after realizing something I'd missed, but curious what the MEs are seeing in a larger sample pool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430734880303616085",
    "author": "cian riordan",
    "date": "2025-10-22",
    "content": "The reality with a top tier mastering engineer is that they can’t afford to have this relationship with their clients, even if they wanted to. Imagine an album booked weeks in advance, and you sit down to dig in and notice all these mix fuck up. Is Ted Jensen going to send the album back with detailed notes on what to address? No way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430735057563160737",
    "author": "cian riordan",
    "date": "2025-10-22",
    "content": "Luckily, the folks that pay that much $$ for that tier mastering engineer probably have a good idea of what they’re doing to be swinging on those projects so it’s not usually an issue.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440066180248371222",
    "author": "Bryan DiMaio",
    "date": "2025-11-17",
    "content": "There's a lot of stuff in there that may be formed from misconceptions, like specific level and loudness values, etc\nIn addition to that as a mastering engineer starting out maybe try and get it all done with an EQ, a limiter, and a clipper when needed. It'll help you way more than adding many character plugins and potentially getting into the dangerous territory of adding something just to add it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440067539752452308",
    "author": "Gabriel Tyranny",
    "date": "2025-11-17",
    "content": "I almost thought of it as seasonings over the mix that add subtle flavors throughout, but I also don’t really know a mastering engineers mindset",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440068527821291551",
    "author": "hyanrarvey",
    "date": "2025-11-17",
    "content": "I ma let some of the mastering engineers weigh in",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440069667510161651",
    "author": "Rollmottle",
    "date": "2025-11-17",
    "content": "@Gabriel Tyranny are you trying to be a mastering engineer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440097165056938116",
    "author": "Gabriel Tyranny",
    "date": "2025-11-17",
    "content": "I don’t know how to explain it but I mix with a mindset of not trying to cross into the masterers part by putting a lot of whole tracks and lushing it to far I fear I’m going overboard for a mastering engineer and it’d be best for me to not push it to places that compromise what a mastering engineer can do with their craft.\n\nEven if it’s irrational, does that make sense? I think it’s something that came up in my head while mixing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441823705264291840",
    "author": "vostral",
    "date": "2025-11-22",
    "content": "I wanna ask about a couple of technical issues of Big Hits. I wonder why the releases of such big artists would have such issues\n\n- Kali Uchis - Moonlight: It's very harsh in the top end and unbearable. Why was the mastering engineer unaware of that ?\n\n- Ava Max - Kings & Queens: Distortion at the beginning of the track, is it intentional for the loudness of the track, or is it accidental due to streaming platforms ? (i checked on both youtube & spotify)\n\nI'm not trying to bash anyone, i am just curious about them and dont want to make such problems happen",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1445527002051510453",
    "author": "Slow Hand",
    "date": "2025-12-02",
    "content": "Finally, don’t worry too much about mixing for your mastering engineer. The goal is for the mix to sound as good as possible before you send it off to mastering. It should be done when you send it off. \n\nIf they can squeeze a little extra improvement out of the record then that’s a win, but you should be mixing the record to a state where you’re happy to release it when it goes to mastering.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1465778937706582071",
    "author": "matthewrederburg",
    "date": "2026-01-27",
    "content": "Hey everyone, question for the brain trust.\n\nI'm mixing a record that's getting a vinyl release. The mastering engineer has requested, via the client, \"audio provided as.wav files, consolidated to side A and side B, with cue sheet labeling all the track markers.\"\n\nTo me, the consolidation + cue sheet creation seems like the responsibility of mastering. I'm guessing that there was a communication error and the ME isn't aware that the band wants to hire him for multiple services - mastering thru vinyl prep and lacquer cutting.\n\nWhat do we think?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469347353528893541",
    "author": "DarrenB",
    "date": "2026-02-06",
    "content": "This is a good point.  I definitely remember a time when GS lore was to 'let the mastering engineer finish it'.  I've recently seen it swing so far back the other way where some big producer/mixers slam mastering as a sham sold by fake wizards.  I admit in the past feeling like I should always be doing something, but then there was a great MWTM with Randy Merrill where he did small but extremely tasteful moves that elevated but didn't rebuild the songs.  Very ear opening at the time as there weren't many other videos like that and here's a top guy with no ego only doing what was needed and no more.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469356479650861116",
    "author": "masteredbyjack",
    "date": "2026-02-06",
    "content": "Ruairi is a north star for me because he can move silently as needed or slap an infundibulum on something too. Which is what I aim for as wel and think that's what the best mastering engineers can do. Follow the song",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469802412049960980",
    "author": "Rollmottle",
    "date": "2026-02-07",
    "content": "You could position it by saying you typically work with mastering engineers who you've built working relationships with, who know you, how you mix, what you prefer, etc and it will likely result in a better outcome than you working with somebody you don't know.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470162066655674569",
    "author": "hebakadry",
    "date": "2026-02-08",
    "content": "Also worth noting, it’s very very common in Europe, especially in the dance/electronic scene…some mastering engineers I really respect do it all the time like Rashad, Zino & Enyang with excellent results.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]