[
  {
    "id": "1117985467195994142",
    "author": "masteredbyjack",
    "date": "2023-06-12",
    "content": "This is great info. In a follow up to this, as a wonderful surprise, had my master picked in a shootout against an engineer who is leagues ahead of me.\n\nMy master was 1.6db quieter, and the artist actually liked the space it gave (it is still plenty plenty loud). Just was interesting that this artist had the understanding of really what they wanted, how it mattered to his art, etc.\n\nOther guys master sounded great too, just really hot and dense dense. which I feel 9 times out of 10 will win because explaining the trade offs and benefits of loudness (and having it understood) is very hard, but this felt like an artist really leading with their vision, not concern with the loudness stuff…how he articulated it to me confirmed that. Pretty cool, regardless of outcome",
    "reactions": 27,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068213326888321074",
    "author": "Rollmottle",
    "date": "2023-01-26",
    "content": "Every streaming service has a different number at which they will do normalization. If you are above that number and the user has normalization enabled, the service will turn the music down to match that number.\n\nThe immediate problems baked in:\n1. Every service works differently. One cannot confidently shoot at a target that doesn’t really exist. So, just master the material for the material.\n2. Not every user has normalization turned on. Thus, the material will be arbitrarily quiet next to other material that isn’t mastered to the target. So, just master the material for the material.\n3. Not everybody consumes through streaming. Outside of a platform, the material needs to stand on its own. So, just master the material for the material.\n4. Lots of modern music benefits sonically from being pushed into a limiter. Mastering below that short changes the material. So, just master the material for the material.",
    "reactions": 22,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1374918201317785722",
    "author": "sethmanchester",
    "date": "2025-05-21",
    "content": "@hebakadry  taught my dumb ass over many years of patience that loudness is built in the mix which really shook up my workflow 8-10 years ago... that being said, after many years of working together we've recently collaborated on a few projects where I intentionally didn't take it easy on the mix bus but still encouraged her to push it further and get as creative & collaborative with the master as she wanted to. It's resulted in some of my favorite sounding records I've ever been a part of. She respected the mix, but took chances and didn't just hand me back my mix. Out the door they were some of my favorite mixes I've ever done and Heba brought something else to them that I couldn't or wouldn't have thought to. I trust her taste & I asked for her imprint. I think there's a way to do both... you can 100% encourage a mastering engineer to push things further and forward without undercooking a mix... but it definitely requires an alignment of taste and trust.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1160336167720468480",
    "author": "Nomograph Mastering",
    "date": "2023-10-07",
    "content": "Yep, there’s no exact number but  REFs are generally genre appropriate. And I encourage it. If you want a -7 LUFS master then you need to build a -7 LUFS mix, otherwise things will change too much when the level is pushed",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385636390422708436",
    "author": "Nomograph Mastering",
    "date": "2025-06-20",
    "content": "I have many thoughts but I would probably lead with this. You are likely learning what’s “correct” on the internet, having been in the game for a minute I can tell you that 90% of what you are reading is wrong, or incomplete or misses the point\n\nYour clients however will be your greatest teachers. I learn more every year than the last, and I’m 31 years into record life and 23’in mastering\n\nClients understand music intuitively, they are reaching for something bigger than LUFS, and tonal balance curves. Keep an open ear, write short emails and you’ll keep learning",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068213023984074802",
    "author": "Nomograph Mastering",
    "date": "2023-01-26",
    "content": "It has become fashionable to post online about targeting -14LUFS or so, but in my opinion, if you care about sounding approximately as loud as other artists, and until loudness normalization improves and becomes universally implemented, that is mostly well-meaning internet chatter, not good practical advice. My advice is to make one digital master that sounds good, is not overly crushed for loudness, and use it for everything. Let the various streaming sites normalize it as they wish. It will still sound just as good. Normalization does no harm to the audio - it's merely a playback volume setting.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085342087932817419",
    "author": "Edsel Holden",
    "date": "2023-03-14",
    "content": "Story time - I was asked to master a song that is above my paygrade, I was  super stoked to land the gig. I got the limited ref and the unlimited mix, and went to town doing “my thing” as usual. After some time I went for the A/B - and the ref was BLOWING my shit out of the water. To provide a little context, I have been mastering seriously for 6 years, and in the least ego driven way possible, usually always “my thing” beats whatever limited ref I am up against. I have not been in many scenarios where I can’t beat the ref. With this song that was not the case at all. On the advice shared here previously, I got in touch with the mixer and asked what was going on with his loudness chain. \n\nDudes, it was so much. Two BOZ clippers, a gullfoss, stacked limiters - the works. However - the limited ref was dripping in vibe. The mixer bullseye’d this song. It was totally ON POINT and my chain was getting nowhere close. I considered going the route of screenshots and recreate the mixers madness step by step - but TBH - I did not want to drag the project through all that especially with me being brought on as a new ME to an already established team that is above my paygrade, and my ears and heart knew that the limited ref was right on the money anyway.\n\nI needed a vote of confidence , so I asked a close friend (cough @Nomograph Mastering ) who is ahead of me in this game if it was acceptable for me to work from the limited ref. (showing my greenness here). A great word of advice came through - “The only rule is what gives the best final outcome.” - I made the call to work from the ref. The final chain was so simple - standard clip, equilibrium, limitless. 3 moves. Nothing going crazy. Got an over the top enthusiastic approval this morning, and am so freakin stoked about the whole thing, will probably get the whole project.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068205653367206038",
    "author": "Rollmottle",
    "date": "2023-01-26",
    "content": "I wish I could launch this \"-14 LUFS\" thing into the fucking sun. I am working on a project for my friend, who is putting out a band’s EP. He asked me to master the two remixes he and another friend did. The other tracks were mastered by somebody else. This is a cosmic disco, dance project. It’s got grooves and kicks. I pull the tracks into the session and all the tracks are mastered to -1TP and -14LUFS. Completely inappropriate for the material and feel.  The remix MIXES are louder than the masters. The person who mastered the other tracks is entrenched in “they will just get turned down anyways so doesn’t make sense to make them louder” camp. I explained to my friend why that is completely wrong, but ultimately can’t be my battle to fight.  I erred way on the conservative side for the remixes and bristle at the idea that we’re short changing the material because somebody who doesn’t know any better read something somewhere on the internet.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382459383241375744",
    "author": "Nomograph Mastering",
    "date": "2025-06-11",
    "content": "But know one thing, perceived loudness is almost all determined by the arrangement\n\nMixing can enhance it some\nMastering can enhance it less\n\nWhat we typically want is maximum perceived loudness and minimum measured loudness relative to that",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405225515689967808",
    "author": "Elaine Rasnake",
    "date": "2025-08-13",
    "content": "Finally we can talk about LUFS again",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042543183445364848",
    "author": "Nomograph Mastering",
    "date": "2022-11-16",
    "content": "Not everyone has level norm on. Spotify in smart TV does not have level norm. Spotify on web browser does not have loudness norm. Spotify and other DSPs can and will change the targets so you CANNOT depend on them. So what to do, you move with the herd. Listen to the Hot 100 with level norm turn off and tell me where it is. That’s where you want to be, or the equivalent for your genre",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132356775077744830",
    "author": "Nomograph Mastering",
    "date": "2023-07-22",
    "content": "There’s a trap where you are stuck  on the beach with your dither and LUFS floaty while critiquing artists who wipe out taking on a big wave",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360648572923678992",
    "author": "Paris Lee",
    "date": "2025-04-12",
    "content": "I’m not really qualified to speak from any technical standpoint of anything discussed here, especially among the giants and don’t want to look stupid …but as someone who DJ’d House, Techno, Drum and Bass etc back in the late 90’s as a teenager in LA on Vinyl (I’m 45 now), watched the transfer to CD’js…(no idol of mine has touched a vinyl in 20 years) and masters for modern EDM artists, I feel like I can speak with some authority about, I dunno, *something*…Back in those days, I guess Ill just say there were a lot of factors that influenced what sounded so good about that era, and what producers did then. The dynamics, combined with the *type of low frequency* content of those genres at that time, along with DJ’s who knew what the fuck they were doing, along with sound crews who worked the rave circuit and were continually hired and worked with the same DJ’s, all contributed so much to this magic rave Vinyl era.\nThere’s nothing that touched those deep kickass lows back then, But That was the style! \nSo much has changed. Producers back then got their loudness from pushing analog desks into the red, Simple Mackie desks, stuff like that. But We moved to an all digital world. I remember when the first pioneer digital DJ mixers came out, I’d put a vinyl on and just be like…this is shit! where’s my headroom?!?! the frequency distribution of the music has also changed, DJ’s also got more concerned with jumping up and down and clapping rather than mixing and gain staging. Clubs started putting limiters on the systems \nMost of these kids doing EDM at high levels-really don’t even need ME’s at all! Their mix busses are so super complex. If they took that stuff off, I’d be totally lost. But they like a little analog processing in a lot of cases. Loudness, they *don’t need*\nClipping, limiting, whatever, it’s the modern thing- If i can help I can- and I tell them not to change a thing- just back off the limiter until the exact moment where the track loses the vibe. Then I go.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068212926667837631",
    "author": "Nomograph Mastering",
    "date": "2023-01-26",
    "content": "Below I am sharing something that I send to my mastering clients when they inquire about targeting LUFS levels for streaming services. I hope it is helpful to some readers. Discussion is welcome.\n\n\nRegarding mastering to streaming LUFS loudness normalization targets, i.e. -14 LUFS - I do not recommend trying to do that. I know it's discussed all over the web, but in reality very few people actually do it. To test this, try turning loudness matching off in Spotify settings, then check out the tracks listed under \"New Releases\" and see if you can find material that's not mastered to modern loudness for it's genre. You will probably find little to none. Here's why people aren't doing it:\n\n1 - In the real world, loudness normalization is not always engaged. For example, Spotify Web Player and Spotify apps integrated into third-party devices (such as speakers and TVs) do not have loudness normalization. YouTube is normalized but \"YouTube Music\" is not normalized. Apple Music's web player is not normalized. With normalization off, your -14 LUFS track will sound much softer than most other tracks.\n\n2- Even with loudness normalization turned on, many people have reported that their -14 LUFS masters sound quieter than other tracks in playlists.\n\n3 - Some streaming services have different loudness targets (Apple's is -16) and there's no guarantee they won't change their loudness targets again in the future. For example, Spotify lowered their loudness target by 3dB in 2017, then in 2021 they switched measurement from ReplayGain to LUFS. Also, in Spotify Premium app settings you find 3 different loudness settings; \"Quiet, Normal, and Loud\". Now AES is recommending that all music streaming services switch to -16 LUFS. It's a moving target. \n\n4 - Some people suggest making multiple masters at different levels. But digital aggregators (CD Baby, etc.) generally do not allow more than one version of each song, so you'd have to make separate paid submissions.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079949034053181620",
    "author": "masteredbyjack",
    "date": "2023-02-27",
    "content": "Just for reference, the convo was to restrict my approach to one band of EQ, Q of no sharper than .7 and maybe a low shelf. That's it. And a limiter.\n\nSince then I've done at least over 100 songs, many of which are out in the world and/or on their way to release. So a decent time to circle back with some insight. However, compared to more experienced ears on here I am still a baby.\n\nExtremely powerful challenge from Ruairi, and it really made me think in broad terms about what EQ is doing, what my goals are when using it, and how each part relates to another. And what you gain or lose when making a move. I would highly recommend it, and found it very very hard. It's non-trivial to make things sound better when you actually hear what's happening.\n\n I've also been pretty lucky to work on quite a bit of music that I would have considered outside of my experience range, and I think this gentler approach worked well there because the mixes were already pretty damn good. So there's that too!\n\nOf course for work where I'm being paid I'm not only restricting to one band, I do whatever is needed but even so many times I would prefer that. It felt like \"learning scales\" but for mastering in a way. And loudness really is down mostly to EQ, as far as I can tell!",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244699509339062353",
    "author": "Nomograph Mastering",
    "date": "2024-05-27",
    "content": "So I guess in summary, as ever we can say that there is no “one weird trick” to make mixes and masters loud. Most of it is defined by arrangement. We absolutely want to control energy down low but going in with a chainsaw probably won’t help our case much. To get to the place where we are meaningfully impacting LUFS measurements (making them lower) we’d have to cut either too much lows or at too high a frequency",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033108762141130872",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "And I think if I have a pocket in this mastering game it’s that I want to be known as someone who will not  thrown feel, or musicality under the bus just to make a master sit at the center of some loudness or tonal bell curve",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038251674894090240",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "OK peeps, really have to go. I'm making parts from -6 LUFS (integrated) masters that Mark Needham mixed",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068214429344333945",
    "author": "David Fuller",
    "date": "2023-01-26",
    "content": "Beyond everything else, it is very ingrained in music consumers that music with a small crest factor (difference between peak and average level) is what music is supposed to sound like. Mastering for -14 LUFS Int and -1dBTP gives a much larger crest factor, which sounds \"unfinished\" to a lot of consumers.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308158263715430464",
    "author": "Rollmottle",
    "date": "2024-11-18",
    "content": "when charging by the LUFS makes more sense",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434354986149613569",
    "author": "Nomograph Mastering",
    "date": "2025-11-01",
    "content": "Think of this as training wheels for loudness, it gets more complicated fast, but for hitting -10, or maybe -9 on modern music this will get you started",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1437148175818297475",
    "author": "masteredbyjack",
    "date": "2025-11-09",
    "content": "It’s not about the number (and I often say this to people too) — it is about making the decisions through the lens of a loudness/density that is in the ballpark of where it will end up.\n\nThis way you can make accurate judgements on where you want things to sit",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032075403294150747",
    "author": "cian riordan",
    "date": "2022-10-18",
    "content": "I hear the original mono pressings of Pet Sounds were -2.7 LUFS, thats why they sound better and are more valuable.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043032687444774952",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "LUFS is far from a perfect measure, but it’s useful. But if for example we matched songs on an album by LUFS when mastering it would be a shit show",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054819324612853782",
    "author": "Nomograph Mastering",
    "date": "2022-12-20",
    "content": "Is it like the IRA but a terrorist organization based on loudness?",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068214087340802079",
    "author": "dcmabon",
    "date": "2023-01-26",
    "content": "As a consumer, i don’t use any normalization so it becomes very obvious when someone does the -14 LUFS thing, and even with the argument to “just turn it up”, that’s all fine and dandy until you FORGET to turn it back down by the time the next song comes on at -6 LUFS 💥😱",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218104551526240266",
    "author": "wald",
    "date": "2024-03-15",
    "content": "Happy to report DMG in this case was absolutely the ticket. Got peak down to about 0.7 without loudness sacrifice. Pro L and clipping into limiter seems to ‘diffuse’ the sound somewhat. With a bit of a level penalty.  Limitless kept the music in tact, if anything it feels better than before. Client immediate comment was it feels finished now. Thanks so much gang. Know I won’t work like this in all cases, but @Nomograph Mastering diagnosed this problem like a ninja",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290414038827667532",
    "author": "Nomograph Mastering",
    "date": "2024-09-30",
    "content": "There were other factors at play but I wish everyone could hear the mix off we listened to last week. The -6 LUFS mix beat the dynamic -9.5",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1296882749390721134",
    "author": "masteredbyjack",
    "date": "2024-10-18",
    "content": "Hold up -- you said it was -12 LUFS? The target is -14 don't you know?",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434252573933568202",
    "author": "Slow Hand",
    "date": "2025-11-01",
    "content": "When it comes to loudness, a big unlock happened for me when I realized that a lot of perceived loudness comes from the frequency balance of instruments or groups. There's a sort of \"center of gravity\" for the frequency of instruments. Individual instruments did not need as much low end as I once thought. I realized that I could push more energy up into the mids and upper-mids. Instruments could be leaner and biting. Much more than I thought tolerable. This has a few positive effects:\n\n1. The sounds will cut more and be articulate in the mix (if desired).\n\n2. Low-end buildup is the first thing that's going to hit your limiter. Shifting the energy up the frequency spectrum buys you more space before your limiter kicks in. Thus your overall mix can be louder.\n\n3. Your low-end instruments will no longer compete to feel powerful. Therefore they do not need to be as loud in an absolute/voltage sense. Meanwhile, your midrange-y instruments that were once lean and bite-y in isolation are supplemented by your low-end instruments and feel whole again.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042783992623140905",
    "author": "ALXCPH",
    "date": "2022-11-17",
    "content": "Hahaha no I think this is them charging to turn up your track if you are at less than 14 lufs 🤣",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099042737350770718",
    "author": "stefanmacc",
    "date": "2023-04-21",
    "content": "Live laugh lufs 💯💯👊🏻👊🏻😂",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242268664615669770",
    "author": "Slow Hand",
    "date": "2024-05-20",
    "content": "As an example, Anthony just mastered an album for me and made it loud as hell. It sounds fantastic! One record was a little too hot, so we backed it off until it felt right. It's still nowhere *near* -14 LUFS (or whatever target Dave's example may be advocating for), but it's just right and we didn't lose anything in the process.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243713756236611665",
    "author": "cian riordan",
    "date": "2024-05-24",
    "content": "What does everyone do when Spotify/Apple/Whatever changes their loudness algorithm?",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244697635441348748",
    "author": "Nomograph Mastering",
    "date": "2024-05-27",
    "content": "@Rollmottle already gave a great answer here. I want to re-state and co-sign what he posted \n\n1. Don't try and remove what you can't hear. Never going to end well. There is no general rule sub 30hz so don't try and preemptively deal with something if you're not even sure it's an issue\n2. If you do need to deal with a low end issue, deal with it at the source, instead of the 2-mix if you can\n3. If you're dealing with it at the 2-mix level, gentle shelves will do less harm than steep cuts\n\nOk. Now to a thornier aspect of your question - does throwing away super low end information help us with loudness?\n\nAs I’ve said many times here our typical goal is not just maximum loudness. The goal is really high perceived loudness, and low measured loudness (to avoid being turned down too much by normalization), all while remaining musical and true to the intent of the song\n\nPerceived loudness is primarily driven by arrangement (less elements better), distortion (more distortion makes things feel louder but at obvious cost) and frequency content (special attention needs to be paid to the 1500 to 6000 region I mentioned the other day). Super low end content doesn’t have too much of a direct effect on how we perceive loudness but of course it does have second order effects - huge lows will cause limiters to overwork and we’ll get into trouble with things sounding smashed sooner than we’d like\n\nOk, but what of measured loudness? Here it pays to have an understanding of how LUFS are actually calculated. I don’t know if there’s a neat summary video somewhere Dan Worrall style, if so please link it in folks. The definitive doc on LUFS measurement is here \n\nhttps://www.itu.int/dms_pubrec/itu-r/rec/bs/R-REC-BS.1770-5-202311-I!!PDF-E.pdf",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": true
  },
  {
    "id": "1290432790172663902",
    "author": "cian riordan",
    "date": "2024-09-30",
    "content": "If there are multi-tracked drums, I'll usually do my whole process of leveling, phase checking, quick EQ voicing on those first. Then go to the loudest part of the song and quickly audition maximizer vs. vintage lim vs. Pro-L2 to get things to hit ~-9 LUFS on my Clarity M loudness radar (really great visualization for quickly doing this). Then I just get to work on the mix. Things often end up getting louder throughout the process and I'm OK with that. I'm often going back and checking to make sure things aren't overcooked. I should change my language from 'set it and forget it' to 'set it, forget it, but go back and check every now end then'.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352814939617890388",
    "author": "Slow Hand",
    "date": "2025-03-21",
    "content": "Distributors getting paid by the LUFS. Gotta hit those quotas in the loudness mines or else the President of Music is gonna be pissed.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370069205252309052",
    "author": "Rollmottle",
    "date": "2025-05-08",
    "content": "I am dubious at the conclusion that loudness prevented songs from being playlisted. Unless that’s based on direct input from playlist editors, I remain skeptical. It’s possible it’s a specific genre thing? Idk.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382455008393564301",
    "author": "Zack Hames",
    "date": "2025-06-11",
    "content": "Do some searching on here for this; lots of good stuff already. \n\nShort answer: loudness penalty doesn’t matter. It’s a bad wording that gives people the wrong impression. \n\n-Not all devices normalize. \n-master for the future not for right now. Who knows what standards  will be in the future\n-no highest charting albums are mastered at -14LUFS or follow any of those guidelines \n-there are no rules.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382465497294966925",
    "author": "Edsel Holden",
    "date": "2025-06-11",
    "content": "I will share words that are not mine (these words belong to @Nomograph Mastering )\n\nContext is important here. This is an email that Nomogrpah wrote back to a client that said \"Hey I love the master so much but I am a bit worried about how much it might get turned down ?\" or something to that effect \n\nResponse was \n\n\"Glad you are feeling the master!\n\nRe the level thing that is a complicated question. A few thoughts\n\nNot everyone has loudness normalization turned on. It also doesn’t exist on Smart TVs, many streaming web interfaces etc\n\nThe different services all have different level norm targets (and even different settings within just Spotify) - and they change pretty regularly\n\nIn terms of absolute level when normalization is active what matters is arrangement (dense mixes sound quieter than sparse/spacious mixes), EQ (bright/mid range forward mixes sound louder than dark) and distortion levels (clipped/distorted mixes feel perceptually louder than clean). If I make a master a dB louder in mastering using just limiting for example, they just turn it down a dB more when it’s level normed.\n\nSo what does all of this mean? It means that every song has sweet spot where the EQ/tone, the arrangement and the overall clipping/limiting level works best and communicates the intent. That’s what we aim for.\n\nYou can use a site like loudnesspenalty.com to see what will happen but it will just drive you crazy and the only real way to meaningfully alter the result is to change the arrangement/mix or overall EQ a lot. On release day you can find 1000 records that are louder than yours if you want to.\n\nIf being the loudest is the intent - game everything listed above and you can “win”. If doing your unique thing and communicating a song and a performance is the goal then I think you are there!\"\n\n(posted with Nomographs permission)",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396915457747062914",
    "author": "kylem",
    "date": "2025-07-21",
    "content": "I'll take option 4C with extra brightness please. Hold the loudness, and can I get a side of -14 with that (for spotify)",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043033379236499486",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "A DJ remix of a very big song that’s out right now. The mix was at -2.6 LUFS",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152992602736570449",
    "author": "Chris Doms",
    "date": "2023-09-17",
    "content": "For an album I mixed, the mastering engineer asked me to send everything over at -18dbTP, I was mixing into a limiter so my mixes were “loud” but the band loved where were the mixes were at, I hear the masters on streaming when it comes out and they’re at -18 LUFS.. felt like they asked me to turn things down and then just didn’t rebuild the loudness?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1226058113170407435",
    "author": "Nomograph Mastering",
    "date": "2024-04-05",
    "content": "But the new Loudness Penalty Studio app is excellent, purchased immediately",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232850474743627796",
    "author": "Berlin",
    "date": "2024-04-24",
    "content": "oh man.. i had a client once, sent me a playlist of songs, wanted me to measure each song in the playlist, and then compare those LUFs to my LUFs",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244703350973403188",
    "author": "Nomograph Mastering",
    "date": "2024-05-27",
    "content": "Our hearing is very sensitive to what happens in the 1.5 k to 6k region, shaping that effectively is likely to give the biggest reward for effort in the loudness game",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245094365135765555",
    "author": "Nomograph Mastering",
    "date": "2024-05-28",
    "content": "And of course getting perceived loudness is easy if you just blaze distortion and 4k all day,  but we need to make music that feels good and tells a story too",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361398980839346336",
    "author": "cian riordan",
    "date": "2025-04-14",
    "content": "Limiting is not just a tool to achieve loudness in modern mixing, it can be a bit part of the aesthetic of the mix.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382465528760766554",
    "author": "Edsel Holden",
    "date": "2025-06-11",
    "content": "I have referenced this many times since it was shared because it does a great job cutting through all the technicalities and putting the focus on the music and output. I realize this info maybe more helpful for mastering engineers fielding questions about loudness, but I was hoping @lystell  could find some good info in this !",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1437344981349306449",
    "author": "Max Error",
    "date": "2025-11-09",
    "content": "Oh I misinterpreted the intial statement by Ruari. I thought he was saying the pads and fx were themselves at -14 lufs but he was saying to make mix decisions with the dynamics closer to how you would have it sound at mastering stage I take it?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031970826041426092",
    "author": "VESHZA",
    "date": "2022-10-18",
    "content": "i just find this area of loudness i guess the most balanced and can hold a THICC amount of low end energy",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038240711352533032",
    "author": "Zach Hughes",
    "date": "2022-11-04",
    "content": "So this is straight from Spotify's website and obviously nobody really abides by it but I just want to know if theres a 'why':    *Target the loudness level of your master at -14dB integrated LUFS and keep it below -1dB TP (True Peak) max. This is best for lossy formats (Ogg/Vorbis and AAC) and makes sure no extra distortion’s introduced in the transcoding process.\nIf your master’s louder than -14dB integrated LUFS, make sure it stays below -2dB TP (True Peak) to avoid extra distortion. This is because louder tracks are more susceptible to extra distortion in the transcoding process.*",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038508225236062288",
    "author": "Nomograph Mastering",
    "date": "2022-11-05",
    "content": "Something I’d like to talk about long form sometime is WHY certain records feel loud. Mastering unlocks loudness potential but how loud something can be while sounding good is a die that is cast in the arrangement, production and mixing",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042555881688154132",
    "author": "Rollmottle",
    "date": "2022-11-16",
    "content": "98% the client wants loud even when they say they want it dynamic or don't care about loudness as much. they do. lol.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068208787829293056",
    "author": "oaklandmatt",
    "date": "2023-01-26",
    "content": "Can you indulge me (and anyone else reading) with an explanation of why mastering to such a quiet LUFS \"because they're gonna turn it down anyway\" is wrong?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082361430000549888",
    "author": "kidcutler",
    "date": "2023-03-06",
    "content": "Not spectrum but i will say as a mixer this was extremely useful. I pulled in some mixes i had just finished for an album and that approach showed me where i was fucking up in the mix and the next song i mixed i got there within the mix, understanding better the relationship eq plays to balance and loudness. Extremely helpful, thanks @Nomograph Mastering and all the ME’s on here helping us get better results",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197570163130765383",
    "author": "masteredbyjack",
    "date": "2024-01-18",
    "content": "From my understanding (and please correct me if I'm wrong), what I've seen and tried De-Clip on is audio that is already clipped and distorted. In this case, speeding up the master before dither just introduced actual sample peaks in a 32bit file, which can represent them. So there wasn't any \"clipping\" going on, it was just a matter of...how do we get the file to a similar loudness at 24bit to deliver without it sounding awful? I suppose you could try the de-clip after limiting (which was introducing distortion).\n\nBut...a legendary human who doesn't want to be known as the speed up guy  helped me out with some sorcery, so it's solved (and honestly I know sorta what was happending but have no clue how he actually did it)\n\nAND the artist is super pumped, loves the new version so it's a win",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211487549332398080",
    "author": "Nomograph Mastering",
    "date": "2024-02-25",
    "content": "If it complains about LUFS like a duck I guess it is a duck!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225928465111449671",
    "author": "Berlin",
    "date": "2024-04-05",
    "content": "Only way I know how to combat all this is real, boots on the ground, type of warfare and that is to turn off true motion and normalization if I can, at anyone's house that I'm at for any occasion.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232850252147724341",
    "author": "Edsel Holden",
    "date": "2024-04-24",
    "content": "i used to literally write the LUFSi down of each integrated and make sure I was \"close\"\n\nDOES ANYONE WHO MADE THE THING FUCKING CARE?! NO !!!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242266724733288448",
    "author": "Bryan DiMaio",
    "date": "2024-05-20",
    "content": "“Remember to buy my online course about mastering everything to -14 LUFS!”",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242307511953129544",
    "author": "NoahNeedleman",
    "date": "2024-05-20",
    "content": "I had the same experience last week with Anthony. Sent him something subtle and dynamic and got something back loud af and emotionally charged. He unlocked it with loudness.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243714638776893450",
    "author": "Rollmottle",
    "date": "2024-05-24",
    "content": "One day, everybody will be on full native master resolution, non-normalized playback. Trying to out-smart the normalization algorithms is an unwinnable and short term game.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256040244999094272",
    "author": "Nomograph Mastering",
    "date": "2024-06-27",
    "content": "Luckily perceived loudness comes easily on these kinds of tracks, as long as you have the discipline to ignore the LUFS meter",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293433942153629818",
    "author": "Berlin",
    "date": "2024-10-08",
    "content": "i got hip to it when one of my artists was like what happened to my song? it’s quieter than everything else on spotify? and i was like wutttt and went and checked it and sure i enough it was quiet as fuck with normalization turned off… really had me scratching my head and so I had to do some digging to figure out what happened.. and then the next following couple months every other release that i had master from the previous couple months was quiet because they checked that damn check box.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1303007200540622870",
    "author": "Conah Tucker",
    "date": "2024-11-04",
    "content": "Howdy folks! Started running some tests for the tiktok normalisation but I've found an engineer that's already run some tests and discovered a fair bit.\n\nQuick notes:\nWeb tiktok and mobile tiktok process audio differently: \n- Web tiktok has a -1db ceiling. \n- Mobile tiktok compress the audio. This engineer reckons its a soft knee comp at -12, 50.1 ratio, fast attack.\n\nI'm still running some loudness tests. Heavy compression at -12 seems a little too murderous to me.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313607906909749359",
    "author": "Berlin",
    "date": "2024-12-03",
    "content": "No official stats, but most of my experience with LANDR and similar services have been the same as mentioned here. Artist, producer, mixer comes to me saying they tried one of those services and while it was able to get it loud, it lost a lot of low end, or punch or really changed the mix, so now they would like to have me take a swing. \n\nA few times I've asked for the AI master just for shits to hear what was going on and the AI master is just that.. It would be nailing a target level, but at the sacrifice of the quality of their mix. \n\nI know AI mastering will likely get better, but it still seems it cant help with things like quality control and actual perceived loudness. LUFs only tells one part of any songs' story. @Dereck Blackburn @masteredbyjack @Ted Whitten Media @Rob Domos @jordanmcleod_io",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1360334518027948266",
    "author": "Rollmottle",
    "date": "2025-04-11",
    "content": "Been reflecting on the discussion here...\n\nI just don’t subscribe to the idea that loud = bad. There’s a whole school of the online mastering discourse that holds this belief and it strikes me as disconnected from the mainstream. It presupposes that loudness comes at significant cost to the material in some way — which way? Emotional? technical? artistic?  Or that all material should be dynamic…which is, of course, not true. \n\nAs Noah was getting at, some of my most vivid memories of live music both as a performer and as an audience member exist BECAUSE they were loud as fuck. Loud is in our DNA. There’s a visceral, tactile and emotional response to loud. Even if we’re talking about a “quiet” or more dynamic record, people will turn it up so they can feel it.\n\nGood loud is within everybody’s grasp in 2025 and I love being able to make loud records louder, with minimal, if any, trade off. If I can deliver an appropriately loud master given the material with little compromise, I will. That’s exciting to me and not a bummer. It's what the vast majority of my clients are looking for. Of course if the record doesn’t call for loud, we don’t make it loud. But, I also don’t think excessive loudness is what’s making or breaking records.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368310808282533899",
    "author": "Rollmottle",
    "date": "2025-05-03",
    "content": "I’ve found it easier to separate the tonal decisions from loudness decisions. I take the limiter out of the equation when I am making tonal decisions. So in my case, it's a simple bypass of with processing vs. without to make the decisions against the mix. This is inherently level matched. This gets trickier with dynamics processing but that’s a simple offset of the processed mix. That’s all happening on the object in my DAW without need for additional plugins or routing. Since I am rarely compressing anyways, this is a low friction way of judging the moves against the mix. \n\nWhen I’m happy with that, I’ll print the pre-lim and then load it up on another track to do the limiting. When I’m happy with the limiting, I have a quick action to create an A/B track where I can load the hot mix or mix to see if I’m as loud or louder than it. \n\nNone of this is by number or meter. It’s all by ear.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368326322106925197",
    "author": "Øra Mastering",
    "date": "2025-05-03",
    "content": "I always end up chasing my tail when separating tonal and loudness. If I get the right tonal balance first, then everything shifts around when adding loudness/limiting. To me all limiters and limiter styles within have different tones, at least if I’m limiting more then a couple of dB. For that reason I always start with finding the right limiter/style that keeps or changes the tonal balance the way I want (too bright mix = dark limiter, dull mix = bright limiter, great mix = limiter that keeps the balance when pushed ect.). Once I have the loudness and given the tonal balance a gentle push in the right direction with the limiter, I get the track over the finish line with eq or other tools in front of the limiter. \n\nThis is not meant as criticism of your approach, I just haven’t cracked that code.\nHats of to you for making that work!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368338410829385879",
    "author": "Nomograph Mastering",
    "date": "2025-05-03",
    "content": "I sometimes think about the song as a life of it’s own, a force or a message trying to make it’s way through the minefield of Spotify, loudness wars; band fights, A&Rs with bad ideas, algorithms etc",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1380967852118380688",
    "author": "David Fuller",
    "date": "2025-06-07",
    "content": "It always feels good when I beat a reference track's loudness all with better perceived dynamics",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385421710756417587",
    "author": "Nomograph Mastering",
    "date": "2025-06-19",
    "content": "Correct LUFS\nTonal balance “modern” perfect fit\nNo noise \nProfit",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1437144182035841055",
    "author": "Jonathan Jetter",
    "date": "2025-11-09",
    "content": "I think most songs have a loudness that they can easily get to. Then there's a slightly louder loudness where a skilled operator can get them to. And then there's a louder loudness where things fall apart.\n\n(Those three specific loudnesses will be different for each song…)",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983263282653724692",
    "author": "rse",
    "date": "2022-06-05",
    "content": "also keep in mind that loudness normalization is not as common as it seems. Spotify's loudness normalization doesn't work on most external devices, stuff like tv's, Sonos speakers etc. Like it has been said before, do what's right for the song.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032075057423450175",
    "author": "Nomograph Mastering",
    "date": "2022-10-18",
    "content": "Integrated LUFS of -2.7",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043030983370342460",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "Above about -12 LUFS for typical modern music we are starting to make compromises to get level. Clipping, limiting, adding distortion",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043031499773071381",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "The closer you get to say -3 LUFS integrated (about the loudest I’ve ever done or seen practically) the increase in compromises feels almost exponential. So to go from -12 to -10 LUFS things get a little worse, but when you level match your have to listen for the difference. Above that the cost of every dB of level goes up.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078778452527828994",
    "author": "Nomograph Mastering",
    "date": "2023-02-24",
    "content": "The question - what limiter is best for loudness? The answer - good EQ",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079872933935190137",
    "author": "Rollmottle",
    "date": "2023-02-27",
    "content": "Probably worth heading over to #👩🍳mixing-talk and asking about loudness in mixing.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085653163295637674",
    "author": "Gerhard Westphalen",
    "date": "2023-03-15",
    "content": "Had a similar experience today receiving a mix which was essentially already “mastered.” It was sitting at -4 LUFS integrated. Artist offered to send less processed but I knew I’d never be able to get the same feel (intentional crunching and moving). A touch of EQ and artist was happy with the results. Probably one of the toughest projects I’ve done. Nerve racking to know they spent so much time dialling it in, not having much room to work, and that they were looking to get whatever improvements there were to be had",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089985268347584574",
    "author": "popaganda.",
    "date": "2023-03-27",
    "content": "I watched Ruairi master a couple tracks last night, and one of my takeaways is that there’s a place where a song just feels like itself. It meets you between the speakers and says “hey, I’m a record.” You don’t recoil, and you don’t have to lean in too far to “find it.” The place where a song gives you that feeling does not always coincide with a standard loudness target or frequency curve. You can approach it from a technical mindset and try to hit those targets, but sometimes doing that gets you further from the spirit of what the song is asking to be, if that makes sense.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217037333828735007",
    "author": "masteredbyjack",
    "date": "2024-03-12",
    "content": "LOUDER (in the past couple weeks I've delivered anywhere from -12 or so to -4.4 LUFs integrated)\n\nAnd you know what...the loud loud sounded great for the music! And the extra energy the density adds definitely does a thing.\n\nI know you're a vet, but a post-print RX touch up on the esses usually does wonders for me when things are getting really slammed\n\nAlso in the broader sense, I think every single time I've gotten a note on a master it's been a great opening for learning and making the record better, I love it",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217668388701343784",
    "author": "Nomograph Mastering",
    "date": "2024-03-13",
    "content": "And if you say the words loudness penalty you get a financial penalty",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222188580516925502",
    "author": "Rollmottle",
    "date": "2024-03-26",
    "content": "This workflow is the same whether I stay digital or go analog: I roughly adjust all the levels of the songs against a calibrated VU meter so louds are loud and the quiets make sense relative to the louds. Then an instance of Equilibrium gets added to every song as the first move. Other than that it all depends on the song. Loudness gets handled separately in another step.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223359192249925672",
    "author": "Berlin",
    "date": "2024-03-29",
    "content": "Just had to pick up the phone and have another call about loudness penalty dot com with one of my artists.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240454128602448002",
    "author": "masteredbyjack",
    "date": "2024-05-15",
    "content": "@Felix Byrne just read the manual, it seems to do what you describe — try to bring up lower level info that will not get hit for LUFS, thus giving a louder apparent level. \n\nTo be honest I sometimes do something similar — I will automate up the volume of an intro, verse, etc (not use upward compression like this does). Of course only if musically indicated, but with translation in mind. Sometimes I’ve gotten away with a half db or whatever without even touching the LUFS value.\n\nNow — does this actually help the feel of the music? We shall see!\n\nBut it’s also our job to care about how things translate, feel first always, but making masters that are competitive in the marketplace is part of the gig too, so this could well help just to study",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242268035956478095",
    "author": "Slow Hand",
    "date": "2024-05-20",
    "content": "Eh, who are these people and what does it matter to any of us what they think? Do they have any bearing on what the rest of us do? It sounds like Dave may be in a bubble of mastering engineer discourse where these advocates for massive dynamic range have an outsized voice. Clearly most of the world has moved on and don't heed the opinions of these people advocating for massive dynamic range.\n\nCompetitive loudness is a skill that we all have to learn, but people regularly push it too far and the best mixes will still crumple if they're pushed beyond their limit. Some records would have been better if people exercised restraint with how hard they push loudness. You can overcook loudness and you can undercook it as well.\n\nAs with so many things, the optimal solution is context dependent and somewhere in the middle. Neither too loud nor too quiet. You simply use your ears and do what's best for the record.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242276719826567168",
    "author": "Rollmottle",
    "date": "2024-05-20",
    "content": "it's always interesting to me to see how stuck the \"mainstream\" mastering discourse is in stuff that absolutely doesn't matter. the original question that Dave is responding to here is \"There's a subset Art to \"Mastering\" Music Loud while still being as musical as possible with the least amount of ear fatigue as one can only expect? Generally I'm referring to masters above -8 lufs.\" -- which is a REALLY bad question and assumes that loud and good isn't part of the job description in the first place or that loud masters are more bad (or something). \n\ni don't dare try to speak for Dave Collins, but from what I've seen of him parachuting into this group every now and then to needle the masses, he seems mostly bemused by the things with which this group continually spins on.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308448394779561985",
    "author": "Conah Tucker",
    "date": "2024-11-19",
    "content": "Hey folks! Following on from this, had a bit of time today to do some more testing, I've done a pink noise test today. 1 track 3 different loudnesses 5db apart. Uploaded the different loudnesses separately too.\n\nFinds: (please note this is off of web TikTok, app TikTok tests will come soon)\n• -4.6db overall (planning on testing this more in depth, but occurred 4 times on the 4 different audios I uploaded)\n• Int LUFS -7.4 down to -13.3 (for this specific case).\n• 5db differences remain.\n• Brickwall eq at 16khz (this was tested on many different videos).\n• The different levels uploaded separately did not change their respective loudnesses compared to the full noise track. So dynamic sections of track shouldn't boost if uploaded as a separate sound to TikTok.\n• No compression.\n• General audio quality does drop.\n\nThings that come to mind:\n•  Common 3rd party video editing apps (such as capcut) and how they affect audio\n• The level control TikTok users have and how that affects audio (in terms of peak/loudness and referring back to the -4.6db peak mentioned earlier)\n\n\nI'll run some more tests when I get the time to.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1331343753725743104",
    "author": "masteredbyjack",
    "date": "2025-01-21",
    "content": "This is honestly something to be aware of -- a lot of people never play digital master files at full volume off their phone -- they are comparing to something like Spotify or Apple which turns stuff down on normalization (and thus has peaks that are not near zero). Seems natural to me to blast a master you get back to enjoy it -- so it can be easy to just explain that, people get it once you do\n\nCan also be an issue in cars, etc anything where the added level will drive stuff harder than what they are used to listening at\n\nThe impetus to be concerned is absolutely something I empathize with on their end (even though it's pretty rare I get that note), usually just a careful explanation leading with love and understanding is enough to make the lightbulb go off",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368558436492509195",
    "author": "Øra Mastering",
    "date": "2025-05-04",
    "content": "That makes sense, thanks for the explanation. Reading this, I don’t think we’re miles appart. I used to have one «default» limiter and focus all my moves in front of that, also adding limiter/loudness as the last step. When doing so, I always found myself having to tweak the moves (that I already had «perfectly» dialed in) because everything would change when adding the final limiter. That’s when I would be chasing my tail 😅\nNow I start with getting the limiter right for the song and then doing eq moves as the second step. This way it it a lot less back and forth for me. I should say I only use one limiter at the time and the limiters I audition with are dmg limitless, fabfilter pro-l2 and Ozone maximizer, with styles I know well. Dmg usually gets used on acoustic and jazz, pro-l2 & ozone for pop/rock. If it is music with vocals I find different styles can really change the way the vocals are percieved, so it’s mostly chosing the style that support the vocals best that is the goal. Using two minuttes to get the right limiter from the start saves me time and uncertainty down the road, and in some cases let’s me use less eq to get the desired result.\nThere are many roads to Rome as they say, I was just interested in yours bc whenever I tried that it ended in a lot of second guessing (for me!). \n\nDo you find yourself having to add more eq when adding limiter at the end to keep the tonal balance you have acheived?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376286366983524382",
    "author": "Rollmottle",
    "date": "2025-05-25",
    "content": "Welcome! You’re new here. I’d encourage you take some time to get a feel for the discourse and flow here. We aim to do better than the White Sea’s of the world. His advice is not actionable in the real world when you’re mastering pop and commercial records for clients. We’ve gone very deep on loudness so spend some time with the search to understand why this take is untenable (and no, not based). If you’re a hobbyist or aren’t pursuing mastering professionally, knock yourself out I suppose. But if you aspire to have clients and work on pop music, I wouldn’t listen to anything that guy has to say.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405255393973637312",
    "author": "Berlin",
    "date": "2025-08-13",
    "content": "Does dither change your target LUFs",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1445526599800721478",
    "author": "Slow Hand",
    "date": "2025-12-02",
    "content": "Hey. There’s nothing wrong with putting EQs and limiters on your master buss as you mix. A little bit of EQ or a lot of limiter is alright.\n\nThe answer here is to mix *into* your limiter. You don’t want to mix the entire song and then slap a limiter on at the end for loudness. As you’ve discovered that will mess up the balances that you’ve spent so much time getting right. You want to ease the final limiting in as you’re building the mix.\n\nI usually start a mix by pulling my limiter down a few dB. Enough to get everything starting to touch the limiter. To get the loudness in the ballpark.\n\nThen I’ll push into it a little more so that I’m starting to get some gain reduction. Certain instruments may begin to get pushed down or distorted in a way I don’t like. Maybe the kick is hitting the limiter too hard, so I bring it’s level down and then lower my limiter some more.\n\nContinue this process of adjusting balances into your limiter as you mix until you’ve got the loudness where you want it. Usually I’m checking in on my limiter a few times throughout the mix to see if I can push it harder without penalty. When I hear it distort in a way that I don’t like I back off.\n\nHope that helps some.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "977605286393155674",
    "author": "oaklandmatt",
    "date": "2022-05-21",
    "content": "tbh not really. i like aggressive undynamic music. i don't prefer it necessarily. but aside from just loving great songs, the thing that excites me the most is sonic/production innovation. right now the people innovating the most are making insanely loud shit. that 100gecs song \"Mememe\" was prob my fav song of last year and it peaks at -1.9lufs (🤯). it's not the loudness that's interesting, it's the insanity and innovation sonically",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1027368901685809253",
    "author": "Nomograph Mastering",
    "date": "2022-10-05",
    "content": "That said I got a mix from an A list rock producer this week, the REF was -6 LUFS integrated and the mix was -15.4",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029924570481840179",
    "author": "Zack Hames",
    "date": "2022-10-12",
    "content": "North American broadcast: -24 LUFS\n(Radio ads and TV)\n\nEuropean Broadcast: -23 LUFS\n\nYouTube: -13 LUFS (does not normalize volume up only knocks down)\n\nMost streaming services: -14 LUFS but it doesn’t matter what you send, like YouTube \n\nLoudness standards for movie theaters, video streaming, other formats, are per distributer and can be found by asking for an Audio Spec sheet.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030145498402783262",
    "author": "mixedbywong_my",
    "date": "2022-10-13",
    "content": "In Asia , we mostly do -12-14lufs mostly , -20 lufs is mostly for digital tv usage.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038250586195370054",
    "author": "Zach Hughes",
    "date": "2022-11-04",
    "content": "Well when a noob uploads a track under -14 LUFS with peak levels at or above -1 dbFS Spotify turns it up to -14 and slaps a limiter on it. There you go. Spotify mastering",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038489762161504338",
    "author": "Will Melones",
    "date": "2022-11-05",
    "content": "All I know is that a lot of folks think Spotify doesn’t have a limiter—it only turns *down* loud masters when normalization is enabled. In fact Spotify definitely DOES have a limiter, and if you deliver a master below -14 LUFS it will be turned UP, and anything over 0 will be smashed (only when normalization is enabled).\n\nThere is also a 3-level setting for volume when normalization is on, and the app tells you that sound quality *will* be affected at the loudest setting. Not sure how this works in real life.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044676964604190730",
    "author": "Eric Martin",
    "date": "2022-11-22",
    "content": "still 6 db of loudness range, macro dynamics win!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072979566144008245",
    "author": "austenballard",
    "date": "2023-02-08",
    "content": "Just wait til he hears about the meme rate... AKA whatever some 15 year old's parents will pay you for -6 LUFS out of an Ozone Maximizer preset",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078719087666012210",
    "author": "Nomograph Mastering",
    "date": "2023-02-24",
    "content": "Loudness comes from EQ primarily, then clipping and limiting. It doesn’t come from compression, and to me distortion (saturation etc) is a bad way in general too",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090739246584827925",
    "author": "ALXCPH",
    "date": "2023-03-29",
    "content": "But I can see a future where the mastering role gets replaced with a finisher role(semantics I know but still) \n\nImagine we get to a point where we get a “sound goodizer button” that just puts out something that just sounds better then what was before. \n\nI think that will change the field a lot. To a point where the MEs that care about the art will still be valued, but the MEs that are more “technical” and only worry about competitiveness in freq and loudness will probably cease to exist",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097355805189210122",
    "author": "Nomograph Mastering",
    "date": "2023-04-16",
    "content": "You cannot depend on loudness normalization. It’s not turned on for everyone, it’s not available on web streaming platforms, smart TVs etc",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099033256487288842",
    "author": "dcmabon",
    "date": "2023-04-21",
    "content": "Thanks!!! I make tees and stuff for our very specific niche because I feel it deep in my bones every time someone asks me “should I master my metal record to -14 LUFS” 😂😂🤦‍♂️🤦‍♂️",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099047829974040636",
    "author": "Josh Bowman",
    "date": "2023-04-21",
    "content": "Live love lufs im dying it’s so good. 🤣🤣🤣🤣",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1103017844381339649",
    "author": "Eric Martin",
    "date": "2023-05-02",
    "content": "I get a lot of mixes that are informed by the loudness penalty, coming in “hot”at -18/-20 and the ref will be limited to -9 and the mix is unrecognizable.\n\nI keep telling the kids to not turn off their processing, but ¯\\_(ツ)_/¯ that’s what’s happening",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1115246016829071401",
    "author": "Andy Lawson",
    "date": "2023-06-05",
    "content": "Loudness penalty is a no go in reality. Make your mix as loud as you can without f*cling it up. That’s where I’m at.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143693003429515346",
    "author": "Nomograph Mastering",
    "date": "2023-08-22",
    "content": "So I’m not saying I want modern levels, I’m saying that if a client has made a -7 LUFS album you can’t ship -12 LUFS cutting masters and expect it to represent the intent",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143702644335063171",
    "author": "cian riordan",
    "date": "2023-08-22",
    "content": "Give peace (DR) a chance, man. (Says the guy shipping -5 LUFS mixes atm)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152340554122797136",
    "author": "Nomograph Mastering",
    "date": "2023-09-15",
    "content": "I buy mine in bulk at LUFS Warehouse",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222573287629127731",
    "author": "Rollmottle",
    "date": "2024-03-27",
    "content": "There are 5000 ways to skin a cat, but I found separating the tonal step from the loudness step unlocking. Being able to focus on the song on its own terms first, lead to better outcomes for me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243748888934875208",
    "author": "cian riordan",
    "date": "2024-05-24",
    "content": "I’m pretty sure my mixes are getting clobbered by normalization",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243758430607638588",
    "author": "masteredbyjack",
    "date": "2024-05-24",
    "content": "All that said, of course I care about how masters will sound when normalized and how they will compete. And study it deeply (I like loudness penalty studio a bit to study that). But the ceiling is set by the arrangement",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1252339871733776384",
    "author": "Berlin",
    "date": "2024-06-17",
    "content": "One of my mentors early on in my mastering journey told me to forget about the meters and just use my ears, give the track what it needs and leave it at that.. Of course hard for me at that time because I was hard in the paint about how loud the pros were getting stuff, but hadn't wrapped my head completely around the idea that there's so much more to loudness and perceived loudness than just a limiter (and the pros are working on pro tracks, whereas at that time, I was not.. not even close). But fast forward to now I literally think about that conversation everyday and how right he was, even with the tracks that I receive being better than ever.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301985839101775934",
    "author": "Nomograph Mastering",
    "date": "2024-11-01",
    "content": "To be clear we’re not having a clipping or data compression issue, just a perceived loudness",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1344100878759759883",
    "author": "Matt Huber",
    "date": "2025-02-25",
    "content": "This has been one of the few positives about Atmos. There’s a single number (+/- .5db), nobody argues about loudness",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368309434551636119",
    "author": "Elaine Rasnake",
    "date": "2025-05-03",
    "content": "In Reaper I can have it automatically adjust the volume of each track so the Short Term LUFS are the same but then I'll go through by ear to finish balancing things so certain elements are consistent throughout the project",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368650905301553203",
    "author": "Rob Domos",
    "date": "2025-05-04",
    "content": "I’m also usually a 1 limiter guy, and I’ve seen plenty of 1 limiter projects hit -4 LUFs and sound great, so it’s not like more = louder. \n\nIn the spirit of not creating a dogma here, just yesterday I heard Randy Merrill say it’s not uncommon for him to stack 2 limiters with different time constants, keeping the musical groove in mind, with one doing 90% of the work and another doing 10%. I get the sense that he’s feeling the value of both fast and slow release on the same project, and he’s getting great results too!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376285514004566136",
    "author": "Beck Nebel",
    "date": "2025-05-25",
    "content": "Which part are you referring to? If you’re curious, try searching this channel for any of the key terms from the video. There are plenty of well-tested insights from professionals who spend their days mastering music. You’ll find more in-depth and practical approaches shared by people with a lot of hands-on experience.\n\nThere are a lot of reasons to hit certain loudness measurements imo, and -1dbTP is not the answer",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415880237060722748",
    "author": "Berlin",
    "date": "2025-09-11",
    "content": "3rd party instances do not implement normalization.. yes!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1442276985538871489",
    "author": "BatMeckley",
    "date": "2025-11-23",
    "content": "Suck it up buttercup. More lufs. There’s no crying in mastering.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1472014837092454486",
    "author": "East End",
    "date": "2026-02-13",
    "content": "I’m doing all my monitor control via wavelab and an RME adi2pro. I locked the level so I don’t ever adjust it an dI just level match with a ref track “loudness matching” feature in wavelab and use a key stroke to flip a/b",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "977588138228744282",
    "author": "Zack Hames",
    "date": "2022-05-21",
    "content": "I always turn off any normalization on streaming. Does anyone here prefer using it?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "989199943195582465",
    "author": "rse",
    "date": "2022-06-22",
    "content": "Nah it does it on laptops too. Only things I can think of where loudness normalization is not applied is tv's, external speakers like Sonos, and maybe the web player but I'm not sure",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042557861449973770",
    "author": "JakeTB",
    "date": "2022-11-16",
    "content": "To be clear what I was referencing- Ruairi recommended releasing some random music a few days ago to test these normalization theories.\n\ncan’t comment on the -.3 vs TP in Pro-L2, I haven’t tested it enough yet 🙂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042563698226638879",
    "author": "Deleted User",
    "date": "2022-11-16",
    "content": "even with sync stuff - especially in Ad world. I need to send tracks in loudness that compete with really loud ads. \n\nif it’s not loud enough, people don’t perceive it as professional quality tracks. people in ad agency will probably say something like “this track feels underwhelming for some reason”",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042572558240858224",
    "author": "Nomograph Mastering",
    "date": "2022-11-16",
    "content": "No meters and no referencing for me, I’ll notice the LUFS when I QC but there’s almost nothing I could see that would have me change the master",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042673846685282334",
    "author": "David Fuller",
    "date": "2022-11-16",
    "content": "14 LUFS tells you absolutely nothing of the crest factor",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043027724958191718",
    "author": "Zach Hughes",
    "date": "2022-11-17",
    "content": "Well they will have the same integrated LUFS measurement of loudness but the perceived loudness could vary slightly",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043028860532428810",
    "author": "Zack Hames",
    "date": "2022-11-17",
    "content": "Sorry I’m beating a dead horse - I master ad music all day every day and LUFS have just been really reliable and easy and made my work super consistent and I’ve seen it work in real time",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043028986537709659",
    "author": "Zach Hughes",
    "date": "2022-11-17",
    "content": "Yeah in that situation probably wouldn't notice much of a difference in perceived loudness, but if you mixed the song to like -4LUFS integrated and then again at -10LUFS integrated and then normalized both to -14LUFS integrated and compared you could probably tell a diff in perceived loudness",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043032498839502849",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "So when we crush a master to -4 and then LUFS match to one mastered at -8, the added distortion on the -4 master will likely make it feel louder",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054820531792269322",
    "author": "Nomograph Mastering",
    "date": "2022-12-20",
    "content": "I also make no effort to match LUFS between tracks on a record",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054829949590188142",
    "author": "cian riordan",
    "date": "2022-12-20",
    "content": "Interesting about the metering, @Nomograph Mastering. This makes a lot of sense to me in a room you know, but I do find visual metering tools (VU, spectral analyzer, LUFS, L/R balance) very useful in helping me get acclimated in a room I don't know very well. Obviously more of a tracking engineer problem than a mastering engineer problem.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064418232959778876",
    "author": "Zack Hames",
    "date": "2023-01-15",
    "content": "I should clarify - hearing what you or @Rollmottle do for mastering, has made me realize I’ve never really mastered in my life, not in a real way, and I don’t think it’s something I’m as qualified as I maybe thought I once was; I didn’t think I was amazing but I was that idiot like “I’ve got fabfilter and I know what LUFS are, I got this”.\n\nTruly, you guys made me appreciate mastering engineers more than I ever could. It’s a must have, and anything I record or mix from now I on I am going to insist it gets mastered by someone on the level",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078618407055917116",
    "author": "spectrummasters",
    "date": "2023-02-24",
    "content": "@Nomograph Mastering good morning ruari , I m taking a dive into the dsm v3 at the moment . I’m still on my search for loudness tools that I’m satisfied with . I’ve spent a month with the newfangled audio elevate and just found imo what came out the other end sounds so different to what goes in regardless of GR . (No prejudice meant against the software for other potential users ) . So far this dsm seems more suited to my sonics ….my question however is re the release time . I find the release times I usually dial in are not appreciated by this plug ,  in your experience is the release time for the dsm equivalent to what you’d be setting in an l2 etc ….or is there a bit of a nack to this dsm and it has its own wants and needs . I seem to be getting a sort of ringing / distortion at faster times ? Any tips / advice would be appreciated muchos , have a great day",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079109109623828530",
    "author": "Nomograph Mastering",
    "date": "2023-02-25",
    "content": "Broadly speaking yeah, this is how I approach analog mastering. I’m getting tone and texture from the chain, but loudness is still mostly done in the box, the limiter will have a bunch of gain, like 10dB easily",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099179472386797648",
    "author": "masteredbyjack",
    "date": "2023-04-21",
    "content": "Totally. I’m still learning to understand it deeper myself, as far as I can tell in my rather limited experience the loudness/loud feeling has to be mainly gotten in the mix, and even more than that arrangement.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121092266660999379",
    "author": "Nomograph Mastering",
    "date": "2023-06-21",
    "content": "3) When matching tracks to each other ignore LUFS. Completely. The integrated value means nothing when it comes to how songs sit together, and even less about transitions. Match by ear",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132074328985448520",
    "author": "Rollmottle",
    "date": "2023-07-21",
    "content": "🚨 🚔  LUFS Police 🚔 🚨",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152334728633000107",
    "author": "Gerhard Westphalen",
    "date": "2023-09-15",
    "content": "Most of my knowledge is in the music side of things, not the technical. Starting to read music before learning to read, all the school bands, 10 years playing in orchestras, learning many different instruments, having a teacher who pushed me through it all, composition degrees, working as an orchestrator, arranger… that plus some time working on listening skills is what makes me a half decent mastering engineer IMO. Everything else you just pick up as needed. Don’t know what a LUFS is and where to get one? Just a Google search away",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1156320230759485613",
    "author": "Gerhard Westphalen",
    "date": "2023-09-26",
    "content": "No clue. I've never worked with this mixer before (artist working with a new person and brought me on). Full of other technical stuff like bring the master peak down to -0.6dB to avoid the loudness penalty",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217670691768373278",
    "author": "masteredbyjack",
    "date": "2024-03-13",
    "content": "More LUFs more money, less hours",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217670938925989898",
    "author": "masteredbyjack",
    "date": "2024-03-13",
    "content": "Sometimes tough to get the LUFs though, that’s why you get the bucks",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220811523518234745",
    "author": "masteredbyjack",
    "date": "2024-03-22",
    "content": "Just use the Wavelab Metanormalizer -- album DONE! Nothing could go wrong",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243717667798515793",
    "author": "masteredbyjack",
    "date": "2024-05-24",
    "content": "I’ve played with it, and every time I’ve seen what I does it sounds very odd (as you suggested). Maybe, maybe it’s informative as to how loudness is calculated. I’m actually sometimes doing the gaining up an intro or passage “for free”, but mostly because I think the art wants it, and secondarily because we may be able to steal a half db or db in apparent loudness at the top of a song.\n\nI wouldn’t make any musical decisions based on it, all feel there. I can just see people making really bad moves to get 100 percent measured and having some odd reverb upward compression happening that ruins the vibe\n\nLike anything else, neither good or bad, all about how we wield it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1250139504367505428",
    "author": "Edsel Holden",
    "date": "2024-06-11",
    "content": "Modern music is loud. Repeating words said by others here, but it is our job to do loudness well. It's best to look at it as a challenging positive vs \" but MUH DYNAMICS\"... I like loud music and most folks do too haha",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285611719703658516",
    "author": "masteredbyjack",
    "date": "2024-09-17",
    "content": "IMO -- meh. If I was opening a studio like you, no way. Save the cash. I did it because all I do is master so was curious, I guess sometimes the loudness measure in Wavelab can be helpful is there is a slammed REF but even then, I can't think of a new feature I use regularly",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285629926321426578",
    "author": "Ted Whitten Media",
    "date": "2024-09-17",
    "content": "I upgraded to 12 when it was on sale, but I'm not sure I've made use of any improvements. Most of the new features that interested me ended up not being as useful as I thought, in particular the loudness matching.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285632328999108722",
    "author": "Ted Whitten Media",
    "date": "2024-09-17",
    "content": "I like it a lot, it shows a trace of loudness over time as well as marks for highest peak levels.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290409008838086717",
    "author": "Berlin",
    "date": "2024-09-30",
    "content": "I think first Q was about mastering to -14 LUFs.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290413043427184692",
    "author": "cian riordan",
    "date": "2024-09-30",
    "content": "Just blindly assuming that -14 made sense based on what people were saying about streaming normalization. It's also when I began to work with less heavy-handed mastering engineers who were more likely to maintain the level of the mix that I sent them. I go back and listen to some stuff now and I think there'd be real merit in pushing things against the glass a little more.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290416212278247544",
    "author": "cian riordan",
    "date": "2024-09-30",
    "content": "For sure. People rely on us as professionals to give them sound advice based on our experience and expertise. I had clients telling me 'these feel quiet' and were pacified by my explanation of streaming normalization at the time.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324811188114161746",
    "author": "Moses Mastering",
    "date": "2025-01-03",
    "content": "So, in most cases, you can go over 0 dB in your DAW if you're working in 32-bit (or higher) precision, and you won’t necessarily hear the clipping. This is because the internal audio engine can handle peaks above 0 without immediate distortion—it’s all about floating-point processing magic.\n\nNow, whether the audio gets normalized to stay under 0 dB depends on what happens during export. Sometimes, what you're seeing in the DAW or Ozone meters isn’t exactly what ends up in the final file—especially if there's a limiter, normalization, or post-processing involved. It’s even possible that the version you’re analyzing wasn’t actually the one that was officially released. Happens more often than you’d think!\n\nThat said, it’s not unusual to see mixes or masters that are technically clipping more so going over 0... in tools like Ozone or the DAW but sound fine due to the flexibility of floating-point processing. I’m not saying this is a best practice—but I’ve definitely played around with it. I’ve even intentionally clipped files way past 0 dB, re-exported them, and compared them to cleaner versions. They sounded different, but at that point, I found myself asking, “Why am I trying to squeeze one more dB of loudness out of something that’s already crushed and competitive?” Classic overthinking, right?\n\nAnyway, back to your question: I think what you’re seeing is a product of the DAW working internally at 32- or 64-bit, so it can handle those overs without clipping during processing. Then, during export, maybe they normalized it, maybe they fixed it later, maybe it did just didn't sound distroted haha... or maybe that’s just not the real released version at all. Who knows?  I would not lose sleep over it and also know what you have seen is not a \"secret\" that your missing haha.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336772710683906108",
    "author": "Calvin Lauber",
    "date": "2025-02-05",
    "content": "Hey guys- so I’m asking this question I guess in a mixing context but I know it’s a common function of mastering so I thought I’d post here. \n\nI always have an instance of ozone maximizer at the end of my chain that I mix into. I’m generally happy with the results/loudness I get and comfortable with the parameters, except I never really mess with the “character” which I suppose is the speed/release of the limiting? \n\nOn a recent mix I slowed it down more than I ever would, which really just means making it slower at all from the defaul setting, I usually stick very close to it, and I really like how it made the pocket of my mix feel. But I guess, I have always understood people to use very fast release compression on masterbusses.. \n\ndo you all find yourselves moving the character/release of the final limiter around pretty widely to get the right feel or are you typically keeping it quite fast?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337197775963553895",
    "author": "Moses Mastering",
    "date": "2025-02-06",
    "content": "yes i will move attack and release all the time for every song depending on gear or plugin.. i actually think attack and release at mastering is kind of a make or break to a lot of my \"sound\"...... to dial in the groove of the song... also with that ozone  character slider if its fast it will have a tendency to distort if pushed hard. You can slow it down and get a cleaner sound ... and while you then lose a bit of volume you can then actually limit it more to make it back up. I notice when i move it to slow i lose about .2-.4 db in final level, so then I can gain it back up and take that \"off\" in the limiter. This might sound silly haha.. but it gets me the same \"loudness\" of the \"loud\" setting while being cleaner. Sometimes i just use loud though when it sounds right haha. this is not a perfect science but general observation and application haha.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1343680344167288935",
    "author": "Berlin",
    "date": "2025-02-24",
    "content": "i had more phone calls in 2020 about -14 lufs than i care to recall",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359977060763701250",
    "author": "Nomograph Mastering",
    "date": "2025-04-10",
    "content": "Let's assume a few things\n\na) The artist loves their digital masters\n\nb) Limiting and clipping cause challenges in cutting and more importantly playing back vinyl\n\nIt's a fact that we push most modern records to the limit loudness wise and they often beneift sonically from a few dB more breathing room.\n\nSo here I start with a default of 2dB less limiting. I'm comparing back and forth with the approved digital masters attenuated to match. Is it better? Is some element popping out?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1364289811736690779",
    "author": "masteredbyjack",
    "date": "2025-04-22",
    "content": "Come on Roll, how are you going to compete without that upward compression in 11 to trick the LUFs algorithm?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368297454520504591",
    "author": "Paris Lee",
    "date": "2025-05-03",
    "content": "Mastering the mix has a good plugin- Reference 2 \n\nMy main use for reference 2 is auto sample alignment of the unprocessed mix and master on the master bus and to be able to listen to that live. \n\nThe time alignment of ab’ing -at least to me- is as just as big a problem as volume descrepancies…\n\nIt can also let you manually by ear tune volume up and down, it will also lufs match to either the quieter or the louder, it will also take everything and auto it down to streaming LUFS (good for evaluating maybe a change in dynamics) \n\nI also have a tidal playlist running on another cue which just goes and is in whatever genre i might be in and you never know what will come up at any time. This can be quite fun! Conscious’i must compare this to that’ is already a bias!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368313624577310740",
    "author": "Elaine Rasnake",
    "date": "2025-05-03",
    "content": "Actions - Filter to find \"Item properties: Normalize items (peak/RMS/LUFS)\" Normalize each item separately \n\nIts normalization just adjusts the volume level so it doesn't permanently affect the audio so you can go back and readjust",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370056106235134094",
    "author": "Berlin",
    "date": "2025-05-08",
    "content": "The more of a pain point for me on project like that is that of course we are chasing a lufs measurement per track instead of balancing the program. So ballads feel louder and bangers feel quieter. Hard listen from my perspective, but again it’s their prerogative.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370069506860515410",
    "author": "Berlin",
    "date": "2025-05-08",
    "content": "Not from labels really, and yeah I would agree most labels would push louder than quieter. \n\nOn the indie artist side, I have had this conversation many times over. Especially around 2020... And the self produced/mixed artist might send many different quotations or sayings my way telling me why my v1 was technically wrong (too loud). Some of them were open to talking about it and others no. Truth is they are fronting all the cash, credit cards, student loans, bar mitzvah money, and they just want to be \"technically correct\". Perhaps something similar going on with this indie label?\n\nBut again, the good songs still performed well in the end and the LUFs just didn't really matter, that was my lesson to learn from it all.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370073379360608256",
    "author": "Austin Gordon",
    "date": "2025-05-08",
    "content": "Agreed, I can't find any empirical data or evidence online to really support the claim that playlisters are making choices like this regarding loudness. I would really like to know where that is coming from.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374788999054364703",
    "author": "Gerhard Westphalen",
    "date": "2025-05-21",
    "content": "Biggest problem I've faced in these situations is loudness. Get a mix with huge low end at -18 lufs. They want something back at -8 without any distortion or things like vocals ducking",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374800073380335687",
    "author": "Edsel Holden",
    "date": "2025-05-21",
    "content": "what if..... musicality is more important than loudness for this edge case we are hypothetically discussing here...",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376313970918555689",
    "author": "Rollmottle",
    "date": "2025-05-25",
    "content": "You’ll find no pushback to the idea that loudness is a creative choice or that loudness is dictated by the mix in these parts.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376972777025830972",
    "author": "Paris Lee",
    "date": "2025-05-27",
    "content": "When navigating revisions for me (had to go to a rev 3 recently with someone I’d label ‘eccentric’, and had parted ways with the original mastering engineer before me) \nI think the best practice is to always establish what you did verbally from rev to rev, being careful not getting into the weeds of ‘well you wanted me to widen but that kinda affects this and that bla bla…\n\ndon’t confuse them..! \n\nDon’t talk about frequencies or gain reduction numbers or LUFS etc…\n\nBe concise and confirm you performed their notes point by point, and, get a conformation back that- did you actually accomplish what you set out to do?  To what degree? Did you nail two of the three notes? 1 of the three? 3 of 4? Or all of them? \nWhatever it is- this should help them focus and get the conversation so it’s not just them coming back with things that you weren’t even aware of what they were thinking.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415359352965169173",
    "author": "masteredbyjack",
    "date": "2025-09-10",
    "content": "I would not know, but doubt it. The reason for normalization is just to stop some tracks from blasting listeners, for their experience, can’t see why they would change that",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415879942343888989",
    "author": "Berlin",
    "date": "2025-09-11",
    "content": "yes and only if the listener has normalization enabled",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415880145104801853",
    "author": "masteredbyjack",
    "date": "2025-09-11",
    "content": "But other places don’t always have normalization, tvs and stuff (you know this, saying for others)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415889110022881410",
    "author": "masteredbyjack",
    "date": "2025-09-11",
    "content": "Settings -> Playback -> Enable Loudness Normalization works for me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440069385955049533",
    "author": "shaunobi",
    "date": "2025-11-17",
    "content": "Enjoyed the hang Gabriel! \n\nAnd yeah - I think a lot of what you brought up (pushing A800 pretty hard on that one track, etc) I’d put in more of the “2bus” group rather than “mastering”.\n\nHaven’t checked your doc but for me I run 3-4 plugins - tape, some Pultec with a tiny boost, a bit of Fairchild box tone, Tonal balance control for analysis and that’s it. Then for “mastering” I’m boring and use either Pro L2 for a touch more loudness or Ozone with most of the modules turned off 🙂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1445613066631909406",
    "author": "Juliette",
    "date": "2025-12-02",
    "content": "Thank you for these tips so much, very insightful to how to navigate the process a little more. I've heard a lot of \"do's\" and \"don't\"s when it comes to the general process of getting a track ready for mastering, so I'm always hesitant to change my workflow if a track is finally up to my liking. The thing that was really screwing me over was the whole LUF's and loudness and whatnot (which I could probably rant about for ages now... but I digress) Will give these a shot, thank you brother <3",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1445864277088141344",
    "author": "Edsel Holden",
    "date": "2025-12-03",
    "content": "I want to second that most of the \"do's and don'ts\" from the rest of the internet are, usually, designed to sell you a solution - and not actually teach you any technique. Bc once you know the techniques, you don't need to be sold anymore solutions. \n\nThat is their worst fear !\n\nIf it feels helpful, ignore the \"LUFS and Loudness\" for a bit, and make music that you love - the next steps will reveal themselves !!\n\n@Slow Hand reply about mixing into limiters is very good, +1",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463375192234655879",
    "author": "masteredbyjack",
    "date": "2026-01-20",
    "content": "Someone like @cian riordan the loudness really is almost magically in the mix, other mixers lean on the limiting much more. Not really a right way, keep exploring you’ll find your way!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "981297234169708564",
    "author": "Will Melones",
    "date": "2022-05-31",
    "content": "Definitely. Effect is the effect! It’ll give you significant gobs of perceived loudness and protection from clipping without touching the curve. Curve modifies the effect, as far as I can tell",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983234416375660545",
    "author": "samvalentine",
    "date": "2022-06-05",
    "content": "All right so what's the final word: how loud are we submitting songs to DSPs? Do I give Spoti -14 LUFS or can I go -11, -10?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983240657940402176",
    "author": "Zack Hames",
    "date": "2022-06-05",
    "content": "The ONLY place loudness has an actual consequence is broadcast advertisements. You Can’t submit masters louder than -24 LUFS in North America and -23 in Europe.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "989199574117802044",
    "author": "CAPSLOCKDUB",
    "date": "2022-06-22",
    "content": "I don't know if that's true on spotify but I know tidal has options for normalization on both desktop and phone but I'd assume Spotify would be the same",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "989201353010217050",
    "author": "rse",
    "date": "2022-06-22",
    "content": "Loudness normalization is not as common as people want you to believe hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "991110640339013703",
    "author": "rse",
    "date": "2022-06-27",
    "content": "What do you guys use as your final output level on your final limiter? I use the Fabfilter L2 in true peak mode and set the output to -0.2db. I'm now checking some of my own mixes recorded out of Spotify (Loudness normalization: off, Quality: Very high) using internal routing. I'm still seeing some small overs, usually at 0db, but occasionally at 0.1 or 0.2\n\nIs this something I have to worry about? I suppose I yes, since intersample peaks (I think that's what these are) are obviously something you would want to avoid I think. What do you use as your final output or ceiling on your limiter?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "991111240917192744",
    "author": "CAPSLOCKDUB",
    "date": "2022-06-27",
    "content": "I use -0.11 to avoid anything turning red in the daw. But I've noticed on tidal with normalization off, most commercial mixes have overs reading out on my clarity M. I personally don't worry to much about it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "999346696834261182",
    "author": "mixedbywong_my",
    "date": "2022-07-20",
    "content": "Mastering engineers , how’s your workflow when you’re working on an album ? Do you go in n fix stuff in rx at one go ? Or do you work on the levels , eq , compression if any first ? Assuming all the tracks are at different integrated loudness when sent in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028095509182828554",
    "author": "Jeremy Klein",
    "date": "2022-10-07",
    "content": "Is there a term for the Lufs range between the quietest section of a song and the loudest? And is there a good rule of thumb for not having too drastic of a loudness difference in a modern pop song?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028098513189490789",
    "author": "Nomograph Mastering",
    "date": "2022-10-07",
    "content": "I would never look at a meter for a decision like that. I only ever glance at LUFS after I’m done, if even",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028102275551465482",
    "author": "Jeremy Klein",
    "date": "2022-10-07",
    "content": "Also an interesting point that if the musical arrangement is not good, then no matter how big that loudness contrast between the verse and the chorus is, it still might not \"work\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029889423866876015",
    "author": "YamiSmokesPiff",
    "date": "2022-10-12",
    "content": "This is more of \"post talk\" and spec question - \n\nAnyone have experience mixing for Radio ads? I'm seeing a bit of conflicting info on loudness and I didn't get a spec from my client. Just wondering where yall are delivering this spots!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029907694213156907",
    "author": "peterlabberton",
    "date": "2022-10-12",
    "content": "Yeah… I was also just realizing I was delivering only music to a production company. Then they’d do the final sound to picture. But for the music itself I’d be delivering stuff as loud as like -6 to -8 LUFS, 0.5 db headroom in the loudest sections. But again I wasn’t the final stage! So if you’re delivering the final product and not just the music… I dunno! I’d ask around to whoever you’re delivering to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031968093142003752",
    "author": "VESHZA",
    "date": "2022-10-18",
    "content": "i cannot explain this but its like my ears are tuned to like specifically -10 LUFS for some reason lmaoo\n\neverytime before i actually check the LUFS on any meter, i first get it to a level i like personally and feel like works the best for the track, \nand afterwards when i check it and its almost always on -10.0LUFS",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1031970201220161556",
    "author": "VESHZA",
    "date": "2022-10-18",
    "content": "thats the thing its like when i actually check it, some songs i listen to are like -7 when not normalized",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031970341347663872",
    "author": "Eric Martin",
    "date": "2022-10-18",
    "content": "and that’s LUFS, bet you have sections that hit -6",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032075392707739768",
    "author": "Nomograph Mastering",
    "date": "2022-10-18",
    "content": "My master was the same level, just a little under -3 LUFS, but without the true peaks and with a tiny bit of EQ",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033023196863156224",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "I realize this sounds negative or defeatist, but really it’s just about riding the horse in the direction it’s going. We can sit around and lament home recording, loudness etc or we can help our clients realize great art in this new landscape",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035659728199626772",
    "author": "spectrummasters",
    "date": "2022-10-28",
    "content": "In regards to your RX prep that you mentioned , I was wondering if you used the phase rotation tool much ? I’d watched a video with the ME John Maynard discussing the pros of using it to maximise loudness of a master but I’ve discussed it since with a few other engineers who swear it’s not worth it due to pre ringing it can cause . I’ve never heard this pre ringing when I’ve used phase rotation myself but my ears are still “learning “ to hear these sorts of artefacts . I’d be v interested (and grateful ) to hear if you had any thoughts on phase rotation .? It seems to be a bit of a marmite topic    The video I first saw it discussed in a mastering context was here https://youtu.be/SuYFWeXuErI",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1037924322070773800",
    "author": "Zach Hughes",
    "date": "2022-11-03",
    "content": "Folks, I have a question for the group. Would love to get a mastering engineers perspective. I'm curious what is the rationale behind masters clipping output converters and leaving in true peaks that exceed 0dBFS? I get that clipping converters can sound cool / desirable, but why not achieve the clipping you want and then print a final master under zero? Why risk a consumer product crapping out during playback and adding potential distortion and why totally disregard pretty much every DSP's recommendation that true peaks not exceed -1 for the encoding process? I'm noticing that a ton of major label releases are peaking above zero with loudness normalization turned off on Spotify.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038172166291734669",
    "author": "mixedbywong_my",
    "date": "2022-11-04",
    "content": "I noticed a lot of these clipping happening with some huge Korean Kpop songs recently (power ballads or dance pop) . With or without loudness normalisation,  played from Tidal or Spotify. Most cases, the YouTube version does not have the same clipping bits.  🤷🏻‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038200412777488534",
    "author": "Will Melones",
    "date": "2022-11-04",
    "content": "I think sometimes it's easier to get -6 lufs on ballads, so you take what you can get 🥲",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038250101052821514",
    "author": "David Fuller",
    "date": "2022-11-04",
    "content": "I genuinely do not get the -14 LUFS integrated thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038482846173626489",
    "author": "Zakhiggins",
    "date": "2022-11-05",
    "content": "Actually guys - I had mixed a a song for a client one time, that when released, on Spotify it got clipped HARD, as in the transient of the kick got turned down like 5db... On every single other streaming service, it sounded just as the final master sounded.. I don't remember it being crazy loud either, maybe like - 8 lufs integrated.. Any idea wtf went on here?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038487314793500723",
    "author": "masteredbyjack",
    "date": "2022-11-05",
    "content": "Not sure why that would happen (though I suspect Ruairi would know) but something I’ve been finding useful is using Samply with clients to approve masters…and if there is indecision about how loud the master should be turning on the “loudness matching” algorithm. They having a loud master play right next to a more dynamic one.\n\nIt approximates what happens with streaming (minus the codecs and stuff) and at least you can see, sort of, how a really loud master would sit against a more dynamic one. From a creative perspective so people get an idea of the trade off between density and dynamics. \n\nHowever, I am quite new to the pro mastering side of things and while so far my projects are translating as expected I’m very interested to learn more about this and hear others perspectives",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038509474421411870",
    "author": "hyanrarvey",
    "date": "2022-11-05",
    "content": "-1tp at -6 lufs is still loud as fuck tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038672522297749544",
    "author": "Nomograph Mastering",
    "date": "2022-11-05",
    "content": "But most teacher brained people can't see the wood from the trees in mastering and think it's about processing, or loudness or gear",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1039791712077361203",
    "author": "Nomograph Mastering",
    "date": "2022-11-08",
    "content": "It is amazing how we normalize things",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040806729698529311",
    "author": "Chris Doms",
    "date": "2022-11-11",
    "content": "I’m getting hired to master a couple songs for the first time, local band that mixed the tracks themselves. I have an idea of how I’m going to approach it, and I talked to them about what they’re looking for. They’re looking for more overall loudness, a subtle approach otherwise. Generally not mastering stuff, I guess this could be in the newbie form too 😂 Just wondering if anyone wants to shoot some dos and don’ts at me, and would appreciate any advice.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040824932587802634",
    "author": "JakeTB",
    "date": "2022-11-11",
    "content": "If you want a TL;DR, Dale talks loudness normalization as it relates to projects, and how arrangement can impact the way a streaming platform perceives average loudness",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041009827897421864",
    "author": "manyonline",
    "date": "2022-11-12",
    "content": "Interesting that he blames true peaks. Would like to see the post-normalization Lufs measurement of a song without true peaks to confirm his theory.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041063115258863746",
    "author": "Nomograph Mastering",
    "date": "2022-11-12",
    "content": "I have a learned sense of how loud things are in the room so I’m not a big meters guy but at this point you’ll need to take a break, then come back and use some combo of lufs metering and referring to decide how loud to make things",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041068427982409768",
    "author": "JakeTB",
    "date": "2022-11-12",
    "content": "Yea it’s an interesting world. Ruairi might be able to confirm, but my gut is to trust Dale since I don’t have a good way to test it.\n\nThe more interesting conversation there to me was the idea of soft sections in the arrangement adding to the perceived loudness of the overall track after normalization; and the idea that Spotify averages the levels of an EP or LP, so having an acoustic track can reduce our average LUFS, resulting in louder playback.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041084805401559071",
    "author": "ALXCPH",
    "date": "2022-11-12",
    "content": "I get where you are coming from. But i'm mostly thinking of the thousands of young kids putting out GREAT music that they worked super hard on, but don't have the money for big knowledgeable mastering engineers, and then they try and \"master\" their own music, because they feel they have to becasue of all the miss information out there, and end up with weird surprises because, they arent able to test it, easily. A simple plugin or program could eliminate that completely. maybe let people worry less about loudness and putting random plugins and limiters on their mixes, because they know exactly what it will sound like once its released",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042527659688734901",
    "author": "Zack Hames",
    "date": "2022-11-16",
    "content": "I think a lot of people don’t care about true peak. \n\nThe god honest truth, from what I can tell, true peak does not matter in a deliverable sense unless you’re doing audio for video work where they have very specific guidelines for LUFS and true peak output and they’ll reject your buy if you don’t follow it.\n\nThere are no real rules in music making other than make it sound good.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042541179012649071",
    "author": "Zack Hames",
    "date": "2022-11-16",
    "content": "I want to clear something up:\n\nPeople say “your master will get turned down more”.\n\nYes. If your master is -8 LUFS it’ll get knocked down to -14.\n\n\nIf it’s -13 LUFS…it also gets knocked to -14 LUFS.\n\nSo two songs, regardless of their original loudness, will match. \n\nIf you released the same song at two different LUFS, they’d end up sounding “the same” loudness wise after normalization. Not taking into account the compression/saturation that happens with extreme limiting. \n\n\nAnd honestly LUFS works. So just master your shit however it sounds and feels best. Whether that’s -6 or -10 or -16.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042542718934589451",
    "author": "masteredbyjack",
    "date": "2022-11-16",
    "content": "Not to get too spicy on here, but I'd like to push back on this attitude a bit.  I think you're massively oversimplifying this. I wholeheartedly agree with your assessment that it's really the creative intent that matter to the record but there is absolutely something to be said in understanding how different LUFS are translating in the streaming environment. \n\nI'm never making decisions on how hot to master a record with any worry of it getting turned down, etc. But I definitely consider the density I think it should have and how that density will translate in the modern era of how people are listening to records. \n\nSometimes it feels like the \"just master it how it should be\" have missed the subtleties of this....and this is the mastering forum so it's a good place to discuss!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042544211435720714",
    "author": "Nomograph Mastering",
    "date": "2022-11-16",
    "content": "BTW I’ve seen no evidence that Spotify is taking true peak into account for it LUFS measurement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042570981945901096",
    "author": "ALXCPH",
    "date": "2022-11-16",
    "content": "When you decide on loudness for a track, do you use any specific reference tracks? or do you just know how loud something is in your room because of how well you know your room and what loud enough sounds like? You mentioned before you weren’t much of a meters person, so i dont imagine you use measurements like lufs to check how loud you are?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042572110821851197",
    "author": "ALXCPH",
    "date": "2022-11-16",
    "content": "Personally I work til something sounds good, and then I’ll check if I’m loud enough, usually with LUFS or a reference track, then re evaluate if I need to push it some more.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042573543306707064",
    "author": "ALXCPH",
    "date": "2022-11-16",
    "content": "When you QC is that just a last listen through listening for distortion and if anything is out of whack? Or is it more looking for ISPs, Lufs, correlation and so on?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042579305101791292",
    "author": "hyanrarvey",
    "date": "2022-11-16",
    "content": "Turns it down and normalizes it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042579451575279646",
    "author": "Nomograph Mastering",
    "date": "2022-11-16",
    "content": "Apple are using LUFS and a target like everyone else. Where did you see peaks come into it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042580803068104734",
    "author": "hyanrarvey",
    "date": "2022-11-16",
    "content": "In my experience i’ve always had best results with whatever lufs but with a low or lower  true peak",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042593450643689573",
    "author": "Zach Hughes",
    "date": "2022-11-16",
    "content": "Could be wrong but my understanding is that LUFS are relative to dBFS. If a master at -8 LUFS with a true peak of -1 dBFS (for the sake of simple math) was normalized to -14 LUFS the true peak of the normalized master would now output at -7 dBFS with loudness normalization turned on.\n\nIf the same song was mastered at -13 LUFS with the same true peak of -1 dBFS was normalized to -14 LUFS the true peak of the normalized master would now output to -2 dBFS with loudness normalization turned on.\n\nThese would not sound the same.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042629247023468664",
    "author": "Nomograph Mastering",
    "date": "2022-11-16",
    "content": "Peak values and LUFS are related but there’s not much to say beyond that. Obviously if you have a crazy low peak value like -2 dBFS then you will@have to limit the mix way too much to get a competitive level",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042658815377674281",
    "author": "Zach Hughes",
    "date": "2022-11-16",
    "content": "I mean relative in that if you turned a -8LUFS mastered track down 1dB with your fader it would output -9LUFS. And if your master once normalized on Spotify is turned down then the true peak is lowered (if measuring system output from Spotify) the same decibel amount the track is turned down to reach -14 LUFS. The true peak of a track with greater dynamic range that is turned down less or not at all post normalization will be higher. So relative peak levels upon playback, with normalization on, of tracks mastered at varying LUFS values is what I mean.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042673733300650014",
    "author": "Zack Hames",
    "date": "2022-11-16",
    "content": "14 LUFS is 14 LUFS is 14 LUFS.\n\n2 songs that are both measured at 14 LUFS will feel very very similarly in level. The true peak makes 0 difference in this perception.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042675531163906109",
    "author": "Zack Hames",
    "date": "2022-11-16",
    "content": "I’m not sure crest factor is as sophisticated or useful measure as LUFS. LUFS is weighted to our hearing, is averaged over time, and has a threshold like a gate for anything that’s particularly quiet and doesn’t add it into the average loudness. \n\nBut I didn’t really know what crest factor was until you mentioned, so I learned something. I’m curious if you can explain just a little more, maybe I’m missing your point.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042812063984136292",
    "author": "David Fuller",
    "date": "2022-11-17",
    "content": "Crest factor tells you the distance between rms and peak, so it stays the same regardless of whether or not any sort of loudness normalization turns it down or not",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043014207978868826",
    "author": "Zach Hughes",
    "date": "2022-11-17",
    "content": "A real simple test would be to take a mix at -14 LUFS, turn it down 1dB, measure the output, see what the new LUFS value is. In my tests it's -13 LUFS every time. That's what I mean when I say LUFS are relative to dBFS.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043016904572411924",
    "author": "Zach Hughes",
    "date": "2022-11-17",
    "content": "A mix / master of a tune at -6 LUFS normalized to -14 LUFS will sound pretty different than the same tune mix / mastered at -10 LUFS normalized to -14 LUFS. Yes they both end up at -14 LUFS but that doesn't negate the mix / master decisions made to achieve those loudness levels. The later tracks transients will be better preserved and have greater dynamic range. Those two things drastically change how I feel and enjoy music.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043018480586338405",
    "author": "Zach Hughes",
    "date": "2022-11-17",
    "content": "I understand dBFS and LUFS fundamentally measure different things. However, if you import a mastered track with an integrated LUFS value of -10 into your DAW and then pull the fader down -1dB and then measure the output of your track it will no longer be -10. It will be -11 LUFS. At least in my experience. Is it different on your end?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043018585297133588",
    "author": "Zach Hughes",
    "date": "2022-11-17",
    "content": "I am talking about integrated LUFS values",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043018661671211089",
    "author": "Zach Hughes",
    "date": "2022-11-17",
    "content": "What Spotify uses for normalization",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043018832152891442",
    "author": "Eric Martin",
    "date": "2022-11-17",
    "content": "and we must not forget that normalization is an option",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043023484386820166",
    "author": "masteredbyjack",
    "date": "2022-11-17",
    "content": "This is true (at least as I understand it) but I think the deeper discussion revolves around how dense you want the music to be, how the transients sit relative to other aspects of the music, how much low end you want and what you’re willing to trade off in terms of openness/dynamics vs energy. \n\nThis is a super deep topic that I’m still wrapping my head around and forming my own opinion…and while I know I argued earlier it’s important to consider your loudness, it should absolutely take a back seat to your feel for the music creatively IMO.\n\nThere are many complex reasons why people like things loud (some I agree with, some not) but they do and will continue to as far as I can see.\n\nSomething like LUFS I find is best rendered as background knowledge. For example I found it interesting Ruairi says he knows how loud a record is because he knows his room so well and doesn’t need to look at the meters. I’m still getting there but I feel that’s a best case scenario so the meters aren’t dictating feel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043026306952073256",
    "author": "Zach Hughes",
    "date": "2022-11-17",
    "content": "I like listening and comparing the loudness of different mastered tracks (perceived or measured using LUFS). But it's not about the LUFS. I'm more curious about what was done to that track to reach that level of loudness. Like you said dynamics, transients, density, etc... That's the interesting piece.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043027042914013297",
    "author": "Zack Hames",
    "date": "2022-11-17",
    "content": "No, but they’ll be the same loudness roughly lol! One will just be more punchy/dynamic (likely, like you said)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043028080635150346",
    "author": "Zack Hames",
    "date": "2022-11-17",
    "content": "Ya know this would be a really easy thing to test. Take a mix, limit one just a little over -14, then another quite a bit over -14, then knock them both down after the fact to -14. Like would one really feel LOUDER or just have better transients?\n\nAlso, to be fair, I think some limiting sounds really wonderful to mixes. I don’t love a -14 LUFS mix. Not related to what you’re saying really, just a thought.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043032010026930206",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "So dBFS peak level is related to LUFS in that way only, but if we were way down at -20 LUFS then peak would have no effect",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043033197816070144",
    "author": "Zach Hughes",
    "date": "2022-11-17",
    "content": "What kind of track was it that you mastered at -3 LUFS?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053012116778537140",
    "author": "masteredbyjack",
    "date": "2022-12-15",
    "content": "Maybe I worded too strongly! Cohension matters, it's just that I find I care less about it than the feeling of the album if that makes sense. @Nomograph Mastering is way more experienced and knowledgeable than me on this.\n\nI'd also push back against your assumption that every song has to have the same output ceiling. This may be \"normal\" but sometimes it's just not the move. Just did an album where one song wanted to be more compressed/limited. So we did that but just literally turned down the gain on the output so it fit better with another quieter (more dynamic, not output level) track before it to match the \"loudness\" of the two more closely.\n\nHard to give any other insight because so much of it is dependent on the actual songs you have, what the artist's vision is, how to serve that, etc. Dynamics/energy/loudness plays a big part in that!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1053013705547333683",
    "author": "Zach Hughes",
    "date": "2022-12-15",
    "content": "Does your approach change when mastering an acoustic track following a fully arranged big track on a pop record? Do you match the perceived loudness of the vocals track to track?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054819434180661329",
    "author": "Rollmottle",
    "date": "2022-12-20",
    "content": "Loudness Range Average?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054820174315933756",
    "author": "Nomograph Mastering",
    "date": "2022-12-20",
    "content": "I make exactly zero dynamic decisions using meters, I’ll measure LUFS when I QC but pretty much never change anything based on what I see",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054977462783705118",
    "author": "Rollmottle",
    "date": "2022-12-20",
    "content": "no, i don't capture a pre-limiter analog capture. i used to for a bit, but it has rarely come in handy because a revision is usually something tonal, and not loudness related. so it just ate up disk space for no real benefit. the upside would be having flexibility on loudness for alts or if i missed on loudness the first time around and could just reprint from the analog capture vs. having to do a recall and a reprint. my recalls are pretty simple so it's not too much trouble to recall and reprint. part of this is getting ahead and planning for a higher volume of work that may necessitate this kind of work flow.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064530649958076467",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-01-16",
    "content": "Just finished watching it!\nI must admit, I thought,what's done while 2 buss processing is a part of mastering and I have realised how wrong I am about it!\n\nSurely had the same feeling what @Zack Hames has written above \" I've got fabfilter and I know what LUFS are, I got this \".\n\nSurely having more clearity about what \"ACTUAL MASTERING\" is\n\nThanks Again Everyone!🙌",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067205803032969287",
    "author": "Nomograph Mastering",
    "date": "2023-01-23",
    "content": "Before anyone comments on how they missed the other 100 sometimes it’s bad work, but often they are rushing, or mastering brightness/loudness/density shows clicks that were marginal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069714935224995912",
    "author": "Zack Hames",
    "date": "2023-01-30",
    "content": "Does anyone know if there's a way to make Fabfilter Pro-L 2 reset it's integrated LUFS measurement every time you press play? \n\nThis is for post production work - Nugen VisLim has this but I'd love to not have to use both plugins just to do my work quickly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070618578568618024",
    "author": "spectrummasters",
    "date": "2023-02-02",
    "content": "Are any of the ME’s here regularly using the Bettermaker Limiter or have experienced thoughts either way on it? (I don’t want to precipitate an ITB vs Hybrid debate) . I ask because I’ve noticed a few ME’s getting their loudness in IMO, a more musical way with it....I’m going to try it via the mix analog remote-service later today, and i was interested to hear any opinions before. Not so much to colour my judgement/prejudicial my ears but to be aware of any characteristics/trade offs to listen for in the opinion of seasoned users. Overall, I’m aware that my loudness sweetspot is about 2lufs lower than what ruari mentioned is common over there in the states....and I’m getting mixes in the -6 range.....which is tricky territory for me and so am working on how to get up there as musically as possible (I’m a big low end guy). Many thanks all and have a good day in the lab",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070622255882719232",
    "author": "spectrummasters",
    "date": "2023-02-02",
    "content": "I’m at -8 comfortably but the loudness really works in the ref I feel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070623657510047804",
    "author": "Nomograph Mastering",
    "date": "2023-02-02",
    "content": "For me on that kind of driving indie rock thing perceives loudness is hugely driven by the EQ. Particularly the relationship between sub 120 Hz, low mids from say 120 to 400 and then like 3 to 6k",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078719501450874890",
    "author": "spectrummasters",
    "date": "2023-02-24",
    "content": "Eq as in tonal balance of the whole mix (how the hz. Relate to themselves ?) and a good balance allowing for loudness ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079051020228894771",
    "author": "spectrummasters",
    "date": "2023-02-25",
    "content": "@Nomograph Mastering  right, ruari class finished ! .....ok so, ive a lot of thoughts ...this exercise has made a v big impression on me .\nOff top, \n\nAccording to RX The mix is at -7.2 LUFS integrated , -6.3 short term, TP -0.1\n\nThe artist wants a \"bit more low-end \" on a fast paced, alt/pop/rock track.\nAnd Imo a little air on top would compliment the mix.\n(starting at -7.2 is loud for my experience so its a good challenge and these sort of Lufs are what i want to become v comfortable working at where currently im more comfortable around -9.)\n\nSO i start with your 10 eq points in place , with your q settings and .5 db limits in fabfilter pro q 3  .\n\nThoughts:\n\nIt became clear immediately how powerful to me these q settings and eq points are, with regards to re-shaping the tonal balance.\nI cannot recall ever having only used these curves , nor in the absence of any other processing. \nListening to the impact of 0.1 db up or down in the different areas was remarkable. \n\nAfter half an hour id got to something i was v happy with, that appeared \"Louder \" to me and also.....a bit more lows and a little more open on top. Which id call a success.\n\nId brought the Pro q output down 0.4db to compensate the gain increase and printed with no limiter.\n\nIn RX this printed version showed as -7.2 LUFS integrated , -6.3 short term, TP 0.0 .\n\nIdeally id have not touched this again.....i really liked it. \n\nFollowing instructions i then put the L2 Limiter on (modern mode , +0.1 db, TP on and output -0.1) .\n\nTruth be told, once id put the limiter on i wanted to go back into the EQ because i didnt like the sound anymore, i felt the L2 spoilt it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079052715218456768",
    "author": "spectrummasters",
    "date": "2023-02-25",
    "content": "Im gnna have a jog and thnn will go back into the master again trying a diff limiter and tweaking the eq to compensate for the limiter and see what i get . Overall i didnt get any louder LUFS wise but it imo sounds like something id be excited to send out now and i dont feel like i need to go louder than -7.2 .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079061886311616562",
    "author": "spectrummasters",
    "date": "2023-02-25",
    "content": "Oh and , 500hz was the most finicky/hard to call area for me , and the area I want to get much more confident in. Also did the whole 30 mins with no analyser and I can say honestly to your point “The question - what limiter is best for loudness? The answer - good EQ” ……I’ve got a real sense of this now",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079873105901658222",
    "author": "Rollmottle",
    "date": "2023-02-27",
    "content": "That's where loudness begins. If you need heavy lifting to get you there after, you weren't there to begin with.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087293258020945920",
    "author": "VESHZA",
    "date": "2023-03-20",
    "content": "kind of a useless question i guess since it can be subjective, but still interested to hear from yall - \nany of you who master trap/hip-hop with actual HEAVY low end impact and presence - what LUFS do you find most desirable **musically** sound-wise?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087293517212172318",
    "author": "VESHZA",
    "date": "2023-03-20",
    "content": "i personally find -10 / -11 LUFS a very good sweet spot for when it has an overall tight feel but also allows me to keep/enhance low end without truly sacrificing anything",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087297848250466374",
    "author": "Nomograph Mastering",
    "date": "2023-03-20",
    "content": "But I’m not sure there are very many modern trap or hip hop records you could deliver at that low an LUFS",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087299242357440593",
    "author": "VESHZA",
    "date": "2023-03-20",
    "content": "yea i get that too lol, i sure do love my -10 LUFS Wine",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087300062134140969",
    "author": "VESHZA",
    "date": "2023-03-20",
    "content": "the loudness normalization on DSP does make it pretty seemless, i feel like its gotten better in the last 2-3 years, hope i get more stuff like that to work on for sure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087305887170965565",
    "author": "Nomograph Mastering",
    "date": "2023-03-20",
    "content": "Loudness norm works great until it doesn’t, when people have it bypassed (approx 20% the last time I saw numbers), or on web browsers, or smart TVs etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087480383458791535",
    "author": "spectrummasters",
    "date": "2023-03-20",
    "content": "I’m with you , I like the balance and dynamics around -9,5 integrated usually for our stuff. I’ll take it to -8.5 though to be competitive . London standard is probs about -9 ish on average in this genre at the mo.....America goes way harder , up to 6 lufs for travis, Don Toliver , the cactus jack camp with mike dean . I’d like to be comfortable at those levels, solely so that I would feel I’m not compromising as much as I would currently to get there . All that having been said, if you’re using a big 808 with a long sustain the loudness is easy ...as the sustain portion of the envelope  = increased rms",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087482570029158440",
    "author": "spectrummasters",
    "date": "2023-03-20",
    "content": "I agree dale Becker does a great job . From time to time some of Colin leanords masters baffle me for the loudness AND low end . A couple of his for lil baby are a myth",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087491154322399322",
    "author": "spectrummasters",
    "date": "2023-03-20",
    "content": "Seth Firkins (rip) gave some very illuminating interviews with regards to low end and loudness .....I got the sense it was a lifetimes pursuit for him , from a teen with bass bins in his whip . I love his mixes for future. There’s an old dale Becker lecture on loudness in mastering that’s worth a watch if you’ve not seen it before",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1087613122245836810",
    "author": "spectrummasters",
    "date": "2023-03-20",
    "content": "Yes this brought the same discussion to mind for me also. I think it was during this discussion where Jon was insisting he could submit significantly lower LUFS records that would be “Perceived” as significantly louder.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1090731019461730435",
    "author": "ALXCPH",
    "date": "2023-03-29",
    "content": "Is it a good thing? A bad thing? A different thing?\n\nWho is it for? \n\nWho will it affect?\n\nHow will it sound?\n\nIs it even worth caring about, why/why not? \n\nHow can an AI have an end product in mind? Maybe it’s going for a pleasing curve? Loudness? What other music sounds like? \n\nIs it able to listen and compare it to similar sounding music and master it accordingly?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095610558801260625",
    "author": "mixedbywong_my",
    "date": "2023-04-12",
    "content": "i also feel like its because EDM stuff has super loud LUFS and usually wide basses will sound like mush when played thru say a festival or big PA/Club sound . dont forget most EDM bangers are really fast rpms . personally i think coz its fast paced + mix/mastered loud af. just walk up to a DJ mixer at any club/pub, its all redlining all night.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097345354019655691",
    "author": "gab",
    "date": "2023-04-16",
    "content": "Hello! Was just wondering what people's thoughts are on separate streaming + digital masters vs one set of digital masters across both? A mastering engineer I've never worked with before just delivered separate ones (-9 lufs streaming and -5 lufs digital) which I've never seen before and doesn't fill me with the largest amount of confidence - the feeling of the record changes a bit when it's more / less slammed and I feel a bit weird about the idea of two different feeling versions of one record existing in the world. Is there a technical advantage to the separate digital masters approach?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097346655210184755",
    "author": "Rollmottle",
    "date": "2023-04-16",
    "content": "I abide by a \"One master only\" philosophy with the exception being a potentially quieter one for vinyl. I would never provide loudness options to a client unless we discussed it ahead of time. Not providing you with confidence is the exact last thing I want to give you right at the finish line.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097355882318286999",
    "author": "cian riordan",
    "date": "2023-04-16",
    "content": "(those split the diff at 7 LUFS)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099294810369704071",
    "author": "Deleted User",
    "date": "2023-04-22",
    "content": "same with some styles of EDM, it’s fatiguing to listen to when it’s like -5 lufs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099376942437908582",
    "author": "spectrummasters",
    "date": "2023-04-22",
    "content": "Any particular reason (outside of loudness debates )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100524652767486042",
    "author": "Nomograph Mastering",
    "date": "2023-04-25",
    "content": "-7 LUFS wrong, -12 right",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100627823640711218",
    "author": "Rollmottle",
    "date": "2023-04-25",
    "content": "I love the idea of taking a variable out of your hands, so you can focus on the mix and not the loudness. But, kind of a gray area in setting client expectations. With the right team, this would be a solid separation of concerns and allow everyone to focus on their part.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1100661062526828575",
    "author": "popaganda.",
    "date": "2023-04-25",
    "content": "This is my experience/assumption too. I’ve had mixes sound quiet with spot normalization on. I’m learning to accept that it’s on me, and maybe has to do with density/frequency in the intro",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102732246936469645",
    "author": "samvalentine",
    "date": "2023-05-01",
    "content": "Hahah fair enough.\nThis is a synth pop duo. Fairly electronic but a few tracks edging toward rock. Fully independent. Right now I have the tracks hitting -1dBTP and between -12 and -10 ish LUFS. First note I got back on the masters is “why are they -1 not 0”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102733011079942197",
    "author": "samvalentine",
    "date": "2023-05-01",
    "content": "Cool. And just don’t sweat potential distortion from DSPs normalizing? Maybe I’ve read one to many of these lol https://artists.spotify.com/en/help/article/loudness-normalization",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102737910425456681",
    "author": "Nomograph Mastering",
    "date": "2023-05-01",
    "content": "I was serious that the loudest, and seemingly most authoritative voices will give you the kind of nonsense that gives you loudness penalties etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102968515411062855",
    "author": "masteredbyjack",
    "date": "2023-05-02",
    "content": "@Nomograph Mastering I have been conviced to go the Qobuz route and am recreating my daily listening warm-up playlist out of the high res wavs (previously just had an apple music playlist).\n\nYou have any masters of yours that you think feel amazing? Like just your favorite. I have some on there now but would love to add one that you find compelling yourself! Currently have a Ruel track on there (love love love the connection to the vocal)\n\nAlso damn I am realizing how hot everything is...could sorta tell before from some other masters I've collected from mixing buds...but I'm pretty consistently about a db quieter (not true peak but in LUFS) than most of the stuff I'm finding...which I think suits the music I'm working, people are happy, I'm a more dynamic type anyway....but just interesting to note I suppose",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102969887405658194",
    "author": "masteredbyjack",
    "date": "2023-05-02",
    "content": "Nothing at all, just be aware of it and note it in the back of my head I suppose! I don't plan on making stuff louder just because of it, but I wonder what all the factors are that go into making the decisions to making something a certain loudness. My bud uses Dale a lot, and he sent me one of his mixes to practice on (without telling me Dale did it so I couldn't compare)...Dale made it like 1.5db louder than me, and I felt like I was hitting it hard. But Dales was very musical, just loud AF to me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102971061668159571",
    "author": "Nomograph Mastering",
    "date": "2023-05-02",
    "content": "In general the loudness is determined by the REF",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1102973541021925397",
    "author": "masteredbyjack",
    "date": "2023-05-02",
    "content": "Seems that way! And it’s great to be able to tell what sorta the highest levels are doing loudness wise!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113869167548956823",
    "author": "Nomograph Mastering",
    "date": "2023-06-01",
    "content": "You could have street vox pop interviews, mixed with studio interviews, followed by super dynamic sixties music and then later modern Hip Hop at -6 LUFS",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113924369870225408",
    "author": "toohighprod",
    "date": "2023-06-01",
    "content": "What do y’all think about the loudness penalty website? It seems logical to find out how much the streaming services are gonna penalize your song and then just down it down to avoid their algorithm",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113925987080618025",
    "author": "sethearnest",
    "date": "2023-06-01",
    "content": "And along what Cian said, even within Spotify's own ecosystem (last I knew anyway), it's different from their app to the browser to streaming from Apple TV's app to wherever else, i.e. in some places, Spotify doesn't stream its loudness normalized versions, so you could end up at -14 between two -7 songs without the loudness normalization, which, if you're concerned about loudness, will be a bummer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113946288862535860",
    "author": "Zack Hames",
    "date": "2023-06-01",
    "content": "The concept is also intentionally confusing. It doesn’t matter if your song is 1 LUFS or 20 LUFS over -14. They’ll be turned down to “-14”.  Idea being a normalized volume across program material. Not, if you make your song -6, it would have been LOUDER after normalization if you’d mastered it at -13. \n\nIt literally does not matter. Most pointless website ever.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113952684815433818",
    "author": "shaunobi",
    "date": "2023-06-01",
    "content": "Those are excellent points up above. Flip off normalization in Tidal and prepare to be amazed 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1113953061514252288",
    "author": "dcmabon",
    "date": "2023-06-01",
    "content": "Yeah as long as there is people like myself who turn off normalization, a -14 master sticks out like a sore thumb.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117972267830362132",
    "author": "Nomograph Mastering",
    "date": "2023-06-12",
    "content": "Re the level normalization question",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122937135310307370",
    "author": "Rollmottle",
    "date": "2023-06-26",
    "content": "was my thought too...it's easy to impress when you deliver loudness. less so when loudness is off the table. dude actually has to work for it now 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138252884685893726",
    "author": "Rob Domos",
    "date": "2023-08-07",
    "content": "But my waves loudness meter impacts the sound in bypass 🫣",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143691485464756246",
    "author": "Eric Martin",
    "date": "2023-08-22",
    "content": "it’s a 10 year old indie record that’s at most -8 LUFS integrated on the loudest song. I’ll send the files turned down a db or two and call it good.\n\nGreg Reierson at Rareform Mastering does a lot of vinyl remasters and he and I are friendly, he mentioned mostly keeping an eye on the top end.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143695728036819076",
    "author": "Nomograph Mastering",
    "date": "2023-08-22",
    "content": "I was talking to Bach the other day about the loudness wars",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143702212359495761",
    "author": "cian riordan",
    "date": "2023-08-22",
    "content": "I may not have your reps, but I have yet to have an album come across my desk that I prep for vinyl that doesn’t sound better with 5 dB less limiting. I get that our line of work is constantly trying to shovel shit rolling down the hill at us, but I think there’s more nuance than “modern records are loud and need to stay loud otherwise they fall apart.” Vinyl isn’t a medium that was designed with -7 or -9 LUFS in mind… and I have yet to hear a vinyl pressing cut in this contemporary fashion that doesn’t sound like a pile of assholes. I have lots of time for serving the client and the project, being a team player and getting things across the line.. but that’s usually the reality of the business... not what’s best for the Sonics. I think vinyl has the opportunity to sound amazing but modern mixing AND mastering techniques are often getting in the way of that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1144313165744701591",
    "author": "itMIGHTbeNICK",
    "date": "2023-08-24",
    "content": "For those wondering, this song sits comfortable at -21 LUFS and then the peak hits -16 LUFS.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154516626285269052",
    "author": "OJ",
    "date": "2023-09-21",
    "content": "I'm thinking if it makes sense to ask for the highs to be turned down so its \"warmer\"(?). But I am glad the level of loudness",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1158035148256837713",
    "author": "esquinalee",
    "date": "2023-10-01",
    "content": "Hey y’all, question—\nI sent over a Ref for a song at around  -8LUFS  and of course a file with the limiter bypassed along with a photo of my limiter settings to the ME. \n\nWe’re *almost* at a place where we’re happy with the master but some mid resonance is really peaking my ears in the vocals and trumpets that were forward and “on the edge” in my mix but never a problem to comfortably listen to. I mentioned the places where Im wincing at the mid spikes to the ME and he suggested I go into the mix and address those places on the vocal and send it back. \n\nMy worry is that I’ll carve out some of the energy in those places since I’m not actually hearing those areas as problematic until they’re pushed the extra distance in mastering. The master for reference was returned at around -6.8 LUFS and otherwise feels pretty good there but I’m wondering if:\n\n1) I’m hearing my mix fall apart as it’s being pushed harder into the limiter and can and should be preempting this with carving more mids next time\n2)This is something the ME’s usually just deal with as a price of playing the loudness game or if the suggestion for me to address it in the mix is reasonable.\n3)I should just find another ME for peace of mind so i can stop thinking about this mix 😅\n-",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172198535341543534",
    "author": "Will Melones",
    "date": "2023-11-09",
    "content": "Whoever makes the most people cry the most LUFS?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190031022461567017",
    "author": "spectrummasters",
    "date": "2023-12-28",
    "content": "…..might be a silly question , could something still null for frequency content / loudness , whilst any sort of psycho acoustic perceptions were altered. Like say you had two mixes identical in every way but one you changed the pre delay on the vocal Verb slightly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190031356131029002",
    "author": "Jonathan Jetter",
    "date": "2023-12-28",
    "content": "Well, then it wouldn't null for frequency content / loudness (because the contribution of the reverb would be happening at a slightly different time)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1205217208322629692",
    "author": "cian riordan",
    "date": "2024-02-08",
    "content": "Choruses coming in around -5.5 LUFS. Great mix but that shits loud!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1217421423937847376",
    "author": "Bryan DiMaio",
    "date": "2024-03-13",
    "content": "Normalization turned off and all that?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220800507392561222",
    "author": "Edsel Holden",
    "date": "2024-03-22",
    "content": "Is the accepted wisdom here that Spotify normalizes off of one single LUFSi for an album? (All the songs together, this is what I understood)\n\nAudio Accountibility (Dale's thing) dropped a live saying that he has been told by the powers that be that is incorrect - and it actually normalizes off the loudest song on the album. Which is well, news to me. \n\nI often work on records that have very loud moments and very small moments, it is a bummer to realize that is lowering their normalized volume (when streaming form the album).\n\nAnyway, this blew my mind. Normalization sucks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220808187910029322",
    "author": "masteredbyjack",
    "date": "2024-03-22",
    "content": "I know for sure there is a release I did that was released as a single alone, then with another couple songs it seems like it's not the case on Apple Music (the set is normalized as a whole there it seems)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220809319696699502",
    "author": "Rollmottle",
    "date": "2024-03-22",
    "content": "Doing it this way maintains the integrity of the relationships of the relative volumes of songs within an album context vs. normalizing it another way, no? This seems like the right way to do it and I thought where there was already gravity around approaching album normalization like this, instead of normalizing an album like playlists.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220809854738890753",
    "author": "masteredbyjack",
    "date": "2024-03-22",
    "content": "From my understanding it's:\n\n1. Album is given an integrated LUFS score as a whole, and taken down (or turned up) according to the integrated score\n\n2. Album is turned down or up according to the LUFS score of ONLY the loudest song on an album\n\nDale says what's happening is #2 on Spotify\n\nFrom what I've seen with what I've been releasing, #1 is happening on Apple (but maybe it changed)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220810874000773200",
    "author": "Edsel Holden",
    "date": "2024-03-22",
    "content": "Yes - and this is why having a SUPER loud song and SUPER quiet one on the same album is... actually lowering normalized volume for whole record (when played from the record).\n\nSo, maybe having a more consistent volume throughout is worth it in 2024.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220813391023575100",
    "author": "Berlin",
    "date": "2024-03-22",
    "content": "metanormalize them at say -14 and then go from there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220842416337191025",
    "author": "Edsel Holden",
    "date": "2024-03-22",
    "content": "IDK, but I think playlists get normalized like singles (just per song) - so every song is -14",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220842627583184956",
    "author": "Zack Hames",
    "date": "2024-03-22",
    "content": "Just fyi: LUFS measurements have a threshold, so any sound that’s below a certain level doesn’t get added into the average.\n\nUnlikely any song is *so* dynamic it matters - but it is something to note",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220845797621502063",
    "author": "Edsel Holden",
    "date": "2024-03-22",
    "content": "If you want the quietest normalized playback, put out an album with one song at -4 LUFSi and the rest at -12/-13... those quiet songs would be *so* quiet normalized on spotfy\n\nHow do you do the opposite tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222446836120551434",
    "author": "itMIGHTbeNICK",
    "date": "2024-03-27",
    "content": "I’m mainly where you start and also what’s your signal flow for a stereo mix bus and does it matter… the whole EQ before or after compression question. Just something to get everyone’s brains crunching because master sensei is here lol.\n\nBut like I mentioned above. I usually just get a vibe after listening, and usually start getting things to level before I even worry about anything else because I like to get my loudness and then adjust from there. But lately I just throw on gold clip, see what the heck that’s doing, and then I’ll turn it off and throw on my EQ before it to check into my high end. Usually followed by RX 🤷🏻‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222544168904032407",
    "author": "masteredbyjack",
    "date": "2024-03-27",
    "content": "Alright I'm back with another question for the hive mind:\n\nFinishing up an EP today we've been slow-dripping for awhile. First song we did had big drums, tons of low, measures louder (-8.4 LUFS). Mastered and approved before the rest of them came this way. Rest of the songs are sparse, open, beautiful. But accordingly meausre much lower (loudest is -11 LUFS). \n\nSo with the new info Dale posted the other day re: how Spotify is normalizing levels, I thought let's just turn down the louder one a little to see how it fits (it's fine), maybe that can buy us a db or whatever for the other songs when they normalize to the loudest song as long as the creative intent is preserved (it is). And that's cool. But actually a better result IMO was to just ease up on the loudness of the first song (at -8.4 LUFS), it makes more sense in the project being a bit more dynamic rather than having the dense one be pulled down.\n\nQuestion is: will this cause the single version to be replaced by the new album one when going to distro?\n\nI've had masters that we replaced before with a lowered ceiling in projects and all was fine, but the actual master was exactly the same minus the ceiling, so in a single context it would normalize the same. I know to keep exact length to ms, etc etc. \n\nBut the new info Dale posted makes me rethink how to handle this in albums (on Spotify -- on Apple is doesn't seem to be doing that?)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1225910196983828680",
    "author": "Bryan DiMaio",
    "date": "2024-04-05",
    "content": "are you doing digital loopback or analog? do you have normalization turned on?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1226296719881404447",
    "author": "Berlin",
    "date": "2024-04-06",
    "content": "Will be nice to inform my conversations regarding loudness normalization.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1226299800996286505",
    "author": "Nomograph Mastering",
    "date": "2024-04-06",
    "content": "I have been really lucky with the whole loudness thing, I don’t generally field many complaints but I had one this week where a loud song (-5.7) on an EP turned an acoustic song down a lot",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1226301285775708223",
    "author": "Berlin",
    "date": "2024-04-06",
    "content": "for sure, but artists don’t download RX, they go to loudness penalty dot com",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1227630712581128242",
    "author": "Iwan Morgan",
    "date": "2024-04-10",
    "content": "On this, is this the purpose of the new Loudness Penalty app which cn toggle between album/playlist modes.  I've not tried it yet as I've never really got on with Meterplugs although I own most of them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1227632273298423868",
    "author": "masteredbyjack",
    "date": "2024-04-10",
    "content": "Sorta -- I don't think it's really for albums (or at least not making the decisions I'm referring to in the scope of a project), but rather to get a feel for how your mix/master will stack up against other singles or references once normalized\n\nEasy enough to do in Wavelab/RX/etc but I can see it being nice to have that interface",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240353441142800384",
    "author": "Nicky Howard",
    "date": "2024-05-15",
    "content": "I wonder if they've upgraded the algorithm on rebalance? \n\nI have no clue what 'Loudness optomize' is for... surely nothing good will come of it!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240404731306836078",
    "author": "Felix Byrne",
    "date": "2024-05-15",
    "content": "loudness optimize seems like some smart limiter",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240405097650065468",
    "author": "cy (sigh)",
    "date": "2024-05-15",
    "content": "yeah I think it's supposed to trick loudness optimization based on how that gets measured",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240581897910882356",
    "author": "Nicky Howard",
    "date": "2024-05-16",
    "content": "Got it! Essentially, it'll use upward comp to raise low-level sounds below the measurement gate and make the master 'fuller' without altering the LUFS.\n\nInteresting in theory. In reality, the low-level sounds are usually low-level for a reason. Light makes dark darker, nothing is loud if everything is loud, etc...\n\n100% agree. It feels more educational than practical. Could be interesting for experimenting. 🧪",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243710037273219123",
    "author": "aidanthillmann",
    "date": "2024-05-24",
    "content": "Was messing with RX's new Loudness Optimize/Streaming Preview stuff today. So if I'm understanding correctly, it seems like in order to have our masters played as loud as possible through streaming normalization, the quiet sections of the song should be turned up past a certain threshold in order to be included in the integrated loudness reading, with the goal being to decrease the integrated level as much as possible. \n\nNow I had a song with a filtered guitar loop as the intro, and that part was below the loudness threshold shown in the Loudness Optimization module. It was also showing that only 93% of the song was above the threshold and being included in the loudness reading of -9.5 or so. After I ran it, that intro was being compressed pretty obnoxiously, as well as some other down sections of the song, and the integrated went down to -9.7. So I guess I could have gotten 0.2db of extra loudness through normalization, but the upwards compression just did not sound good.\n\nWondering what you all think of it? I guess the moral of the story is to pay attention to the quiet sections of your songs and see if you can make them come in a little hotter, but there's obviously a line there of either gain or compression one is willing to make. Super interesting though and insightful to know all this about streaming! I feel like I can make some moves in mixing to accommodate things like this if necessary.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243716750684721214",
    "author": "Berlin",
    "date": "2024-05-24",
    "content": "Hardest thing about normalization for me is sometimes I lose clients over it because they don't understand what is going on.. no matter how friendly and informative I try to be, they will still believe the blogs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243757288821358653",
    "author": "masteredbyjack",
    "date": "2024-05-24",
    "content": "As we here know it’s of course mostly down to arrangement that a given song will sound loud or not for a certain measurement. Yes mixing can get some apparent level, and we should be able to get a little more. As long as it’s not at the expense at the feel of the art.\n\nThat’s my issue with the RX thing…it’s optimizing a number and not feel, not what’s moving me\n\nAlso important to remember that the streaming services normalize stuff specifically so that songs won’t sound much louder or quieter than one another. So another point to maximize the feel and interest of the music first\n\n(I say this not to the fellow mastering engineers here but to others who peruse)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243770364987707452",
    "author": "Nomograph Mastering",
    "date": "2024-05-24",
    "content": "Why that matters is because the low end drives the LUFS up while driving the perceived loudness down",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244342873000906894",
    "author": "David Fuller",
    "date": "2024-05-26",
    "content": "Lol. But yeah that was worth the hundred bucks, between that and meta normalizer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244354749118152717",
    "author": "Lucky Yu",
    "date": "2024-05-26",
    "content": "thanks so much for this @Nomograph Mastering!! something I also wanted to ask was, do you recommend hard 24db low-cuts at like <30hz during certain mixes/masters as well to essentially reduce LUFS and get a louder mix? I've sometimes found that when I do that it makes my mixes feel like they're in a box (one of my biggest challenges), rather than leave the <30hz untouched",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244697689296474224",
    "author": "Nomograph Mastering",
    "date": "2024-05-27",
    "content": "It’s a pretty technical document but the key thing that pertains to the OP’s question is the filtering that happens before the loudness is calculated. The first stage of pre filtering is a very simple high shelf to account for the shape of the human head, the second is what matters here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244698665390571594",
    "author": "Nomograph Mastering",
    "date": "2024-05-27",
    "content": "The takeaway here is that the lower in frequency we go the less the energy is factored into the LUFS measurement. It’s not ignored, it just plays less of a role",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244718991285551295",
    "author": "Nomograph Mastering",
    "date": "2024-05-27",
    "content": "(You’ll generally get much better mixing advice from mixers than from me,  if I can weigh in a bit where it crosses into my world - perception stuff and loudness etc)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245093134090764308",
    "author": "Lucky Yu",
    "date": "2024-05-28",
    "content": "Thank you for taking the time to go into so much depth here @Nomograph Mastering! It means a lot. Will pay extra attention to the 1500-6000 region for sure and focusing on perceived loudness, as I notice the masters of my favorite Sega Bodega tracks are hitting -9LUFS but feel so much louder than my tracks that are hitting -7LUFS.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245094190925217802",
    "author": "Nomograph Mastering",
    "date": "2024-05-28",
    "content": "Awesome. Perceived loudness is the goal, actual measured loudness is easy and ultimately just gets us turned down on streaming",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1252256220551712810",
    "author": "masteredbyjack",
    "date": "2024-06-17",
    "content": "I don't use that plugin -- but I absolutely will master things loudness matched to the REF just using Wavelab. And certainly listen to level matched often (I like Loudness Penalty Studio for something outside the DAW that's easy). Once I get it to the volume of the REF I'll just use the linked limiting input/output to keep it at the level of the REF to understand if what I'm adding in level and processing is making it better. Of course not on everything, but with stuff that's really hot already I find it very useful! To be sure that we are making it better not just louder, louder is usually quite easy (but can often translate quieter)\n\nAnd I'll turn in things quieter if I think it's better too. Rarely but I certainly have done it with a short note like @Nomograph Mastering mentioned before \"thought x thing that was awesome about this felt better at this density\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1252276186424283157",
    "author": "masteredbyjack",
    "date": "2024-06-17",
    "content": "The two faders in a DAW approach is how I do it in Wavelab, quick and easy. Loudness Penalty Studio I will use to study translation, outside of the creative process",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1254853126280839178",
    "author": "Richie Jelen",
    "date": "2024-06-24",
    "content": "Hello all 🙂 I don't know where to ask Instagram loudness related questions hope ya'll don't mind if I post it here. My issue is that every time I post a video on Insta the audio it's significantly quieter than the original render. I 'master' my stuff in Sequoia then sending it to DaVinci so I can spice up the audio with some visuals. I did loads of reading testing out different settings in both Sequoia/DaVinci but I'm keep hitting the wall... Any idea what causes this or is it a well kept  industry secret that I'll have to die for ? If so, I'm ready. But seriously no need to tell everything I'm fine with directions too then I'll figure it out myself I just don't know where to look anymore. Thank you !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256036285450158090",
    "author": "NoahNeedleman",
    "date": "2024-06-27",
    "content": "It’s all program dependent, but generally speaking, loudness is not the goal here.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275689551532265484",
    "author": "thegreatcarsoni",
    "date": "2024-08-20",
    "content": "The goal isn’t necessarily loud (anymore), I just feel like when I was pushing to make stuff louder I wasn’t liking the results as much as when I just didn’t worry about it. But also aware that my ear-in-training, monitoring environment, and methods of achieving loudness haven’t always been reliable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285633280414056553",
    "author": "masteredbyjack",
    "date": "2024-09-17",
    "content": "I'm no metering guy, so aside from understanding how loudness translates which I still study, same",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290409726663852133",
    "author": "Berlin",
    "date": "2024-09-30",
    "content": "He was pretty much like \"hey.. listen you guys all need to forget about this lufs stuff, it's fucking you up when you think about it. just make the track sound good and yeah if you want to see what it meters at just to know what it meters at, then cool do that, but don't change how the track that you like sounds based on whether or not it comes in at -14lufs.\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290411390221418638",
    "author": "Berlin",
    "date": "2024-09-30",
    "content": "I do feel a shift with my artists this year - since I work with so many independents, self producing, self mixing.. I haven't really had anyone this year ask for -14 lufs. Which is nice. 2020-2023 was kind of non stop for me, with folks asking me about it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290413808103329833",
    "author": "masteredbyjack",
    "date": "2024-09-30",
    "content": "Often arrangements will translate louder when normalized by actually measuring louder and thus being turned down more",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290415492443668631",
    "author": "Berlin",
    "date": "2024-09-30",
    "content": "I felt lucky at the time when these discussions started - to be able to have some conversations with a a producer and mixer that I admire and look up to greatly. They hadn't even heard about all the normalization mumbo jumbo (maybe this was more like 2018 or 19) and essentially said that same thing that gehringer was saying at namm this year. Don't worry about the meter and just make it sound awesome. So that was my take away and what I try to encourage all of my self produced and self mixed artists.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1290415564937891840",
    "author": "Berlin",
    "date": "2024-09-30",
    "content": "And also that there is no such thing as gaming the system - and if there is - it's not about -14 LUFs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293430757716529172",
    "author": "Berlin",
    "date": "2024-10-08",
    "content": "the distrokid mastering optimization to -14 lufs option for 14.99 got a lot of my clients for a season.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1296843658070589513",
    "author": "Nick Stetina",
    "date": "2024-10-18",
    "content": "Good morning mastering friends. Friendly Friday reminder to love thy mix, or as nomo has said \"the job is to love what's in front of us\". \n\nKicking off my day navigating a conversation with an artist I mixed for (who is new to this) and has a mastering engineer in their ear asking if I have a \"less compressed/limited\" mix. I guess already backed off version at 12 LUFS with no overs isn't enough room to use their new compressor the way they wanted today 🙃 \n\nWhat would this person do if they got a mix from Serban thats at -6LUFS with peaks over 0? ( *spoken in bad Chrisopher Walken impression *) “Serban, babyyy, you’ve got it all wrong.”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301977318524194888",
    "author": "Nomograph Mastering",
    "date": "2024-11-01",
    "content": "What do we know about Tik Tok volume normalization",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301980938703736843",
    "author": "Edsel Holden",
    "date": "2024-11-01",
    "content": "my google skills return nothing... when i borwse tik tok, it's all loud and distorted... so yolo the loudness and don't fret about the lossy vibes ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301982055986630836",
    "author": "Nomograph Mastering",
    "date": "2024-11-01",
    "content": "Client is specifically having a perceived loudness issue",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301986136352227378",
    "author": "Nomograph Mastering",
    "date": "2024-11-01",
    "content": "When you select a song, does the tik tok algorithm calculate volume normalization based on the selected audio, or just the LUFS number for the whole track",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301989707986767893",
    "author": "masteredbyjack",
    "date": "2024-11-01",
    "content": "The percieved loudness thing is absolutely a thing. I know for sure I was just down this rabbit hole with an artist about IG (he also basically started blowing up via tik tok so it truly is a big deal) -- the reel was playing back a different loudness than a post which was different than if you selected the actual song to add to the video. All same master, wild wild west",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1301990718835003446",
    "author": "Edsel Holden",
    "date": "2024-11-01",
    "content": "This all makes sense to me, how level and norm work.\n\nIt would be nice to see from TT what they are norming too and how they are calculating it (LUFSi of whole song, LUFSi of selected clip of audio, something else entirely?)\n\nI did a project where one of the requested deliveries was \"tik tok clips\" of certain sections of certain songs - would be been sick to know the norm targets for that\n\nIt is easy to see how much of a minefield this becomes, especially for artists who are using these platforms as a true elevator for success, the wild west for real",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1307060418723708968",
    "author": "Nomograph Mastering",
    "date": "2024-11-15",
    "content": "Hey team, need 3 or 4 ref examples of tracks with “normal” LUFS  but high perceived loudness",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1307060581580279868",
    "author": "Nomograph Mastering",
    "date": "2024-11-15",
    "content": "The kind of thing that sound loud on Spotify with normalization turned on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308155879794933800",
    "author": "Berlin",
    "date": "2024-11-18",
    "content": "It's been a minute since one of these, but I have a indie rock artist being so intense about -14 lufs. About to send it at that level for them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308227213648330783",
    "author": "Nomograph Mastering",
    "date": "2024-11-18",
    "content": "You don’t need it for the density, you can make it as dense as you want at any delivered LUFS\n\nYou need it because lots of people don’t have level norm activated, and platforms like smart tvs don’t even have it as an option",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308314247507214338",
    "author": "vostral",
    "date": "2024-11-18",
    "content": "Can i ask you this @Nomograph Mastering . If you turn off the Normalization on Spotify (my favorite streaming platform), does Please Please Please you mastered sound exactly what you delivered as the final version?? Or is it slightly different due to Spotify processing? Just out of curiosity b/c lately im so addicted to this song!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308495539259703306",
    "author": "masteredbyjack",
    "date": "2024-11-19",
    "content": "I deliver +1db in 32bit on rock tracks....how's that for the -14 LUFS @Berlin",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312055889166991370",
    "author": "nachomaquieira",
    "date": "2024-11-29",
    "content": "Hi everyone! Today I thought I’d write here to ask how you approach mastering an album that you've mixed yourself. Sometimes I work on albums where the mixes are done in a very short time, and other times it takes longer, so the focus changes over time (which is totally natural). Right now, what I’m doing is setting up a mastering session with all the latest mixes (with limiting applied), doing the track list, and listening to the differences between them—things like timbre, balance, loudness, etc. I make notes of what I hear, then go back to the mix sessions to make small tweaks. After that, I export everything without the final clipping/limiting on the tracks, so I can apply those in the final mastering session and then master the album. Anyone with a different approach is more than welcome to share, as right now I’m wrapping up a lot of albums I’ve worked on throughout the year, and I want to stay as sharp as possible to give them a proper finish.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313505554714329189",
    "author": "Dereck Blackburn",
    "date": "2024-12-03",
    "content": "A client recently shared her experience with AI mastering services like Landr and Maastr. While she appreciated the loudness and convenience, she felt something was missing—like the \"thump\" and clarity were overhyped and didn’t translate well in the final product. She noticed a clear difference when comparing AI to professional mastering and now considers using these services as more of a 'gut check' than a final step. I would love to see the data on overall satisfaction with online mastering vs using a real professional. Any insights or resources regarding this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328571446380990545",
    "author": "thegreatcarsoni",
    "date": "2025-01-13",
    "content": "I was able to put some Brauer stuff I learned last month with him into play on this record so it's probably the most lively, exciting, and loudest record I've done. I'm really proud of it, I'm thinking that'll come through no matter what the master ends up being because the mix is -8 LUFS and doesn't really feel it. I'm also offering to connect them with the ME i've used for years, who I trust completely, so they might go with him!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330695292663758908",
    "author": "Will Pragnell",
    "date": "2025-01-19",
    "content": "Great question. Let me try to answer. I suspect this may be where the learning opportunity lies...\n\nI think what matters to me is that 1) the piece is presented in the best way possible to maximise its impact or essence 2) the piece is listenable and that impact is not lost in a wide range of environments / contexts (i was tempted to say \"it translates well\" but I think that's a subtly different thing) 3) the client is happy with the result, and feel confident releasing their art, feeling good about it, feeling it's the best version of what it could be.\n\nI think it's point 3 that gives me pause. You can count my paying mastering clients on one hand, so I'm as \"beginner level\" as it gets, but that said, when i talk to those clients, they share with me that they want a mastering engineer to ensure that their music is going to \"sound right on streaming platforms and translate well to lots of systems\". There's a lot of FUD about loudness normalisation, LUFS, etc. I don't think it's a huge leap to feel that we should also be thinking about common playback devices such as airpods, and bluetooth speakers. For clients who aren't seasoned mixers or record makers, I wonder how they would feel if they listened to their mastered record on a bluetooth speaker and heard that whole parts had practically vanished. Of course I'm also sensitive to not wanting to introduce doubt in their minds unnecessarily.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346910428407660669",
    "author": "Jonathan Jetter",
    "date": "2025-03-05",
    "content": "Not sure Bob's work has much intersection with what mastering means for mainstream commercial genres these days. Pace of work, loudness expectations, how finished the mixes already are, how close the ME often is expected to stay to them, etc etc etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1348024999545405495",
    "author": "sethmanchester",
    "date": "2025-03-08",
    "content": "@Nomograph Mastering just had a Dare track come across my desk as a ref, I’d listened to the record casually without thinking about it technically when it first dropped… but in analytical mode I realized just how fucking LOUD that record is while still sounding totally effortless. I’m sure a lot of the loudness was baked into the mix but just wanted to say it felt like a bit of a masterclass on tasteful, non-fatiguing loudness. Inspiring! I know you can’t talk specifics, so won’t even ask haha.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352717802150301736",
    "author": "Railtown Mastering",
    "date": "2025-03-21",
    "content": "Thanks all. Never heard of them either. Makes me a bit jumpy, like next they’re going to normalize to -14 before shipping or something. 🫠",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355189169005269274",
    "author": "Rollmottle",
    "date": "2025-03-28",
    "content": "Never experienced this. Have you listened to it losslessly, downloaded to device, without normalization, Atmos, etc at the sample rate of the master to isolate as many variables as possible?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355190679218688080",
    "author": "Austin Gordon",
    "date": "2025-03-28",
    "content": "Yep, no difference between lossless and lossy, same with normalization on and off, no atmos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361395753242722569",
    "author": "Grover",
    "date": "2025-04-14",
    "content": "That was kind of my point, my (and only my) understanding of mastering is \"do no harm.\" I produce and write quite a bit too and I'd be a little cross if a mastering engineer was mucking about making massive changes. If an artist and team have made choruses 3dB louder than verses for example, and 3dB or more of limiting is in place, is it appropriate for the mastering engineer to turn up the verses? Sometimes that's what is needed to achieve loudness. My question is less about whether loudness is the goal and more an attempt to describe the philosophy that I was taught, as I understand it. \n\nI think we're saying the same thing?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361403600173269096",
    "author": "Grover",
    "date": "2025-04-14",
    "content": "ahhhh. I was only referring to the final output limiter/clipper that the mastering engineer puts in place when targeting digital loudness. The cutting engineer will just turn your master down if you submit a clipped/heavily limited master.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1367488793468342282",
    "author": "Iwan Morgan",
    "date": "2025-05-01",
    "content": "Anyone using the Streaming Preview module in RX11 regularly?  I've been doing a deep dive recently and happened to see Dale Becker talk about it on the Youtube.  It's a very interesting video, but using this module to rebalance a mix significantly scares me a abit.  I'll regularly raise the level of intros a bit but the changes it made seemed a bit extreme to me.  I'm still on RX9 and don't really need the new features, but the itch to use that module is real.  Curious to hear from the people here mastering playlistable songs whether this is part of your process? My approach is to do it by feel, from a musical place rather than what will beat the LUFS measurement gate.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1367509465779408977",
    "author": "masteredbyjack",
    "date": "2025-05-01",
    "content": "It uses upward compression to make sure that the highest amount of the file is being measured in the LUFs calculation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1367509661376315485",
    "author": "masteredbyjack",
    "date": "2025-05-01",
    "content": "If something is below the LUFs gate and does not count towards the measurement, actually increasing the volume can give a lower LUFs score",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1367509973927723049",
    "author": "masteredbyjack",
    "date": "2025-05-01",
    "content": "Hence the upward compression to make sure more of the signal is measured -- as you can imagine this leads to...not really musical results. It is an algorithm to trick the LUFs measurement scheme. Though if it sounds good it is good, whatever works",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368249345660682261",
    "author": "Victor Garcia",
    "date": "2025-05-03",
    "content": "Is there anybody still comparing mix vs master files using RMS instead of LUFS? I’ve always done it that way. I find LUFS being helpful on digital platforms for playlists and stuff, but not when comparing mix and master of something I’m working on. Specially on songs that need some high end energy or there’s too much weight in the low end, even when they already sound great. Amor para todos ❤️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368286927354073090",
    "author": "Victor Garcia",
    "date": "2025-05-03",
    "content": "I mean A/B between the mix and the master while working on a song. It does make all the sense to me not get fooled by any extra +.5db level. That’s why I have the habit to compare the mix and the master RMS level matched. Not two different tracks; just the mix and the “master” which luckily will be 95% the same. I wonder if someone is still using RMS or LUFS when level matching. Excuse me if my english isn’t fluid ❤️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368307998006575225",
    "author": "Victor Garcia",
    "date": "2025-05-03",
    "content": "I was curious about how you guys match tracks, if ever; rms, lufs, by ear…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1368479580528054354",
    "author": "allearsmastering",
    "date": "2025-05-03",
    "content": "I have to try this! Thank you for the tip! Here i have been only mastering full time for the last 3 years and I find it easier to audition different limiters all the time. Never found a limiter that works most of the time unfortunately. Out of curiocity what is the other limiter that works for you? Finally I used to stack limiters like crazy because it sounded more musical and natural to me. Now its on a song by song case but thanx to all the info here I find myself liking using one limiter with a clipper before it. Bear in mind though that I master exclusively for indie artists that deliver really low mixes and want me to pump them up significantly which is a challenge doing only with one limiter. What are you thoughts lovely people on this matter? Like you get a mix that is on average at -20 to -16 LUFS and they want it to to sound as loud as billboard top 100 tracks 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374760077591842928",
    "author": "bobby k",
    "date": "2025-05-21",
    "content": "random thought i wanted to poll the mastering gang. if a mixer you like and have trust with wanted to do a record where they intentionally leave it somewhat unfinished in the sense of not using any mix buss or sub groups, very dynamic and open and low LUFS, then asks you to do some heavy lifting on the 2bus out of interest of bringing more creative freedom to your plate - would that be an exciting challenge? annoying? how would you feel and what would you do? has this happened to you?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376286992098263201",
    "author": "An Hero",
    "date": "2025-05-25",
    "content": "This is the first time he's admitted to higher perceived loudness values being a \"part of the sound\" instead of something to be avoided altogether",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376287280951591043",
    "author": "An Hero",
    "date": "2025-05-25",
    "content": "In the past, he's sided on Dan Worrall's imo braindead take on loudness, and it's fresh to see him step out of that very small box",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376288802968043631",
    "author": "An Hero",
    "date": "2025-05-25",
    "content": "I'm talking about producing with the intent to not have to increase perceived loudness more than necessary, while \"keeping the meters happy\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376289208368627823",
    "author": "An Hero",
    "date": "2025-05-25",
    "content": "So the challenge becomes, retaining as much dynamic range as possible while maintaining the required perceived loudness",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376312411153240074",
    "author": "An Hero",
    "date": "2025-05-25",
    "content": "I'm not sure if I presented myself incorrectly, so firstly I'd like to apologize for any discomfort I might have caused. \n\nI posted a video in good faith assuming we all agree that generalization is not a productive mentality in a learning space. Regardless of how I or others feel about Mr. Whitesea's videos are irrelevant in my (now clarified) context, and it was in an effort to point out and place a feeler for where we all stand on loudness partially as a creative choice. \n\nI have been trapped in an echo chamber for the majority of my career, looking for a community that shares this belief, one that chooses open mindedness over \"ass kissing\" as it were. Regardless of credits or accomplishments, I'm not here to step on anyone's ego nor am I trying to involve my own. However, while I agree experience does play a role in subjectivity I chose to remain partially anonymous on purpose, as that shouldn't matter ***at all*** when speaking objectively which I assure you was my goal. Again, I offer my apologies and I would like to reiterate that the point of sharing that video is simply to highlight that the notion of \"loudness as a creative choice\" is a step in the right direction.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378340442764214345",
    "author": "Ted Whitten Media",
    "date": "2025-05-31",
    "content": "This is maybe a bit off topic, but hoping for some advice.\n\nThe tl;dr is that I want to know if there's any specs in video for audio peak level,  RMS/LUFS recommendations for dialogue VS music level, etc. so I can help a friend with his documentary. \n\nThe long version: I went to see the premiere of a friend's documentary about the group he created called New England Stonelifting, a group I also am a part of (yeah, I've got weird hobbies 😂). The style of the documentary was kinda like the old skate videos I used to watch growing up, and his style (he's a graphic artist) fit the vibe very well. The dialogue and music, however, were all over the place level wise, and he kept having to go up to the front and tweak the PA so it wasn't too quiet or too loud. He knows I work in music, so he asked if I could help him with the audio portion of the video, so I want to make sure I deliver something that will work well. I've never done anything for video before, so I wasn't sure if there were specific specs for peak level, dialogue loudness, etc, that I should be following. I seem to remember reading a paper somewhere about it, but can't remember specifics. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1378375752679952417",
    "author": "Jonathan Jetter",
    "date": "2025-05-31",
    "content": "FWIW, and this is an indirect answer to your question: My best guess is that the film's audio just needs to be leveled/balanced with more precision, ideally by a professional (i.e. you), regardless of the final LUFS it ends up at and regardless of the final balance between music and dialogue.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382454635582980188",
    "author": "lystell",
    "date": "2025-06-11",
    "content": "I am not a mastering engineer but I could use some guiding thoughts regarding mastering.\n(I am not a mixing engineer either but I mix some songs of ours that get released)\n\nI have noticed that some of these songs are/are perceived as low in level in comparison with some others on Spotify. \nI know I got lots to learn when it comes to perceived loudness etc, but I feel that are some aspects of the mastering for streaming that I need to understand better. \n\nFor example. I got a song mastered where the master measures at ca -8dB. I like how it sounds/feels. \nAs an experiment I tried uploading it on the site loudnesspenalty.com. After analyzing the result is showing that Spotify is lowering it by 5,5dB. That being that Normalization is on in app I suppose.\n\nI'd appreciate some advice in this subject:\n-  what should I draw as conclusion for me as a mixer in this case\n-  what should I think of in the dialogue with ME",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382458278558040254",
    "author": "lystell",
    "date": "2025-06-11",
    "content": "Ergo, I need to up my game in balance, percieved loudness, density",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382462816551964715",
    "author": "Nomograph Mastering",
    "date": "2025-06-11",
    "content": "Not familiar with the second song but easy to check - just match LUFS (turning louder measured one down and see how they feel)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385596285318594614",
    "author": "Circul & Eas",
    "date": "2025-06-20",
    "content": "So far in my short mastering career, the thing I've come up against most is clients just not understanding what they're talking about and asking for things that plain don't make any sense. In this case I have to tell them they're wrong, or just say 'yes dear' and do what actually makes sense anyway and in the end they're happy because the result is what they want even though they still insist on having the wrong understanding of what's going on. (This has happened several times so far in different ways, but in particular about loudness).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385640050854723685",
    "author": "Circul & Eas",
    "date": "2025-06-20",
    "content": "For sure. This is partly what I'm getting at. Trying to understand what a client is actually asking for musically speaking, so that I can then find a useful way to get there. Rather than get bogged down in discussing the details of what LUFS is and how loudness works and so on. \n\nFor example, I'm thinking of a situation recently where a client wanted both 'more bass' and 'more loudness'. I I was trying to express how those things are direct tradeoffs when you're pushing something, but eventually I just adjusted things until they were happy and it worked out fine.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385642682738544871",
    "author": "hyanrarvey",
    "date": "2025-06-20",
    "content": "They always want more bass and loudness unless it’s too loud and too bassy",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385642910715740193",
    "author": "Nomograph Mastering",
    "date": "2025-06-20",
    "content": "Literally had a 35 min call late last night with an A&R discussing loudness on a project. It’s tricky stuff, most engineers don’t understand the ins and outs, even harder for non technical people \n\nRe mo bass mo level I have posted  about that here and there are good solutions. Search for posts from me with the words masking or flashlight",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396968637595914521",
    "author": "Paris Lee",
    "date": "2025-07-21",
    "content": "I just mastered a song with a slammed mix and slammed to hell ref, mixed by one of the main assistants of a mixer who is a household name. \n\nI said nothing. Had doubts that the level was right for the track, but the mix i got had all what i felt was not my ‘taste’ baked in anyway…\n\nSo time to flip the burger…\nDelivered it a half db lower than the ref -6.7 LUFS integrated, but eliminated the rumble they missed, slightly widened (like 2 percent) above 100-200hz somewhere,  narrowed below 14 percent for a more focused feel of the slam drum impact while the width was allowed to breathe…and some eq…\nReferenced the ref. Felt it felt better sent it back. \n\nProducer liked it and then comes the classic ‘well what did you think it was too slammed?’ Then we kinda fall into the conversation…”i mean…i dunno…the loudness of the ref was a lot…i might not have gone that much…” \n\nwhich sparks the “no man you do you! Master to where you feel is right! Forget the ref! Should we call the mixer to change it for you and give you more headroom??” \nThis is where you really have to be careful and really explain it out. Because I don’t know how the mix was constructed. I also know that clients will tell you we want it dynamic till you’re blue in the face, but usually that’s bullshit (not like intentional bullshit…but 8/10 you’ll do it and they’ll want you to make it louder again…)\n\nWhere am i going with the this…it’s always important to stress to the client when they ask you ‘can we do better. What do you think. What should i tell the mixer to do…etc…*never* make any guarantees about *anything*. Always preface your statement with ‘unless we actually go through the process of doing it again, we won’t really know! It may, it may not.  That’s really the truth. And lay out the state of play as it is. “If we were to do it again…lay out all the variables that need to be considered- how the mixbus was constructed for one…and stay out of The business of giving the mixer edicts.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405012856071655487",
    "author": "masteredbyjack",
    "date": "2025-08-12",
    "content": "And dithering a 24bit file twice, if the song is any sort of modern loudness, imperceptible to me, even after studying it quite deeply",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405704877417566228",
    "author": "East End",
    "date": "2025-08-14",
    "content": "There’s a handy setting in the meta normalizer to match alts to the main mix in terms of general level, too. If you’re using the meta normalizer, that is",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405705497088364565",
    "author": "East End",
    "date": "2025-08-14",
    "content": "Yeah I feel that. I don’t really use the normalizer for this function but I figured I’d mention it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405705991877693540",
    "author": "cartierdad",
    "date": "2025-08-14",
    "content": "Yea I do use the meta normalizer to turn everything down relative to each other before processing. Not working with a lot of headroom most of the time lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410629527947968572",
    "author": "BananErMat42",
    "date": "2025-08-28",
    "content": "Q: if you tamper with a mastered track because there was a simple mistake made you can easily fix yourself (lets say there was too much silence at the start which messed up the flow from the previous track), you dont do anything but cut some of the silence and re-bounce (no dithering, no normalization, peaks are all the same, file format is identical), and your label provides the ISRC. What could go wrong? I asked on a different mastering page and was overwhelmed by engineers who seemed to think it was sacrilegious of me to even suggest such a thing. Did they have a point?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415841854632628316",
    "author": "James Cronier",
    "date": "2025-09-11",
    "content": "Does Spotify loudness normalization work from an average across the entire file?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415850368885063770",
    "author": "masteredbyjack",
    "date": "2025-09-11",
    "content": "It gives the entire song one integrated LUFS score which is used to determine how it’s normalized",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415882845754232932",
    "author": "Will Melones",
    "date": "2025-09-11",
    "content": "I do like having normalization activated in the Spotify iPhone app, but can't seem to find it in the settings anymore. Is it forced for iOS at this point?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1415998111486054461",
    "author": "Iwan Morgan",
    "date": "2025-09-12",
    "content": "I know it's not necessarily essential  but the Loudness Penalty Studio app is a nice way of visualising and audio-alysing this stuff. Also noted from it that neither Amazon, Youtube or Deezer allow for relative levels from albums.  I've not tested it but was listening to Joni's Hejira last night and the dynamics of that album are all over the shop, I'd be interested to listen to the normalised version on one of the above streamers to see the effect it has on theflow of the record.  It really pisses me off that classic works of art are messed with this way.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417188319539761193",
    "author": "Bryan DiMaio",
    "date": "2025-09-15",
    "content": "22.5 is generally the maximum before you start compromising in frequencies or loudness",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1418253107590336624",
    "author": "Iwan Morgan",
    "date": "2025-09-18",
    "content": "Anyone ever had problems exporting Vinyl Side A/B parts from Wavelab?  I've rendered the digital 2448 and they null with my process track.  I've rendered Side A/B and Side A is all over the place (relative levels and loudness are different from the ones set for streaming) but Side B  nulls perfectly.  I've exproted all wavs to Pro Tools and lined them up and the same thing happens so it's not timing playback delays in Wavelab.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430546818231697528",
    "author": "SoundsLikeJoe",
    "date": "2025-10-22",
    "content": "Hard to say.  Track sounds fine at the mix but it's -22 LUFS.  Bring this up by 6db and suddenly these Fs are distracting to me.  Sounds like a tube mic really close to the mouth. Spitty.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430688902192173146",
    "author": "Mike Tierney",
    "date": "2025-10-22",
    "content": "P.S, they default to being normalized and yes they’re compressed already",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434237827650158778",
    "author": "Juliette",
    "date": "2025-11-01",
    "content": "Learning a little bit more about the use of limiters these last couple of weeks in order to get your mix louder (not going down the rabbit hole of loudness today though.) I’m curious as to how you all approach limiting on your masterbus, and how much headroom you’re generally leaving before master processing starts, if any at all.\n\nAlso, is all clipping inherently *bad*, depending on how much you’re clipping?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434246940781973719",
    "author": "Slow Hand",
    "date": "2025-11-01",
    "content": "I'm not doing much limiting on my master buss. As I'm working I might be catching 6 dB of peaks, but by the time things are mixed I'm getting the loudness at the source instruments or instrument group. My master buss might be averaging 3 dB of gain reduction at the end. If I have heavy transients from the drums hitting my limiter I'll limit the drum group so it's not ducking the entire mix when they hit.\n\nI don't use clippers at all. To my ears they reliably make things sound like mush, but other people seem to get good results with them.\n\nWhen it comes time to master, I'll turn down my limiter and pass it to the ME. Confident that my balance isn't dependent on everything being smushed into a limiter.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434254748407693402",
    "author": "aliberger",
    "date": "2025-11-01",
    "content": "huuuuge cosign all of this!! the more i've learned to shift energy out of the low mids and really use the upper midrange and even highs, the easier it's been to get loudness and the less i've felt the need to rely on limiters",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434346024092041380",
    "author": "cian riordan",
    "date": "2025-11-01",
    "content": "Nah. I think he’s just referring to just modern loudness",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434354158051262637",
    "author": "Nomograph Mastering",
    "date": "2025-11-01",
    "content": "(copy/paste)\n\nAssuming we're talking about fairly typical rock, pop and Hip Hop then this 3 part strategy covers a lot of ground\n\n1) Make sure the EQ is as balanced as you can get it - most of your perceived loudness comes from the arrangement and mid range focus (2k to 8k). Too much low end will sound bad when you limit. Make sure the relationship between 80, 160 and 320 makes sense (think of them a little like fundamental, 1st and 2nd harmonic).\n\n2) Consider shaving snare transients (and maybe kick transients) with a clipper. This spreads that peak energy harmonically across the spectrum, keeping energy, hiding in the noisey nature of snares and lets the limiter work less hard (I like SIR Standardclip - $25, great metering and responds intuitively). a dB or two of clipping will help the limiter work less.\n\n3) Pro-L2 on the settings below is a great start point for clean and predictable limiting, raising input gain until you get the desired level",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1434550213497982998",
    "author": "Ross Fortune",
    "date": "2025-11-02",
    "content": "@James Cronier yeah it was just a dumb joke, meaning getting it up to modern loudness levels",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1439287921969729646",
    "author": "Val ᶠʳ",
    "date": "2025-11-15",
    "content": "Sometimes, I'm wondering what exactly happens when the gain reduction graph in Pro-L2 is not returning to unity and shows, for example, 1 or 2 dBs of \"constant reduction\" in between peaks. (Like in the picture attached.)\n\nI used to avoid this kind of situation, thinking I was just reducing the whole volume of the track by 1 or 2 dBs, but judging by ear, and listening to the delta channel, it does not seem to be true. It feels more like I'm engaging the \"clipping stage\" a bit more (if we can call it this way).\nIt seems like above 3dBs of \"constant limiting\", then, the loudness hit a ceiling, and the volume is reduced proportionally. (Apparently this behavior change a bit across the different algorithms) \n\nAm I missing something ?\nShould I stop paying attention to this graph, and use the \"compact mode\" of the GUI ? 🙂",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1440066180248371222",
    "author": "Bryan DiMaio",
    "date": "2025-11-17",
    "content": "There's a lot of stuff in there that may be formed from misconceptions, like specific level and loudness values, etc\nIn addition to that as a mastering engineer starting out maybe try and get it all done with an EQ, a limiter, and a clipper when needed. It'll help you way more than adding many character plugins and potentially getting into the dangerous territory of adding something just to add it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1441823705264291840",
    "author": "vostral",
    "date": "2025-11-22",
    "content": "I wanna ask about a couple of technical issues of Big Hits. I wonder why the releases of such big artists would have such issues\n\n- Kali Uchis - Moonlight: It's very harsh in the top end and unbearable. Why was the mastering engineer unaware of that ?\n\n- Ava Max - Kings & Queens: Distortion at the beginning of the track, is it intentional for the loudness of the track, or is it accidental due to streaming platforms ? (i checked on both youtube & spotify)\n\nI'm not trying to bash anyone, i am just curious about them and dont want to make such problems happen",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1447638442228977755",
    "author": "Ted Whitten Media",
    "date": "2025-12-08",
    "content": "This is another way the Reaper batch converter is handy you can either normalize or peak/true peak limit the src'd file to ensure that doesn't happen.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]