[
  {
    "id": "1360648572923678992",
    "author": "Paris Lee",
    "date": "2025-04-12",
    "content": "I’m not really qualified to speak from any technical standpoint of anything discussed here, especially among the giants and don’t want to look stupid …but as someone who DJ’d House, Techno, Drum and Bass etc back in the late 90’s as a teenager in LA on Vinyl (I’m 45 now), watched the transfer to CD’js…(no idol of mine has touched a vinyl in 20 years) and masters for modern EDM artists, I feel like I can speak with some authority about, I dunno, *something*…Back in those days, I guess Ill just say there were a lot of factors that influenced what sounded so good about that era, and what producers did then. The dynamics, combined with the *type of low frequency* content of those genres at that time, along with DJ’s who knew what the fuck they were doing, along with sound crews who worked the rave circuit and were continually hired and worked with the same DJ’s, all contributed so much to this magic rave Vinyl era.\nThere’s nothing that touched those deep kickass lows back then, But That was the style! \nSo much has changed. Producers back then got their loudness from pushing analog desks into the red, Simple Mackie desks, stuff like that. But We moved to an all digital world. I remember when the first pioneer digital DJ mixers came out, I’d put a vinyl on and just be like…this is shit! where’s my headroom?!?! the frequency distribution of the music has also changed, DJ’s also got more concerned with jumping up and down and clapping rather than mixing and gain staging. Clubs started putting limiters on the systems \nMost of these kids doing EDM at high levels-really don’t even need ME’s at all! Their mix busses are so super complex. If they took that stuff off, I’d be totally lost. But they like a little analog processing in a lot of cases. Loudness, they *don’t need*\nClipping, limiting, whatever, it’s the modern thing- If i can help I can- and I tell them not to change a thing- just back off the limiter until the exact moment where the track loses the vibe. Then I go.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369441026338455572",
    "author": "hebakadry",
    "date": "2025-05-06",
    "content": "I did it recently on the new Trentemøller record; even though he’s an insanely talented mixer/producer and has mixed most of his discography so beautifully he came to me asking for a stem approach. We had like 4-6 stems I think.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1390420734832279563",
    "author": "Nomograph Mastering",
    "date": "2025-07-03",
    "content": "That stuff stems from a fundamental misunderstanding of what it is we do. They think we sell processing, or our fancy speakers. But we sell the feeling that it’s done, or could not be better",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341550364796915733",
    "author": "cian riordan",
    "date": "2025-02-18",
    "content": "If you’re mixing into a limiter and would be clipping without it in the chain, you could deliver at 32 with the limiter disengaged and folks downstream could pull back the level with no info lost. Seems extreme for stems but I did this with nomo recently when I delivered for mastering and it made lots of sense.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1344343387112738882",
    "author": "cian riordan",
    "date": "2025-02-26",
    "content": "If it were me, I would use a stem separater to get the vocals out from the instrumental bed, then put the main mix, inst stem, and vocal stem in a session. Line them all up then just snip in the stems for the section with the word.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121055323306856519",
    "author": "masteredbyjack",
    "date": "2023-06-21",
    "content": "Keep in mind I’m still very new to mastering compared to most here, but this has happened several times already to me.\n\nI’d do it on goodwill. Ideally your workflow and back end systems would make this a very small lift. Unless it’s something wild, better to have the client have a wonderful experience, keep their momentum, don’t introduce doubt, double down on their confidence, etc.\n\nI’m assuming it would be something like making sure the levels and overall tone are right if you’ve already mastered them all and they are in the same ballpark, but feel free to tell me if I’m wrong.\n\nAlso “cohesion” is massively overrated to me anyway, I much prefer a creatively interesting and varied listening experience if the music calls for it as long as we are not having wild level or EQ swings or something (sometimes it calls for cohesion to have the best listening experience IMO, so know that too!). \n\nI’ve had multiple instances where an artist’s new “single” release includes their several past singles I’ve mastered too. They didn’t tell me they were doing that, and I mastered each totally alone, just based on the song and their vision. And to be honest those collections sounded totally fine every time as a group of singles, mastered alone.\n\nAll that said, I’d definitely politely educate them on what it exactly entails so it doesn’t happen again in future, and so they can take it into account creatively.\n\nBut of course where you are in your career, the relationship with this client, etc all plays into this. Someone like @Nomograph Mastering could very well see this very differently than me",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085356142399594576",
    "author": "Jeremy Klein",
    "date": "2023-03-14",
    "content": "Love to hear you stepping up your career like that @Edsel Holden ! Awesome work!\n\nA thing i've noticed from getting a lot of sessions (not stems) to mix: _if the producer has a great ear_ and they have been building out the track into that crazy chain they have on the master bus, that chain is probably the best chain for the track and its easier to build off it then to just rip it all out and do it your way.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107806189837877328",
    "author": "Chris Doms",
    "date": "2023-05-15",
    "content": "I feel you @Deleted User. I want people to tell me when I’m messing up. I got a new serving job and I’m making lots of little mistakes right now haha. Not with tables but just the little differences in their systems versus my last job. The other servers have no problem reminding me, and I’m cool with that cus I wanna contribute to things running smoothly and I wanna get better. If I wanna run a business though and I’m the boss.. who’s telling me? Feedback is important to me.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174077230058573894",
    "author": "Nomograph Mastering",
    "date": "2023-11-14",
    "content": "- Re the embedded ISRC I have only seen this a few times (they have big and complicated archive management systems so this is redundant). That said I wouldn't argue, I used this - https://www.sonorissoftware.com/product/isrc-editor/ works just fine (might need to use Rosetta if you are M1)",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328072096470925375",
    "author": "onanisland",
    "date": "2025-01-12",
    "content": "Whoever invented 'stem mastering' has a special place in hell 😂",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328080647842959470",
    "author": "hyanrarvey",
    "date": "2025-01-12",
    "content": "Stem mastering is just heavily discounted mixing lol",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034571500591783937",
    "author": "Nomograph Mastering",
    "date": "2022-10-25",
    "content": "I predict it will be a non paid deliverable expectation like stems in 2 years",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197300802662969516",
    "author": "masteredbyjack",
    "date": "2024-01-17",
    "content": "In certain genres this seems to be a thing. What's the song like? IMO the stem mastering thing is the worst of all the worlds, but that's just how I prefer to work. Totally possible it could be a great experience and the ME crushes it, everyone loves it.\n\nMaybe I'm being preachy here, I'm still pretty new but if you're nervous can you get in touch with the ME? In my (still limited) experience, biasing towards being as collaborative as possible and creatively open is usually a win, especially if the team wanted to go the stem mastering route (even if it's misguided)\n\nALSO should mention, I've had people tell me they sent \"stems\" and it's just the alts (which is what I want, like I said haha)...instrumental, accapella, etc for individual mastering that has the same processing as the stereo master. So could be worth clarifying what they mean exactly",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328072980546195640",
    "author": "Jonathan Jetter",
    "date": "2025-01-12",
    "content": "I've had a few mixes mastered by a well-known proponent of stem mastering. Never has the master come back sounding anything like the mix.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341546603864920084",
    "author": "Felix Byrne",
    "date": "2025-02-18",
    "content": "as long as nothing is actually clipping when you export it then it’s functionally the same as a 24 bit file would be. \n\ni read this as more of a “please give me my files in the highest quality possible” rather than actually specifically needing 32 bit files.\n\njust export your final stems in 32 bit and all will be good in the world",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369355667638583377",
    "author": "hyanrarvey",
    "date": "2025-05-06",
    "content": "petition to rebrand edm stem mastering to EDM co-mixing",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1413563696399126673",
    "author": "cartierdad",
    "date": "2025-09-05",
    "content": "Whats going on guys, been working on a limiter with a friend for quite some time and we’re pretty happy with the DSP, just looking for more systems to test on to see how it performs and if it breaks. Anyone down to do so? I personally think it’s the best sounding limiter for mastering “available” currently but I’m very biased lol",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1002309253832392734",
    "author": "Rollmottle",
    "date": "2022-07-28",
    "content": "Foote Control Systems P3S ME",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029591550033932329",
    "author": "Adam Thein",
    "date": "2022-10-11",
    "content": "I've got Logic and a set of AirPods #SendMeTheStems",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054982868755021824",
    "author": "Nomograph Mastering",
    "date": "2022-12-20",
    "content": "For printing stems etc with analog mix bus",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1059616862285078578",
    "author": "ALXCPH",
    "date": "2023-01-02",
    "content": "Me too, got the thumbs up 22 mins ago 🤟 (Well, it was my mix, and they didn't want to budget for a separate mastering engineer)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075129831559286936",
    "author": "Jeremy Klein",
    "date": "2023-02-14",
    "content": "Got a note from the _music distributor_ that the song cuts off too abruptly, which is exactly how the stems were sent to me. I did have a TINY fade on the track so it didn't click, but i assume they want something even less drastic. \n\nIn scenarios like this, have you ever just put a small ~1 sec reverb on the end of the tracks and just have that be the ending?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078820656386408559",
    "author": "hebakadry",
    "date": "2023-02-24",
    "content": "I had a situation where an electronic synth project was mostly mixed by a top mixer and like 3 songs where mixed by a younger guy...I mastered the whole thing and the younger guy's mixes just didn't really stand up to the very fleshed out other mixer with far more experience.  We discussed it and he was like can you give it a shot with stems and it elevated the mixes and really made a difference.  Sometimes it's ok...most of the time, it's a can of worms.  It just depends.  Not something I do often.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095901216338346094",
    "author": "Rollmottle",
    "date": "2023-04-12",
    "content": "This is a tough one. Couple routes I see. Depends on the relationships and how much it matters in the grand scheme:\n\n1. Flip the burger and do the best you can with what you've got.\n2. Tell your buddy to do better and what to fix to ensure the best outcome.\n3. Bite a big bullet and fix it yourself.\n4. Split the difference with your buddy. Tell him to prep stems and do a stem master so you can have access to \"fix\" some of it.\n\nWould all depend on how much the relationship with the artist matters, if the song rips but the production is getting in the way, end goal etc.\n\nI have done 1,2 and 4 to varying degrees. I'd probably start with 2 though and see what happens.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099377424321482885",
    "author": "masteredbyjack",
    "date": "2023-04-22",
    "content": "I'm still in learning curve here with you too...but I've found some personal mindset success just thinking in terms of \"vignetting\" certain things...like if I'm dipping some upper mids I'm really thinking I'd like to bring out some air and lower mids...like what do I want to shine light on and what I don't? What do I love about this and how can I bring it out in the most musical way? Often just boosting it isn't the most emotionally clear way in my (again, still limited) experience.\n\nI think a lot of my mindset stems from also being really a producer/mixer at heart...I'm often also pushing things I find maybe a little off the beaten path and maybe \"not right\" but are musically interesting...I wonder if I actually would have put MORE emphasis on the horns in your specific case (not if they sound \"bad\" and annoying, but I sorta love stuff that's living on the edge as long as it's giving me a feeling).\n\nI'm shocked sometimes how much the \"problems\" in engineer speak are actually things that I love about records and give them their character",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1119355390128300042",
    "author": "hebakadry",
    "date": "2023-06-16",
    "content": "If getting the inst/acap stems is totally out of the question, Soothe bundled with some EQ and something like TDR’s Nova or TDR's Kotelnikov’s Frequency Dependent Ratio section can help in a pinch.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155200628344230018",
    "author": "Rollmottle",
    "date": "2023-09-23",
    "content": "Wonder if this ME works from the 2 track if there’s no benefit to stem mastering? I view stem mastering as a solution to a problem, not a default choice. Assuming you have bus processing on your mix, deconstructing it into stems seems like a step backward, rather than forward. (Preaching to the choir I know)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197586732212822147",
    "author": "Nomograph Mastering",
    "date": "2024-01-18",
    "content": "Stems are very much a typical deliverable here in LA, needed for live, for Atmos, for remixing etc",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197588863842000926",
    "author": "Nomograph Mastering",
    "date": "2024-01-18",
    "content": "I think with a little planning and care it will just become part of your standard workflow, or at least set up to where you have the option to output stems painlessly if required",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1324814675782926378",
    "author": "Moses Mastering",
    "date": "2025-01-03",
    "content": "yes i agree with you.. you should hear it if its really going over that in a 24bit fixed export.... so that is the head scratcher.. whats interesting as well is the song that is played that is already \"mastered\" in that video shows it going over 0 by a couple db as well. MAYBE HERES An idea haha....the meters are set up different in the settings etc.. that is possible. So that going \"over\" isnt actually going over. I know a handful of people who use different systems, K system, VU +or - etc.. and if your meters are set up that way.. and even on the dorrough hardware it can look like its going over 0 but its not... I HAVE a feeling this actually might be the answer to what we are seeing haha.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328563374216450130",
    "author": "Rollmottle",
    "date": "2025-01-13",
    "content": "Even if they were all in on stem mastering, you’d still want to fix it before creating stems.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469080093203759236",
    "author": "Jonathan Jetter",
    "date": "2026-02-05",
    "content": "And I think mixing good productions is often already similar to what many people would think of as \"stem mastering.\" Rarely a need to do it again at the mastering stage.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470170806490366036",
    "author": "hebakadry",
    "date": "2026-02-08",
    "content": "Yes of course, most of the times I’ve dodged the stem treatment is because I gently recommended hiring a mixer (if a budget exists) because I knew full well what they wanted exceeded far beyond the boundaries of what the stem master could do.  Other times it’s really worked and got us to the finish line.   It’s a tool.  It can be cool or totally & completely unnecessary.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143801923594633217",
    "author": "Nomograph Mastering",
    "date": "2023-08-23",
    "content": "Generalizing my experience with stem mastering is that it happens because the mixer couldn’t get the mix to a good place. And generally that’s because the production has issues",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143935281813258250",
    "author": "Rollmottle",
    "date": "2023-08-23",
    "content": "i've done it a handful of times and every time i've done it, i've approached it as a premaster prep vs. a true mix or a master. sweeten and balance the stems and then print a premaster and master as usual.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143968982391599155",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-08-23",
    "content": "I remember stem mastering being kind of a new fad a few years back here in the DACH region but I don‘t really see it anymore tbh",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1271869177895845919",
    "author": "Nomograph Mastering",
    "date": "2024-08-10",
    "content": "Super important. I’ve been digging deep on high end file transfer systems really to move away from WeTransfer, and client facing ads are a deal breaker",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275946744391139369",
    "author": "Nomograph Mastering",
    "date": "2024-08-21",
    "content": "That is the daily struggle, and building the systems and workflows to manage correctly is a big task",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328560849773924383",
    "author": "Rollmottle",
    "date": "2025-01-13",
    "content": "Stem master should be used as a last resort when the project is so far down the line that it is the most (or only) practical solution. Sounds like that's not the case here. Fix the mix. \n\nLet mixing be mixing and mastering be mastering.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328562839807332422",
    "author": "thegreatcarsoni",
    "date": "2025-01-13",
    "content": "My initial thinking was to insist we nail it in the mix and just do regular mastering, but wanted to check if there's something I'm missing about why they'd want to do stem mastering and not tell me to fix stuff now",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328810442419601511",
    "author": "Matt Huber",
    "date": "2025-01-14",
    "content": "All this talk of stem mastering\n\nBoy does Dolby have a treat for mastering engineers",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369373585550086154",
    "author": "longstoryshort",
    "date": "2025-05-06",
    "content": "i think mastering engineers in the dance space realized there's a between\n\ninstead of charging for a full mix just to rebalance a few obvious things that cant be done in the two track file it was \"send me these 8 stems\"\n\nthere is such a stigma for edm people and having help",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369381130796662804",
    "author": "Rollmottle",
    "date": "2025-05-06",
    "content": "i'm doing a 2 stem master right now. i'm having fun.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374767977186066452",
    "author": "Edsel Holden",
    "date": "2025-05-21",
    "content": "Obviously I am in the minority here but I am open to all workflows, sounds fun and exciting, I love being aligned with any team on any goal ... as I wrote here a few weeks back when we were talking about stem masters \"Finish it through any lense\" - does not have to be the clutch your pearls perfect master workflow for me to be stoked on the work and deliver great music.\n\nNow quick everyone pile on and tell me why I am wrong\n\nEdit to say - some version of this happens to me all the time, twice a week, and always it's challenging and does not change my mindset or goal & I usually enjoy it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1390575164151824404",
    "author": "conordalton",
    "date": "2025-07-03",
    "content": "does anyone split up the mastering process over multiple venues / days? \n\nvery often recently i will run the song through some gear at home and get a rough balance, using headphones to monitor, \n\nand then finish the mastering the next day at the studio on the speakers, finalizing digitally\n\nsomehow it's working great, giving the chance to have more than one \"first impression\" in different environments and systems",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1412921079453716512",
    "author": "Matt Huber",
    "date": "2025-09-03",
    "content": "It would be a lifesaver for a lot of us mixers - stems would see a massive improvement if we were able to feed Ozone a sidechain input",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1417625052656046110",
    "author": "Berlin",
    "date": "2025-09-16",
    "content": "Great solution. Lots of folks are defensive of their playback systems, even total vinyl beginners with the most humble setups.. It's a delicate situation to keep the vibes high.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029591449026695168",
    "author": "Nomograph Mastering",
    "date": "2022-10-11",
    "content": "I predict within a year it will be a part just like stems or instrumentals, a nominal fee added",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030889983264968755",
    "author": "Maxim",
    "date": "2022-10-15",
    "content": "Any hot takes on “stem mastering”? Seems to be very popular here in Germany (as is throwing Mix & Master under the same umbrella).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030893537774030899",
    "author": "Nomograph Mastering",
    "date": "2022-10-15",
    "content": "I’m not a fan. In my experience a mix that needs stem mastering is basically just an unfinished mix. And if you have an unfinished mix then a mastering girl/guy is typically the wrong person, we tend to hear things differently",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030893807581012091",
    "author": "Nomograph Mastering",
    "date": "2022-10-15",
    "content": "Also, modern mixing (mostly from stems) is really stem mastering already",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030896398826209330",
    "author": "Nomograph Mastering",
    "date": "2022-10-15",
    "content": "Mixers are basically stem mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030912033585119303",
    "author": "wald",
    "date": "2022-10-15",
    "content": "So happy to hear another human being articulate this. A year ago a friend was in a bind on a tv show & asked if I could master some tracks for him…no time or budget for a proper mix. I said yes, just give me the stems. Ill ‘master’ it. A year later, due to the success of this producer & word of mouth, Im now stem ‘mastering’ full time for various prominent acts. (We’re talking moving tracks more than 80% to get to finish line)  happy for the work, was just wondering if Im steering my career wrong or inadvertently encouraging bad practices 🤷🏼‍♂️ Guess its just part of the eb&flow of creative business",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030939087827370047",
    "author": "GaspardMurph",
    "date": "2022-10-15",
    "content": "Mixing is about confidence - stem mastering is basically admitting you aren’t confident.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030941358619373619",
    "author": "David Fuller",
    "date": "2022-10-15",
    "content": "I will very, *very* rarely ask for stems. I don't like doing it, and only do it if the mixer can't seem to rebalance something after I mention it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038241534308536431",
    "author": "Nomograph Mastering",
    "date": "2022-11-04",
    "content": "Let;s say there are two types of playback systems in the world",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038516591563907143",
    "author": "hyanrarvey",
    "date": "2022-11-05",
    "content": "He wants the stems its kinda fucked",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1041065596546207844",
    "author": "Chris Doms",
    "date": "2022-11-12",
    "content": "I will definitely be referencing on other systems",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042832476583772180",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "We talked about this here before ISPs matter more because of Codec clipping than converter clipping. I would say that at this point the vast majority of modern playback systems are using digital attenuation to control level, as never get hear full scale on a DAC",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1043044467541803028",
    "author": "Nomograph Mastering",
    "date": "2022-11-17",
    "content": "In a parallel life I would love to study all of these systems, so much to understand and learn",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054982321708740648",
    "author": "Nomograph Mastering",
    "date": "2022-12-20",
    "content": "I’d like that. I have a streamdeck guru coming through in January to get me set up. My focus in the first half of next year will be onboarding manager further and streamlining systems",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067205961091121162",
    "author": "Nomograph Mastering",
    "date": "2023-01-23",
    "content": "Every mastering engineer will make mistakes, it’s just about care and systems to minimize",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078750164015132843",
    "author": "Nomograph Mastering",
    "date": "2023-02-24",
    "content": "Any reasonably well constructed track has an internal balance, a way that it “wants” to be to have maximum emotional impact, connection and translation across systems",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1078821896054906990",
    "author": "hebakadry",
    "date": "2023-02-24",
    "content": "I mean honestly it's sometimes a balancing job and they don't realise it...they just throw a ton of compression and can't figure out what the issue is.  If the stems are in good shape it can work.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079868436085219389",
    "author": "ALXCPH",
    "date": "2023-02-27",
    "content": "The only things I can advise on is based on personal experience. And many people have lots of different takes on this. \n\nBut my advice is to not even worry about the concept of mastering at this point in their musical journey and just make the best music they can, and put as much effort into it as humanly possible to make it sound to the best of their ability. And then slap a limiter on it to get it as loud as they can get it before it starts sounding worse. Make mix changes based on what they don’t like when testing it on different systems. \n\nAnd while it might not sounds like a the weeknd record mastered by sing, it should still be able to be somewhat competitive to other people at the same level. \n\nReps will teach them something new every time. And finding a mentor will also do the same. If they can an attended mastering session with someone who does great work, it could give some great insight about the possibilities and function of what mastering actually does. \n\nThis might be a bit of a hot take, but if a track sounds very far from release ready before mastering, it’s probably not ready to be mastered yet.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086207460861296660",
    "author": "ALXCPH",
    "date": "2023-03-17",
    "content": "OTT translation is weird. On some systems its all energy and Vibe and then on another its just a Sound destroyer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086746145650388993",
    "author": "BillyC",
    "date": "2023-03-18",
    "content": "Nah I think that analogy goes too far. As a mixer it would be more similar to getting a folder of stems with all the producer’s processing baked in and another folder with all the stems raw or processed to some lesser degree. I’m happy to lend my perspective on which is a better place to start from because it still increases the chance of a better mix without going deep into the producer weeds, which to me is the gig.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109218070779666433",
    "author": "Nomograph Mastering",
    "date": "2023-05-19",
    "content": "Yep, things are changing all the time - producers are the new mixers, mixers are often stem mastering, mastering is riding the bleeding edge of level and low end",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122679705527648316",
    "author": "Deleted User",
    "date": "2023-06-25",
    "content": "I might do that, since I’ll have to print stems too eventually",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1137840020888244399",
    "author": "Rob Domos",
    "date": "2023-08-06",
    "content": "To be fair, I’m using a couple of systems, hate the amphions, and know the errors of the amphions in and out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138167336336105562",
    "author": "OMA",
    "date": "2023-08-07",
    "content": "Same way changing buffer sizes causes clips n pops with different systems",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138174994053087232",
    "author": "OMA",
    "date": "2023-08-07",
    "content": "You guys have prolly pretty powerful systems",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143788752133705799",
    "author": "Reedy",
    "date": "2023-08-22",
    "content": "Reading this has reminded me of a horror story I had earlier this year with a client / mastering engineer. It's hardly relevant but I'd like to share it as it's public forum and I'm curious if other people have gone through similar experiences. \nI said to client I could master the record, they said they had read online that the mixer should never master the record and to get a different mastering engineer. I said sure, but I would be happy to give them a test master to compare against the master from the engineer. Sent it off to mastering with the mix, test master and stems for stem mastering. Mastering engineer came back and had *completely changed the character of the record*. Did not sound like the mix I had done and definitely didn't sound like the test master I had done (which was mainly a louder version of the mix). Fine if it doesn't sound like the test master, but not fine if it didn't sound like the mix. We must have sent it back to this guy 3 times and every time it returned the same wildly different character. I told artist let me have another go at the mastering, they agreed and I did another master. All was good until the client brought it into their car and apparently there was something really wrong with the master... To this day I still don't know what exactly was wrong, I tested and tested and did absolutely everything I could to eliminate the problem the artist was talking about, but I couldn't hear the problem they were talking about and every time I changed stuff and sent it back to them to test, the main issue at hand was still there. In the end, they went with the mastering engineer's master. I didn't care that they went with someone else, I cared that my mix work was undone and I went above and beyond to try and repair it and it was all for nothing. Kick in the teeth is that it wasn't really that great a record either and I did far too much work for something I should have declined to work on in the first place.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143801730971217990",
    "author": "Nomograph Mastering",
    "date": "2023-08-22",
    "content": "For anyone reading along I’m pretty sure I’ve posted my take on stem mastering before and in general I’m not a fan",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143801985091522673",
    "author": "Reedy",
    "date": "2023-08-23",
    "content": "To add, it was wasn't clear if the mastering engineer did a stem master or mastered the mix, he never said... But I'm gonna go with it was a stems master. (I only provided the stems because the artist asked me to send it because the mastering engineer told him to do it).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143802106176868393",
    "author": "Nomograph Mastering",
    "date": "2023-08-23",
    "content": "In general I would avoid stem mastering except in very specific cases",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143803637806661642",
    "author": "Maxim",
    "date": "2023-08-23",
    "content": "I will say though that I did a mix recently and they thought it was stem mastering. Given it was only 23 stems I’m not too sure either.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143805362152153098",
    "author": "Maxim",
    "date": "2023-08-23",
    "content": "Oh no worries bro this topic hits close to home. Germany is dominated by stem mastering. It’s very common and I think it’s needed for the type of stuff that’s made here too. \n\nLex Barkey for instance gets credits as a mastering engineer but is practically mixing. Heck he’s even adding delay throws at this point. Same for me too at this point I guess.\n\nNobody cares they just want the record to sound as good as it can. \n\nProducer is the mixer…mastering engineer finishes it all.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143806159443206166",
    "author": "Nomograph Mastering",
    "date": "2023-08-23",
    "content": "It’s basically mixing from stems Castelli style or Pretelosi style",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143806365505175602",
    "author": "Reedy",
    "date": "2023-08-23",
    "content": "Does stem mastering at it’s core come from a place of desire of control?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143806900559949884",
    "author": "Reedy",
    "date": "2023-08-23",
    "content": "What about metal? I know it’s quite big in germany, but my next door neighbour is a major metal producer / mixer and he doesn’t do stem mastering at all",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143860020186984448",
    "author": "ALXCPH",
    "date": "2023-08-23",
    "content": "Lots of people do it here in Denmark too. Its pretty standard in Europe i Think. Lots of people produce/mix and then send it off to a finished for stem mastering.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143926425200623828",
    "author": "Jonathan Jetter",
    "date": "2023-08-23",
    "content": "As a mixer, I've only run into it a couple times. Both times I think it was born out of doubt/self-pressure, not a desire for control. Both times it wasn't a specific problem-solving request from the ME, it was a newer artist, preconceived notions, thinking that \"this is how it's done,\" or \"more options = better,\" and both times it was with a producer who maybe doesn't have fully formed opinions on the subject and didn't weigh in on the decision. Both times I served the project, delivered the stems. Both times I did not love the masters.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1143927127452950579",
    "author": "David Fuller",
    "date": "2023-08-23",
    "content": "I've had to ask for stems maybe twice in 5 years. I don't like it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151239873685102703",
    "author": "masteredbyjack",
    "date": "2023-09-12",
    "content": "Does anyone know how it does this? I’m skeptical it will be useful in anything but a very save-the-day type situation, but I wonder if it accessing the “stems” causes some odd nonsense when it “puts everything back together again”?\n\nCould be that I’m totally misunderstanding how it works though, and who knows it may become essential",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152937025767477280",
    "author": "Jonathan Jetter",
    "date": "2023-09-17",
    "content": "Following up here. What I'm trying to explore is whether it's possible for \"mixer brain\" and \"mastering brain\" to reinforce each other constructively vs. whether it's an innate conflict. That's why it's an open question re: whether I stick with it. \n\nPart of the reason I think there might be a path forward is because so many of the records I mix are already largely processed, and what I call \"mixing\" many people might think of as \"stem mastering\" if they saw how little I was doing. I'm often just nudging some EQs a couple dB this way or that on certain tracks, and doing some fader rides, and making the 2bus processing more constructive and less destructive. So it's still different, but I don't think it's necessarily *as* different of a mindset as if I was doing super-creative mixing and creating the sound worlds. \n\nPart of the reason I think there might not be a great path forward is that I still want to get better as a mixer. And that takes a whole mountain of effort on my part. And if I can't make progress on that, then dipping the toes into the mastering world is a hindrance.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153035001076645978",
    "author": "Nomograph Mastering",
    "date": "2023-09-17",
    "content": "Your observation earlier that modern high level mixing really is stem mastering too matters, like you may be way less in mixer brain zone than some gal who’s starting faders at zero on a 200 ch mix",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155196311721750750",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-09-23",
    "content": "Since I have the utmost privilege to work with a mastering engineer who prefers to do stem mastering for the first time, how should I proceed regarding my mix bus chain? Just tell them what I got on there or let them do their thing? Bc the artist is really happy with the mix and I honestly don‘t want the sound to change too much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155199403838156880",
    "author": "Will Melones",
    "date": "2023-09-23",
    "content": "I do believe that your stems should come as close to adding up to the approved mix as possible.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155219001098649650",
    "author": "hyanrarvey",
    "date": "2023-09-23",
    "content": "I hate stem mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155252680713846794",
    "author": "onanisland",
    "date": "2023-09-23",
    "content": "if that's the case, don't send stems.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155253079764119573",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-09-23",
    "content": "The artists wants me to send the stems. I guess he probably only works that way idk",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155254835122274397",
    "author": "Nomograph Mastering",
    "date": "2023-09-23",
    "content": "Not into this. Either honor the artist’s wishes to work with this girl/guy the way they work (maximum cooperation) *or* if you feel strongly make a case to the artist why you think it might be a bad idea to stem master",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155255677267230902",
    "author": "onanisland",
    "date": "2023-09-23",
    "content": "First, I didn't know this was for a client, I know Matthew as an artist (so my OG comment was based on that assumption).\nHaving heard Matthews songs, I don't think they need that much work (let alone stems).\nSecondly, personally I include in my deliverables (main mix, alts, stems, multitrack,etc) so the artist can do as they please (and to future proof their record).\nThirdly, I base my opinions on how I operate, I've been in this positions multiple times, bought the plugins, compelted the projects, moved on. no biggie",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157400219449835571",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-09-29",
    "content": "So we got our first stem master back... the mastering guy turned up the vocals in the verse and pre quite a lot on a mix that was okayed by both the artist the producer \nI will try to accumulate myself to the master over the weekend but it would it be reasonable to ask him to just master the stereo mix instead?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1157402731452055562",
    "author": "onanisland",
    "date": "2023-09-29",
    "content": "I mean this situation supports my idea that stem mastering crosses into mixing territory lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197297984350715974",
    "author": "isaac joel",
    "date": "2024-01-17",
    "content": "So I was just asked to send \"mastering stems\" and looking around this is apparently a thing? I thought that was just called mixing? It's not my record and I'm getting paid so I'm going to do it but part of me is a little nervous about having my name associated with \"mixing\" and then handing over stems to the whole song. Is this new? I've honestly never heard of this until maybe a few months ago",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197303082187493556",
    "author": "isaac joel",
    "date": "2024-01-17",
    "content": "yeah it's someone that's young and doesn't have a ton of experience so i'm trying not to be \"that guy\" and tell them they should go with a different ME. i do know all parties involved but it just seems a little weird and trying to introduce another cook in the kitchen. they did say they wanted VOX, DRUMS etc so not alts though I typically include those when i deliver as well. \n\ni'm willing to be proven wrong but i'm curious where this trend came from? i do know that one time i was asked to \"master\" a hip hop record and was then given the beats with all the vocal stems and the expectation was that i completely mix the record 🤷‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197564703577223245",
    "author": "Rollmottle",
    "date": "2024-01-18",
    "content": "Are stems not a standard mix deliverable nowadays? Figured it was and assume it’s priced in. Time to raise your rates?\n\nStem mastering is definitely a thing and the norm in certain genres. I’ve only done it in the rarest of cases as a problem solver, not because it’s better or preferred (I think it’s worse, but it is a tool). This isn’t always possible for every project but this is where having relationships with ME’s you trust come in to play so you can include the master as part of your deliverable to ensure the integrity of the mix.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1197586482014208191",
    "author": "isaac joel",
    "date": "2024-01-18",
    "content": "yeah i'm very much a small fish in a small pond so generally artists aren't asking me for stems with mixes, though now i know that i should account for this or offer it at an adjusted rate. this is solid advice though, thank you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1233170208957403166",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-25",
    "content": "it's not at all as elegant. You'd have to export source files, run them through an external (free) software called Ultimate Vocal Remover (which you should learn no matter what since it's the cutting edge of AI separation/echo removal etc) and then re-import stems",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1234610706356375642",
    "author": "Conah Tucker",
    "date": "2024-04-29",
    "content": "I guess it all stems from seeing other people's mastering studios with tens of thousands  in equipment and comparing myself to them. I suppose I'm only a year in compared to decades. Had a few conversations in the past where clients sort of expect hardware which I've found quite annoying too. Definitely think digital is the way forward, but it sure would be nice to twist some knobs! Ahahaha!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267888987041828974",
    "author": "masteredbyjack",
    "date": "2024-07-30",
    "content": "@Nick Stetina have never actually used autogain on equillibrium -- there was some issue I had long ago with Limitless, and every once in a blue moon (like 1 in 100?) a plugin will forget a setting (luckily I have multiple backup systems so it's never caused an issue).\n\nIf I had to try to pinpoint when it's happened it seems to be when I close Wavelab with that plugin window open? But that doesn't sound like it would be the case with you. Haven't had any issues with it with 12 that I remember",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1274404411774341213",
    "author": "Will Pragnell",
    "date": "2024-08-17",
    "content": "I have a track here with a kick that is almost all sub, very few harmonics, and is also way too loud. As it happens, this is a mix that someone wanted feedback on before sending for mastering, so I can help them fix it, but I also took it as an opportunity to do a practice master on the current version. Best results so far have come from setting up a dynamic low shelf in Nova, which helps to take the excessive low end boom out of play, but obviously doesn't do anything to bring out the harmonics higher up and make the kick audible on smaller systems. Any suggestions for other things I could try (other than maybe getting crazy in RX)?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1275972691836403733",
    "author": "masteredbyjack",
    "date": "2024-08-21",
    "content": "This a million percent. But to sorta piggyback off what @cian riordan said earlier, I’ve actually had some (unwitting) success in these situations using language like a producer would, tapping into producer brain\n\nI’m not sure what to make of it, and I didn’t even do it intentionally, but it’s seemed to have worked as a reset on the uncertainty spiral and things went smooth\n\nAnd of course I’ve used all the wild stuff to make it happen (pulling stems apart with AI and putting it back together to be one)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1279939167035588703",
    "author": "Ted Whitten Media",
    "date": "2024-09-01",
    "content": "Hmmm, I've only used superclips for a sort of stem master, but I should try and see if that would work, interesting idea.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284576184893444096",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-09-14",
    "content": "Currently preparing stems for stem mastering on a track where there is reverb on the masters - is it better to still bounce out each stem with the master processing active or to bypass the reverb and send the ME a screenshot of the settings so he can recreate it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1311216081771171891",
    "author": "vostral",
    "date": "2024-11-26",
    "content": "Hey everyone. I am coming across a issue related to stems. I exported 30 stems (48k, 24bit) and sent them out for mastering. After bouncing, i had re-imported back to Ableton to double check, and they were all good. My system is Windows, whereas the ME's is Mac. When he imports the stems to his session, some of the files do not show up. All the stems are sent through Gg Drive and not compressed in Rar archive. I checked on my friend' Windows laptop and the files are not broken as well. Anyone has encountered such issue?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1311649366984888391",
    "author": "vostral",
    "date": "2024-11-28",
    "content": "Just want to report back how i managed to handle the issue. I imported all those 30 stems to Ableton and bounce them again and now they're working on Mac. How weird this is 🥲🥲",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328559930126630932",
    "author": "thegreatcarsoni",
    "date": "2025-01-13",
    "content": "Hi guys, I've been mixing a friend's album and we've done a couple rounds of revisions to everyone's satisfaction- the report back is that everything is sounding good but then all of a sudden there's a bunch of \"problems\" that get brought up last minute to the tune of \"you don't need to worry about this stuff, we'll just have you export stems for a stem mastering\". This mindset makes me really nervous, like if they want it brighter and the snare to snap a little more and stuff, that should be handled in the mix. I don't want to do endless revisions, but if you tell me after 4 rounds of revisions there's additional stuff you want changed, I'd rather just do it. Why do a stem master? Feeling like it's getting into the weeds and over-complicating things but maybe I'm missing something about what's expected at the mastering stage",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328561968084160595",
    "author": "masteredbyjack",
    "date": "2025-01-13",
    "content": "Is there a chance they had already decided that stem mastering was the way, even before the mix was done?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328562582495297676",
    "author": "masteredbyjack",
    "date": "2025-01-13",
    "content": "Is it a situation where you bring up that it’s probably best to nail the mix and then do a stereo master? Or are they stem mastering all the way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328562785180844034",
    "author": "masteredbyjack",
    "date": "2025-01-13",
    "content": "I ask because I often find people who do stem mastering…what do you know think it’s great\n\nSo I wonder if the mastering engineer is saying it’s better, etc or any other number of things that don’t have to do with your mix",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328563314237771788",
    "author": "onanisland",
    "date": "2025-01-13",
    "content": "could be they heard someone say \"stem mastering\"is better or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328563772998156341",
    "author": "onanisland",
    "date": "2025-01-13",
    "content": "If it's a friend I'd say something like \" I appreciate you but I'd be happy to revisit the mix if something is not sitting right with you, rather than having you unncessarly spend more on stem mastering as I really don't think it's neccessary here. Just shoot over the notes or give me a call and I'll get right on it...\" something to that affect...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328569298138173511",
    "author": "masteredbyjack",
    "date": "2025-01-13",
    "content": "I’m no proponent of stem mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328569833310126151",
    "author": "masteredbyjack",
    "date": "2025-01-13",
    "content": "And honestly if you’re sending to some heavy handed stem mastering, it really might not be worth going back and forth about subtle things in the mix, it’s getting reinvented anyway",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328569945247715388",
    "author": "masteredbyjack",
    "date": "2025-01-13",
    "content": "From their perspective I mean. They could be thrilled with the mix, just used to stem mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328570505355067506",
    "author": "thegreatcarsoni",
    "date": "2025-01-13",
    "content": "I'd be bummed if they took this mix that's feeling  so good and went super heavy-handed with an EDM-style stem master. It's a rock record, very RATM stuff so i don't think it really needs a super polished touch but i guess that's on them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328577842933665906",
    "author": "Jonathan Jetter",
    "date": "2025-01-13",
    "content": "Stem mastering is admittedly more common in that world (still not my vibe….). Is there any chance it’s going to one of the mostly-EDM MEs who insists on working from stems?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328578367972442142",
    "author": "thegreatcarsoni",
    "date": "2025-01-13",
    "content": "No, stem mastering was suggested as a means by which an ME could have more control to \"shape it to that full radio ready sound, address these issues, and take the burden off [my] plate\". Thus my feeling like that was kinda backwards",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328580110038732924",
    "author": "Jonathan Jetter",
    "date": "2025-01-13",
    "content": "Well, it could be all sorts of things, right? Off the top of my head: Maybe that's his usual process and he's legit used to working that way. Maybe he's curious to try and work that way. Maybe he received some sales pitch from some stem masterer. Maybe he has concerns about the mixes but for whatever reason won't be transparent about them. Various other things too.\n\nThere's a whole spectrum of possible reasons, some of which come from a healthy artistic place (even if the workflow may be flawed), others of which perhaps don't.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1328812490930262108",
    "author": "masteredbyjack",
    "date": "2025-01-14",
    "content": "More speakers....AND stems? Even better",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1329530382218956800",
    "author": "Théo Quayle",
    "date": "2025-01-16",
    "content": "Do you guys have a rate structure for alts when they start getting crazy?\n\nI just had a client request all the usuals (INST, ACA, TV) in 16/44, 24/48, 24/96, and mp3s of each. Plus master prints on 6 or 7 stems \n\nIncluding the mains, we’re looking at a 23 file deliverable package for a single, but it seems ridiculous to charge them 20x my usual per alt rate so I’m thinking of capping it off somewhere. \n\nAre you guys packaging alts or capping the cost on them in any way to keep things reasonable?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330646626548580405",
    "author": "Temporal Blue",
    "date": "2025-01-19",
    "content": "Stem mastering vs 1 track mixing who wins? 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330695292663758908",
    "author": "Will Pragnell",
    "date": "2025-01-19",
    "content": "Great question. Let me try to answer. I suspect this may be where the learning opportunity lies...\n\nI think what matters to me is that 1) the piece is presented in the best way possible to maximise its impact or essence 2) the piece is listenable and that impact is not lost in a wide range of environments / contexts (i was tempted to say \"it translates well\" but I think that's a subtly different thing) 3) the client is happy with the result, and feel confident releasing their art, feeling good about it, feeling it's the best version of what it could be.\n\nI think it's point 3 that gives me pause. You can count my paying mastering clients on one hand, so I'm as \"beginner level\" as it gets, but that said, when i talk to those clients, they share with me that they want a mastering engineer to ensure that their music is going to \"sound right on streaming platforms and translate well to lots of systems\". There's a lot of FUD about loudness normalisation, LUFS, etc. I don't think it's a huge leap to feel that we should also be thinking about common playback devices such as airpods, and bluetooth speakers. For clients who aren't seasoned mixers or record makers, I wonder how they would feel if they listened to their mastered record on a bluetooth speaker and heard that whole parts had practically vanished. Of course I'm also sensitive to not wanting to introduce doubt in their minds unnecessarily.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330698795666640987",
    "author": "cian riordan",
    "date": "2025-01-19",
    "content": "That — afaik - is not undoable at the mastering stage. I even struggle with it in mix stems I get.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341542860855578748",
    "author": "thegreatcarsoni",
    "date": "2025-02-18",
    "content": "I just had a client request final stem delivery and mix versions at 32 bit depth but we did the mix at 48/24. The single was already mastered from a 24 bit file and was approved. Is there any advantage to exporting 32 bit files for them? Happy to do it either way but just curious for my own knowledge if that actually helps anyone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1344343313674797058",
    "author": "Ted Whitten Media",
    "date": "2025-02-26",
    "content": "Can you stem seperate it, remove that one word, then toss the stems back together? It's a little cumbersome, but the best stem seperation I've used so far is demucs, and it's free. Even beats out RX and Spectralayers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1346648717184466954",
    "author": "Montano Mastering",
    "date": "2025-03-04",
    "content": "Fair enough! Maybe this signals a change over here as well. I have so many systems set up with my current workflow but some are becoming… irksome",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1353432948178681949",
    "author": "Gerhard Westphalen",
    "date": "2025-03-23",
    "content": "I've had some issues with playing flac files locally which I think stems from the player decoding them and sometimes ending up with glitches between tracks so I'm not sure if it might be something similar",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369360162372063382",
    "author": "masteredbyjack",
    "date": "2025-05-06",
    "content": "I’ve never understood the point of stem mastering. If you wanted to give that much control just send session! But people make it work, what do I know",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369399501273436280",
    "author": "onanisland",
    "date": "2025-05-06",
    "content": "Ofc I didn't want to generalize but most stem mastering experiences have been unpleasent, sometimes requiring more work than sending the whole session over",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369399649118715964",
    "author": "longstoryshort",
    "date": "2025-05-06",
    "content": "never feels *right* havent had a great end product using \"stem mastering\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369403025369858209",
    "author": "Berlin",
    "date": "2025-05-06",
    "content": "my first experience stem mastering was jumping into it not knowing what to do.. artist gave vocal, drums, bass, guitars, keys and “everything else”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1373507046363631779",
    "author": "Paris Lee",
    "date": "2025-05-17",
    "content": "Nice one! \nI’m gonna check this RME out then…i want a new all in one with a small footprint that kicks ass on my Desk.\n\nApropos of nothing \n\nTwo Best all in one systems I’ve ever used \n\n1) Prism Ada 8 (sold it waaaaaaay too early in my mastering life… cuz i got sucked into the antelope hype machine.\n\nCould totally still have been using it all this time… and do now. have an ol faithful Prism DA-2 at the spot in use (thx @Nomograph Mastering)\n\nDont fix what isn’t broken, kids…\n\n2) Merging HAPI (original Ardatech AD chip card with the newer ESS Pro DA card)\n\n…still got it! \n\nGot sucked into the Lavry vortex…but coming out of it…and forgot how goddamn good this was till I plugged it in recently.  \nOnce again…things were great. Saw a gold thing…thought…hey-I like Gold things..! Back to maturity.\n\nGlad I brought the unit back out…\n…Wanted to compare it to @huntleymiller standalone Frank Lacy build Ardatech Ad I just bought off him!!! \nthe frank one, unsurprisingly, is better). \n\nStrap that up on the RME AES and run a simple USB cable sounds like a breath of fresh air. With the Atmos stuff, life is too complicated!!!\n\nTried combining both worlds after having them seperate. Mistake! \n\n(And yes you can DM me if you’re digging for gold and  want a Savitr and a Quintessence I’ll give a decent deal if you buy both)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374487477418594425",
    "author": "masteredbyjack",
    "date": "2025-05-20",
    "content": "But if anything of the genre \"spotify sounds fine but the master is clipping my phone/car\" and it's happening when the volume is turned all the way up, usually it's a digital file peak thing, that the master is playing back near the edge of what these systems can handle",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1374806257201840299",
    "author": "Edsel Holden",
    "date": "2025-05-21",
    "content": "mix / stem master / master AKA - FINISH",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377107622112788610",
    "author": "noahc",
    "date": "2025-05-27",
    "content": "when these cars pull up to the beaches its shrill AF from the outside with the way those systems sound. Maybe fun for the user lol.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386862687127863429",
    "author": "Rob Domos",
    "date": "2025-06-23",
    "content": "I’ve noticed that lalal.ai tends to strip noise from stems and does so inconsistently. Is there a good solution to just remove vocals and create an instrumental stem without also having to inadvertently denoise the instrumental?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1386872917035323422",
    "author": "Ted Whitten Media",
    "date": "2025-06-23",
    "content": "Hmm, doesn't it just put noise in an \"other\" stem? So when played with whatever instrumental stems it should sound pretty seamless. Totally depends on arrangement though I guess.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1390585694895870052",
    "author": "conordalton",
    "date": "2025-07-03",
    "content": "i'm appreciating changing the workflow structure a bit, somehow it changes my understanding of the song to see it from two angles / on two different days / on two different playback systems, a bit disjointed to begin but somehow it's helping me at the moment get results that i really like, a new way to see the process for me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392990298170462300",
    "author": "Berlin",
    "date": "2025-07-10",
    "content": "Vinyl itself has its own limitations, and most of them are in the playback, and not the cutting. The groove can contain much more information than the playback needle can handle (i.e. out of phase sub signals - they can likely be cut, but they can't be played back well on most systems). - I say that to say that Lacquer can handle anything that you want to give it. \n\nMy suggestion is to link up with a cutting engineer - whether lacquer or DMM, communicate your sonic desires, and let them do their work. If you can find someone great that's local to you, perhaps you can attend and put your ears on a test cut.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1396449569000128593",
    "author": "TEYAH",
    "date": "2025-07-20",
    "content": "I also have another question based on a hypothetical situation.\n\nLet’s say you receive a final mix” and the artist likes it but there are pretty noticeable problems with the mix or even the recording It’s self.\nDo you just do your best to fix it and keep them happy and not say anything, have an open conversation about some things that could be a fixed in the mix or ask for stems?\n\nI understand the relationship with the client and or mixing engineer is a factor but I am curious about the approaches \nsome of you would / do take when this situation arises.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1405533991561466047",
    "author": "masteredbyjack",
    "date": "2025-08-14",
    "content": "The deeper point of this to me, how it relates to record making in 2025 and forward is that there is a massive amount of uncertainty, options, comparison, referencing, all of these things that work against getting a record finished and making it the most compelling thing it can be. If we can add momentum and excitement and a sense of \"finished\" then that's what it's all about. And sometimes that's as much about how the interaction goes as the sonics. Maybe more I'd argue. And our systems on the back end being organized can keep our eye on the ball to deliver that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1411882430658379827",
    "author": "masteredbyjack",
    "date": "2025-08-31",
    "content": "If the situation is as you describe, I’d get stems and basically just mix it. Or whatever. If it’s really that bad, in the sense it takes away from the music. Say something! I have before",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1414761460655063070",
    "author": "Halliemmelton",
    "date": "2025-09-08",
    "content": "Improving systems always rocks!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1440073050774048871",
    "author": "cian riordan",
    "date": "2025-11-17",
    "content": "You're not there yet, not far along enough to build systems.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1443288481811009678",
    "author": "Railtown Mastering",
    "date": "2025-11-26",
    "content": "Confident. Same issue has been replicated on multiple systems. Mine, and mixers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1443319573360148601",
    "author": "Berlin",
    "date": "2025-11-26",
    "content": "And we know it’s not your playback system, since you’ve QCed it on multiple systems now. @Railtown Mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1469079731784912978",
    "author": "Jonathan Jetter",
    "date": "2026-02-05",
    "content": "I had a few mixes get stem mastered by one of the bigger proponents of stem mastering. Was not a fan at all.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470161294287175733",
    "author": "hebakadry",
    "date": "2026-02-08",
    "content": "Hey Jack, just to chime in here re: stems. Thanks for the kind note ❤️  But just to clarify my approach.  I definitely don’t come flying out the gate demanding stems.  If anything I try really hard to avoid it or have a long sobering discussion with the client about it if they are really insistent.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470161496074879172",
    "author": "hebakadry",
    "date": "2026-02-08",
    "content": "I do a stem master maybe once or twice a year and it usually comes with a whole host of criteria and questions before I really commit.  Almost always there’s no mixer involved, almost always I have done a stereo version before and they felt the need to go deeper and almost always it’s with a client I know rather well.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470163644359643208",
    "author": "masteredbyjack",
    "date": "2026-02-08",
    "content": "Ah yes, I actually didn’t mean that you work from stems. Did not mean to imply that! Rather I meant that I’ve heard from people who have used you that the approach tends to be (and again do not mean to imply it’s always) more transformative than other engineers. They say this is a good way! And I’m a big fan of your work\n\nI too will do something like that when it’s asked or called for, recently a mixer I work with often (without stems) wanted me to work from stems for a certain reason on an album. Down.\n\nOr maybe a few times a year a producer will want me to work from a session for a certain reason. In the vein of what @oaklandmatt was talking about a while back. \n\nVery not standard. But falls into the get the record to the finish line part of the job, when it’s the right move it can work great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]