[
  {
    "id": "927051207258816573",
    "author": "cian riordan",
    "date": "2022-01-01",
    "content": "Agreed -- be critical of everything. Be critical of things that are expensive for the sake of being expensive. Things that are just  instagram ads shilling to newbies. Critical of  Greg Wells pandering to whatever his base is. But recommending a 4k converter based on 'audible conversion quality' isn't helpful if the consumer doesn't have a million other ducks in a row first -- room treatment, adequate monitoring, proper gainstaging, etc. Jon has that figured out, so it makes sense for him. But when people come into a forum with questionable knowledge and background in music production asking what's the best converter, I think it's fair to ask some prying questions before just making blanket recommendations on what one person heard or not. I have plenty of semi-OK stuff that still gets used on the regular, and plenty of expensive gear that I would happily toss out of my workflow. They're all just tools. And whether its bougie DW Fearn or a black-friday Acustica plugin, , if it works for your workflow and gets you results you're happy with, then its worth whatever money you're willing to pay for it.",
    "reactions": 23,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1256441468013252638",
    "author": "NoahNeedleman",
    "date": "2024-06-28",
    "content": "@BoozleBAM \n\nCouple things. 1) if someone’s name is in purple, it means they’re a moderator AND they have real actual credibility, not only on this server but out in the real world. \n\n2) @Nomograph Mastering just mastered the number 1 song on Billboard. If that doesn’t make you wanna stop and think about why he’s spending time answering your questions or encouraging you to ask better ones… well you might be in the wrong place. \n\n3) you can get answers to questions like “should I use omnis for overheads” on Google. So Rauirí’s attempt to push the conversation toward more important things is a reflection of his care for the quality of conversation on this server. The mods here take great care to make this place a valuable place to spend our time. We’re trying to create a place we needed when we were exactly where you are.",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "857827337578872842",
    "author": "Slow Hand",
    "date": "2021-06-24",
    "content": "You can sneak in some early reflections from a reverb to add space around the vocals without sounding overtly spacious. That should give the sound some depth without reading as “processed”.\n\nBjörk is notorious for having her vocals bone dry. Based on what you’ve described I might give her a listen for  suggestions on how to proceed.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033526268953628792",
    "author": "Rollmottle",
    "date": "2022-10-22",
    "content": "he's hearing the the reflections off the brim of his top hat",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "914597433802113135",
    "author": "peterlabberton",
    "date": "2021-11-28",
    "content": "I’ve got one of these:\n\nhttps://www.bestbuy.com/site/apc-back-ups-pro-1500va-10-outlet-2-usb-battery-back-up-and-surge-protector-black/6165881.p?skuId=6165881&ref=212&loc=1&extStoreId=116&ref=212&loc=1&gclid=Cj0KCQiA7oyNBhDiARIsADtGRZZnoUBtlJyw5fH-wd8vvKIAGwL46-kunQCf0mPpQlS20wCTLMef5wsaAvZ8EALw_wcB&gclsrc=aw.ds\n\nEverything for my computer and hard drives runs off the battery power outputs on here, works great. AND I put it to use over the last few days in an unexpected way: power was out due to wildfire risk here in California, and I used it to charge my phone, grind my coffee, and inflate an air mattress.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1275477085854630062",
    "author": "Jonathan Jetter",
    "date": "2024-08-20",
    "content": "Still firmly believe (and I mean this w/ sincere care + respect), you'll learn an immense amount from releasing the first couple songs, giving yourself the gift of hindsight and reflection and subsequent iteration.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293056829806612522",
    "author": "Slow Hand",
    "date": "2024-10-07",
    "content": "Hey. Welcome! \n\nBased on what you've shared, it sounds like you're early in your journey making records. There are a lot of reasons that an Apollo might be a good investment, but buying them for the converters probably isn't the best use of your money at this stage.\n\nThe difference that converters will make (if any) is very very small compared to other factors. Factors like having a good room to listen in, acoustic treatment for the room, and the monitors you're listening through. I would prioritize those and consider converters to be very low priority until you get those other factors working well.\n\nSo unless there are other reasons that you'd like to have an Apollo I think you can save your money for the time being.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1404258273778995270",
    "author": "Beck Nebel",
    "date": "2025-08-10",
    "content": "I'm a Kali IN-8 user - they are truly incredible. I also just finished my GW build - if you decide to go that route, I recommend scouring FB Marketplace/Craigslist for supplies. I saved about $1500 that way - Sheets of MDF for $10 a piece, bags of rockwoold for $15 each, the list goes on.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "828353560524619817",
    "author": "Zack Hames",
    "date": "2021-04-04",
    "content": "I’ve honestly not ever been able to just “get used to” a shitty monitoring situation. I tried to convince myself of that by using the same pair of Yamaha HS80m’s for years, and somehow never liked my mixes. Got new, better monitors and better treatment and my mixes got better. The “just use what you have and get used to it” only goes so far IMO. I don’t think you can get used to messed uneven low end, bad first reflections, poor stereo imaging/center, etc. My ears want to make things sound good, not blindly over-compensate. I find working like that is exhausting.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "844612054437986324",
    "author": "Eric Martin",
    "date": "2021-05-19",
    "content": "I’d echo what’s been said but I’d also add that you should play with the tuning of the batter and reso head to get the sound, you might be surprised to hear that tighter might actually deliver more low tone and overtone to the mic than the puff of air that a too loose head will deliver, I’d also mess with the dampening material, start with less dampening and only dampen what it needs to tame the basketball ping if you get that tone. And let the beater rebound don’t bury the beater, imagine the kick drum is a guitar string and burying the beater is like playing with a piece of foam killing the resonance. play with all these things and you’ll get more low end",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "847882494736203856",
    "author": "Rollmottle",
    "date": "2021-05-28",
    "content": "At its most basic, ceiling above listening position, first reflections at front of room, and the rear wall are most critical",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104930421210349660",
    "author": "austenballard",
    "date": "2023-05-07",
    "content": "but bro! this guy with no discernible credits and some foam on his wall said the word “attenuate” a few times! 🙃",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1185011645861330994",
    "author": "Zack Hames",
    "date": "2023-12-14",
    "content": "You’d need to do put absorption at least two walls, particularly ones next to each other,  as to catch the parallel high frequency of reflections of each pair of walls",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1398683063868985474",
    "author": "Rollmottle",
    "date": "2025-07-26",
    "content": "Trust that the picture we have of you is the one you’ve painted for us. We didn’t make it up. It’s time for some inward reflection my dude.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "811439031187537930",
    "author": "i am willie",
    "date": "2021-02-16",
    "content": "i'm in a small untreated room and i typically mix on headphones, should i invest in speakers or stick with headphones?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "811439809377468436",
    "author": "i am willie",
    "date": "2021-02-16",
    "content": "ill take a look at open backs soon, i'd assume that good monitors in an untreated room wont really do too much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "847879478951936030",
    "author": "chris_donlin",
    "date": "2021-05-28",
    "content": "So I have a bunch of acoustic panels, how do I know where to put them strategically?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "847881730441347073",
    "author": "peterlabberton",
    "date": "2021-05-28",
    "content": "I’m sure you’ve read this or could find it with a quick google search, but starting with the first reflection points would be my first step. Side walls next to the listening position and ceiling above. Then probably behind the listening position and perhaps behind the speakers. If you have anything to use as a bass trap, I’d recommend using something like fuzzmeasure to shoot the room and experiment with placing that stuff in different places. You’ll be able to see peaks and valleys moving around in the low end, assuming what you’re using is actually effective at sucking up bass. There are people with much more knowledge than me, but that’s where I’d start!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "847887075000188978",
    "author": "peterlabberton",
    "date": "2021-05-28",
    "content": "I found this to be true in my current studio. There was a null somewhere around 80hz with my speakers a little further out, and moving them closer to the wall lowered that null in frequency significantly. Not sure if this is what the science says, but that seemed to be my experience. Got it much less in a critical zone, then threw some bass traps on either side of the speakers and lessened it even more.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "848284036371972136",
    "author": "Zack Hames",
    "date": "2021-05-29",
    "content": "This could be a part of it, I deal with this constantly in my current space at home. If you can, put gobos or acoustic panels around the mic or the guitar if you’ve got room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "848371974158024714",
    "author": "Rob Domos",
    "date": "2021-05-29",
    "content": "If it’s the hissing kind of noise that you get more of when you switch from condensers to dynamics and ribbons, then it’s not the kind of noise that is coming from the room. \n\nIn rooms the main things you would be concerned about would be reflection (which you fix with treatment) and mechanical noise from things like computer fans, clocks, etc. and condenser mics would pick those kinds of sounds up more, not less. \n\nAny unison pre in the Apollo should be plenty low noise to not bother you on your condenser mics. I agree with others that not using any unison pre will make the noise floor lower, but I disagree with them in that I think using the unison pres is a pretty good idea often. \n\nThat said, if you’re struggling with noise, definitely try not compressing on the way in because compressors are only going to raise the noise floor. \n\nOn dynamic mics and ribbon mics, you can decrease your noise floor pretty considerably by picking up a cloudlifter and throwing that in the chain. \n\nIf you do all of the above and still have a high noise floor then either the Apollo is broken (which is pretty unlikely), or your microphone is picking up mechanical noise from your air conditioning, computer fan, refrigerator, etc. if those are the issue, then tackle the issue there. Turn off the A/C, turn off the fridge, turn off the LED lights, etc and see what you hear.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1014623756678873228",
    "author": "ehutton21",
    "date": "2022-08-31",
    "content": "Jaycen has an Instagram post about this somewhere, not sure where, but I believe it’s a combination of the mix per @NoahNeedleman’s comment and/or the level of early reflections on true verb/d-verb. I know jaycen swore by true verb for a while because of the ER controls",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1061503879751147541",
    "author": "Nomograph Mastering",
    "date": "2023-01-07",
    "content": "The guys are on point, it’s about minimizing boundary reflections being out of phase at LF, upper mids and highs never make it to the front wall",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124083231092912148",
    "author": "crashout",
    "date": "2023-06-29",
    "content": "hey where can I ask for some advice on acoustic treatment for my room and desk placement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1139680115471691858",
    "author": "Jawn Delorean",
    "date": "2023-08-11",
    "content": "Hey i have some noob questions pertaining to room treatment. I've read a bunch over on gearspace in the forums, read a bunch of ethan winers stuff on his site, and will be occupying a room roughly 14x14x8. I got 16 manville 408 2x4 panels for absorption awhile back and my aim is to treat the room for mixing. I need a space to be able to accurately hear so that i can learn and train my ears. Someone on the unofficial reaper discord recommended you guys. I am gonna get a reference mic and set it all up with REW, adding/ removing /moving panels around and taking measurements and then comparing the results? I'm looking at safe  ' sound batting material for bass traps and clouds etc. This is all i've gathered and i won't be in the space for a few weeks so i thought I'd start to get my ducks in a row. Please any and all recommendations/resources/advice is appreciated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1184944573475213393",
    "author": "chris_donlin",
    "date": "2023-12-14",
    "content": "What's the simplest way to get rid of flutter echo in a small, square room? Diffusors or absorption, or something else?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1267693969006002259",
    "author": "NoahNeedleman",
    "date": "2024-07-29",
    "content": "Hey man! Congrats on the next steps. If you head over the to #🔈monitoring-talk and use the search function, we’ve talked at length about Kali, speaker placement & room treatment to make the most of whatever speakers you choose!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293058533096685649",
    "author": "vostral",
    "date": "2024-10-07",
    "content": "Thanks for your sharing! I'll consider investing my acoustic treatment before upgrading my audio interface. One more question if you don't mind: I'm using DT770 to mix, and i know that headphone isn't dependent on the treatment of the room. So if my mix still sound not right, that could only be attributed to my mixing skill right??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1295331679698817045",
    "author": "tinkerjef",
    "date": "2024-10-14",
    "content": "hi all, new guy here, and I guess I have a pretty simple question, and might be kinda loaded, but what does absolute phase shift sound like?\n\nIve been learning a heck of a lot from the LWMR series on yt, and I've been approaching my mixing philosophy from the lens of an electronics designer.\n\nIt's pretty well accepted in the electronics/audio research world that absolute phase shifts aren't really audible, and that the moment audio is played in a space that has reflections, it's imperceptible. The only real way to hear a phase shift is to be in an anechoic chamber and play a specialized test signal (like a sine wave with timed phase shift pulses to create a slight warble)\n\nI get how on individual tracks if you EQ something, the phase shift can affect how that track interacts with another track when summed, but I often hear that for example, Jon puts a 16k boost then a 27k low pass on the master that creates a phase bump that he likes. Which theoretically shouldn't be audble... Shouldn't it be some other reason like the VT5 saturating a special way?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1381427221897678849",
    "author": "milanleon_",
    "date": "2025-06-08",
    "content": "Hii, is anybody familiar with room acoustics? I've been trying to figure out what density of rockwool works better with low frequencies and what works better with high's, but depending on where I look, some say lower densities work better with low frequencies and some say the oposit. Anybody could help me out with this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1387874021634215998",
    "author": "M J",
    "date": "2025-06-26",
    "content": "Hi All! I’m building out my first studio and would like feedback on monitoring position(Also lmk if this should be in the my-setup thread instead). For context, I’ll primarily be tracking drums (I guess that was obvious lol) and I’ll be mixing/producing. I’m contemplating 2 options right now:\n\n1. leave desk where it is and just set up monitors on desk, however I’m worried about reflections/modes and that corner having a weird affect on what I hear. \n\n2. I remove the bookshelf, scoot the drums back to the wall, and place the desk against the wall parallel to  the drums. \n\nLastly, I’ve gotten a quote from GiK on panels, but I’m also talking to LA Sound Panels right now for a quote. If you guys have any acoustic recommendations feel free to share, thanks so much!",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1401124577702318111",
    "author": "spectrummasters",
    "date": "2025-08-02",
    "content": "I expect this will be common knowledge to the vets but might be new to others (as it is to me ) and thought it looked a fascinating technique im going to try and wanted to share :\n\nI just watched Steve albini describe how he would use an equalizer in a feedback loop to generate a resonant frequency, then blend that tone with the original kick drum signal to allow him to choose a complementary pitch/note with the eq and via the feedback loop also add sustain to taste . \nIf others know a better routing please do correct me : i think he sent the kick to the eq as an aux (not an insert), then brings the return back in a new channel , then sends that channel back to the eq again, creating the feedback loop and blends that into the mix to support the untreated kick. \nI feel this is a little different to regular ITB parallels or VOG processing in that he’s creating a feedback loop/resonance at a chosen note …sort of like synthesising an 808 ? Kinda genius. \n(This is happening OTB with hardware )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1404200165908283554",
    "author": "M J",
    "date": "2025-08-10",
    "content": "Wanted to get opinions on a monitoring decision I’m stuck between, but wanted to post here because it’s ultimately about priorities in studio building and it’s my first time. \n\nBudget: $15k\nUse Case: 1. drum tracking/producing, 2. Mixing \nAcoustic treatment: $3,000\nInterface + mics: $3,000\n\nLeaves me with $9,000. I’m stuck between PMC6 ($7k) or Kali SM-8($5k) or IN-8($1k).\n\nThese would be my first pair of monitors, so I’m more interested in what people think is the better move: purchase best monitoring possible and slowly build out studio gear or get something that works and have more money to purchase a wider range of things? I could double the amount of equipment I could purchase if I went the Kali route, but I see how much love PMC gets here and ultimately I want the most accurate translation possible. \n\nAlso will be planning to demo PMC6 and SM8 when I have to chance.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1404200785692065843",
    "author": "Felix Byrne",
    "date": "2025-08-10",
    "content": "i would maybe allocate a bit more towards room treatment, especially if you are not the DIY type",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1463954120195969054",
    "author": "BoozleBAM",
    "date": "2026-01-22",
    "content": "I favor hand holding my mics with a foam cover and getting pretty close up on them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1464301800784920880",
    "author": "Will Melones",
    "date": "2026-01-23",
    "content": "How does SPL affect room measurements and acoustic treatments? Like is there a relationship between how much rockwool can absorb and how hard you slam it with 100 Hz? I'm wondering if I should be paying more attention to how loud my REW sweeps are. It would make sense to match average listening volume regardless, and would coax a more real-world performance out of the speakers themselves I suppose.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  }
]