[
  {
    "id": "1188924913738842213",
    "author": "cian riordan",
    "date": "2023-12-25",
    "content": "Newbie is crushing out the gate",
    "reactions": 35,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "927051207258816573",
    "author": "cian riordan",
    "date": "2022-01-01",
    "content": "Agreed -- be critical of everything. Be critical of things that are expensive for the sake of being expensive. Things that are just  instagram ads shilling to newbies. Critical of  Greg Wells pandering to whatever his base is. But recommending a 4k converter based on 'audible conversion quality' isn't helpful if the consumer doesn't have a million other ducks in a row first -- room treatment, adequate monitoring, proper gainstaging, etc. Jon has that figured out, so it makes sense for him. But when people come into a forum with questionable knowledge and background in music production asking what's the best converter, I think it's fair to ask some prying questions before just making blanket recommendations on what one person heard or not. I have plenty of semi-OK stuff that still gets used on the regular, and plenty of expensive gear that I would happily toss out of my workflow. They're all just tools. And whether its bougie DW Fearn or a black-friday Acustica plugin, , if it works for your workflow and gets you results you're happy with, then its worth whatever money you're willing to pay for it.",
    "reactions": 23,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1155203098730561586",
    "author": "oaklandmatt",
    "date": "2023-09-23",
    "content": "This is why we have a newbie question channel! ❤️",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256624211493916753",
    "author": "montrose recording",
    "date": "2024-06-29",
    "content": "im here to answer some newbie questions.  \n\nmy 2 cents though after doing this gig for more than half my life is that there arnt big rights and wrongs and no one silver bullet will solve any problem.  ive probably made all the mistakes - ive had huge swings in workflow and between  engineer to artist to mixer.   few things fatigue me more than folks discussing the ‘correct and only way’ to do something because i truly believe there are many many correct ways to solve a problem in music production\n\nbtw i think ive learned far more from observation than questioning fwiw\n\nthat being said - fire away",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1323496840171094207",
    "author": "cian riordan",
    "date": "2024-12-30",
    "content": "Who needs AI when you have Discord-Newbie-Questions-GPT",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1254914170390843494",
    "author": "Adam Thein",
    "date": "2024-06-24",
    "content": "I’d also say this doesn’t have to be an all in thing - challenge yourself to keep the 40 hour job and work on music for 15-20 hours a week on top of that.  In reality if you are just starting as a freelance engineer or if you are trying to make your own music career as an artist you will be often working 50, 60+ hours per week",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079605868716359741",
    "author": "NoahNeedleman",
    "date": "2023-02-26",
    "content": "We’re not having this convo again, and especially not in Newbie Channel",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1154834346058981439",
    "author": "NoahNeedleman",
    "date": "2023-09-22",
    "content": "Maybe this is a hot take, but I believe everyone is actually self-taught. We each have unique learning styles- some are better with visual examples, some auditory, some complete fucking animals read the manual, \nSome like no examples at all and just want to experiment. \n\nModern music making is a playground, and doing things wrong often engenders creativity.   Technique is teachable, but artistry is only cultivated. \n\nCuriosity and tenacity are the only skills required. Everything else is a google search away.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133981791989010472",
    "author": "NoahNeedleman",
    "date": "2023-07-26",
    "content": "Congrats to @LAPhill on his first Newbie thread Pin 🏆",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "809949038991769631",
    "author": "oaklandmatt",
    "date": "2021-02-12",
    "content": "Hey @everyone! We added a channel for newbie/ beginner/ \"dumb\" questions. This whole community is about helping each other, so even if you don't have any newbie questions to ask, please check this channel to help answer questions too!\n\nquestions can be about anything! music making, how discord works, or anything else the community can help with.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "940298735487950948",
    "author": "cian riordan",
    "date": "2022-02-07",
    "content": "I think starting out with a modern compressor with all the parameters available to you will be more helpful in learning the concept. That way you can really understand the idea of a threshold, different attack/release combinations, and and compression ratios. Once you can start to understand what you're hearing, then you can apply that to other compressors that might have more fixed variables (LA2a, etc). I've always found overdoing it when you're first getting the settings will help you understand whats going on.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1183353709565067264",
    "author": "spectrummasters",
    "date": "2023-12-10",
    "content": "Good luck with it all 🙏🏼. Before any questions of my own when I’m brand new to a situation where I don’t have the expertise …..I tend to try and get as much of a read as I can of how the experts want me to learn ……ie . Just be quiet and watch and learn for a while ? or immediately fill the air with a bunch of questions . I find that often I need to be taught for a while before I even can know what questions I have . Sorry if that’s not a list of questions …..but I’d go for “listening to everything everyone’s saying “ as answering the questions I didn’t know to ask yet . Specific questions come as@my knowledge base builds and I reflect .",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "809968963140321290",
    "author": "oaklandmatt",
    "date": "2021-02-12",
    "content": "this is the perfect topic for newbie questions \"which channel should i ask about x?\"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1225066043136016515",
    "author": "Adam Thein",
    "date": "2024-04-03",
    "content": "One other thing about paid plugins from large companies - you can count on Waves or UAD, Soundtoys, Izotope all updating their tools on newer OS.  Some (definitely not all) free plugs are made by people starting out in developing plugins and they might move on to other things.\n\nActually in the middle of this situation now where a single dev plugin was used on a track and I can’t even buy the license anymore.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235674642039967845",
    "author": "Adam Thein",
    "date": "2024-05-02",
    "content": "It's a little tough - if you are learning subtractive synthesis from the beginning a synth without preset recall can be really helpful because what you see on the knobs is what you hear.  But once you move beyond beginner the practicality of being able to store your patches makes the utility way better for live performance or moving quickly in a production",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235728030169698405",
    "author": "Slow Hand",
    "date": "2024-05-02",
    "content": "Modulars are great and boatloads of fun, but I wouldn't recommend them to anyone who is just starting out because they're expensive, overwhelming, and an absolute rabbit hole.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267272133864587344",
    "author": "Bryan DiMaio",
    "date": "2024-07-28",
    "content": "That’s a good time to adjust what’s recorded and see if it can be edited to sound right.\nWhen I was just getting started I didn’t know you could group tracks in Logic so I was comping mic by mic. The best way to learn is to do it wrong first hahaha",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1308008121666502677",
    "author": "spectrummasters",
    "date": "2024-11-18",
    "content": "This popped up on my YT T/L yesterday . I had a Quick Look and first impression was : I don’t think I’ve seen anything as thorough with regard to the whole process of a record as this . Jacquire King going into great detail with a video series taking a song from preproduction , through recording , through editing to mixing . It is the same song throughout with separate long form videos for each stage of the process . It’s also as much about the why as the what . If you’re a newbie this video series might be a fun way to watch someone working",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345841455826210907",
    "author": "Eric Martin",
    "date": "2025-03-02",
    "content": "I put half-rounds on my P-Bass and they sounded “old” when brand new",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1397886184658833428",
    "author": "BoozleBAM",
    "date": "2025-07-24",
    "content": "Newbie questions is just so much more boring without me around.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1076124712507281488",
    "author": "Poll.EG",
    "date": "2023-02-17",
    "content": "So there is a LOT here.  Any suggestion on how/where to start to dig in ?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1121928460777033911",
    "author": "mario dones",
    "date": "2023-06-23",
    "content": "After spending years studying from afar, I buckled down and started mixing at the end of last year. LWMR really helped everything click for me. I used to be an artist, so I have years and years of recording experience, and doing rough mixes for myself and the homies, but I’m very new to this side of things. I was lurking around on here and I see that it’s common when starting out that doing free mixes can easily turn into doing much more. I only have 2 real “clients” right now but I’m mixing, producing, writing, recording… I love it, don’t get me wrong. The more I can help, the better. I guess I’m just having trouble navigating this space. Going deep with these 2 artists, I’m having a hard time building a portfolio, which is messing with my confidence. Specially with mixing. I can get thumbs up from the people I’m working with, my mentor (my old engineer), but without audience interaction I don’t know what to do with that. I’d like to take on more work, but I only have 1 mix out. Hopefully an EP a couple more mixes by the end of next month. I feel weird shopping myself with no portfolio, free work or not. I don’t know where I stand, where to focus my energy and everything just feels like it’s on slow-drip. Any advice?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133970299428278313",
    "author": "cian riordan",
    "date": "2023-07-26",
    "content": "(this is the newbie questions)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182011538949812335",
    "author": "Zach Bloomstein",
    "date": "2023-12-06",
    "content": "Hey friends, I wanted to post this here for anyone starting out. This podcast has been and continues to be a massive inspiration for me on my journey as a recording professional https://www.workingclassaudio.com/ I wouldn't be surprised if someone has already shared this. I bet a few folks on here have even been guests. Enjoy!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1232196950284308600",
    "author": "BoozleBAM",
    "date": "2024-04-22",
    "content": "This has happened to me a number of times: Just did song order for a band from New Zealand for debut their album. When I asked if I gould get a mention -Zip.  Co-wrote 3 songs for a top 40 guy a few years back and was promised credits. Also zip. I am a bit of a newbie myself, but next time, I'm gonna make sure I have something in writing (At least and email) confirming I get credits. No more worky-work for free. Sick of this shit!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1256545431656206426",
    "author": "rawssx",
    "date": "2024-06-29",
    "content": "@BoozleBAM sorry for the ping, i think the reason i personally dont get along very well here is mostly because i speak from a producer/artist perspective (i am turning 19 this year so i have a lot to learn). Maybe its that for you too, or you are new on this journey just like me. The folks here are (mostly) engineers who do this stuff for a living, ofcourse they value their own time. But in my opinion, how beautiful of a place would this be if we could ask the questions we actually want, if i am asking ruairi a question about eq, its not because my intention is to waste his time, its because i want to learn from him, i look upto him and i respect him, if he doesn’t have the “time”, maybe someone else will, but saying “ask better questions” thats for sure very rude, especially to a newbie (this is the newbie chat) I genuinely think this is one of the most important audio communities on the internet. We should be more open minded and communicate with generosity. Lead with love!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1385340078347391066",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "Deleted my last message so this channel can be more welcoming to newbies coming here with legit things to ask",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "833442863378858053",
    "author": "mixedbyKerim",
    "date": "2021-04-18",
    "content": "Ive been playing around with mic distance when recording artists and got a pretty dead room, 6-8 inches away sounds a little too boomy, a foot away is what ive been rockin with, but i find myself still having to remove 3-5 db below 550...is this normal? I never recorded in any other space and just been trying to figure shit out as i go...chain is 87ai-twinfinity- warmaudio EQP- WA76 - WA2a (no reduction) - drawmer EQ ....i set up my patchbay where i record a processed and unprocessed signal just incase too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "837065382127861770",
    "author": "Zakhiggins",
    "date": "2021-04-28",
    "content": "From my own experience, just starting off a production at low volume levels will help you alot in the later stages",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "838632668269903893",
    "author": "David Fuller",
    "date": "2021-05-02",
    "content": "Personally I'd find that infuriating especially if it was a brand new 180g LP that sounded like an old beat to shit one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "842098133709095012",
    "author": "oaklandmatt",
    "date": "2021-05-12",
    "content": "\"buyouts\" def exist. Ghost producers, large songwriting fees to give away publishing, etc. Not crediting you as a mixer seems like a bad precedent to set though. Hard to say. Whenever you accept something like, you're devaluing your work and credibility in the long run (with this client and also with yourself). So it's hard to know the right answer, but I rarely do this, even when I was starting out. Just a bad precedent.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "842172725728116816",
    "author": "thejadenmejia",
    "date": "2021-05-12",
    "content": "Got a newbie question:\nHow do you know what to charge for recording?\nWhat are the factors I should base it off of?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "847881730441347073",
    "author": "peterlabberton",
    "date": "2021-05-28",
    "content": "I’m sure you’ve read this or could find it with a quick google search, but starting with the first reflection points would be my first step. Side walls next to the listening position and ceiling above. Then probably behind the listening position and perhaps behind the speakers. If you have anything to use as a bass trap, I’d recommend using something like fuzzmeasure to shoot the room and experiment with placing that stuff in different places. You’ll be able to see peaks and valleys moving around in the low end, assuming what you’re using is actually effective at sucking up bass. There are people with much more knowledge than me, but that’s where I’d start!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "926980757451313213",
    "author": "peterlabberton",
    "date": "2022-01-01",
    "content": "Yes, but… I think it’s worth avoiding burning money if there’s truly no measurable or practical difference—and if you’re just starting out and you’ve got no money to burn! A fun and inspiring synth could make 100x more music than an overhyped converter!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "943638679023407155",
    "author": "bobby k",
    "date": "2022-02-16",
    "content": "just impulsively bought a 2020 Mac mini with M1 for a great price because my 2018 MBP is just not cutting it anymore. can anybody give me a basic breakdown of any compatibility issues to anticipate? I mostly run in PT and Ableton 11. lots of 3rd party plugins... (sorry in advance for not paying attention to the extensive M1 talk in these forums. posting in newbie talk because computer specs are outside of my range of nerdiness, so i'm feeling a little lost haha)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "943957425369780224",
    "author": "bobby k",
    "date": "2022-02-17",
    "content": "so another newbie question, but how do differentiate between rosetta and native when using an M1 computer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "943958673326215268",
    "author": "Adam Thein",
    "date": "2022-02-17",
    "content": "You can select the version it boots under the \"Get Info\" menu at least for Ableton - I'm brand new to my Mac so I'm sure someone else can chime in!  But it's definitely on the application level and not the system level",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "980334153427988540",
    "author": "ehutton21",
    "date": "2022-05-28",
    "content": "I’m not sure if this is a newbie question or not, but I’ll throw it here anyways and see what happens (I hope it helps newbies too). I’m already somewhat aware of the answers I may get, but who knows. Sorry if this is long, I’m bad at short form.\n\nContext: I have been producing music in sincerity for maybe 3 years now, been a hobby since like 16. I’ve started to engineer out of necessity for my individual artistry, but one thing led to the next and I gained a fair bit of skill at it (or so I’ve been told, I’m still pretty insecure, honestly even being around all the really knowledge people on here makes my panic disorder go 📈). I’ve gotten an internship at a studio as a runner and a session assistant down here (it’s not paid but it’s not exactly unpaid), and I truly have learned a lot (I learn something new on the daily I swear), but I’ve yet to have any true guidance from an established figure yet (which very well may never happen), which I know isn’t necessary, but it absolutely makes me question my own abilities/career decisions despite what happens with my freelance work and I’m curious to know if this is like normal/how other people cope. \n\nLike, I’ve gotten a somewhat okay share of people who pay for my work as an engineer/producer/writer, but the “do you really know what you’re doing” doubt doesn’t fade easily—even when I’ve been paid by people on like label level budgets, I’m never really registering that success. I’ve had cool moments and landed spotify placements as a mixer for artists, and there’s this part of me that’s still somewhat ashamed that I do a lot more work for free than I care to admit. \n\nMaybe it’s the comments on the old episodes that has me spooked (Jon on #61 re: “not everyone can be a mixer”), but is this like just me or do even some of the really wicked smart people here still feel that—and if so, how do you guys handle the it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "981255177329852436",
    "author": "emre",
    "date": "2022-05-31",
    "content": "I'm not sure if its a newbie question or not but is getting louder mixes is releated to 32 bit ? I know it has more dynamic range than 24bit so can i push it more ? I really struggle understaning how to get my mixes loud. Whether I want it or not there's still a loudness war going on and i just want to be able to give my clients what they want if they ask for -6 lufs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "994426697879388214",
    "author": "XclusiveMoney",
    "date": "2022-07-06",
    "content": "Hey guys,\nI’m a beginner using Abelton 10 suite. I’m having issues trying to sync different tracks with different bpms. Is there any way I can do this quickly ? Also I want to know how to put the clip sample box in the bottom left of the interface.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1006974378346553404",
    "author": "louisvie",
    "date": "2022-08-10",
    "content": "hello gang, here's my newbie question :\n\nwhat do matt & jon & every mixer ever mean when they use the word \"under\" ? as in, \"sometimes the hihat is sitting under the vocal.\"\n\nis it more of a fundamental pitch/tone thing, a delay/ambience thing, a dynamics/volume/saturation thing ? i guess it's all of it ?\n\ni do get a sense of it when listening to good mixes but i don't really know the steps to get there for my own stuff.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1024048802732191755",
    "author": "louisvie",
    "date": "2022-09-26",
    "content": "hiya, newbie question : does changing levels of faders for examples between kick in, out, and  subkick change the phase relationship ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1033514751566815253",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "You and I could go hard here on the geek stuff, but I'm gonna hold off in this forum so we can answer more newbie questions",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1036776755500961894",
    "author": "emre",
    "date": "2022-10-31",
    "content": "Hey guys, really really newbie question but i am struggling so much that i need to ask. What is gain staging and how can i do it properly ? I know the basics like noise floor, clipping over 0 but there are so many different information out there I just can't tell which is right. Some say you need -6 db of headroom blablabla but i watch Jon Castelli or any other mix engineers mixing they are mixing to 0 and loud af. It feels like im doing something wrong and but i don't know what im doing wrong if that makes any sense. Would love to hear how you guys approach it and would love to learn from you. Thanks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1043718279782477824",
    "author": "cy (sigh)",
    "date": "2022-11-19",
    "content": "facts.\n\nstarted out doing so  much metal /banda/folk/infie stuff for free when i was starting out ( a lot of school contacts) and didn't  ask for credit but my first 3 paying clients were all session musicians in those free gigs. \n\nword of mouth and putting in thw time/work really pays off \n though it can def be frustrating. even when ppl think you're \"expensive\" when you start charging they'll see the value in your work once they try someone who's cheaper \"juat cause\". that consistency is everything and showing them you are doing everything for the song/project can be more important than the final song itself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060059469658206299",
    "author": "JakeTB",
    "date": "2023-01-03",
    "content": "Thanks for the input everyone, appreciate the help. It’s really fun to be a complete beginner at something as an adult.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1070314238012305429",
    "author": "austenballard",
    "date": "2023-02-01",
    "content": "It's a little like \"Sic Transit Gloria\" by Brand New in delivery",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1127680178064216105",
    "author": "JakeTB",
    "date": "2023-07-09",
    "content": "Also I just like to see what people say. So much guitar expertise in this forum. I’m only just beginning to take the instrument seriously, so I put this in newbie talk since it felt very… newb-y",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1131104826198085692",
    "author": "utilitron",
    "date": "2023-07-18",
    "content": "Any recommendations on ear training exercises or helpful resources online for mixers? I'm just getting started mixing in the studio and would like to make sure my ears are installed correctly. Working my way through \"Mixing with the Mind\" by Stavrou and I've been playing with some familiar references and visual EQ, just curious if y'all have any favourite resources I should be aware of.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1154815321811730492",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-22",
    "content": "What would you consider the best beginner online music education for contemporary music making and methods? If you had a child who wanted to get into making music via online classes, where would you send them and why?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1163597627523350711",
    "author": "Slow Hand",
    "date": "2023-10-16",
    "content": "My most-used commands are:\n\nCmd + Opt + B: Open/close browser.\nCmd + Opt + L: Open/close bottom track window.\nShift + Tab: Toggle between *Instrument View* and *Clip View* in the bottom track window.\n\nI'm a habitual window toggler. If I'm not using the window it gets hidden immediately. I probably wouldn't mention it to a newbie, but it's probably a nice reminder for more seasoned users.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1183257415462961173",
    "author": "BoozleBAM",
    "date": "2023-12-09",
    "content": "Very sinisterly newbie question here, and I'm totally not a newbie, but anyway: I've got this old, 8 channel, preamp unit with a power supply the size of a panzer tank. Even when the preamp is not on,  the power supply is warm - just by being plugged in... Is this doing anything? Wearing out any of the circuitry or whatever? Should I unplug it from the wall after every use?? Thanks. I am soo bad with my electronics knowledge.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1203425543228366928",
    "author": "popaganda.",
    "date": "2024-02-03",
    "content": "I have no clue where to post this, but it's kind of an advanced newbie question in a way. I've been doing some editing for a friend who records nature full-time. She sells the recordings online, and the clientele is presumably people in gaming, film, and app dev. A lot of the recordings are double mid/side and we're trying to figure out what's standard or expected in those industries when it comes to deliverables for multichannel recordings. 3 channel for the client to decode? 4ch? 4 stems front, back, L, R? Mono front, mono back, stereo L/R? maybe a long shot but does anyone have experience in this world?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1217645827749580822",
    "author": "JakeTB",
    "date": "2024-03-13",
    "content": "Beginning the process of looking for a dedicated studio spot for the first time. Mine’s always been in my house until now. \nWhat are some things you all wish you knew when starting out?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1217671259043794954",
    "author": "JakeTB",
    "date": "2024-03-13",
    "content": "Is office/flex space an alright place to be looking? Genuinely haven’t the slightest idea where to start the search",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1258810849242517535",
    "author": "bobby k",
    "date": "2024-07-05",
    "content": "I'll take this to biz talk if it belongs there, but it genuinely feels like a newbie question so here it goes. \n\nhow the hell do you get a label to send you your royalties? I've been on a month+ long quest running in circles with UMG's \"royalty support\" or whatever it's called, and they have been impressively unhelpful. Trying to chase down an imaginary dollar amount on 20+ songs I've produced, or at least speak to the person who's like tracking that information & recoupment and all that to get like any sort of window into what's going on. Artist's mgmt and A&Rs have kind of been dead-ends. Anybody have a good UMG person they'd be comfortable doing an intro? Or any tips otherwise?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263587823986937856",
    "author": "NoahNeedleman",
    "date": "2024-07-18",
    "content": "Reaper’s grid works just fine, you don’t need a brand new DAW to do what you’re tryna do.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263736396011536456",
    "author": "BoozleBAM",
    "date": "2024-07-18",
    "content": "I was talking about youtube channels - Like, quick \"Getting started\" tutorials...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263743495475036270",
    "author": "Nomograph Mastering",
    "date": "2024-07-18",
    "content": "But I think for a beginner PT is the easiest",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1264419323838206025",
    "author": "BoozleBAM",
    "date": "2024-07-20",
    "content": "Very newbie question here: I've just finished tracking drums for my first album. I played along to guide tracks of bass, vox, guitar and click, of course. The intention was for these tracks to be replaced after the drums were laid. Should I: 1. Slip edit the drums now and then stack the new bass, guits and vox ontop of what is essentially the final drum edit, or 2. Play the final bass, guits and vox now and then slip edit everything kind of at the same time/ stage? - Or is there another process ya'll recommend?? Thnx.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1266002463702384702",
    "author": "Talking_Wire",
    "date": "2024-07-25",
    "content": "Newbie and audio question:\n\nWhen you’re listening to music in a 4 door sedan… what’s happening to the sound waves? \n\nDo we do the car test bc it’s the worst audio or the best?\n\nI’ve come this far and I’m too scared to ask haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1267509361589092406",
    "author": "bobby k",
    "date": "2024-07-29",
    "content": "Anybody tried their hand at audiobook recording? My partner is really interested in giving it a shot, and I’m curious if there are any DAWs suited specifically for this. Obviously I can set her up in Pro Tools and we would be golden, but wanted to explore other paths too. She’s a complete beginner with audio",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268569956459745390",
    "author": "oaklandmatt",
    "date": "2024-08-01",
    "content": "I'm saying it's great you're looking for collaborators and in fact we have a whole channel for that. You may have more luck there as this is the newbie questions channel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1272673459373342795",
    "author": "Nomograph Mastering",
    "date": "2024-08-12",
    "content": "I think this sounds like a one way ticket to hell trying to understand and balance these factors (given that we're in the newbie-questions channel)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1279865560645238876",
    "author": "BoozleBAM",
    "date": "2024-09-01",
    "content": "Please tell me if this should be in Newbie Questions or Recording talk - I hate to misplace stuff. Anyway. I have a question about recording guitars: I have a bunch of songs that fluctuate a lot dynamically. Live, I use three or four clean boosts to drive my amp into different levels of distortion (jcm 800). The last time I did a record, I just did it as though i was playing live - just hitting the boosts along with the click when the song went into the different sections. It worked fine, but I've had many working engineers tell me that's NOT the way to do it. Rather, I should have recorded each section that has a different level of distortion/ intensity on its own, so that way I can have more control over the mix and end up with cleaner transitions, potentially... I'm just curious how people here may have handled such a thing. Not that it's important, probably, but I'll add that I don't use any volume or tone controls on my guitars - just humbucker straight to jack. I control all the dynamics with my pedals and strumming hand. Thanks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1290746859568103465",
    "author": "Bryan DiMaio",
    "date": "2024-10-01",
    "content": "Correct, that shouldn't account for missing files, it's likely something in the way you're saving or moving things that is the reason for missing files, assuming the drive itself isn't corrupted. If it's a brand new Samsung SSD though I'd doubt that it's hardware-related",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1344950905879003228",
    "author": "louisvie",
    "date": "2025-02-28",
    "content": "Hello friends and colleagues, \nLil newbie question for you today : \nDo your mixbus/master limiter attack and release settings change every mix ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1345065106148688005",
    "author": "BoozleBAM",
    "date": "2025-02-28",
    "content": "Thank you so much for this, Ross!!! I'm gonna have a blast sifting through these methods this afternoon... With the Rough Ryder mention - Are you referring to the compressor by Audio Damage or is there another one (distortion plugin?)? Also, i was thinking about this recently: I wonder if one of the reasons I'm not super stoked with my room mic sound is because i recorded them through the spdif on the back of my interface Yeah - When i was getting started, i didn't have that many channels, so i kind of \"sacrificed\" my room mics by sending them through the spdif inputs so that i could use my pres for more important stuff. They honestly don't sound bad to me, but i was wondering if that could be a reason why i just never got them to fit well in the mix - crappy spdif or something just not gelling well. That's probably a silly thought.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1347424187341344819",
    "author": "BoozleBAM",
    "date": "2025-03-06",
    "content": "I wanna say real quick too, @Zack Hames , that I did a little test recording through my focusrite 6i6 (discontinued) and it sounds surprisingly good to me. Never recorded with this thing before!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1347893799434588173",
    "author": "BoozleBAM",
    "date": "2025-03-08",
    "content": "I'm really shy to ask this but I'm just gonna get it out of the way: Those of you who track drums last - What is your protocol? As a solo, \"one man band\" type, I have found the best success starting out with click, then going to guitar, vox, bass and finally drums - slaving everything to the click the whole way down. I don't know why, but this is just what works for me when I'm doing everything on my own. This is quite surprising to me because it's the opposite of how I've ever done it when collaborating with others, but it is what it is. I just want to make sure I'm not missing anything moving forward. Thank you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1378672754865471569",
    "author": "L U K E",
    "date": "2025-06-01",
    "content": "Hey everyone, I am a beginner producer I use FL studio, I sing and play the piano. For a while I have been using plugins to add for example drums or guitars to my songs, but it makes the music sound so dead. What would be the best place to find musicians who would be down to record real instruments for songs? I don’t have a lot of money either 🙈",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1394113306754678854",
    "author": "SawyerM",
    "date": "2025-07-13",
    "content": "Hey, my first few projects that I've worked on are getting close to releasing. With that I have a few questions about how to best use Instagram for advertising myself. 1. Should I make an engineering specific account? 2. Does it make sense to make posts for every release or just stick to stories? 3. I would appreciate any best practices or things you wish you did when getting started with promoting yourself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1398365147478622299",
    "author": "M J",
    "date": "2025-07-25",
    "content": "As a newbie, I come here so I can avoid all the marketing plugin BS online and gain real knowledge from you all. I hope those that come off resistant or ungrateful to feedback/critique don’t ruin it for the rest of us. I’ve already 3x my knowledge just digging through the archives of past talks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407257474247163904",
    "author": "louisvie",
    "date": "2025-08-18",
    "content": "Lil newbie one. I think this might have been covered already but I'm not sure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1410005616663068806",
    "author": "Yu Justin K",
    "date": "2025-08-26",
    "content": "As purely an instrumentalist at the moment, I'm trying to expand the sounds I can get in my productions with singing (mainly supporting artists with BGVs/vocal pads/doubling etc.).\nMy voice and tone is very weak to support artists in most styles at the moment, so I'll be starting from ground 0 in my practice routine.\nSo far, I've been practicing going up and down scales with a met (half-time and full-time), using different syllables thru the scales, and singing long tones with different syllables.\n\nDoes anyone have sources and or advice for a beginner to strengthen their singing voice?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1413588437583265932",
    "author": "baccwardshead",
    "date": "2025-09-05",
    "content": "Hey guys! Heard a lot about this community. Sorry for the ChatGPT post but English is not my native language. Tried searching a lot about this by looking at \"headphone rec\" and \"hrtf\" but I'm getting even more confused, just craving a stable monitoring system for me. Hope this is not too newbie of a question.\n\nI’m an intermediate mix engineer — normally mix on Yamaha HS8s but I’ve been travelling a lot lately, and I’m craving a stable monitoring solution I can rely on while on the road. I actually love how the ATH-M50x sound, but they’re not giving me the translation I need for mixing. I tried Beyer DT-990 and disliked the sound. Thinking about getting Sennheiser HD650 — should I pair it with a headphone amp even though I already have an Apollo Twin? HD650 + amp might be pricey, or would AirPods Max 2 be a reasonable travel/monitoring/critical mixing alternative? Clients send notes that confuse me with the M50x (rare on the HS8s) — it’s only ~10% of the time but I want that gone. Any recommendations?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1455981822499492072",
    "author": "Zack Hames",
    "date": "2025-12-31",
    "content": "This is interesting - i remember seeing a steve albini video (and i think some other folks) talking about how analog tape is the most reliable archival format (specifically over digital) because the equipment and playback will \"always\" exist and be able to happen, etc. but I mean fuck what are you supposed to do, every so often archive your entire tape catalog to brand new tape? (not literally asking because everyone does digital archival, but just thinking out loud)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  }
]