[
  {
    "id": "1133961039751422002",
    "author": "LAPhill",
    "date": "2023-07-26",
    "content": "This is such an important lesson to anyone following along who's either a mixer or especially a mastering engineer. You can send someone spiraling with doubt based off of one comment, perhaps your own limited understanding of the material. \n\nEven the way you phrase something can make all the difference. \"Hey AJ, I hear what you're going for and I love it, but I think there's room for the bass to hit harder if you can back off the levels. Just trying to to get you the vibe that I think you're going for. And if you hate it, no worries and we'll go back to your louder track.\"",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1256441468013252638",
    "author": "NoahNeedleman",
    "date": "2024-06-28",
    "content": "@BoozleBAM \n\nCouple things. 1) if someone’s name is in purple, it means they’re a moderator AND they have real actual credibility, not only on this server but out in the real world. \n\n2) @Nomograph Mastering just mastered the number 1 song on Billboard. If that doesn’t make you wanna stop and think about why he’s spending time answering your questions or encouraging you to ask better ones… well you might be in the wrong place. \n\n3) you can get answers to questions like “should I use omnis for overheads” on Google. So Rauirí’s attempt to push the conversation toward more important things is a reflection of his care for the quality of conversation on this server. The mods here take great care to make this place a valuable place to spend our time. We’re trying to create a place we needed when we were exactly where you are.",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1184856813053673483",
    "author": "masteredbyjack",
    "date": "2023-12-14",
    "content": "Haha I honestly only ever got on discord to be on here, which I love. Also think, and this is just a personal thing, that restricting the information I consume is really helpful -- there are a few people on here ( @Nomograph Mastering , @cian riordan , @BatMeckley to name a few) that are sorta true norths to me -- I weight their opinion heavily...between here and doing the thing everyday and learning in the fray so to speak, not sure there is much more that would be useful for me at this point!\n\nThis place is really incredible, so many ultra talented and kind folks sharing real world info",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1068784678879895562",
    "author": "oaklandmatt",
    "date": "2023-01-27",
    "content": "Haha just relaying my experience. If you're sending to a mastering engineer it's a whole different conversation.\n\nAlways think about what you're trying to accomplish at any given stage. Then go after that goal. \n\nI used to spend too much time on sonics in writing sessions. I should have been solely focused on finding emotional magic. Now  I am just trying to inspire the artists and writers around me, I'll deal with the sonics later. Much better results.\n\nI also used to fully mix-as-I-go, which painted me into a corner with gain staging and eq. Now when I get to the end of the process, I often pull things back and rebuild my levels so there's headroom and I can make that exciting production translate.\n\nDifferent approaches for different parts of the process.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1122175319932149860",
    "author": "masteredbyjack",
    "date": "2023-06-24",
    "content": "Gonna circle back with more later, but this is my 2 cents (I started mastering with zero clients about 9 months ago)...\n\nGet over your fear/insecurity/weirdness of not having a portfolio. Go fuck it mode. You need to have a ton of contacts. Take a lot of shots. Of course I have no idea about what you are doing currently...but zero people I've ever talked to in this situation have taken enough shots. \"I reached out to 5 people this week\"...no. HUNDREDS. Most people will ignore you. But just keep going. Watch a Goggins video before you start or something haha\n\nReally think about the experience of working with you. Is it amazing? Is it easy? Is your communication, care, intention incredible? Even things like how files are named/delivered/etc matters. You can only be as good as you are at mixing until you get more reps. But you can control how you interact and the professionalism and confidence you can inspire on the other side.\n\nIf someone lets you mix a song...are they coming back? They need to if you are going to have a business doing this!\n\nSorry to be prescriptive here...but I've seen this question asked of me enough to know that it's so so hugely about just brutal persistence in many aspects, assuming you have talent, etc to do the actual thing.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1266851879581782098",
    "author": "cian riordan",
    "date": "2024-07-27",
    "content": "I'll have you know that everytime I sit down and fire up Spotify to listen to some new music, the first thought that enters my head isn't \"I wonder how these folks managed their drum editing?\". To quote @BatMeckley's mother: \"Nobody cares how the sausage is made... I just like sausage.\"",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1451989576058146839",
    "author": "BatMeckley",
    "date": "2025-12-20",
    "content": "Honestly, that line is a bit over blown. It’s more “oh the chorus is louder, let’s knock it back a click or two on the input so it doesn’t distort”\n\nWe were usually recording songs in fairly small sections, making sure to get the details right. There wasn’t a lot of jedi like fader riding. On very rare occasions if I knew there was going to be a huge dynamic shift I’d reach out and grab the output fader, but I can probably count on one hand how many times I’ve had to do that.\n\nWe were fairly conservative on the 1176 on the way in, largely cause you can’t un crunch a vocal that’s been over compressed, but once the vocal was in PT it would be hit by just irresponsible levels of compression and limiting. Like goes against how virtually every “expert” online would tell you how to do it. Most people would tell you the solo’d tracks would sound bad, but as part of the song their impact is objectively unarguable",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1020798891593044018",
    "author": "cian riordan",
    "date": "2022-09-17",
    "content": "You're very much being taken advantage of here. I would recommend politely writing them an email saying that you've done the work that you were hired to do (especially if things have been delivered for mastering) and given the amount of additional work they're requesting, you need to negotiate a new fee for said work.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1272838506712141834",
    "author": "Nomograph Mastering",
    "date": "2024-08-13",
    "content": ".\nAssuming we're talking about fairly typical rock, pop and Hip Hop then this 3 part strategy covers a lot of ground\n\n1) Make sure the EQ is as balanced as you can get it - most of your perceived loudness comes from the arrangement and mid range focus (2k to 8k). Too much low end will sound bad when you limit. Make sure the relationship between 80, 160 and 320 makes sense (think of them a little like fundamental, 1st and 2nd harmonic).\n\n2) Consider shaving snare transients (and maybe kick transients) with a clipper. This spreads that peak energy harmonically across the spectrum, keeping energy, hiding in the noisey nature of snares and lets the limiter work less hard (I like SIR Standardclip - $25, great metering and responds intuitively)\n\n3) Pro-L2 on the settings below is a great start point for clean and predictable limiting, raising input gain until you get the desired level",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1036785475878387802",
    "author": "Slow Hand",
    "date": "2022-10-31",
    "content": "It's a big topic, but gain staging is about finding the optimal amount of gain at every stage of the recording and mixing process.\n\nGood gain staging allows you to get the best fidelity out of a recording by preventing things from creating unwanted distortion or amplifying unwanted noise. **OR** if you are *seeking* some distortion and compression it's about turning up the gain enough to give you the amount that you're seeking from your tools.\n\nGain staging is something to be considered at all steps of the production process. For example:\n\n*1. How loud is an amplifier turned up in the room? Is the microphone being blow out by it?\n\n2. How high is the gain on a microphone preamp and is it at risk of clipping if the performer plays loudly?\n\n3. Is the gain so low that when I turn a signal up later on the noise floor will rise with it?\n\n4. If I'm recording to tape, am I recording quiet enough that it won't saturate the signal, or do I want for the signal to slam the tape and be saturated?\n\n5. How loud is an individual channel in a DAW? Is it making the channel clip?\n\n6. How loud is a signal that's being sent into a piece of hardware or a plugin? Am I distorting the circuitry at all?\n\n7. Is my signal coming in so hot that it makes a compressor react way too hard?\n\n8. How loud is the entire track I'm mixing? Is the limiter crushing the dynamics in an unwanted way? Or am I hitting it just with just enough level to get a certain flavor of pumping and clipping?\n\n9. Is my final mix going to hit digital zero and create unwanted clipping?*\n\nSo gain staging is not a single thing, but a series of choices that are made every step of the way around how you manage the \"voltage\" of your signals. Together these choices all add up to a mix that \"breathes\" well and is free of excessive or unwanted distortion.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1045500000576217228",
    "author": "Slow Hand",
    "date": "2022-11-24",
    "content": "I would rule out the Izotope production bundle (Ozone is fine). I think Izotope is the least musical and hit-or-miss of the options. It's not bad, but it's not as fun to use as the other options, and I think that has an effect on your results.\n\nBoth the FabFilter Mastering bundle and Soundtoys bundle are great and you wouldn't go wrong with either pick. But they occupy different niches: FabFilter is clean and surgical while Soundtoys is all about injecting vibe and coloration and doesn't include anything remotely surgical.\n\nI guess if you can only pick one I'd start with Soundtoys for the vibe and the way it would expand the sonic palette for your production work. Your DAW is going to have some perfectly capable EQ's and compressors to tide you over until you're ready for FabFilter.\n\nPut another way, your production work is upstream of your mixing work and will influence the sound of your records more.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1185727875979157504",
    "author": "Rollmottle",
    "date": "2023-12-16",
    "content": "I have a couple distinct phases of my workflow. The “technical” phase let’s call it, is all about letting my brain objectively search for the very specific kinds of things that are distracting within the mix at hand. This is much more of a thinking and corrective process than it is a feeling one, even though feeling and taste is 100% involved. This part of the process is to get the mix on a more solid foundation if needed.\n\nThe next phase is where I want to actively NOT be thinking at all. This is why I do the first part separately. I want to be FEELING the music in this phase and not be taken out of it by the vocal resonance at 1.8k at 1:35 in the bridge. I want to turn that part of my brain off so I can focus on the music, the feeling, the lyrics, the intent, the song and try to find where (or if) I can elevate or reveal or better frame the heart of what’s there. This is meant to be the flow state, moving intuitively and viscerally based on what’s coming out of the speakers. This is where efficiency in toolset matters -- where an extremely efficient human-computer interaction matters, where knowing your tools cold matters. I want to reduce latency between feeling and move and I don’t want anything to get in my way. \n\nSo to answer your question: I think about ways to continue to be able to access and preserve that crucial flow state during the time where it matters the most. And it can manifest a million ways that aren’t directly related to mastering at all: taking a walk, working out, doing a J, listening to a new record, checking Discord, unplugging, whatever. And yes, sometimes it also means refining my template or my Streamdeck shortcuts or creating a new preset.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "896143861754257441",
    "author": "Rollmottle",
    "date": "2021-10-08",
    "content": "just wait until mastering! 🥴 🥴 🥴 🥴 🥴 🥴 🥴",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1068768743745925170",
    "author": "NoahNeedleman",
    "date": "2023-01-27",
    "content": "I always send it off to people without the final limiters on. It’ll be quieter. But they’re likely to record something that’ll fit more into your mix, and then that consequently will work better with your 2buss processing",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1227344305643847772",
    "author": "Rollmottle",
    "date": "2024-04-09",
    "content": "We put together a primer for preparing mixes for mastering. Loudness and how to approach it is covered: https://www.livewithmattrad.com/resources/preparing-your-files-for-mastering",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1272871958761046130",
    "author": "Iwan Morgan",
    "date": "2024-08-13",
    "content": "This is great, even after doing this for many years it’s nice to see it so clearly explained @Nomograph Mastering . I’m screen capturing this and adding it to my “Notes from the GOATS” folder.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "811397222016745472",
    "author": "oaklandmatt",
    "date": "2021-02-16",
    "content": "i love this question. i've been doing this for long enough that the cycles of how records sound has changed several times. so every few years i try and take some time to unlearn/relearn.\n\nthere's no good short answer, but i'd start with taking some time outside of mixing to just listen to records. whether you've done this before or not, get to know your speakers and your monitoring environment better than before. listen to your favorite records that you know well, and make some tweaks. you don't necessarily have to redo your whole setup, but listen to your speakers in slightly different positions, different settings on the back of the speaker, etc. and really dig into listening and enjoy yourself.\n\nthat's usually enough to make me think about mixes very differently (which ultimately means i get better when i re-incorporate most of the things i already know). but if you need more, just try and simplify. start a mixing by just leveling everything. clip gain and leveling and panning. then balance frequencies and compress (via compressor or saturator or limiter or whatever). basically, with fresh ears, go back to basics.\n\nnot sure if that will transform you into a new mixer, but that's an outline of an approach i use when i feel like i need a big talent upgrade",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1069302430640119819",
    "author": "BatMeckley",
    "date": "2023-01-29",
    "content": "Also, again, after decades of getting sent a fucking mp3 with non compensated mastering bus plugins on it, you don’t whine, you line it up quick best you can and get on with it. Don’t bitch about it and deal with it after the artist leaves, slaving in a darkened room accompanied only by a glass of whiskey. \n\nSo much of our job comes down to “just solve the fucking problem and move TF on”",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1325134121135247391",
    "author": "cian riordan",
    "date": "2025-01-04",
    "content": "… just fix it in mastering",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "972882430098808913",
    "author": "ALXCPH",
    "date": "2022-05-08",
    "content": "1) always, always, always if possible communicate with the client. Some peeps might want you to do it from the ground up, others might just want the sound of their demo “but better”. It really depends and has no standard. \n\n2) starting off loud gives you less work, trying to get a finished mix loud without Changing the Sound of it. (Lets you make more “informed” decisions when building a mix if a certain loudness or Sound is your end goal). \n\nPs. Mixing for real clients in a real world is never perfect and how it is imagined. Demoitis, deadlines, budgets, ego’s and so on. It’s all just about finding the best way to consistently get results. Because that’s why people hire you.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1076250212865155183",
    "author": "Josh",
    "date": "2023-02-17",
    "content": "Just used it to find out why @Nomograph Mastering hates tube traps and simultaneously found an entire guide regarding how to setup a new room.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1185626321829761134",
    "author": "Bryan DiMaio",
    "date": "2023-12-16",
    "content": "(My attempt to summon the mastering engineers to actually chime in)",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1228767107894738984",
    "author": "Nomograph Mastering",
    "date": "2024-04-13",
    "content": "Bet they nail the dither settings though, and the LUFS target, and the metadata",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066214964420947978",
    "author": "NoahNeedleman",
    "date": "2023-01-20",
    "content": "The download hack it great- except when I’m on my phone walking the bubbas (or picking up dogshit in the yard,) that’s when I need to stream audio. And I stream from Dropbox a LOT. It was utter dogshit for a while but it’s gotten noticeably better over the past few years. Though Apple Music is always louder. \n\nI’ve gone through a few cloud streamers for this and IME nothing works as cleanly and reliably as db. \n\nI just wish they’d implement a playlist function",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1398412825138958418",
    "author": "Slow Hand",
    "date": "2025-07-25",
    "content": "@chrissorem @Nomograph Mastering @NoahNeedleman This essay does a great job at unpacking what it takes to participate and succeed in any kind of venture, and how the people who endure have their own unique madness that makes them the right fit for it.\nhttps://www.experimental-history.com/p/face-it-youre-a-crazy-person",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "839734540934840340",
    "author": "peterlabberton",
    "date": "2021-05-05",
    "content": "I'd play it on a case by case basis... if the credit could be big for you, it might be worth chasing, but you'd have to weigh that against *possibly* damaging the relationship. Would just depend on your relationship with the artist/their management/etc.. Might be better to not rock the boat and more easily work together again (though with securing credits early on this time!) I've learned this the hard way as I'm sure many others have as well! Always always better to work this out ahead of time. And even if you get them to credit you now, it's likely too late. I have a credit coming up that I secured after the physical manufacturing had already begun. So it's too late for physical and will therefore not likely appear on allmusic. Will it appear Spotify/etc.? Who knows. On the plus side I can say with no hesitation that I worked on it, but it can definitely be a bit of a missed the boat situation.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "981261325827199037",
    "author": "ALXCPH",
    "date": "2022-05-31",
    "content": "Getting stuff loud is easy, just distort and limit it until all hell breaks loose. Getting stuff loud while still sounding decent is what we’re all fighting for 🤪. I would spend time learning audio basics if you really want to understand how loudness works. Matt and Jon have a few good episodes on their takes on loudness. 🙂",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1029030581054484622",
    "author": "ALXCPH",
    "date": "2022-10-10",
    "content": "So I did the 1k sinewave test on the phone connection And ended up using it at -10dbv. It doesn’t distort, but gives me a little more level, so I don’t have to turn up my monitor controller from  my volume presets. I used the tone generator app which was completely clean. I also tried the Spotify one and I could hear some harmonics or aliasing. So that wasn’t clean at all.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066404280610865224",
    "author": "Nomograph Mastering",
    "date": "2023-01-21",
    "content": "How it feels matters a lot to me. And for mastering the feeling I strive for is “I’m done!”",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1317277748280168449",
    "author": "river",
    "date": "2024-12-13",
    "content": "I produce all in the box and I feel like I'm always treading this line between loudness, losing volume in my low-end, harshness, my transients in my drums translation.\n\nThere are all things I'm still learning about steadily, the more I learn the less I realise I know lol,, But I'm specifically wondering more, am I really _truly_ being \"held back\" by my monitoring situation. \n\nWill divulge more when got time",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1349082874225233920",
    "author": "Eric Martin",
    "date": "2025-03-11",
    "content": "To paraphrase @Nomograph Mastering: When your ambition/expectations outweigh your ability, hire it out until your ability match or exceed tour expectations.\n\nMixing can take years worth of reps to get good at, it’s better to hire someone and release something you’re proud of while you learn how to do it yourself.\n\n-OR-\n\nrelease the things so that you can truly understand where your current ability is, hindsight is the best scale for quality",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1416103375405322261",
    "author": "oaklandmatt",
    "date": "2025-09-12",
    "content": "In addition to the advice here, you might want to jump on #🤝collab-talk talk and ask if there's anyone willing to give you mix feedback. I'm sure you'll get some takers and you can send stuff to folks in the DMs. \n\nAs @masteredbyjack says, loudness is more of a perception that you achieve in the arrangement and mix than the LUFS number. Learning how to treat sounds to make them feel loud is a big part of loudness.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "824704045780434994",
    "author": "Slow Hand",
    "date": "2021-03-25",
    "content": "If anyone else here wants to chime in on whether or not to ease off the limiter for a live track, I'd love to get someone else's perspective on the matter.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "837373279193923604",
    "author": "Eric Martin",
    "date": "2021-04-29",
    "content": "it’s not a fun process, I’ve done it for two LP’s, I’d rather trust the cutting engineer.\n\nAny other questions could probably be answered by this FAQ page. (Scroll to vinyl specific questions)\n\nhttps://www.rareformmastering.com/faq",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "844104040731508747",
    "author": "jonmatteson",
    "date": "2021-05-17",
    "content": "I’ve been using the faraday limiter lately on bass and have been really happy with the results! The tone controls on it are very useful for adding as much or as little color as you like.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "872875571359649812",
    "author": "sethearnest",
    "date": "2021-08-05",
    "content": "Yeah, I've been hearing more and more of that \"limiter crackle\" sound on music out in the world, as well. \n\nAny limiter pushed hard will start to do that, but I've noticed that especially happening with pianos and FF ProL2 more so than other limiters or other instruments.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "981483465339990026",
    "author": "rse",
    "date": "2022-06-01",
    "content": "Loudness is dependent on so many factors, it's affected by all stages of music making, from recording to production choices, to mixing, all the way to the final stages of mastering. It's something that's going to be different for every piece of music and there is indeed no secret formula.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1020801397798744174",
    "author": "peterlabberton",
    "date": "2022-09-17",
    "content": "Yeah, among other things, the mix having been already approved at one point and sent to mastering is a good place to draw the line. I’d say anything that substantively changes the song or requires a real re-mix on your part is grounds for renegotiating, and having that laid out at the outset is always preferable.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1028827295466672248",
    "author": "Zack Hames",
    "date": "2022-10-09",
    "content": "@Nomograph Mastering love how you turned this relatively simple question into a true in depth look at how to confidently make any choice. This is amazing.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1045546117988880448",
    "author": "popaganda.",
    "date": "2022-11-24",
    "content": "Soundtoys bundle and pro-Q 3. That’s the correct answer. Any decent limiter is fine if you’re gonna take it off before master anyway",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1070558452155428954",
    "author": "Slow Hand",
    "date": "2023-02-01",
    "content": "I generally agree with everything that Ryan is saying. At *least* set your rate higher and then negotiate to a lower rate if necessary.\n\nAlso, the fact that people aren’t saying no to your rates at *all* tells me that you’re not charging nearly as much as you could or should be charging. If you put out a rate and people don’t even haggle with you then you’re charging far too low.\n\nBy the sound of it you haven’t even come close to hitting the ceiling on your worth.\n\nI’ve heard your mixes. You’re not in any danger of overcharging here. You’re doing good work.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133958415840989236",
    "author": "LAPhill",
    "date": "2023-07-26",
    "content": "This is the thing that matters, man. That's TWO reallys. Sounds to me like this mastering engineer doesn't understand the song, and no amount of turning it down is going to change that.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133965202858193058",
    "author": "peterlabberton",
    "date": "2023-07-26",
    "content": "Highest lufs, of course",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1227316497358258296",
    "author": "cian riordan",
    "date": "2024-04-09",
    "content": "Mastering engineer always gets a final mix and an instrumental (and for pop, usually an acapella). Same mix bus processing on everything — usually 5dB down from my limited ref client has been listening to.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268622918129160253",
    "author": "Nomograph Mastering",
    "date": "2024-08-01",
    "content": "Save some time at the end of the day to launch your YouTube mastering channel selling courses",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1273007593304096798",
    "author": "Zakhiggins",
    "date": "2024-08-13",
    "content": "Ive found myself getting some extra loudness recently by putting standardclip before a limiter on my group buses, not the master bus. Id use standardclip gently to just catch and even out the transients. And the limiter not to limit, but to basically gain stage post plugins. Not every bus, usually just drums and maaaybe bass or something thats very pokey. I find i can get way more out of my master bus limiter that way while keeping the dynamics.\n\nAlso standardclip is cool if u automate up the gain and down the clip on a vocal that is dynamic if you want it to distort tastefully in parts. Sounds good in shouty loud music",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407098084940320800",
    "author": "NoahNeedleman",
    "date": "2025-08-18",
    "content": "Why’d you glue your toaster to the ceiling?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407297661173760072",
    "author": "masteredbyjack",
    "date": "2025-08-19",
    "content": "From my side -- this gets down to \"what is mastering even for?\" territory -- but to the question at hand, it completely depends. As it must. Every project and song is different. Even on the same project, from the same mixer, it can vary widely. Mixers differ in how they deliver as well.\n\nMy opinon is mixers should take the song as far as they can, get it as close to finished as possible, this is better for the music to me. Don't even think about mastering. Then any great ME can add more x/y/z as they hear it (not always level, mastering is also about restraint). \n\nIf you can be concerned with making the music the most itself and singular as possible, really listening for the song, you are doing the right thing. Maybe it needs to be loud, maybe not. Often it seems to me there is a misplaced focus on continuity, or a comparison to a reference, which leads me to ask...are we listening for the music anymore? Or some target that is not what we've actually made?\n\nJust listen for what's there, and do absolutely everything you know how to do to help that. Any competent ME can take it from there, however you prefer to deliver",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1416103859239256256",
    "author": "oaklandmatt",
    "date": "2025-09-12",
    "content": "A lot of the conversation about saturation on the streams we did is useful if you already understand compression. Jon talked quite a bit about sometimes using saturation instead of compression, but that is actually a pretty subtle point because most things that Jon mixes **already have tons of compression on them**. So I would say using compressors and limiters is the best place to start with making sounds you've recorded FEEL loud without just turning them up.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472348319035429098",
    "author": "Nomograph Mastering",
    "date": "2026-02-14",
    "content": "A mistake I see over and over is people mistaking energy in the room caused by loudness for excitement and energy in the mix",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "809960164844240926",
    "author": "Seanhmusic",
    "date": "2021-02-12",
    "content": "I've been happy with my Mastering chain. Just figured if this was a life changer, I'd get it. But... Probably isn't.\nWill check it out through. Good call 👍🏼",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "824750940350578759",
    "author": "oaklandmatt",
    "date": "2021-03-25",
    "content": "Ooooo we talked about it in this weeks live (I think?). It's in the first 30 minutes (before Cian). Jon talked about guys like Skrillex who will do LESS limiting for the club, so the records can sound dynamic and huge, but then extra crunchy when you jam them through the club's PA system. I don't know a huge amount about that world, but it makes sense to me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828311445841903626",
    "author": "David Fuller",
    "date": "2021-04-04",
    "content": "this is a fairly recent mastering session I did in pro tools",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "839178979818209281",
    "author": "hendrick",
    "date": "2021-05-04",
    "content": "i use distrokid too and it’s an extra step https://distrokid.zendesk.com/hc/en-us/articles/360013533774-Can-I-Add-Producer-Songwriter-Credits-Liner-Notes-and-Metadata-to-My-Songs-",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "857390731748311071",
    "author": "hendrick",
    "date": "2021-06-23",
    "content": "this is my last week on my mastering class for berklee and coincidentally i yesterday asked about mastering for vinyl since it wasn’t covered in depth during the class. here are my class notes",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "864342511832662026",
    "author": "David Fuller",
    "date": "2021-07-12",
    "content": "Yes, but at the same time, just setting your limiter ceiling at -1dB will never ever be an issue",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "876891115251466251",
    "author": "Slow Hand",
    "date": "2021-08-16",
    "content": "Neat question. If you're mixing in two channels (L/R) the headroom should be the same no matter where you pan it (with some caveats which we'll get to). If you have a kick drum panned dead center coming in at -6dB on your digital meter it's going to be coming in at -6 in both the L channel and -6 in the R channel. Each channel has it's own independent headroom that doesn't affect the other (until we add a limiter with linked channels), so let's simplify things a bit and mute the R channel for now:\n\nNow you have your L channel with the kick panned \"center\" and the R channel is muted.  If you were to pan this kick to the hard left it would not affect the volume of the L channel at all. That's because the panning effect is created by subtracting gain from the R channel only. Making the kick sound like it's leaning to the left.\n\nNow there's one big element I've left out so far, and that's *pan law*. Ableton Live has a -3dB pan law. This means that sounds panned to the center are reduced by 3dB. Because if a sound is being played at the same volume by both the L and R channels then their voltage will combine to create a sound that is louder than intended. So all DAWs and mixers compensate for this added loudness by turning down the gain of sounds as they are panned closer to the center (and shared between both speakers).\n\nSince all modern DAWs and mixers have pan laws implemented, what happens when you now pan the kick hard left is that it ends up becoming 3dB louder than it was when it was panned in the center, because it is no longer being turned down by the pan law when it’s centered.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "941765670985666660",
    "author": "cian riordan",
    "date": "2022-02-11",
    "content": "Here’s an “intimate” vocal sound recorded in a large, yet controlled room. https://open.spotify.com/track/1OkhUK3n5Tzlvloaoi4G9y?si=tW_F3XwQSVuGIwdMLeqOoQ",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "943244611936198677",
    "author": "samvalentine",
    "date": "2022-02-15",
    "content": "My take away from that segment, if I'm remembering correctly, was that Jon doesn't use clip gain for 100% of his dynamic control. Instead, he carefully clip gains each transient/syllable/word/phrase into his dynamic processing (e.g., compressor, saturation, limiter), giving him precise control over how hard he hits the limiter.\nI suppose another method to achieve similar results and that level of control would be to clip gain without processing, and then initiate a limiter (or your choice of dynamic processor) and automate the threshold and output to achieve the desired performance, but that seems like way more work to me.\nI think Jon's method works well and I've been using it myself for a while. It would be interesting to hear of alternative workflows from the rest of the community though!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "972936566873927771",
    "author": "alex_epton",
    "date": "2022-05-08",
    "content": "Do a quick balance first. With everything in. Don’t spend more than 15 mins on this. Check it on your aura tones too or whatever small alt speakers you use. Then put your two buss clipping/ limiting /any EQ you think you might need. Adjust this stuff til it sounds good and you’re hitting your target level. Get it as close as you can without touching your individual tracks. Then start dealing with little stuff on individual elements: Resonances. Masking. vocal sibilance. boomyness etc… needless to say you wanna sit down and tackle this with fresh ears. Your balance is probably the single most important thing you’re gonna do as a mixer. So do editing /cleaning clicks and vocal tuning on a different day",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1045788287945687100",
    "author": "Adam Thein",
    "date": "2022-11-25",
    "content": "The cynic in me thinks this is Spotify trying to save server space",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066165047740596314",
    "author": "Nomograph Mastering",
    "date": "2023-01-20",
    "content": "The AI can sort the 800 “for mastering”, “Rory”, “mixes” folders that I get sent",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1068771403421204510",
    "author": "NoahNeedleman",
    "date": "2023-01-27",
    "content": "I send tracks to drummers or string players or vocalists etc allll the time. I want them recording at a healthy level, something that fits with everything I’ve recorded & mixed. If I’ve done my job on the mix end, it’s already sounding great. \nThink of it like this- how would it be if he/she/they were in the room tracking with you? \n\nAlso- it’s not hard at all to just send both. “Here’s what it’ll sound like with the limiter on, here’s one to track to.”",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104928405968912424",
    "author": "cian riordan",
    "date": "2023-05-07",
    "content": "Mastering.com is the biggest scam out there. @aemaury has been on their case for years.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104928891317002244",
    "author": "Deleted User",
    "date": "2023-05-07",
    "content": "mastering.com is one hell of a big dick domain",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1122194838884986952",
    "author": "masteredbyjack",
    "date": "2023-06-24",
    "content": "Glad to hear it! There's a huge part of the discussion we are leaving out about ambitions, goals, etc, I posted that as much for you as the many others I see get frustrated too. So I like to challenge, sorta how @Nomograph Mastering does sometimes. The frustration solves nothing. But it's a data point. If what you are doing isn't working, it's time to change and adapt. The world isn't fair, mostly no one who would hire you actually cares about how you are feeling or what's happening in your life. Or even some sense of loyalty for what we have done before. Do we bring value? And how can we bring more? That's all that matters really. And it is brutal and hard. It still very much is for me too. But I'm on the Goggins tip and I sorta love that about the game. \n\nSo I guess it depends on what your long term creative and life goals are if filling the calendar is a worthy goal of course!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1131784904896684043",
    "author": "CameronKuwada",
    "date": "2023-07-20",
    "content": "This is an exercise I came up with when I first started ear training: Take a bright snap (one that has freqs up to 20k) and put it in a song/beat. Make three copies of the snap track and put one snap on each track, each spaced apart equally in space. In the first, put a lowpass up to 2.5k, in the 2nd, back up lowpass to 5k, in third, back up to 10k, and in the last, no low pass. as you play this track and cycle through snaps, you'll start to hear the differences in the various ranges from 2.5k - 10k and beyond (assuming good monitoring), and also how the equal loudness curve works.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133967567325757581",
    "author": "cian riordan",
    "date": "2023-07-26",
    "content": "It’s ok to be client first (I try to be), and maybe this guys version of that is trying to get the best product over the line, not just working with the goods that are sent his way. Not saying he’s right… I don’t know any of the players or the skill involved in this entire conversations, but this isn’t some Brian Lucey level fuckery here…. Just a mastering engineer badgering a client for more headroom.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1146097400717529119",
    "author": "chrissorem",
    "date": "2023-08-29",
    "content": "It depends,  typically it all comes out of the artist Budget. At times the producer will present a  all in budget whey they would account for their fee for producing and all other costs such as studio time, hired musicians, food any rentals, mixing and mastering ect.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1185692603476357340",
    "author": "Nomograph Mastering",
    "date": "2023-12-16",
    "content": "Objectivity is the heart of mastering IMO",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1198027871332085882",
    "author": "noahc",
    "date": "2024-01-19",
    "content": "I was just watching a mastering live the other day and it was discussed that Spotify plays back @ 44.1k. So if you had submitted a 48k file it does live conversion which may sound worse than submitting 44.1k that was converted before submission. The option is good to have if needed.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1217669833978548295",
    "author": "LAPhill",
    "date": "2024-03-13",
    "content": "If you're doing any kind of office or flex space, be very up front about what you'll use the room for. They're not going to have much isolation, and other people renting aren't going to necessarily want to put up with it during business hours. I had a couple friends do that, and they had to use headphones during the day until everyone left. They were fine with it, but it would've been a real drag for me. (Also limiting in terms of when you can have client playbacks, vocal sessions, etc.)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1257394303051890788",
    "author": "cian riordan",
    "date": "2024-07-01",
    "content": "Well here's to expanding those horizons for you! This song has 3 drummers: https://open.spotify.com/track/6JaXPOG6EAgADT70upQaRO?si=b4efb872250645a6",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266093721083056240",
    "author": "Rollmottle",
    "date": "2024-07-25",
    "content": "Easy solution: trampoline on the ceiling too",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1274803097603936337",
    "author": "Eric Martin",
    "date": "2024-08-18",
    "content": "keep an eye on average volume also, some instruments might have a very low peak to average where if you record the peaks might not be very high, but the average is, I try to keep faders at zero but perceive the loudness, so drum peaks can be much higher than guitar peaks because drums have a very wide peak to average ratio, distorted guitars peak to average level is generally very low where the peak is not much higher than the average.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345086844261367838",
    "author": "Josh Bowman",
    "date": "2025-02-28",
    "content": "Not always. I only go deep on tweaking my limiter settings if it seems like a roadblock/im not getting what I need out of it when the mix is close to done... But I’m also one of those people who sends a non limited as well as limited ref to my mastering engineer and he generally starts with my non lim and ends up beating my loud ref. So I’m not super worried about the details on the limiter unless the song has to get super super loud and I’m fighting for half dbs, or it’s not working for me/feeling right using my go-to. \n\nTomorrow maybe I’ll change it up and go in on it now tho!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407354414020165718",
    "author": "masteredbyjack",
    "date": "2025-08-19",
    "content": "And would encourage @louisvie to not consider what mastering may or may not bring, and take it as far as he can himself given skills he has now, not assuming mastering will do anything",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1416105246371090605",
    "author": "oaklandmatt",
    "date": "2025-09-12",
    "content": "When Jon receives a song to mix, there is almost always a lot of compression on the individual stems, especially drums and vocals. So he does more subtle moves to bring out the best in each mix. If you're recording stuff yourself, you will likely want to add a lot of compression to get the same modern, perceived loudness.\n\nThe fundamental thing to know is that \"compression\" simply means \"reducing the dynamic range\" (aka \"compressing\" the range of volume of your sound ). This can be achieved with \"compressors\" as well as \"limiters,\" \"saturators,\" \"clippers,\" \"distortion,\" and a number of other types of effects that do it in different ways (and may add other sonic characteristics to your sound).",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "809960664159617054",
    "author": "Rollmottle",
    "date": "2021-02-12",
    "content": "An SSL wouldn't be the first thing I'd reach for in a mastering context. Mixing, yes. Depends what need you're trying to fill",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "837370354254479430",
    "author": "Eric Martin",
    "date": "2021-04-29",
    "content": "test pressings don’t work that way, the test pressing is to determine if the cut and plating has any problems, if it does all 5 of the pressings will have the same problems in the same spots.\n\nWhat you need to do is sit and listen with a notepad noting the times of the “problems” you hear, on each pressing, then if all of them have the same issue, then you have a problem with the pressing.\n\nIf you know the cutting engineer that’s the best.\n\nMy cutting engineer said, “watch sibilance and take all loudness processing off, driver at -18 and you know then you’ll have a decent vinyl master.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843999976958197780",
    "author": "Rollmottle",
    "date": "2021-05-17",
    "content": "I've never used the hardware, but I love the UA LA-2A on bass. You can really lay into the thing especially fucking with the emphasis to find the right tonal balance vs. limiting",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "847882494736203856",
    "author": "Rollmottle",
    "date": "2021-05-28",
    "content": "At its most basic, ceiling above listening position, first reflections at front of room, and the rear wall are most critical",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "868599310617571339",
    "author": "David Fuller",
    "date": "2021-07-24",
    "content": "I'd say stick a limiter on so it doesn't clip and proceed to not worry about it too much",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "943255132055932939",
    "author": "oaklandmatt",
    "date": "2022-02-15",
    "content": "@sloth the reason is use clip gain is so you're not relying on the limiter or compressor to level out the sound. rather, you're using the limiter or compressor for the SOUND it creates. if you want that super compressed sound (or even that lightly compressed sound) of an actual compressor or limiter, you'll often get better results if the signal going into it is evened out a bit. this used to be solved mostly by great mic technique, where a singer would lean back on big notes and whatnot. but these days by using clip gain to even out the sound before it hits your dynamic processing, you can actually more fully lean into the SOUND of the compressor or limiter that comes after it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1028829374818025482",
    "author": "Nomograph Mastering",
    "date": "2022-10-09",
    "content": "https://open.spotify.com/track/7bo5fo5SM0EHAVC2SuGWfd?si=BAAlHT2lTIGdRkfDXRAgSA",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033511743244222484",
    "author": "1ggy",
    "date": "2022-10-22",
    "content": "Love this @Nomograph Mastering",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1036871786756833300",
    "author": "NoahNeedleman",
    "date": "2022-10-31",
    "content": "Pretty much all the info above is great for general understanding. (And I do mean *great*)\n\nTo answer your other question, my personal approach usually leads me to making up 2-3db on 2buss processing. So before I instantiate and add any gain from inflators or limiters at the end of my master fader chain, I have 2-3db of headroom. \nStarting with kik snare bass around -6db, adding in vocals and everything else all balanced properly usually gets me to around -2. Which is more than enough for a mastering engineer but not enough to get myself into trouble tryna get to make it loud with my Ozone or whatever. \n\nThat’s just my process currently. No doubt there’s different ways to get there, some likely much better, but this has been working well for my purposes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1045510154839400498",
    "author": "Adam Thein",
    "date": "2022-11-24",
    "content": "You can snag Izotope Ozone Elements (super basic version) for free here https://www.jrrshop.com/izotope-ozone-elements\n\nThat includes the maximizer module but only with IRC I and IRC II modes, but that would be enough to get you started into trying an alternative limiter.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058699738637140008",
    "author": "spectrummasters",
    "date": "2022-12-31",
    "content": "Hi all, just wanted to give a quick heads up,  , Ive no affiliation to it just thought it might be useful potentially for someone in here .Mike bozzi is offering an albums worth of free mastering to one of his IG followers in jan 2023. Check his IG for info. happy NY",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1068773454272286780",
    "author": "NoahNeedleman",
    "date": "2023-01-27",
    "content": "Also MOST of the 2buss processing is included, just not the final loudness plugs. I’ve got like 4 plugs I mix into",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070549307314417826",
    "author": "Zack Hames",
    "date": "2023-02-01",
    "content": "I’m transitioning out of my $200/song mixing phase. Trying to move to 250-300, and NOT “mastering” ever again.\n\n(I’m in Kansas City Missouri for reference.)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1091385285180391535",
    "author": "David Fuller",
    "date": "2023-03-31",
    "content": "on a more philosophical level - a mix is ready to send for mastering when it sounds (and arguably more importantly, feels) good. What does that mean? Good question.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115671957661307000",
    "author": "oaklandmatt",
    "date": "2023-06-06",
    "content": "https://open.spotify.com/track/39Pudjd7JS8NosYN24m7Hc?si=wziQV78WSNeBx0hfwa8YEA",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121936327735259196",
    "author": "Deleted User",
    "date": "2023-06-23",
    "content": "Mixing and mastering can mess up carefully crafted arrangements/recordings. In order for someone to give it a go with you, it would take some level of trust that they won’t be getting back a fucked up mix. \n\nI’m a producer that occasionally mix for others, and I found it the easiest to get in on earning people’s trust by offering other things first. Record them, or tune vocals for them and then let them know you also mix. People are more likely to record with someone they don’t know yet than to have someone they don’t know mix or produce their stuff.\n\nAs a producer, I’d deny free offers from new mixer to mix what I’m working on unless I have heard their work and I like them. I’ve had people ask if I need mixing and offered through their relationship with the artists- it always came back fucked… at least so far. So try to get in with producers through offering other stuff like engineering in writing sessions. Comp and tune the demo vocals you got from the writing session, if you do a great job they’ll more likely to give it a go with you. Don’t ask too early, make sure you build a good rapport with them first. Vocal tuning can fuck things up just as bad as mixing, so try to find things where you can just do it (e.g. you just recorded vocals for someone) over asking people if they need their vocals tuned.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133952807750357012",
    "author": "AJ",
    "date": "2023-07-26",
    "content": "The first email was asking for the regular, one without a limiter, and one with less limiter. That was totally fine to me. But the follow up email was about it being quieter overall",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133953612876353606",
    "author": "AJ",
    "date": "2023-07-26",
    "content": "They said the mix was too loud and compressed. This was because it reaches -5 LUFS in loudness and clips above 0 db. They said the bass was choked/the low end doesn't have room to grow. Ideally they would master to be -7 LUFS average with -6 LUFS at the loudest part of the song.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133956000655876107",
    "author": "NoahNeedleman",
    "date": "2023-07-26",
    "content": "To answer your question, it doesn’t happen often that you’ve got a producer a mixer and a mastering engineer that are at odds. Are you the artist?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133958553091194981",
    "author": "Deleted User",
    "date": "2023-07-26",
    "content": "you not knowing much shouldn’t be an issue at all. in fact, artists shouldn’t need to worry about this kind of stuff after getting the song to the finish line. that’s why we hire mastering engineers, to have someone that gets to hear it for the first time sign off on it to tell you “you’re good to go”",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133963649766137868",
    "author": "cian riordan",
    "date": "2023-07-26",
    "content": "I dunno, mastering engineer coming back after seeing a -5 mix asking for something a little less limited seems pretty reasonable. Maybe he’s the wrong engineer, maybe the beds already made for the song, but nothing seems nefarious or out of bounds here.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133967142140780695",
    "author": "cian riordan",
    "date": "2023-07-26",
    "content": "Sorry I feel like I’m taking crazy pills reading all this. I totally get this is the priority, but these are things baked in well before mastering. And if the mastering engineer feels like he doesn’t have the goods to make a quality master even after peeling off a few db or a limiter, then you have to take him at his word for his technical insight or move on. But his requests don’t seem unreasonable.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1167648799578136669",
    "author": "Nomograph Mastering",
    "date": "2023-10-27",
    "content": "I’m not sure there’s any reason for a mixer to be doing it. Mastering should handle if it needs to happen but 95% of the time we submit 48 or 96k masters",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1181089762753384509",
    "author": "popthetrunk",
    "date": "2023-12-03",
    "content": "Check this out https://open.spotify.com/episode/1zGxZnYpW3sI3t1sb7PPlQ?si=R7zpU6TTTKyZxQbdYaT0Mg",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222750149277909082",
    "author": "BoozleBAM",
    "date": "2024-03-27",
    "content": "@Nomograph Mastering I was actually telling @NoahNeedleman that I've got a 6i6 that sounds great and also does spidif, but it has to be connected to USB and so does my tascam - The two brains of each machine tend to want to fight eachother for control, I think, and I'm constantly having to reset the focusrite in the control panel. Super fickle and super annoying. So, if I can get the Roland unit to work without squealing, that would be sweet.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1232211140600139836",
    "author": "Nomograph Mastering",
    "date": "2024-04-22",
    "content": "Allmusic isn’t really it anymore, most people depend on a combination of Tidal, Bandcamp, Wikipedia and lately Apple music for credits",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256438874670895159",
    "author": "BatMeckley",
    "date": "2024-06-28",
    "content": "https://open.spotify.com/track/4m3OS54KWywYhP7WD7z1cg?si=Wf3zScTUSKiOoXcKzvGaDg",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256443861568589824",
    "author": "BoozleBAM",
    "date": "2024-06-28",
    "content": "@Nomograph Mastering  And these types of conversations are so, soo difficult to have over the internet - Especially two people who don't know eachother at all. So, I'm not trying to be a dick here...",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263739011139244034",
    "author": "Felix Byrne",
    "date": "2024-07-18",
    "content": "before 2006 every first pass went straight to mastering.. the good old days",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1268622606374797374",
    "author": "NoahNeedleman",
    "date": "2024-08-01",
    "content": "Put them all into one session, adjust levels (clip gain or limiting) accordingly, bounce again",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1295620368375087205",
    "author": "spectrummasters",
    "date": "2024-10-14",
    "content": "Radio used to use phase rotations to allow for more desirable response from the program material and the limiter when broadcasting , so  you might find that an interesting little part of broadcast history to look into . That’s stereo (master ) material and phase rotations",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345034936117362780",
    "author": "masteredbyjack",
    "date": "2025-02-28",
    "content": "Last thing I'll say but if you're looking to learn limiting well I'd suggest picking one or two -- Pro L2 and Ozone can't go wrong -- use those on everything, really understand what the parameters do. Then those will broadly apply to others, the fundamentals",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1397995570039230628",
    "author": "hyanrarvey",
    "date": "2025-07-24",
    "content": "1. Write song \n2. Demo song \n3. Track drums\n4. Edit/comp drums\n5. Track guitars\n6. Comp and edit as needed\n7. Track bass \n8. Comp and edit as needed\n9. Track vocals\n10. Comp, tune and edit as needed\n11. Track lead guitars and synths or extra production \n12. Comp and edit as needed\n13. Organize and clean up session\n14. Mix said song \n15. Do revisions on said mix till needed\n16. Send song to mastering\n17. Upload said master to DSP of choice \n18. Repeat steps 1-17 till satisfied",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1398688322859171943",
    "author": "Bryan DiMaio",
    "date": "2025-07-26",
    "content": "Like a month from today, I hope to see a BoozleBAM song in my Apple Music library",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407339573767438356",
    "author": "NoahNeedleman",
    "date": "2025-08-19",
    "content": "Short answer; it’s program dependent. And everything depends on everything. \n\nLong answer:\n\nI spent a long time hoping MEs would answer these questions for me, but honestly not a one of them knows wtf they’re doing. Certainly not enough to quantify things like “how much louder will I make your track.”\n\nBest thing I did along the way was develop relationships with MEs. Usually one at a time, and worked through my questions in real time. Figured out what happened when masters come back and i felt amazing vs when they come back and I felt just ok. \n\nOver time I’ve developed a philosophy for myself, (and while that changes/evolves over time,) I’m now confident when I send a mix to master that what I’ll get back will be a more finished  version of my ideas. And “more finished” is not necessarily correlated to “how loud.”",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407342228392906863",
    "author": "masteredbyjack",
    "date": "2025-08-19",
    "content": "I find this perspective interesting. I suppose the original post also almost implies that the mastering is bringing a lot to how the mixes are presenting too -- which maybe it is maybe it isn't. But I think it's important for mixers (all of us really) to know though...the people at the top, like really at the top who you are most likely comparing to are unbelievably good. Not kinda good. Like REALLY good, and there is often a big gulf between them and even more mid-tier, on the way up folks (who are still very legit pros). And when you really hear it, it's shocking. And inspiring. And you realize why they are there",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407376472913477704",
    "author": "Nomograph Mastering",
    "date": "2025-08-19",
    "content": "Mastering is in part about us attending to your blind spots - either because you *can’t* hear on your speakers, or lost perspective, or knew what you wanted but maybe we have a better approach to the same problem or opportunity",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1416102289126588548",
    "author": "masteredbyjack",
    "date": "2025-09-12",
    "content": "But shooting for a certain lufs number is a bad time (not saying you are). Arrangement, vocal level, overall eq all play a big role in perceived loudness.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1452651742524346409",
    "author": "Bryan DiMaio",
    "date": "2025-12-22",
    "content": "The base model already comes with 16GB of RAM which is great for tracking/mixing/mastering but you can increase the RAM if you want. Personally I think 24 or 32 is the sweet spot, then just get as much storage as you feel you need. The base M4 on the Mac mini or M5 on the MacBook Pro is so fast, faster than the M2 Max I’ve been using on my 16” MBP",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1455084842382393435",
    "author": "Rollmottle",
    "date": "2025-12-28",
    "content": "Just taking the time to figure out the right changeover strategy and timing so that I could actually make the move once I basically had two fully functioning rigs stood up in parallel. My additional complicating factor is having a laptop that is a dupe of the studio rig, so keeping it all straight and everything in sync is a bit of a puzzle. \n\nI took the transition as the opportunity to phase out some mechanical drives so I had to get some new drives for the M4 instead of re-using the old Time Machine mechanical drive. The M4 mini only has Thunderbolt/USB C ports -- the M1 has USB A's and Thunderbolt/USB C's so I needed a TB hub to get my old USB hub to play on the M4. The move forced me to sort out my iLok strategy between my mastering rig and my production rig because it was quite messy (I ended up getting a 2nd iLok for the M4 to make things way easier between it and the laptop). It was just a lot of little stuff for me. If you're not changing machine form factors and it's mostly a software exercise, then it might be worth it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472408951172890778",
    "author": "masteredbyjack",
    "date": "2026-02-14",
    "content": "For real, get over to monitoring. Once you have better monitoring so many things fall into place. You can work for 12 hours easy. No breaks no problem. And you won’t lose the plot of how things should sound. You’ll be unleashed.\n\n@Nomograph Mastering is a sage at this, listen to him. His knowledge is hard won, don’t get in your own way and convince yourself it’s a breaks thing.\n\nLike Ruairi says you can do a lot with a little heart and energy even if you don’t have the cash yet",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "812263610633682984",
    "author": "Deleted User",
    "date": "2021-02-19",
    "content": "To my ears M50s sound very congested, especially in comparison to their direct competition - Beyer 770s(I own both). The transients(which for me are absolutely crucial to hear when producing or mixing) are almost inaudible on the M50s, while decently audible on the 770s. I do not find the M50s or the 770s even close to \"well balanced\", they both are a bit too budget for that distinction(they both have extreme presence peaks at their respective frequencies). I know someone who is very happy with the Shure SRH940s and Shure 1840s for critical listening(same drivers, I think). The M50s and 770s are both pretty much unusable in the low end under 50-60hz for me, I don't feel they translate well there. A few mastering engineers use the Blue closed-back headphones as a low-end reference, they would probably be worth a try. Audeze stuff is pretty good for transient response, but more expensive.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "824703401068724266",
    "author": "Slow Hand",
    "date": "2021-03-25",
    "content": "One question I would consider, though, is whether or not to bypass any master limiting for the live version of the track. If the mix is such that you're taking off a lot of transients on the master buss, it may sound better to ease off the limiter or bypass it entirely so that the live sound engineer will have plenty of headroom to work with and isn't trying to mix around a track that's massively limited. Having that extra headroom and transient energy could be a benefit, thought you'll have to use your ears to make that judgement, and definitely talk to the artist.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "824703950409564262",
    "author": "Slow Hand",
    "date": "2021-03-25",
    "content": "It could be that the limiter is what's gluing the entire mix together and without it the track loses a certain feel. In such a case, you probably would not want to do that, if the limiter is holding it together.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "824704571422015539",
    "author": "mixedbyKerim",
    "date": "2021-03-25",
    "content": "@Slow Hand  got it bro💪🏻 if it sounds good leave it, obviously first time doing something like this , sheesh last thing i was thinking of was the limiter , good stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "824705150492606484",
    "author": "Rollmottle",
    "date": "2021-03-25",
    "content": "When I've done it, I've left the limiter on so that everything coming out of the Live set is a known quantity and level can be dealt with on the analog side. Done for level and practical reasons, not tonal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "824707617740816396",
    "author": "Rollmottle",
    "date": "2021-03-25",
    "content": "In my case, it's been a club setting and the tracks need to be jamming so I applied a bunch of processing across the 2-bus to achieve a consistent \"mastering\" level...especially when the source is a mix of mastered tracks and non-mastered tracks, you gotta level match what's going into the 2-bus and then make sure everything coming out is generally at the same level without crushing everything.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828309982998954014",
    "author": "David Fuller",
    "date": "2021-04-04",
    "content": "That's part of mastering generally",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828310853707235346",
    "author": "David Fuller",
    "date": "2021-04-04",
    "content": "so in a mastering context you basically just place them such that you can crossfade between the tail of one song and the beginning of the next",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828570203478294540",
    "author": "mixedbywong_my",
    "date": "2021-04-05",
    "content": "If I’m mixing an ep for streaming , say it’s a -10 lufs ep. Should I still use these masters for a cd version ? 💿",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "828621298380439572",
    "author": "David Fuller",
    "date": "2021-04-05",
    "content": "I'd err towards the CD loudness one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "830445927209631764",
    "author": "Eric Martin",
    "date": "2021-04-10",
    "content": "Pretty much just the meters next to the faders on PT, with calibration they correlate to loudness in the room. I use the standard RMS + Peak metering next to the fader and that works well.\n\nI have a bunch of others but I don’t use them that often, usually I pull up my mix in RX7 before I send it to see the waveform stats that it reads out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "830446572290310165",
    "author": "mixedbywong_my",
    "date": "2021-04-10",
    "content": "Yea . I do the same with rx7 also . Just wondering if thats any accurate ? I usually get lesser numbers (integrated LUFS) than what I get inside of Cubase .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "835072191266684938",
    "author": "Zack Hames",
    "date": "2021-04-23",
    "content": "What’s the best pitch shift plugin for vocals for adding that low/octave below effect that’s all over stuff the last 5 or so years? Ie:\n\nhttps://open.spotify.com/track/0KS2h61pHQ4WmOwruD7uxD?si=BZCjMXQJSsKHv3IZGtOTjw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "839178740805271602",
    "author": "Zakhiggins",
    "date": "2021-05-04",
    "content": "What distributor you using? Last time I uploaded something to distrokid I don't think it had any options for that sorta stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "847059621256495125",
    "author": "$$C Z00BOY",
    "date": "2021-05-26",
    "content": "Not sure if this is helpful for you, but I’ve really learnt over the last year.. getting the kick in tune and the decay, release in time with the song with help from an adsr in a sampler (i use maschine) will really get you there 90% ! might sound boring around all gear talk but the drums will def smack hard and keep all that fat low end intact! Also with the right adsr setting you can get punch, tightness and control of a kick a compressor wouldn’t be able to get 🔥🚀 \nand if you still want more energy or aggression , instead of using parallel compression, send the kick parallel to a buss with some saturation to bring out some tone followed with a limiter might be worth a try!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "847881730441347073",
    "author": "peterlabberton",
    "date": "2021-05-28",
    "content": "I’m sure you’ve read this or could find it with a quick google search, but starting with the first reflection points would be my first step. Side walls next to the listening position and ceiling above. Then probably behind the listening position and perhaps behind the speakers. If you have anything to use as a bass trap, I’d recommend using something like fuzzmeasure to shoot the room and experiment with placing that stuff in different places. You’ll be able to see peaks and valleys moving around in the low end, assuming what you’re using is actually effective at sucking up bass. There are people with much more knowledge than me, but that’s where I’d start!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "857126397662461972",
    "author": "cian riordan",
    "date": "2021-06-22",
    "content": "I would tell them there's a few things to consider when pressing vinyl:\n1) Mastering is especially important as it’s the real bridge between the music and the mechanical production of the record. I had the great pleasure of mastering a few records for vinyl with Doug Sax (give him a google) and there’s a lot more to the process than modern mastering for digital services. They will actually cut the acetate disc which will be what manufacturers use to make the metal stamper that actually molds the records. A lot of thought goes into this process such as the width of the grooves to accommodate bass frequencies, etc. If you want a good sounding record, there’s no way around working with a seasoned professional.\n\n2) Side lengths are important, as is track order. The more music you put on a side of vinyl, the less fidelity it will have as a whole. There will be sacrifices in the manufacturing to accommodate all of the music, so it’s best to keep your side lengths under 20 mins. Closer to 15 mins per side is ideal sonically, but sometimes that means doing double records and that just gets expensive. Also the order in which the tracks play on each side plays a part. The songs at the beginning of the side have more bandwidth and less distortion… it basically diminishes the closer you get to the center. Whatever the last track on the side is will just sound worse. It’s a flaw in the medium… so think about that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "858190102639673345",
    "author": "Rollmottle",
    "date": "2021-06-25",
    "content": "that's pretty much my take too. if it comes back, it's almost always a re-do. granted, it's easier to do in a mastering context, but i'm not going to recall the wrong thing and fight against myself to get it right. i'll just do it again fresh.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "868582479508955146",
    "author": "Ian",
    "date": "2021-07-24",
    "content": "So not quite a music question but ive been editing twitch vods and they are super quiet since I have to upload to YouTube. I can push the clip gain in the video software all the way up and not clip before I bring it into protools for final limiting. I still end up around -20 LUFS before limiting which means I need about 6 LUFS to bring it to YouTube 's -14 standard. So my question is what strategies with gain staging etc would you recommend so that im not having the limiter clamp too much when I go to do final export?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "868599245849116712",
    "author": "David Fuller",
    "date": "2021-07-24",
    "content": "considering television broadcast is generally around -23 LUFS with peaks no higher than -2dBTP",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "875741731717529701",
    "author": "mixedbywong_my",
    "date": "2021-08-13",
    "content": "The overheads sounding really phased out . Almost makes me think that the pair of mics were facing up the ceiling . And the room mic is kinda … shit. I have a feeling even though I’m not a recording engineer , that the engineer didn’t know how to mic the kit properly . 😌",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "875741785962446878",
    "author": "Zack Hames",
    "date": "2021-08-13",
    "content": "Also beyond “fixing” the best thing i ever learned for drum mixing was drum bus compression, and using saturation on close mics.\n\nMy usual chain is this:\nAll kick and snare mics get some sort of eq if needed. Then I’ll put fab filter Saturn 2 and saturate the high end at around 700hz.\n\nThe I’ll bus all the drums to an aux. then I’ll usually do this:\nTape saturation (waves J37)\nParallel drum compression with a mix knob (fast release, slow attack) I use the kush audio AR-1, I used to use the waves abbey road mastering plugin. \n\nSometimes I’ll use wavesfactory Spectre to boost highs and lows after all that. Maybe soundtoys Sie-Q to boost midrange.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "878003363508265050",
    "author": "David Fuller",
    "date": "2021-08-19",
    "content": "That's something to discuss with the mastering engineer, who does the final sequencing. Assuming there is a mastering engineer in question.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "882063160926961755",
    "author": "chadwahlbrink",
    "date": "2021-08-30",
    "content": "In regards to 32-bit, I try to stick with 32bit until Mastering. This is mainly out of an \"abundance of caution,\" but basically, it's theoretically possible to have rounding errors/quantization distortion (granted at like -128dB) when bouncing between the 32-bit processing within the DAW and other processing like izotope RX or even just bouncing stems from one person to another. Note - there is also a settting in pro tools to \"always use 32-bit for audiosuite processing\" for this reason! Also, you can just use a 24bit dither when you go from 32 to 24bit at mastering stage as needed (if you are providing the master).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "884978411955687454",
    "author": "hendrick",
    "date": "2021-09-07",
    "content": "for the mastering engineers - now i'm thinking about buying the DDP software. could yall tell me why is HOFA better than sonoris? is it because it is easier to use?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "926981750905778177",
    "author": "KushKadett",
    "date": "2022-01-01",
    "content": "I think we're discussing different topics. I'm not talking about if a song is good or not, but the sonic quality of song. For me that means clarity, punch, warmth and loudness",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "926982332823511051",
    "author": "KushKadett",
    "date": "2022-01-01",
    "content": "so yeah: i think it's dishonest to say that most of the favourite songs people have don't run through some expensive gear during the production process of mixing and mastering and it could all be done in the box",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "926982784621346856",
    "author": "peterlabberton",
    "date": "2022-01-01",
    "content": "True, I might be getting sidetracked, certainly dependent on what exactly you are doing! If just mixing/mastering, obviously you have different needs than producing/eng., etc.. I just think it’s wise to be skeptical! (Sometimes perhaps to a fault. 🤷🏻‍♂️)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "939942898974208040",
    "author": "oaklandmatt",
    "date": "2022-02-06",
    "content": "https://open.spotify.com/track/3kv3JzZg7Jq7vHmnMSYQ0r?si=BBNkZ-eOThSF6sRa-CuDWA",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "940764637295673345",
    "author": "cian riordan",
    "date": "2022-02-08",
    "content": "Everything should be identical if the gain-staging is all setup properly. Obviously, it's nice to have access to individual items (cutting EQ on an instrument b/c its clashing w/ vocals, etc) but there's beneficial aspects to this workflow as well (limiting your options, DSP use-age, etc).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "941120027132842035",
    "author": "thejadenmejia",
    "date": "2022-02-09",
    "content": "https://open.spotify.com/track/3QCU8BT0zDS9LPVfEhRFEE?dl_branch=1&si=d5bnfaZPSxeKBJdsgZOjaA\n\nAnyone care to explain what’s going on in these vocals a little?\nI really enjoy them.\nI can get vocals that bright, but it usually just comes out smooth.\nThis has some abrasiveness to it. Ehhh idk. Help me understand what I’m hearing haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "941766555744739419",
    "author": "ALXCPH",
    "date": "2022-02-11",
    "content": "I know it’s not your main genre, but have you ever done any hip hop or 808 based pop music? If do whats your mindset when working with predominantly big transients and a lot of sub frequencies? I’m always struggling getting to competitive loudness. Sometimes it’ll sound great sometimes it won’t. I’m just not very consistent with it tbh.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "972280493284409385",
    "author": "sloth",
    "date": "2022-05-06",
    "content": "Hello people,long question about mix approach & loudness;I'm sorry I typed this at 2 AM :https://docs.google.com/document/d/1BJvpR1AbYFzj2JUKz_kXT9SIEF05lgXtQJ1jAZzxCEQ/edit?usp=sharing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "980334153427988540",
    "author": "ehutton21",
    "date": "2022-05-28",
    "content": "I’m not sure if this is a newbie question or not, but I’ll throw it here anyways and see what happens (I hope it helps newbies too). I’m already somewhat aware of the answers I may get, but who knows. Sorry if this is long, I’m bad at short form.\n\nContext: I have been producing music in sincerity for maybe 3 years now, been a hobby since like 16. I’ve started to engineer out of necessity for my individual artistry, but one thing led to the next and I gained a fair bit of skill at it (or so I’ve been told, I’m still pretty insecure, honestly even being around all the really knowledge people on here makes my panic disorder go 📈). I’ve gotten an internship at a studio as a runner and a session assistant down here (it’s not paid but it’s not exactly unpaid), and I truly have learned a lot (I learn something new on the daily I swear), but I’ve yet to have any true guidance from an established figure yet (which very well may never happen), which I know isn’t necessary, but it absolutely makes me question my own abilities/career decisions despite what happens with my freelance work and I’m curious to know if this is like normal/how other people cope. \n\nLike, I’ve gotten a somewhat okay share of people who pay for my work as an engineer/producer/writer, but the “do you really know what you’re doing” doubt doesn’t fade easily—even when I’ve been paid by people on like label level budgets, I’m never really registering that success. I’ve had cool moments and landed spotify placements as a mixer for artists, and there’s this part of me that’s still somewhat ashamed that I do a lot more work for free than I care to admit. \n\nMaybe it’s the comments on the old episodes that has me spooked (Jon on #61 re: “not everyone can be a mixer”), but is this like just me or do even some of the really wicked smart people here still feel that—and if so, how do you guys handle the it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "981255177329852436",
    "author": "emre",
    "date": "2022-05-31",
    "content": "I'm not sure if its a newbie question or not but is getting louder mixes is releated to 32 bit ? I know it has more dynamic range than 24bit so can i push it more ? I really struggle understaning how to get my mixes loud. Whether I want it or not there's still a loudness war going on and i just want to be able to give my clients what they want if they ask for -6 lufs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "981262559351029840",
    "author": "ALXCPH",
    "date": "2022-05-31",
    "content": "Just go on Spotify or YouTube and search live with Matt rad. I think they have something like loudness pt1 and 2 in their names",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1018966265110462515",
    "author": "Josh",
    "date": "2022-09-12",
    "content": "Gonna be checking out kev’s limiter and the model of @hyanrarvey’s s****c soon!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1018992373063221310",
    "author": "hyanrarvey",
    "date": "2022-09-12",
    "content": "I use it to push into my final limiter/clipper instead of pulling down the threshold",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1020797300982939709",
    "author": "joshua_wav",
    "date": "2022-09-17",
    "content": "hey y’all i could use some advice on how to deal with revisions. i don’t like charging or setting limits but some artists i’ve been working with have been asking for mix changes / arrangement changes months after it got approved and sent to mastering. i had one song where all the drum samples were replaced with live drums, the bass and guitar was recut and a bunch of backgrounds got sent in over the course of 6 months. where do you draw the line on changes like that? i feel like i’m living inside of the ship of theseus thought experiment 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1028828636603760670",
    "author": "cian riordan",
    "date": "2022-10-09",
    "content": "just search on spotify, you'll see many ref tracks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1028828877830750289",
    "author": "ALXCPH",
    "date": "2022-10-09",
    "content": "Search for a 1khz tone on Spotify?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1028829237563621407",
    "author": "ALXCPH",
    "date": "2022-10-09",
    "content": "But isn’t Spotify limited in its output even with normalisation turned off? Have never actually tested it, but i heard someone speak about it once",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1029453899574292552",
    "author": "Rollmottle",
    "date": "2022-10-11",
    "content": "Anything with a SPDIF or an ADAT input should work for integrating a separate DAC for your Apollo. You'd have to ask the braintrust as I have no direct experience with them outside of their stellar reputation. Looks like D90SE gets the nod from @Nomograph Mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033395662139699281",
    "author": "GaspardMurph",
    "date": "2022-10-22",
    "content": "@Nomograph Mastering can you school us on sample rate once and for all ? That way we can choose one and stick with it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1033511284295077938",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "- **Higher sample rates reduce aliasing.** There is effectively no difference between 44.1 and 48k here but a meaningful difference at 96k and above. Aliasing is caused by non linear processes like distortion, and dynamics processing (compressor or limiter). Lots online about what it is and why it happens but you can sum it up by saying it’s an inharmonic, digital sounding hash that can feel bright but in a kind of ugly way (but remember sometimes ugly is good)\n- **Higher sample rates reduce the impact of Anti Imaging and Anti Aliasing filters in AD to DA converters.** Filtering is necessary for accurate capture and replay of analog signals, and it in the early days of digital it used to be a real challenge. Now it’s basically a solved problem, but if you are doing acoustic music, with delicate transient information there is still a small but real advantage to higher rates\n- **Higher sample rates reduce overshoot and inter sample peaks on limiters.** This really only matters if you are sending your loud mixes directly to release, otherwise your mastering girl or guy should handle that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033530955744415784",
    "author": "Nomograph Mastering",
    "date": "2022-10-22",
    "content": "Overthinking lowers risk, but lowers potential rewards an order of magnitude more (this applies less as you get towards mastering)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1036783489053372476",
    "author": "cian riordan",
    "date": "2022-10-31",
    "content": "Sometimes gain staging is just managing the signals going to an auxiliary bus or a master fader. If you’ve got everything summing into - say - an aux bus in pro tools, and that aux bus is clipping, then that will be audible distortion going into the next gain stage. It may sound good, it probably doesn’t — so its something to account for earlier down the chain. If you’re going into a master fader in pro tools, and your signal is over 0dBFS, you can simply turn down the master fader, and it is actually turning down all the signals going to it, not just the output. This is useful because you can then throttle the input to your first plugin in the chain — say a limiter or maximizer. It’d be a shame to have a fancy clipper on your master bus, only to be clipping the signal in the chain before even getting to it.\n\nIt’s a bit of a scattershot answer to a scattershot question, but the reality is that everything affects everything in audio. And having your head wrapped around signals levels going in and out of things will help you make faster decisions and help you troubleshoot quickly when things aren’t sounding quite right.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1045297221798731806",
    "author": "mixedbywong_my",
    "date": "2022-11-24",
    "content": "I was today years old that I realised how good and quick high/low shelving eq is for mixing/mastering . 🫡🫡🫡 \nThat is all.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1045495386619514970",
    "author": "conor // wbotm",
    "date": "2022-11-24",
    "content": "Alright two completely different options but I wanna see you all fight. Am I spending my black friday allowance on Ozone(or even the iZotope bundle) FabFilter Mastering Bundle, or Soundtoys bundle. Right now I've got both production and mixing work lined up for 2022 so both would be used",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1045507050689548428",
    "author": "conor // wbotm",
    "date": "2022-11-24",
    "content": "Very likely leaning towards soundtoys now, only thing I feel I'm missing is a limiter... cough up $18 to get L2 back in my life?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1045778553926602813",
    "author": "Calvin Lauber",
    "date": "2022-11-25",
    "content": "Random q. Spotify “highly” recommends delivering FLAC’s over WAV files… does anyone do this? What is even the difference? I’ve always delivered WAV’s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1045788309202423860",
    "author": "Felix Byrne",
    "date": "2022-11-25",
    "content": "i assume so spotify can save server space",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1057644677853098054",
    "author": "Ross Fortune",
    "date": "2022-12-28",
    "content": "**General**\n\nInterview style material can be great, and sources like Mix With The Masters where you can watch legitimate professionals working while they explain why they do what they do. Of course, you first need to understand the tools in order to understand why people use them in certain ways in specific situations, so building your knowledge of the fundamentals is important.\n\nIn general beware of anything with hyped titles like “30 MIXING HACKS I WISH I KNEW”. The internet is awash with misinformation, so it’s important to assess who the information is coming from, and what their agenda may be (whether that’s building subscribers, or shilling a product etc). If in doubt, research the records these people have worked on, and listen to them to see if you actually like how they sound!\n\n\n**Engineering/Mixing/Production**\n\nSteve Albini / Electrical Audio: https://www.youtube.com/@ElectricalAudioOfficial\n\nMaking records with Eric Valentine: https://www.youtube.com/@mrwev\n\nJust For The Record - Mixing/interview streams - https://www.youtube.com/@JFTRLive\n\nSol State - Clips from longer form streams by (mostly electronic and pop) producers - https://www.youtube.com/@SolStateMusic\n\nLive With Matt Rad (focused around Instagram Live interviews, with a generous community on Discord - generally skewing towards pop)\nInsta: https://www.instagram.com/livewithmattrad/\nDiscord: https://discord.com/invite/fcfEtxRbWT\nPodcast on Spotify, Apple Music etc.\nYouTube Channel: https://www.youtube.com/@LivewithMattRad\nYouTube Clips Channel: https://www.youtube.com/channel/UCs8ZKTveuxghTN-QaHFemsw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1061443609943085086",
    "author": "austenballard",
    "date": "2023-01-07",
    "content": "@Nomograph Mastering if it's not too much trouble, do you think you could ELI5 (or point me in the direction of a resource which explains) the unfuckology behind speakers right up against the wall? I keep seeing it referenced in this Discord/on the podcast and it seems really counter to everything I've been told before",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066389922774274088",
    "author": "Will Melones",
    "date": "2023-01-21",
    "content": "You seem to spend an inordinate amount of time handling dogshit. I don’t worry about you, but I am a bit concerned for your dogs.\n\nSeriously though, what’s up with the volume in the DB app? I was on my phone checking a film project against Netflix (who has an overly dynamic spec) and right I’d totally missed the mark on loudness. Something about iPhone media apps having huge volume discrepancies does not compute for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067370771988631592",
    "author": "Ross Fortune",
    "date": "2023-01-24",
    "content": "I’ve used this kind of technique a couple of times: hard panned mono verb one side (nice if it’s characterful, springs n stuff), with a slap to the other. Or two disparate verbs. Depends on the space you have, and doesn’t always work, but it can be really nice - stole it from this record https://open.spotify.com/track/1EAuRuC7lIgIVLwXaZoHLo?si=kg-LqI93ThCWvAZ6Lyk7mg\n\nSide note, I love the energy of the drums",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1068773548006572123",
    "author": "NoahNeedleman",
    "date": "2023-01-27",
    "content": "THEN the limiters/clippers/inflators/whatever",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070548255630430248",
    "author": "David Fuller",
    "date": "2023-02-01",
    "content": "$300 for mixing and \"mastering\" is quite cheap",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070551189659340810",
    "author": "Rollmottle",
    "date": "2023-02-01",
    "content": "every rate at the expert tier gets a \"+\" except mastering! 🤣",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070551457490808903",
    "author": "AJ",
    "date": "2023-02-01",
    "content": "I do keep seeing mastering at 100 a song from most of the folks I've seen on soundbetter. Mixing is where there is the ambiguity. Appreciate the input y'all!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1079600391949389864",
    "author": "Rollmottle",
    "date": "2023-02-26",
    "content": "just got the free trial for Apple Music...first real spatial experience going down now. listening to the spatial version of \"All Things Must Pass\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1091382496169562182",
    "author": "Axl Rhodes",
    "date": "2023-03-31",
    "content": "tbh, i really need feedback on my pre-mastering. \nI'm not sure when it will be good enough to send for mastering. \nI also \"master\" my tracks myself and would like to know how good it is. \nMy environment is anything but studio, so I can just use what i have.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1103370146678059139",
    "author": "popaganda.",
    "date": "2023-05-03",
    "content": "Specializing and hustling mix work  is a hard game to play. Literally everyone wants to be a pro mixer. Asking people on a discord channel to tell you whether to specialize in it is not the move. What do you love most? What lights a fire under you? Focus on that thing and go hard. But don’t choose mixing or mastering or whatever to focus on because you think it’s a smart career choice that will bring a lot of work and success. It’s not. (Until it is for the small % with a lot of talent and 💯 commitment)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1103460570876870736",
    "author": "Chris Doms",
    "date": "2023-05-03",
    "content": "I don’t think “we” even know what we wanna be\n\nCan we survey this? Lol “Mixedby” vs “Prod.by” handles?\n\nI feel like this a cool prompt for a convo though\n\nLike for those who specialize.. how did you know that mixing, mastering, producing etc was the thing you wanted to go all in on?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1103777038164295771",
    "author": "Nomograph Mastering",
    "date": "2023-05-04",
    "content": "And the variety is one my favorite things about mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104928087499608137",
    "author": "Deleted User",
    "date": "2023-05-07",
    "content": "ohh 😮 Didn’t know mastering.com was musician on a mission",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1104928931112570880",
    "author": "austenballard",
    "date": "2023-05-07",
    "content": "I don’t really like to openly shit talk specific people but yeah, MOAM/Mastering.com is NOT the vibe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1109110388001349654",
    "author": "sarawls",
    "date": "2023-05-19",
    "content": "I am using TB.  Maybe I should talk to Antelope about it.  The easiest way to get it to fuck up is to simply try to play any sort of music (mp3s in emails, Google Drive, iTunes, Spotify - any of it) and it's all slow and crackly and won't play.  This is only sometimes!  Sometimes unplugging the TB plugging it in again will do the trick.  Or restarting the computer.  Sometimes neither of those does the trick.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1115347429030645914",
    "author": "bobby k",
    "date": "2023-06-05",
    "content": "silly question - are there any tracks that exist in the -2, -1 LUFS range?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115365648051228844",
    "author": "Edward Rivera",
    "date": "2023-06-05",
    "content": "https://open.spotify.com/track/6JyuJFedEvPmdWQW0PkbGJ?si=o79ibowaSH2kVjgcpEcU6w",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115367444660375572",
    "author": "bobby k",
    "date": "2023-06-05",
    "content": "close but still around -4.5 LUFS haha i’m wondering if anyone (likely in hyperpop or edm) has hit -3 or -2 successfully..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119659604150853652",
    "author": "Edward Rivera",
    "date": "2023-06-17",
    "content": "https://open.spotify.com/track/3tYHCmqDOzZQDV4273W0DV?si=G8oQsLHWRuupaIC9M3BEZw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124084236371120228",
    "author": "JakeTB",
    "date": "2023-06-29",
    "content": "That would be the monitoring-talk channel. You will likely find most everything you're looking for by using the Discord search feature. Nomograph Mastering and gerhardw are the resident experts, so those are good names to search in that thread.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133948231856959589",
    "author": "AJ",
    "date": "2023-07-26",
    "content": "How common is it for a mastering engineer to ask for a quieter mix? This is the first time it has happened to me, and it's tricky because I really liked the mix as is. But the phrasing of the email made it seem like using this one would be detrimental to the song. However, the mixing engineer thinks it's a bad move and warned me that it would change the mix as a whole. \n\nIf y'all have been in this type of situation before, how is it typically handled? I wound up messaging the mixing engineer that I was open to hearing the quieter version. But I gave the caveat that I would just use the original if I didn't like that version.  Not sure if I handled it properly though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133952611163316275",
    "author": "peterlabberton",
    "date": "2023-07-26",
    "content": "Quieter as in no (or less) limiter? Or like, just quieter? If the later, weird. If the former, makes sense to me for the ME to have both options.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133953001292316742",
    "author": "NoahNeedleman",
    "date": "2023-07-26",
    "content": "Wait mixing engineer or mastering engineer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133954165987610725",
    "author": "Deleted User",
    "date": "2023-07-26",
    "content": "or if they just think the mix itself is too compressed in general, that’s not what mastering engineer should be dealing with. if they don’t like the mix, just pass it up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133954391674732596",
    "author": "Deleted User",
    "date": "2023-07-26",
    "content": "get a different mastering engineer. hit up @Rollmottle or @masteredbyjack",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133954707602276413",
    "author": "AJ",
    "date": "2023-07-26",
    "content": "Here's why I was confused when I got that last night:\n-The producer signed off on this mix too. \n-I truly didn't hear the low end being choked at all (and neither did any person I sent it too)\n-The producer (who is someone I trust/will work with again) was the one who suggested this guy to me. Described as \"the best ears they have seen in 15 years\". \n\nI talked to the producer this afternoon, and the mastering engineer had called him first. Basically he sold it as \"the mastering engineer does like the mix, but he thinks there's no room to work on it with the current levels.\" He also said after checking the levels he agreed with the mastering engineer. But then.... he said he was okay with doing the current mix? With a warning that it would lead to less being done to it and potentially an inconsistent result across platforms.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133955231844147272",
    "author": "AJ",
    "date": "2023-07-26",
    "content": "Mastering engineer also told the producer he liked the mix apart from the levels? I feel like the communication is getting convoluted",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133955371384438815",
    "author": "Deleted User",
    "date": "2023-07-26",
    "content": "Or is it that the mastering engineer isn’t confident in their ability to master it as good (or loud) as the mix? \n\nIf they had mix without the limiiter, your mastering engineer has “room to work with”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133957102910574697",
    "author": "AJ",
    "date": "2023-07-26",
    "content": "I went with the same mixing engineer as last time. Mastering engineer came from him though based on the high praise.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133957765346381834",
    "author": "AJ",
    "date": "2023-07-26",
    "content": "Pretty much. After I admitted that I don't know as much about mastering specifically, it then became a \"let me email them in a chain to make it easier\", so I got the mixing engineers email for that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133961420199968912",
    "author": "LAPhill",
    "date": "2023-07-26",
    "content": "I just finished getting an album mastered and had the ME ask me for a few tracks to be printed quieter, because they weren't gelling into the overall mesh of the album with the other songs. And I was fine with that. He made the case, we both listened and agreed it was better. But my tracks definitely weren't hitting -5 LUFS anyway, so it's not the same situation.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133963298681929768",
    "author": "Nomograph Mastering",
    "date": "2023-07-26",
    "content": "It’s so typical of what I hate about a lot of mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133964054734581790",
    "author": "Deleted User",
    "date": "2023-07-26",
    "content": "AJ said that the ME already has the mix without the limiter on it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1133969331441647717",
    "author": "Nomograph Mastering",
    "date": "2023-07-26",
    "content": "Not descriptions of mastering guy or our priorities",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133969858313330845",
    "author": "Nomograph Mastering",
    "date": "2023-07-26",
    "content": "I should say that I’m allergic to this approach to mastering, and can super easily get on my high horse about it but it’s the right approach for certain clients. They’re likely not my clients and -6 guy would lose his shit dealing with HEALTH or Dorian or the new Carly record",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133970336640155749",
    "author": "Nomograph Mastering",
    "date": "2023-07-26",
    "content": "In this case mixer and mastering guy/girl have a relationship so maybe this is how they roll",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133971408863637574",
    "author": "cian riordan",
    "date": "2023-07-26",
    "content": "I think there's a real difference between the qualitative element of mixing and mastering where EQ is this or that, compresion is to much/too light, etc — and the quantitative — a technical element to what we all do. And there's just going to be situations where one person might be working with a deeper skillset. If this is occuring in the production/engineering phase, I think creative decisions can steamroll the technical bullshit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134128445174054922",
    "author": "Will Melones",
    "date": "2023-07-27",
    "content": "Are these integrated LUFS, or maximum short term levels?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1137102528421580922",
    "author": "JONESY",
    "date": "2023-08-04",
    "content": "@Nomograph Mastering Southern Cali",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1137112306732511263",
    "author": "JONESY",
    "date": "2023-08-04",
    "content": "I am willing to pay a professional at this point. Would love to get back to creating music that's for sure! Thanks for your help @Rollmottle @Nomograph Mastering",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1139714243248263249",
    "author": "Zack Hames",
    "date": "2023-08-11",
    "content": "Search function is your friend here - lots of good info from @Gerhard Westphalen and @Nomograph Mastering \n\nWelcome!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158497711289544704",
    "author": "Rollmottle",
    "date": "2023-10-02",
    "content": "likely the mix with a limiter for them and the client to get a sense of final loudness",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158501705449734154",
    "author": "bobby k",
    "date": "2023-10-02",
    "content": "so we're just talking about a limiter then hahah thanks for clarifying everyone!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158508773107826739",
    "author": "Nomograph Mastering",
    "date": "2023-10-02",
    "content": "Not necessarily just a limiter",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165241291370672228",
    "author": "xico1702",
    "date": "2023-10-21",
    "content": "Hii folks, my name is Francisco and I'm these past few weeks I'm using Pro Tools for editing, mixing and mastering. I have a question. Imagine if I want to listen all the parallel effects without the original track. \n\nFor example, I have a vocal track sending to a plate reverb and a delay. I want to hear just the plate reverb and delay without listen the vocal. Forget pre faders, don't want to use that.\n\nThank you for the attention. 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1185625958854692885",
    "author": "river",
    "date": "2023-12-16",
    "content": "What do mastering engineers think about",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1185643599296221394",
    "author": "river",
    "date": "2023-12-16",
    "content": "I am just wondering what mastering engineers think about. I wonder what they think their job is, what they think of their job, what they think about music, how their life has changed the way they think music should sound. I think I think like a mixer, I think about stuff probably a bit differently than a life long mastering engineer. \nI know everyone thinks differently, that's what I'm also curious about. I'm open to listening to mastering engineers think about. \n\nI saw an old lady who used to take care of me when I was a kid after 10 years. It was interesting to hear everything she had to say. I'm always curious about someone's pov and what they think about",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1185691141522333817",
    "author": "Nomograph Mastering",
    "date": "2023-12-16",
    "content": "I did 2 or 3 lives with Matt. One is atmos heavy so skip that but the others have a good general take on mastering, or at least how I view it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1210696922944245870",
    "author": "Will Melones",
    "date": "2024-02-23",
    "content": "Who knows what happens with distributors like Tunecore when you:\n\n1. release a single or two\n2. later release an album containing those singles\n3. use the same ISRC codes, but\n4. upload different audio files (the \"album masters\")?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1210745792718045236",
    "author": "NoahNeedleman",
    "date": "2024-02-23",
    "content": "Depends if you’re completing an album or if the single remains available on its own I think? I with tunecore had literature or actual customer service to handle these types of questions.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1225074899673026612",
    "author": "Nick Stetina",
    "date": "2024-04-03",
    "content": "We’re on a similar path right now. I’ve filtered all of those Waves plug-ins back into regular use recently, except for L1. No shade there, just been partial to the flexibility and control in GHz Faraday Limiter. Almost always 20:1 then just adjusting just attack, release and blend. Great GUI and metering.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1227341336261431367",
    "author": "Charlie Deane \"Hypn0.iRL\"",
    "date": "2024-04-09",
    "content": "What does your loudness look like for delivering to mastering? In the past when I spoke with my longtime engineer they told me they preferred that I don't even put a bus compressor on the print but now that I am branching out that seems to be an exception rather than a rule. Should also say that I recognized your name immediately, I had a chance to produce a mini mansions show some years ago and became a big fan of that band.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1227342901185347705",
    "author": "cian riordan",
    "date": "2024-04-09",
    "content": "Oh fuck yea, MM forever! I usually just trim the input of my final limiter (almost always the Ozone maximizer) 5dB and call it a day. All of the compression/limiting/clipping thats happening on various busses beforehand stay the same. I try to not lean on the final limiting stage to heavily in building the 'loudenss' of the mix, but I know that's not the case for everybody. If there was an instance where it was really part of the sound, I'd just leave it and send it off. Any mastering engineer worth their salt should be OK working with whatever you send them. If there are glaring issues, they're likely to bring it up... but most mixers I know don't even peel back the limiter a little... so the loudness is fully baked into the mix.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1228869694551752805",
    "author": "Eric Martin",
    "date": "2024-04-13",
    "content": "I had an instance this week where I received a file, I request the mix as is, and the mix with the limiter removed and a screenshot of the limiter settings, L3 Ultramaximizer was set to a threshold of -18 and an output of -5, resulting in a -25 mix, it’s still work receiving these things, when I did the side by side comparison, the no L3 was significantly better and allowed me to do the work to get the mix sounding finished.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1228891077113806858",
    "author": "Eric Martin",
    "date": "2024-04-13",
    "content": "agree, as long as the limiter wasn’t controlling overs, if it was controlling overs and that wasn’t recognized during the bounce then I use the lim",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1228892985375064065",
    "author": "Nomograph Mastering",
    "date": "2024-04-13",
    "content": "I can generally beat most people’s limiting strategy while keeping the general feel and intent",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1228893143902982267",
    "author": "Nomograph Mastering",
    "date": "2024-04-13",
    "content": "So if they were mashing the limiter I’m more (not less) likely to want a non lim print",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1228893661983412234",
    "author": "Eric Martin",
    "date": "2024-04-13",
    "content": "I agree it’s always doing something, sometimes I just have a limiter to control the 1db peak I might have and the threshold isn’t lowered, that’s when I know in need to adjust things, and I’ve heard a non-lim mix that had overs because the limiter was removed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256245946459754597",
    "author": "BoozleBAM",
    "date": "2024-06-28",
    "content": "@Matt Huber BTW - Checking out your spotify. Digging this Black Butterflies track - \"deja vu\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1256438997069336587",
    "author": "BoozleBAM",
    "date": "2024-06-28",
    "content": "@Nomograph Mastering Have apprecitated some of your input in the past, and yeah... Best.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1256440049998757960",
    "author": "BoozleBAM",
    "date": "2024-06-28",
    "content": "@Nomograph Mastering Just saw this tag in the header of this channel by complete accident: \"There are no dumb questions. We encourage and applaud learning here!\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1256443500271108137",
    "author": "BoozleBAM",
    "date": "2024-06-28",
    "content": "@Nomograph Mastering I don't know what to say, my man. I mean... I don't know who you are, and you don't know who I am, but it definitely seemed like you called me a dum-dum in a public forum, so, I mean... I'm at least going to respond. You could've had a little more tact (maybe messaged me mprivately if you had an issue with how I was starting conversations or whatever), but I mean... I'm sure you're a great guy and I'm not trying to start a fight/ argue with anyone - especially online. I'm sure you rock. So, yeah - That's where I'm coming from. But, I guess I appreciate what you said?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1262884565882769468",
    "author": "Bryan DiMaio",
    "date": "2024-07-16",
    "content": "Except our mastering room is using a Grace m908 and controlling via AES and RAVENNA",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1262884781310607441",
    "author": "David Fuller",
    "date": "2024-07-16",
    "content": "Still not sure why the powers that be chose the mastering room but, eh",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1265568812716003390",
    "author": "mixedbywong_my",
    "date": "2024-07-24",
    "content": "https://www.pluginboutique.com/product/2-Effects/96-Tape-Emulation/12716-Ampex-ATR-102-Mastering-Tape-Recorder?_gl=1*1cvhacn*_up*MQ..*_ga*NDM2MDE5NDc1LjE3MjE4MDU0ODQ.*_ga_33HHXGVSQG*MTcyMTgwNTQ4NS4xLjEuMTcyMTgwNTQ4OC4wLjAuMA.. do i need this ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1266070595704193064",
    "author": "Nomograph Mastering",
    "date": "2024-07-25",
    "content": "Like a little low ceiling closet under a stairs",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266085071970898011",
    "author": "Nomograph Mastering",
    "date": "2024-07-25",
    "content": "“So how *exactly* did the drunk guy get stuck in the ceiling?”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268624872775356550",
    "author": "NoahNeedleman",
    "date": "2024-08-01",
    "content": "Seriously tho @BoozleBAM, when you’re ready, you’ll need to spend a little figuring out why some songs end up louder than others. Once you do, managing loudness will just become a part of your checklist. \n\nIn the meantime, while you’re working on comping & editing & recording, don’t worry about it too much.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268647354601574454",
    "author": "BoozleBAM",
    "date": "2024-08-01",
    "content": "What should I be aiming to hit on the masterbus prior to mastering? I've heard different things. I'm usually hitting plus 4-5, and there's no distortion typically, but that's a little hot from what I've heard...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1269301283181821962",
    "author": "NoahNeedleman",
    "date": "2024-08-03",
    "content": "I’ve been doing this more lately and it’s saving me so much time. Also saving fav settings from buddies. I’ve put up settings from @Matt Huber and @Nomograph Mastering as user defaults in the last month, in addition to my own shit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1269336849810460694",
    "author": "Josh",
    "date": "2024-08-03",
    "content": "I noticed a big shift in the overall quality of my work when I started viewing “originality” as something you do at the start (writing/production), and not at the end of the project (mixing/mastering). Obviously that can change based on the tune, but I think I got a little lost for awhile chasing sounds with mix moves when I should’ve deleted the track and remade whatever it was I was trying to jam into the song.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1272969236414861462",
    "author": "EliHeathMusic",
    "date": "2024-08-13",
    "content": "I got standard clip recently and have been reading up on the manual and some of the discord conversations but am still figuring out how to apply that information intuitively into my own workflow (or at least having the confidence to feel like I really know what I'm doing with it). I'd love to hear, on a very basic level, how you all approach using the plugin and if there are any starting points that you would recommend. Also curious how this might change in different use cases (i.e. mastering, mix bus, drum bus). Are you simply sliding down the \"clip\" fader until you reduce the peaks a little and then making up gain with another plugin? Are you touching the other 3 faders at all? Do you find yourself frequently auditioning and changing modes and oversampling amounts or sticking to consistent setting. Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1272984823086055507",
    "author": "Nomograph Mastering",
    "date": "2024-08-13",
    "content": "Easy for me, the above is my start point. I think Soft Clipping is a bad idea in mastering so it’s hard clip only here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1274769393691263030",
    "author": "spectrummasters",
    "date": "2024-08-18",
    "content": "I think of my groups as the glue and density / loudness stage",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1274787232816959613",
    "author": "Zack Hames",
    "date": "2024-08-18",
    "content": "I’ll use a limiter to make it however loud I want/can",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1276229463515856939",
    "author": "cy (sigh)",
    "date": "2024-08-22",
    "content": "you mostly just mute the leads and any other vocal track they don't want in the playback. \n\nif they'll have a producer /engineer doing playback sending stems (groups) might be helpful. \n\nthe mastering doesn't usually come into play here. some big label folk might ask to send those files to mastering too. would probably be considered alts (some mastering folk will charge extra for them, some wont if it's not too many files)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1281277428328562778",
    "author": "lystell",
    "date": "2024-09-05",
    "content": "This might be a dumb question. If I have a dual channel-tube compressor/limiter. Should one be weary of using only one side for recording purposes? I’m thinking difference in tube lifespan etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1293053144418357298",
    "author": "vostral",
    "date": "2024-10-07",
    "content": "Hello everyone!  I have this question: I'm a producer from Vietnam. Currently I'm using Focusrite 2i2 and a pair of Focal Evo 65 to mix and master my own songs. Even though i've learnt and practiced a lot of mixing stuff but my mixes sound still amateur. I'm thinking of upgrading to UAD Apollo for better converters as i've learnt that DA converter does affect what i can hear out of my speakers. Could you guys kindly give me more insight into this issue? Thanks!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1295614804387692555",
    "author": "spectrummasters",
    "date": "2024-10-14",
    "content": "David and ruairi/nomograph mastering are the real brainiacs on this stuff though . I’m just out here having a sniff about learning as I go",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1302807563401953330",
    "author": "T1NGA",
    "date": "2024-11-03",
    "content": "Hey there! What’s good ?\nSo I’m trying to solve this basic but yet important topic.\nI’ve read here on the discord that a higher sample rate will ensure less aliasing and digital eqs will work better, also that I should be symmetrical with the buffer size (let’s say I use 128 and 48k). \nMy questions here are\n1- If I want to upload music to spotify ( which I guess it converts it all to 44.1k ) should I still use a higher sample rate ?\n2- What buffer size and sample rate would stick to for recording ? And for mixing ? (Music only)\nThank you! Have a good day!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1302812598475165700",
    "author": "T1NGA",
    "date": "2024-11-03",
    "content": "I’m using 48k at the moment, but the article mentions 96k is better overall.\nAs I said before, all my projects will be uploaded to spotify.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1302818913427525693",
    "author": "T1NGA",
    "date": "2024-11-03",
    "content": "And for mixing or mastering should I do 32 bit depth?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1311740285306409040",
    "author": "spectrummasters",
    "date": "2024-11-28",
    "content": "Oh of course !! Right . Send my music , drums and bass to a bus , glue it there then send it to the 2 bus to meet up with the vocal and just the final  limiter . Brilliant. That’ll give me the little bit of pumping off the low end I want",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1313322985913847849",
    "author": "Jemody",
    "date": "2024-12-02",
    "content": "Might have a warped view on the fairchild since it seems to be advertised as a limiting compressor",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1344950905879003228",
    "author": "louisvie",
    "date": "2025-02-28",
    "content": "Hello friends and colleagues, \nLil newbie question for you today : \nDo your mixbus/master limiter attack and release settings change every mix ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1344953677093404733",
    "author": "louisvie",
    "date": "2025-02-28",
    "content": "If you do tweak it, what do you listen for when doing so ? Are you waiting to see the audible effect of the limiting disappear ? Looking for the right overall pulse / \"natural\" breathing of the song ? I read  Ruairi talk about release time and low-end on here, which totally makes sense. Couldn't find much other info on this tho, so, just curious how others use it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1345033881287397407",
    "author": "masteredbyjack",
    "date": "2025-02-28",
    "content": "Mastering only here -- but it absolutely changes every time. However, is that actually the best thing for a mixer to be adjusting all the time when mixing? I'm not so sure. Someone like @Matt Huber who is a monster and has tested things extensively, long track record, sure. Would wonder what others think about people on the earlier side of the journey though. \n\nUnderstanding limiting, what it feels like and does is basically essential in modern record making though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1347420731507605645",
    "author": "BoozleBAM",
    "date": "2025-03-06",
    "content": "How loud are you having your amps usually, Zach?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1347617045046628554",
    "author": "Zeuswayn3",
    "date": "2025-03-07",
    "content": "If you’re a drummer and you have a room with high ceilings I haven’t found a better mono OH",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407258834321281045",
    "author": "louisvie",
    "date": "2025-08-19",
    "content": "How much louder does a mastering engineer get a song if the song comes from a mixer who's already pushing to the level they want ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407258862930759740",
    "author": "louisvie",
    "date": "2025-08-19",
    "content": "I remember Jon saying how he got Billie to hit -10 LUFS because he wanted to, or Cian making the St-Vincent record go from quiet-ish to -4 LUFS at times. \n\nThe ME comes along to finish it, make it all feel and/or sound a little better, work on album continuity,  transitions, fade outs, QC, and during this, volume rides, clipping, limiting. I'm sure it varies 100% depending on each project.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407381166255898665",
    "author": "Nomograph Mastering",
    "date": "2025-08-19",
    "content": "To tag off of @NoahNeedleman’s point, over time you’ll develop your own intuitions about what mastering brings to the table for you and how to best leverage it, when working with your regular girls/guys and also working with the rando the artist/label choose",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407382791959871529",
    "author": "Nomograph Mastering",
    "date": "2025-08-19",
    "content": "There is a common trap for younger artists and mixers which is that when they get to mastering they imagine they must turn up their detail/fussiness dial to meet the Mastering Engineer’s. In reality it’s the opposite, we sweat the details so you can step back and hear the finished thing and have a sense of letting go and deciding whether it’s done",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1416103272716177408",
    "author": "M J",
    "date": "2025-09-12",
    "content": "I think from watching the LWMR streams, saturation can be a tool to increase perceived loudness without actually impacting the headroom right? That's one thing I've been trying to get into more",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1445832980982399142",
    "author": "AJ",
    "date": "2025-12-03",
    "content": "Does anyone have experience with YouTube music? \n\nI’ve been eyeing Spotify replacements, and I’ve definitely ruled out Apple Music. The added benefit of ad free videos is enticing to someone  who watches a lot of them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1445839670951940237",
    "author": "Rollmottle",
    "date": "2025-12-03",
    "content": "why did you rule out Apple Music?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1450872522944938025",
    "author": "DarrenB",
    "date": "2025-12-17",
    "content": "I'm a big Tidal fan.  It's been my main choice since introduciton (2014-5 maybe?).  Their suggestion algo is getting better but still not Spotify good.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1464301800784920880",
    "author": "Will Melones",
    "date": "2026-01-23",
    "content": "How does SPL affect room measurements and acoustic treatments? Like is there a relationship between how much rockwool can absorb and how hard you slam it with 100 Hz? I'm wondering if I should be paying more attention to how loud my REW sweeps are. It would make sense to match average listening volume regardless, and would coax a more real-world performance out of the speakers themselves I suppose.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472083946698444800",
    "author": "masteredbyjack",
    "date": "2026-02-13",
    "content": "To illustrate a good example of the difference and why (guessing) Jon would want to clip rather than do this (which would control the transients as you describe)\n\nIf you use a long look ahead, call it a limiter with a long look ahead. That will let the processor know about the transient well before it hits the GR circuit, thus avoiding distortion/harmonics (of course there still could be some artifacts). But even though there will be samples at the threshold, it won’t be a straight line waveform as if you clipped it. It is pushing the waveform down. The waveform itself is actually changed still, so it is not exact but it’s different than clipping.\n\nA clipper just squares it off. Hence harmonics.\n\nThis is why you can limit/compress an instrument like piano, which has a tendency to hear distortion easily, when clipping it would be a disaster (unless you are going for that)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1472085423219146824",
    "author": "Bryan DiMaio",
    "date": "2026-02-13",
    "content": "oh yeah sorry I wasn't more clear in my response to will, that's essentially what I meant (doing the transient stuff without the harmonic stuff with a limiter)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472247935587586242",
    "author": "spectrummasters",
    "date": "2026-02-14",
    "content": "Put slightly differently , You increase perceived loudness without destroying impact.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  }
]