[
  {
    "id": "887141100593238076",
    "author": "Lee Rouse",
    "date": "2021-09-13",
    "content": "And as far as mics I’m ultra particular about which mics I’m putting on the snare and toms. I don’t want too much bleed overall but if I do have it, I definitely want it to be more pleasant especially if I’m trying to go for that less gate more natural vibe",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "877520287527223316",
    "author": "oaklandmatt",
    "date": "2021-08-18",
    "content": "my 2 cents: SM7 is all i've used for things like this and it works great. anything too fancy and you're running the risk of lot plosives/ bad mic technique since i imagine you're not gonna want to bother with a pop screen",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1183807567189786634",
    "author": "tomtom",
    "date": "2023-12-11",
    "content": "I've had a few interns come through my little production studio. The best ones knew when to stay out of the way and when to pick up a soldering iron and start fixing cables. The worst one vampired an entire croissant tray before the client showed up and took 5 minutes to set up a mic stand w/ a 57 on it. To echo the others- ask how you can be helpful (and double echo the advice to brush up on basics on your own). I recommend keeping a notebook- shit moves fast and you won't remember everything. Keep tabs on fussy gear (especially if multiple producers or engineers are using the space and aren't as familiar with it). Be a cable-wrapping ninja and know how everyone takes their coffee.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1347594703733919805",
    "author": "Eric Martin",
    "date": "2025-03-07",
    "content": "his cab has G12-65’s in it - 🔥 \n\nJCM800->G12-65 Cab->SM57 🙌🏻",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1404211243010490440",
    "author": "hyanrarvey",
    "date": "2025-08-10",
    "content": "Tbh if you’re good enough at looking you can get a shit load of panels and mic stands for free",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407850243411677235",
    "author": "cian riordan",
    "date": "2025-08-20",
    "content": "I can't tell an SM7 and SM7b apart.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "829294348105023488",
    "author": "antoniohannamusic",
    "date": "2021-04-07",
    "content": "Agree with this, also, one thing for 'live sessions\" is that by the time Cameras have filmed 5 x takes to get coverage it's often no longer strictly 'live' obviously there are exceptions. For location recordings though, Isolation is absolutely key, if everyone can play with IEM's or is happy to wear headphones then I would normally DI everything, Mic up a drumkit and give the singer an SM7B having them sing directly at the drummer (obviously not always possible) then everyone else, bass, keys, guitar, DI, pick an amp sim / keys plugin and get them to do multiple passes (to a click if possible). Not trying to be prescriptive just my approach FWIW.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1329446209059950612",
    "author": "Eric Martin",
    "date": "2025-01-16",
    "content": "I bought a pair of 421’s last year because I figure people ask for them and wanted to hear them in action and I’ve put them on a few sources definitely not for me in most situations EXCEPT live lead vocals, when the band is all in the room I’m currently preferring them over M88/SM58/RE20/SM7b etc.\n\nRequires less EQ, surprisingly the bleed isn’t as bad as I was expecting, and the plosives are the lowest of the lot of “stage” mics that I have, handling noise is off the charts and that clip is terrible but the tone for a scratch vocal that might become a keeper is pretty nice.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "943255132055932939",
    "author": "oaklandmatt",
    "date": "2022-02-15",
    "content": "@sloth the reason is use clip gain is so you're not relying on the limiter or compressor to level out the sound. rather, you're using the limiter or compressor for the SOUND it creates. if you want that super compressed sound (or even that lightly compressed sound) of an actual compressor or limiter, you'll often get better results if the signal going into it is evened out a bit. this used to be solved mostly by great mic technique, where a singer would lean back on big notes and whatnot. but these days by using clip gain to even out the sound before it hits your dynamic processing, you can actually more fully lean into the SOUND of the compressor or limiter that comes after it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "991744275282919486",
    "author": "BatMeckley",
    "date": "2022-06-29",
    "content": "It seems backwards but the E strips in practice always felt more clinical and sterile (not necessarily in a bad way) while the G felt more  grunty (Terrible word but best I can do at the moment). There was more of that thing you get with an sm57 on a guitar cab with a G series. You would think the G would’ve been cleaner considering it specs better and came out later, but the E feels more that way to me. Like you would’ve expected the G series to come out first and then they cleaned it up with the E. Is that at all helpful? 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256241454570012803",
    "author": "BoozleBAM",
    "date": "2024-06-28",
    "content": "There was/ is just the most ungodly-disgusting-nasty resonance at 790 on this particular kick. I'm the one who recorded it. I'm at fault. I don't know what the living freak I did wrong, but I didn't notice how horrifying it was until I was deep, deep into this album. After I'm done tracking, I'm gonna go in there and dissect the situation - I don't know if it's the head or just that I tuned in the perfectly horrible spot or if it's the drum itself or the mic placement or what, but as long as I basically turn the EQ of the 7b (that's what it was recorded with) into a beta 52, and then do a sharp dip at 790, it's passable... I absolutely HATE to EQ like this, preferring to be snobby and do it all with the mics, but sometimes, I guess, you gotta do what you gotta do... Will mess around with re-tracking/ putting new heads on and shit after I'm done with these initial takes... I could ramble on... Midwest represent!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1345460141197099119",
    "author": "cian riordan",
    "date": "2025-03-01",
    "content": "I wasn’t sure on your cymbal mic placement, but I tried emulate that yes",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "812244329832906812",
    "author": "Zakhiggins",
    "date": "2021-02-19",
    "content": "Anyone have any good tips or techniques for recording backing vocals? Mic recomendations, mic techniques, etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "812426639404171296",
    "author": "Zakhiggins",
    "date": "2021-02-19",
    "content": "Yeah I understand.. Ive been experimenting with this stuff alot recently, sometimes I put a sock over the mic for bgs just for a slightly darker tone lol, was wondering though if you or anyone has any go to mics for bgvs? Or is it just down to the aesthetic your going for? Was thinking of trying a dynamic mic or a ribbon to see if it gets out the way of the main line a bit more",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "812448204045680721",
    "author": "Zack Hames",
    "date": "2021-02-19",
    "content": "I’ve been using beyer m160 and coles for background vocals, been super cool as darker, throatier / more “in the room” tones respectively. Even an SM58 or 57 could be cool for the backgrounds specifically if the main is a condenser. I like using the same singer with a way different mic lately.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828755320376524821",
    "author": "Zakhiggins",
    "date": "2021-04-05",
    "content": "just the room sound for monitoring I guess, It's a very acoustic vibe. I'm planning on doing the epiano di, but the epiano has a decent speaker which can be used as a monitor,and the bass is going through an amp. Everything else is just the room sound if you get me. I have a few sm57s, 58s, and an Sm7b. Also have some condensers but I'm just presuming they're no go's haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "844597199807316008",
    "author": "Zack Hames",
    "date": "2021-05-19",
    "content": "This is my version of a sub kick. Basically the idea is to have the low end happen a little later than the attack, intentionally. I’ve used sub kicks and they’re just okay for me, but maybe I don’t know the best way with them. I’ve played with the distance quite a bit, sometimes it’s a couple feet from the center, sometimes it’s exactly even with the dynamic mic.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "848271726873411655",
    "author": "chris_donlin",
    "date": "2021-05-29",
    "content": "I record a lot of acoustic guitar, and it seems like no matter of treated the space is that I’m recording, i always end up with a high noise floor. I’ve recorded with dynamic mics, ribbons, and condensers - condensers being the least problematic. I don’t get how some acoustic recordings are dead quiet with a super low noise floor",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "848273695314542613",
    "author": "cian riordan",
    "date": "2021-05-29",
    "content": "What mic pre/signal chain are you using?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "848276186323877948",
    "author": "David Fuller",
    "date": "2021-05-29",
    "content": "What mic preamp and mic?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "848371974158024714",
    "author": "Rob Domos",
    "date": "2021-05-29",
    "content": "If it’s the hissing kind of noise that you get more of when you switch from condensers to dynamics and ribbons, then it’s not the kind of noise that is coming from the room. \n\nIn rooms the main things you would be concerned about would be reflection (which you fix with treatment) and mechanical noise from things like computer fans, clocks, etc. and condenser mics would pick those kinds of sounds up more, not less. \n\nAny unison pre in the Apollo should be plenty low noise to not bother you on your condenser mics. I agree with others that not using any unison pre will make the noise floor lower, but I disagree with them in that I think using the unison pres is a pretty good idea often. \n\nThat said, if you’re struggling with noise, definitely try not compressing on the way in because compressors are only going to raise the noise floor. \n\nOn dynamic mics and ribbon mics, you can decrease your noise floor pretty considerably by picking up a cloudlifter and throwing that in the chain. \n\nIf you do all of the above and still have a high noise floor then either the Apollo is broken (which is pretty unlikely), or your microphone is picking up mechanical noise from your air conditioning, computer fan, refrigerator, etc. if those are the issue, then tackle the issue there. Turn off the A/C, turn off the fridge, turn off the LED lights, etc and see what you hear.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "857799968421183498",
    "author": "Zack Hames",
    "date": "2021-06-24",
    "content": "Also unfortunately it was recorded on a Focusrite scarlet with an AT2020 (remote production).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "877404865503035412",
    "author": "Zack Hames",
    "date": "2021-08-17",
    "content": "Anyone have tips for recording live vocals while someone plays a grand piano? Id rather not use an SM58 but am open to any other mics, condenser or dynamic.\n\nThis is for a live video session, piano will be in a booth so I’m only dealing with piano bleed. I won’t have time to experiment much before the session so wondering if anyone has any wild suggestions!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "877597610490339462",
    "author": "cian riordan",
    "date": "2021-08-18",
    "content": "I know it's not sexy, but the rejection from an SM58 (or even better, a Beta 58) is worth considering.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "877768378591367168",
    "author": "Zack Hames",
    "date": "2021-08-18",
    "content": "Speaking of grand piano…what mics do you guys like to use? I’m planning on trying a stereo set up for more basic piano sounds and some sort of mono mic I could make distort or make fit into a different part of the mix. This in context of a ROCK band.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "894009203616788490",
    "author": "IanDobyns",
    "date": "2021-10-02",
    "content": "Does anyone know much about using a Y splitter with condenser microphones? I’ve been wanting to mess with Mid/Side inside UA console. Since it doesn’t allow you to copy channels, I had thought to maybe use a Y cable out of the mic, into two different inputs. Does anyone have any experience with this? Will running phantom power to one power both inputs? Am I about to hurt my mic? Idk!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "944325500543836170",
    "author": "thejadenmejia",
    "date": "2022-02-18",
    "content": "What mics are top pop peeps using for live performances",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1034504946139283557",
    "author": "Maxim",
    "date": "2022-10-25",
    "content": "Currently have a nice mic hanging from just the cable cause there’s no mic stand. Anyone have any horror stories or is this safe for a day?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1308919153398251591",
    "author": "bobby k",
    "date": "2024-11-20",
    "content": "Producing/recording my first rock track & would love any tips on getting the drums right! I know Cian already crushed a LFTWR tutorial in here I should revisit that discusses parallel saturation n such. We tracked today, got 441s on kick and snare top, sm7b’s on snare bottom and hat, LCR overheads with my 251 in center and some flat pencils L/R, M201 on each tom, some random Omni EV mic on crotch and a stereo ribbon in the room (r88 clone). Room is rather dead but it’s 600 sq feet so we still get some life out of it when rocking. Refs are like anything Steve Albini has touched, as well as that latest Bully record. I’m mostly working on soft pop Americana type stuff so this is a very fun new adventure. So far really digging slamming the left right overheads with saturn2 transformer, may sample replace kick and snare but just with samples we took at the end. Any tips on making that shit slap in a crunchy modern way would be appreciated ❤️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1347417067623809107",
    "author": "Zack Hames",
    "date": "2025-03-06",
    "content": "So, try to keep some things the same, change smaller things.\n\nIf you do left side with a les paul a Marshall and an sm57, then the right side with a strat through a twin with a ribbon mic, it’s gonna sounding fucking weird and disconnected. I find that to be not the move.\n\nI often double track with the exact same rig, I don’t care about the “phase” argument. It just feels tight and huge to me. I may use a different boost pedal or something super subtle.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1347419298016006268",
    "author": "Zack Hames",
    "date": "2025-03-06",
    "content": "My fav guitar mics from brightest to darkest \n\nsm57 for classic, biting, bright, aggressive guitars \nmd441 for huge but smooth high end\nbeyerdynamic m160 for extra mids or smoother highs \nRCA 74B for fender style amps \nColes 4038 for extra bright or harsh amps",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1347616657882873856",
    "author": "BoozleBAM",
    "date": "2025-03-07",
    "content": "I wish I had ONE! Pretty sure I do have 8 or 9 SM57s, though - gathered over the years. That was the mics I was referring to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1347623060139675659",
    "author": "BoozleBAM",
    "date": "2025-03-07",
    "content": "Teh Randal has a very opposite Marshall sound. SHouldn't be a problem. Also - Wasn't there some mic clip that you could put a 421 and an sm57 like right next to eachother in??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1404300309198667888",
    "author": "Jake Gillespie",
    "date": "2025-08-10",
    "content": "Agreed.. a great compressor wont fix a cheap mic pack. glad @M J is putting money in mics. and treatment; That will get you good tones so quick (so long as you're good at drums and tuning them which i know @M J is).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407849316307046590",
    "author": "bobby k",
    "date": "2025-08-20",
    "content": "Curious what you guys think on this one - doing a few tracks with an artist who did 4 other tracks from this project on a vintage SM7 for vocals, what would be the closest mic to match that if I can’t get my hands on one? SM7b or 441? Or something else",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1472983111011668145",
    "author": "revolution",
    "date": "2026-02-16",
    "content": "maybe also mic technique?>",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  }
]