[
  {
    "id": "1377683291695612054",
    "author": "LAPhill",
    "date": "2025-05-29",
    "content": "Shout out to @Tim O’Sullivan for not only finally solving my hum issues, but dialing in the workflow in my room to a whole other level. He wired up all my pedals, synths, and preamps to a couple of patch bays so I can throw signal all around the room in any order (complete with right-angle cables so I can use them with the desk doors closed). He also built MIDI lines to send clock from my DAW to the pedals and we upgraded the room to Mio MIDI-over-Ethernet units. Several other creature comforts that allow me to think less, like routing a headphone connection underneath the right side of my desk instead of the left where my interface is, adding a second one by the piano, and ready-to-go cables for guitars, synths and microphones already plugged in where they need to be.\n\nI'm going to run out of reasons not to call this studio \"done\" soon.",
    "reactions": 31,
    "attachments": 5,
    "is_pinned": false
  },
  {
    "id": "1387087816768360469",
    "author": "thegreatcarsoni",
    "date": "2025-06-24",
    "content": "Voila, tiny desk conversion. The sidecar will also be out of the flight path soon I just don’t have long enough cable runs for a couple things and I needed to get up and running yesterday.",
    "reactions": 17,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1312253428600148022",
    "author": "nachomaquieira",
    "date": "2024-11-29",
    "content": "Today was a great day. New monitors and new side rack arrived❤️ so so so happy. And this discord has been super informative to make this decisions! No more big desk, moved to side rack, and PMC 6s. So greateful to all of you people here sharing your experience and insight🙏🏽",
    "reactions": 16,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "985366607238950912",
    "author": "Josh Bowman",
    "date": "2022-06-11",
    "content": "Ok so wife is away this week and I’m just working non stop. Then I was like… hey I should use this opportunity to get the house super dirty and build a full back wall bass trap like I’ve been meaning to. Then… you know your shooting stuff in rew, and your like, hey I wonder what it looks like without my big desk. Then you move the desk and it’s insanely better looking on the REW graph. Then you realize you have some old wood and a closet shelf that was gonna get tossed so you make a tiny desk and spend (waste?) 15 hours over the weekend that should have been spent on mixing renovating the studio room and moving things and taking measurements till you don’t know what a anything even sounds like anymore . Anyway I feel like a Total psychopath because this is what I did Friday and Saturday all day and night. Desk is obviously in progress and I need to figure out a shelf for the hilo etc. thinking off to the side and low so I can reach it easily but it’s not reflecting stuff. Also the back wall frame is full of pink fluffy now and covered in interm fabric till I figure out what I want it too like like.",
    "reactions": 14,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1116563111273570334",
    "author": "masteredbyjack",
    "date": "2023-06-08",
    "content": "Tiny desk gang what’s good!\n\nFor context for where this all started, the pic with the absolutely GIANT desk is what I had built initially (then had to have cut down before ever using) during the unf*ck build without consulting or telling Ruairi…and I’m fairly certain it took all his patience to not fire me as a client when I sent him a pic saying “desks in!” all excited and proud 😂😂\n\nTurns out I shoulda listened (or rather thought to ask before acting) the first time! Who would have thought…",
    "reactions": 14,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "1131470019209998428",
    "author": "cian riordan",
    "date": "2023-07-19",
    "content": "On the minimal desk trip, went with Jon to Dale Becker's studio today and absolutely loved his custom made desk:",
    "reactions": 14,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1285164471131701250",
    "author": "Chad Rodgers",
    "date": "2024-09-16",
    "content": "Working from my mate’s WIP space for the next few days (North Shields, UK). Waldo’s going to be keeping me company whilst I have fun with the SSL desk and BG2.",
    "reactions": 14,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "995417231410348123",
    "author": "Rollmottle",
    "date": "2022-07-09",
    "content": "Trying side-saddle over here. Had my screen basically behind me and to the right so working in the sweet spot with digital effects wasn’t really possible in that setup.",
    "reactions": 13,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1033045148944318555",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "You’ll need to undo and then select the desk only before hitting shrink",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171622936403251240",
    "author": "cian riordan",
    "date": "2023-11-07",
    "content": "Was sick of my janky little tv stand so I got some butcher block and built a proper mini desk",
    "reactions": 13,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1121526797608169523",
    "author": "Rollmottle",
    "date": "2023-06-22",
    "content": "your desk is too big. gonna get reflections at the mix position.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1163259518021554228",
    "author": "Rollmottle",
    "date": "2023-10-15",
    "content": "Great hang with @GaspardMurph! Here he was in the chair. 🔊",
    "reactions": 12,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1461086676599439614",
    "author": "Jorge Vivo",
    "date": "2026-01-14",
    "content": "When you finally show your room to the boys and you immediately wonder if your desk it too big and why Genelecs and no cloud 😆",
    "reactions": 12,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1212074950828236830",
    "author": "thegreatcarsoni",
    "date": "2024-02-27",
    "content": "My new room is getting closer to being done! Figuring out the logistical layout of the space right now but we got wiring done the other day. Temp desk, no speakers, no gear, no rugs, need more lights, but really close!",
    "reactions": 11,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1264254802196430962",
    "author": "Eric Martin",
    "date": "2024-07-20",
    "content": "last listen in the old space and now I want to through away my $4000 desk",
    "reactions": 11,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "985592074151817217",
    "author": "ryount",
    "date": "2022-06-12",
    "content": "Next level of tiny desk is deleting every other inch of it?",
    "reactions": 10,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1463243430812717192",
    "author": "Slow Hand",
    "date": "2026-01-20",
    "content": "I privately long for a massive slab desk or table in my home where I can spread out a dozen pages. Instead I’m operating with the g-string of office furniture. Scantly a desk to behold.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "900404505118658570",
    "author": "bobby k",
    "date": "2021-10-20",
    "content": "new mixing desk i built after selling my output platform. noticeably better, plus feels good to get that money back (this cost me under $100).",
    "reactions": 9,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1096154111411486720",
    "author": "edrichwang",
    "date": "2023-04-13",
    "content": "Airbnb setup for the next 2 weeks. Was hoping to loan a pair of monitors but it doesn't look like it's gonna fit on this desk.",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1343636630610907249",
    "author": "Abel Koshy",
    "date": "2025-02-24",
    "content": "Got the legs from Amazon and had a chat with a friend of mine who does some woodworking and carpentry for a living told me to put pine as the actual desk since it won’t reflect back as much like other woods do since pine is a softer wood!",
    "reactions": 9,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "880473620797857824",
    "author": "ALXCPH",
    "date": "2021-08-26",
    "content": "Loving the new Neumanns! Thinking about getting a Vesa mount to put the screens further back! Studio is built in a 20ft container in my yard.",
    "reactions": 8,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "985369411567357952",
    "author": "cian riordan",
    "date": "2022-06-11",
    "content": "Damn that desk is sick. Paint it black, throw a Northward logo on it, and sell it for $5k",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1111650688523567104",
    "author": "NoahNeedleman",
    "date": "2023-05-26",
    "content": "For some odd reason my mom and my girlfriend at the time were so dead set against my tiny desk. They weren’t just arguing with me, (it was my studio space, not everyone’s workspace,)  they were straight up disdainful about it.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182584214743425024",
    "author": "EliHeathMusic",
    "date": "2023-12-07",
    "content": "Some progress in my new room. Built a tiny desk this week and picked up some cinder blocks (which make these Genelecs feel even smaller). Getting ready to start making some giant panels.",
    "reactions": 8,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1283721963834970122",
    "author": "Iwan Morgan",
    "date": "2024-09-12",
    "content": "I love the vibe of your room, how do you edit files in reaper with the screen off to the side? Kneel in supplication?",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1458157670895849666",
    "author": "GaspardMurph",
    "date": "2026-01-06",
    "content": "No no I’m very happy here on the console cuck chair",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "845108813253181450",
    "author": "Lucci Rossi",
    "date": "2021-05-20",
    "content": "I recently got a new desk, worked with a carpenter in Wales who helped me realise this compact, low setup. Needed my monitors off the desk and to finally actually sit in the right spot lol ! Thought some of y’all might dig it.",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1085345361444474902",
    "author": "ehutton21",
    "date": "2023-03-14",
    "content": "A day of cable management, installing the dual monitor screens, and aligning the speakers  is ahead 😃",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112193897897132043",
    "author": "LAPhill",
    "date": "2023-05-27",
    "content": "This is a stiched-together screenshot of one of the biggest cues I've done. Left to right is 12 minutes of music.",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "989285157179641947",
    "author": "mixedbyKerim",
    "date": "2022-06-22",
    "content": "Just need me a decent desk, i cut holes in this lil ikea one",
    "reactions": 6,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1030959472136437850",
    "author": "ryount",
    "date": "2022-10-15",
    "content": "I’ve gone through a few iterations of the screen/desk tweak, kinda settled on this sound anchor cart. I do wonder if the rack behind it makes much of a difference. Hard to A/B because it kinda involves re-wiring everything.",
    "reactions": 6,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1111651098059608175",
    "author": "youngteam",
    "date": "2023-05-26",
    "content": "A powerful well-respected man must have a large desk in this country",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1117090082453725264",
    "author": "tomtom",
    "date": "2023-06-10",
    "content": "That's kind of the ideal dachshund mix room. Way better setup than what Tony's got going on at the moment w the Aeron chair.",
    "reactions": 6,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1128074550903586897",
    "author": "Rollmottle",
    "date": "2023-07-10",
    "content": "i think the cost of cabling your studio and managing said cabling once you have all your shit is generally overlooked. ergonomics too.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340075731367235605",
    "author": "jordanmcleod_io",
    "date": "2025-02-14",
    "content": "Thanks!! I’ve got it pretty simple over here. Desktop interface/monitor controller is the MT48, and my MacBook is sitting in the storage gap of my desk acting as the second screen. And I’ve got a little 16U rack off to the side holding some gear for production related stuff.",
    "reactions": 6,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1459001620879638743",
    "author": "cian riordan",
    "date": "2026-01-08",
    "content": "I should get one of those desks for my assistant, just have to make a little room.",
    "reactions": 6,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1461150508893999278",
    "author": "Will Melones",
    "date": "2026-01-14",
    "content": "Yeah dude, you’ve got cool monitors and an effective cloud. All the gang can pick on is your desk and that natural light",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "921076273281925140",
    "author": "Rollmottle",
    "date": "2021-12-16",
    "content": "Nice vibey spot! If you want to go down the rabbit hole all the way, the speakers should be all the way up against the back wall. Remove the treatment from the center there and put them right up against the wall. Where they are now, they look really wide and you'll still be feeling the effects of the gap between their position and back wall. You might be getting even more boundary effect from them being so close to the side walls as well. It might be counterintuitive to remove the treatment from the middle, but it really will probably help more than not. Yes, then you will have to deal with the big screen right in the sweet spot, but one step at a time lol.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036814457566937129",
    "author": "peterlabberton",
    "date": "2022-10-31",
    "content": "Tracking toms today, just set these suckers up right by my mix position so I didn’t have to share a screen/run across the room all day. Chandler mic multed to my Moog Grandmother, getting distorted there, and then that gets multed and sent to a delay pedal with spring reverb, all recorded separate. And the stereo ribbons in for some extra space. Always fun to make the most out of repurposing the gear I have while tracking drums! (Or tracking whatever else!)",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1061354217152991284",
    "author": "jonmatteson",
    "date": "2023-01-07",
    "content": "My Christmas present from Herman Miller came in last week and has honestly changed my life.",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1150262670151405658",
    "author": "Rollmottle",
    "date": "2023-09-09",
    "content": "Part of what I did today too was put the center of my Sterling desk precisely on the centerline of the room and precisely the same distance from the front wall so I could use it as a reference. Once I got that locked in, I used my Bosch double laser thingy mounted to a tripod to reference to the room centerline and then also cast a horizontal line across the room, across the front of the speaker platform. Since both stands and platforms were now actually level, it was easy to see that the platform of the right speaker stand was slightly out vs. the left. So I had to very gingerly and carefully fuck with the platform to get it lined up. Then fine tuning of leveling with the feet. Then, using the double laser thing at the centerline, I verified the height at the speaker platforms by using that translucent target thing to make sure the cross-line it was casting, hit the target as expected (it did) . I did have to do a bunch of nudging of the right speaker stand to match its position from the right and rear wall to match the left speaker's position, which was a pain int he ass.\n\nDefinitely an ordeal and was made much easier with the tools I have. Pretty satisfying seeing identical measurements from the same reference points on either speaker stand.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237542636748013578",
    "author": "Josh",
    "date": "2024-05-07",
    "content": "Tiny desk kinda whack if you’re not just mixing or mastering",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293984979344298046",
    "author": "peterlabberton",
    "date": "2024-10-10",
    "content": "Hold on to that sucker koala-style and you’ve just saved yourself some money on a chair",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312464734775152641",
    "author": "Rollmottle",
    "date": "2024-11-30",
    "content": "Now THAT is an aircraft carrier of a desk. You could land a 737 on that.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1343638967949459458",
    "author": "cian riordan",
    "date": "2025-02-24",
    "content": "The desk looks beautiful... but I don't think particular woods are gonna be better or worse at midrange reflections. You'd have to have something extremely porous for that to be the case.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1458995293788836012",
    "author": "SoundsLikeJoe",
    "date": "2026-01-08",
    "content": "Woooo!  The \"Intern Room\" got a major upgrade today.  They went from an old kitchen table to this huge workstation desk....  FB Marketplace find.  $450 delivered. 🥳",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "835931408748642345",
    "author": "kidcutler",
    "date": "2021-04-25",
    "content": "Ok i made tiny tube traps after seeing what they charge for their defunct nano traps, worked pretty damn well for reflectings between the wall/imac. Mailing tubes stuffed with pipe wrap insulation (folded over and scrunched so essentially as thick as what is inside a tube trap) & wrapped in linen/thumb tacked in place in the back. $100 and a lil more flexible than putting a panel on the desk",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "863225956209917953",
    "author": "peterlabberton",
    "date": "2021-07-09",
    "content": "Super *un*-specialized: planyourroom.com. All the drums are \"bar stools\" and the monitors are, like, bedroom dressers or something. I just wanted something where I could move things around with the real dimensions of the gear/studio furniture and mix and match layouts.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "900489828821532782",
    "author": "bobby k",
    "date": "2021-10-20",
    "content": "lot of different reasons, but my main thesis is that i’m working on music, not waveforms. this incentivizes me to look up and face the speakers more naturally than the screen, and be more in the music than in the DAW.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036872684996399105",
    "author": "NoahNeedleman",
    "date": "2022-10-31",
    "content": "I run my prophet with my midi controller at my desk. That way I can quantize performances for arps and such and then it’s like having 4 hands, recording the audio while the midi triggers and I can twist knobs and cause chaos for that love performance feeling.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1048355132020105268",
    "author": "Will Melones",
    "date": "2022-12-02",
    "content": "Smaller desk, too. That one’s sitting between you and the headphones.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061168741473325076",
    "author": "cian riordan",
    "date": "2023-01-06",
    "content": "Side screen was the bane of my console existence.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061294423071273051",
    "author": "chadwahlbrink",
    "date": "2023-01-07",
    "content": "⇧ ⌃ Eject on macOS is great for this. Or hot corners to sleep the screen.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094037373794385940",
    "author": "popaganda.",
    "date": "2023-04-07",
    "content": "Can I interject and steer the convo in a direction that might help some of the lurkers? I tried to throw ns10s into the mix a few years ago and they really confused me. But I can't deny that my heros made great shit on them. There seem to be 2 common denominators I've seen for ns10 people. Either you came up in big studios and they were always there as a reliable reference and you learned them over time. In this context part of the sound of the ns10 is actually the desk reflection. Or you learned from a mentor who worked on them and picked up all the voodoo tricks that helped make them translate. Anybody who had a real mentor likely understands ns10s because they were ubiquitous to genX and before. I'm trying to understand if there's any use to a 25 year old now who's never been in a big studio or had a mentor and wants to do good work. I was the first to discourage someone from getting them yesterday in monitoring. Was my take wrong?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095136720107880538",
    "author": "Nomograph Mastering",
    "date": "2023-04-10",
    "content": "The NS10 Israeli talking chair from  beauty and the beast is something",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1168276258371682424",
    "author": "BatMeckley",
    "date": "2023-10-29",
    "content": "“How many screens do you want?”\nYes.\n“Ok… and um… midi controllers?”\nYES.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171613925511532554",
    "author": "BatMeckley",
    "date": "2023-11-07",
    "content": "Very very cool studio. Lots of guitars in absurd tunings and an upright piano. Comfy couch on a back wall with at least a foot of treatment. Room sounds (and looks) gorgeous, even without the pmc’s on. Two of my fav guitar pedals on the desk within arms reach. Lots of natural light, chair has the flip up arms which is key for a guitar player. Literally on the same block as one of my fav stores/galleries. Lots to like about this place. \n\nI’m always inspired by rooms clearly made for someone specific. I hate the all things to all people approach, which usually mean “great at nothing specific”. This room is a great reflection of @LAPhill. \n\nFun fact: no monitor controller. Neat.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172624828163965009",
    "author": "jonmatteson",
    "date": "2023-11-10",
    "content": "@spiderplus1 coming in clutch with the quick delivery for some sessions this week! These things sound incredible. \n\nNext step is to build a membrane for the back wall designed by @Gerhard Westphalen to deal with my 90hz dip. Also going to be getting a smaller desk situation figured out this week!",
    "reactions": 4,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1428856786705842347",
    "author": "cian riordan",
    "date": "2025-10-17",
    "content": "I had it this way with the UTA console. Could build up a mix on the desk then just right click and commit all the console channels and it’s all in the box",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457499989659095111",
    "author": "Ross Fortune",
    "date": "2026-01-04",
    "content": "Gonna have to get rid of that console if you want to address the desk reflections though",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "988813362685161552",
    "author": "manyonline",
    "date": "2022-06-21",
    "content": "While were talking tiny desks guess I should chime in w mine",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1031759424638947338",
    "author": "cian riordan",
    "date": "2022-10-17",
    "content": "Acoustically, the Ikea Bistro Chair scores perfect marks across the board. @Nomograph Mastering can surely back me up on this.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072279137445740634",
    "author": "popaganda.",
    "date": "2023-02-06",
    "content": "You guys really thinking about dropping $600 on a little desk?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077316226524651560",
    "author": "Jeremy Klein",
    "date": "2023-02-20",
    "content": "Yo! I got this table off a recommendation from this discord. My absolute favorite part about it is it's a sit/stand desk for $140 that feels stable and not super cheap-o \n\nhttps://www.amazon.com/gp/product/B08P7C7DBR/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077317628055531570",
    "author": "popaganda.",
    "date": "2023-02-20",
    "content": "This is totally an opportunity to get creative and dig around used furniture stores/goodwill. The weirder and more unique the desk the more cred/respect you’ll get",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085977979684929727",
    "author": "ALXCPH",
    "date": "2023-03-16",
    "content": "I think it just comes down to getting work done despite the gear not because of it. \n\nGear is great, gear is fun, gear is informative Anyone should buy as much gear as it takes to fill ones desire as long as it doesnt get in the way of doing the work. \n\nSpending a few hours Changing things around to make what ever work you are doing easier is never a bad thing. \n\nAs long as we arent neglecting our passion because of some false belief that our desk is too Big or our monitors have the wrong logo on it, i Think well all be just fine.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104242221986893884",
    "author": "BatMeckley",
    "date": "2023-05-05",
    "content": "I’m a big fan of a little treatment on the front wall, a 32” monitor in front of the speakers and a desk you could land an F16 on.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116563349539401780",
    "author": "David Fuller",
    "date": "2023-06-08",
    "content": "Joining the tiny desk gang soon! Just bought one of those 1 rack wide Zaors.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129927453352153210",
    "author": "Will Melones",
    "date": "2023-07-15",
    "content": "Small desk gang, my desk is light and moves every time I breathe on it. A couple of weights around the legs seem to keep it a bit more stable. Some of you may have extra cinder blocks around the studio.",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1131519845096226858",
    "author": "Bryan DiMaio",
    "date": "2023-07-20",
    "content": "It’s like the Slate raven desk but actually ergonomic looking haha",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154504963762954240",
    "author": "Rollmottle",
    "date": "2023-09-21",
    "content": "Annnnnd we’re back. The screen in the middle was too much of an eye chart and thus canceled any ergonomic gain. Trying to find the middle ground without needing future neck and shoulder surgery.",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1187434798004842599",
    "author": "cian riordan",
    "date": "2023-12-21",
    "content": "I can smell that thing through my phone screen",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211758052320215110",
    "author": "Bryan DiMaio",
    "date": "2024-02-26",
    "content": "you took such a beautiful picture of Anthony's setup and then hit us with the wide angle long desk visual illusion pic of your own setup haha",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247610730690121873",
    "author": "chrissorem",
    "date": "2024-06-04",
    "content": "New desk diffuser I’m working on… I’ll report back with the results",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "900962000463626261",
    "author": "cian riordan",
    "date": "2021-10-21",
    "content": "It’s much more ergonomic than looking up!",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "921116713540530256",
    "author": "Eric Martin",
    "date": "2021-12-16",
    "content": "FWIW your room doesn’t look that far off, IMO it looks like you could move 4 panels put the stands and speakers close to the wall and move that desk up and it might get you closer to what you want, it’s worth trying",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1016771495860641833",
    "author": "P.K. Stephan",
    "date": "2022-09-06",
    "content": "The desk is a northward desk. The room build was originally done by Erik Breuer who built most of the Red Bull Studios. My studio planner updated the acoustics and flush-mounted the ATC’s when I took over the room.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028793224304791643",
    "author": "ALXCPH",
    "date": "2022-10-09",
    "content": "Having a listening sesh with the new desk setup. Am pretty amazed that it actually makes that mutch of a difference in Sound. Its not gonna win you any grammys. But i really feel im hearing more than i was before. Well have do some some graphs when i get the time!",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1031330585819480084",
    "author": "Eric Martin",
    "date": "2022-10-16",
    "content": "that’s i#why I said there’s a fine line between ergonomics and acoustics, ergonomics need to be considered, you’ll hunchback faster by looking down vs up, but up is just as bad in an opposite way.\n\nThere’s something about eye level when sitting upright that the screen shouldn’t be higher than",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061269071158583387",
    "author": "Zakhiggins",
    "date": "2023-01-07",
    "content": "Unplugging the hdmi cable from your screen when listening back to a mix is a vibe though.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064978347291054213",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "We got some low end haha @Zack Hames ...most important is the room is designed to handle it. Castelli's stuff sounds wild\n\nGot a new tiny tiny desk being built gonna post showing the whole room here when it's done!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065739820179136603",
    "author": "Will Melones",
    "date": "2023-01-19",
    "content": "Yes, I love it. I have it hanging high behind my computer screen and blast myself with ‘sunlight’ in the early hours of the workday. It really does something for my focus, especially in a mostly windowless basement.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072285451509051442",
    "author": "peterlabberton",
    "date": "2023-02-06",
    "content": "I got a little keyboard tray standing desk thingy for like $60 on Amazon and it's honestly perfect... FYI",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077318182689325066",
    "author": "Zack Hames",
    "date": "2023-02-20",
    "content": "It's kind of crazy how many people I see ditching those Output desks. Their marketing was super effective.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079122187782471801",
    "author": "BatMeckley",
    "date": "2023-02-25",
    "content": "Considering running everything off the iPad remote, hanging the speakers from the ceiling, and just going deskless entirely.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106778131181867118",
    "author": "BatMeckley",
    "date": "2023-05-12",
    "content": "Throw some packing blankets on the wall. Big desk. Bigger speakers on the desk. A tube trap or two. Profit.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129446118208581753",
    "author": "GaspardMurph",
    "date": "2023-07-14",
    "content": "I thought I’d share my setup here ! I love my space here but I am starting to feel like I’ve hoarded myself into a corner. Too much stuff accumulated that I don’t need / use.\nHere is my plan to make more room, if anyone has an opinion, please shoot 🙂\n- condense all the rack gear into one of the rack cabinets, there a ton of stuff that is just in there and not being used (nor is it patched in)\n- Rhodes is going to my house, I think it will get more use as a practice / songwriting tool in my home.\n- Mellotron goes where Rhodes was, so I can store my tape echoes on the drawer cabinet\n- Smaller desk: I need to find the right one or have one built but I really only need my prophet, mouse and keyboard.\n- Would also be a good opportunity to improve speaker placement\n\nThe room is smaller than it looks in the pictures, it’s 161 sq feet. About 14.9’ long, 11.9’ wide and 7.6’ high. It’s a floating room design and there is acoustic treatment behind the fabric walls (no idea what though)",
    "reactions": 2,
    "attachments": 4,
    "is_pinned": false
  },
  {
    "id": "1138875241989414962",
    "author": "Slow Hand",
    "date": "2023-08-09",
    "content": "Imagine being rich enough to own that house but still having to rely on that janky keyboard stand setup beneath the desk.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150256414653157417",
    "author": "Nomograph Mastering",
    "date": "2023-09-09",
    "content": "Wrangled 6-2 on sound anchors on spikes on concrete behind a huge desk today",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1165349679794503690",
    "author": "Tim O’Sullivan",
    "date": "2023-10-21",
    "content": "New Mac Studio equals new monitor and no more staring at a tiny laptop screen. Tried to get it out of the way of the glass and the speakers as much as possible, but tricky with how tall my console is.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1171964429273935892",
    "author": "BatMeckley",
    "date": "2023-11-08",
    "content": "I like ergonomically having the Magic Trackpad. It’s Bluetooth, battery lasts forever, and you can do more with it. Plus it takes up virtually no space in your bag. Worthy investment",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1193367456610263190",
    "author": "Will Melones",
    "date": "2024-01-06",
    "content": "No big desk, real nice desk, mini baby prophet?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202820544924229693",
    "author": "rory miller",
    "date": "2024-02-01",
    "content": "YO I WASNT THE ONLY ONE WITH THE VOX PATHFINDER ON THE DESK😭😭",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1209909009780314172",
    "author": "Nomograph Mastering",
    "date": "2024-02-21",
    "content": "1) The door won't have a negative effect on monitoring unless it rattles or vibrates a bunch. It will provide less of a \"boundary\" than a wall and hence less low end re-enforcement, that will be *different* but not obviously better or worse. The other consideration is access, and how that will worl ergonomically",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210710689216209000",
    "author": "kylem",
    "date": "2024-02-23",
    "content": "I'm 6'3 and always struggled with that until I bought this guy -  https://www.upliftdesk.com/?wickedsource=google&wickedid=Cj0KCQiAoeGuBhCBARIsAGfKY7zSChbqkhWoso7FX2LB8vcO8zn6A9EBWccw70ZI2zp3pLTEGzYXHz4aAsqUEALw_wcB&wickedid=344953927332&wcid=805069123&wv=4&utm_term=uplift%20desk&utm_campaign=Search+-+UPLIFT+Desk+-+Branded&utm_source=adwords&utm_medium=ppc&hsa_acc=3428820651&hsa_cam=805069123&hsa_grp=37211695330&hsa_ad=344953927332&hsa_src=g&hsa_tgt=kwd-299994086325&hsa_kw=uplift%20desk&hsa_mt=e&hsa_net=adwords&hsa_ver=3&gad_source=1&gclid=Cj0KCQiAoeGuBhCBARIsAGfKY7zSChbqkhWoso7FX2LB8vcO8zn6A9EBWccw70ZI2zp3pLTEGzYXHz4aAsqUEALw_wcB",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210713473735069717",
    "author": "BatMeckley",
    "date": "2024-02-23",
    "content": "I got my desk made by _soundesign_ off instagram and I can’t recommend him enough. Made custom, and he used sit/stand motorized legs , not because I’m constantly doing standing work, but it allowed me to put an 88key on a rolling stand and the adjust the desk in 1/4” increments until it fit perfectly. Plus he’s just a good dude",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230197023433818112",
    "author": "LAPhill",
    "date": "2024-04-17",
    "content": "I didn't think MEs were allowed to have desks that large",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264417193559457813",
    "author": "Eric Martin",
    "date": "2024-07-20",
    "content": "I feel like with the desk I want to push the volume to overcome the reflection, I like the space it gives feels more relaxed, more razor clear with the stereo field",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1307428221016473702",
    "author": "Ross Fortune",
    "date": "2024-11-16",
    "content": "I’ve sat in these chairs. They are cool chairs to look at and sit in, and to look at Chris’s back from.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342303483545649216",
    "author": "Bryan DiMaio",
    "date": "2025-02-20",
    "content": "I saw the topping stuff on the screen while the Apollo started to cry a little bit",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376629788583923862",
    "author": "Will Melones",
    "date": "2025-05-26",
    "content": "Don't know if I'm totally sold on the ergonomics here. Probably going to give it a steeper tilt, keeping the front legs short.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1428763054174109750",
    "author": "chrissorem",
    "date": "2025-10-17",
    "content": "I was an inch away from buying a 4000 last year.  Nothing beats the real deal and having it in front of you and mixing with your screen off. I hope you have the best mixes to come ahead of you!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808417103849455636",
    "author": "oaklandmatt",
    "date": "2021-02-08",
    "content": "i think i said this in the other thread but i love how many buttons and pads and knobs and screens there are",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "856987593589391390",
    "author": "Slow Hand",
    "date": "2021-06-22",
    "content": "Yeah. Herman Miller made these Laptop scooter stands about two decades ago. They show up on Ebay now and again for $200-300.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "900470900812574720",
    "author": "David Fuller",
    "date": "2021-10-20",
    "content": "it keeps the screen reflections to a minimum",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "901121095581700156",
    "author": "alecdibell2",
    "date": "2021-10-22",
    "content": "@cian riordan hey Cian, where is your desk from?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "921117978400002048",
    "author": "Maxim",
    "date": "2021-12-16",
    "content": "I just got my favourite sound with the speakers moving them closer together behind the desk again. With the mid & tweeter section peeking out next to the screen. Not sure why but so far it sounds like I'm actually listening to music.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "922465958524764230",
    "author": "Maxim",
    "date": "2021-12-20",
    "content": "So I'm currently doing all of this (removed screen as well). I'm not sold just yet. \n\nFew issues: the listening position is still best in my old spot (about 34% into the room). So I have to pump more sound than before to get the same \"feeling\". Phantom center is also not as clear.\n\nAlso, the idea of getting a triangle gets thrown out the window. I'm further away than they are apart. Bass of course is bigger (even with a -6db roll-off) but I'm not sure if it's actually useful. And it seems like the walls are now vibrating more (already had a neighbor asking what I'm up to).\n\nAnd for some reason records that sounded great to me before now sound unlistenable and harsh in the upper mids. Not sure if this is true just yet though (see Walking on a Dream by Empire of the Sun). If this is what other people are also hearing maybe it's the detail I've been missing in the mids. Some songs are really painful.\n\nOn the plus side, the room is a bit \"deader\" and even now because I moved the treatment to the back (where previously there wasn't much). Also, reverb tails are very clear now. Before I couldn't really hear FX until I overdid them and dialed back. I'll try doing a mix like this and see if I intuitively make better decisions.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030963098850443304",
    "author": "ALXCPH",
    "date": "2022-10-15",
    "content": "I love the new little desk trend we got going on here. Am guilty of joining it too. But it’s kinda funny to me that most of our favourite records was mixed with huge boards between the mixer and speakers.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031026335755276288",
    "author": "Eric Martin",
    "date": "2022-10-15",
    "content": "there’s a line between ergonomics and acoustics that I have a hard time finding a good divide, currently my computer isn’t at the listening position at all and that really helps for mastering, makes it difficult for mixing but I’m still getting decent translation results sitting side saddle",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031315328778633236",
    "author": "ehutton21",
    "date": "2022-10-16",
    "content": "I have no empirical evidence, just anecdotal, but I think working with a high screen setting fucked my neck up pretty hard man. We’re not meant to have our chins jutting out and up. It’s gonna give you hunchback asap.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061295591843430400",
    "author": "mixedbywong_my",
    "date": "2023-01-07",
    "content": "This . I’ll move the mouse to the bottom left corner and voila ! SCREENSAVER mode 🥸",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061379557975937074",
    "author": "Rollmottle",
    "date": "2023-01-07",
    "content": "i have very low pile Flor tiles in the middle of my room...easy to roll on and classes up the joint a bit. i've switched out the wheels on my Aeron for rubber/rollerblade wheels which makes rolling way easier.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067908232749776916",
    "author": "peterlabberton",
    "date": "2023-01-25",
    "content": "Kevin Durant would come to my old spot in Oakland sometimes (though we never crossed paths) and one of our interns got a photo of him standing on a chair next to Kevin, roughly equal in height with that lil boost.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069272351134470144",
    "author": "Eric Martin",
    "date": "2023-01-29",
    "content": "and a desk haha, this screen/desk is only stand in for initial, testing, does it work? Yes, now to find materials and a better solution",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069274142391664791",
    "author": "NoahNeedleman",
    "date": "2023-01-29",
    "content": "Wrong kind of tiny on that desk huh? 😂 RESPECT THE GRIND THO",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072283079433015446",
    "author": "David Fuller",
    "date": "2023-02-06",
    "content": "God forbid you want your outboard in an ergonomically useful place lmao",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094048362413686905",
    "author": "ehutton21",
    "date": "2023-04-07",
    "content": "This Setup is goated because I see you too have used a spare panel to hide wires behind your desk",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106779914843197471",
    "author": "Bryan DiMaio",
    "date": "2023-05-12",
    "content": "Wrap around desk, five subs and one satellite",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106941167704223797",
    "author": "Ross Fortune",
    "date": "2023-05-13",
    "content": "@Andy Lawson Someone mentioned these cable sleeve things on Amazon recently, I’m ordering some for the absolute shitshow visible behind my desk \n\nAlex Tech 10ft - 1/2 inch Cord Protector Wire Loom Tubing Cable Sleeve Split Sleeving for USB Cable Power Cord Audio Video Cable – Protect Cat from Chewing Cords - White https://amzn.eu/d/dSmlahK",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109948714560278549",
    "author": "Ross Fortune",
    "date": "2023-05-21",
    "content": "Totally, hallowed ground. It’s a really lovely room to work in. I’ve been in all white studios before, and sterile is the word. Somehow Nigel managed to make it feel like a home, and a spaceship. It was also a perfect session today - cool people, good music, appropriately paid. The golden trifecta🤘🏻\n\nApparently the techs have an absolute mare dealing with the desk - i don’t think there’s much in the way of available schematics. It looks cool though - the bottom of the board is naked, the innards are exposed.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1111645619564597400",
    "author": "NoahNeedleman",
    "date": "2023-05-26",
    "content": "Next up- tiny desk! Side car looks super pro tho.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1111651629654102096",
    "author": "youngteam",
    "date": "2023-05-26",
    "content": "Seeing people double up on smaller desks one for monitor and one for keyboard was eye opening to me. I could never get speakers and desk in the place I wanted and always compromised. It will be good to have my monitor behind the plane of my speakers again",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1121600670898851940",
    "author": "Andy Lawson",
    "date": "2023-06-22",
    "content": "@Gerhard Westphalen have you been able to get your hands on any aerogel? If it deals with sound like it does heat cover your desk with that 🤣",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1126979277724844032",
    "author": "Josh",
    "date": "2023-07-07",
    "content": "And then it made my adorable little screenshot massive and idk why it won’t let me delete it. I’m going back to threads now. This is too much.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129455625231929376",
    "author": "LAPhill",
    "date": "2023-07-14",
    "content": "The trick is to take the keybed out and build it INTO the desk. Literally the only ergonomic solution I’ve ever found.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1131679341017825311",
    "author": "Felix Byrne",
    "date": "2023-07-20",
    "content": "not sure abt the atmos install but ik dale builds most all of his racks/desks/speaker stands etc himself",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132850124289228811",
    "author": "BatMeckley",
    "date": "2023-07-23",
    "content": "There’s some 42” screens that look more promising… there’s a couple of hassles for a guy with my work flow.  If you’re a check in, turn it on, work for 7 hours, done for the day, it’s great.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150848264954974288",
    "author": "LAPhill",
    "date": "2023-09-11",
    "content": "Okay but what is happening on that screen??",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178806290412224533",
    "author": "Rollmottle",
    "date": "2023-11-27",
    "content": "i like how absolutely gargantuan you have the icons on your desktop",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210713914267013161",
    "author": "Bryan DiMaio",
    "date": "2024-02-23",
    "content": "precise adjustment of height is super worth the standing desk thing, plus a lot of the frames are super sturdy",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214039374698651689",
    "author": "Adam Thein",
    "date": "2024-03-03",
    "content": "Not annoying!  Wayfair - don’t remember the name but I think they have a small desk category.  Not well built but the size and price was right.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247406623811440691",
    "author": "peterlabberton",
    "date": "2024-06-03",
    "content": "I have ideas, b/c this sort of stuff has been bugging me big time, but I'm holding off until I can start the real studio build.\n\nThe one thing I do have, and like, is the Hue lightbulbs folks were talking about recently. I don't fuck with the colors, but it's nice having dimmable lights all over, even on lamps and whatnot.\n\nOne thing I have not figured out is the computer monitor. It has to be too far away for good ergonomics (we all know this), but a cannot stand the screen really low thing—I crane my neck over instinctively and get *wild* headaches/neck pain. But where I have it now, I also crane my neck closer since it feels too far away. I've always hated big TVs for computer monitors in studios, too, but I'm debating going that route in the next spot and having big ass type like a true grandpa. Anyway, didn't mean to hijack!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264422461576052787",
    "author": "Eric Martin",
    "date": "2024-07-20",
    "content": "and it sounds more similar to the new room which has no desk",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308178998555054180",
    "author": "audioanthem",
    "date": "2024-11-18",
    "content": "🔥🔥 think I’m just going to buy the northward desk .. I need a screen closer because I can’t see anything 🫠",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1349219832020602913",
    "author": "TommyOakley",
    "date": "2025-03-11",
    "content": "Packed all of this in my car (minus the desk) and drove from Atlanta",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1355226176108495040",
    "author": "BatMeckley",
    "date": "2025-03-28",
    "content": "First thing to go when you commit to the tiniest of desks.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376261629922119700",
    "author": "chrissorem",
    "date": "2025-05-25",
    "content": "I’m messing! I won’t even show you my desk it’s filthy",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1381762049222246541",
    "author": "thegreatcarsoni",
    "date": "2025-06-09",
    "content": "The life is great, I’m just realizing the wide angle shot makes the speakers and screen look absolutely tiny haha",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383859522761654384",
    "author": "herbie",
    "date": "2025-06-15",
    "content": "yeah it is!! it came with the uplift desk as one of the add ons you can choose",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463188782655213631",
    "author": "cian riordan",
    "date": "2026-01-20",
    "content": "Most people folks here have actively tried to make their desk surface smaller to minimize reflections from the near fields. Always a trade off — so if you need the space, use the space and get on with the work!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463301117956849937",
    "author": "aliberger",
    "date": "2026-01-20",
    "content": "was never able to get a good critical listening setup going around it but yes - tradeoffs! lately i have an area with flat surface for fun production stuff, work mostly in headphones there, and then a separate zone with a tiny desk and the proper listening area",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1467518596761522277",
    "author": "chris_donlin",
    "date": "2026-02-01",
    "content": "I’ve seen some options like this that I like, even something like the herman miller style coat hooks I thought could be fun",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808473385100247070",
    "author": "AV",
    "date": "2021-02-08",
    "content": "Not super big tbh, just looking for a space where I can fit my desk and track vocals.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "823704124830515273",
    "author": "cian riordan",
    "date": "2021-03-22",
    "content": "I've always loved this low screen, angled up thing that I'm seeing in more mixing/mastering studios. I wonder if there's a trick way to do that with an iMac without spending a testicle on vesa mounts, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "823752579828678656",
    "author": "Eric Martin",
    "date": "2021-03-22",
    "content": "how do y’all handle looking down at the screen like that? I can’t stand the ergonomics of the screen being so far low, makes me sit funny, and tilt my head in a way that just doesn’t feel right. I’m a firm believer in the top of the screen at eye level so you sit upright all the time.\n\nHas anyone done a good job pairing good acoustics and good ergonomics?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "835940198113607721",
    "author": "kidcutler",
    "date": "2021-04-25",
    "content": "They’re insane for that, if they charged a few hundred these would/should be on every desk",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "856985278492835871",
    "author": "cian riordan",
    "date": "2021-06-22",
    "content": "Anyone have any ideas for a better desk solution? I like how shallow this is, but it could be a little wider... and be a little less wobbly.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "856988082498961428",
    "author": "Slow Hand",
    "date": "2021-06-22",
    "content": "If you want a custom wood desk, my company in LA can always make you one to spec. And if you want something super-fancy the designer in the unit next to our warehouse makes custom furniture and metalwork. I'm sure a desk would be no problem for her.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "856988527513305108",
    "author": "Slow Hand",
    "date": "2021-06-22",
    "content": "Yeah. I DM'ed someone about that desk when I noticed it in their studio pic. They spoke very highly of that particular model. They come in black and (more commonly) entirely woodgrain.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860227190457106452",
    "author": "chadwahlbrink",
    "date": "2021-07-01",
    "content": "I would be very curious to hear the unfuck guys' chat tube traps! I keep seeing Jon’s in pics and curious to hear his thoughts as well.\n\nThey have been great for me. I scored my whole set in 2 batches (16 tubes, 3 speaker stands) for roughly $4500 total - which is still pricey but a great “deal.” Also, they make my Apartment’s basement bedroom usable. \n\nThey lock you into a very specific aesthetic and ergonomic setup, which I have found interesting to navigate (placing a desk, can’t adjust speaker height, etc.).\n\nThey also sound great for tracking! I have used them while tracking drums, harp, vocals, and other things with excellent results.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860238451956776981",
    "author": "chadwahlbrink",
    "date": "2021-07-01",
    "content": "Yes, for sure! As a renter, work-from-home option, they are a dream. I think you could get better ergonomics and potentially better sound from other studio design options, but the flexibility is great. They are definitely not a magic bullet to get a “flat room” either and placement / quantity can affect things greatly. \n\nAndrew Maury was the one who inspired my initial purchase! He does fantastic work on them and was definitely a great resource as I was looking into them. He shared this video with Greg from Kush audio which was very convincing at the time  https://m.youtube.com/watch?v=P7pOA4eeuS0&t=72m13s\n\nI also have friends who have had good success building diy tube traps — which can be pretty affordable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860307501693665291",
    "author": "peterlabberton",
    "date": "2021-07-01",
    "content": "Now… are the tube traps/attack wall effective to the point where a layout like this would still be an optimal listening environment? Totally off-center mix position, but I think this would optimize my new room, instead of dividing the recording spaces on either side of the desk. (Upper right in case my drawing is as bad as I think it is!)",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "863130651574534185",
    "author": "peterlabberton",
    "date": "2021-07-09",
    "content": "My future setup. Will of course need to adapt as I get in the room and listen, but I'm excited *and* need to minimize downtime between studios, so I'm mapping stuff out as best I can so I can hit the ground running.\n\nI'm thinking I'll build some fiberglass/rockwool panels on stands (the four panels freestanding by the mix position) and mimic some of the idea behind the attack wall: kill reflections closer to the listening position rather than at the walls. This way I can keep the fireplace and windows from being covered up, and have some gobos to move around when needed for tracking. The small desk to the left of the mix position will be a rack for gear, the large rectangular thingy in the upper right will be an upright piano. I'll pack in some DIY tube traps around the monitors, and hang two 4'x2' panels I already own over the mix position. I'll also put two slightly smaller panels over the drums, and two more on the wall behind the drums. The french doors and the sliding doors to the closet behind the couch will have heavy curtains.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "900406677172518934",
    "author": "mixedbywong_my",
    "date": "2021-10-20",
    "content": "Does having the screen down keeps your neck more relaxed ? Shoulders ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "900416210158632970",
    "author": "cian riordan",
    "date": "2021-10-20",
    "content": "Nice! Feels so good to look down at the screen and not up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "900442970489237557",
    "author": "Slow Hand",
    "date": "2021-10-20",
    "content": "That’s a slick desk setup. I may have to build one of those myself.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "900727776397656094",
    "author": "seb",
    "date": "2021-10-21",
    "content": "There's no way thats actually ergonomic though... you dont find your neck to be strained after a while?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "900945099230441493",
    "author": "chris_donlin",
    "date": "2021-10-21",
    "content": "My Monitor isn’t as far down but if anything I’ve noticed my neck more strained and I have worse posture when my screen is directly in front of me. Looking slightly down feels more natural to me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "901141588347088917",
    "author": "bobby k",
    "date": "2021-10-22",
    "content": "Screen down is so nice. keeps me in the music. i wanna be looking at the screen as little as possible",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "901142071967117342",
    "author": "cian riordan",
    "date": "2021-10-22",
    "content": "It's this thing. I just chopped it down a few inches with a grinder: https://www.wayfair.com/furniture/pdp/andover-mills-agostini-desk-w001765410.html?csnid=50C5A443-3670-43B6-9198-8EABA0513122&_emr=44bb72f2-4214-41ce-a783-b2082fa1e3fe&_eml=57e18353-29bf-465b-b6c2-3943a7a98f2c&refid=EML_47475&source=graymatter",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "901145684793778326",
    "author": "cian riordan",
    "date": "2021-10-22",
    "content": "Only downsides is 1) you have to fucking chop it to get it to a reasonable height 2) you have to vesa mount your computer/screen or have it on a stand behind the desk and 3) the desk is very light, so sometimes it'll slide if you bump it. But given it's $100 and stays out of the way of the monitors for the most part, I'm happy with it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "901146064982257714",
    "author": "alecdibell2",
    "date": "2021-10-22",
    "content": "@cian riordan same, i just need a desk that’s a bit smaller than what I have now. Still looking through to find something I won’t have to alter",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "901607501613658163",
    "author": "jacobmunk",
    "date": "2021-10-23",
    "content": "how are you positioning your screen there??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "917432882069405796",
    "author": "mixedbywong_my",
    "date": "2021-12-06",
    "content": "Nice setup ! What do you usually use the top screen for ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "921087431191707709",
    "author": "Maxim",
    "date": "2021-12-16",
    "content": "And I'm going to take down the screen for the moment because it's really not helping and the reason I put the speakers so far apart...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "921087678974398534",
    "author": "Maxim",
    "date": "2021-12-16",
    "content": "A smaller desk would make sense now as well",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "939325318454468669",
    "author": "chris_donlin",
    "date": "2022-02-04",
    "content": "Anyone follow Reid Shippen on IG? His new room is crazy but honestly his chair caught my eye the most",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "939339635849592862",
    "author": "Felix Byrne",
    "date": "2022-02-04",
    "content": "same chair josh gudwin uses! https://www.fully.com/hag-capisco-chair.html",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "939352062423093250",
    "author": "Rollmottle",
    "date": "2022-02-04",
    "content": "fully...fully fucking expensive. lol. been thinking about getting into a chair without a back as high as my Aeron and this one looks pretty nice actually.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "955210527750094928",
    "author": "Keegan",
    "date": "2022-03-20",
    "content": "How much do those things weigh? I've thought about using some on my desk but they look crazy heavy lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "955298820613345310",
    "author": "Rollmottle",
    "date": "2022-03-20",
    "content": "I look at cinder blocks as something you use more when you're tight on cash and can hang with the aesthetic and ergonomics of dealing with moving giant cement blocks into position lol. If you already have something like these, I don't think I'd be too worried about it until you're making a bigger move in the studio.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "955771951404711976",
    "author": "herbie",
    "date": "2022-03-22",
    "content": "Haha that’s still a steal! Is that an Aeron chair in that pic? If it is how do you like it? In dire need of a new chair and been finding a bunch of Aerons for sale on FB marketplace for pretty cheap",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "955860784725000294",
    "author": "Josh Bowman",
    "date": "2022-03-22",
    "content": "I like it! I’m sure there are other good ones, but for me, I don’t really think about my chair much at all… which is a good sign I think! I know there are people on here who would prob have other good recos too. If you search chair on this discord in gear or general chat I bet there are some convos too!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982702198926508062",
    "author": "peterlabberton",
    "date": "2022-06-04",
    "content": "This is the kind of nerdy tweaky shit I think this discord will appreciate: got my lil S1 control surface a few days ago, and used setting it up as an excuse to also play around with the arrangement of my tiny desk, and add some EQ to my monitors.\n\nTried the S1 behind my keyboard (too deep and potential for more reflections), and off to my left (weird neck craning all day), and landed here for now. Then busted out a mirror and angled my desk to avoid any reflections from the monitors at the listening position. Shot the room again and popped this EQ on the output in UAD Console (it’s finally good for something!!), and am very pleased with the new arrangement. 🎉\n\nRuairi might have a fit with this EQ curve, but I’m ABing it in and out and it’s definitely helpful, until I get my act together and build some membranes!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "985316704336891954",
    "author": "ALXCPH",
    "date": "2022-06-11",
    "content": "I gotta know! What’s that pad on your desk? And what desk is it? I’m selling my mega huge studio desk and going the small desk route! I’ll propably be building my own desk to make it perfect for my setup, but I like your size! Where do you keep your interface or ad/da? You got more pictures? 😇😇😇",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "985352886412259418",
    "author": "cian riordan",
    "date": "2022-06-11",
    "content": "It’s just a gaming mouse pad that fit the dimensions of my cheap $100 wayfair desk… I’ll try and dig up the link. All my stuff is in a credenza to my left. I’ll try and post some photos soon!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "985499089057751060",
    "author": "ALXCPH",
    "date": "2022-06-12",
    "content": "Love this setup man! Looks great! Might have to steel that little desk design! 😜",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "985630522699030588",
    "author": "Will Melones",
    "date": "2022-06-12",
    "content": "Nice! I was thinking of drilling massive holes in mine. Like a Holeyboard desk or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "985686520725909524",
    "author": "peterlabberton",
    "date": "2022-06-12",
    "content": "Also dig the drum throne (I fucking hate calling them that). My ergonomic office chair has been in the corner for a couple weeks and I’m into it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986384006457204777",
    "author": "Jeremy Klein",
    "date": "2022-06-14",
    "content": "How is the screen size / eye strain here? I've got my tiny little desk but Im struggling where to put my monitor. I was afraid on the wall as you have it would cause some eye strain to focus that far away",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986468792030871623",
    "author": "blanco",
    "date": "2022-06-14",
    "content": "there’s charts online that show recommended distance from eyes to screen, based on screen size and resolution. as well as parallel to eye level or above/below. take measurements before you commit to a type of mount solution. might help narrow down options.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "986630882704105522",
    "author": "Josh Bowman",
    "date": "2022-06-15",
    "content": "The top screen is just 1080p (not a crazy high resolution) so it’s totally fine for me cause everything’s big ish looking, the iMacpro  5k monitor I’m thinking of moving closer to me but I’m undecided. I have glasses that I wear that make it a non issue. Without the glasses it’s a little far. That being said I’m also sitting pretty close to@my speakers so I’m maybe not as far away as the pictures look? Not home or I would take a measurement. The wall mount arm of the top monitor can swivel out so I could totally move tbem closer if I wanted. Haven’t felt the need to yet.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987437345282347069",
    "author": "Jeremy Klein",
    "date": "2022-06-17",
    "content": "Yeah now that I look closer at that picture your monitor is way closer than I originally thought. The other reason why I want my tv monitor on the back wall is because, like your old setup, I have a sit/stand tiny desk",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "988861629699596308",
    "author": "Josh Bowman",
    "date": "2022-06-21",
    "content": "Nice! Can we see it with the supports/bottom etc? Curious about the desk leg situation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "989628797726900355",
    "author": "Josh Bowman",
    "date": "2022-06-23",
    "content": "That’s not bad!!! Great idea mounting it to the desk the monitor is on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "992951532834258994",
    "author": "Zack Hames",
    "date": "2022-07-02",
    "content": "I find looking down is better than craning my neck upward - is that not your experience? (Unless you mean simply having a second screen to focus on sometimes)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1000905243464302622",
    "author": "Eric Martin",
    "date": "2022-07-24",
    "content": "it feels so good, sounds good, looks good, feels ergonomic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001555937800232971",
    "author": "Eric Martin",
    "date": "2022-07-26",
    "content": "All the treatment in my room is behind me, but now that I have this new desk I’m thinking curtains behind the speakers and on my sides",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001758779047694427",
    "author": "Skyler Young",
    "date": "2022-07-27",
    "content": "Was looking to join the tiny desk crew but thinking these could be another solution",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001766270812819586",
    "author": "ehutton21",
    "date": "2022-07-27",
    "content": "Just instinct, but I feel like you can get a better desk solution for the same prices. I haven’t searched this one thoroughly though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001791018334699561",
    "author": "Skyler Young",
    "date": "2022-07-27",
    "content": "Totally, haven’t searched deep yet, but mostly the idea of metal grill desk tops seems like a good idea to me - but if it was such a good idea I probably would have seen someone else do it by now?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001791165584113694",
    "author": "Skyler Young",
    "date": "2022-07-27",
    "content": "Really good point, may have look just for desk top",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001832425241981019",
    "author": "cy (sigh)",
    "date": "2022-07-27",
    "content": "I have a glass /metal desk rn (need to change soon) and I very clearly hear resonances if I go past a certain volume. obviously will depend on the room and the material youre listening to  but unless you like blasting really loud it's not the worse situation. you do have to keep it in mind though. I'd imagine rattling would happen if there's a grill, which could be reduced with some rubber isolation stripes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001856978081034321",
    "author": "Eric Martin",
    "date": "2022-07-27",
    "content": "if the legs are hollow, they could be filled with sand.\n\nI know everyone is talking about transparent desks, small desks, and the like. I just got a pretty big sterling plan a and it’s more transparent than my previous desk by a long shot. Not cheap, but from a workflow and gear organization standpoint in my circumstances it made a huge difference and was 100% worth the 0% financing for 48 months (especially in this economy)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028733596665655376",
    "author": "youngteam",
    "date": "2022-10-09",
    "content": "i have a massive desk *and* i want to hear some kh310s.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029113865092472982",
    "author": "ALXCPH",
    "date": "2022-10-10",
    "content": "Since my old Big desk and wrongly located cloud. Actually yes. And quite a Big one. Mostly more clear separation of lows vs lowmids and its a little bit easier to judge harshness, but the stereo image is sooo clear. Its Way easier to place things and see where stuff fits in little pockets. Been working all day, so my ears are shot now🙃",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029153056606146620",
    "author": "ALXCPH",
    "date": "2022-10-10",
    "content": "🤣🤣 I’m 6ft I think(I’m from Europe, we don’t measure things with the things we walk on😜), so pretty much the same.  But see that would scare me a little, imagine you get a new sofa. You’re pretty much f’ed right? Also I like that there’s a lot of light. I’ve actually been getting a little bit tired of working in super dark studios. Looking at screen in darkness for so many hours just kills me these days ✌️😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030904969504764014",
    "author": "Skyler Young",
    "date": "2022-10-15",
    "content": "Glad to finally join the small desk club. Before:",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1030917389308657807",
    "author": "Rollmottle",
    "date": "2022-10-15",
    "content": "think this shows how important a cloud is. your OG desk wasn't that big by comparison.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030918843087990875",
    "author": "Skyler Young",
    "date": "2022-10-15",
    "content": "Sorry the before frequency response measurement was taken with cloud. I forgot to take an actual before photo so the before photo I used was about a month old, taken just before I got the cloud.  The only change between the frequency response measurement was the desk.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030919601808232598",
    "author": "Rollmottle",
    "date": "2022-10-15",
    "content": "ah nice...pretty dramatic considering the desk doesn't look all that big!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031024610189262889",
    "author": "Zack Hames",
    "date": "2022-10-15",
    "content": "TBH a screen too high is WAY worse for me. I have mine only a little low, not like almost flat like I’ve seen some others.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031031763658608652",
    "author": "David Fuller",
    "date": "2022-10-15",
    "content": "I like having my screen angled back super hard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033044988516384918",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "Looks like your speakers shrank along with your desk!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1033050715213529218",
    "author": "Will Melones",
    "date": "2022-10-21",
    "content": "Didn’t you say “mix with your eyes”? And “I LOVE screens”? No, wasn’t you?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1036915987053826068",
    "author": "Deleted User",
    "date": "2022-11-01",
    "content": "I would definitely consider desktop synths and hook it up to midi. Takes less space and also somewhat portable as well. Roland has been putting out some cool desktop synths for pretty low price and DSI has some too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040768900620619836",
    "author": "Nomograph Mastering",
    "date": "2022-11-11",
    "content": "Rotate the layout 90, Gobo each side, cloud and two Gobos rear. Smallest desk you can and be no more than 3.5 feet into room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1060981071145074732",
    "author": "Eric Martin",
    "date": "2023-01-06",
    "content": "don’t you feel so free when mastering without the screen in front of you?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061145864430686238",
    "author": "Chris Doms",
    "date": "2023-01-06",
    "content": "Do you feel like it’s benefiting your mix work? Even if it’s as simple as you enjoy this approach more. I’ve tried this at points with having my desk off to the side and I dunno there’s trade offs to each haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061373943652569139",
    "author": "Nomograph Mastering",
    "date": "2023-01-07",
    "content": "Hard floor all the way, cannot stand rolling a chair on a rug or carpet",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061381177015025674",
    "author": "Rollmottle",
    "date": "2023-01-07",
    "content": "which after all the chair talk, i will say y'all should get rid of those terrible fucking wheels they come with. they're noisy and don't roll that well. these glide freely without all the clanking: https://www.amazon.com/s?k=rubber+wheels+for+office+chair&sprefix=rubber+wheels%2Caps%2C157&ref=nb_sb_ss_ts-doa-p_1_13",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061381558197571604",
    "author": "ALXCPH",
    "date": "2023-01-07",
    "content": "Oh yeah? That big of a diff? I never liked the wheels on my Herman Miller. But my back loves the chair. Never thought about switching em out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061705727061786644",
    "author": "hyanrarvey",
    "date": "2023-01-08",
    "content": "Also i can’t see the screen can you turn down the brightness thanks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064970164631785573",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "I love the things above….and these are great too for wrangling a bunch of longer runs together!\n\n25ft - 3/4 inch PET Expandable Braided Sleeving – Black – Alex Tech braided cable sleeve https://a.co/d/eeWpwe3\n\nYou can see in the photo…each of the “larger” black cables running from my speakers and desk actually has 6-9 cables in it corralled by those sleeves…also easy to access cables if you need to move them around",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064988745876647976",
    "author": "ALXCPH",
    "date": "2023-01-17",
    "content": "That’s an awesome setup! Where’s your DA located? Do you have a side car or is it just hidden somewhere behind the desk?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064989881295708222",
    "author": "sukhuno",
    "date": "2023-01-17",
    "content": "What’s the chair id jack? This looks like something I’m interested in",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064990483664875561",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "I have a Hilo goes AES to speakers and as my send/capture for the Massive Passive...you can't see it here but there is a rack under the screen where it sits. I have a side car off the side (the walls look pretty tight but they are actually the unf*ck mass loaded vinyl L things, so the room opens up more behind them). The sidecar is back from those...its got a apogee symphony taking the ins for my synths (also not really pictured -- just hangarounds from my production days for the fun of it sometimes), Hazelrigg VLC in there too.\n\nThere is sorta a whole room behind the listening position...its 30 feet long with a floating wall for absorption about 15 feet in so the studio is like 13x15 but acoustically its larger if that makes sense.\n\nI do use streamdeck...but mainly to switch quickly between the hot ref in Wavelab and my master. I've gotten deep into Applescript which essentially handles all of the other Wavelab processes...it's almost finished but my streamdeck will essentially just launch those applications to do what I need. So I'd say it's very useful, but the coding I've been able to do will render it sorta meaningless for me (though convienent, I use it for other things like navigating websites when doing client outreach, etc which is very handy and makes my workflow like an order of magnitude quicker).\n\nChair is hag capisco. I love it. Had a serious back injury when I was younger so I'm pretty dialed into having things be ergonomic and I find it's great. Actually kinda rather uncomfortable...in a good way. You can't really slouch. Took some getting used to but it's interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064991864916279357",
    "author": "ALXCPH",
    "date": "2023-01-17",
    "content": "Thanks for the detailed response. Appreciate it. \n\nCan’t wait to see how you get your tiny desk going. I recent went tiny desk(damn this discord) and while I actually hear a difference, getting it to look clean with all the cables and such has been a bit of a hassle! If you are staying with the same rack behind your screen screen system would you mind taking a picture from a different angle so that it’s visible? What kind of rack is it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064992965258395789",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "Let me know if that vid works! I also have some power strips mounted under the desk that won’t have a home in the new one, but they’ll just get shoved into the rack under the screen",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1067702898961690624",
    "author": "peterlabberton",
    "date": "2023-01-24",
    "content": "I have a habit of putting two finder windows, one my work drive and one Dropbox, next to each other. But I just do it manually and have been gradually inching them closer to being a perfect split down the middle of my screen. Cuz ocd or something. One of these days they’ll even out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067908265859629146",
    "author": "BatMeckley",
    "date": "2023-01-25",
    "content": "I was going off the monitors vs your chair. I’m 6’2” and k feel like they’d play right over my head.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067909147753979924",
    "author": "Eric Martin",
    "date": "2023-01-25",
    "content": "some people like to sit LOW, I’m 6’1” and feel like I need the chair to always be at the highest point it can go",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072033047916056616",
    "author": "ehutton21",
    "date": "2023-02-05",
    "content": "I’m hunting and can’t find, looking for small desk",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072275863086837911",
    "author": "Rollmottle",
    "date": "2023-02-06",
    "content": "they should brand it as a Tiny Desk and pitch it as a way for people to have their own Tiny Desk concerts",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072283847695286345",
    "author": "Eric Martin",
    "date": "2023-02-06",
    "content": "I had one of those Guitar Center desks and like 3 rack cases full of rack mount stuff, the Plan A got my into almost half the footprint",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072286332744912916",
    "author": "David Fuller",
    "date": "2023-02-06",
    "content": "I have one of those GC desks too. To say it's too big for my space is the understatement of the century",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1075624301971111986",
    "author": "CK",
    "date": "2023-02-15",
    "content": "I love this trend of really small desks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077068418349531286",
    "author": "ehutton21",
    "date": "2023-02-19",
    "content": "Dumb, dumb question here but is there any reason you would angle the cloud closest to the desk & monitors as you have",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077312059454263396",
    "author": "Calvin Lauber",
    "date": "2023-02-20",
    "content": "Looking to shrink my desk down from one of those big Output desks to something quite a bit smaller and simpler. Ideally wood grain/square shape but I’m open to other asthetics if it has a smaller footprint. Any recommendations? What are you guys using?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077330072802951208",
    "author": "jerikcenteno",
    "date": "2023-02-20",
    "content": "https://www.amazon.com/gp/product/B088FXXS2Z/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1\n\ngot this! Took a little to get used to the compactness by the legs and the bottom of it kinda gets up close to my feet (my feet go under the bottom part), but the build is great and the middle column that stands up and down is akin to the Sound Anchors one. I needed to find one that goes low too because I'm only 5'6\" and I needed to get the desk low enough so my arms at a 90 degree angle and this one seemed to do it the closest (not 100%, but the best I could find). NGL, the wood top is kinda dorky and feels very \"school\" like, but it's on my to-do list to get a cooler wooden top.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077364700385390592",
    "author": "David Fuller",
    "date": "2023-02-20",
    "content": "If you need your outboard in front of you: Zaor, Jamracks, Sterling Modular all have stuff. It ain't cheap. \n\nIf you don't: literally any small computer table will work.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079114632691724369",
    "author": "ehutton21",
    "date": "2023-02-25",
    "content": "*Hears the episode about tiny desks once*",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079114873277005924",
    "author": "ehutton21",
    "date": "2023-02-25",
    "content": "“Yeah dude  I’m going fully minimal… that desk is such a bottleneck in my monitoring. Monitor stands too, man”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082779997229551726",
    "author": "ehutton21",
    "date": "2023-03-07",
    "content": "This pseudo rear-wall would be about ~12-15 off the desk/listening position.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1083066062108622848",
    "author": "popaganda.",
    "date": "2023-03-08",
    "content": "You gotta share more about your room to get an answer. What treatment do you have, where are your speakers/desk, how phat is your cloud?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084210650768736387",
    "author": "Slow Hand",
    "date": "2023-03-11",
    "content": "This part kills me. Saw off that obstruction so your feet can stretch out and you've still got a useable desk. My knees ache just looking at it.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1085978934941851658",
    "author": "ALXCPH",
    "date": "2023-03-16",
    "content": "If you want to produce, make Music all the time, and focus your gear purchase on gear that helps you make that Music, could be samples, a computer thats more stable, a mic, an interface. \n\nIf you wanna mix, mix all the Time, but until you get into a semi decent room, get some decent headphones a learn what frequencies Sound like and how they affect eachother. No amount of ATC speakers or Small desks Will make you mix better in a Bad room.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086022421775134791",
    "author": "ALXCPH",
    "date": "2023-03-16",
    "content": "There’s a studio I work in quite often for writing / production sessions, that has a set of Adam 77x’s and focal shape twins and a huge desk. And while I don’t particularly like those speakers, I still do great work(source: trust me bro 🤣) that I am proud of. And when time is due I go into a good room and use the better tools for their specific jobs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088982184733458442",
    "author": "ehutton21",
    "date": "2023-03-24",
    "content": "4 sides of burgundy seemed intense/bold and we have a nice little grey couch and grey/white carpet so, brown panels made sense, but the chocolate already have a reddish hue, and I think my brain must have gone “oh yeah that’s like red wine” and clicked burgundy without paying much mind to the screen.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101625094524117074",
    "author": "Eric Martin",
    "date": "2023-04-28",
    "content": "I thought this before getting the same desk, but the benefits are there with 52U spaces",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104178295387471963",
    "author": "Bryan DiMaio",
    "date": "2023-05-05",
    "content": "I gotta figure out what's going on around 100Hz, and I think the low mid bump is my desk?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1104252483032862771",
    "author": "Nomograph Mastering",
    "date": "2023-05-05",
    "content": "Big screens can be surprisingly not a problem, if you can have them either flat against the wall, or flush with the face of the speakers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105426427576340502",
    "author": "Sean Rogan",
    "date": "2023-05-09",
    "content": "hello studio people ! was wondering if anyone had any thoughts / guidance. have been shifting around my bedroom studio, but my room is an annoying shape with a window in an alcove out of the wall. my desk is currently there as its the only one i can fit the desk that also has a flat wall behind it that i can put treatment on. worth pointing out in general this is more of a prod / writing space than a mixing space. anyone have any thoughts on treatment ? got lots of homemade 4 inch baffles, though my main concern is am i fighting a losing battle with the speakers against an angled window ?",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1105426507096133732",
    "author": "Sean Rogan",
    "date": "2023-05-09",
    "content": "last photo is the opposite wall to the desk !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106684383357837412",
    "author": "Nomograph Mastering",
    "date": "2023-05-12",
    "content": "Speakers on the short wall unless you physically don’t have room for desk and chair",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109202441678889012",
    "author": "youngteam",
    "date": "2023-05-19",
    "content": "hi folks - as I eagerly wait for my kh310s to get here next week I'm thinking about what changes I could make in my studio for low cost.\n\ntl;dr: what smalls desks are people using? I'm thinking one for computer screen and one for keyboard, mouse, streamdeck etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109204306709721161",
    "author": "youngteam",
    "date": "2023-05-19",
    "content": "I've noticed a lot of mixers in LA have tiny little rolling desks to minimize reflections. I am doing more production than mixing but I want to take some of the mindset with me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109211241169297458",
    "author": "Gerhard Westphalen",
    "date": "2023-05-19",
    "content": "My last tiny desk needed a sandbag on the base to keep it from tipping",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109211332332503041",
    "author": "peterlabberton",
    "date": "2023-05-19",
    "content": "@youngteam I have a cheapo Amazon keyboard rolling desk thing, brand is Mind Reader. Nothing glamorous but it works great.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109275014856986794",
    "author": "youngteam",
    "date": "2023-05-19",
    "content": "https://www.amazon.com/Mind-Reader-Adjustable-Rolling-Standing/dp/B08DVDV1V2/ref=sr_1_2?crid=2NZGSE5CYRT25&keywords=mind+reader+desk&qid=1684542100&sprefix=mind+reader+desk%2Caps%2C154&sr=8-2 this lil guy?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109294179911209083",
    "author": "youngteam",
    "date": "2023-05-19",
    "content": "this one's interesting too. I'm coming from a 6ft wide desk so ultimately it will be a wild transition no matter what haha. think I'll get the speakers in then go from there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110426266970112020",
    "author": "Nomograph Mastering",
    "date": "2023-05-22",
    "content": "And a typical human in a chair has their head around 4ft from the ground, exactly halfway between floor and ceiling and exactly at the null for 70Hz - a big dip in the response",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1111646192519106630",
    "author": "youngteam",
    "date": "2023-05-26",
    "content": "Thanks man! Tiny desk is definitely on my to do list. This thing is 6ft and not helping anyone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1111703695747461290",
    "author": "CK",
    "date": "2023-05-26",
    "content": "my dream tiny desk....not so tiny.....but way better than the producer desks sold everywhere these days.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112172187584037006",
    "author": "Gerhard Westphalen",
    "date": "2023-05-27",
    "content": "I don’t miss the old days of DAW rig, PT rig, touch screen rig, and 3 slaves 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112173838332076152",
    "author": "LAPhill",
    "date": "2023-05-27",
    "content": "One is older, but I actually just replaced three machines. Unfortunately, for my workflow and the massiveness of my template, it’s still a necessity. \n\nEach VEP machine has 128GB of RAM, plus the sequencer also with 128GB. Then a Mac mini running picture on Pro Tools, and an iPad with Lemur (thankfully no touchscreen PC at least.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1127604602825621625",
    "author": "Josh",
    "date": "2023-07-09",
    "content": "I get a 500 series rack of pres and EQs, other side of the desk is a 2A, MC77, Distressor, Audioscape G Comp, and a Fatso.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128078232151928853",
    "author": "Rollmottle",
    "date": "2023-07-10",
    "content": "gonna have to wait until they perfect the plasma screen/absorber combo and have my screen floating in thin air between the speakers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129450662971854869",
    "author": "GaspardMurph",
    "date": "2023-07-14",
    "content": "I fantasize about extreme downsizing also. Love the idea of the northward desk - the price point is a bit high for me and I don’t think I can have my prophet in front. I can’t really work like I do without a midi keyboard in front of me :(((",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129452911559188571",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "For those interested in the tiny desk/midi thing (and want to do it premium) — had a 37 key fatar keyboard midi controller built into my desk, purely for hobby reasons, I never use it mastering but I like to touch keys every so often to stay connected with the creative side of the process. Slides in on accuride slides and is beastly sturdy, does not move at all when played.\n\nAnd since it can be attached to the slides from the side of the keyboard, you can get it right up to the bottom of the desk, you’d never know it was there (and since all day every day is mastering for me that’s very important in my case!)",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1129453300257935360",
    "author": "Adam Thein",
    "date": "2023-07-14",
    "content": "damn that's cool!  How big is that screen and how far is it from you the way you are positioned?  I will likely have a window right in front of me in my new space and was looking at doing a similar setup with a small stand for a TV/monitor",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129454729743835258",
    "author": "Deleted User",
    "date": "2023-07-14",
    "content": "I couldn’t fit mine under my desk unfortunately",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129454992160469094",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "I could never find the solution I needed, everything took up too much room which would raise the desk for my mastering, which is really all that matters, so just designed it and had it built.\n\nIt’s overkill but I just wanted to do it once right and be done",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129455918329893006",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "Yep this is the best in your case!! Do you find it's more important to have the keyboard there vs a drawer? I'm assuming since you're composing the computer keyboard/mouse ergonomics aren't ** the #1 concern?\n\nAlso do you have the doepfer one with weighted keys built in?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129456667491319919",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "In my case this was able to be solved (keyboard is synth keys so lighter), and the specific keyboard is literally only like 1.5 inches under the desk so legs easily clear. There is no drawer under the keyboard. Accuride slides...literally no bounce. But I very much doubt that would be possible with the type of setup you require",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129457720722997411",
    "author": "Deleted User",
    "date": "2023-07-14",
    "content": "I have 49 keys on the desk, and 88 keys hammer action on the side for more piano playing.\n\n“where to place the keyboard in a studio” is a huge rabbit hole. I still don’t quite feel comfortable with this setup. I used to have both on the side, but I hated having my arm out to the sides",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129458685253517524",
    "author": "LAPhill",
    "date": "2023-07-14",
    "content": "Exactly the same idea. I'm just not sure how I'd do it without scratching up the desk. And would probably want it to be made out of wood so it looks a little nicer.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1131438945427787888",
    "author": "austenballard",
    "date": "2023-07-19",
    "content": "very late to the keyboard on desk thing but I wrapped two bricks in duct tape, velcro’d them to the bottom of my controller and it was just enough space to be able to slide the typing keyboard underneath",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132844518585159700",
    "author": "Rollmottle",
    "date": "2023-07-23",
    "content": "Ehhh. Definitely a new ergonomic problem. Sonically not too different than before.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132847568796258345",
    "author": "Rollmottle",
    "date": "2023-07-23",
    "content": "Had the screen here. Just had a record with an RX heavy lift that made this setup less than ideal. Testing this out for a spell. Probably need a bigger screen now.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1136026305159237823",
    "author": "esquinalee",
    "date": "2023-08-01",
    "content": "Just seeing this is Shawn Everett’s setup… NS10s directly on the desk, tweeters directly into the earholes. I guess at some point some folks just got it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154521930758627348",
    "author": "cian riordan",
    "date": "2023-09-21",
    "content": "this is why i like the screen in front, but at a low angle so i can just look up and its as if its not there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154523534601748721",
    "author": "Rollmottle",
    "date": "2023-09-21",
    "content": "i feel like there's a pyschological benefit to this that is probably worth not underestimating. having the screen dead center in between the speakers where it's natural for your eyes to land when you're in your natural listening position felt like a barrier to me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1163259923795280034",
    "author": "river",
    "date": "2023-10-15",
    "content": "it bet it sounds awesome in that chair lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167897509931270184",
    "author": "austenballard",
    "date": "2023-10-28",
    "content": "tbh this is what my desk looked like in college except with rokits",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167907122995003412",
    "author": "peterlabberton",
    "date": "2023-10-28",
    "content": "Sadly I have no pictures of my earliest setup. It was a crappy free Craigslist desk in a totally unfinished garage in Berkeley. Ran the length of the house, one car wide. I had tiny little m-audio speakers propped up on old textbooks, and I was so psyched when I got like four little 1’x1’ squares of auralex foam. Put one square each on the the wall to the left and right of me. Room = treated!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171344714352558111",
    "author": "Garth Tim",
    "date": "2023-11-06",
    "content": "hard to tell the exact color thru a screen, but the glass might be a bit blue? unless you have something to help bring more blue accents into the room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171496585725747261",
    "author": "Joshua Riley",
    "date": "2023-11-07",
    "content": "But yeah very hard to judge with different screens and lighting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171634619465084928",
    "author": "Bryan DiMaio",
    "date": "2023-11-07",
    "content": "If you turn in your chair do you hit your knees on the stands?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171663182520143973",
    "author": "masteredbyjack",
    "date": "2023-11-07",
    "content": "The aesthetic of your spot is awesome, new desk looks sweet!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171872678056050768",
    "author": "joshbonanno",
    "date": "2023-11-08",
    "content": "ha! the bigger issue currently is my desk. its a bit shocking measuring with and without the desk currently...so need to figure that out still too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171872997964001340",
    "author": "joshbonanno",
    "date": "2023-11-08",
    "content": "currently its on a floor standing mount thing. cheap and effective...goal will be to eventually flush mount it on the wall with a bigger screen....its a bit low and hard to read in its current state.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172289903833391244",
    "author": "NoahNeedleman",
    "date": "2023-11-09",
    "content": "ReStore is where I got my tiny desk from",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178006321619009536",
    "author": "river",
    "date": "2023-11-25",
    "content": "emu sampler, sony fx processor, focusrite mixing thing, mackie mixer, midiman midi interface, ns-10m hiding underneith the desk (on top of EMAGIC LOGIC box), mac g3 silver door, samson amp",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178809437729857636",
    "author": "Slow Hand",
    "date": "2023-11-27",
    "content": "How are your knees? I ask because I notice the shelf you have beneath your desk. \n\nI used to keep a sub beneath my desk until I realized I was giving myself knee pain because it prevented me from stretching my legs out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1184648240457584680",
    "author": "cian riordan",
    "date": "2023-12-13",
    "content": "I think you have to bend the screen to your will.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1195957790909399081",
    "author": "popaganda.",
    "date": "2024-01-13",
    "content": "If I’m being honest I don’t love working on synth parts on the side either. It’s honestly an annoying trade-off. I’ve spent the last few days at some studios with big spaceship desks and two screens and keyboards on the desk. It’s so luxurious in a way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1198612124574945320",
    "author": "rse",
    "date": "2024-01-21",
    "content": "alright I'm just gonna ask this here; I watch a lot of youtube videos and movies in bed and want to upgrade that experience a bit. I have a pair of old monitors laying around (tannoy reveal 5a) and want to get some sort of not very permenant way to add these to my bedframe I guess? I was looking into those monitor stands that have those clip-on/screw-on things to attach them to a desk, but those clips are all made for desks and tables, so horizontal planks. For my bedframe they would need to be angled down, since the planks are vertical. Is there any product out there or anything I could piece together to make this work?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1210707441897967646",
    "author": "James Redfern",
    "date": "2024-02-23",
    "content": "Any fellow particularly tall members found any smart ways to lift a small desk, or am I overthinking it and blocks under the legs is the best way to go?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210714870513664062",
    "author": "James Redfern",
    "date": "2024-02-23",
    "content": "Right on, I think the sit/stand element makes a ton of sense. Whenever I’m working in other peoples rooms, it’s so uncomfortable because of my size and at my spot I’m kinda tired of having the controller on the desk. I’ll definitely check out the options mentioned so far!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214022395606732841",
    "author": "Calvin Lauber",
    "date": "2024-03-03",
    "content": "Absolutely great looking space! Nice work. annoying question but can I ask where you found your desk? Seems like the perfect size, functional but out of the flight path",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1215106169304252496",
    "author": "Garth Tim",
    "date": "2024-03-06",
    "content": "boutta install a roll cage on my chair ngl",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220427428082745475",
    "author": "cian riordan",
    "date": "2024-03-21",
    "content": "Good reminder. And yes, all the time. Tiny desk life not for the faint of heart.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221885282576502864",
    "author": "Iwan Morgan",
    "date": "2024-03-25",
    "content": "What’s the chair @cian riordan ? Back in the studio after holiday and neck pain within the first couple of hours. Thinking of ditching the Aeron",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221886490842501121",
    "author": "cian riordan",
    "date": "2024-03-25",
    "content": "A very inexpensive kneeling chair from Amazon. I’ll try and figure up the link",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223064717489340528",
    "author": "Slow Hand",
    "date": "2024-03-28",
    "content": "Yeah, but look at the leg room under that desk. Still slumming it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1227085130502242324",
    "author": "Edward Rivera",
    "date": "2024-04-08",
    "content": "This might get a few scoffs, but would anyone have a recommendation for a decent, but budget friendly ergonomic chair I can grab on Amazon ?\n\nYes yes I will get my Aeron once I’m settled across the pond but I’m in a temporary space and not gonna splurge here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1227088099750969454",
    "author": "Rollmottle",
    "date": "2024-04-08",
    "content": "gotta say, that kneeling chair in Cian's room is actually pretty dope and he mentioned it was an Amazon buy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1228166201268633632",
    "author": "omarakrouche",
    "date": "2024-04-11",
    "content": "Hey, what keyboard tray are you using here?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232028369604968520",
    "author": "Tristan",
    "date": "2024-04-22",
    "content": "Hey @cian riordan - cool spot! Can I ask you about your desk? Was that a custom job? Would be curious to know about the dimensions if you’re willing to share. Looks sturdy, too. Thinking of doing something similar in my place",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232425987132625028",
    "author": "Tristan",
    "date": "2024-04-23",
    "content": "Thanks for the intel! Curious to hear more about the transparent desk. Soon enough we’ll remove our bodies from the room for pure sonic heaven",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237507225262493776",
    "author": "Ross Fortune",
    "date": "2024-05-07",
    "content": "Love the Prophet under the desk. Thinking maybe flip my Prophet 08 desktop module and the M-Audio keyboard that’s under the desk now, replace them with a Prophet 6 or a Take 5…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1237530634830872656",
    "author": "Josh",
    "date": "2024-05-07",
    "content": "Kinda wondering if I should go big desk so I can do the same in the future",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246162359161196565",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "How it plays will often depends on screen size and location, and how controlled the room is down in the lower mids",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247399666656481372",
    "author": "Zack Hames",
    "date": "2024-06-03",
    "content": "Has anyone gone down the rabbit hole of ways to manipulate your space to be more productive/focused? Things like lighting, wall colors, types of furniture or layout, temperature, acoustics based things, computer screen brightness, etc etc. \n\nThings that promote focus, creativity, allows for less stress/better focus. Could be literally anything",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247591662058864785",
    "author": "Zach Hughes",
    "date": "2024-06-04",
    "content": "I've been going down this rabbit hole recently. I purchased and have started using a phone lock box. Kinda hardcore. Not gonna be necessary for everyone. There's also a program called freedom (probably similar to focus app mentioned) I just got and will be experimenting with. Have a program called flux that changes the color hue of my screen as the day progresses to make it easier on the eyes. I think blue light earlier in the day and yellow ish light later in the day? Some science I don't really understand behind that. There's a huberman lab out there somewhere about it. I backlit my screen display with blue leds as well. Honestly one of the best things when I actually stick to it is trying to never sit for longer than an hour. Even just a 5 minute stand up walk around helps me immensely. Related I drink a ton of water and forces me to get up to go to the bathroom more often.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264418140549550101",
    "author": "NoahNeedleman",
    "date": "2024-07-20",
    "content": "Think it was just the desk? Cause the rest of the room looked cleaned out too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264422194684100691",
    "author": "Eric Martin",
    "date": "2024-07-20",
    "content": "listening before and after it was a lot desk, I listened before putting the screen on the sub and it was only the desk full vs empty and gone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264712830993694804",
    "author": "Gerhard Westphalen",
    "date": "2024-07-21",
    "content": "I used to have this desk too. Works well but it's very light weight so it can tip easily. I had to put a sandbag on the base",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266438707314167822",
    "author": "hyanrarvey",
    "date": "2024-07-26",
    "content": "That’s a dope little desk are you using it? Or just a sick laptop stand",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266555832745590915",
    "author": "Bryan DiMaio",
    "date": "2024-07-26",
    "content": "Get that pesky desk out of the way, I have an address you can send it to",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287551302762758248",
    "author": "Will Pragnell",
    "date": "2024-09-22",
    "content": "nice, i think i'm gonna go for one. have had a wider desk on order for a while but still time to cancel... this way i won't have as much empty rack space tempting me to buy outboard i don't need 😄",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287551703889215510",
    "author": "Will Pragnell",
    "date": "2024-09-22",
    "content": "plus the wider desk was flirting with adding a reflection point in the flight path, i think (hard to be sure since I don't quite have my speaker / listening triangle figured out yet)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287773140373475378",
    "author": "hyanrarvey",
    "date": "2024-09-23",
    "content": "Blue sky’s like the small desktop speaker Serban used?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1288868462202064898",
    "author": "thegreatcarsoni",
    "date": "2024-09-26",
    "content": "I had the same desk and virtually the same tapestry! Still think it looks rad.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1288869707130081280",
    "author": "Bryan DiMaio",
    "date": "2024-09-26",
    "content": "also a lamp clipped onto my desk to bias light the monitor",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293559627031642254",
    "author": "Chase H",
    "date": "2024-10-09",
    "content": "For people on the hunt for a tiny desk, idk about the build quality but I stumbled across this.\nNot stained or painted but a lot cheaper than other options.\n\nSeller told me he could make the profile at the back of the desk shorter (max height of around 33 inches).\n\nCould be a good option for someone\n\n\nhttps://www.etsy.com/listing/1682134419/trinity-desk-designs-1-bay-sidecar?ref=yr_purchases",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293984093972860978",
    "author": "Eric Martin",
    "date": "2024-10-10",
    "content": "this is what I thought before getting the sterling desk, turns out it’s fine for most of the days work, can’t stretch out but ¯\\_(ツ)_/¯ packing 52 U in a small space is great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1307856794210795520",
    "author": "jordanmcleod_io",
    "date": "2024-11-17",
    "content": "What are you using to hold the Anubis? Is it attached to the desk? Been looking for something like that for the MT48",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1309609999571484693",
    "author": "SoundsLikeJoe",
    "date": "2024-11-22",
    "content": "(Lol...  edit cause i needed to clear my screens for the NDA)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1337497872765026445",
    "author": "Brian Reynolds",
    "date": "2025-02-07",
    "content": "I'm 6' 4\" need a bit more lift. To second screen reasonably without ruining my neck and shoulder by hunching down",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340070029139644447",
    "author": "Josh Bowman",
    "date": "2025-02-14",
    "content": "Room looks sweeet!! What are you doing for computer/interface housing? I'm currently transitioning to the monitor on the wall tiny desk setup and trying to decide on cabinet/rack etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340077053071851642",
    "author": "jordanmcleod_io",
    "date": "2025-02-14",
    "content": "It was not intentional! I thought I was going to keep my laptop off to the side on a shelf and just get an iPad as a second screen but this worked out nicely and probably going to stick around a while. And using the USB driver for MT48",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340077732436119716",
    "author": "jordanmcleod_io",
    "date": "2025-02-14",
    "content": "Yeah try it out! I got my desk off Etsy too for like $250, and you can customize the size to what you want.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340080699939749900",
    "author": "onanisland",
    "date": "2025-02-14",
    "content": "That is smart indeed! You can also have a second screen attached with leg back of the desk, tilted to ur preference (works with minimal desks too) and keep your macbook on a floor rack or something",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341211648869797999",
    "author": "Matt Huber",
    "date": "2025-02-17",
    "content": "Freaking 200lbs before tear out on a single point with a particular anchor blew my mind. \n\nI’m about to hang my chair from the ceiling",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376636794052935800",
    "author": "masteredbyjack",
    "date": "2025-05-26",
    "content": "Who is Daniel Salt? Does he know I already sold it haaaaaa (the desk)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376941885645652110",
    "author": "Matt Huber",
    "date": "2025-05-27",
    "content": "It’s the desk reflection all over again…except only on one side.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382906255601045595",
    "author": "cian riordan",
    "date": "2025-06-12",
    "content": "NS10s might do you more service behind and above your screen, horizontally",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383183701306773564",
    "author": "jonmatteson",
    "date": "2025-06-13",
    "content": "Did you build this desk? Room looks great!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1383897279605248062",
    "author": "Bryan DiMaio",
    "date": "2025-06-15",
    "content": "Love the uplift desk! Have one myself and it’s super solid",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387092466003349586",
    "author": "Josh Bowman",
    "date": "2025-06-24",
    "content": "Looks great!! I gotta get on this, i undershot my first tiny desk build and went too tiny. This looks perfect.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387093761955336214",
    "author": "thegreatcarsoni",
    "date": "2025-06-24",
    "content": "It’s 24”x36”! Feels appropriate without being awkwardly small. Still need some desk space to place small items",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387103764980306041",
    "author": "Gerhard Westphalen",
    "date": "2025-06-24",
    "content": "The only real exception to this is if your speakers are on the desk and then you remove the desk since that makes a huge difference as you were effectively splitting the room in 2 where the speakers were but I don't remember the last time I did a calibration like that since I'd suggest getting rid of a desk setup like that before considering DSP",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1408248812249813002",
    "author": "NoahNeedleman",
    "date": "2025-08-21",
    "content": "I’ve heard of no screens but no speakers?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428846571944022177",
    "author": "Zack Hames",
    "date": "2025-10-17",
    "content": "Idk what it is, but even just running all my channels through the faders and EQ on the desk makes it sound more like a record to me. Not even specifically sonically better but it just feels better. And it’s probably just some ic chips or whatever.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429164763765801162",
    "author": "hyanrarvey",
    "date": "2025-10-18",
    "content": "It’s so nice. You mix the record on the desk that way, commit all your inserts and then turn off the desk and mix itb or continue back on the ssl",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430658472789413918",
    "author": "chris_donlin",
    "date": "2025-10-22",
    "content": "Any cyclists use a bike trainer at their desk during the colder months? I've had a vision of doing this for a while but not sure if it's as easy as it seems in my head",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1430664960962465823",
    "author": "cian riordan",
    "date": "2025-10-22",
    "content": "If you have a standing desk, my wife has one of these cheap little foldable treadmill things that works great to get your steps in. I’m sure there’s some feature specific stationary bikes for this purpose",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457504048155590727",
    "author": "cian riordan",
    "date": "2026-01-04",
    "content": "Notably missing is the literal mountain of cabling you're going to have piled behind that fucking desk.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457507921930883196",
    "author": "Zack Hames",
    "date": "2026-01-04",
    "content": "I’m not sure what I’m gonna do long term. I like them on the meter bridge, at least in the old studio, because they’re closer to my ears that way. In the old studio I experimented having them on stands behind the desk but it put the speakers weirdly far and that room didn’t carry the sound well. \n\nI may do cinder block stands behind the console if I like how they sound in that position then I can put my ns10’s on the meter bridge stands",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457509757639459027",
    "author": "cian riordan",
    "date": "2026-01-04",
    "content": "When you're done hemhoragging money on your install, I'd suggest sound anchors to hold the speakers. They will give you more flexibility over cinder blocks, allow you to lever the speakers over the console if you like, and will decouple them from the desk so you're not feeling the low end through your fingers/hands.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1458102638443761775",
    "author": "hyanrarvey",
    "date": "2026-01-06",
    "content": "Get it going, get to work, call desk doctors around March or so and have em look at it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460692746661531772",
    "author": "Zack Hames",
    "date": "2026-01-13",
    "content": "I want to do a video screen system at my new studio; just a simple 1 camera in the control room and 1 camera in the live room for now. Does anyone have any advice on this? I’d like it to be low latency if possible. \n\nThinking barefoot recording style - @Tim O’Sullivan @cian riordan",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463099796398149644",
    "author": "shoolace",
    "date": "2026-01-20",
    "content": "I’m not a big fan of the “producer studio desks” I personally think they give off weird spaceship vibes.\n\nBeen wanting a larger desk to work from… found this dinning table on Facebook marketplace for $75. Reaching out to a woodworking friend for some rack mounts matching the wood stain 😎\n\nAnyone else just set up on dining room tables? Or am I crazy",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1463238340202467412",
    "author": "NoahNeedleman",
    "date": "2026-01-20",
    "content": "Honestly this table is sick, but like Cian said we’re big about reducing desk size around here.\n\nIf you were curious- try putting pillows on the desk in between you and the speakers and see what happens to the sound when you take them away again. ||the difference is not subtle||",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1463299500767576210",
    "author": "aliberger",
    "date": "2026-01-20",
    "content": "for a long time my desk hack for my production setup was a door slab supported by 3 of the small home depot wire metal shelves. total cost probably around $150, luxuriously huge and felt extremely stable even with literal stacks of gear on it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1468218530393489421",
    "author": "Iwan Morgan",
    "date": "2026-02-03",
    "content": "I'm sure it sounds great, but can we talk about the amazing orange chair?   I love that choice, I need to add a colorful chair once my Aeron dies.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1470975019558375434",
    "author": "Bryan DiMaio",
    "date": "2026-02-10",
    "content": "Home depot, find some wood you like and have them cut it to size for ya, then go to town sanding it down. Uplift desk makes good legs, or you can go IKEA",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]