[
  {
    "id": "1306284386538356797",
    "author": "popaganda.",
    "date": "2024-11-13",
    "content": "I don’t feel like any of these pictures fully capture the vibe yet, but here’s my new room",
    "reactions": 32,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1016692659756212286",
    "author": "P.K. Stephan",
    "date": "2022-09-06",
    "content": "Hey guys! I am new to the community and happy to have finally taken the jump into the discord after being an avid listener since the beginning.\n\nJust finished building my studio about half a year ago. I run a hybrid setup where everything is always connected and ready to go. All recording paths are accessed via an XLR patch-bay. Mixbus/Mastering gear is controlled by a Dangerous Liaison. Conversion is done via MADI and AES/EBU. Headphone CUE’s are analog and via AVB. I like having everything connected and mic’ed up because I notice that I only use the stuff that I can access quickly while producing/mixing. I went through a lot of trial and error building and working in this studio (been in this location for 1.5 years) so if anyone needs any input I would be happy to help!",
    "reactions": 30,
    "attachments": 5,
    "is_pinned": false
  },
  {
    "id": "1449506925858394182",
    "author": "Jasper Boogaard",
    "date": "2025-12-13",
    "content": "Just installed the clouds of my @Gerhard Westphalen design 🙂 gonna spend the evening listening and recalibrating my ears but the low end feels so much tighter without having even started with the back wall",
    "reactions": 30,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1227078434031665293",
    "author": "Rollmottle",
    "date": "2024-04-08",
    "content": "@cian riordan Not totally happy with the DOF on some of these so gonna have to come back for a more dialed set of snaps, but here's a few that turned out ok!",
    "reactions": 24,
    "attachments": 5,
    "is_pinned": false
  },
  {
    "id": "1370427978596614245",
    "author": "Spencer Broschard",
    "date": "2025-05-09",
    "content": "Words cannot describe how insane it sounds in here now 👌👌👌. Thanks everyone in here for generously sharing your knowledge and experience!",
    "reactions": 23,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1356802873584910336",
    "author": "7footer.",
    "date": "2025-04-01",
    "content": "a few weeks finally settled into my new room. 10x11 spare bedroom in my apt. Huge thanks to the SDP.LA guys @spiderplus1 @Slow Hand for the design and tuning all the way from Cali to Michigan. best room I have had in my short career BY FAR. Happy is an understatement.",
    "reactions": 22,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1172898983195193404",
    "author": "denimes",
    "date": "2023-11-11",
    "content": "Here’s some construction pics and measurements of my home studio I recently finished. Still need to do some final EQ correction to get rid of the bump at ~200Hz and flatten the midrange area. Overall I couldn’t be more thrilled with how it turned out. I designed the room with multilayer absorption all around. 1ft thick side walls, 2.5ft thick rear, and 6in ceiling (wish I had more ceiling height!) Monitors are our custom 3 way mains with hypex amps.",
    "reactions": 20,
    "attachments": 7,
    "is_pinned": false
  },
  {
    "id": "1176191104845095144",
    "author": "Joshua Riley",
    "date": "2023-11-20",
    "content": "Here it is!! Appreciate all the knowledge that is shared here ❤️rotating the rear panels on their sides and stacking them once the couch is in so there’s more space to walk into the room. Haven’t done any measurements. Gonna spend some time listening more. Sounds super tight, wide strong image and center so far",
    "reactions": 20,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1383688771161161748",
    "author": "herbie",
    "date": "2025-06-14",
    "content": "it was an arduous journey hanging these curtains up but they did the job perfectly! PRO TIP: do NOT use the given anchors they give you, they’re horrible. i used qualihome drywall anchors from home depot i found lying around from a previous mirror hanging job. \n\nthanks so much to @jordanmcleod_io for helping me out and @thegreatcarsoni & @Zakhiggins for the suggestions!! it’s honestly insane how open it makes the room feel. next up is a lamp shade to cover the right floor lamp so it won’t blind me anymore :kek:",
    "reactions": 20,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1094047634328662076",
    "author": "cian riordan",
    "date": "2023-04-07",
    "content": "Also let’s be fair here, @Gerhard Westphalen isn’t just “some guy”. He’s a very knowledgeable, thoughtful guy that’s been a great asset to us here on the discord… even if you disagree with his takes. He’s not schilling anything other a deep understanding of electronics and acoustics.",
    "reactions": 19,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1259147689388412960",
    "author": "Bryan DiMaio",
    "date": "2024-07-06",
    "content": "Gonna make a preset for the Gain plugin in PT called “goated mojo box tone” and it just boosts the level 0.2dB",
    "reactions": 19,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387911946736766987",
    "author": "Ross Fortune",
    "date": "2025-06-26",
    "content": "@Will Melones thanks for the LED lighting rec, I put a pair of 5500k 5ft badboys up on top of the clouds and they’ve been consistently fooling people into thinking there’s a skylight up there. \n\nIt’s enough to fool my brain too, it’s made working in my weird mole cave infinitely better",
    "reactions": 19,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1086216927736762368",
    "author": "ehutton21",
    "date": "2023-03-17",
    "content": "I don’t think any of the polishing and gear was directly responsible for that, but it offered a level of quality and fidelity that made working feel effortless. There was no wasted time. And the idea of emotional transparency was very much abound: voice memos got played, reference tracks and favorite new ear worm songs got exchanged and the vibe was locked in without much fuss.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1420465267992953013",
    "author": "Edsel Holden",
    "date": "2025-09-24",
    "content": "Ill get some pics here sooner or later but just wanted to publicly acknowledge @Gerhard Westphalen acoustic powress. First real day in the new room and all I can say is wowza - thanks Gerhard.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116111268986748969",
    "author": "popaganda.",
    "date": "2023-06-07",
    "content": "Tracking w @jantrit today…big vibes in here!",
    "reactions": 17,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1086124228253864047",
    "author": "NoahNeedleman",
    "date": "2023-03-16",
    "content": "I tried to be the cool kid for so long, acting like I belonged when I felt like I didn’t, feigning nonchalance. Ultimately (likely too late in life,) I realized the people I was drawn to were the people who were unselfconsciously joyful. People who took real pleasure in the moment- not manic excitement, just unbridled joy. *That* shit is contagious. \n\nHaving played with some of the best in the world, I’ll take joy over virtuosity any day of the week. Luckily you don’t always have to choose- if you need some recs I’ll gladly send you some numbers.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171870859741380609",
    "author": "joshbonanno",
    "date": "2023-11-08",
    "content": "still need to hang a few panels in the back of the room, work on some aesthetic stuff for the back wall etc...but been working in here and its a dream. major shouts to @Gerhard Westphalen for helping devise a plan and all the non-discord homies who helped with the renovation and build of all these monster panels. i will do a more in depth look at things with all the nerdy graphs eventually, but just took a fresh pic and was feeling grateful for how far it has come so far.",
    "reactions": 15,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1221969041023959211",
    "author": "peterlabberton",
    "date": "2024-03-25",
    "content": "Tracked drums at the new/temporary spot for the first time over the weekend. Kinda hilarious setup—no kick (adding live drums to dense programmed tracks, so just went with the sampled kicks to avoid shoes in the dryer world), and short a pair of good mics for overheads so did mid side. Actually came out pretty great, and absolutely blew up the snare mic in parallel through my Moog on a track for super distorted huge-ness. 🤘🏻",
    "reactions": 15,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1222958187096051723",
    "author": "Tim O’Sullivan",
    "date": "2024-03-28",
    "content": "Does this count as a setup? Got the studio kitchen dialed.",
    "reactions": 14,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1164793696332562492",
    "author": "peterlabberton",
    "date": "2023-10-19",
    "content": "Temporary studio going up. Vibes are meh but we’re going for the long-term gainz here!",
    "reactions": 13,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1221514146248392915",
    "author": "chrissorem",
    "date": "2024-03-24",
    "content": "@JakeTB  @jonmatteson @David Fuller  alright so I have to say I really like the PMC’6s and if I could I would trade my two-two 6’s. They feel more full range overall.  That being said I’m keeping my two two 6’s and the Neumann 420’s are filling the role that I’m looking for, which is a full range cabinet.  The 420’s frequency spectrum feels very top to bottom and very open.  The low end detail is very zoomed in. I definitely can hear more detail. The mid range also feels very detailed and the top end is nice and open but they are as bright as the PMC’s but I don’t feel like I’m missing any information.  After listening to various songs on the 420’s I thought damn these sound nice, and at the same time I thought but is that good? Like how will they respond actually working on them. Will they help my mixes or will they just sound good? So far they have been revealing and translating quite well. I was concerned about the 300-500hz. Feeling a little tucked in when listening to  finished mixes but as I put them to work I felt like they did show that info as well.  I really dig them and will likely buy them. But I think they might be a bit big for a single set of speakers and will still want to work on some  near fields. They definitely show me different things.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "951177140009840721",
    "author": "absflores",
    "date": "2022-03-09",
    "content": "Spent a few days at Capitol this week! Bucket list dream for me, love the vibe of this place.",
    "reactions": 11,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1082007163540623472",
    "author": "Chris Doms",
    "date": "2023-03-05",
    "content": "Also just wanna drop that the search function for this Discord has been a huge help. I appreciate everyone sharing their knowledge and experiences with this stuff. I love it here",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1366797164436652158",
    "author": "nachomaquieira",
    "date": "2025-04-29",
    "content": "It’s called La Cumbre, a hilly/mountainous area here in Argentina.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1372774744407019583",
    "author": "Eric Martin",
    "date": "2025-05-15",
    "content": "finally installed the last of the clouds for my control room, can not believe how much that changed the low end response of the room and tightened up the entire room as a listening sweet spot.",
    "reactions": 11,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1414689342110040125",
    "author": "jonmatteson",
    "date": "2025-09-08",
    "content": "I finally got my cloud hung and it is feeling really good in here! Have had a bunch of sessions over the past month and everyone is really loving the new space. \n\nWanted to see if anyone had any advice on dealing with this big 50hz dip? Mostly doing co-writes and production in here but mix alot of that stuff as well. Vibe is #1 with acoustics being close behind but I don't want to lose too much space to treatment if possible. I also have this gerhard designed membrane absorber I built for my last place in here at the moment which in the last room was built to target 70-90hz and am wondering if I should take it out or leave it? It is very heavy so not an easy test to take it out. The room is 16'10\"L 15'W 15'5\" high at the top of the vault.",
    "reactions": 11,
    "attachments": 5,
    "is_pinned": false
  },
  {
    "id": "1093704860672725064",
    "author": "cian riordan",
    "date": "2023-04-06",
    "content": "Speakers may look like buttholes but the bespoke stands are, uh, a vibe.",
    "reactions": 10,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1164564137502855189",
    "author": "Ross Fortune",
    "date": "2023-10-19",
    "content": "Last night at a pal's space doing surround mixes of a live show.\n\nWe received the final video edit just as we wrapped up the mixes, so we pulled the couch forward, got comfy with snacks, and did one last QC pass to enjoy the show as an audience. Joyous!",
    "reactions": 10,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1179557728365068428",
    "author": "cian riordan",
    "date": "2023-11-29",
    "content": "Follow up to #trackpad-talk… I finally got the little thing to join the keyboard and Magic Trackpad… it works really well and feels really solid. It’s actually nice to have the trackball as well… sometimes I find detailed mouse editing moves are quicker on the ball than with the slight lag on the Bluetooth trackpad.",
    "reactions": 10,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "873788497113260042",
    "author": "jantrit",
    "date": "2021-08-07",
    "content": "Here’s my home built attack wall! This thing is just amazing, changed my mixing life absolutely. Came to be when I was looking for a portable solution, working in this rented space. I didn’t want to invest in a proper build out and loose the space so everything here can be packed up and moved if need be (well it’s a bit more complex now that I’ve filled the space over the last year and a half haha) but it would still be possible to move the whole rig if need be. These are some older shots, been tweaking the space since then and I’m very very happy with the results. Never heard these a7x’s as clear and I’ve been using them for the last 11 years in 6 different rooms. Looking at getting something with a little more power for the room soon!",
    "reactions": 9,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1029148122108141628",
    "author": "masteredbyjack",
    "date": "2022-10-10",
    "content": "Okay here we go…\n\n@ALXCPH found a couple on my camera roll. Excuse quality, one is when I showed my parents the studio for first time. Couple (long) notes…I’m sure @Nomograph Mastering can expand if he chooses:\n\nUnf*ck designed the room. Ruairi you are incredible at this and I’m very grateful. The subtleties in the trade offs when designing a room are something I urge everyone to consider deeply as I learned when working with them!\n\n1. Studio is built in my basement…13 feet long x 30 wide x 8 tall (including treatment). Back wall divides it length wise and makes the studio part 12x15 approx.\n\n2. All treatment is built in…entire ceiling is stuffed with 9 inch pink fluffy, couple inch rockwool in the walls, tuned mass loaded vinyl behind the “housings” to L and R of listening position. Back wall is 6 inches of safe n sound in a frame built of 2x8s (by contractor) with a 24” door. It’s standing by friction just slid tight to ceiling. Quite precise measuring required to do that and make it sturdy so a door can open well\n\n3. Since I get asked a lot…the wall finishes are acoustic felt board. Went that direction because install was way better than a fabric wall (they are firm and can be cut with an exacto knife). Also they are absorptive with no reflections…caveats apply if that’s good for a given space though (rather than the acoustically transparent fabric).\n\n5. @BatMeckley can confirm hard front wall was farrrr superior for me. I had a soft one (felt) against Ruairi advice since I preferred the aesthetic lol, but room was too dead. Uncomfortable. When I switched I could hear much more depth and energy but everything still as crisp and clear. Highly recommend! \n\nHope this helps some people on here. FYI we started my room from concrete block, bare bones so could frame things to hold treatment needed.\n\nWill circle back with some better pics when I’m home. This community has helped me greatly.\n\nCheers friends!",
    "reactions": 9,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1031751861679693905",
    "author": "cian riordan",
    "date": "2022-10-17",
    "content": "Next move is having a shipping container installed in the living room.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072687585446592662",
    "author": "Calvin Lauber",
    "date": "2023-02-07",
    "content": "so no surprise but it turns out @Nomograph Mastering / unfuck kinda know what they’re doing. @cian riordan and @Rollmottle ‘s rooms sound amazing. So immersive! An interesting thing I noticed, maybe because both rooms and sets of monitors were just dialed so nicely, I didn’t think the ATCs at Cian’s and the PMCs at Anthony’s even sounded THAT strikingly different, when I have heard both monitors in other rooms and felt there were night and day differences between those brands/models.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182050302518640742",
    "author": "peterlabberton",
    "date": "2023-12-06",
    "content": "Still likely many, *many* months away from breaking ground on this project, but just got the first round of plans for what will eventually be my super badass amazing sounding mix room. Will be living in this ADU in my backyard and working in “bedroom 2”. The financial justification for this whole odyssey is that we’ll have a finished 2 bedroom legal unit at the end of it all if and when we sell/rent this spot out, hence the basic design as a “bedroom”. @Gerhard Westphalen is helping and I’m super excited to eventually get everything dialed. @cian riordan had the great idea of including tie lines to the living room space, which I’ll def be doing for tracking flexibility. I’ll also, per Gerhard’s recommendation, be covering up those two little alcoves next to the windows so the front wall is all flush (these weird cutouts for the windows are required for property line setback/emergency escape reasons, but there’s nothing but a fence and our neighbor’s yard on the other side, so whatever).",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1182050440729333821",
    "author": "montrose recording",
    "date": "2023-12-06",
    "content": "first gear installed in the new space.  wild hanging rack (back half of room)  looking to fill that slot with a MAS if anyone has one theyre trying to sell!",
    "reactions": 9,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1227326018281541782",
    "author": "Rollmottle",
    "date": "2024-04-09",
    "content": "Here are my impressions:\n\n- Definitely well within the same ballpark. The room plays a big part in how these speakers sound.\n\n- Cian’s monitors are closer together than mine and he sits closer than I do. Where I think I get a wider view of music in my room, in his room it feels more tightly focused. If we put it in terms of a frame on a wall, my frame feels like 5’ x 7’ and his feels like it’s 3’ x 5.’ Which makes sense given what we respectively do.\n\n- There was a noticeable difference in presentation of the midrange, His room seems like it is helping focus the midrange in a different way than mine does. I feel like my room is less opinionated, with maybe a bit of bias to the low end, his feels a biased toward the midrange without the same bias toward the low end. Which again, makes a lot of sense given what we respectively do.\n\n- The low end in his room is definitely tighter where mine is a bit less controlled. Both are totally viable and satisfying in different ways and either presentation wouldn’t get in your way.\n\n- Vibe check is high. I covet his ceilings.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "844025749664825347",
    "author": "absflores",
    "date": "2021-05-17",
    "content": "My spot! Loving the vibeyness. Considering getting some tuned membrane traps for behind the speakers or wherever it’s best recommended.",
    "reactions": 8,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1215094146935685160",
    "author": "Garth Tim",
    "date": "2024-03-06",
    "content": "bro the LED lights made it too heavy clearly",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1283721963834970122",
    "author": "Iwan Morgan",
    "date": "2024-09-12",
    "content": "I love the vibe of your room, how do you edit files in reaper with the screen off to the side? Kneel in supplication?",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214610767282704454",
    "author": "NoahNeedleman",
    "date": "2024-03-05",
    "content": "Having just done this recently trying to match the Soyuz for some vocal pickups, the biggest takeaway for me was how different mics inspired (or failed to inspire) different performances. The r84 specifically made me feel like I was making music. The sm7 made it feel effortless. The 87 made it feel like a fight. The Soyuz makes it feel like every I do matters. Each have problems that need solving, but they’re solvable problems.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1257086017161400371",
    "author": "Rollmottle",
    "date": "2024-06-30",
    "content": "Had to setup a viable vinyl QC station. Got the Pro Ject S3B and I pulled out my other 1200 that’s been in storage.",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1030959472136437850",
    "author": "ryount",
    "date": "2022-10-15",
    "content": "I’ve gone through a few iterations of the screen/desk tweak, kinda settled on this sound anchor cart. I do wonder if the rack behind it makes much of a difference. Hard to A/B because it kinda involves re-wiring everything.",
    "reactions": 6,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1062161235644272701",
    "author": "BatMeckley",
    "date": "2023-01-09",
    "content": "The eureka moment after you’d already hit send on the first half, coupled with the smug satisfaction after finishing the second half.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081691658262954086",
    "author": "ehutton21",
    "date": "2023-03-04",
    "content": "Panels nearly nailed me on my way out the door",
    "reactions": 6,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1176210291852324864",
    "author": "masteredbyjack",
    "date": "2023-11-20",
    "content": "Looks amazing, obsessed with that window view\n\nAlso I know there will be eye rolls at this but Josh just moved to the UK and is getting feet on the ground and building client base — that vibe I’m thinking will photograph well for IG and elsewhere\n\nWe even talked about that during my unf*ck build, how it does matter until you have work that can speak",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185012937899900948",
    "author": "hyanrarvey",
    "date": "2023-12-14",
    "content": "New podcast featuring me @chrissorem  and @Rollmottle  called high on mat radd discord",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240424319625068686",
    "author": "BatMeckley",
    "date": "2024-05-15",
    "content": "Also, Chris’s ability to find himself in a studio that looks exactly like this no matter where he’s working is unparalleled",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407371753226764308",
    "author": "Tim O’Sullivan",
    "date": "2025-08-19",
    "content": "Got this installed yesterday. Custom drum shelf. No more storing drums on the floor.",
    "reactions": 6,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1421691159092400241",
    "author": "sethmanchester",
    "date": "2025-09-27",
    "content": "Honestly, I love the c37 on certain voices but it didn't make the cut this time around mostly because of noise floor purposes and it maaaybe was a little too midrange forward and dark. I just got off the heels of two weeks using it as a main vocal mic so I kept it up. Context:  was recording a soprano which I've always found can make mics I think sound good sound awful... I rarely ever do shoot outs like this but felt like an appropriate opportunity. For this singer it came down to the 67 and the m930 and the 67 ended up edging out the m930 because it was slightly too detailed bordering on clinical (her words)... but love to see that lil' guy hold it's own. @herbie @chris_donlin",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "921076273281925140",
    "author": "Rollmottle",
    "date": "2021-12-16",
    "content": "Nice vibey spot! If you want to go down the rabbit hole all the way, the speakers should be all the way up against the back wall. Remove the treatment from the center there and put them right up against the wall. Where they are now, they look really wide and you'll still be feeling the effects of the gap between their position and back wall. You might be getting even more boundary effect from them being so close to the side walls as well. It might be counterintuitive to remove the treatment from the middle, but it really will probably help more than not. Yes, then you will have to deal with the big screen right in the sweet spot, but one step at a time lol.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086020111804149811",
    "author": "austenballard",
    "date": "2023-03-16",
    "content": "Idk exactly how this applies to monitoring specifically, but if it helps to do a bunch of thinking up front so you do less thinking later when the clock is ticking and things that matter are on the line, I'm all for that, I think we all should be. I've been led to doing so by my own pathological tendencies but I don't think that approach is without legitimate merit.\n\nIn my view it connects to the theme that's come up a few times, most recently re: @cian riordan's monitoring situation vis-a-vis spending 10k to *remove doubt*. If something is going to take a psychological toll on you and prevent you from doing good work, or *nag at your soul*, then I sincerely believe you should go down the rabbit hole and understand what you're working with.\n\nIt's the same reason I value doing testing. Why I put in the time to confirm @BatMeckley's observations about Melodyne and write it up. Why I dug into the tech specs for Ableton Warp with @ALXCPH. Why many others in here have done deep dives on various things, like @Slow Hand did also with Ableton Warp. \n\nDoes it sometimes stray into sweating minutiae that don't really matter? Absolutely. But - and here's the part that I think is critical - **we are making things**, and hopefully trying to make the best things we can. You're gonna have a hard time working out what's important and what is not important if you don't go deep once in a while, but you'll have an even harder time if you don't then come up for air and see if the minutiae are relevant to your *work* or not. (This is the trap I see audiophiles fall into, being as, you know, they're not making work like we are.)",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106723786222477413",
    "author": "NoahNeedleman",
    "date": "2023-05-12",
    "content": "@Zack Hames I remember shopping for an engagement ring. I was ready to spend $12k on the right ring, and feeling real grown up about it. But the first thing Michelle did was go to a local showroom and figure out exactly what she wanted, not thinking about budget. Just size, shape, color, & setting. \n\nI waited till the spring sale and went down to have a look and see what was what. It was $27k before tax. \n\nI can’t stress enough that Michelle is not bougie; she didn’t pick the fanciest or biggest or “most expensive” rock; she just found what she liked. \n\nI legit guffawed. And told the salesperson thank and was ready to leave. She looked at me and said “well what’s your budget?” I said $12.5. And tbh I was really fucking proud of that number walking in to the store, but when the saleswoman heard it she wasn’t just crestfallen, she was annoyed. Like I was wasting her time. To say it took the wind outta my sails was an understatement. \n\nA few months later I told the story to the right friend, who new the right guy. Long story short I got almost the exact same ring for $4k. (The Diamond business is a fucking war zone, literally.) \n\nAnyway, point is, don’t let these bougie Motherfuckers make you feel bad about being able to spend $20k building out your dream studio. That’s a big number in almost every world. \n\nYou might not be able to do it the way you imagined, but you’re gonna get there. 100% you’ll end up with a great sounding room with a killer vibe, cause you know what you want and you’ll keep working till it’s right.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1176201510279991336",
    "author": "Bryan DiMaio",
    "date": "2023-11-20",
    "content": "First you called Amphions high performance speakers, now this…",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247436091959541841",
    "author": "peterlabberton",
    "date": "2024-06-03",
    "content": "Okay I have a crazy notion that I want you all to roast me for: I spent a week in a dingy windowless studio last month and felt so productive and loved it. Admittedly a lot of it was putting on my old tracking engineer hat and getting to hang with a band and make a record that way (my fav), but it had me wondering whether I might want to get some kind of super window blackout option so I can get the cozy cave vibe if I want. Bright and clean is neat, but what about warm and cozy and focused?! Shut out that pesky outside world!",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382830788630020106",
    "author": "BatMeckley",
    "date": "2025-06-12",
    "content": "Careful with this… in my vocal booth I have a big tapestries that covers an entire wall, thin, that looks like stars against a black sky. Thinking I was super clever, I ran and led light curtain (essentially just Xmas lights) behind it, to make the stars light up. Looks awesome. \n\nThe light curtain shows up as hum and noise in both the Telefunken mic AND the guitar amps. Damn it all.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "840275569672978443",
    "author": "Slow Hand",
    "date": "2021-05-07",
    "content": "I’ve compiled a lot of Art Noxon’s writing/speaking on how Tube Traps work from an acoustics/physics standpoint. If anyone would like I’d be happy to send/upload my notes on these.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064337527823159356",
    "author": "Eric Martin",
    "date": "2023-01-15",
    "content": "I did put an AirTag in it, and am currently figuring out insurance if possible, but I’m pretty stinking thrilled with the versatility and package size",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064572951573319680",
    "author": "BatMeckley",
    "date": "2023-01-16",
    "content": "True, but I’d rather risk that than have TSA rifling through all my mics/drives/computer everything else. I’ve literally opened pelicans to see TSA had dismantled my entire pedal board, cables unplugged, pedals all off the board banging into each other. Nightmare.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068306713440178177",
    "author": "peterlabberton",
    "date": "2023-01-26",
    "content": "I’m gonna be so dialed in by the time the downtempo mush resurgence comes around",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116134585852497920",
    "author": "popaganda.",
    "date": "2023-06-07",
    "content": "I think Ruairi will like that we’re all tracking vibes in a room together",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212226327030140988",
    "author": "peterlabberton",
    "date": "2024-02-27",
    "content": "Pretty soon my room will be completely filled with loose pink fluffy. I'll just wade into the middle—and pop in my Airpods and get to work.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1219049307735330826",
    "author": "LAPhill",
    "date": "2024-03-17",
    "content": "It’s a great space. Feels like the work of a curious craftsman. Things are dialed in, but his side setup for writing makes the room feel more like a place for exploration. The room disappeared when I listened, and I really felt like I was hearing what the 6-2’s do. \n\nBut most importantly, windows.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223633222198628392",
    "author": "kylem",
    "date": "2024-03-30",
    "content": "But in general, I just have a lot of lamps with low light. Cozy vibes",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1340050003594580028",
    "author": "NoahNeedleman",
    "date": "2025-02-14",
    "content": "The room, which if I’m not mistaken @Gerhard Westphalen helped with, was detailed without being clinical, and was almost completely devoid of distraction. Just you & the music. Similar to @Rollmottle’s place but cozier and less… California. \n\nThe speakers have a density in the upper mid range area that doesn’t present like an eq problem, they’re lacking warmth in the lower mids despite having plenty of low end. \n\nThey’re not as bright as the 6-2s but have a similar crispiness to them, albeit lower. \n\nThe high end is more detailed than my 25s but somehow less pleasing to me? \n\nI absolutely understand how people can do excellent work on them, but they don’t spark joy in me. \n\n@jordanmcleod_io’s approach to his room & setup are A Class tho.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808928634164871238",
    "author": "Preston Lull",
    "date": "2021-02-09",
    "content": "A lot of factory made guitars have fretboards of varying quality (maybe it’ll have subtle warps and waves in the wood up and down the neck) - if you’re having issues with playability beyond just getting a set-up maybe get the frets dressed and leveled out,\nLong story short, if it doesn’t feel or sound good, you can always find a luthier (usually in a guitar repair shop) to help you out",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "921081700350578739",
    "author": "Eric Martin",
    "date": "2021-12-16",
    "content": "the biggest take away from hearing how the unf*ck process works was, “we take everything out of the room” and then only put back what’s truly necessary.\n\nI haven’t personally gotten to that point, because I have my workflow dialed in so specifically for my space, but it gets me in the mindset of “do I need this?”",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086006864506007622",
    "author": "LAPhill",
    "date": "2023-03-16",
    "content": "I actually love that you used your trig knowledge as a starting point. But I'd want to caution other people reading these posts that there's no mathematical formula that will ever replace listening. I'll be curious if 6 months from now, you find a better angle.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093981133538066483",
    "author": "BatMeckley",
    "date": "2023-04-07",
    "content": "This is why graphs drive me nuts. A speaker is so much more than its response graph. I’m convinced a big part of why they translate the way they do is because of their time domain response and the sealed cabinet ness of it all, but that is an incredibly from the guy uneducated guess. Also, everyone is talking about 26hz but to me SO MUCH of the translation is the nasty 1-3k the ns10 really makes you work on",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099787551084126271",
    "author": "Gerhard Westphalen",
    "date": "2023-04-23",
    "content": "Nothing beats Hans Zimmer’s Viennese brothel vibes",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106718923581304922",
    "author": "LAPhill",
    "date": "2023-05-12",
    "content": "@Zack Hames there are tiers to this. It'll be harder to suss out the quality of designers and contractors where you are, but get into studios there that are well-built and find out who did them. Decide what's most important to you (isolation? room response? vibe?) and allocate your resources from there. Do you really need that hardwood flooring, or would a laminate suffice? I cut corners on a few aspects of my studio, most of which turned out to be fine, but I'm now paying the price for something that likely could've been avoided had I spent more up front. \n\nI have colleagues that went with fancy architects/big name studio designers and spent twice as much as I did and had worse results. So price does not always equate to the final product.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1154504963762954240",
    "author": "Rollmottle",
    "date": "2023-09-21",
    "content": "Annnnnd we’re back. The screen in the middle was too much of an eye chart and thus canceled any ergonomic gain. Trying to find the middle ground without needing future neck and shoulder surgery.",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1167958935030997023",
    "author": "NoahNeedleman",
    "date": "2023-10-28",
    "content": "I was 15. The album was called Noah’s Ark and this was the cover photo. I folded it to fit into a cassette case. Only used the tascam to dub to cassette, and it got passed around my high school. I thought I was famous 🙌🏻",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1172242695251574794",
    "author": "BatMeckley",
    "date": "2023-11-09",
    "content": "This is really hurtful and uncalled for. I’ll be reporting this to the mods.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185013744259043368",
    "author": "cian riordan",
    "date": "2023-12-14",
    "content": "I'll pop on blitzed on uppers once a month w/ @BatMeckley and we'll harsh the vibe a bit.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199437293375737918",
    "author": "montrose recording",
    "date": "2024-01-23",
    "content": "thank you!  @Gerhard Westphalen did the acoustic plan and my wife and i designed the aesthetic",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199715192125263964",
    "author": "chrissorem",
    "date": "2024-01-24",
    "content": "And if you don’t have a trombone an amp can get a similar vibe",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1243975605972766720",
    "author": "Nomograph Mastering",
    "date": "2024-05-25",
    "content": "That shitposters on Reddit become the repository of human knowledge mined by Gemini is very funny to me",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244339664689823928",
    "author": "Nomograph Mastering",
    "date": "2024-05-26",
    "content": "My experience with cheaper LED color changers is jank software, unreliability and often hums/buzzing/random flickering etc",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247722388607733870",
    "author": "chris_donlin",
    "date": "2024-06-04",
    "content": "For the lighting folks, just got my Hue’s in, fucking awesome. App is great, colors are great, vibes are greatttt",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1251367305741598720",
    "author": "NoahNeedleman",
    "date": "2024-06-14",
    "content": "Amazing how when the big things are handled, the small things become the new big things.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277324406305062953",
    "author": "chrissorem",
    "date": "2024-08-25",
    "content": "Installed a second AC system yesterday so I can run a single AC for the control room and not have to cool the rest of the studio when not in use( mixing days).  This a picture of the crawl  space where the  AC mufflers live, I hope I never have to go up there again but this might be interesting for some to see",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1288881461981745223",
    "author": "thegreatcarsoni",
    "date": "2024-09-26",
    "content": "During my audiobook narration phase back in college. Funny, I was so thrilled to get the Klipsch bookshelf speakers 😭",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1306289997430652959",
    "author": "BatMeckley",
    "date": "2024-11-13",
    "content": "This also feels very much like a room for someone who makes music and doesn’t just talk about it on the internet. What a rad selection of gear and vibe. Good stuff going to come out of this room",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312262023538544650",
    "author": "Bryan DiMaio",
    "date": "2024-11-29",
    "content": "we gotta get you a sad lamp or something lol",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1410373861496721428",
    "author": "jantrit",
    "date": "2025-08-27",
    "content": "Large latchlake fan here, yeah they’re pricy but every single one of those big ultimate stands I know of in the wild have at least one part broken. \n\nThe latchlakes have never failed me, even a bunch that have spent their lives being beat by students at a school!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428801854116204706",
    "author": "Tim O’Sullivan",
    "date": "2025-10-17",
    "content": "Hell yes. Makes me happy to see more consoles getting installed! Congrats",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1452089627312914535",
    "author": "Rollmottle",
    "date": "2025-12-20",
    "content": "I’d maybe call piano movers before I called mover movers. Either way I’m calling someone.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "922638909509365788",
    "author": "Eric Martin",
    "date": "2021-12-20",
    "content": "finally got the patchbay up and running and the grounds troubleshot for low noise, half-normalled and ready for a session",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1029469068056608838",
    "author": "Nomograph Mastering",
    "date": "2022-10-11",
    "content": "Length matter that much either except that you have to look at it curled up if it’s too long",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047296675091333142",
    "author": "jonmatteson",
    "date": "2022-11-29",
    "content": "An m88 as a mono overhead into a culture culture is a sick vibe tho",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061269071158583387",
    "author": "Zakhiggins",
    "date": "2023-01-07",
    "content": "Unplugging the hdmi cable from your screen when listening back to a mix is a vibe though.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067892185728553141",
    "author": "LAPhill",
    "date": "2023-01-25",
    "content": "With windows, the one creature comfort I gave myself in my build was automatic blinds (black-out shades, in my case). They're expensive, but depending on which direction you're facing and how the sun hits you, it's nice to tweak at the push of a button instead of having to get up and ruin the flow. Or set up times of day for things to open/close automatically. \n\nI have a skylight though, which it doesn't look like you have any windows up high - that was part of what sealed the deal for me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069364201979645992",
    "author": "cian riordan",
    "date": "2023-01-29",
    "content": "I borrowed one from a friend years ago to record a Gwen Stefani Xmas album. We were going for the wall of sound vibe and that thing sounded incredible on the drums.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1072687857132646482",
    "author": "Calvin Lauber",
    "date": "2023-02-07",
    "content": "Really appreciative of this space and of eveyone willing to share their time and knowledge. ♥️",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082420190261825558",
    "author": "sethearnest",
    "date": "2023-03-06",
    "content": "3-day weekend to get it all down, cleaned up, and get the pink fluffy installed. I did over July 4th a couple summers back.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086024670656081980",
    "author": "Rollmottle",
    "date": "2023-03-16",
    "content": "feels like wasting money. if you've ever gambled and lost, you'll know it well.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086028249030733834",
    "author": "austenballard",
    "date": "2023-03-16",
    "content": "I just want to chime in with what I think is an important distinction that I felt a little called out by with the references to my templating... \n\nI like to be prepared, and most of my getting-in-the-weeds happens when I have the time to work on preparing things that will make life easier in the future. Again, I cannot stress enough that I'm talking about **getting things out of the way so actual creative work can happen**.\n\nI think what you're describing @ALXCPH IS perfectionism. Worrying about minutiae when something else is supposed to be happening. Interrupting flow. Would anyone argue with me if I said that that's never a good thing?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088911177259692112",
    "author": "masteredbyjack",
    "date": "2023-03-24",
    "content": "@Chris Doms is the best, also just want to reiterate love the vibe of your spot @Rollmottle",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116135615860330597",
    "author": "popaganda.",
    "date": "2023-06-07",
    "content": "Big vibe. Tall ceilings, natural sunlight",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129454330982957056",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "I dare not open the racks hahaha. The rats nest here is just hidden. It took a bit of time, everything labeled very nicely, etc which I find worth it to walk into the studio everyday and not see most of the cables!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1133776865987932251",
    "author": "BatMeckley",
    "date": "2023-07-26",
    "content": "Wait what was Ross doing there? Also tell him hi for me! He was incredibly kind and generous with his time and knowledge when I was a lad.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135665187609911427",
    "author": "Zack Hames",
    "date": "2023-07-31",
    "content": "Also I am really looking forward to getting some flooring and nice lighting in here, I think it’ll be super cozy and cool once it’s done",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150256414653157417",
    "author": "Nomograph Mastering",
    "date": "2023-09-09",
    "content": "Wrangled 6-2 on sound anchors on spikes on concrete behind a huge desk today",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1163138703145844936",
    "author": "Joshua Riley",
    "date": "2023-10-15",
    "content": "Just a joke from my side! Grew up in church, played in worship teams all my life, worked as a worship pastor, learnt all my audio knowledge there. Wouldn’t be doing what I’m doing if it weren’t for church. Recently joined a new plant in our new area and slowly getting involved again",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1163138976798998578",
    "author": "NoahNeedleman",
    "date": "2023-10-15",
    "content": "I actually chuckled, and then responded seriously.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210710689216209000",
    "author": "kylem",
    "date": "2024-02-23",
    "content": "I'm 6'3 and always struggled with that until I bought this guy -  https://www.upliftdesk.com/?wickedsource=google&wickedid=Cj0KCQiAoeGuBhCBARIsAGfKY7zSChbqkhWoso7FX2LB8vcO8zn6A9EBWccw70ZI2zp3pLTEGzYXHz4aAsqUEALw_wcB&wickedid=344953927332&wcid=805069123&wv=4&utm_term=uplift%20desk&utm_campaign=Search+-+UPLIFT+Desk+-+Branded&utm_source=adwords&utm_medium=ppc&hsa_acc=3428820651&hsa_cam=805069123&hsa_grp=37211695330&hsa_ad=344953927332&hsa_src=g&hsa_tgt=kwd-299994086325&hsa_kw=uplift%20desk&hsa_mt=e&hsa_net=adwords&hsa_ver=3&gad_source=1&gclid=Cj0KCQiAoeGuBhCBARIsAGfKY7zSChbqkhWoso7FX2LB8vcO8zn6A9EBWccw70ZI2zp3pLTEGzYXHz4aAsqUEALw_wcB",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210731569455697920",
    "author": "NoahNeedleman",
    "date": "2024-02-23",
    "content": "Full tears hit me by song 3 or 4, and song 5 my ear was drawn to things I’d never noticed in a song that’s in my “vibe check” playlist.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1211875652505042985",
    "author": "cian riordan",
    "date": "2024-02-26",
    "content": "He told me Ira Glass was silky on your ATCs, but Rogan really rumbled on the Questeds.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1229908467167264850",
    "author": "Iwan Morgan",
    "date": "2024-04-16",
    "content": "Every water filled cloud has a Zack Hames silver filled lining",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230613887632674926",
    "author": "Edsel Holden",
    "date": "2024-04-18",
    "content": "@Calvin Lauber is dialed INNNNN - the room fucks - lovely hangs - happy you are nearby !!!!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230887669870100552",
    "author": "Zack Hames",
    "date": "2024-04-19",
    "content": "It's what the beta 52 kick drum recording called for.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1240425432185307186",
    "author": "Zack Hames",
    "date": "2024-05-15",
    "content": "The mac in front of the speaker is a vibe",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244339407276998698",
    "author": "Nomograph Mastering",
    "date": "2024-05-26",
    "content": "If colors are your thing, hue is fun. If you expect it to approximate normal white or incandescent light it’s a bad time",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265053162272981063",
    "author": "thegreatcarsoni",
    "date": "2024-07-22",
    "content": "It's a really interesting change, I wish there was a way for me to hear the room as it was before back to back with how it is now, my feelings on it now are obviously pretty subjective. My first reaction was that it feels really precise, like I gained some transient information. The center image feels more 3D and focused. The low mids feel a little more prominent, I'm just hanging out here letting my music library shuffle to listen to lots of stuff when I'm not working and some stuff feels a little needling around 240-280Hz, but not everything does. I do know we tackled the low end build up issue, and established more symmetry in the layout.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1278490654401368117",
    "author": "Nomograph Mastering",
    "date": "2024-08-28",
    "content": "If you want a perfectly controlled room then use your control room to track (say for a pristine acoustic guitar)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1296564285530705950",
    "author": "montrose recording",
    "date": "2024-10-17",
    "content": "processing live instruments and also creating synth vibes for daily jams",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308937885935865968",
    "author": "chrissorem",
    "date": "2024-11-20",
    "content": "I think there are some led ones now that are quieter",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341191658120806451",
    "author": "Rollmottle",
    "date": "2025-02-17",
    "content": "i will always recommend going into joists for any overhead installations, especially one of considerable weight. heavy duty drywall anchors could definitely work to spread and share the load between 4 single joist-installed anchors, but that assumes there's viable modern drywall up there to begin with. what appears to be drywall in my room for example, is old 1/8\" fiber board, which does not hold anything. \n\nthat may be fine for Itay's use case if there's drywall behind those wood planks, but best practice and peace of mind would be spanning the key anchor points across 2 joists and using longer chain or wire to make the connection.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370020736172949565",
    "author": "Will Melones",
    "date": "2025-05-08",
    "content": "Mine are 5000k for a daylight vibe around the perimeter, and then I have Hue bulbs filling in warmer light in the existing recessed cans",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1377704881170939956",
    "author": "LAPhill",
    "date": "2025-05-29",
    "content": "No, it’s angled to blow past them. If anything, the piano gets hit more. But the tuning of everything in here stays surprisingly stable.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382758452127862876",
    "author": "masteredbyjack",
    "date": "2025-06-12",
    "content": "Truly I don't know, but it can't be 100 percent acoustic neutral (probably?)\nI just wanted @herbie to consider if it could be a net negative acoustic for more aesthetic vibe (which is fine tradeoff if you're cool with it)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382821754501595277",
    "author": "masteredbyjack",
    "date": "2025-06-12",
    "content": "Aesthetics definitely matter, great idea @jordanmcleod_io !",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382905808601350184",
    "author": "Abel Koshy",
    "date": "2025-06-12",
    "content": "Also I can hear what verbs are doing… like it’s not just a “verb” I can actually tell the vibes of it. Hahaha",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1406748124889874534",
    "author": "nachomaquieira",
    "date": "2025-08-17",
    "content": "Nomad life’s got its ups and downs, but it’s beautiful for us. Living light, discovering new places, soaking in different vibes is great for us. It’s been amazing, but now with the baby it’s tougher to keep moving, so we’re ready to settle for a while🙏🏽❤️",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428856555431792750",
    "author": "cian riordan",
    "date": "2025-10-17",
    "content": "Setup the patchbay so each channel is normalled to PT inserts.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808435244574965820",
    "author": "oaklandmatt",
    "date": "2021-02-08",
    "content": "fuck i want to hang out here. looks like a tremendous vibe",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808503433870835733",
    "author": "Josh",
    "date": "2021-02-08",
    "content": "Want clean pop tones? Bassman. Want grunge vibes? Bassman. Want metal? Literally the Fortin amps are modded plexis",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "823709820204482620",
    "author": "Rollmottle",
    "date": "2021-03-22",
    "content": "One thing that might help too is some foam angled up sort of near the edge of your table to knock those first table reflections back. You can kind of see that same idea in my picture with the foam peaking up the top of the back of my sterling unit. Worth experimenting with.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "905166319387803758",
    "author": "kylem",
    "date": "2021-11-02",
    "content": "It was great man. I chose not to hire a contractor - I have a friend who does construction supervision. He just wrapped the new apple store, so I was able to hire a lot of his workers. I had a drywaller, framer and electrician. Everything else I did myself and / or with the help of one of the workers. I just really can't believe how accurate the room is without doing anything. The design that they handed over to me was totally dialed in as far as where the treatment in the walls went and the dimensions of the LMA's",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "922465958524764230",
    "author": "Maxim",
    "date": "2021-12-20",
    "content": "So I'm currently doing all of this (removed screen as well). I'm not sold just yet. \n\nFew issues: the listening position is still best in my old spot (about 34% into the room). So I have to pump more sound than before to get the same \"feeling\". Phantom center is also not as clear.\n\nAlso, the idea of getting a triangle gets thrown out the window. I'm further away than they are apart. Bass of course is bigger (even with a -6db roll-off) but I'm not sure if it's actually useful. And it seems like the walls are now vibrating more (already had a neighbor asking what I'm up to).\n\nAnd for some reason records that sounded great to me before now sound unlistenable and harsh in the upper mids. Not sure if this is true just yet though (see Walking on a Dream by Empire of the Sun). If this is what other people are also hearing maybe it's the detail I've been missing in the mids. Some songs are really painful.\n\nOn the plus side, the room is a bit \"deader\" and even now because I moved the treatment to the back (where previously there wasn't much). Also, reverb tails are very clear now. Before I couldn't really hear FX until I overdid them and dialed back. I'll try doing a mix like this and see if I intuitively make better decisions.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "930252564744790037",
    "author": "Chris Doms",
    "date": "2022-01-10",
    "content": "Maybe put some of the ones not being used too well on stands and have them behind your listening position, dope setup dude. Love the simplicity, plants, and lighting",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001818319684370434",
    "author": "ALXCPH",
    "date": "2022-07-27",
    "content": "Bass absorption = mass & distance. No matter what. No tricks Will work. It’s just physics.\n\nA little reflection here and there Will make the room much more natural. Most people cant controll their bottom anyway. So having a completely dead highs and mids and a ringing bottom makes a room Sound very un natural. \n\nControlled is better than dead",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1016731447131902032",
    "author": "ALXCPH",
    "date": "2022-09-06",
    "content": "man thats dope! i love the lighting! such an undervalued aspect of studios....",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1016736025990672455",
    "author": "P.K. Stephan",
    "date": "2022-09-06",
    "content": "In my experience the buzzing is usually from the resistor used in some light dimmers. Really depends though. The Philips Hue are also a big plus when there are people filming making of’s and album documentaries because they seem to work pretty good at certain framerates without flickering and you can really set a mood quickly. The Ikea alternative is probably really cool as well.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029158391509155900",
    "author": "masteredbyjack",
    "date": "2022-10-10",
    "content": "Hahaha I feel you. As with everything it is trade offs. Getting the smallest door possible mattered to me because I was after the absolute best sonic experience possible at the listening position only (hence the couch was largely irrelevant since it’s only ever me in my room, wouldn’t need to be changed, etc). But I did measure everything before I put the wall in!\n\nMy guess is your set up has much more to take into account so the extra 6 inches of door or whatever is useful to you!\n\nLight…yes this was HUGE for me too. My previous studio had huge windows which were terrible for sound but amazing for my mood. So I went overboard to make sure it can be very bright with the lighting in ceiling (it changes with the time ala how Jon was talking about white light being better in morning, etc) \n\nSorry if the front wall discussion was confusing — it WAS felt but is now 3/4 inch sheets of Baltic Birch…so it’s hard!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1032481920140988467",
    "author": "masteredbyjack",
    "date": "2022-10-19",
    "content": "This looks amazing! Also replaced our floors in the house with LVP and it’s incredible the aesthetic difference it can make. Congrats!!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061449600046735420",
    "author": "popaganda.",
    "date": "2023-01-07",
    "content": "the bare minimum least intrusive thing to do, if you don't want to wait for custom panels, would be to start with 4 John Hunter panels. 1 on that little wall to your left, 1 on a stand to your right, and 2 as a cloud. Expand out from that as space/vibe permits. I don't think the cloud will be an eyesore, esp if you let your partner decide on the colors",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064994087507333211",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "Yeah for sure. Put in a lot of lighting/etc. I like bright spaces!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066125097397657700",
    "author": "jantrit",
    "date": "2023-01-20",
    "content": "Yeah dude! Natural light is everything, vibe over perfect acoustics everyday of the week.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067806268510703677",
    "author": "Eric Martin",
    "date": "2023-01-25",
    "content": "I know a studio called that, it’s not commercial or public but it has the name 😆",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086212585986203659",
    "author": "ALXCPH",
    "date": "2023-03-17",
    "content": "Your sentiment is so true. Nothing kills a studio vibe quicker then the feeling of someone not wanting to be there, or just being there for the pay check. (I don’t judge, it is a job after all) but being met with true joy or enthusiasm, just makes everyone feel/do better.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1089563017227816960",
    "author": "masteredbyjack",
    "date": "2023-03-26",
    "content": "Incredible, huge congrats!!! Vibes for days",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094017024428089534",
    "author": "Gerhard Westphalen",
    "date": "2023-04-07",
    "content": "That graph says it all. The ns10 thing is just an incorrectly designed crossover (because a proper one would’ve been too expensive). “Tightness” just comes from the lack of bottom end. Yes, because it’s sealed but only in the sense that sealed doesn’t provide extended bottom end. The “transient” benefits of sealed don’t really come through. I spent a lot of time designing a proper crossover for them. It can be done but then they just sound like cheap speakers and their usefulness is gone for someone who’s used to it and relies on the problem",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099781826890969138",
    "author": "Joshua Riley",
    "date": "2023-04-23",
    "content": "Took a lot in from all your Unf*ck knowledge that’s around the internet! 🙌🏼",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099848539636502650",
    "author": "Will Melones",
    "date": "2023-04-23",
    "content": "It looks so bright and open. But wouldn’t stay clean for more than a week in my space. Light, permanently installed fabric terrifies me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101597073427681400",
    "author": "Tim O’Sullivan",
    "date": "2023-04-28",
    "content": "I installed these at another studio, looks killer. Might upgrade mine to these at some point. MOKOSE HDMI Camera, HD 1080P 60FPS Digital Security Camera, Industry Digital Camera with 3.2mm No Distortion HD Lens https://a.co/d/dwsdWeh",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104175140234866768",
    "author": "Bryan DiMaio",
    "date": "2023-05-05",
    "content": "Oh yeah, I can nerd out about all sorts of things (though never at the cost of the vibe of a mix)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110389683936055307",
    "author": "masteredbyjack",
    "date": "2023-05-22",
    "content": "Zero clue about acoustics but awesome vibes! Nice and bright\n\nWhat’s the end goal of the room? (I’m assuming those who can help you would need to know this)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110580391837974578",
    "author": "masteredbyjack",
    "date": "2023-05-23",
    "content": "@Johnny I to follow up the ceiling stuffing point...I don't understand how that relates to isolation...we had very cheap like cardboard ceilings in my place before. So I ripped those out, stuffed, covered in felt and that was better than what I had before, but it may very much not be better in your case. Listen to the pros @Nomograph Mastering or better hire @Gerhard Westphalen or something depending on the scope of what you're doing. Doing what I did could be worse isolation for all I know, for me I was after the best acoustic response possible and isolation wasn't a consideration\n\nAlso it looks like you have nice recessed electrical already installed down there too...something to think about it is a non-trival cost (in either time or money) to rip down, stuff and redo all that, or even just remount the lights",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132142884242587669",
    "author": "Nomograph Mastering",
    "date": "2023-07-21",
    "content": "So they’ll be dismantled soon to see what’s up",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132848928690274354",
    "author": "Bryan DiMaio",
    "date": "2023-07-23",
    "content": "fwiw I've had good luck with a Samsung miniLED TV as a monitor",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132857166424985733",
    "author": "Bryan DiMaio",
    "date": "2023-07-23",
    "content": "so OLED is where every pixel is its own backlight, microLED is that but without burn-in (but also like $100k for one), and miniLED is an in between. Essentially it's a QLED (lots of colors and bright af) with a ton of backlight zones/full array local dimming. Essentially it has great color depth and brightness without OLED problems, though it doesn't quite match the pixel response (but is still quite fast) and it's not quite as many backlight zones (since not every single pixel is its own backlight like on OLED and microLED). Hopefully that's not too much word vomit lol\n\nAt the end of the day, I have an OLED in the living room and a miniLED as a computer monitor and for everyday use as a monitor this is great. The advantages you'd gain of going with an actual monitor that has DisplayPort are good if your computer doesn't have HDMI 2.1 since you'd then be able to hit 120Hz at 4k and it would feel quite buttery smooth",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135664559861018706",
    "author": "hyanrarvey",
    "date": "2023-07-31",
    "content": "Don’t hate me but I miss the living room vibe",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1139384976358514790",
    "author": "masteredbyjack",
    "date": "2023-08-10",
    "content": "Freaking incredible. Awesome vibes. To the moon with you now!!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1152259118875299890",
    "author": "esquinalee",
    "date": "2023-09-15",
    "content": "Looks like it was over at EastWest Was gonna pick your brain on how you handled his different instruments. Shabaka the winds master",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171048224824504381",
    "author": "Joshua Riley",
    "date": "2023-11-06",
    "content": "Finishing up my room this week. Stuck on fabric choices. I did Vit in my old room. Wife and I both like glass and clan too. Looking for some alternative opinions!\nCarpet is grey and all walls are white. I do love the white aesthetic but open to alternatives",
    "reactions": 1,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1172220611846746112",
    "author": "Adam Thein",
    "date": "2023-11-09",
    "content": "also there's a lot of visual stimulus in a studio tracking, same concept as getting fooled by UIs while mixing IMO",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1175642619502669925",
    "author": "montrose recording",
    "date": "2023-11-18",
    "content": "@masteredbyjack yes!  going to collate alot of that sort of thing both for IG roll out for the space and website / general vibe.  will definitely share",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1176189982747131965",
    "author": "Josh",
    "date": "2023-11-20",
    "content": "I actually really like the frame too! Giving tree house vibes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178463372845518888",
    "author": "Calvin Lauber",
    "date": "2023-11-26",
    "content": "that’s absolutely the vibe. Great work man",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1184215017571221645",
    "author": "Zack Hames",
    "date": "2023-12-12",
    "content": "I thought it was Tiled Room! (You’re the expert, gonna try this now tho)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1184648946535116810",
    "author": "chrissorem",
    "date": "2023-12-13",
    "content": "https://tenor.com/view/plug-in-sparks-christmas-lights-national-lampoons-christmas-vacation-gif-13458297",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1185060643561279497",
    "author": "masteredbyjack",
    "date": "2023-12-14",
    "content": "Love the vibes of this, @cy (sigh) is a legend",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1199678013621665892",
    "author": "Iwan Morgan",
    "date": "2024-01-24",
    "content": "Sounds amazing. Giving me real Husky Hoskulds vibes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1215530747473952799",
    "author": "Garth Tim",
    "date": "2024-03-07",
    "content": "not enough RGB or modular synths that you have no idea how to use. 4/10",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223408359093305417",
    "author": "JakeTB",
    "date": "2024-03-29",
    "content": "You guys did a great job on it, and he’s got the interior vibe nailed. Really enjoyed our time",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1232055460216176650",
    "author": "cian riordan",
    "date": "2024-04-22",
    "content": "Yes, just a simple piece of butcher block I chopped up to size, sanded, and attached some cheapie amazon table legs to. It's got a small footprint (about 26\" wide, 18\" deep), holds everything I need, and looks relatively good with the overall aesthetic of the studio. I'm working on something properly transparent with an audio-maker friend of mine, as soon as there's info & prototypes on that, I'd be happy to share phase 2 of my plan.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244331047236403341",
    "author": "BatMeckley",
    "date": "2024-05-26",
    "content": "I live off the hue ecosystem through my whole house and studio and love it. The irony being I’ve had to get some of their wall switches so people can turn them on/off without a phone. A bit like when people get those wires to attach to their AirPods so they don’t lose them.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244390263204483112",
    "author": "youngteam",
    "date": "2024-05-26",
    "content": "I love the hue system for moods but yeah they’re a pain to shoot video with due to flicker in NA at least. Have tried several fps to no avail (less noticeable if you have a source much brighter than them)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247406623811440691",
    "author": "peterlabberton",
    "date": "2024-06-03",
    "content": "I have ideas, b/c this sort of stuff has been bugging me big time, but I'm holding off until I can start the real studio build.\n\nThe one thing I do have, and like, is the Hue lightbulbs folks were talking about recently. I don't fuck with the colors, but it's nice having dimmable lights all over, even on lamps and whatnot.\n\nOne thing I have not figured out is the computer monitor. It has to be too far away for good ergonomics (we all know this), but a cannot stand the screen really low thing—I crane my neck over instinctively and get *wild* headaches/neck pain. But where I have it now, I also crane my neck closer since it feels too far away. I've always hated big TVs for computer monitors in studios, too, but I'm debating going that route in the next spot and having big ass type like a true grandpa. Anyway, didn't mean to hijack!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255928701309419520",
    "author": "Slow Hand",
    "date": "2024-06-27",
    "content": "There are remotes for the TwoTwo series that you can buy used, but not for the newer ranges, to my knowledge.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255945134521188507",
    "author": "hyanrarvey",
    "date": "2024-06-27",
    "content": "Cathedral pipes is that what’s it’s called",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1260417824552255539",
    "author": "matthewrederburg",
    "date": "2024-07-09",
    "content": "Today’s mixing vibe. Vicious heatwave got me mixing with the tootsies in a cooler full of ice water.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1260515946687365213",
    "author": "Ross Fortune",
    "date": "2024-07-10",
    "content": "Don’t mind me @bobby k , just going to wholesale lift your entire studio vibe. Didn’t think I’d like black walls, but they’re great with the cosiness you have going on. \n\nI got to the stage in my room where everything was in and functional, then I just started working and never stopped. It’s sorely in need of some love in the aesthetics department and this is great inspiration.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1268395364445323327",
    "author": "masteredbyjack",
    "date": "2024-07-31",
    "content": "@Zack Hames I think it’s called duct wrap, it’s insulation that just sticks on (is thin, maybe what @Eric Martin mentioned)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1277340929753088142",
    "author": "chrissorem",
    "date": "2024-08-25",
    "content": "They are siting on studs but yeah no fire risk there. They essentially a mouse maze inside filled with insulation wrapped in foil",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1281028533329592353",
    "author": "Felix Byrne",
    "date": "2024-09-04",
    "content": "90% of foreign setups are just an apollo w a stereo out and everything handled on their end otw in",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293989401893933098",
    "author": "peterlabberton",
    "date": "2024-10-10",
    "content": "I don’t wanna derail the jokes here, but: I’ve got a good friend who had his delay pedal modded to have the feedback and time controlled by foot pedals so he could do delay feedback/etc. live on stage—it was pretty sick.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304658340072259615",
    "author": "cian riordan",
    "date": "2024-11-08",
    "content": "Jack shack lighting really got an upgrade",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1304856368070525011",
    "author": "Tyler Graham",
    "date": "2024-11-09",
    "content": "They are. They aren’t centered with the room yet and L/R width, depth isn’t fully dialed. I just have to brace myself for busting out REW",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1308942463250993272",
    "author": "kylem",
    "date": "2024-11-20",
    "content": "I tried this and failed. I got one that was \"low noise\" and it was still way too loud. Was not an LED though. Keep us posted",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1318547415535718441",
    "author": "Chase H",
    "date": "2024-12-17",
    "content": "I drilled pilot holes into the MDF before screwing them together with these to prevent splitting. If you don’t have a drill for pilot holes may want to use a smaller screw",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1364553877533495327",
    "author": "Brian Reynolds",
    "date": "2025-04-23",
    "content": "I'm usually just setting it to the bpm of the song. But its fun to move it around. When I say it feels different. I'm talking about Chase Bliss pedals such as Reverse mode C, which has tap tempo. There's just a consistency and intensity to the repeats that isnt there on tap tempo. Idk why? And then the others without tap, like Lossy Or Onward. The feel change is dramatic how much more in sync and vibe the pedals feel with the track. It's got a ton of preset slots for predetermined tempos",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1381043700150435892",
    "author": "Chase H",
    "date": "2025-06-07",
    "content": "Looks amazing!!! You nailed those recessed lights",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382730402862469122",
    "author": "jordanmcleod_io",
    "date": "2025-06-12",
    "content": "Yeah, I think the curtain (maybe more sheer) idea across the whole wall is going to be the best bet. Turns it into an accent wall and add more vibe.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382798069975879771",
    "author": "herbie",
    "date": "2025-06-12",
    "content": "i did think about it! but honestly i just need the space to be more ✨aesthetic✨ haha, im sick of seeing the door and blank wall. i dont think it would be TOO detrimental if it was just a thin linen one",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387914278526521444",
    "author": "Ross Fortune",
    "date": "2025-06-26",
    "content": "Thanks! Yep, one of them sits on top of a cloud facing straight up. The diffusing effect definitely helps sell the illusion. The other faces straight down and just brighten the place up a lot. \n\nI’m considering another on the other side of the room which is currently more cosy/vibe lighty.\n\nThanks to @spectrummasters who confirmed I would not blow myself up by wiring a light into a wall plug 🔌",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407459561555628164",
    "author": "chrissorem",
    "date": "2025-08-19",
    "content": "Yeah one is a 26”and had one tunning/ resonant note and the the other is 28” providing different notes.  When I record drums I’ll generally have a lot of mics out and some other sound fx going at all times and as we work on a new song, I’ll have them play a take down usually a verse and chorus and I’ll stop and spend 5 minutes getting a vibe and that will inform me if I need to change a kick or snare and a resonator ect. A few of the songs I only used one resonator and kept it in the middle and and for sure one I  used both and  panned them out.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1428480782741274756",
    "author": "Zack Hames",
    "date": "2025-10-16",
    "content": "Honestly I am excited to move it and set it up so I can be a bit more intimately knowledgeable about every little piece of it.\nI wasn't able to be around for the two days they spent wiring it up at the current studio, so I didn't get to be involved",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1429163514777309245",
    "author": "cian riordan",
    "date": "2025-10-18",
    "content": "Yep. So if you pull up insert 1 on PT. The outputs of PT normalled to the line in on SSL and the direct out of that channel normalled to the corresponding input in PT",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1448032350033285403",
    "author": "Jonathan Jetter",
    "date": "2025-12-09",
    "content": "I carried just the unfilled MDF boxes up 2 flights of stairs. That was already more than enough lifting.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460767496742375515",
    "author": "BatMeckley",
    "date": "2026-01-13",
    "content": "You should look up the drummer Mike Bennett on insta and ask him how he handles it. He’s got his video setup dialed and is a total nerd for these things.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461445075404849224",
    "author": "Tim O’Sullivan",
    "date": "2026-01-15",
    "content": "What Cian said. Old school cctv is the reliable, simple to troubleshoot and cheap. Especially if you only  have a couple cameras. Good enough vid quality, best latency. \n\nThat said the modern ptz stuff is great and I’ve installed a few at different studios with no complaints. SDI is going to have better latency than hdmi, more reliable at longer distances and it’s a locking connector. Networking stuff really only useful when you have a bunch or rooms and cameras. If you’re cool with a fixed camera position then just get a fixed SDI cam and save some cash over the PTZ.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808409779072401408",
    "author": "oaklandmatt",
    "date": "2021-02-08",
    "content": "i gotta get a good vibey nighttime pic too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808824968715960340",
    "author": "dumlords",
    "date": "2021-02-09",
    "content": "POG and ms20 is a vibe.  MS20 is one of my favorites for cool transitions/sweeps.  I too would like to get into using the modular side of it though, definitely overwhelms me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "819666317614645319",
    "author": "dumlords",
    "date": "2021-03-11",
    "content": "A plexi was always my holy grail I never got.   I did have one of those traynor YBAs or whatever they’re called for a while which was in that realm circuit wise I believe but it actually caught on fire during a session 😂😂😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "823704124830515273",
    "author": "cian riordan",
    "date": "2021-03-22",
    "content": "I've always loved this low screen, angled up thing that I'm seeing in more mixing/mastering studios. I wonder if there's a trick way to do that with an iMac without spending a testicle on vesa mounts, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "841415028786724885",
    "author": "cian riordan",
    "date": "2021-05-10",
    "content": "Looks great. Tight enough to feel intimate but with the big room to eliminate small room resonance. The room *looks* like it's somewhat controlled so might even try moving the baffles further apart to give more dimension. Nothing beats a real room sound if it fits the performance & song.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860227190457106452",
    "author": "chadwahlbrink",
    "date": "2021-07-01",
    "content": "I would be very curious to hear the unfuck guys' chat tube traps! I keep seeing Jon’s in pics and curious to hear his thoughts as well.\n\nThey have been great for me. I scored my whole set in 2 batches (16 tubes, 3 speaker stands) for roughly $4500 total - which is still pricey but a great “deal.” Also, they make my Apartment’s basement bedroom usable. \n\nThey lock you into a very specific aesthetic and ergonomic setup, which I have found interesting to navigate (placing a desk, can’t adjust speaker height, etc.).\n\nThey also sound great for tracking! I have used them while tracking drums, harp, vocals, and other things with excellent results.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "863225619315818546",
    "author": "peterlabberton",
    "date": "2021-07-09",
    "content": "Totally valid. My number one priority is the best possible mix room, followed closely by just a great vibe and an open feeling space. I thiiiink the way I have it arranged is maybe the only way to go without putting the mix position in a corner or covering the fireplace/doors/windows on the left with loads of treatment, which would be a real drag vibe-wise. I may try swapping the couch and drums if it seems it can fit well like that when I get in there, so thank you all!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "871762948140466177",
    "author": "aemaury",
    "date": "2021-08-02",
    "content": "they're expensive, but are built beautifully and  require little-to-no acoustics knowledge to get the benefits",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "885354512305496094",
    "author": "peterlabberton",
    "date": "2021-09-08",
    "content": "Love ‘em! To me they have a real 44 vibe. Suuuper rich low end, quite dark, but brighten up nicely. Just mixed a record where I engineered the vocals as well—we did two sessions, one with a Wunder 47 and a Stager, and the other with my Chandler TG and a Stager. We ended up going with the Stager for at least half the album. Great on overheads, I rarely use the close mics on toms.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "905242975058165820",
    "author": "h3x",
    "date": "2021-11-02",
    "content": "Yo! Anyone got cool lighting suggestions? Building a studio soon and want a vibey setup thats not just oversaturated rgb. I def want a balance between neutral and colored",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "905247761803386900",
    "author": "h3x",
    "date": "2021-11-02",
    "content": "Ayy thats dope. Ill have to find some good fixtures or lamps to house the bulbs. Love that idea tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "909035841874194494",
    "author": "Keyron",
    "date": "2021-11-13",
    "content": "guys is this actually jon's studio? cause I'M IN LOVE WITH IT.... i'm more for the open space vibe, and the fresh air and the light, THAT LIGHT!!! wow chapeau",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "921087094166794360",
    "author": "Maxim",
    "date": "2021-12-16",
    "content": "Initially, I wanted it to be a more production/writing orientated space where \"sound\" is 2nd priority after workflow & vibe. But I don't trust what the speakers are telling me which makes critical mix decisions impossible. We have 32 very thick panels in the room. Most you see on the pictures minus the full cloud and treatment at the back.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "942313486464188426",
    "author": "Shadowherb",
    "date": "2022-02-12",
    "content": "from the research I've done, the whole \"acoustic fabric\" thing is snakeoil, all that matters is that the weave is loose enough that air passes through the membrane so it can interact with the absorption material behind it. when I built 12+ panels for my home studio I just went to the Walmart fabric section and did a \"breath test\", putting my hand behind the fabric and seeing if I could feel my breath through it. I think my panels work great and I payed $3-5/yd as opposed to some of the insane prices you find for fabric specifically designed for acoustic panels. aesthetics are obviously a factor, but those are my 2 cents!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "955295725879709726",
    "author": "herbie",
    "date": "2022-03-20",
    "content": "comparable to stands that are filled with stands like this?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "955298820613345310",
    "author": "Rollmottle",
    "date": "2022-03-20",
    "content": "I look at cinder blocks as something you use more when you're tight on cash and can hang with the aesthetic and ergonomics of dealing with moving giant cement blocks into position lol. If you already have something like these, I don't think I'd be too worried about it until you're making a bigger move in the studio.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "955393556326019072",
    "author": "herbie",
    "date": "2022-03-21",
    "content": "@Rollmottle right on! yeah i’ve got the ultimate support ms-90s at the moment and they’re pretty solid with the decoupling. took a look on home depot and didn’t realize how cheap cinderblocks are. actually kinda wish i went with the cinderblocks to save some money and i like the aesthetic of them haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "959884923043459183",
    "author": "oaklandmatt",
    "date": "2022-04-02",
    "content": "right now it's just the audio Technica ATM 50s or whatever they're called. About to go through the old thread on here about headphones and buy some new ones though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "960189521503346769",
    "author": "Maxim",
    "date": "2022-04-03",
    "content": "I’d wholeheartedly recommend the Focal Clear MG. Out of the box they were my favorite in the 1-1.5k price range. I tested the HEDDs, Airpod Max, Audeze LCD-X and own the M50s and HD650s. \n\nI was looking for the headphone that gave me the best assortment of detail, fun, space, and „translation“ to speakers out of the box (without extra eq or another amp to power it outside of my UAD interface). \n\nFor my taste the Focals fit that perfectly. Even hooked up to my laptop directly the sound was extremely fun, detailed and useful in making decisions. \n\nAlso the look, comfort, travel case and extra pads are a nice touch. Only negative for me was the cable being a bit too short in a recording/moving around in a studio setting. But I wouldn’t use them for that anyways. \n\nAirPod Max (with noise canceling) would probably be second. They just lack the finer details and deep bass for me. \n\nThen the LCD-x (they are technically better than the Airpods but I wouldn’t prefer the LCDs in a real world setting. Only in the studio with some eq added).\n\nHEDDs I so heavily disliked it wasn’t even funny. The UAD Interface can’t power them properly and they just sounded like a crappy and weird set of nearfield speakers playing from either side of your ear. Can’t even explain it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982047940686278666",
    "author": "ehutton21",
    "date": "2022-06-02",
    "content": "we’re all fresh outta college, so i’m thinking the aesthetic approach is just gonna be “cover with grey fabric, hope no one sees imperfections”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982289849849610281",
    "author": "Will Melones",
    "date": "2022-06-03",
    "content": "Has anyone made tuned membrane absorbers? I’ve googled about for some simple direction, but it all seems over my head—as it should be. I’m particularly curious about how one would calculate the dimensions to target a specific frequency.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "982702198926508062",
    "author": "peterlabberton",
    "date": "2022-06-04",
    "content": "This is the kind of nerdy tweaky shit I think this discord will appreciate: got my lil S1 control surface a few days ago, and used setting it up as an excuse to also play around with the arrangement of my tiny desk, and add some EQ to my monitors.\n\nTried the S1 behind my keyboard (too deep and potential for more reflections), and off to my left (weird neck craning all day), and landed here for now. Then busted out a mirror and angled my desk to avoid any reflections from the monitors at the listening position. Shot the room again and popped this EQ on the output in UAD Console (it’s finally good for something!!), and am very pleased with the new arrangement. 🎉\n\nRuairi might have a fit with this EQ curve, but I’m ABing it in and out and it’s definitely helpful, until I get my act together and build some membranes!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "985370093812863057",
    "author": "Josh Bowman",
    "date": "2022-06-11",
    "content": "I should just soffit mount it in glass and then I’d get 15k. But seriously should I paint it white or black. Or like….. neon green/something totally out there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001566053815550042",
    "author": "Chris Doms",
    "date": "2022-07-26",
    "content": "Nice, I have a cloud and panels to the side of me but I don’t have any behind me at the moment. That’s a cool bit of knowledge",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001856978081034321",
    "author": "Eric Martin",
    "date": "2022-07-27",
    "content": "if the legs are hollow, they could be filled with sand.\n\nI know everyone is talking about transparent desks, small desks, and the like. I just got a pretty big sterling plan a and it’s more transparent than my previous desk by a long shot. Not cheap, but from a workflow and gear organization standpoint in my circumstances it made a huge difference and was 100% worth the 0% financing for 48 months (especially in this economy)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1003846470040035348",
    "author": "NoahNeedleman",
    "date": "2022-08-01",
    "content": "The Downlighting in the cloud would have me feeling like Uncle Fester, but honestly that room is set up so much like mine… minus about $50k in outboard, plus about $15k in acoustic guitars 🤪 @BatMeckley would never say it to you, but I’ll say it for him: Big Boy Shit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1016734012896718958",
    "author": "P.K. Stephan",
    "date": "2022-09-06",
    "content": "Yeah I agree. I used Philips Hue in all rooms. It is a big convenience especially for singers who like all lights dim or in a certain mood. Plus the dimming on the Philips Hue doesn’t make noise like some traditional dimmers due.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1016735027318509629",
    "author": "ALXCPH",
    "date": "2022-09-06",
    "content": "There more you know… didnt know about dimmers making more noise when being LED. I also Got Philips hue in 2 of the rooms i work out of. They are pricey but worth it. Doesnt Ikea also make like a cheaper alternative?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1016735510661705821",
    "author": "Rollmottle",
    "date": "2022-09-06",
    "content": "Search for refurb deals on Hue stuff...that's what all mine are.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028795442529566760",
    "author": "Nomograph Mastering",
    "date": "2022-10-09",
    "content": "Alright one more thread, the treatment behind your black fabric…is it mounted or just piled up?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028806000448393297",
    "author": "ALXCPH",
    "date": "2022-10-09",
    "content": "A lot of the time at a place called, STC studio in copenhagen. Also been working a lot out of nansensgade studierne, and deltalab(just closed down sadly. was a legendary place.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031031763658608652",
    "author": "David Fuller",
    "date": "2022-10-15",
    "content": "I like having my screen angled back super hard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035388726748139610",
    "author": "cian riordan",
    "date": "2022-10-27",
    "content": "So here’s the roundup on my dumb drum thing. This is a scrappy little experiment on my part to see if I can get a convincing drum sound in my little drum room. Before starting this, I had the idea in my mind that if a room is good for mixing, it must be good for recording! *Insert Game Show Buzzer* I ran into many of the things I didn’t like about the Barefoot Studio B Live room — and those things were exaggerated by a factor of 10. First of all, my room is very dead by design. It treats me great in mixing, but made for a real challenge when trying to get *some* sort of drum personality. I was also working with a pretty shitty old premier kit that hadn’t seen the light of day in half a decade. Shitty cymbals, very quickly tuned heads — I wasn’t setting myself up for success… but whatever.\n\nThe setup was a little ridiculous (minus a few utilitarian pieces):\nKick: Beta 52 -> Scully 280\nSnare: SM57 -> Scully 280\nOH Mono: Coles 4038 -> Ampex 351 -> 1176 (not compressing, just to trim gain before ‘tools)\nOH L/R: U67s -> UTA pre (thanks Matt!)\nKick Room: U47 -> UTA Pre (again…)\n\nThis is where I ended up, without mixing, and with some quick playing and utility EQ/balancing. No compression except a limiter to bring up the level. While the actual drums themselves don’t sound amazing, I really struggled with getting any sort of energy out of the drums… it all just got sucked out. \n\nHere are the results if you care (don’t judge my shitty playing)\n\nI think if it do this again I would:\n1) Have a better sounding kit. Turns out, shit in.. shit out. I knew this. We all know this. But here I am.\n2) Maybe put some sheets of plywood around to create some surface in the room. Just give it some life.\n3) Not use the Scully. It’s so hard to get them to not sound distorty… I just don’t have enough pres on hand to have clean path for everything. Mix studio living.\n\nSo it goes…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035393463019118592",
    "author": "Rollmottle",
    "date": "2022-10-27",
    "content": "this sounds good enough to me to use in some vibey shit...almost sounds gated.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040330732314308648",
    "author": "mixedbywong_my",
    "date": "2022-11-10",
    "content": "Think it’s called the POD farm or something . The bean pod even now does sounds better than NI Guitar Rig imho.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1040749783767326811",
    "author": "JakeTB",
    "date": "2022-11-11",
    "content": "This makes sense to my brain, but I’m not the most knowledgeable to know how to filter acoustics information.\n\nIs this something you heard from a trusted source, something you found after listening tests, or another method?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047283631405678642",
    "author": "Zakhiggins",
    "date": "2022-11-29",
    "content": "Damn I always thought I might be crazy for hating dynamic mics on drums. U87 as your only kick mic is a vibe imo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047386052605775985",
    "author": "NoahNeedleman",
    "date": "2022-11-29",
    "content": "Takes a few episodes to catch the vibe, then once you suss it it’s either a pipeline right to the feels, or what Cian said.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047551096618487950",
    "author": "popaganda.",
    "date": "2022-11-30",
    "content": "That show is such a fuckin vibe….hate waiting every week",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1049430445944750180",
    "author": "Rollmottle",
    "date": "2022-12-05",
    "content": "probably got jammed up against the edge of some metal divider while a bunch of bags behind it pummeled it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1054496299229130782",
    "author": "NoahNeedleman",
    "date": "2022-12-19",
    "content": "Chris Kimmerer, touring drummer / band leader for Thomas Rhett and great session guy. His studio is called The Owl",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061374512010100737",
    "author": "ALXCPH",
    "date": "2023-01-07",
    "content": "But can be a Vibe maker tho if you get a cool one!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061387345527586856",
    "author": "Zack Hames",
    "date": "2023-01-07",
    "content": "How do you address this when you need shit on either side of you? (Racks, keyboards, amps, etc). \n\nI see a lot of the unfuck rooms and they've got these massive gobos on either side of the mix position, but then the rooms are super super minimal mix or mastering rooms (or the photos show that).\n\nDo you put the panels as far as you can get away with and then put the stuff in front of them? Do they need to be straight or can they be angled or is that worthless? (Rauri, if this falls under your teach a man to fish/wanting a fish category, feel free to tell me to (un)fuck off)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061387684494442606",
    "author": "Zack Hames",
    "date": "2023-01-07",
    "content": "Cool. I've seen the low angled racks, those are suuuuper cool. So could you have the gobos relatively  \"FAR\" since they're pretty big/thick/deep?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061716146857988148",
    "author": "Deleted User",
    "date": "2023-01-08",
    "content": "On one hand the general good discussion to start in advance would be \"is there any aesthetic requirements that you are looking for?\", but on the other hand, it's kind of hard to expect what they are going to be asking for on the day of as they are figuring things out that day.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064970164631785573",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "I love the things above….and these are great too for wrangling a bunch of longer runs together!\n\n25ft - 3/4 inch PET Expandable Braided Sleeving – Black – Alex Tech braided cable sleeve https://a.co/d/eeWpwe3\n\nYou can see in the photo…each of the “larger” black cables running from my speakers and desk actually has 6-9 cables in it corralled by those sleeves…also easy to access cables if you need to move them around",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064990483664875561",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "I have a Hilo goes AES to speakers and as my send/capture for the Massive Passive...you can't see it here but there is a rack under the screen where it sits. I have a side car off the side (the walls look pretty tight but they are actually the unf*ck mass loaded vinyl L things, so the room opens up more behind them). The sidecar is back from those...its got a apogee symphony taking the ins for my synths (also not really pictured -- just hangarounds from my production days for the fun of it sometimes), Hazelrigg VLC in there too.\n\nThere is sorta a whole room behind the listening position...its 30 feet long with a floating wall for absorption about 15 feet in so the studio is like 13x15 but acoustically its larger if that makes sense.\n\nI do use streamdeck...but mainly to switch quickly between the hot ref in Wavelab and my master. I've gotten deep into Applescript which essentially handles all of the other Wavelab processes...it's almost finished but my streamdeck will essentially just launch those applications to do what I need. So I'd say it's very useful, but the coding I've been able to do will render it sorta meaningless for me (though convienent, I use it for other things like navigating websites when doing client outreach, etc which is very handy and makes my workflow like an order of magnitude quicker).\n\nChair is hag capisco. I love it. Had a serious back injury when I was younger so I'm pretty dialed into having things be ergonomic and I find it's great. Actually kinda rather uncomfortable...in a good way. You can't really slouch. Took some getting used to but it's interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064991864916279357",
    "author": "ALXCPH",
    "date": "2023-01-17",
    "content": "Thanks for the detailed response. Appreciate it. \n\nCan’t wait to see how you get your tiny desk going. I recent went tiny desk(damn this discord) and while I actually hear a difference, getting it to look clean with all the cables and such has been a bit of a hassle! If you are staying with the same rack behind your screen screen system would you mind taking a picture from a different angle so that it’s visible? What kind of rack is it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064993488908845076",
    "author": "masteredbyjack",
    "date": "2023-01-17",
    "content": "It’s a basement haha but believe it or not the one window does make a difference…that photo is from my last place which was amazing aesthetically to me but acoustically awful…the downgrade in windows is definitely worth the upgrade in monitoring",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065120171724918846",
    "author": "Will Melones",
    "date": "2023-01-17",
    "content": "It’s a cheap therapy lamp. I think the company is called Taotronics.\n\nThis guy: https://www.taotronics.com/products/tt-cl011-light-therapy-lamp",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1065699903596138567",
    "author": "ehutton21",
    "date": "2023-01-19",
    "content": "Got an alarmclock that does the led simulation for a wake up. So helpful.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067854801192353842",
    "author": "masteredbyjack",
    "date": "2023-01-25",
    "content": "Certainly! In the next week or so I'm going to have mine pretty dialed. We should chat more about it. It's been super helpful because I can operate so much more on just handling the artistic decisions rather than the business stuff (not that it's a lot of work, but I find navigating file structures and clicking annoying).\n\nJust realized Wavelab can be scripted too (though I don't think it's as deep as Reaper)!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1067913221354307634",
    "author": "popaganda.",
    "date": "2023-01-25",
    "content": "Cool, not looking for an unequivocal recommendation, just wondering the vibe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068049354960670740",
    "author": "hyanrarvey",
    "date": "2023-01-25",
    "content": "Nah whole different vibe but those c100’s are so rad",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068058361498701824",
    "author": "BatMeckley",
    "date": "2023-01-25",
    "content": "It’s why I got my Josephson c705. It’s pretty close to that vibe. \n\nDoug used them on guitar amps and anyone who worked with him bought like 3, and there’s not a ton around.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068195197034438778",
    "author": "jantrit",
    "date": "2023-01-26",
    "content": "There’s also a peluso version modelled on the brass cap that sounds phenomenal and only about 1100 each!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068905265698709614",
    "author": "Adam Thein",
    "date": "2023-01-28",
    "content": "Whoa that keyboard cover - is that labeled for PT shortcuts?  I need that!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1069088889895133324",
    "author": "tomtom",
    "date": "2023-01-28",
    "content": "You should get a range hood installed in it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1077068487266160693",
    "author": "ehutton21",
    "date": "2023-02-19",
    "content": "Or is that just a matter of preference/vibe/aesthetic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082393153941811261",
    "author": "CK",
    "date": "2023-03-06",
    "content": "it does.  but it is not pleasant to work in aesthetically.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082418846977233037",
    "author": "sethearnest",
    "date": "2023-03-06",
    "content": "Yeah, spray from might as well be air from what I could tell. I basicaly installed a 10'x12'x9\" pink fluffy cloud over my mix position.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085914572902383646",
    "author": "Will Melones",
    "date": "2023-03-16",
    "content": "It took me waaaay too long to figure out the angles when I decided to get OCD about this for the first time ever this year. I ended up folding a little triangular piece of paper to use as a template against the wall.\n\nI also took some long twine, taped it to the back of the base of each stand, and stretched it out to a location just behind the sweet spot. Figured if the twine landed at the center of the front of the stand, they were angled symmetrically at that spot. But then I didn’t have a protractor or a laser handy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086027476267958302",
    "author": "ALXCPH",
    "date": "2023-03-16",
    "content": "Ofc. I have countless times been in sessions, where I’ve had to record something with a different producer, and I’ll want to do another take that’s just a little bit cleaner or better, and everyone else will be like “it’s fine, it’s great” but my ear still thinks it can be better. And I’ll get teased with being a perfectionist. But then when I do just listen and let it go, I’ll listen back a couple days later and realise, it was perfect for what it was, and the details I would hyper focus on, just gave the performance character or vibe and actually sound better than if I played it like a robot.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086036344649822248",
    "author": "Deleted User",
    "date": "2023-03-16",
    "content": "re: trig. I just used my eyes and ears to calibrate my speakers. My room’s asymmetrical anyways, so just made sure it looks evenly angled and checked if the low end feels like it’s as close to center as possible",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086038446923063306",
    "author": "ALXCPH",
    "date": "2023-03-16",
    "content": "I remember Jon talking on a talk where he said the producers had burried all the finger and string noise on a guitar or bass, and one of the first things he did was bring it up, because it just made things more vibey for the song. Making those decisions of pretty vs ugly is tough.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088212598245314560",
    "author": "Zack Hames",
    "date": "2023-03-22",
    "content": "@LAPhill yep, it's called the Kansas City curse. it's so easy to live here no one leaves. It also means people don't go as hard as they could in their artistic endeavors.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088737074225614899",
    "author": "ehutton21",
    "date": "2023-03-24",
    "content": "Only drilled into two spots where I was like “oh well that seems like electrical”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088982184733458442",
    "author": "ehutton21",
    "date": "2023-03-24",
    "content": "4 sides of burgundy seemed intense/bold and we have a nice little grey couch and grey/white carpet so, brown panels made sense, but the chocolate already have a reddish hue, and I think my brain must have gone “oh yeah that’s like red wine” and clicked burgundy without paying much mind to the screen.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091263749345792001",
    "author": "Zakhiggins",
    "date": "2023-03-31",
    "content": "I actually went to a pub called Riordans 🤪\nBack in Dublin now, but will actually give you a shout for recs next time I'm up in Cork",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091402696650666004",
    "author": "BatMeckley",
    "date": "2023-03-31",
    "content": "The pmc’s sound really great in there now. Very impressed with the magic. The room significantly better than the first time I heard it, and it was good the first time. Sounds like the PMC 6-2 just fundamentally have a “impress the guitar center kids” high lift that anybody serious immediately shelves out of them. (Though I’m not sure how everybody missed the noise the track lighting makes.)\n\nI REALLY wanted to see the adjustments you made to the speakers but the cat 5 cabling was screwed up at the time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091424766948282450",
    "author": "Rollmottle",
    "date": "2023-03-31",
    "content": "you guys filled the floor or something, right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093652799264391258",
    "author": "Edward Rivera",
    "date": "2023-04-06",
    "content": "Right ? One of my dream studio aesthetics. Always loved Fairfax (former sound city) for going with that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094041280989909123",
    "author": "Gerhard Westphalen",
    "date": "2023-04-07",
    "content": "No they failed to put in a proper crossover",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094414151377485884",
    "author": "Zack Hames",
    "date": "2023-04-08",
    "content": "@hyanrarvey going to try to commandeer it somewhat haha. I’m gonna try to drive the ship on the vibe, hopefully pick out some monitors etc. But it’ll be for everyone at the studio.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094414452004241458",
    "author": "Zack Hames",
    "date": "2023-04-08",
    "content": "Excited to get the new live room made, going to be cool. We are going to try for a more relaxed vibe in this space. The studio A is very “posh” and professional, hoping to make this space more vibey.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094598732772802570",
    "author": "Andy Lawson",
    "date": "2023-04-09",
    "content": "Thanks. I really enjoy the vibe. Super chill and safe place to go deep!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094729214906863668",
    "author": "Gerhard Westphalen",
    "date": "2023-04-09",
    "content": "No it's a very specific design with subs at the front and back wall where supposedly it gets cancelled and you don't get the reflection",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1099826763032436756",
    "author": "Deleted User",
    "date": "2023-04-23",
    "content": "Lol I mean we still can make it happen, we got a projector installed there. You’ll never get a better sounding porn experience",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104835074446336011",
    "author": "Andy Lawson",
    "date": "2023-05-07",
    "content": "So my client cancelled on Friday with Covid  I just threw myself into it! Stage 1 complete (of 4)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105426427576340502",
    "author": "Sean Rogan",
    "date": "2023-05-09",
    "content": "hello studio people ! was wondering if anyone had any thoughts / guidance. have been shifting around my bedroom studio, but my room is an annoying shape with a window in an alcove out of the wall. my desk is currently there as its the only one i can fit the desk that also has a flat wall behind it that i can put treatment on. worth pointing out in general this is more of a prod / writing space than a mixing space. anyone have any thoughts on treatment ? got lots of homemade 4 inch baffles, though my main concern is am i fighting a losing battle with the speakers against an angled window ?",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1105574020591665172",
    "author": "Ross Fortune",
    "date": "2023-05-09",
    "content": "It still sounds fucking mental in there. I made 8 beats over the long weekend for a dance pop writing sesh today, and the low end was fucked in all of them when I got to the studio to check 😂\n\nBut it’s so nice to vibe, so swings n roundabouts",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1105576923851145327",
    "author": "Rollmottle",
    "date": "2023-05-09",
    "content": "I think basic first principles still apply. Cloud, first reflections and back wall. I don't think you're screwed up against the window too much except for having to deal with the first reflections on either side of your speakers and therefore would have to obscure some of the windows. If it's less a critical listening space and more a creative space, then trying to control the room overall would be how i would approach it. i would still get a solid listening position nailed first.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106721682095358024",
    "author": "Nomograph Mastering",
    "date": "2023-05-12",
    "content": "I can say confidently that @Gerhard Westphalen is the only guy I could recommend here. And I say that knowing that he and i see and hear a lot of things differently. But he’s super affordable, cares a lot and has great technical knowledge",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106723066807062548",
    "author": "Nomograph Mastering",
    "date": "2023-05-12",
    "content": "Let me say one thing to preempt responses that I know are coming. For everyone who rolled a double 6 and lucked out with a random setup I know 10 who didn’t, and for whom it caused a lot of heartbreak. Be careful about taking advice from people with outlier luck",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106725854588969192",
    "author": "NoahNeedleman",
    "date": "2023-05-12",
    "content": "Also sorry if I derailed an important conversation. #",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1106784262176383036",
    "author": "Andy Lawson",
    "date": "2023-05-12",
    "content": "Yeah works really well. Can create a vibe of it being in a world of your own with the doors closed or just open the door and breath in that not city air",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107453438461214750",
    "author": "shaunobi",
    "date": "2023-05-14",
    "content": "When I mix on headphones I use LCD-X’s (newer gen, light EQ curve correction) or Sonarworks custom profiled HD650’s. Both sound good, though pretty different. Can mix bass on both.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107521953834737698",
    "author": "jantrit",
    "date": "2023-05-14",
    "content": "😂😂😂 yess indeed, at the time in the bigger room it was my solution to get something not permanent  to solve my pretty poor monitoring solution (given the rental spot) it certainly absolutely nailed that, mixes are translating wonderfully and I’m stoked on the results. If I were to do it again now I might do it a little differently. Also now there’s a hole in the wall so that whole non permanent thing is starting to go out the window. Ha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1108935898869018634",
    "author": "Andy Lawson",
    "date": "2023-05-18",
    "content": "also just opened up the top air hatch in the studio, the left half is semi filled with stuff and the right side has nothing (no idea what i was doing) should i completly fill these up? then i just used the old framaing to quickly try out some side panels a quick experiment.. seems to tighten the space once again, but not really sure where i should be placing them tbh @Gerhard Westphalen",
    "reactions": 0,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1109211170038108193",
    "author": "Gerhard Westphalen",
    "date": "2023-05-19",
    "content": "Oh and it’s filled with sand so nice and dead and won’t tip over",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109293399024091198",
    "author": "peterlabberton",
    "date": "2023-05-19",
    "content": "But I never installed that silly side thingy at the bottom",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110427789359853620",
    "author": "Nomograph Mastering",
    "date": "2023-05-22",
    "content": "We've done 3 or 4 rooms with 8 foot ceiling and filled joists and the results are acceptable, if you can live with the isolation trade off",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110430906155536396",
    "author": "Johnny I",
    "date": "2023-05-22",
    "content": "I like this idea; for my present circumstances this could work. And the membranes, if I recall reading on here, that’s for the rear wall? \n\nAlso, I wasn’t sure how having the “den/mix room” open to the long corridor would affect the sound. Am I incorrect to assume that helps the low end as it disperses vs if the room was sealed off on both sides?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112189673641619597",
    "author": "LAPhill",
    "date": "2023-05-27",
    "content": "Many composers choose to work with what's called \"articulation per track.\" As in, violins long, violins short, violins pizz, violins trem, etc. etc. etc., so it adds up quickly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112189900901593231",
    "author": "Rollmottle",
    "date": "2023-05-27",
    "content": "So basically every possible sampled articulation of an orchestra ready to go?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114232833876177027",
    "author": "chrissorem",
    "date": "2023-06-02",
    "content": "Logan ripped yesterday! We had a pretty complex setup and all the assistants killed it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114406532533207110",
    "author": "chrissorem",
    "date": "2023-06-02",
    "content": "Nice! I just got yelled at by the union 33 council",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116525293599981618",
    "author": "shaunobi",
    "date": "2023-06-08",
    "content": "I picked some up cheap from audiophiles in Lake Oswego and tried them. They absorb sound it's true. Not a fan of the so-called \"quick sound field\".",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116531160353341481",
    "author": "jantrit",
    "date": "2023-06-08",
    "content": "Thanks man! It was a ton of fun and it does always shock people haha @hyanrarvey  you’re too kind. @popaganda.  and the crew also brought some great feels and vibes!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1122987983994355712",
    "author": "Rollmottle",
    "date": "2023-06-26",
    "content": "the netting is stapled in place to the wood frame and the wall",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129454143438848063",
    "author": "Adam Thein",
    "date": "2023-07-14",
    "content": "Inspiring cleanliness - I think mines going to look more \"rat's nest\" aesthetic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1129482429112004691",
    "author": "Slow Hand",
    "date": "2023-07-14",
    "content": "Deep within me the distant muffled screams of a stage manager can be heard.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132848465664299059",
    "author": "Rollmottle",
    "date": "2023-07-23",
    "content": "Just dialed up the MacOS old fogey sizing. Better than the eye chart I had going.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132849720801374228",
    "author": "Rollmottle",
    "date": "2023-07-23",
    "content": "The LG OLED discussion from the other day was of interest",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132849886115672116",
    "author": "Bryan DiMaio",
    "date": "2023-07-23",
    "content": "The OLED thing is cool but still difficult to use as a computer monitor due to the auto dimming",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132851228641079398",
    "author": "Bryan DiMaio",
    "date": "2023-07-23",
    "content": "https://www.bestbuy.com/site/lg-ultragear-48-oled-4k-uhd-g-sync-compatible-and-amd-freesync-gaming-monitor-with-hdr-displayport-hdmi-usb-black/6510480.p?skuId=6510480\n\nA little on the pricier side but this is a monitor, not a TV so has DisplayPort and is an OLED",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132853429509820478",
    "author": "Bryan DiMaio",
    "date": "2023-07-23",
    "content": "this one isn't OLED but still would be a good monitor: https://www.bestbuy.com/site/samsung-odyssey-neo-g7-43-mini-led-4k-uhd-1ms-amd-freesync-premium-pro-smart-gaming-monitor-with-hdr600/6529218.p?skuId=6529218",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132854328038797343",
    "author": "Rollmottle",
    "date": "2023-07-23",
    "content": "What’s the topline on Mini LED? New term since I was last in market.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1132857308016287784",
    "author": "Bryan DiMaio",
    "date": "2023-07-23",
    "content": "So any time you see the Samsung \"Neo QLED\" branding, that's miniLED",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141102125196267651",
    "author": "Zack Hames",
    "date": "2023-08-15",
    "content": "Depends on the timbre of voice - there’s less resonance IN the room at around 120-150hz so when I have male *clears throat* “clients” they are a little more controlled sounding. \n\nShe won’t come down because of the smell though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1141848429337780364",
    "author": "Iwan Morgan",
    "date": "2023-08-17",
    "content": "I dig it all, but especially the stereo lighting. PS what’s the small console to the side?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151357895695421460",
    "author": "Eric Martin",
    "date": "2023-09-12",
    "content": "my phone was in a magnetically sealed neoprene bag the entire time I was there 😆",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153076112235188264",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-17",
    "content": "Did you find some mics controlled resonances better? On my voice for example the U87 AI ”blows up” in the 500-750 range and intensifies my resonances there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1158544316508164147",
    "author": "Zack Hames",
    "date": "2023-10-02",
    "content": "Are you destroying one of the top snare mics? And what are you using the crotch mic for? Just vibe?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1163220933935366286",
    "author": "NoahNeedleman",
    "date": "2023-10-15",
    "content": "Actually a vibey piece I think. Looks good, sounds good enough.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164593264226214010",
    "author": "BatMeckley",
    "date": "2023-10-19",
    "content": "There’s a kickass preset on that 91 called something like “thunder drums” that was my go to on toms for years.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1164926360070922311",
    "author": "kidcutler",
    "date": "2023-10-20",
    "content": "That’s what my parents called my mpc 2000 📠",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1166507548170522664",
    "author": "LAPhill",
    "date": "2023-10-24",
    "content": "For those with writing/production setups - Share your space saving tips! I'm currently grappling with the fact that I have too much shit, and I want it all within arms reach, ideally plugged in and ready to go. For awhile, I had it pretty dialed in....but then I got more gear.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167899501051248770",
    "author": "hyanrarvey",
    "date": "2023-10-28",
    "content": "Omg the adl presonus boxes fucking ruled",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167953309986992199",
    "author": "kidcutler",
    "date": "2023-10-28",
    "content": "My cousin was in a group called Rockapella and they were sponsored by them and had the whole line, I thought if it’s good enough for them! Grabbing another one soon, incredible value",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171496233228050573",
    "author": "Eric Martin",
    "date": "2023-11-07",
    "content": "through the phone the caret looks like it’s grey- but on the brown side of grey and not the blue side, that could be my device’s color calibration and lighting but matching that might be challenging",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171496585725747261",
    "author": "Joshua Riley",
    "date": "2023-11-07",
    "content": "But yeah very hard to judge with different screens and lighting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171663182520143973",
    "author": "masteredbyjack",
    "date": "2023-11-07",
    "content": "The aesthetic of your spot is awesome, new desk looks sweet!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171876233416552539",
    "author": "NoahNeedleman",
    "date": "2023-11-08",
    "content": "It’s so wild when you start to get things really dialed, issues you never realized were there become glaring.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172191268084916335",
    "author": "Zack Hames",
    "date": "2023-11-09",
    "content": "Hey All, Question about studio doors:\n\nI desperately need to install some doors for *some* form of sound isolation. I know there's a lot more that goes into it than just doors, my room is literally concrete so the doors are by and large the weakest link.\n\nI have the ability to do double doors with an air gap. Does anyone have recommendations that aren't incredibly expensive for doors or types of doors i should use for this? I am planning exterior door so it's all sealed with weatherstripping and the Threshold, etc. \n\nAre basic exterior Fiberglass doors, if doubled with an airlock / gap, enough to be decent? I'd love to not spend thousands and thousands on doors.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172212405368000584",
    "author": "Zack Hames",
    "date": "2023-11-09",
    "content": "@NoahNeedleman  @Nomograph Mastering  this is where my head is at. The studio I work at has great isolation and they don't use 400 pound doors. I literally have hollow doors with like inches of  gap beneath, anything is going to be a drastic improvement.\n\n@LAPhill I'll see if I can get solid core, I am simply going to use \"exterior doors\" that are ideally pre-hung so everything is sealed, threshold, weatherstripping, etc.\n\nThanks for letting me suss this out on here, I just needed to know if I was *Fucked*. If I can get some doors for less than $1000 and there's an improvement i'll be happy. I can get make believe 9k doors later.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1173845840398393355",
    "author": "NoahNeedleman",
    "date": "2023-11-13",
    "content": "The real question tho- how many esses/resonances was it that finally killed him?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1176201930851242074",
    "author": "NoahNeedleman",
    "date": "2023-11-20",
    "content": "Get the room dialed so you can actually hear your speakers. Then discuss the merits of said speakers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1176204831669633094",
    "author": "Bryan DiMaio",
    "date": "2023-11-20",
    "content": "I’d rather work in that room than a Neumann room with no vibe and not properly dialed in, I’m all on board haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1178837055820791818",
    "author": "NoahNeedleman",
    "date": "2023-11-27",
    "content": "Pulled the aux guitars outta the stand to vacuum and they just looked real pretty",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182758388954837132",
    "author": "youngteam",
    "date": "2023-12-08",
    "content": "this was apparently the sigur ros studio for a bit. makes the nature vibe make that much more sense",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187443723928359013",
    "author": "chrissorem",
    "date": "2023-12-21",
    "content": "I used to work at this crazy m ha church called the Crystal cathedral",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191954402903339098",
    "author": "chris_donlin",
    "date": "2024-01-02",
    "content": "Sweet I’ll try that soon! I had just thrown my TG up as a front of kit/ kick length mic so I was curious but definitely just different vibes. Over the kick will be great for the other song on the session tomorrow though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1192256607233511535",
    "author": "Nomograph Mastering",
    "date": "2024-01-03",
    "content": "Although I tooled around with a bunch of older stuff my brother had",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1192282332690919484",
    "author": "hyanrarvey",
    "date": "2024-01-03",
    "content": "When I was at iiwi I got to use the la2a on the rca77 full dimed on both sends and it was such a cool vibe especially with that giant room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194145064713211924",
    "author": "cian riordan",
    "date": "2024-01-08",
    "content": "Blue light, pop studio on the streets, lava-lamp LFG vibes in the sheets.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1198612124574945320",
    "author": "rse",
    "date": "2024-01-21",
    "content": "alright I'm just gonna ask this here; I watch a lot of youtube videos and movies in bed and want to upgrade that experience a bit. I have a pair of old monitors laying around (tannoy reveal 5a) and want to get some sort of not very permenant way to add these to my bedframe I guess? I was looking into those monitor stands that have those clip-on/screw-on things to attach them to a desk, but those clips are all made for desks and tables, so horizontal planks. For my bedframe they would need to be angled down, since the planks are vertical. Is there any product out there or anything I could piece together to make this work?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1209875394971435018",
    "author": "esquinalee",
    "date": "2024-02-21",
    "content": "Hey ya’ll. Looking to move in with my partner and hoping to find a house with a room bigger than my current claustrophobic 12x11x8 space. Had high hopes from the rental company’s photos for a specific spot we’re scheduled to view today, but they just posted a video tour and here’s what the situation is:",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1214357711089565737",
    "author": "peterlabberton",
    "date": "2024-03-04",
    "content": "Ah I’ve got the big one and love it, curious about the lil guy as a more affordable way to get more of the same vibe… or, apparently not!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1215085307456790598",
    "author": "Garth Tim",
    "date": "2024-03-06",
    "content": "oh i see, like the handyman installed them?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1215086249128362055",
    "author": "Garth Tim",
    "date": "2024-03-06",
    "content": "i cant quite tell the scale of that pic, but the eyebolts look pretty small...what exactly failed tho? did the wire clips on the back of the panels just flex and fall out? im using pretty beefy eyebolts with i believe 16gauge steel wire wrapped and tied. the extra wire is slack in case the main wire gives out for any reason",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1217902363071746058",
    "author": "Josh",
    "date": "2024-03-14",
    "content": "I called and a Mrs. Riordan answered the phone???",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218018403030139011",
    "author": "cian riordan",
    "date": "2024-03-14",
    "content": "Give me one in a mix room that's dialed and some time to fanagle it, they're just simply wonderful. But comitting to one while tracking is... extreme. I'm not George Martin, and I don't live at Abbey Road.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1218708878343143575",
    "author": "montrose recording",
    "date": "2024-03-16",
    "content": "the air cooled racks in the control room is pretty slick tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220468699358564353",
    "author": "peterlabberton",
    "date": "2024-03-21",
    "content": "Filed firmly in the \"know how to use, have never ever thought about how they're designed/built\" category",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220505176750821396",
    "author": "LAPhill",
    "date": "2024-03-21",
    "content": "I'll say I'm firmly in the big conduit in the wall with an open hole camp. A perfectly labelled and wired patchbay is beautiful until you want to get in there and change things. About a year ago, I swapped a lot of gear between my writing room and machine room, which would have been an expensive nightmare if I couldn't just pull all sorts of different cables for v2.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221595043983527937",
    "author": "David Fuller",
    "date": "2024-03-24",
    "content": "@chrissorem @BatMeckley fwiw I noticed the same thing about the 420s, they *definitely* are midfields - they need ~5 feet to integrate right.  And yeah, ||low end is *stupid* detailed a lot like the 6-2; that might be because they both have a very low box tuning. IIRC the 420 is around 30hz, the 6-2 is around 35hz||. I hear what you mean with the ||lean in the low mids|| thing but I think that might be an illusion because there's ||basically no harmonic or intermodulation distortion of note in the low end so they don't have a bunch of extra info the next octave and a half up||.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221943497557278731",
    "author": "masteredbyjack",
    "date": "2024-03-25",
    "content": "I just love the vibes. Love them. The Alex stuff is the move, decreases stress levels so much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1221997229372604517",
    "author": "BatMeckley",
    "date": "2024-03-25",
    "content": "Honestly? Yeah. I found back before I was working in “pro” studios or had minimal inputs we’d actually do that a lot, just program the kick because a sampled kick was better than a shitty kick recorded shitty in a shitty room, and allowed for easier processing of snares and toms. (And then cymbals would often be another pass)\n\nIt requires a good drummer to get the feeling right but you gotta do what ya gotta do",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223492726922809346",
    "author": "JakeTB",
    "date": "2024-03-29",
    "content": "Definitely helped inform the decision! I think I’m going to need to adjust my target and unlearn some maladaptive things to win in the long run. \n\nEither way I’m going to wait on a decision until moving and getting my next spot as dialed as possible without the subs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1223640779860213852",
    "author": "Josh",
    "date": "2024-03-30",
    "content": "On camera it looks like you have sky lights or something. Really nailed the bulb selection there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1227085130502242324",
    "author": "Edward Rivera",
    "date": "2024-04-08",
    "content": "This might get a few scoffs, but would anyone have a recommendation for a decent, but budget friendly ergonomic chair I can grab on Amazon ?\n\nYes yes I will get my Aeron once I’m settled across the pond but I’m in a temporary space and not gonna splurge here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1228771750989271200",
    "author": "Nomograph Mastering",
    "date": "2024-04-13",
    "content": "The mopads protect the ones and zeroes getting muddled by vibration",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1229507526190563550",
    "author": "esquinalee",
    "date": "2024-04-15",
    "content": "@Adam Thein @kylem @Andy Lawson @Deleted User @hyanrarvey & All of you who’ve built your own treatment with safe n sound— what kind of fabric did you use and where did you find it? I’m currently realizing that getting the right kind of fabric will probably be important for keeping particles in and size fabric is going to dictate how big I can ultimately make panels. Been searching here for a couple hours taking notes but didn’t find this detailed. Thanks for sharing your adventures with this, it’s definitely helping me figure out what I’ll be doing with my space. y’all 🙏🏼",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1235307700745666671",
    "author": "peterlabberton",
    "date": "2024-05-01",
    "content": "Can’t answer that, but I realized I misspelled “instruments” as “insturments” yesterday, and I think I prefer the wrong way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239718949344776283",
    "author": "Maxim",
    "date": "2024-05-13",
    "content": "The only question I have is if everyone gets a gift bag filled with oranges",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244301596222029944",
    "author": "Rollmottle",
    "date": "2024-05-26",
    "content": "Not wifi per se, but all the Philips Hue stuff is pretty bullet proof and easy to use. You need one of their hubs hooked into your network but they're easy and cheap to come by.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244334943765790844",
    "author": "thegreatcarsoni",
    "date": "2024-05-26",
    "content": "I have all Hue as well, very easy to use and looks good. I have hue ceiling lights mounted into my cloud, and in my booth, as well as a light strip recessed behind the panels. Cool to make some presets and had singers in the booth the switch and they can make the vibe whatever they want",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244339395109191700",
    "author": "chris_donlin",
    "date": "2024-05-26",
    "content": "The Hue's are significantly more expensive than other options. My only desire is to be able to change the lighting colors, not turn them on/off. Hue seems like overkill for this, no?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244339852757962875",
    "author": "Nomograph Mastering",
    "date": "2024-05-26",
    "content": "I bet there are good cheap ones out there, but hue mostly just works and if you’re not buying 20 bulbs the price difference might not be worth it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244340524538925226",
    "author": "Rollmottle",
    "date": "2024-05-26",
    "content": "Hue is the best in the game for color. I have Govee’s and other cheapo ones for my son and the software is bullshit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244350473679405188",
    "author": "joshbonanno",
    "date": "2024-05-26",
    "content": "ive got cheap amazon bulbs...i think they are treatlife or lepro brand...software is pretty janky for sure but thats only really been a problem in the setup phase for me...connecting and syncing etc... once theyre sync-ed they work fine. never had issues with flickering or noise or anything...i will say though, i will most likely upgrade to hue in the future as i add more bulbs throughout the house and desire a little more robust \"home automation\" type of system.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244353009245229057",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-05-26",
    "content": "Not to make it even more expensive, but if you’re interested in filming in your space as well it might be worth looking at the Aputure Amaran stuff, it’s properly calibrated colors, won’t flicker and the app is foolproof from what I hear:\n\nhttps://amarancreators.com/collections/all?sort_by=price-ascending&filter.p.m.custom.filter_color_temperature=RGBWW",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244394586231668838",
    "author": "chrissorem",
    "date": "2024-05-26",
    "content": "I have the ones from Amazon( smart bulbs)  not hue and it’s a pain in the arse. They constantly loose connection and you have delete them app and re scan them. I’ve slowly been phasing them out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1246162359161196565",
    "author": "Nomograph Mastering",
    "date": "2024-05-31",
    "content": "How it plays will often depends on screen size and location, and how controlled the room is down in the lower mids",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247399666656481372",
    "author": "Zack Hames",
    "date": "2024-06-03",
    "content": "Has anyone gone down the rabbit hole of ways to manipulate your space to be more productive/focused? Things like lighting, wall colors, types of furniture or layout, temperature, acoustics based things, computer screen brightness, etc etc. \n\nThings that promote focus, creativity, allows for less stress/better focus. Could be literally anything",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247432903365890068",
    "author": "montrose recording",
    "date": "2024-06-03",
    "content": "i second the hue system.  being able to save scenes for my early vs mid and late parts of the day keep me feeling like its a nice space to be in and inspired to be in the room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247565284869673052",
    "author": "masteredbyjack",
    "date": "2024-06-04",
    "content": "Lots of great ideas here! I'm personally on the @Rollmottle train (also @cian riordan aesthetic is similarish)...I just agree aesthetically that I like the brighter/cleaner/warmer vibe. Of course your tastes may differ, but my lights dim like @montrose recording  said...it's really nice when it's getting later in the day to have some more dim lighting to match the outside a bit. \n\nAlso really love to keep things ultra simple visually...the least amout of things around (even cords, etc) but again that's just me. Different things inspire us all.\n\nAlso big fan of keeping the digital environment very organized, as few things open as I need. I still certainly can get distracted like the rest of us. One thing I underestimated about running a full time mastering shop is just the number of interactions per day that are needed...and that can definitely take you out of the flow so I tend to keep it very contained...say only respond at certain points of the day and generally I deliver all my files at the end of the day in one batch. I'm sure some similar type of thing can be achieved for us all no matter the process. Still a work in progress over here of course!\n\nMy final thought is that the best focus enabler I've found is just good old fashioned hard-nosed exercise. Getting up early, squatting heavy, hard sprints...taking things to the limit (safely) really allow me personally to retain a very real sense of resilience and focus. And increase and double-down on discipline -- which in turn increases motivation often for me!\n\nBest of luck! As far as I can tell, retaining focus in our current age is an eternally ongoing (and extremely valuable) skill to work on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247591662058864785",
    "author": "Zach Hughes",
    "date": "2024-06-04",
    "content": "I've been going down this rabbit hole recently. I purchased and have started using a phone lock box. Kinda hardcore. Not gonna be necessary for everyone. There's also a program called freedom (probably similar to focus app mentioned) I just got and will be experimenting with. Have a program called flux that changes the color hue of my screen as the day progresses to make it easier on the eyes. I think blue light earlier in the day and yellow ish light later in the day? Some science I don't really understand behind that. There's a huberman lab out there somewhere about it. I backlit my screen display with blue leds as well. Honestly one of the best things when I actually stick to it is trying to never sit for longer than an hour. Even just a 5 minute stand up walk around helps me immensely. Related I drink a ton of water and forces me to get up to go to the bathroom more often.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247625887524847696",
    "author": "kylem",
    "date": "2024-06-04",
    "content": "For whatever reason, I do not vibe with the 8-2’s (or the full XBD setup). Could just be the room, but I felt so disconnected the few times I’ve worked on them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1247733480725549118",
    "author": "BatMeckley",
    "date": "2024-06-04",
    "content": "There’s a few third party apps I use more than the hue one. iConnectHue being the main one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1251268422172409896",
    "author": "Deleted User",
    "date": "2024-06-14",
    "content": "Yes! Set flat. I’m also not using a monitor controller. AES to the speaker. Output controlled at the Master fader from Pro Tools. So I have nothing in between the speaker and everything is completely zeroed out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1255953155594911868",
    "author": "Adam Thein",
    "date": "2024-06-27",
    "content": "Are those the Lauten Tom mics?  Almost pulled the trigger on those recently, curious what your impressions are",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256271446187970683",
    "author": "Eric Martin",
    "date": "2024-06-28",
    "content": "installed this door last week, I now have even more Primer Grey to cover 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1260656274802999336",
    "author": "bobby k",
    "date": "2024-07-10",
    "content": "Love it. Aesthetic direction was heavily influenced by my partner who is an interior designer / visual genius so credit goes to her! Haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1260680255178276896",
    "author": "Ross Fortune",
    "date": "2024-07-10",
    "content": "Does she do remote aesthetic room tuning?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265054590093758514",
    "author": "thegreatcarsoni",
    "date": "2024-07-22",
    "content": "Still gotta put the panels above the speakers in, feel like I'm hearing some presence off the ceiling, but it's not too distracting. Then we need to put the lighting in so...little more to do this week but for now I'm back to work",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1267838861665636426",
    "author": "masteredbyjack",
    "date": "2024-07-30",
    "content": "From my experience GIK will probably lead you down the wrong route -- probably need to post some pics here to let the braintrust weigh in (I'm not a person qualified to be giving advice, but it would have been a shame if I rolled with GIK instread of unf*ck knowing what I know now)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1270069514046013460",
    "author": "Zack Hames",
    "date": "2024-08-05",
    "content": "But I’ve never been one for clean aesthetic (if you couldn’t tell)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1284638960823566447",
    "author": "Nomograph Mastering",
    "date": "2024-09-14",
    "content": "In a good room (where the LF is controlled) we can choose, but in a less treated room sometimes we just have to sit where the low end is flatter",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1288668529461301269",
    "author": "James Cronier",
    "date": "2024-09-25",
    "content": "The bigger version of those! They made a sealed enclosure 2.1 system with lots of power.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1288866874301354097",
    "author": "Bryan DiMaio",
    "date": "2024-09-26",
    "content": "used to have that when I was in burbank too, it's really a vibe. gonna find an old pic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1288869707130081280",
    "author": "Bryan DiMaio",
    "date": "2024-09-26",
    "content": "also a lamp clipped onto my desk to bias light the monitor",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293559627031642254",
    "author": "Chase H",
    "date": "2024-10-09",
    "content": "For people on the hunt for a tiny desk, idk about the build quality but I stumbled across this.\nNot stained or painted but a lot cheaper than other options.\n\nSeller told me he could make the profile at the back of the desk shorter (max height of around 33 inches).\n\nCould be a good option for someone\n\n\nhttps://www.etsy.com/listing/1682134419/trinity-desk-designs-1-bay-sidecar?ref=yr_purchases",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293996230791135322",
    "author": "Slow Hand",
    "date": "2024-10-10",
    "content": "Some vintage Squarepusher footage just dropped today and Tom's got the ring mod depth controlled via footpedal. Love this move: https://youtu.be/AqVoWXaHAm4?si=eK9JMOyY7UOg6H_u&t=380",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1302076505999806509",
    "author": "sethmanchester",
    "date": "2024-11-01",
    "content": "Thanks! Kind of a Toyota… but I love it. I run a studio in Rhode Island called Machines with Magnets, but it’s been a minute since I’ve been able to fire this guy up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1307858655877664809",
    "author": "Rollmottle",
    "date": "2024-11-17",
    "content": "This clamp\nhttps://www.amazon.com/dp/B0CTCP55Z6?ref=ppx_yo2ov_dt_b_fed_asin_title\n\nWith this ball head, which screws into the threaded 1/4\" mount on the clamp...couldn't find it without the crab clamp, but it comes right off and maybe you can find a use for the crab clamp: https://www.amazon.com/dp/B06XKVNJWG?ref=ppx_yo2ov_dt_b_fed_asin_title",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313788731882471426",
    "author": "thegreatcarsoni",
    "date": "2024-12-04",
    "content": "You wouldn’t happen to know what fabric and color is on the walls would you? I have a fabric walled booth and don’t like the red I ended up with. Been looking for an alternative.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315015363234107445",
    "author": "kylem",
    "date": "2024-12-07",
    "content": "When I built mine we stapled the top and then stood it up and walked down the sides with the staple gun.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315133249135050854",
    "author": "Chase H",
    "date": "2024-12-07",
    "content": "They are membrane absorbers, that target a specific frequency.\n\nThere’s many people here knowledgeable about acoustics that can actually go in detail on how they work, I am not one of them though.\n\nYou can search the server as well for prior convos on it.\n\nHighly suggest you hire Gerhard to design a build for you if you’re working on one though, super Reasonable pricing and insanely helpful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1316814153586839574",
    "author": "gatewoodsensei",
    "date": "2024-12-12",
    "content": "It seems extremely calming and soothing in there. Like a home-y type vibe.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1320765847307812958",
    "author": "Bryan DiMaio",
    "date": "2024-12-23",
    "content": "yeah gotten like 99% of my knowledge on the topic by googling and reading the forums",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1320774128260878417",
    "author": "Bryan DiMaio",
    "date": "2024-12-23",
    "content": "In the event of a single drive failure, is the replacement process pretty simple? Do I need to have the failed or failing drive still plugged in or would I just boot without it connected and a new one in its place and tell TrueNAS to replace it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1320774925170118656",
    "author": "popthetrunk",
    "date": "2024-12-23",
    "content": "It’s super easy, If the failed drive is still useful in anyway to zfs(these blocks are good, but these are bad) it is useful to have it plugged in during a resilver. \n\nYou don’t have to power down to replace a disk you just attach the power and data cables, remove the faulted disk in the gui(it will be yelling at you) and then you select replace with the new disk as soon as it spins up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1322347846665502801",
    "author": "SawyerM",
    "date": "2024-12-27",
    "content": "Replacing anything while you have it pulled apart?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336083237877059596",
    "author": "itaylerner",
    "date": "2025-02-03",
    "content": "😲 any acoustic reasons? Or just for the vibe? Maybe it's just what they have in here but it just feels so unfinished",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336083851201613947",
    "author": "Rollmottle",
    "date": "2025-02-03",
    "content": "purely aesthetic. it's a staple in mid-century design and i've always loved it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336084152981782609",
    "author": "itaylerner",
    "date": "2025-02-03",
    "content": "Ahhh ok I see what you're saying. Yeah if it was finished it could definitely be a vibe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341140827929317416",
    "author": "itaylerner",
    "date": "2025-02-17",
    "content": "Darn. Having a 33” cloud with joists spaced at 24” is a little aesthetically annoying - but alas",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341211095809003630",
    "author": "Matt Huber",
    "date": "2025-02-17",
    "content": "Joists / studs are definitely ideal…\n\nBut…\n\nThis is a fun / informative watch if you’re in a house with good modern drywall. This dude stress tests different ceiling drywall anchors. I was enthralled for every second of this 10min video. \n\nhttps://youtu.be/BmZ1sb6HXvc?si=9tzLk6PB_nBJAVdz",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341236696133664865",
    "author": "itaylerner",
    "date": "2025-02-17",
    "content": "Chains are kind of annoying though, one link is too loose and the next is too taught, trying to finesse the hooks to get it perfectly leveled but boy it’s a pita",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1341672750531743856",
    "author": "thegreatcarsoni",
    "date": "2025-02-18",
    "content": "Such a lovely room, I remember being blown away by how clear the image stayed no matter where you moved in the room. Vibes are immaculate too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342443304364540005",
    "author": "Joshua Riley",
    "date": "2025-02-21",
    "content": "https://www.instagram.com/reel/DFdIx2cIoHv/?igsh=MWNrd3c3bWp6ZHBzZg== vibes are great in this setup",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342937308873101323",
    "author": "Bryan DiMaio",
    "date": "2025-02-22",
    "content": "Looks inspiring man!! Love all the lighting and color themes. Are those SVS subs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1343021732990161018",
    "author": "masteredbyjack",
    "date": "2025-02-22",
    "content": "Absolutely love the vibe and aesthetic of this — big big congrats!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352015795734970378",
    "author": "Sei046",
    "date": "2025-03-19",
    "content": "Awesome! I bought some led panels to do the same but haven’t got around to it. Surprised the hue bulbs had the power to give that even light",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352076469748371496",
    "author": "itaylerner",
    "date": "2025-03-19",
    "content": "Hmm that’s interesting! I think part of why these feel like skylights is because the lights are essentially in a big empty box. Not sure it would really work If that box was filled with insulation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369808707050799224",
    "author": "Ross Fortune",
    "date": "2025-05-07",
    "content": "First time I’ve had a windowless room though. \n\nAny recommendations for lighting options that feel a little like sunlight?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369825916490088448",
    "author": "Will Melones",
    "date": "2025-05-07",
    "content": "4-ft LED shop lights are an investment I don't regret. And before that, one of those little therapy lamps that sometimes looked like a window if I caught it just right in the corner of my eye",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1369960440087449600",
    "author": "Ross Fortune",
    "date": "2025-05-08",
    "content": "Thanks for the rec Will. I've got one of the therapy lights, must get it revved up again.\n\nI've always leaned towards warmer bulbs for cosy lighting, but in this cave maybe brighter could be the move. Did you go with a daylight temperature? I'm seeing cool white, neutral white, variable white, daylight...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1370147946611478660",
    "author": "Ross Fortune",
    "date": "2025-05-08",
    "content": "That’s sick. I think I’ll try slotting them just at the sides where the clouds end, similar vibe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376235836110147765",
    "author": "NoahNeedleman",
    "date": "2025-05-25",
    "content": "If you’re up for it, I think some of the knowledge on this discord can really help you level up your studio monitoring",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382604034413953054",
    "author": "thegreatcarsoni",
    "date": "2025-06-11",
    "content": "The slat wood walls are super aesthetic, go up with a couple nails easily patched later, and some manufactures sell shelves and lights and stuff you can mount on the panel so it’s more of a decorative surface",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1382871004103053424",
    "author": "onanisland",
    "date": "2025-06-12",
    "content": "I installed seperate conduits for electricital wiring for audio path, havent had any issues in 6 years",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387104389981802657",
    "author": "Gerhard Westphalen",
    "date": "2025-06-24",
    "content": "I get a lot of questions where people have moved their speakers by 2\" or installed a lamp at the back of the room and want to know if we need to recalibrate... the answer is almost always no",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1388233226509746267",
    "author": "Ross Fortune",
    "date": "2025-06-27",
    "content": "For sure - got em from Screwfix, UK chain hardware store: https://www.screwfix.com/p/4lite-single-5ft-led-cct-batten-35w-4700lm-220-240v/132gg\n\nThey have selectable brightness - the lowest is too warm, the highest is straight gross, but the middle is just Goldilocks.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1422376293248405657",
    "author": "NoahNeedleman",
    "date": "2025-09-29",
    "content": "What do we think the resonant frequency of salt lamps is?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457504048155590727",
    "author": "cian riordan",
    "date": "2026-01-04",
    "content": "Notably missing is the literal mountain of cabling you're going to have piled behind that fucking desk.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457560642725744706",
    "author": "Eric Martin",
    "date": "2026-01-04",
    "content": "it’s worth it to get that room all dialed in at once",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1460704751250571506",
    "author": "Zack Hames",
    "date": "2026-01-13",
    "content": "Good to know that’s the vibe. We had a cam system at my day job and it fucking sucked and I immediately stopped using it (digital, computer, etc)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1461856804895068322",
    "author": "James Cronier",
    "date": "2026-01-16",
    "content": "Not mine, but visiting a vibey room where one of my fav records I mixed this year was cut. \n\nEverything came thru the tascam m-3700 and it sounded awesome!",
    "reactions": 0,
    "attachments": 5,
    "is_pinned": false
  },
  {
    "id": "1463099796398149644",
    "author": "shoolace",
    "date": "2026-01-20",
    "content": "I’m not a big fan of the “producer studio desks” I personally think they give off weird spaceship vibes.\n\nBeen wanting a larger desk to work from… found this dinning table on Facebook marketplace for $75. Reaching out to a woodworking friend for some rack mounts matching the wood stain 😎\n\nAnyone else just set up on dining room tables? Or am I crazy",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1467377191862931581",
    "author": "chris_donlin",
    "date": "2026-01-31",
    "content": "Anyone got cool hooks for cables and such? looking for some inspo. Got blank wall i need to update. Vibe is kind of mcm/factory/industrial/modern? i have a couple ideas but just curious what y'all got going on. FWIW i dont love the pegboard look in my space",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]