[
  {
    "id": "1340525568931921970",
    "author": "Gerhard Westphalen",
    "date": "2025-02-15",
    "content": "New speakers going up. Will calibrate in the next few days",
    "reactions": 64,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1449506925858394182",
    "author": "Jasper Boogaard",
    "date": "2025-12-13",
    "content": "Just installed the clouds of my @Gerhard Westphalen design 🙂 gonna spend the evening listening and recalibrating my ears but the low end feels so much tighter without having even started with the back wall",
    "reactions": 30,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1314638235535933461",
    "author": "Nomograph Mastering",
    "date": "2024-12-06",
    "content": "Tube traps are for suckers! I painted the concrete walls red, got sonarworks going and got right to work!!",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "985366607238950912",
    "author": "Josh Bowman",
    "date": "2022-06-11",
    "content": "Ok so wife is away this week and I’m just working non stop. Then I was like… hey I should use this opportunity to get the house super dirty and build a full back wall bass trap like I’ve been meaning to. Then… you know your shooting stuff in rew, and your like, hey I wonder what it looks like without my big desk. Then you move the desk and it’s insanely better looking on the REW graph. Then you realize you have some old wood and a closet shelf that was gonna get tossed so you make a tiny desk and spend (waste?) 15 hours over the weekend that should have been spent on mixing renovating the studio room and moving things and taking measurements till you don’t know what a anything even sounds like anymore . Anyway I feel like a Total psychopath because this is what I did Friday and Saturday all day and night. Desk is obviously in progress and I need to figure out a shelf for the hilo etc. thinking off to the side and low so I can reach it easily but it’s not reflecting stuff. Also the back wall frame is full of pink fluffy now and covered in interm fabric till I figure out what I want it too like like.",
    "reactions": 14,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1308973887215894628",
    "author": "Nomograph Mastering",
    "date": "2024-11-20",
    "content": "We can put anyone who asks about sonarworks in the hushbox",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1239317999878672416",
    "author": "Skyler Young",
    "date": "2024-05-12",
    "content": "Likely joining the Pmc crew in the near future",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339762686271029320",
    "author": "Felix Byrne",
    "date": "2025-02-13",
    "content": "step 1 delete sonarworks\nstep 2 download room eq wizard and get some useful information",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210747047360331816",
    "author": "Slow Hand",
    "date": "2024-02-23",
    "content": "We are re-calibrating our punishment. A pair of door-to-door acoustics evangelists are now being sent instead.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091743828328861857",
    "author": "Zakhiggins",
    "date": "2023-04-01",
    "content": "Yeah on a sunny day you can't beat it, was here 2 weeks ago. Bout an hour drive from where Ruairí grew up",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1094602762358116353",
    "author": "NoahNeedleman",
    "date": "2023-04-09",
    "content": "Our resident speaker alchemist @Gerhard Westphalen is the REW wiz",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094639096594448605",
    "author": "BatMeckley",
    "date": "2023-04-09",
    "content": "Everyone hears and prioritizes  things differently, but when I finally started to learn about time delay, and ringing and those kinds of measurement is right around the time I started really not prioritizing a speaker’s frequency response graph.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387102894557499462",
    "author": "Gerhard Westphalen",
    "date": "2025-06-24",
    "content": "No, it's not like sonarworks. I don't correct for furniture. I correct the speakers themselves, broad stroke room EQ, and preference EQ. As long as you didn't move the speakers or listening positiong by more than a foot, it's not going to change the calibration",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1091446942468427927",
    "author": "masteredbyjack",
    "date": "2023-03-31",
    "content": "Damn I really want to come to LA and drink with the crew @Rollmottle @Nomograph Mastering",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1135659756342751372",
    "author": "Zack Hames",
    "date": "2023-07-31",
    "content": "Quick and dirty threw together my setup in the “control room”. Long story short a session came up for a friends band to do a live video, we did the recording in this room in the basement, they helped me throw up some absorption in the ceiling as fast as possible and we went for it. Now I’m listening in this room for mixing. Excited to take it further with @Gerhard Westphalen",
    "reactions": 2,
    "attachments": 2,
    "is_pinned": false
  },
  {
    "id": "1163138703145844936",
    "author": "Joshua Riley",
    "date": "2023-10-15",
    "content": "Just a joke from my side! Grew up in church, played in worship teams all my life, worked as a worship pastor, learnt all my audio knowledge there. Wouldn’t be doing what I’m doing if it weren’t for church. Recently joined a new plant in our new area and slowly getting involved again",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1182483438691954689",
    "author": "jantrit",
    "date": "2023-12-07",
    "content": "Perfect, the upside of having vidiots present is they always take longer to set up than you. It’s also funny seeing a whole video crew of like 10+ on the session and it might just be you engineering with maaaaaybe and assistant lol",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1214033625671274546",
    "author": "montrose recording",
    "date": "2024-03-03",
    "content": "i use my tape machines all the time - using repro head calibrated hardware insert delay compensation allows you to hear repro in context so you can hit the tape just like u wanna - i end up commiting things back in all the time",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339764249072767038",
    "author": "Rollmottle",
    "date": "2025-02-13",
    "content": "@Gerhard Westphalen has YT vid on how to measure with REW I believe",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1372723803838484602",
    "author": "Edsel Holden",
    "date": "2025-05-15",
    "content": "“So yes I’ve decided Sonarworks is actually good … and only one sub for sure !”",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860233119989497886",
    "author": "cian riordan",
    "date": "2021-07-01",
    "content": "I think the attack wall solves the problem for people that can't build their room from scratch. As someone that just built a studio, building fake walls with insulation & membranes tucked behind aint cheap. And it's permanent. Having tube traps (or the ASC pressure traps, or whatever they are) are not a panacea -- but rather a scalable, portable method of getting an untreated room in the ballpark. I've found with tube traps that more is not necessarily better and you just don't know till you get in there and shoot it. My friend Andrew Maury raves about his. He's gets amazing results and he loves moving around his setup every few months just because he likes tweaking... and the attack wall allows him to do this. So -- if you're building a studio from the ground up, there are absolutely better options. But if you're hopping around from space to space and don't feel like spending $10-15k on framing, fabric, rockwool, & building limp mass membranes... these are a terrific option.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "922682193791291402",
    "author": "Eric Martin",
    "date": "2021-12-20",
    "content": "It was my first outboard compressor, I like it, it’s hard to strew up compression with that thing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1048296380176793600",
    "author": "masteredbyjack",
    "date": "2022-12-02",
    "content": "First, congrats!! That’s amazing.\n\nHonestly and truly try to hire the Unf*ck crew if you are thinking of doing something like this. Of course I am sorta biased because I did (and my project was not building a completely new structure but still decently involved in a new house we bought) but I promise you they saved me so much time, headache and made my investment absolutely worth it.\n\nAnd it’s much more about the trade-offs and things they are so good at helping with than just an acoustics plan. For instance, in my case they talked me out of buying more expensive speakers and we put that into the room treatment and finishing it to be a wonderful space to work. At the time I just trusted their experience but now that it’s done I see the wisdom in it. So regardless if you work with them please consider all the trade-offs, both short term and long!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1083892292072517703",
    "author": "cian riordan",
    "date": "2023-03-10",
    "content": "Completely dependent on the size of your cloud. Getting that first ceiling reflection is key. Once you have that sorted, I would base other movements on measurements. Moving cloud forward/backwards/up/down will have an effect on frequency response, even if minute.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1085776590031564810",
    "author": "ehutton21",
    "date": "2023-03-15",
    "content": "It sounds more complicated than it looks as I write it. Basically drew the triangle, nudged the monitors, verified with tape measure, and it was done. But it saved me massive headaches.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1101598494483030097",
    "author": "Tim O’Sullivan",
    "date": "2023-04-28",
    "content": "These are also nice because you can focus the lenses and then screw them into place. The security camera ones you can’t focus.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107039793809997965",
    "author": "Slow Hand",
    "date": "2023-05-13",
    "content": "I love the airpods with some pink noise to cancel out distractions when I'm posted up in a noisy cafe. That's a killer move for focus.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110419152654573579",
    "author": "masteredbyjack",
    "date": "2023-05-22",
    "content": "I did! Under guidance of Ruairi and the unf*ck crew who advised. I know essentially nothing I just followed.\n\nMy basement was a bit smaller (about 13 feet by 30 feet) and was unfinished, so that was beneficial since I could stuff the ceiling, walls, finish off with non-drywall acoustic material, etc, build in a fake “back wall” to get the “room” to the right dimensions needed (the studio is about half my total size of the basement but the fake back wall is essentially a rock wool holder for acoustic benefit).\n\nI have exactly no clue if any of that is useful, or indeed beneficial to what you’re doing (it may make it worse for your purposes) but it came out great, sounds wonderful and is actually a very nice bright place to be in!\n\nNo doubt your spot will come out great too and hopefully serve the purposes you’re looking for",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1167954031671525467",
    "author": "kidcutler",
    "date": "2023-10-28",
    "content": "Grew up with them on tv/going to shows so assumed everyone has a career in music 😅",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1227655264572801094",
    "author": "thegreatcarsoni",
    "date": "2024-04-10",
    "content": "This was basically the first position I threw them up in, entirely possible more toe in would be helpful. Also looking at width/distance from wall/all that. Will be tweaked with my buddies who are using the space as well",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339763739385135134",
    "author": "Felix Byrne",
    "date": "2025-02-13",
    "content": "if you search REW in here you should find lots of conversations abt how to read and interpret the different rew graphs",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362866705067671612",
    "author": "Zack Hames",
    "date": "2025-04-18",
    "content": "ATM25’s for bottom Toms and kick mic. \n\nI wanted to use the ATM for kick, so I just threw a 441 as a general dynamic replacement. The high Tom probably won’t even need it. \n\nI haven’t done bottom Tom mics in a while, nor have I perfected it, so this is a fresh take. I’ll know in about an hour how everything sounds",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "808945577982820402",
    "author": "hendrick",
    "date": "2021-02-09",
    "content": "the previous owner told me it had been calibrated recently but he recommended me to change the strings! i'm excited to change them on my own and learn more about the mechanics of the instrument",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "844102457831456818",
    "author": "absflores",
    "date": "2021-05-17",
    "content": "Yeah! Klipsch tower with built in subs. It was the most affordable full range solution I could find in my budget. Not flat by any means but paired with sonarworks they feel surprisingly great. After being introduced to ATCs I’ll get to those towards the end of year. I’ll have to shoot them out to pmc of course!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "860238451956776981",
    "author": "chadwahlbrink",
    "date": "2021-07-01",
    "content": "Yes, for sure! As a renter, work-from-home option, they are a dream. I think you could get better ergonomics and potentially better sound from other studio design options, but the flexibility is great. They are definitely not a magic bullet to get a “flat room” either and placement / quantity can affect things greatly. \n\nAndrew Maury was the one who inspired my initial purchase! He does fantastic work on them and was definitely a great resource as I was looking into them. He shared this video with Greg from Kush audio which was very convincing at the time  https://m.youtube.com/watch?v=P7pOA4eeuS0&t=72m13s\n\nI also have friends who have had good success building diy tube traps — which can be pretty affordable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001758779047694427",
    "author": "Skyler Young",
    "date": "2022-07-27",
    "content": "Was looking to join the tiny desk crew but thinking these could be another solution",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001913803425992794",
    "author": "youngteam",
    "date": "2022-07-27",
    "content": "Would you recommend walking around with an SPL meter with a 80hz tone playing to see where the buildups are? I have a lovely null at that freq myself",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001927230756229150",
    "author": "Will Melones",
    "date": "2022-07-27",
    "content": "You are so brave. I'd be really interested to start a share-your-curve thread. I bet some people are doing really high level work in rooms with worse frequency responses than you'd expect.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1029605433226309632",
    "author": "NoahNeedleman",
    "date": "2022-10-11",
    "content": "Buddy of mine is working in HiFi, (used to have a wine bar in Napa,) sent me this pic today and said “About $1Mil, no big.” \nI threw shade at the box of a room and he defended it. Said Wilson Audio designed the room… can I call bullshit or….",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1030918843087990875",
    "author": "Skyler Young",
    "date": "2022-10-15",
    "content": "Sorry the before frequency response measurement was taken with cloud. I forgot to take an actual before photo so the before photo I used was about a month old, taken just before I got the cloud.  The only change between the frequency response measurement was the desk.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061715976606978119",
    "author": "Maxim",
    "date": "2023-01-08",
    "content": "Yes and no. What I meant was that the manager didn’t know what was going to happen. And it was only once the crew got there that I had to be like “no we can’t do that”.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061835119293378641",
    "author": "Zack Hames",
    "date": "2023-01-08",
    "content": "Its not set up at all, I JUST threw it in that rack. \n\nTbh I don’t mind it with the mix at 100% wet! At 4:1, slow attack, i like how it grabs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1074093363298566155",
    "author": "sukhuno",
    "date": "2023-02-11",
    "content": "The vu meter needs to be calibrated - does anyone have any idea of how you’re supposed to do if? The dragon manual doesnt have any specifics",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1074102219986702446",
    "author": "ehutton21",
    "date": "2023-02-11",
    "content": "Should be the screw plate in front if you’re referring to just setting the needle right",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1074102281194180638",
    "author": "ehutton21",
    "date": "2023-02-11",
    "content": "The guy I bought from told me he calibrated it before shipping",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082385143228006430",
    "author": "CK",
    "date": "2023-03-06",
    "content": "I took some quick REW measurements just to see how it measures in current state.",
    "reactions": 0,
    "attachments": 3,
    "is_pinned": false
  },
  {
    "id": "1082412152326987846",
    "author": "CK",
    "date": "2023-03-06",
    "content": "I have been mixing up here with Sonarworks and my mixes translate pretty darn well without doing anything acoustically.  But yes, the low end is a mess. I plan to invest what I need to make it better. I need it to work for another year or two.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082417057171251331",
    "author": "sethearnest",
    "date": "2023-03-06",
    "content": "I wonder if some of that is from a single sweep and a truck driving by or a train in the distance or something. You can set REW to do 2 or 4 sweeps and it'll clear out all the \"not the room\" anomalies often.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1086036344649822248",
    "author": "Deleted User",
    "date": "2023-03-16",
    "content": "re: trig. I just used my eyes and ears to calibrate my speakers. My room’s asymmetrical anyways, so just made sure it looks evenly angled and checked if the low end feels like it’s as close to center as possible",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1093980293473513632",
    "author": "Jeremy Klein",
    "date": "2023-04-07",
    "content": "Interesting. \n\nwhat is the best explanation for why anything that sounds good on an NS-10 sounds good elsewhere? Is it more than just the frequency response?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1094035862418899036",
    "author": "BatMeckley",
    "date": "2023-04-07",
    "content": "Exactly. And if someone is trying to go “frequency response graph is the benchmark for what makes a speaker “objectively good”” everyone who actually does this for a living has an obligation to mock that concept into oblivion.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094036230678790235",
    "author": "Gerhard Westphalen",
    "date": "2023-04-07",
    "content": "I never said it was the frequency response that is to blame for this. I just said the frequency response is representative of the problems there. If you EQ a speaker to match that it won’t sound like an NS10 cause you won’t have all of the problems from their crossover",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094036858503172166",
    "author": "Rollmottle",
    "date": "2023-04-07",
    "content": "do NS-10's have a smooth frequency response?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094037334468603995",
    "author": "BatMeckley",
    "date": "2023-04-07",
    "content": "Up to a point. Just because a carrot is part of a stew doesn’t mean a stew is a carrot.\n\nAtc’s don’t have ruler flat response and are hyper useful. I think part of this is that frequency response is WAY overhyped and doesn’t tell nearly as much about a speaker as people want it too pmc and genelec can both measure flat and sound ENTIRELY different. So much in the time domain and presentation and thd doesn’t show up on a graph like that. And that’s the point.\n\nAnd for someone who’s trying to sell speakers to imply that is, or that NS10s are broken or objectively bad deserves all the pushback they’re getting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094037516950183987",
    "author": "Gerhard Westphalen",
    "date": "2023-04-07",
    "content": "You could make a flat speaker that’s completely unusable (let’s have the tweeter fire in the other direction, put a wall between you and the speaker…) so I don’t really care to look at frequency responses other than for revealing specific problems that you know via other sources like the NS10 crossover",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094037733086867556",
    "author": "Rob Domos",
    "date": "2023-04-07",
    "content": "Lmao slow down. Obviously something can be flat and still suck. All we have to do is use sonarworks on a Logitech speaker to experience that. What I’m saying is, all things being equal, not having a 5db response swing within one octave is probably desirable. Y’all getting way too pedantic haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094040441181188156",
    "author": "Gerhard Westphalen",
    "date": "2023-04-07",
    "content": "Decent enough in most categories like frequency response, distortion, off axis performance, no huge problems in the crossover. Something with no clearly overlooked aspects",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1094759681274171433",
    "author": "Rob Domos",
    "date": "2023-04-09",
    "content": "But hey so does sonarworks, so you’re probably right about em being dummy flat",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1095388974949859418",
    "author": "Andy Lawson",
    "date": "2023-04-11",
    "content": "Top rew photos ,purple no wall no eq, red boundary eq on kii’s turned down with a low shelf boost and a high shelf reduction",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104835074446336011",
    "author": "Andy Lawson",
    "date": "2023-05-07",
    "content": "So my client cancelled on Friday with Covid  I just threw myself into it! Stage 1 complete (of 4)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107047884026810418",
    "author": "Nomograph Mastering",
    "date": "2023-05-13",
    "content": "Nothing to know about it except that it’s running baby Sonarworks on your ear canal in real-time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1107453438461214750",
    "author": "shaunobi",
    "date": "2023-05-14",
    "content": "When I mix on headphones I use LCD-X’s (newer gen, light EQ curve correction) or Sonarworks custom profiled HD650’s. Both sound good, though pretty different. Can mix bass on both.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1109211072730247279",
    "author": "Gerhard Westphalen",
    "date": "2023-05-19",
    "content": "Trickiest part was mounting the wheels. I had to cast polyurethane with a threaded insert into the L joints and then the wheels just screw in",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116523940467195914",
    "author": "shaunobi",
    "date": "2023-06-08",
    "content": "Wait, you talked to Art Noxon?!? I grew up in Eugene. That is awesome 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1116531160353341481",
    "author": "jantrit",
    "date": "2023-06-08",
    "content": "Thanks man! It was a ton of fun and it does always shock people haha @hyanrarvey  you’re too kind. @popaganda.  and the crew also brought some great feels and vibes!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138880144027684935",
    "author": "Gerhard Westphalen",
    "date": "2023-08-09",
    "content": "The would depend on how the panel was built but most likely yes. I rebuilt all of my panels like that many years ago. I went through the process of measuring with REW as I \"upgraded\" each panel in the room and the differences were huge but unfortunately I somehow lost that file. The testing I've done since has been with smaller panels (not an entire room) so the differences you see in REW measurements are much smaller",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150520265218998312",
    "author": "CK",
    "date": "2023-09-10",
    "content": "just bought.  Thank you.  I literally threw my back out for the first time ever trying to move these stands a half inch.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150521161684353125",
    "author": "Rollmottle",
    "date": "2023-09-10",
    "content": "yup...just remove that brass-looking thing and they screw right in.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153063532687011963",
    "author": "chrissorem",
    "date": "2023-09-17",
    "content": "Definitely! We did measurements and calibrations between each mic to make sure the comparison were close as possible.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1153084538524799086",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-17",
    "content": "About that, what's the vocabulary for describing the stability of a mic outside of pure frequency response?\n\nThe U87 AI \"should\" not have a bump there according to most measurements (this one is from Audio Test Kitchen)",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false
  },
  {
    "id": "1153086398694424597",
    "author": "chrissorem",
    "date": "2023-09-17",
    "content": "I’m not a mic expert by any means but my understanding is that it all has to do with the material of the capsule and more importantly the tuning of the capsule. Every company has a different way of measuring the tuning. If it’s not to spec it can drastically change the frequency response. It’s little bit of the wild Wild West when it comes to consistency between mics. But I think the bumps are from capsule resonance. I’m sure there are more qualified people to answer this though then me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1171496233228050573",
    "author": "Eric Martin",
    "date": "2023-11-07",
    "content": "through the phone the caret looks like it’s grey- but on the brown side of grey and not the blue side, that could be my device’s color calibration and lighting but matching that might be challenging",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172627281211031552",
    "author": "Gerhard Westphalen",
    "date": "2023-11-10",
    "content": "If there’s a specific dip then I’ll often use the REW room sim to move around and figure out what’s most likely causing it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1172627804983140433",
    "author": "Gerhard Westphalen",
    "date": "2023-11-10",
    "content": "I use the amroc calculator and then there’s an SBIR calculator. REW sim does a pretty good job of combining it all",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1220431292391493662",
    "author": "Bryan DiMaio",
    "date": "2024-03-21",
    "content": "plus you can run filters for some room correction if you need to",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1244353009245229057",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-05-26",
    "content": "Not to make it even more expensive, but if you’re interested in filming in your space as well it might be worth looking at the Aputure Amaran stuff, it’s properly calibrated colors, won’t flicker and the app is foolproof from what I hear:\n\nhttps://amarancreators.com/collections/all?sort_by=price-ascending&filter.p.m.custom.filter_color_temperature=RGBWW",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245854590491033600",
    "author": "Lee Rouse",
    "date": "2024-05-30",
    "content": "I did wind up just turning off sonarworks after I measured because it was just making more problems than it fixed. Really just wanted to measure to see what it looked like",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1312261250109145099",
    "author": "nachomaquieira",
    "date": "2024-11-29",
    "content": "But used them 2hours only. Tomorrow i will continue listening music and calibrating everything. I’m really really happy. It’s crazy how good they are",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1316454797859098726",
    "author": "chris_donlin",
    "date": "2024-12-11",
    "content": "I'm a big lavazza drinker - gran aroma, pre-ground - and it's pretty wild how different it tastes from my roomates drip machine vs my areopress. As i've gotten more into coffee the past year or so, it's been interesting seeing how the \"sum of parts\" concept applies to other things, especially music cus that's what we do. Grind size, time of brew, temperature of water, brew method, etc. Used to not buy into it, but they certainly affect the outcome. Mic, placement, preamp, quality of the source, etc. are all important too!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1339763162509086741",
    "author": "Felix Byrne",
    "date": "2025-02-13",
    "content": "those sonarworks graphs are pretty much useless when it averages between 37 places where your ears are not remotely near",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1343050831729000488",
    "author": "Montano Mastering",
    "date": "2025-02-22",
    "content": "It felt great right off the bat I’ll say - my previous room was also designed and calibrated by Gerhard, though on a much lesser scale, and with the same speaker set up. So I was already in familiar territory",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1348838010736869469",
    "author": "Gerhard Westphalen",
    "date": "2025-03-10",
    "content": "Speakers are almost too small. No joke. Mainly the 4 subs for LFE. I’m pushing them pretty close to their limit and am technically a little lower in calibration level than I should be for a room this size. To make a meaningful difference I’d need to double it to 8 woofers…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1376260998364921997",
    "author": "An Hero",
    "date": "2025-05-25",
    "content": "the house i'm in is rented, and its just a converted bedroom with treatment from John Hunter Acoustics. I have a trinnov as my DAC and room correction, it's the best this room will sound without significant downtime and fiddling unfortunately",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387093651754189021",
    "author": "thegreatcarsoni",
    "date": "2025-06-24",
    "content": "@Gerhard Westphalen should we do another calibration on the miniDSP now that furniture has changed?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387103764980306041",
    "author": "Gerhard Westphalen",
    "date": "2025-06-24",
    "content": "The only real exception to this is if your speakers are on the desk and then you remove the desk since that makes a huge difference as you were effectively splitting the room in 2 where the speakers were but I don't remember the last time I did a calibration like that since I'd suggest getting rid of a desk setup like that before considering DSP",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387104389981802657",
    "author": "Gerhard Westphalen",
    "date": "2025-06-24",
    "content": "I get a lot of questions where people have moved their speakers by 2\" or installed a lamp at the back of the room and want to know if we need to recalibrate... the answer is almost always no",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1387104779318333633",
    "author": "Gerhard Westphalen",
    "date": "2025-06-24",
    "content": "How things sound and the frequency response might change but it's not something that would affect the DSP calibration in the way I do it (unlike something like sonarworks or Trinnov which is trying to fix comb filtering)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]