[
  {
    "id": "1174188978509987971",
    "author": "cian riordan",
    "date": "2023-11-14",
    "content": "I appreciate these sentiments. Some of us here have spent a good deal of time and invested a lot of knowledge into this community; it's a good feeling to know that the majority opinion is one that aligns with the spirit of @oaklandmatt's original foray into live-streaming with Jon. A lot of our work happens in the shadows and often goes unappreciated, but I sleep better at night knowing you guys are also out there -- in the weeds -- trying to set higher standards for both the creation and the consumption of music across the genres. Not everyone will get it and I think that's OK. We should do our best to be kind and welcoming to people walking into a now, 2+ year-old water-cooler chat, but we shouldn't also lower the bar that we've set for ourselves as record-makers (and thinkers). This place really is special, here's to many more years of community.",
    "reactions": 35,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1295867053173117011",
    "author": "cian riordan",
    "date": "2024-10-15",
    "content": "When I think somebody working at an intermediate level (I think of myself up until maybe 3-4 years ago) - that someone has at least a decade under their belt of working on music for myriad artists, many releases, many collaborators across a one or two sub genres. Having some chops as a mixer is a *great* start, now you have to build and maintain relationships, survive the ebb and flow of a freelance income, continue to improve upon your process and your work output.",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047952677696450600",
    "author": "NoahNeedleman",
    "date": "2022-12-01",
    "content": "Ditto to @Zack Hames’s comment.  @hyanrarvey,  you’re listening to a curated playlist. Of course it’s all gonna sound the same. \n\nHip Hop has wildly different sonics across the genre- so much so that putting it all in one genre seems dumb. Listen to Shootouts in SoHo by Westside Gunn then listen to the latest Lupe Fiasco. Only thing in common is the fact that they’re rappers.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055369767793475594",
    "author": "cian riordan",
    "date": "2022-12-21",
    "content": "In my experience, clubs tend to exaggerate and hype the low end of whatever playing back. If you listen to house music from the 90s, its sounds rather timid by modern standards, but absolutely just slays in a club setting. I find that most contemporary pop mixes have as much low end as humanely possible... and I find it overwhelming in the same settings.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1338942347689590875",
    "author": "cian riordan",
    "date": "2025-02-11",
    "content": "The “When The Pawn” Fiona album is a sonic masterpiece. I also loved his RATM mixes.. incredible genre jumping abilities",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191435099154157668",
    "author": "chrissorem",
    "date": "2024-01-01",
    "content": "The point I’m trying to make here is that everyone is right. And a great mixer will know what’s an appropriate and when to what to do with vocal for appropriate genres and artist. And occasionally someone comes along and blurs the lines which opens up the minds of the masses that there are no rules and if it works it works",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1295901340043575369",
    "author": "cian riordan",
    "date": "2024-10-15",
    "content": "All super fair. Your next step is to get out and network. I'm not sure what genres you're working in... but you need to find inroads to other people in similar circles. This can begin online, but it requires getting in the room with folks -- whether its production/writing sessions, going to shows, just grabbing drinks with peers. You can be the best mixer on the planet, but if nobody knows who you are or has a sense of what you're capable of -- it's moot.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191082388353200128",
    "author": "chrissorem",
    "date": "2023-12-31",
    "content": "I think it’s really song and genre specific.  Some music if the vocal is too on top it feels like karaoke and others it makes it feel grand and expensive. Imagine MVB with a loud vocal, you’d loose the feeling of the music and vocal melting together. And then imagine Chet Baker with buried vocal it would be equally distracting.  For me  the song tells me where the vocal should be and I don’t really even think much about it. There is always a place that feels correct",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014589227100553346",
    "author": "BatMeckley",
    "date": "2022-08-31",
    "content": "I dunno, I spent too much time trying to figure out why St Vincent, one of our generations most revered and genre busting talents, keeps insisting I’m the guy to engineer and mix her work.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030310791792037908",
    "author": "BatMeckley",
    "date": "2022-10-13",
    "content": "Verbs add density and need space.  In a solo acoustic track you can go nuts. In a 160 track pop mix you’ll get more mileage with delay",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1459212349675147367",
    "author": "Nomograph Mastering",
    "date": "2026-01-09",
    "content": "Where do you think new genres come from?",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "891786983498727436",
    "author": "ALXCPH",
    "date": "2021-09-26",
    "content": "I’ve been getting more and more into not using static time based effects on hip hop vocals other than maybe a little slap if I want to put the person in a space. For verbs and delays I’ll just make thows when appropriate. If I do actually put a reverb or delay that’s static I’ll really over do it for effect kinda like the swae lee verb from unforgettable. Really opens up a mix not having all these random ass 1/4, 1/8 and different spaces hanging around all the time. (This is strictly for hiphop where you have less space between words btw other genres I think about this a little different)",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "894781262601023579",
    "author": "cian riordan",
    "date": "2021-10-04",
    "content": "@Zack Hames On second look, this comes off kind of jerk-ey and I didn't meant to just brush off your quest for saturation dominance! I guess what I meant to say is that through the dozens of interviews with Jon and Matt, it's clear that he's averse to using compressors and tends to use saturators more to do the job. While I fuckin' LOVE me some saturators, I honestly don't see the two as interchangeable... they're just two very different tools. One is leveling volume and the other is distorting a waveform to generate harmonics. I think saturators are a great next level tool for people who have wrapped their brains around compression.... but you really need some form of compression on an un-treated vocal. I feel in contemporary music, people are leaning too much on high-end saturation to get things to sound exciting and hyped. If I'm ever using saturators to distort things (which is often), I'm always trying to find some sort of un-distorted high end source to help the ears cling to clarity in the mix. Sometimes, things will distort in a way that will add this clarity -- or even manufacture it. But most of these multi-band saturators are just adding a layer of fuzz to the entire midrange up and the whole mix just ends up sounding hazy. IMO, a great example of modern hip-hop mixing is Mac Miller's Circles. The high end on that record sounds just as exciting as anything else, but it doesn't sound like everything got ran through a buzz saw (shoutout Greg Koller/Jon Brion). Just my 0.02.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "943495219247210577",
    "author": "NoahNeedleman",
    "date": "2022-02-16",
    "content": "I love this question. I had a folk duo called Anchor + Bell and used to play shows with Phoebe in LA! Of course so much of it depends on the production, and the genre is really rangey so don’t take any of this as gospel but:\n1) be reallly conscious of where the  brightness is focused. Things don’t have to be darkEr than a pop record, but the top end might be focused a little lower. \n2) there can usually be a lot more bottom in the acoustic guitar and LV. That’ll really help with warmth. \n3) darker verbs > brighter delays",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "978755173893693440",
    "author": "sethearnest",
    "date": "2022-05-24",
    "content": "I'm in development of a plugin. Here's a first draft of my copy for it. I'll include a screenshot of what the plug will be doing under the hood. Maybe even a PT preset for those interested. \n\n*The game came to me, and I said, \"Nay, game, nay. I won't only change you. I'll **beyond** change you.\" \n\n**Demigod Dustmite** is Mixxxing™. It’s even further than beyond the super analog. We've spent over 3 centuries developing the universal quantum soundscapes lurking beneath the molecular level of our minds. \n\nThe plugin was designed with every genre music ever conceived in mind, so you don’t have to move a knob—simply add to every channel, turn it on and sit back as it brings sonic bliss to any song, any artist, any production, no matter what. \n\nWe’ve heard you loud and clear: you’re an Artíste. We have a fully-customizable user option for your creative powerhouse output. On the 2nd Devil-Loc, feel free to adjust the Darkness knob anywhere you want between 1 and 2. The range is literally infinite. \n\nWe ship all our plugins with the Grammy’s you’ll win already included. \n\nDEMIGOD DUSTMITE: FURTHER THAN BEYOND. IT’S MIXXXING™*",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1034131931647987732",
    "author": "wald",
    "date": "2022-10-24",
    "content": "*casual side-note…we all play super loose and fast with terms like ‘drums’ 😂  There’s a neutron star’s worth of daylight between orbit culture and say the new lil nas xs’ drums. (Not to pedestal a genre, just to delineate between methods & how essential practices for one could be entirely contra indicated for another)",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047767078297419816",
    "author": "Nomograph Mastering",
    "date": "2022-11-30",
    "content": "I’m not sure it’s different to other genres in that regard though. The subtle differences you care about in rock for example are lost on hip hop fans",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1315811070119776336",
    "author": "Josh Bowman",
    "date": "2024-12-09",
    "content": "Maybe you just need to mix in the samples at a way lower volume in addition to your current snare to dip your toes in a bit? Also could just be lack of the right samples, hard to say without knowing the genre/what you’re looking for in drum tone.\n\nAlso make sure to try the phase flip on the trigger snare both ways to see what works best!",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941763521266462851",
    "author": "ALXCPH",
    "date": "2022-02-11",
    "content": "Man I’ve just been comparing some of jons kid laroy mixes to other mixes in comparable genres. I’m kinda mind blown. I’m really impressed. He is so great at keeping everything super unsquashed yet aggressive. Even after mastering . I’m guessing his mastering engineer is doing a bangin job as well. And it’s not just in studio it sounds great but also on my shitty AirPods. What I wouldn’t do to go though a session of his and just reverse engeneer it all. Stuff is released at like -6 -7 lufs and still sounds open and dynamic with great low end. Hats off. \n\n\nAlright done Ass kissing now.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047908875321479289",
    "author": "Zack Hames",
    "date": "2022-12-01",
    "content": "As someone who grew up in metal, then fell out of it, I feel metal *can* sound super homogenized at first glance when you aren’t tuned into the landscape. \n\nThis applies to literally ALL genres currently. The differences become a lot more obvious the more you pay attention. \n\nWe all knows genres are different. But let’s not deliberate over “post punk” and “new wave” or “death metal” and “extreme black metal”. It’s pointless for this convo.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055179006732947536",
    "author": "austenballard",
    "date": "2022-12-21",
    "content": "I've never been sure how to feel about TBC. I briefly worked with a 'mastering' guy who was insistent that things had to match up with the genre-appropriate curve in TBC... but then he also treated Loudness Penalty like the bible",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081620872118407198",
    "author": "Calvin Lauber",
    "date": "2023-03-04",
    "content": "I’m sure the solution is ultimately to chase better monitoring/room treatment. But a good excersize is maybe try pulling up that Kendrick track in your room and listening to the low end, like below 120 and see how that feels in your room against the track your mixing? That kind of thing has helped me learn the response of low end in my imperfect room and given me a better understanding of how it should hit. Worth doing this with other mixes you like in other genres as well",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1112479186699964588",
    "author": "jonmatteson",
    "date": "2023-05-28",
    "content": "yesterday i felt like having fun with the shawn everett style of mixing on a demo and trimmed down 10db, added a few tape machine plugs, pultec, and gained a vintage limiter up to make up for the gain and it was super fun to mix into. I know this is not the best or most efficient way of working but it was fun to throw the rules out and be broad stroke creative and it definitely injected a lot of vibe into the track that i wouldn’t have been able to get on individual elements.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1243338577648029787",
    "author": "Jeff Dunne",
    "date": "2024-05-23",
    "content": "Might be unique to the genre where both sides (guitars) and middle (vocals) tend to be extremely hairy/gritty/saturated, so having extra harmonic enforcement in the center can help bass cut through in a way that 1.5k bass pick attack doesn’t.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342225390453653564",
    "author": "cian riordan",
    "date": "2025-02-20",
    "content": "Try to take it 95% of the way there with balance and panning. Less processing will work in your favor. It shouldn’t sound like pop mix!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1348489073475715134",
    "author": "Will Melones",
    "date": "2025-03-09",
    "content": "Maan, I was just doing a punk mix that just felt dull if it wasn’t averaging -5. And I normally feel like I’m up against diminishing returns beyond -9. Granted this song is front to back wall of guitars. It all depends, doesn’t it?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "909179463546331237",
    "author": "David Fuller",
    "date": "2021-11-13",
    "content": "Can I just say I truly enjoy doing the pumpy mix bus thing for loud rock mixes?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001632804435660890",
    "author": "Jeremy Klein",
    "date": "2022-07-26",
    "content": "\"effective\" vs \"pristine\" is such a useful framing device. I will constantly be thinking this now.\n\nThe other day I was mixing a very punk/hyperpop rap song and had a sweaty underground warehouse show from an artist in that genre playing on my tv on mute in the background. Was a useful way of thinking, \"would any of these kids care about this 800hz masking?\"",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1021149379261894737",
    "author": "Jeremy Klein",
    "date": "2022-09-18",
    "content": "I saw a reddit thread yesterday where a guy was essentially asking, \"I mix for a living, but only compress vocals. Am I doing something wrong?\"\n\neveryone was clowning him, but I think if you are primarily working in sample based genres (pop, edm, rap, etc), and everyone is already sending you processed stems... you dont really need a comp that much.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050035554286321704",
    "author": "Zakhiggins",
    "date": "2022-12-07",
    "content": "@Jodonny  What I do as an exercise to get my head in the game when I know I'm not hearing things right, is to either have a really hot or really cold shower - I can't say for sure why this works for me, but if I was to rationalise it, I'd say it's because it shocks my mind into a heightened state of awareness, probably due to the shock of the extreme temperature change. I stick it out for around 10 minutes, and when I go back I'm almost always hearing things the way I should be.\n\nAnd if I've the time, for an extra boost of awareness, when I come back from my shower I spend about 10-20 minutes just listening to music of a similar genre to what I'm working on, without changing the volume level between songs or when I go back to my DAW. When I stick to this routine I usually do my best work.\n\nI've also *really* fucked up some mixes due to attempting to get them done when I ain't hearing things right. I also have sinus issues, but maybe my senses aren't warmed up. I dunno. The human body is crazy",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061701050714820788",
    "author": "Nomograph Mastering",
    "date": "2023-01-08",
    "content": "Producers now in mainstream genres do 80% of what mixers used to do, and mixers do 80% of what masterers used to do, and masterers ….",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1066113053042675793",
    "author": "spectrummasters",
    "date": "2023-01-20",
    "content": "If its any help, fwiw , imo It’s absolutely all about your gain structure and groups, and it’s kind of counter intuitive , you don’t want to be slamming anything ...just very careful db clipped here, db limited there ....across your buses . I have 6 group buses: . Kicks , 808/Bass , Drums , Music, Vox , FX and only clip by 1-2 db at the mixbus . Nothing clips by design or accident anywhere else .....for rnb/hip hop build your mix the Alex tumay / mixed by Ali way , get that 808 up first, on its own ....as loud as you want it , then build everything around it afterwards. Filtering is your friend. Have nothing in the low end but your bass. Overall I’d absolutely suggest watching Jon castelli mixing t Shine (he uses clipping well in there ) and mixed by Ali mixing YG , his mix balance and grouping is CHOICE. I say  somewhere between these two is the perfect rnb/hip hop mix lol . PS. I wouldn’t  do any of that edm/clip to zero stuff, it doesn’t work for anything other than serum madness.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068950355104239696",
    "author": "Ross Fortune",
    "date": "2023-01-28",
    "content": "I've tried tilting in S1, but it usually sounds better to me to just pop in a Trim, unlink L/R then push or pull one side til it feels right. A lot of times either kick/snare will be off, but I'm focusing more on how the general image feels. The close mics and/or samples will usually negate the tiny bit of pull to either side in the OH (at least in the genres I tend to work)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070114886048284802",
    "author": "Zakhiggins",
    "date": "2023-01-31",
    "content": "@Ross Fortune getting back to you late about your question of what do you do when you don't know what to do, but, I actually have something that really works for me that I want to share with you. Its really simple and kinda fool proof, and almost always works for me if my head is in the right space. I've said it before in here but saying again. \n\nLitterally just sit in your chair, and listen to music of the genre you're mixing, for like a half hour \n!!key thing is not to change your volume levels!!\nAnd then when you go back to your mix session, listening at the same volume, it will become very very apparent what you need to do.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081709706420170952",
    "author": "peterlabberton",
    "date": "2023-03-04",
    "content": "That sounds less like genre differences and more like poor decision making while tracking/arranging",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1128025985468612689",
    "author": "JustinLeu",
    "date": "2023-07-10",
    "content": "Not the same genre, but I was listening to Blink182 Edging the other day to hear Serban mix Blink...then went back and listened to Take Off Your Pants and Jacket for fun/comparison and I really miss drums that sounded like that. They are so much more believable. I think TLA mixed that record for Blink.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245060781251366983",
    "author": "Chase H",
    "date": "2024-05-28",
    "content": "I’m going to invent a new genre… I’ll call it….\nDelta Blues",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1293981847360897035",
    "author": "Josh Bowman",
    "date": "2024-10-10",
    "content": "I am almost 100% remote on mix sessions so wanted to add 2 cents- Chris is 100% on with his answer. I think the biggest thing is making sure they really understand you're on their team and there to support their vision. If they don't truly understand that, its easy for guards to get put up and things be shot down immediately just because its not what they're used to.  That being said if im trying something radical/different on a pop mix, its at best 50/50 that I end up hitting undo and letting the idea go if they've been in the weeds on the song for a while already.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1399248548523933746",
    "author": "Juliette",
    "date": "2025-07-27",
    "content": "It is so so so rewarding to witness the progression of your mixes over the course of a several years. It's such a great way to show yourself that you are indeed learning how to navigate the soundscape, as well as remind yourself that you are getting better, slowly but surely.\n\nWhen I first started, I used to watch and listen to hundreds of hours of podcasts and videos with all kinds of musicians and genres and engineers, and the words all sounded like total spaghetti. I got frustrated because I would mimic their EQ curve and my songs wouldn't sound good. It's quite nutty how your brain starts to pick up on those certain tidbits and figure out what's poking out, what sounds good to *you*, and so on. It's such an art form.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "978348676441337858",
    "author": "ehutton21",
    "date": "2022-05-23",
    "content": "kinda wild cause i really like jaycen (and looked up to) but it’s hard to respect this move, feels like it’s targeted at an audience that doesn’t know much better and there’s no real evidence of what’s going on underneath the hood. still love when he nails a hip hop mix though",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1013587458870493224",
    "author": "ehutton21",
    "date": "2022-08-28",
    "content": "I know the general approach with most mixing issues is “finesse it till you find the right feel” but I want to make sure I understand the troubleshoot process/methodology. \n\nIf this is a recurring symptom of my pop mixes, am I on the right track if my new approach to resolving this (rather than just accept it, lol) is (1) go in to the mix with EQ & multiband comp’s and try to carve things more aggressively for better separation, and (2) then revisit the 2bus processing with a focus on low end control via dynamic eq/multiband compression",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031640069532029060",
    "author": "David Fuller",
    "date": "2022-10-17",
    "content": "Specifically in metal mixes (and I know Ryan will appreciate this one) an overreliance on samples so blast beats sound like rimshots",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047909862660636702",
    "author": "David Fuller",
    "date": "2022-12-01",
    "content": "Go back to pre-internet era (or even like, early internet era, late 90s-early 2000s) and there are very obvious \"area sounds\" in almost any genre you can think of",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1064184380056145930",
    "author": "Deleted User",
    "date": "2023-01-15",
    "content": "Yeah, I’ve come across many Electronic music with clipping over 2-3db because they just printed them that way. And the consumers don’t say anything about them 🤷‍♂️ years ago I used to bump this dance song all the time and it was clipping by 4db, I couldn’t really tell. \n\nRegarding dacs and stuff, I believe mastering engineers here would probably have answers for it. \n\nI would argue although putting multiband compressors on the mixbus may be part of the sound in these genres, that is not really mastering. Perhaps just part of the mixing process just like how mix bus compression is.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070412341348409505",
    "author": "spectrummasters",
    "date": "2023-02-01",
    "content": "I just see it as Netflix for audio nerds . What could be better than falling asleep to andy Wallace talking you through a two and a half hour thrash metal mix , move by move 😂",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110296122590773338",
    "author": "JustinLeu",
    "date": "2023-05-22",
    "content": "I try to vary how I am listening quite a bit. One thing I have found to be helpful to make the process quicker is using a tool like SPAN (which is free) and setting it to RT MAX and also MAX (shows peaks in real time and also then holds the peaks) You can pull up a ref track to get familiar with where the kick hits on the meters for songs you like (or genre you're workin on) then quickly match your level roughly to that.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1148713322213036032",
    "author": "chrissorem",
    "date": "2023-09-05",
    "content": "I remember hearing that some of these big pop mixers don’t start mixing until everyone on the team signs off on what’s considered the last version of the arrangement.  Almost every time I mix pop stuff, it’s seems to be amateur hour.  Just got a track in today and they always seem to from managers and not the producers or artists. It’s strange for me not to be in communication with the artist or producer. Anyways Got the link for the “stems” in this case it was stems to which I wrote back if they could send the session or un processed files.  Got the new “stems” and every track was out of time not consolidated. It was easier for me to line them up  at this point but I’m curious if anyone has a good intake system for this circus.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151870501518590034",
    "author": "cian riordan",
    "date": "2023-09-14",
    "content": "If you’re a bit more seasoned, have a few years under your belt, good room, solid grasp of the genre - of course it’s not necessary. But starting out I think it’s an important tool.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151957363348217969",
    "author": "Zakhiggins",
    "date": "2023-09-14",
    "content": "I’ve said this in here before but a practical tip for referencing without fucking your mix is to spend a half an hour or so before you even start, just listening to music of a similar genre/style you’re going for, before going to mix. Key is to not change your volume level!!! It will calibrate your ear to what fits and what doesn’t, and as soon as you go back to your mix session, it will be obvious what you need to do",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1162202240854003813",
    "author": "cian riordan",
    "date": "2023-10-12",
    "content": "I know people lean on C4 & C6 because they've become very in vogue for pop mixers as a crutch for jamming as much excitement into tracks.... and there's definitely something to it. But anytime I'm reaching for one, it's usually for a last ditch, round 11 mix note, that we're so far off the rails we've gone past the original integrity of any sort of intention... and it might just hype a vocal or a synth part up enough to get the project across the line. It's never a V1 tool.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1165499979805241424",
    "author": "Calvin Lauber",
    "date": "2023-10-21",
    "content": "It’s genre dependent for sure but on some music I think it sounds weird to have absolutely 0 noise floor. Just a tiny touch of noise from something like that adds character and kind of puts it in a comfortable place",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177722149570629754",
    "author": "Nomograph Mastering",
    "date": "2023-11-24",
    "content": "Re just for show - There are  time periods, genres etc where using your gear collection to tell a story to your clients can be helpful. I’m about as far away from that as I can be",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1187462454389768332",
    "author": "Josh",
    "date": "2023-12-21",
    "content": "Also same. Not mixing talk but I’m trying get more into the singer songwriter lane. I feel like all the practice with more “extreme” genres is calling me to calm tf down and produce some slow stuff.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191178773274578988",
    "author": "Slow Hand",
    "date": "2023-12-31",
    "content": "Contemporary country mixes are like watching a film with a super close-up where you're confronted with the craggy landscape of someone's face and their eyebrows are ten feet wide. Country mixes be like:",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191185226865586267",
    "author": "Matt Huber",
    "date": "2023-12-31",
    "content": "Some of my favs are actually some of his country mixes from a few years back. There’s a song by Thomas Rhett called Craving You…phenomenal mix.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191434122162343977",
    "author": "Will Melones",
    "date": "2024-01-01",
    "content": "Yes, the point about country music is that it's primarily a storytelling genre. Usually told in plain language, rather literally. There's not much insight to be gained by obscuring certain details of a story.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1193285893667164170",
    "author": "shaunobi",
    "date": "2024-01-06",
    "content": "I’m addicted to Sound City. Replacing Sunset Sound for me on all rock / indie mixes. Just… don’t try to use remic mode unless you really are looking for a LOT of vibe. That thing is so fun but so unusable 90% of the time. Guitar cab emu tho… dang it’s fun.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1202407589145477160",
    "author": "tomtom",
    "date": "2024-01-31",
    "content": "The biggest vocal space creator in my life has been LCR mixing.. it definitely isn’t for every genre/every mix, but it’s a cool way to at least start a mix to suss out the arrangement and how things want to interact with each other.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1291466666391240776",
    "author": "peterlabberton",
    "date": "2024-10-03",
    "content": "Also: assistants, including or not including prep time, genre/how good the rough is/stems or raw multitracks/etc. etc. could be muddying the waters here",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1348750879716671613",
    "author": "Mike Tierney",
    "date": "2025-03-10",
    "content": "Damn we out here talkin about intonation systems? A lot of my bread and butter is contemporary classical/microtonal/experimental music and I'm in this world as both an engineer and often as a producer keeping track of how folks relate to the score and each other, take maps, etc. I tend to agree with some of the above that trying to chase down inharmonic relationships with EQ can make things worse, but I appreciate @LAPhill posting about bassoon/flute overtone series. @spectrummasters original question was about understanding the low mids and how they relate to EQing depending on the key; I think for me the way that understanding overtone series, tuning systems, and musical interactions in acoustic/orchestral instruments can relate to pop or rock mixing is like... Sometimes when I hear clashes between instruments playing thirds or clashes in the harmonic series and I'm trying to clear space in the mids/low mids, I do think about what instruments want to be occupying that space. So perhaps in the bassoon/flute example, I'd want the flute's fundamental to be stronger than the bassoon's first harmonic at C5, and that might look like EQing down the bassoon in the ranges of the flute's fundamentals, or in a rock mix looking at the bass's harmonics compared to where the lower range of the guitars are living. Obv instruments are moving and changing notes so none of this is surgical so much as the keys of the songs or the instruments' ranges might inform some general decisions about where to make space rather than just \"cut 300 on the bass\" or whatev",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1357778527105061005",
    "author": "sethmanchester",
    "date": "2025-04-04",
    "content": "IME, it’s pretty hard to do a multitrack, acoustic drum recorded rock mix vocals first",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1438904462965080074",
    "author": "JustinLeu",
    "date": "2025-11-14",
    "content": "Track level or group rides are the most transparent for me typically.\n\nI have a lot of stem groups that feed my 2 bus and sometimes I will link a para comp on all of them and automate the blend during different sections, depends on the genre and overall loudness/density I am looking for. \n\nThere are so many creative ways to approach it, but most of the time, simple volume automation would be my solution to your specific question.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1446615327302750409",
    "author": "oaklandmatt",
    "date": "2025-12-05",
    "content": "In addition to @cian riordan's advice, I would start by getting a great EDM mix to A/B. Listen back and forth (actually set it up to toggle it with a click) and play with broad stroke EQ on your current mixes master buss. Find your target with the broadest strokes then go to the individual busses, then into individual tracks as needed.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "941769161321893919",
    "author": "Zack Hames",
    "date": "2022-02-11",
    "content": "I agree, Jon (and Matt) absolutely crush pop mixes. I put on playlists and sometimes I am shocked at what gets released and how the other tracks quality pale in comparison.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984211951330656257",
    "author": "Maxim",
    "date": "2022-06-08",
    "content": "A lot of (rough) mixes tend to sound almost “bandpassed”. Having a solid foundation (low end) and air up top gives you the impression of height. A classic pop mix that masters this is 24k Magic.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987140817791643658",
    "author": "oaklandmatt",
    "date": "2022-06-16",
    "content": "it is the most binary genre",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001609506305880186",
    "author": "ehutton21",
    "date": "2022-07-26",
    "content": "Not Matt but as someone who works with hyper pop and “messier” genres, it’s about the fundamental stuff + being very humble as a mixer. \n\nBy fundamentals I mean that a lot of this is about communication with the artist and figuring out what’s essential to them, or else how can you gain stage the good stuff? You gotta A/B the roughs and your refs a lot and make moves that are more decisive than super nitpicky too (be as detailed as necessary but be conscious that you don’t have to make this sound pop pretty). I remember I sent a mix to have @Rollmottle check out a couple months that wasn’t hyper-pop but I needed to go back and add in the grit of the bass actually pumping my final limiter cause it gave the mix life.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1003441884728930354",
    "author": "NoahNeedleman",
    "date": "2022-07-31",
    "content": "I’ve got some ideas for you. \n1) if your gain staging is done properly, you’ll notice when the low end starts to interact negatively with the rest of the frequency bands. \n2) reference reference reference. Listen to songs with the kind of low-end you’re looking for and reference them diligently.\n3) have someone you trust that can tell you how it’s going when you think you’re getting close. I got a road rig together for mixing, expecting that I’d get 70% there before finishing in my studio. Surprisingly I got closer to 95% just using good techniques ¯\\_(ツ)_/¯ \n4) its like anything else, the more you do it, the better you get at it. \n\nI hope this helps. Andrew Scheps is on headphones now and he seems to be real happy. You might be able to find some good insight from him.\n\nAlso keep in mind I do mostly Country Music and bedroom pop, which aren’t necessarily the most bass heavy genres.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1013294226655678565",
    "author": "oaklandmatt",
    "date": "2022-08-27",
    "content": "i don't know about loudness but i love this song so much. it might be the best song/production in the history of the genre of \"pop.\" composition, production (vocal and track), lyric, mix are all 10/10",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1021920249534234675",
    "author": "Daniel Ross",
    "date": "2022-09-20",
    "content": "Had a few other legends do some Country mixes that didn’t really crush it in the past. Feel like country music is just a different world. This one was right out the gate flames. And it’s also my first time hearing one of mine he mixed. I realize I’m being a 5 year old…but DONT ruin this for me I don’t have one single Grammy yet",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1021925680746860715",
    "author": "Daniel Ross",
    "date": "2022-09-20",
    "content": "Thanks man haha. I think in Country music particularly a lot of mixers not typically in the genre prioritize the low end…which makes sense but a lot of country is built around the acoustic instruments. And usually what happens is when the low end is prioritized, the acoustic instruments take a back seat or vice versa. Justin Niebank is kind of the king of great country mixes imo. But this one had all the impact from the acoustic/electric stuff, and all the impact from the low end, plus the vocal felt magic too. Drums and steel were sitting great too. It just slams without losing anything.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1030646276129296494",
    "author": "Brodie Stewart",
    "date": "2022-10-14",
    "content": "Lately in dense pop mixes I’ve been having great luck using an 1/8 or 1/4 (filtered) delay feeding into a 15-40% wet reverb (depending on the washiness needed). It’s way cleaner, still giving a huge sense of space but not as “fake” as a dry delay",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1045394386504134728",
    "author": "David Fuller",
    "date": "2022-11-24",
    "content": "Oh I'm well aware 😂  but it's still a genre where vocals tend to be crazy distorted",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1045394979868119091",
    "author": "David Fuller",
    "date": "2022-11-24",
    "content": "I'll take your word on it, most of the stuff I listen to in that genre tends to be a bit cleaner and a bit less rough around the edges. Not consistently though ofc",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1045406951263191140",
    "author": "Zack Hames",
    "date": "2022-11-24",
    "content": "Industrial music seems to be popping off underground too as far as more exciting and (re)expanding genres.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047906200785793054",
    "author": "David Fuller",
    "date": "2022-12-01",
    "content": "Course the other problem is that everybody in a subgenre has the same influences bc internet",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1063709107636416532",
    "author": "peterlabberton",
    "date": "2023-01-13",
    "content": "Had a bunch of in-house built Jensen transformer passive DIs that I liked more than our fancy Eclair Evil Twin tube DI for most stuff at the old studio. All depends on genre and instrument and player and and and… of course.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068945708989821029",
    "author": "Ross Fortune",
    "date": "2023-01-28",
    "content": "Also totally dependent on whether they've given you 4 mics or 17. How you balance might be quite different in each instance. And what the song/genre asks for.\n\nJesus I love tracking drums",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070117284158378014",
    "author": "Zakhiggins",
    "date": "2023-01-31",
    "content": "I definitely give flipping to a reference mid mix a hard pass, doing this feels way different. It's like your brain gets a good average of what stuff in that genre sounds like, so you know roughly what direction you should head in, without chasing your tail.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080543311443525852",
    "author": "Josh",
    "date": "2023-03-01",
    "content": "I think everyone basically has this covered. It also varies a lot from genre to genre. I actually started using groups for specific sections of songs. For instance I might have the main and L/R vocals on the second verse going to a group. Just did a song where I wanted to process two guitars and a bass as one so I had a group for that. Play around with it!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081696134436761711",
    "author": "ehutton21",
    "date": "2023-03-04",
    "content": "Hip hop mixing has its own space on the internet fr",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097647846800502854",
    "author": "Jeremy Klein",
    "date": "2023-04-17",
    "content": "Also there is probably genre differences to account for here too right? \n\nTo use the example of the song heard at every NAMM speaker booth this year, Don't Start Now, the production and the mix kind of blends in to each other moreso than say a rock record would. So it would seem more important that the mixer doesnt change much as the mix kind of is already in the song.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1131295410292527255",
    "author": "JustinLeu",
    "date": "2023-07-19",
    "content": "Depending on the genre I would mute any Adlibs as well",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151743293869260901",
    "author": "cian riordan",
    "date": "2023-09-13",
    "content": "But if someone is like — “hey, manny has really cracked the code for low end on this genre, let’s chase that”… that’s super fair. And realistic.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1162871605668618240",
    "author": "Edward Rivera",
    "date": "2023-10-14",
    "content": "Depending on genre / performance you can go way past 10 and get *that* sound",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1173349032257654902",
    "author": "f.ern___",
    "date": "2023-11-12",
    "content": "I have yet to see a name for genre",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191177470259494962",
    "author": "Matt Huber",
    "date": "2023-12-31",
    "content": "I love a lot of Serban’s country mixes. They are often refs for me when I’m mixing country tunes.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1194405084033982526",
    "author": "Rob Domos",
    "date": "2024-01-09",
    "content": "What’s wild is that my taste actually leans that direction. I typically lean pretty dark and low-mid forward. This is just further in that direction than literally any professional record I can think of. So I’m splitting the difference between the warmest record I can think of in their genre and their last record while making sure I deeply enjoy listening to it. It’s a fun puzzle.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1224859736785031210",
    "author": "Rob Domos",
    "date": "2024-04-02",
    "content": "Colorbass is such an interesting genre that taught me something about how there’s truly no “wrong”. The way they abuse group delay with allpass filters to make things sound pleasant is wild and I absolutely fuck with it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245703482799816747",
    "author": "Matt Huber",
    "date": "2024-05-30",
    "content": "A nice lil bit of slap and Decapitator can be fantastic sometimes, depending on genre.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1258069359671251058",
    "author": "Josh Bowman",
    "date": "2024-07-03",
    "content": "Totally agree on all accounts.\n\nTbh I dont really reference anything except the producers rough while working most of the time now, but i try to do a little ear warmup in the morning and throw on some songs i like the sound of to start the day that are at least in a similar ballpark genre wise....  But every once in a while i wonder if i should really reference more. Also depends on how fully baked the pie is when it gets here. If its still just ingredients i am probably referencing a bit while working.\n\nI guess it all comes back to what Ruairi and others throw around on here all the time about the value of \"listening like a 15 year old\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266097871313309769",
    "author": "Edward Rivera",
    "date": "2024-07-25",
    "content": "You can have great rock mixes that feel this way, Cian’s work certainly comes to mind. But for this particular brand of metal, Scheps missed the mark. But he doesn’t work on stuff like this tbf",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1272769991300874250",
    "author": "cian riordan",
    "date": "2024-08-12",
    "content": "Was a massive fan of that first record, but sonically this one seems a bit harsh. 2010 was an interesting year for rock albums as the loudness wars were starting to taper a bit and low end was becoming more available in the genre (The Black Keys 'Brothers' album was the big turning point for me).",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1272770568910798879",
    "author": "cian riordan",
    "date": "2024-08-12",
    "content": "But solid rock mixing. Sounds very SSL. Lots of choice compression on guitars and drums, those hi-bands on the SSL EQs are getting pushed to the limit, especially with his vocal down the middle. This was all before multiband, soothe, and all the other fuckery we lean on now became really available.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1287112196635099188",
    "author": "Josh Bowman",
    "date": "2024-09-21",
    "content": "Ok should clarify- the first 7 songs were NOT discounted, they paid fulll indie rate. Genreally if i do a cut rate on full lenght records, i set it up so they pay full rate until the last few songs then we apply a discount to the last few songs to cut the cost of the whole record.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1295127902593089538",
    "author": "Josh Bowman",
    "date": "2024-10-13",
    "content": "To answer the original question- spec mixes are not uncommon, and often help when trying to break into a new market or even maybe genre. That being said the odds of it working in your favor are much greater in my experience when it’s the artist or client asking me to do one because they’re interested in me vs me instigating it.  I try to avoid them if they are “mix offs” unless it’s something way above my pay grade or that I love.\n\nCurious how often others end up doing some form of spec mix? For me maybe a couple times a year at most but I’m not actively trying to get into those situations.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342971567130280026",
    "author": "Spencer Broschard",
    "date": "2025-02-22",
    "content": "The new Breaking Benjamin single is great too, although if I have any gripe with his mixes it IS that they are such a sausage and I miss some dynamics. I was listening to their Phobia album the other day from 2006 and I was like damn this era was peak rock mixing lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359329092100686017",
    "author": "Sei046",
    "date": "2025-04-08",
    "content": "All over the shop! Up to my eyes ins folksy country thing this month but had two rock mixes in the off hours with a kids tv show sound design last week. Two choral recordings this week and I’m into a pop thing In may. And actually May has a week of mixing a lofi electronic project. I’m not sure what I am. 😂 not a Grammy winner anyway",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361344938276688103",
    "author": "longstoryshort",
    "date": "2025-04-14",
    "content": "late to the party but I prefer shorter kicks without a clear note\n\nI think it's weird (genre dependent) when the kick has a clear note \n\nlonger kicks influence the sidechain time \n\nI dont love multiband sidechain, prefer the bass acts as the sub and the kick gives the punch",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1362665760773771325",
    "author": "thegreatcarsoni",
    "date": "2025-04-17",
    "content": "I like the ol tame 20k boost 8k pultec thing. I’ve gotten a lot of vocals lately that are really sizzly in a genre that just doesn’t need it so I always try several things to tame it down. But I’m also really sensitive to high end in vocals so 🤷",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385375542353727750",
    "author": "chris_donlin",
    "date": "2025-06-19",
    "content": "For clarification I’m not using it for grit. I keep the crunch knob at zero. I usually put it first or second in the chain. I’ve found it nice on BGV stacks more than lead vocals. Can still be useful on leads depending on the genre",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1400167682690646086",
    "author": "flyboystudio",
    "date": "2025-07-30",
    "content": "That’s wild. What’s the genre? Ballad?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1400855350382694561",
    "author": "Josh Bowman",
    "date": "2025-08-01",
    "content": "I mean, sure mixing traditionally includes vocal effects etc, but, i think working in a genre that is defined by those decisions, in 2025 for me it can easily creep into production territory. Not saying i'm \"producing\" a song when i add a vocal throw or anything like that, just trying to think of ways to phrase it that make you, and the client, feel better about the mix costing more.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1446683603797803139",
    "author": "oaklandmatt",
    "date": "2025-12-05",
    "content": "It will help you quickly understand a lot of things about the genre as you start to manipulate your own mix into it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "900838353279262809",
    "author": "kc_kasey",
    "date": "2021-10-21",
    "content": "I like doing 2:1 ratio and -10 threshold (to taste) , Med attack and release (to taste and genre) - thats a good starting point and you can look at the reduction meters and judge based on that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "940470037196705842",
    "author": "Zack Hames",
    "date": "2022-02-07",
    "content": "I’m not totally sure. I don’t think metering is going to help you. I’d avoid a mix by numbers approach. Maybe your monitoring needs some attention. A bad room can really make it painfully hard to make confident decisions that translate in the moment or even later in mixing.\n\nTemplates to me speed up your workflow not necessarily help you make better decisions if that makes sense. It’s like, setting up several busses you ALWAYS make, so instead of doing 100 keystrokes and commands to get your busses and FX built, two clicks and they’re there for you.\n\nI don’t know what genre / style / level you’re working at, but I’d say just keep working at it. I love recording music because you can ALWAYS do it again. Time is the only thing you have to lose. With enough time, anything is possible. \n\nThat said, looking at a frequency analyzer of a whole mix you like isn’t a horrible thing to do. Maybe you’ll see your mix is way too dark, or way too thin simply.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "942045297251594290",
    "author": "Dre Malone",
    "date": "2022-02-12",
    "content": "A weird thing I've just noticed but I don't know if it applies to everyone or the genre of music. Listening to music through wireless earphones at a low battery life reduces the quality of the song but counterintuitively adds a different pleasing texture to it. Something to experiment if you will to who may 🤷🏾‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "948963396219453550",
    "author": "spectrummasters",
    "date": "2022-03-03",
    "content": "i hear ya , re: 808 through a neve pre-amp, spot on agree with you. thats exactly what i do ....defo the sauce  ! lol. I sum OTB and send my drums , vox , fx and music buses through my ssl sixes (no transformers, no phase shifting , lovely SSL punch and transient response) and then bass through the 73 and into the SSL on an insert return bypassing their pre....I came by that one from an old Jaycen Joshua tip ! \n\nI also find i use the neves transformers if ive got a phase issue between two parrallels, if i send one through the neve it can often shift the phase in one a bit and they blend better when they sum back after. This realisation led me into learning about phase rotation and all pass filters this year......im still deep diving phase since christmas lol \n\nI’d defo recommend SSl X-phase plug in to anyone ITB \n\nWhat you say about tape is interesting to me because.....\n\ni wonder if the \"to tape sound\" will soon be a thing of the past even as an  aesthetic.....the artists in my genre, here in london and i know its the same in the states......their new forward looking aesthetic is this ruined/ultra smashed/clipped 808 , hi-passed percussion , serum synths and a  filtered vocal sound....ts like distorted nintendo on acid .....lol i actually like doing tracks like that for the madness of it....but magnetic flux and tape hysterisis are a v distant memory at that point me thinks......",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "959444561040662648",
    "author": "ALXCPH",
    "date": "2022-04-01",
    "content": "Isn't the rub and dissonance what makes a reverb sound like a reverb? a 100* clean verb is essentially just a 'sustainer'. I can see this being used in some EDM genres, where automating reverbs to turn on and off with each chord to get the same effect. But seems odd to use it as a 'room' 'space' tool as it wont really sound like a space... i dunno just my thoughts.... but then again, i like dirty verbs. If i experience a bad rub, because of a reverb, it's often an arrangement issue tbh. Never heard a song on the radio and been like, 'man that rub in the verb, they should have reset the reverb for that part!'. \n\n-I'm not hating on it, i'm sure some people will find it useful for something. (Maybe a tinsy bit gimicky ;P )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983059783496130590",
    "author": "Calvin Lauber",
    "date": "2022-06-05",
    "content": "I have a Telefunken TF29 that I love and I think can handle any genre you throw at it, IMO. Ton of bang for your buck",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "983730363262177371",
    "author": "Jeremy Klein",
    "date": "2022-06-07",
    "content": "Another thing to add is since most producers in the genres i mix in are ableton, they can just send me the project file. so thats a plus",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "984933455609622620",
    "author": "ehutton21",
    "date": "2022-06-10",
    "content": "this can work but i think it depends on genre and the feel of the vocal takes prior. i hear a lot of belts sound squashed cause of this",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "987069804659748874",
    "author": "rse",
    "date": "2022-06-16",
    "content": "What genre would you place it in? Is it some really hard edm stuff?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "990035228410118244",
    "author": "Jeremy Klein",
    "date": "2022-06-24",
    "content": "Yeah i came into mixing through EDM production. That beats mode trick is like the bread and butter of that genre. But it works SOO well in a mixing context too! Just never thought to try it on vocals.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001623549527732416",
    "author": "Jeremy Klein",
    "date": "2022-07-26",
    "content": "great point about keying in on whats important for the genre and amping that up. Makes total sense!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1001630877689852034",
    "author": "Jeremy Klein",
    "date": "2022-07-26",
    "content": "Totally agree. Its why hyperpop is one of the most fun genres to be part of nowadays.\n\n I've listened to enough records now where distortion is cool and hahaha i have to always stop myself from clipping the master MORE than the demo. But its things in the rough, like vocals with a TON of reverb, uncompressed vocals, masking, and especially this one, weak-ish drums,  that I have a hard time leaning into.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1006398244336705567",
    "author": "ehutton21",
    "date": "2022-08-08",
    "content": "^for specificity’s sake, let’s just say I’m talking any record with top 40/100 appeal, pop/rnb/hip hop genre",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1012098617223430224",
    "author": "Jeremy Klein",
    "date": "2022-08-24",
    "content": "the big changes here for me were only using 1 reference track no matter the genre that can be used as an anchor that I know extremely well and how my mix will translate if i go brighter/darker than that ref etc.\n\nand doing such a short burst with no gap in playback so that im _not_ focused on \"hmmm my kick drum is slightly woofier\" and more on \"OH MY GOD my kick is WAY  too loud\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1014952202500059236",
    "author": "Zack Hames",
    "date": "2022-09-01",
    "content": "Electric guitar high pass question:\n\nFor guitar driven rock mixes, how high do you cut the low end on electric guitars? I used to cut a lot, then the last several years only HPF up to like 80-100 to kill useless rumble. But a friend of mine did a mix where the guitars were quite thin in solo but the mix felt so separated and clear in a satisfying way, also watched a Vance Powell video with a similar experience - guitars way thinner than I’d think but it added up so cool.\n\nAny thoughts?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1021550335728308255",
    "author": "hank01564",
    "date": "2022-09-19",
    "content": "Word by word, phrase by phrase. I use clip gain extensively while I’m tracking to even out each phrase to the appropriate volume. Typically, I’m not a huge fan of audible vocal compression in the genres I mainly work in so it’s a lot of automation so the compressors aren’t working hard at all",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1021886051092004904",
    "author": "Daniel Ross",
    "date": "2022-09-20",
    "content": "This isn’t even his usual genre",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1021924199704559706",
    "author": "BatMeckley",
    "date": "2022-09-20",
    "content": "Yeah @cian riordan been tanking a lot of country mixes lately.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1028677879434842122",
    "author": "Iwan Morgan",
    "date": "2022-10-09",
    "content": "What’s your favourite reverb for that oh so current long modulated verb that’s used often on breakdowns or middle 8’s. I’m mixing something today which is a little out of my usual genre and they’ve asked for this kind of sound. I’d usually go for Valhalla shimmer but i’m a bit sick of that sound. Trying the Lexi 224 and Baby Audio’s Spaced Out but i’m interested to see what you are all doing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1031643313536766032",
    "author": "peterlabberton",
    "date": "2022-10-17",
    "content": "It does seem to be a thing: I definitely started digging into engineering more as I tried recording myself playing, and realized it was fucking hard to record drums the way I wanted to hear them! So in that way drums were kind of a gateway. And then I feel like modern music in so many genres is *very* drum focused, that it probably helps to have your head in that world to some extent.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1035193509218627634",
    "author": "spectrummasters",
    "date": "2022-10-27",
    "content": "That’s it , autolux! It’s not even my fav genre but I love the record and I felt everything he said for his intentions for the record he clearly achieved , seems a really cool talented fellow",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1038797256486301768",
    "author": "ALXCPH",
    "date": "2022-11-06",
    "content": "99% of people making those genres use Valhalla and or dverb. Not to say other verbs dont work, cuz they def do. But its pretty much the Sound of those genres. But yeah +1 to 7th heaven. I use it for the sunset chamber, and an a non lin style",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1039960057493856378",
    "author": "hyanrarvey",
    "date": "2022-11-09",
    "content": "Every genre has a undiscussed/talked about balance preference",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1039961117969088562",
    "author": "hyanrarvey",
    "date": "2022-11-09",
    "content": "Like you can throw a phone down the hallway and pick out some of the best mixes of each of those genres and thats what you’ll hear sticking out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1039962424289263656",
    "author": "David Fuller",
    "date": "2022-11-09",
    "content": "Ryan is right on the money when they say that balance is absolutely a genre specific thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1042730112283578388",
    "author": "Ross Fortune",
    "date": "2022-11-17",
    "content": "A question for people generally, but also specifically for @cian riordan as I know he rocks the 9-6 lifestyle I aspire to. \n\nHow long does a mix take you?\n\nI know this is a “how long is a piece of string” question, but let’s say an “average” number of tracks, a half decent arrangement you don’t have to wrestle with, with recordings that are largely good but could use a bit of love here and there. Essentially some kind of mythical median point job. This mythical job had already been prepped, with the back and forth for missing files etc already done.\n\nWe have the @futurejonaccounts of this world who can knock out 3 a day, but that’s probably genre dependent. I had the opportunity to intern under Alan Moulder at the start of my career, and his average was 1.5 days per. He worked on a NIN track and a modern rock album produced by Jackknife Lee during that time. The 1.5 days was pretty consistent. He said that to this day, he wakes up in the middle of the night trying to figure out how to solve some mix problem, then comes in the next day to sort that out and wrap it up.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044099889019228261",
    "author": "Jeremy Klein",
    "date": "2022-11-20",
    "content": "yeah it’s genre dependent. in the genres i work in, hahah i can practically ONLY use them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1044101344677613588",
    "author": "Deleted User",
    "date": "2022-11-20",
    "content": "what genre do you work in? \n\nI hate splice samples when they come with crazy clipping- like let me do it myself if I need it. I can’t really recover lost details but I can sure smash it with some EQ going into the clipper and it will be the same thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1045452450099896421",
    "author": "Nomograph Mastering",
    "date": "2022-11-24",
    "content": "I love how they are crossing genres",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047561577794117662",
    "author": "spectrummasters",
    "date": "2022-11-30",
    "content": "It’s a v different genre to what I’m doing at the mo but the ideas in the work are very inspiring....its very dramatic ...but controlled too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047564865750978632",
    "author": "spectrummasters",
    "date": "2022-11-30",
    "content": "Do you prefer mastering in any particular genre or will you do all styles ,  In my mind that health record must have been quite a challenge for all the engineers....its a bit more complex than heavy low end, punchy drums and a nice vocal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047765983814754354",
    "author": "hyanrarvey",
    "date": "2022-11-30",
    "content": "Ya’ll feel like every hip hop mix is starting to sound exactly the same",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047900670344314890",
    "author": "hyanrarvey",
    "date": "2022-12-01",
    "content": "Yeah but theres like 700 sub genres of rock",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047907079731560589",
    "author": "David Fuller",
    "date": "2022-12-01",
    "content": "Right but bands in those genres *also* don't have the localization of sound that they may have in the past",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047908354342781018",
    "author": "hyanrarvey",
    "date": "2022-12-01",
    "content": "I feel like those 3 artists are all different genres of hip hop tho",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1047911135015342132",
    "author": "David Fuller",
    "date": "2022-12-01",
    "content": "There is no \"local scene\" for it, different geographic areas don't have substantially different takes on the genre",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1048616158468780032",
    "author": "Josh",
    "date": "2022-12-03",
    "content": "Didn’t Sworn In hate the mix on The Death Card and Brian almost lost the project or some shit? Had to@like bring the band in to mix it with him and it’s still one of the best mixes in the genre",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1049729754095431801",
    "author": "Adam Thein",
    "date": "2022-12-06",
    "content": "What's the genre/bass tone/vibe you are going for?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1050265021097189387",
    "author": "Slow Hand",
    "date": "2022-12-07",
    "content": "I tried out the demo and was kind of put off by how severe the EQ sculpting is. It’s voiced very very bright. Maybe that’s the sauce in pop mixes, but it felt extreme to me. I found myself having to turn up the low shelf a lot to account for how bright it is.\n\nThe level rider seemed pretty good. And the compressor gets pumpy quick, but it was alright in small doses.\n\nThe doubler felt great and the two verb options sounded excellent, but I could see them being limited because they only have a dry/wet control.\n\nOverall I like that it can act as an instant-vibe plugin for when you want to move quickly through a session. It’s got zero latency, which is great and seemed very light on CPU. But it’s not a fit for every style. Seemingly just for big pop stuff.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1055659025762615356",
    "author": "hyanrarvey",
    "date": "2022-12-22",
    "content": "For me its the individual balance per genre / song / whatever that allows it to speak to the listener, eq verb compression blah blah is all reduntant and fun but like that constantly ends up being the one thing that can stress me out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1056301713767804950",
    "author": "Calvin Lauber",
    "date": "2022-12-24",
    "content": "Depends on the genre but generally I say not really no. Just make it sound cool",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1057706918396837928",
    "author": "spectrummasters",
    "date": "2022-12-28",
    "content": "Wtf lol, what genre .?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1061522923766173707",
    "author": "Nomograph Mastering",
    "date": "2023-01-07",
    "content": "I don’t wanna do any other genre on them but when you hear great hip hop at some place like Larrabee it’s a bit of an aha moment",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1062146384402325614",
    "author": "NoahNeedleman",
    "date": "2023-01-09",
    "content": "It really Depends on genre and what you’re trying to accomplish. Sometimes muting them is 🙌🏻",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1063599471553941554",
    "author": "LAPhill",
    "date": "2023-01-13",
    "content": "This! When the chess board is that tiny, it's easy to think you're being a disrupter or innovator when your output is just barely left of center. There's so much more room for new ideas than we're giving the landscape credit for. (I think? Maybe everyone likes living in their narrowly defined genre conventions, but it's so boring).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068938228079530196",
    "author": "Ross Fortune",
    "date": "2023-01-28",
    "content": "@spectrummasters I have no idea where you’re at with drum mixing, just going off your comment re easy RnB mixes made me think maybe you don’t do a lot of it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1068953042789073027",
    "author": "Ross Fortune",
    "date": "2023-01-28",
    "content": "I feel like a lot of the life in a track (context + genre dependent as always) can live in those misbehaving elements",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1070116506366660628",
    "author": "Ross Fortune",
    "date": "2023-01-31",
    "content": "This is good. Sometimes flipping to exemplary refs in the genre can feel a bit defeating, so I’ve moved away from that over the last couple of years. But maybe this kind of exercise for recalibration would be useful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079128573643866194",
    "author": "Ross Fortune",
    "date": "2023-02-25",
    "content": "My first instinct was shit, I dunno. I’d have to hear it, and I guess understand what else is happening in that range in the song. Genre, part etc all very relevant here.\n\nI dealt with a snare recently that was tuned too low / not spritely or exciting enough for the part by mashing nearly the whole drum mix down one mono band limited-ish play-doh factory hole. It didn’t sound like how it was recorded in the end, but it felt good and honoured the part more than the actual recording did, if that makes any sense. \n\nThe mix also got rejected though 😂\n\nI’d love to hear it in context. I def don’t have any “just pitch the whole thing down with alterboy” type tips (although sometimes a zener limiter parallel with a touch of alterboy formant shifting down that return can be cool and floppy and mushy when appropriate. \n\nI’m rambling, absolutely no pin drop here sorry",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079137194817634375",
    "author": "Will Melones",
    "date": "2023-02-25",
    "content": "I’m working on a whole album right now that sounds like it was tracked with an 18” kick, all wrong for the genre. The solution has been to add samples and mute the close mics. If there’s a crazy resonance in the overheads I’m notching it a little, but for the most part they don’t disagree badly with the samples.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079137386388275271",
    "author": "Josh",
    "date": "2023-02-25",
    "content": "Also what genre are we working with? Because if it’s a super dense arrangement you really might be able to just replace the kick and it won’t really impact the OH and Rooms that much.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1079164169330376714",
    "author": "NoahNeedleman",
    "date": "2023-02-25",
    "content": "Also only reason I mentioned Ross & Cian is cause they work more in the genre.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1080873185559453716",
    "author": "spectrummasters",
    "date": "2023-03-02",
    "content": "Sounds interesting (the technique and the genre you’re working in )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081718494204280923",
    "author": "Deleted User",
    "date": "2023-03-04",
    "content": "This too, but the amount of space each instruments occupy is pretty small in those genres compared to traditional band setup. But that also comes with its own challenges",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1081801029781303367",
    "author": "Josh",
    "date": "2023-03-04",
    "content": "As someone who has a done a bunch of the \"genre mix\" rock shit where the chorus is mostly just \"live\" instruments, and the verses are all huge 808s and trap drums, it's always fun having that first pass being the most dull shit when the chorus comes in",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1082851193178566717",
    "author": "JakeTB",
    "date": "2023-03-07",
    "content": "I have mostly landed in the same spot. It also seems to work better in some genres than others.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1084959159105097739",
    "author": "stefandurandt",
    "date": "2023-03-13",
    "content": "So I set the volume when listening to references in whatever genre I’m mixing and then stick to that for the day",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1088348885694545930",
    "author": "stefanmacc",
    "date": "2023-03-22",
    "content": "What genre are you mixing ?? Is it live drums or is this a sample based tying?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097638564495376596",
    "author": "Josh Bowman",
    "date": "2023-04-17",
    "content": "Tbh that sounds great, but I feel like over the last few years most people expect me to do less big creative moves, at least in pop mixes, and if I “do my thing” on it, and my thing isn’t just a clearer punchier version of what their thing already was, we’re going to just do revisions till we go in a circle and land on a clearer/punchier/harder hitting version of what their thing was in the first place. Talking way more than tweaking a buss compressor; but also not doing anything too heavy handed, or changing/altering direction on any sounds really.\n\nEdit: unless you mean people are literally just tweaking your mix buss and saying they mixed it. That’s so lazy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1097913519514599544",
    "author": "Jeremy Klein",
    "date": "2023-04-18",
    "content": "yeah metal mixing is something entirely different imo. much more technical and objective.\n\n Seems like in metal, there is a \"sound\" (think Periphery song), and the mix process is basically just getting it to that sound.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1104366510224457748",
    "author": "louisvie",
    "date": "2023-05-06",
    "content": "The 'genre' is live-band rock with Pink Floyd-ish songwriting, gothic aesthetics and definitely not on the 'indie' scope of sonics (We want our rock to hit like emo trap)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110297036273745920",
    "author": "JustinLeu",
    "date": "2023-05-22",
    "content": "If I reference a Serban pop mix while mixing a CCM live song it really doesn't help as much as referencing something I think sounds good in the same genre",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1110298102432280737",
    "author": "hank01564",
    "date": "2023-05-22",
    "content": "Absolutely agree, my MetricAB presets have genres of reference tracks so it’s fast for me to switch through what I’m looking for!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1114632607313961060",
    "author": "DavidEngquist",
    "date": "2023-06-03",
    "content": "Hi! New here to the discord. I'm a mixing engineer & producer in Sweden trying to get better every day. I've worked on a lot of indie pop/rock records but would love to improve my skills in RnB, pop and hip hop mixing. If someone has some old/new stems (or multitracks) laying around I'd be super happy to use them for practice in my spare time. Will of course not share any of it anywhere.  All the best 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1115018754309492798",
    "author": "esquinalee",
    "date": "2023-06-04",
    "content": "And really some of the most compelling musicians that are carrying on the lineage of Miles, Herbie, Coletrane, Blakey, and the like eschew the genre and just make amazing music like Nicholas Payton, Xtian Atunde Adjuah, Marquis Hill, Theo Croker, Terrace Martin, Makaya McCraven, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1124135212931104899",
    "author": "Deleted User",
    "date": "2023-06-29",
    "content": "I’m talking in more general mix scenario. Whatever genre or instrumentation it may be, once I get bass drums and vocals adding up pretty nicely, the harmonic elements ruin the sonic pocket.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1130599852863139892",
    "author": "Zakhiggins",
    "date": "2023-07-17",
    "content": "A problem that I often find myself running into with mixing, or more so vocal production, is that I can usually get a vocal sounding “good” and well balanced in the mix, but a note that I often get is that it should sound more processed, or wetter, not necessarily referring to reverb, but just FX in general - does anyone have any go to’s or 1 cool tricks for this kinda thing? I know this is probably genre dependant too but I’m open to anything",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1131504352230645860",
    "author": "GaspardMurph",
    "date": "2023-07-20",
    "content": "In my experience they are quite used ! Many TV shows in France and Europe require TV tracks or PBOs (play back orchestra) as we call them here. A lot of newer developing artists don’t have budget for MDs that can prep a TV track, and aren’t very good with DAW to make it out of stems. Obviously this is very genre specific to variety / pop / hip hop. Most rock, indie, folk people don’t need these as these TV shows aren’t really part of their promo circuit. \n\nI have been called many times to deliver a new TV track with a specific timing edit if a specific program has a maximum length of day for example 2:20m.\n\nI usually make the TV track this way:\n- instrumental\n- background vocals\n- lead vocal throws \n- maybe lead vocal in on choruses minus 5/6 dbs\n\nI have been advised by sound folks in TV / Radio not to master TV tracks. Something about loudness requirements, TV broadcast compressors and being able to mix the live vocals more easily with a less compressed and more dynamic TV track.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138930533422858402",
    "author": "Josh",
    "date": "2023-08-09",
    "content": "This is how like 90% of metal mixers work. I was sorta shocked when I found out the rest of the world doesn’t do that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1138970559292637225",
    "author": "Nomograph Mastering",
    "date": "2023-08-09",
    "content": "As someone who was a shitty mixer but has put my hands on thousands of mixes (from beginners to Manny to Cian) across a billion genres I’m with @cian riordan here and have posted here about it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1147594861445398660",
    "author": "Bryan DiMaio",
    "date": "2023-09-02",
    "content": "Sometimes it’s neat on guitars as a character effect. Genre-dependent and YMMV, this is not financial advice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1148720155195613246",
    "author": "Edward Rivera",
    "date": "2023-09-05",
    "content": "Man pop mixing at anything under major label level is a drag for this very reason, and even for label stuff it can be a mess if it's not with the top 1%. It's always too many tracks and none of em sound great",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1149004266883792946",
    "author": "chrissorem",
    "date": "2023-09-06",
    "content": "What’s strange is this doesnt happen to me with most projects or other genres generally smooth delivery and good communication but with pop artist it’s like they made up their own convoluted way of communication and it’s always chaos and everything is due tomorrow",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1150074662089392148",
    "author": "chrissorem",
    "date": "2023-09-09",
    "content": "There is artist I’ve done quite a bit of mixing for and that’s always his vibe. He’s says as long as the the drums  bass and vocals feels good the rest is extra. I think it’s very song and genre specific but I’ve definitely encountered it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151938809970315385",
    "author": "Jeremy Klein",
    "date": "2023-09-14",
    "content": "Absolutely pin worthy. So good.\n\nAnother thing for me i found when first starting out was i used a ton of different reference tracks all the time. Nowadays I pretty much just have 1 per genre / style of song that i know really really well.\n\nThat way its easier for me to make informed decisions like \"this reference is a little shy in the 200-400hz area but, i want my mix to be a little more raw sounding so im going to do more\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1151940339003830333",
    "author": "Nomograph Mastering",
    "date": "2023-09-14",
    "content": "But you have to feast on the metal and all the other genres offline  to know what’s needed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1155367169232748679",
    "author": "Jonathan Jetter",
    "date": "2023-09-23",
    "content": "Re: Limiter, to the extent that little micro-transients spike up post-compression, I see what happens if I shave them off a few dB w/ a limiter. Either it sounds better or it doesn't.\n\nRe: 15dB, I really don't think it's a ton of gain reduction, assuming we're talking about a modern commercial genre of music. If it sounds bad, I'll back it off. Or if the producer hit it hard already, I won't hit it as hard on my end. Or maybe some songs call for a gentler approach. But I'm not gonna operate from a place of pre-emptive worry.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1159900704777981992",
    "author": "Josh Bowman",
    "date": "2023-10-06",
    "content": "If it’s a modern/pop/“competitive” (ugh I hate that word but you know what I mean) genre how I deal with this in recent years is to make sure the arrangement is doing the heavy lifting instead of actual volume to get the feeling of dynamics, instead of making the song too dynamic (ie quiet parts too quiet). I always do a quiet listen or a headphone city walk to see if I loose important elements in the quiet bits to make sure I don’t overshoot the dynamics. Also don’t get stuck in a loop of just one section for too long. Also sometimes I start the intro a little louder and slowly let the volume settle to where I actually want it in the verse if I want it to actually be a bit more dynamic… just a subtle bump of the intro guitar/piano etc then let it settle under the vocal can help it appear loud enough in a playlist off the top and still let you have some contrast from verse to chorus. I know I said two conflicting things- depends on the arrangement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1169391132774514708",
    "author": "hyanrarvey",
    "date": "2023-11-01",
    "content": "Just replace the kick entirely, what genre is it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1173311066885853184",
    "author": "f.ern___",
    "date": "2023-11-12",
    "content": "So here's an idea I had. I have a folder of multitracks and stems of loads of famous songs I like. If I open a bunch of these and setup to my subgroups in my template I could use these stems instead of test tones to set the parameters (like thresholds) on my subgroup/mixbus inserts and then mix into these settings when I'm working on my  music.\nThis of course relies on my assumption that the overall levels per subgroup is gonna stay roughly the same if I stick to a specific genre.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1173324087175696446",
    "author": "Chris Doms",
    "date": "2023-11-12",
    "content": "I get the thinking behind it, I know for me I’d still have to change things around for different genres but if you’re sticking to one sound I see how it could save some brainpower",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1173348357851332782",
    "author": "f.ern___",
    "date": "2023-11-12",
    "content": "I like picking ideas from sub genres and put in a pop context",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1173348923163820203",
    "author": "f.ern___",
    "date": "2023-11-12",
    "content": "Currently I’m invested in a genre coming out of uk garage, hyperpop and just uk bassline in general",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1173355533500166194",
    "author": "Ingmar Carlson",
    "date": "2023-11-12",
    "content": "Some are referring to it as a \"midlife\" crisis, since it's a younger genre but it's getting to that age now",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1173647353916424273",
    "author": "f.ern___",
    "date": "2023-11-13",
    "content": "Yeah of course the whole thing would depend on that I have a bunch of tunes in a similar genre where the overall level per subgroups stays roughly the same",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1174032208437186682",
    "author": "f.ern___",
    "date": "2023-11-14",
    "content": "To me it’s no more mixing by numbers than to make sure you hit a certain lufs reference on your mix bus to stay competetiv with other songs in similar genre",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1176793377220599808",
    "author": "Jonathan Arnold",
    "date": "2023-11-21",
    "content": "Currently enjoying URM (Nail the mix) and their format on how the mixer breaks down their entire mix. Is there something similar to other music genres like Singer Songwriter or pop?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1177718276009234604",
    "author": "Nomograph Mastering",
    "date": "2023-11-24",
    "content": "Almost everything across every genre has enough or too much distortion and compression, which are really the only reasons I would reach for analog",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1190261260944674837",
    "author": "Edward Rivera",
    "date": "2023-12-29",
    "content": "I don't hear the ss's too badly, but I am on a headphone that's known for being quite warm. And though I agree that \"Don't Start Now\" is more my style of mix, and beautifully executed...\"Dance The Night\" has a character to it and does its job well. It's not as aggressive, it's more vocal forward, and evokes a sort of fantasy vibe. It's impossible to say what goes on behind closed doors but it doesn't sound particularly horrible to me. The focus is on Dua, the lyric, and the more \"glittery\" aspect of disco and I think they earned their fee",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191184216197713960",
    "author": "Josh Bowman",
    "date": "2023-12-31",
    "content": "So true! Modern country is over the top in terms of vocal level and also just how smashed a lot of the mixes/masters end up. It’s wild! What are some of your serban refs for that genre, just curious?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191388280088956939",
    "author": "Will Melones",
    "date": "2024-01-01",
    "content": "This makes so much sense for a genre that all about storytelling. It’s not a moody, mysterious grunge song. It’s a poem. Gotta understand every single word the first time you hear it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191432583431598130",
    "author": "NoahNeedleman",
    "date": "2024-01-01",
    "content": "If anything gets in the way of that, you’re in another genre",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191434773932032151",
    "author": "NoahNeedleman",
    "date": "2024-01-01",
    "content": "There’s lots of music to enjoy out there, and country as a genre overall suffers from lack of production value imo.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191435259762450593",
    "author": "hyanrarvey",
    "date": "2024-01-01",
    "content": "Agreed vocal can’t always just be loud and proud for every genre it’s not just black and white",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1191444946880831498",
    "author": "David Fuller",
    "date": "2024-01-01",
    "content": "This is a mix that makes me not want to listen to the music because it's just *punishingly* loud - despite it being pretty good songwriting for the genre https://www.youtube.com/watch?v=lkJ837kvw5M",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1210170959475122196",
    "author": "iampedrorafael",
    "date": "2024-02-22",
    "content": "Hey guys, I've been experimenting with  different clippers/limiters and came across an \"old school\" technique known as \"digital clipping 😆   \" .  In fact, there seems to be a significant amount of digital clipping going on in most pop mixes, not \"plugin\" clippers but PCM distortion itself, which I doubt it has to do with purely intersample peaks.\n\nhttps://open.spotify.com/intl-pt/track/5HCyWlXZPP0y6Gqq8TgA20?si=7e17089d26584ba0",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1212511470642925679",
    "author": "Zack Hames",
    "date": "2024-02-28",
    "content": "What do you all like for mix bus on pop mixes? I’m doing a Kid Laroi type thing, and my usual bus compressors and tape machine sims are not the vibe. \n\n(Maybe it doesn’t need anything - but curious what special finishing sauce people dig)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222587945723363471",
    "author": "sethmanchester",
    "date": "2024-03-27",
    "content": "Love that Idles - POP POP POP POP mix, fave mix on the album hands down",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222607735309467708",
    "author": "James Redfern",
    "date": "2024-03-27",
    "content": "The thing I appreciate most about EV is that he has a sound. Works across a bunch of genres but you can always hear his fingerprints. It doesn’t feel like some sort of ego “I need to put my stamp on it”, but just  that the music gets filtered through his taste and process and sounds so… non-generic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1222994836127350877",
    "author": "Zack Hames",
    "date": "2024-03-28",
    "content": "Something that’s helped me, especially with dense rock mixes, is recognizing all the frequency ranges add up;\n\nSo, how I use this, is I could do 2-4dB cuts around 1-2k in my guitars and overheads and room mics on drums, then suddenly I have a great little hole for vocals. And those elements all add up to enough 2k in the mix.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230703105662914621",
    "author": "Matt Huber",
    "date": "2024-04-18",
    "content": "Also, how Spatial changes EQ of things based on pan position. Drastically. \n\nThat’s why most peoples rock mixes sound so goofy in spatial",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1230732918012383286",
    "author": "Ingmar Carlson",
    "date": "2024-04-18",
    "content": "It actually makes perfect sense that a 3D soundstage would necessarily be less wide in headphones. Just funny when the selling point is that it's a more \"impressive\" audio experience. Also a slog when you're trying to match stereo pop mixes that are leaning into maximum width as if their life depended on it (probably because it does)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1233494522407686244",
    "author": "Jeremy Klein",
    "date": "2024-04-26",
    "content": "hahahaha \n\ntbh i leave it off even for stuff thats not going to mastering. \n\nalso, for loud, non-rock mixes, my final limiter is only ever really doing like 1-2db of reduction. so i dont sweat it too much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1233801390401261690",
    "author": "Matt Huber",
    "date": "2024-04-27",
    "content": "Yeah — I landed on a nice -5LUFS integrated on the CH. Felt slammed like you’d want it in the genre but still had room for some low end and depth.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1234230959340130417",
    "author": "lystell",
    "date": "2024-04-28",
    "content": "Kind of related to recent posts:\nI watched Tezio on MWTM and I have a couple of questions regarding compression. I usually reach for a compressor, either to controlling a dynamic recording, manipulating transients and/or saturating something. \nWith the kind of material in that song (Chris Brown), with exclusively programmed material (except for vocals) I was blown away that he compressed every track. (Not my “home-genre” I should say)\nIs the game here handling transients, lengthening/shortening sounds? Is it more about individual sound design or aiming to get as loud as possible in the end?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1241110548956057752",
    "author": "hyanrarvey",
    "date": "2024-05-17",
    "content": "You get sent the absolute worst engineered tracks besides self produced indie (genre) bands lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1242466721265094880",
    "author": "Iwan Morgan",
    "date": "2024-05-21",
    "content": "It varies depending on genre, on a live tracked record I usually have True Iron>UA API2500>softube Bus Processor> Sontec >OZ9 >ProL2 the first two I think of as my console sound and usually have the mix knob 50% on the API. The final two are loudness things really and Ozone allows me to ad extra EQ and multiband if needed.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1245148013068812339",
    "author": "M3MIYAGI",
    "date": "2024-05-28",
    "content": "so ig this truly becomes a thing of taste,client approval, and sometimes genre specific",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1252984379253456966",
    "author": "iampedrorafael",
    "date": "2024-06-19",
    "content": "Stupid question but does anyone here mix into OTT? The more I play with it the more I find it super useful in most pop/edm genres, but the default setting somehow makes it difficult to move things around in the mix, even with the mix knob at 10-20%. I recently discovered that you can disable upward/downward compression per band, which makes it even more versatile. What's your experience with it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1253780660980547615",
    "author": "Nomograph Mastering",
    "date": "2024-06-21",
    "content": "But as ever it’s genre and discipline dependent",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1256312450874343435",
    "author": "Jonathan Jetter",
    "date": "2024-06-28",
    "content": "Thoughts on managing a vocal that sounds like it was recorded right by a huge pane of glass? Every note is comb filtering in a slightly different way. In a genre that mostly needs to be slick/clean/present but natural, neither heavy saturation nor big washy reverb is really an option.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1264002337584975923",
    "author": "Josh Bowman",
    "date": "2024-07-19",
    "content": "Bedroom #4 (or 6 cant remember) on bass with some distortion on an indie rock mix is ☠️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1265842097731403899",
    "author": "Bryan DiMaio",
    "date": "2024-07-24",
    "content": "Maybe there's also some leeway in the genre to get creative with your sound and lean into something to make it seem like things are intentional",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266075211925553205",
    "author": "Iwan Morgan",
    "date": "2024-07-25",
    "content": "I know next to nothing about how this genre is supposed to sound, and this vid is interesting in the way he talks about heaviness and perception. Some of the mixes sound quite small, which is the opposite of what I would expect.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266075676411428905",
    "author": "hyanrarvey",
    "date": "2024-07-25",
    "content": "I mean I know the genre like the back of my hand but I wana know what you guys are hearing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266077639064420564",
    "author": "hyanrarvey",
    "date": "2024-07-25",
    "content": "It’s cool to hear what ya’ll think who are disconnected from the genre",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266096659331551232",
    "author": "spectrummasters",
    "date": "2024-07-25",
    "content": "….interesting stuff , totally not my genre of expertise . I think the last time I listened to any guitar music with kick drums this fast was slipknot lol , so I know nothing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1266099721588703325",
    "author": "Edward Rivera",
    "date": "2024-07-25",
    "content": "Overheads rarely need anything but a low cut (genre dependent) just set the level and maybe bump them up on some big hits",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1269297738827436134",
    "author": "Matt Huber",
    "date": "2024-08-03",
    "content": "I am but a newbie to this world of hardcore / metal. I am excited to be doing more of it but I bow before the greatness of the many more seasoned metal / hardcore folks on this channel (you know who you are). \n\nIt’s such a unique genre with very unique mix values / expectations. It’s been invigorating to learn!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1269298545421193286",
    "author": "Matt Huber",
    "date": "2024-08-03",
    "content": "Which leads me to a question for all you folks who mix a lot in the genre: \n\nA lot of artists I know have expressed a feeling of being bored with how homogenized a lot of harder music has become sonically. \n\nWhat is your sense on where things are headed sonically? What feels tired, what feels like the “future” of the genre?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1269304137024278620",
    "author": "Matt Huber",
    "date": "2024-08-03",
    "content": "Also I will admit that I get lost in the sub genre distinctions. I feel like an idiot talking about it sometimes.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1269304470798467164",
    "author": "hyanrarvey",
    "date": "2024-08-03",
    "content": "Oh dude it’s okay there’s only 300 sub genres of metal cmon man it’s easy",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1269304950161408011",
    "author": "hyanrarvey",
    "date": "2024-08-03",
    "content": "https://open.spotify.com/track/08OQSAcnE0wAvvq1altfFp?si=TO5XpB0KS86By-h9yhHVHg it’s wild how the genre defines the mix for these bands",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1273023675922382920",
    "author": "stewart_hidalgo",
    "date": "2024-08-13",
    "content": "I didn't know that Tchad mixed those. Great sounding records. My favorite rock mix from that time period was Queens of The Stone Age ...Like Clockwork. Need to hear this new Interpol now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1281672955453112382",
    "author": "EliHeathMusic",
    "date": "2024-09-06",
    "content": "I’ve been thinking a lot about how I deal with resonance and unwanted harshness recently and would love to hear about how you all approach this (and maybe more broadly how you think about restraint and taste when using modern plugins). We have so many powerful tools at this point for cleaning up audio (eq, rx, soothe, spectral shaper, de-essing, etc) but when I listen closely to a lot of my favorite recordings from the last 70 years I’ll hear all sorts of weird resonances and abnormalities. \n\nOver time I’ve been getting better at finding a balance of how far to go with these tools and have also become aware of how easy it can be to go overboard sometimes. Beyond reps and intuition, are there things that have helped you hone in on this? And are you consciously adjusting your “threshold” based on the music or genre you’re working with or do you have a general taste for how you like to hear things regardless of the style and use other tools to get the character and vibe you’re going for.\n\nIn other words, do you think about how far you go with these tools as a creative and stylistic decision or more of a functional one?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1285217319349649502",
    "author": "spectrummasters",
    "date": "2024-09-16",
    "content": "If the friends are likely knowledgable / fans of the genre of the work produced …..I’d take it as useful “field research “ and accommodate it . If they are just armchair producers / mixers not actively creating anything themselves …..I’d rather they respected the process that already happened . Tricky one .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1297210129451581484",
    "author": "Nomograph Mastering",
    "date": "2024-10-19",
    "content": "Hmmm, you don’t sound like you need extra talent. I’d suggest someone with a lot more experience, even if it’s in a different genre. The answers here are likely not going to be specific mix notes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1300892484682911784",
    "author": "thegreatcarsoni",
    "date": "2024-10-29",
    "content": "In kind of a weird spot on this rock mix today, I've got the bass and drums feeling real good but when i bring in the rhythm guitars (heavily distorted, double tracked, stereo riffage)  i feel like it masks a lot of the good stuff going on in the bass and drums. But when I start carving or manipulating the guitars to \"leave room\" for the bass and drums I lose that wall of sound feeling. Any ideas here?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1313872868580261919",
    "author": "Chad Rodgers",
    "date": "2024-12-04",
    "content": "Working on an indie pop mix at the moment that’s sounding a little clean and also a bit pokey with the transients. But otherwise it sounds good and I don’t want to add compression or clipping and squash the thing. \n\nI suppose I could saturate to my heart’s content but I wouldn’t mind going a bit weird with it instead and creating a parallel “everything” send before the mix bus with something like an echorec, echorec, space echo, or even a room emulator to add a bit of life into it, glue things together and give it a bit of a band-in-the-room feel. Does anyone have a way of doing this kind of thing that’s worked for them? I guess I’m kinda referencing Bleachers’ last two albums for that fun room vibe where it feels like everything is sitting in a unified yet slightly off-kilter space. I’m just mixing this one so I didn’t have the option of making those decisions at the tracking / production stage.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1319017923637153852",
    "author": "Zach Hughes",
    "date": "2024-12-18",
    "content": "It’s a pretty fresh artist project with no real comp or previous body of work to compare to. I got a Spotify list of some ref tracks that were somewhat helpful for genre painting a lane though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1320553766017175593",
    "author": "hyanrarvey",
    "date": "2024-12-22",
    "content": "Yeah I feel like pretty much every song on the pop radio and probably other genres  is going through some multiband 2 buss",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330676062904127488",
    "author": "Jeremy Klein",
    "date": "2025-01-19",
    "content": "Oh shit didnt know Cervini was using that Splice Travis Punch Kick! When i was doing more rock mixes 2 years ago, that kick was my cheat code. Just replace their kick with that one and the mix was 90% there hahah",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1330935091651936348",
    "author": "Zack Hames",
    "date": "2025-01-20",
    "content": "Does anyone use Tape Machine plugins on their mix bus regularly? anyone have strong opinions on this?\n\nI find myself using them often (especially on rock or indie mixes) mostly to attempt to emulate a lot of my favorite sounds even if subtle. But I am questioning if it's doing more harm than good or if it's just placebo.\n\nobviously, if it sounds good it is good - but I am wondering if there's a more effective way to chase that tape sound whether it's subtle or dramatic, or if I am causing more harm than good.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1336749734039388270",
    "author": "Zack Hames",
    "date": "2025-02-05",
    "content": "I mean…dare I say use samples if the genre is appropriate?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342616798356307998",
    "author": "Rollmottle",
    "date": "2025-02-21",
    "content": "i wouldn't describe that record as particularly harsh either. it's brighter than is typical for Metallica and the genre, but it doesn't read as harsh to me in the slightest.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342690467703423077",
    "author": "Jonathan Jetter",
    "date": "2025-02-21",
    "content": "I love metal, grew up on it, know it deeply, but actually hard for me to think of metal mixes I love.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342691723503210528",
    "author": "Jonathan Jetter",
    "date": "2025-02-21",
    "content": "Rare to find real feel + groove in the genre. When it is there, massively helps the mix.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1342693338431881216",
    "author": "Jonathan Jetter",
    "date": "2025-02-21",
    "content": "A really skilled melodist is also fairly rare in the genre, and similarly also massively helps the mix",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1343720673490632705",
    "author": "Josh Bowman",
    "date": "2025-02-24",
    "content": "One of our mods @cian riordan wrote a great post on the lwmr site about mixing drums if you haven’t checked it out, it’s worth a read!\n\nhttps://www.livewithmattrad.com/mixing-drums-cian-riordan\n\nyou might get some more helpful advice by asking for it in the collab channel and seeing if anyone is willing to give the mix a listen. It’s really hard to comment on something like this without hearing it. \n\nDon’t be afraid of some samples! It can help especially in radio rock mixes. \n\nI loled at your roomba comment, been there! Try not to get so in the weeds with soothing and “fixing” that you loose the actual recording. Maybe see if you can bring out the good stuff, as opposed to just getting rid of the bad? If that makes sense…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1345035104334123130",
    "author": "SoundsLikeJoe",
    "date": "2025-02-28",
    "content": "How do you present your mixing work to prospective clients?  Playlists are an answer...  but do you structure by genre, or blast the best of everything, or etc.  Making a playlist right now and I've cherrypicked a 1hr set from a few artists.  Omitting many others.  Worried that some might take offense.  🤔",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1351587805226074214",
    "author": "hyanrarvey",
    "date": "2025-03-18",
    "content": "must be nice recording genres where the drummer is allowed to push and pull /s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1352475214268862504",
    "author": "zeno",
    "date": "2025-03-20",
    "content": "building on this question - i'm mixing a track and the producer bounce is averaging around -2.7 LUFS 😵‍💫  i'm attempting to compete because i love pain, but in reality - is it wise to deliver a mix that loud? FWIW the loudness suits the genre (modern pop / riot grrrl)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1358491972330848494",
    "author": "Val ᶠʳ",
    "date": "2025-04-06",
    "content": "Depending on the genre, I tend to start with kick or vocals, but more like a back and forth process between soloing and balancing in context.\n\nI really like \"shaping\" the sound in mixing, before thinking of balance, (I feel guilty saying it, haha !) But I work almost exclusively with local DIY bands, who record themselves, and give me unprocessed stems, so it's not exactly \"pure mixing\", I guess it blends a bit with a sound production approach.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1359317534095966238",
    "author": "Sei046",
    "date": "2025-04-08",
    "content": "Guys something I’m struggling with lately is getting something to sit behind, lets say a vocal. Let’s say it’s a drum kit, stereo acoustics, bass etc. I’m struggling to maintain a solid and clear kit that doesn’t get in the way of a vocal in something like a country genre for example. \n\nIf I want the snare good and bright and present but not seem like it’s at the same plane of the vocals. Transient control, room ambience, obviously pure level? \n\nAny thoughts on this? I suppose I’m talking about front to back depth but without making it seem too obvious. I see some guys using compression over the instrument buss that’s grabbing the instruments and holding them at a certain level and letting the vocal Poke above. I’d imagine this contrast in attacks would create that separation. \n\nAnother example might be having a tambourine or shaker that inherently have a bright and transient nature that is also able to appear as if it’s not up front.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1361787792778072228",
    "author": "@lmmaudio",
    "date": "2025-04-15",
    "content": "Hi all. Quick question; and feel free to refer me to another channel or thread within the server if said question don't belong here. I'm looking for multitrack sources to practice with. I've already mixed some from Cambridge website, McDSP as well and ProduceLikeAPro too; so I'm getting short on sources. Mainly looking for pop, pop-rock, rock, country, etc... and all adjacent genres; since they are not usually the genres I daily work on and I really need to learn them. Thanks in advanced!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1363909647278539003",
    "author": "@lmmaudio",
    "date": "2025-04-21",
    "content": "Man, interesting. I do the same gentle filtering about 3dB/oct on the high-end at 18k or so; but only on the Mid part of the signal and at the same time go additive eq on the Sides, but with dynamic mode. Normally on latin music styles like salsa, boleros and more traditional genres this move behaves very well opening the top end and preserving the sheen of the transients; which are normally a lot. Good to know I'm not the only one going with this approach.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1385367722937942230",
    "author": "Gabriel Tyranny",
    "date": "2025-06-19",
    "content": "Anyone here have any principles / tips for automating vocals? (I think of principles as the closest thing to a rule that is a core concept that isn’t as rigid as a rule but is something to keep in mind)\n\nFor anything to do with vocal automation: efficiency, quality, genre specific, etc.\n\nFor example, I find myself using a mouse to automate vocals. It takes hours as I go syllable by syllable then relisten to line by line then in context of the section then in the song etc. I burn myself out doing it, and it’s my least favorite part of all music creation. I want to see if there’s a way I can use a fader, or perhaps have a mindset where I’m not so intense about it. I’m sure I’m going overboard, but lack confidence in knowing if it works aside from trying, using my ear, tweaking, listening, etc etc over and over.\n\nAnything to do with a standard workflow, mindset, techniques, etc. could help me improve this part of the work. Or perhaps, what I’m doing is the deep work and there is no shortcut?\n\nI’m very invested in anything anyone could contribute on this topic. It feels like my mixing nemesis.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1389405881854066718",
    "author": "JustinLeu",
    "date": "2025-06-30",
    "content": "Do they just want it to feel more “epic”? What genre?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1390700224292585596",
    "author": "nachomaquieira",
    "date": "2025-07-04",
    "content": "It all depends on the recording, the genre, how much dynamic range it needs, and whether it's competing with other elements. When I’m going for something transparent, I usually go with the ToneProjects Unisum on the insert, hitting just the louder peaks very gently, 1, 2, 3dB max. Then I add a subtle parallel comp (just as much as it helps) using something more aggressive, the SSL G Bus Comp often works great for that, also like the la2a if a slowerish releases fits into the song.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1392949040903094395",
    "author": "Jonathan Jetter",
    "date": "2025-07-10",
    "content": "I think most genres are totally good w song to song differences, but especially rap.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1400299251942297653",
    "author": "Juliette",
    "date": "2025-07-30",
    "content": "The one song I've been working with for a bit now is alt-rock. But I've also been forcing myself to work with a lot of different genres at the moment (indie pop, rap, metal) in order to see if I'm able to mix them and have it sound good (playable).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1400300050050973767",
    "author": "Juliette",
    "date": "2025-07-30",
    "content": "Someone once told me that a good mixer is able to mix anything. And I honestly struggled with that notion for a long time-- I thought, *why would someone seek out the guy who exclusively mixes melodic death metal for this folksy midwestern project?* But I realize now that almost all skills often will translate across songs and genres too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1406016528561864756",
    "author": "Zach Hughes",
    "date": "2025-08-15",
    "content": "@Edward Rivera you mean like genre wise?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1407759022731558946",
    "author": "Tristan",
    "date": "2025-08-20",
    "content": "Loving @hyanrarvey hot takes! I’m a kick out guy 🙈 , but genre informs that for me. Sub kick can be sick for sure",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1443060885676363847",
    "author": "Chris Lyon",
    "date": "2025-11-25",
    "content": "From my experience, if you focus it on low mids rather than harsh unpleasant frequencies while sidechaining, it can make room for the body of vocals or important instruments to cut through.\n\nA lot of the time, those resonances are the defining characteristics of each sound so side chaining even to harsh high-mid info can allow the character of a focus track to cut while limiting the stacking of those possibly harsh frequencies with other tracks. \n\nExperiment with the sidechain in mid/side unlinked and you can get more aggressive with sidechaining the lead vocal to the instrumental. In a dense pop mix, it can be a lifesaver.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1446609738199466208",
    "author": "thegreatcarsoni",
    "date": "2025-12-05",
    "content": "Guys i'm knee deep in a rock mix that i'm realizing actually needs more of an EDM sound, and I don't have any experience mixing that genre, I'm just not getting the kind of pumping movement or sweet clarity I need from this and I'm starting to get super in my head about it. Any suggestions? Track has a lot of hyper-pop kinda elements along with breakdowns and stuff. Very all over the place and it's feeling tough to wrangle.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1457912308700287011",
    "author": "hyanrarvey",
    "date": "2026-01-05",
    "content": "I am usually around -8-7 lufs no 2 buss processing in a rock mix",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  },
  {
    "id": "1468320851719098418",
    "author": "James Cronier",
    "date": "2026-02-03",
    "content": "Currently on a pop mix where I need this. Time to read the manual.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false
  }
]