[
  {
    "id": "1279089338293944332",
    "author": "Luke DeJaynes",
    "date": "2024-08-30",
    "content": "Wanted to shout out @Gerhard Westphalen for recently re designing my control room.  I’d been in there 11 years and it sounds way better than ever.",
    "reactions": 33,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1280297755243446385",
    "author": "Ross Fortune",
    "date": "2024-09-02",
    "content": "I met Nile a few years ago when my boss had a writing session with him at Abbey Road studio 1. I set up a rig to continue editing vocals for a Hot Chip album in one booth, while they worked away self contained in the main control room. \n\nNile had been a huge influence on my old band, and Hot Chip had been part of the soundtrack to my college years. Weird working on one on headphones while watching the other grooving away on The Hitmaker through the glass. \n\nIt was a real “this is pretty cool” moment.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1092587925209894992",
    "author": "LAPhill",
    "date": "2023-04-03",
    "content": "I propose the LWMR drinking game: When Ruairi says \"trade offs,\" do a shot. When he says \"speakers against the wall,\" double shot. Referencing Paris' studio build? Keg stand.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079204238338568283",
    "author": "oaklandmatt",
    "date": "2023-02-25",
    "content": "Your brain has all these wonderful ways of avoiding difficult things. This is because if you dealt with them all at once, it would overwhelm you. So the brain builds all these mechanisms and habits to help you survive. Therapy, meditation, self reflection, but most importantly *other people that you trust and can be vulnerable around* can help you get through barriers that your own brain has created",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1207040742351048794",
    "author": "BatMeckley",
    "date": "2024-02-13",
    "content": "Quick update for everyone: After a couple of sessions, and a good solid 2 weeks of reflection and meditation, still not finding any weakness. Just keeping you all in the loop.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1451280545525796864",
    "author": "EliHeathMusic",
    "date": "2025-12-18",
    "content": "Recently switched from Spotify to Tidal and I had the same reaction. I also can't overstate how nice it is to be able to easily access extended credits AND ALSO not know how many times something has been streamed. I hadn't realized this as much in the years that I used Spotify, but as soon as I switched off of it, it became immediately apparent how much seeing the streaming metrics as the first thing had been shaping my impression of every artist or song I listened to before I even pressed play. I think the fact that Spotify hides most credits and highlights stream counts is a subtle but very real reflection of the way that the company has been turning music from an art into a commodity.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "863187643629568020",
    "author": "Slow Hand",
    "date": "2021-07-09",
    "content": "On reflection, the material benefits of *Option #1* are a nice selling point, but I think the bigger opportunity is to harness the superpower of rendering hit music at will. It would give me tremendous sway over the music industry once everyone comes to recognize that I can't miss. I would leverage that influence to make some positive changes where I can. Set up some institutions to cultivate and nurture the next generation of artists. \n\nPresumably, while the hit music I’m making runs counter to my personal tastes, it seems reasonable that it would still be valuable to *someone*. Just not to me. That will be my curse. I would dutifully churn out hits as fast as I am able to and gift humanity with a tsunami of unimpeachable pop awesomeness that will endure for a century. My sacrifice would be everyone else’s gain.\n\nCounter-intuitively, by saturating the market with my personal brand of songwriting it would inspire the next generation of songwriters. Unable to compete with my torrent of sure-shot pop badness they would respond by writing new music that is the direct antithesis of my own brand of hits. With a little luck, the musical output of these writers would be exactly what I wished to hear all along.\n\nThat’s a win/win right there. I just have to suffer a bit. I choose *Option #1*.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1381834959979020288",
    "author": "cian riordan",
    "date": "2025-06-09",
    "content": "Simple answer, but probably the greatest thing I ever learned from EV is: \"it's all about how much you care”. \n\nIf any of you have spent time around him or seen his videos, it’s pretty clear that he goes deep on all of his productions… there’s no stone that’s left unturned, no excuse to not take it fully to the end zone. There were surely some parts of this that seemed exhausting during the record making process… it surely broke a lot of musicians sitting bored on the control room couch for weeks on weeks on weeks while he labored over their recordings.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1039435290890211348",
    "author": "Deleted User",
    "date": "2022-11-07",
    "content": "I don’t think there is a single person that was smartest or wisest. People all have different areas they are smart in, or wise in. The most intuitive, most empathetic, most knowledgeable (in ____), etc\n\nI don’t really know what smart means, but people that appear smart are very nuanced about the things they don’t know or understand. They can articulate what they know, they can put things together with intuition, they can develop ideas and concepts without being fed one.\n\nMy observations of people with great wisdom seem to be the people who spend great deal of time processing emotions and self reflection. And they share what they learn from the place of empathy. \n\nI had a guitar teacher, he never gave me “real answers” to my questions. He always told me at the end of his version of guidance and helpful tools or some joke (again not an answer)“you’ll find the answers to any questions inside you”. Which was a wtf moment to me because I wanted the answer right then and there- but I realized often times a lot of things that are not factual cannot be answered by anyone but me because even if anyone gave their own version of answer it would not be relevant to me or I wouldn’t understand any of it unless I can make sense of things myself. That was one of the greatest and live changing advice I have received in life.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1074408091677892778",
    "author": "Slow Hand",
    "date": "2023-02-12",
    "content": "Nah. That's great. \n\nI still remember my very first studio internship where I was assisting. The owner walked me into the control room and the first thing he told me was \"Rule No. 1: Don't open your fucking mouth. If you have an idea, keep it to yourself. This room is going to have enough opinions in it as is and nobody needs another idea in the mix.\"\n\nHe probably said it (a little) nicer than that, but the message was unambiguous.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1197400685621293077",
    "author": "Eric Martin",
    "date": "2024-01-17",
    "content": "Unsung hero of studio builds",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1245134660351299645",
    "author": "Zack Hames",
    "date": "2024-05-28",
    "content": "The exposed knee absorbs reflections at 420hz and 690hz",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1348776357521264771",
    "author": "Nomograph Mastering",
    "date": "2025-03-10",
    "content": "No problems here in the soundproofed box!",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093031361583005697",
    "author": "Zack Hames",
    "date": "2023-04-04",
    "content": "Are there any good resources or tips for wiring electrical for recording studios? I’ve done *some* but not from scratch and not without guidance. \n\nClosing on my new house (*!!!!!*) on Friday so I’m starting to mentally plan some of the home studio build, want to prepare.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235086551420112916",
    "author": "Rollmottle",
    "date": "2024-04-30",
    "content": "If you want to do it pro(ish), anywhere from $5k to $7.5k should get you in a respectable ballpark. You can certainly do it for less, but if you want decent, that seems around where I'd be aiming. Interface, mic, mic stand, handful of plugins, room treatment, Kalis, DAW",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "832740064450183238",
    "author": "Slow Hand",
    "date": "2021-04-16",
    "content": "Haha yeah. Reminds me of a story from the lapsteel player on Dylan's *Blood On the Tracks*. He was all by himself in this huge tracking room overdubbing lapsteel. After a few takes there'd be a pause while he waited for judgement from the control room. Eventually Dylan stepped out into the live room and got right up into the guy's face and said something really condescending to him about when to play. As Dylan turned away the guy describes having \"nothing but contempt for Dylan in that moment\" and he got super defiant and went into \"Fuck you, Dylan\" mode on the next take. Once the take was done he was left in silence to wonder. And as he squinted into the control room he could see everyone laughing their asses off. Apparently the whole think was a ruse by the control room to get a certain performance out of him.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1047227118209216532",
    "author": "Jeremy Klein",
    "date": "2022-11-29",
    "content": "i saw an illangelo (mad respect for his musical skills) ig story that said something to the effect of “808’s are popular because of their demonic frequencies, and we all know demons hide in corners which is why we have to put bass traps there”",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1102304933937692783",
    "author": "Slow Hand",
    "date": "2023-04-30",
    "content": "I don’t see anyone getting kicked here. You voiced an opinion and Matt made a well reasoned reply.\n\nIf anything, you representing his reply as “Nope, fuck you” is not in good faith. Try not to think of his response as a reflection on you. Nobody here thinks less of you for it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1340473571142668308",
    "author": "oaklandmatt",
    "date": "2025-02-15",
    "content": "@hank01564 One of the reasons LA is so dope is that there's SO much space and SO many people trying to do things. \n\nCould be a small room, could be a shitty neighborhood, could be poorly soundproofed. \n\nCould also be a real estate guy who is getting a deal (commercial real estate is in a weird place). Could be he doesn't know what he's doing and under charging. Could be a vanity project where he's not trying to make serious money. \n\nCould be lots of reasons. Some mean it's no good for you, some mean you get a steal.\n\nI've had both situations in LA. Always worth exploring.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1358343482653016144",
    "author": "thegreatcarsoni",
    "date": "2025-04-06",
    "content": "Re; notes conversation, got a bunch of notes back on 3 songs I had really strong feelings about during the mix, really invested in it.  and definitely dealt with the instinctive gut anxiety from reading through them. Then I checked discord and MAN did that help my state of mind. Really working on seeing the intention of the notes and being open to achieving that vision rather than taking each note as a critical reflection of my ability and taste haha.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407210323861180469",
    "author": "LAPhill",
    "date": "2025-08-18",
    "content": "Noah covered it pretty well, but I'd add some reflection - How have you acted in the past when these things come up? Are there perhaps some behavioral tweaks you can make to make this experience less difficult or more enjoyable for them? Showing that you're working on navigating this with your partner goes a hell of a lot better than an it-is-what-it-is attitude.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "831268078452604928",
    "author": "cian riordan",
    "date": "2021-04-12",
    "content": "That's super fair given the circumstances of... *gestures to everything around us*. I'm lucky to be a full-time working mixer/engineer. I'm not in the stratosphere in terms of accreditation, but I'm comfortably making a healthy living, am married, have a child, and own a house. If I relied on big breaks, I'd be absolutely nowhere. 99% of my success has come from rubbing shoulders with the right people and finding opportunity that way. A night out drinking with friends leads to meeting other people who you stay in touch with. Pretty soon they'll need help with something and then off you go, that leads to the next. 75% of what I work on is smaller potatoes... most of it will never get heard, but it pays most of my salary. And the 25% of work I have that makes it through the filters has all come through connections I've made through smaller gigs. Networking is really key. And if you're a social person, it's even better as it'll help offset the time spent alone in a soundproof room, pulling your hair out over a stupid kick drum sound.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "832727145322905640",
    "author": "Slow Hand",
    "date": "2021-04-16",
    "content": "Of all the studios I've worked in, my favorites are the ones that skew towards the home-y vibe. Lots of different couches and chairs to relax on. Variable lighting. Numerous stations and tables where everyone can go off, spread out, and work on their own stuff on the side. I know that's a luxury that requires a certain amount of space, but if the control room isn't set up like an arrow in which all stations are pointing forward towards the desk/speakers I find that's a big mental relief.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138623293952360448",
    "author": "cian riordan",
    "date": "2023-08-08",
    "content": "I got padded ones so the reflections get softened upon impact. I only get a soft, pillowy reflection which is nice because most the music I work on is hard AF",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1209241344590221333",
    "author": "spectrummasters",
    "date": "2024-02-19",
    "content": "I am always struck by the depth of the reflection that was required to distill a profound realisation into something easily said and easily understood . It’s a beautiful thing imo",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266442200007315466",
    "author": "Eric Martin",
    "date": "2024-07-26",
    "content": "control room current sounds insane",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1328790636866048040",
    "author": "Zach Hughes",
    "date": "2025-01-14",
    "content": "He believes that losing your daylight is “the deepest form of distraction,” and you may even begin “decohering.” This is when you stop making sense to yourself, because you don’t have the mental space to create a story about who you are. You become obsessed with petty goals, or dependent on simplistic signals from the outside world like retweets. You lose yourself in a cascade of distractions. You can only find your starlight and your daylight if you have sustained periods of reflection, mind-wandering, and deep thought. James has come to believe that our attention crisis is depriving us of all three of these forms of focus. We are losing our light.\"",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1394429044547911771",
    "author": "BatMeckley",
    "date": "2025-07-14",
    "content": "And to be totally clear, never has that small difference been worth more than anyone’s ear or ability. I remember when Ableton DID actually sound worse there were a couple of Canadian producers that would sit and absolutely BURY people with the beats they’d be printing off their laptops while sitting on the couch in the control room.\n\nIt’s like when we’re talking about guitar bridge material and it’s like “let’s hear some examples of you’re playing first to see if it will make a difference in your end result”.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "827233738110795807",
    "author": "cian riordan",
    "date": "2021-04-01",
    "content": "I saw this mentioned on one of the vocal production episodes and I don't fully agree with it. If you had a perfect reflective surface that reflected back at a 180-deg angle into the null of the mic, that might be the case. But thats very rarely what happens in the real world. The cardioid pattern is shaped like a kidney and does stretch beyond the x-axis of the diaphragm, ultimately picking up lots of reflections from behind the plane of the capsule. Put a condenser microphone on a floor tom, under a cymbal and you'll hear what I mean. Or try singing into the backside of one. It sounds awful. Often, its the shittiest of the phasey reflections that get in through the back, so it's definitely worth treating. To your point, still lots of value in making sure behind the singer is treated as well as those reflections will likely be much more broadband. But given the size of this space (it small), I'd use all the help I could get in there.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "832764989806739497",
    "author": "Eric Martin",
    "date": "2021-04-16",
    "content": "there is an aesthetic middle ground, there a producer and mastering engineer in MSP that are neighbors in the same building and everything in both spaces is basically all white. White walls, white acoustic treatment, everything. I can’t handle that at all.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "890267396558979073",
    "author": "cian riordan",
    "date": "2021-09-22",
    "content": "Density is your friend. The heavier the wood, the less audible/tactile resonance you'll have... especially if you plan on putting your speakers on top. Worth considering integrating some sort of soft-top surface to cut down on midrange reflections from the speakers... if you're looking to go down that rabbit hole 🙂",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "966083419459170354",
    "author": "NoahNeedleman",
    "date": "2022-04-19",
    "content": "I got into the two screen solution doing a Movie score. The director sat in the back and watched the footage while My partner & I were focusing on the DAW screen. Now I put my Edit screen up there so im not looking down all the time. Much better on the neck. \n\nAlso it has the added benefit of showing musicians where we are in the session- I do a lot of control room recording and it’s super informative for that. \n\nAnd for writing sessions- having the lyrics on the big screen puts us all on the same page as well. Literally and figuratively. \n\nEveryone has their preferences ¯\\_(ツ)_/¯",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069071273398898790",
    "author": "ehutton21",
    "date": "2023-01-28",
    "content": "I was gonna post about this, it’s a bit sidebar to the discussion at hand, but I’ve just done a very interesting experiment. \n\nMy ADHD is horrid so it took some time to do, but I’ve got a routine where I catalog my “best practices/new ideas/important tidbits” notes from the discord, and I keep two brief shorthand form journals: one for while I work on a project and another for reflection after it’s over. It helps me stop thinking about the work when I want to wind down. \n\nIts crazy too see how over the last 3-5 months of working, my mental clarity and work flow confidence improved as I had started to build a lot of the consensus tips/habits/ideas from the discord. I’ve also recorded that people seem much more pleased with my work to date.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1154842900052578334",
    "author": "spectrummasters",
    "date": "2023-09-22",
    "content": "Having been on a bit of a deep dive of the rise of populism and isolationism over the last 20 years (and there I’ll finish  the political aspect of this ) ……it keeps occurring to me that what matt achieved in the. Global pandemic with the lives and catalysing a community like this discord ……I’d a profoundly beautiful  inspiring testament to our humanity and that in the face of the unknown , the abyss …….as it looked then …..music served us all again and brought us together in community and discourse . Thanks matt and thanks music . And LWMR . I be missing ya !",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221925093169692742",
    "author": "Ross Fortune",
    "date": "2024-03-25",
    "content": "Side note, Laurens Hammond (inventor of the Hammond organ) also invented the first “tickless” clock, with a spring motor housed inside a soundproof casing.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235224634270416896",
    "author": "Bryan DiMaio",
    "date": "2024-05-01",
    "content": "I mixed quite a lot of stuff without any room treatment when I was living in LA, it's doable starting out. Still a lot of guesswork but if the budget is tight that's something that can be added later. Getting like an interface and a DAW and a mic so you can at least record something, while throwing some moving blankets and DIY stuff up builds character lol",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1298026748532756491",
    "author": "Rob Domos",
    "date": "2024-10-21",
    "content": "Hot take, any thin shield like this that has hard backing will make your recording sound worse.  Your goal is to get as little wall reflection as possible and thin panels with hard backing is just bringing the wall closer. I’d recommend looking into building some Gobos. Lots of info on that floating around",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1298034008814518342",
    "author": "BatMeckley",
    "date": "2024-10-21",
    "content": "I’ve got one of those GiK ones in my booth… all thin hard surfaces aren’t equal in terms of sound transmission, and my experience with it is the frequencies low enough to make it through the padding are pretty much low enough to work around the heavily perforated backing. \n\nTLDR, it was useful in drying out some particular reflections in my vocal booth, and I’m glad i have it. Not the be all and end all, but has been a useful help.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1302421307090145362",
    "author": "Nomograph Mastering",
    "date": "2024-11-02",
    "content": "https://www.tmsoundproofing.com/mass-loaded-vinyl/",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1343256034453753886",
    "author": "hyanrarvey",
    "date": "2025-02-23",
    "content": "I’d love to see more like what did you use on this record and what’s the intent behind it or just like fun control room stories etc",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "819601679770189845",
    "author": "kooj",
    "date": "2021-03-11",
    "content": "can anyone point me in the bass trap direction? DM’d matt asking about that big circular bass trap you see in the lives behind him and he said there was a detailed discussion about it on the discord somewhere..  thanks!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "824769980724805702",
    "author": "hendrick",
    "date": "2021-03-25",
    "content": "after watching a couple videos turns out and AA isn’t really fully flattening the curves so that’s a big no for me. regarding the room simulation I wasn’t really impressed either, one of the rooms sounded like it had a lot of early reflections and it was confusing to me so i don’t think i’ll cop",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "832738969007161364",
    "author": "Zack Hames",
    "date": "2021-04-16",
    "content": "It’s been back and forth for me. I was desperate for going back to a control room, but communication is so easy when you’re in the same room. Something to be said about production in the same space, even if it’s drums and stuff.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "958134389684965456",
    "author": "jantrit",
    "date": "2022-03-28",
    "content": "I worked in kitchens for a long time, it allowed me to make some cash and live but also have flexibility to take music and studio jobs when they would come around. After moving to the states I found more restaurant work but kept it to only fri/sat/sun and tried to focus the rest of the week to build contacts and do studio stuff. I got super lucky with my boss who was also in the music thing and very understanding about calling out. It eventually got to the stage where I had to call out like 3 weekends in a row so I made the jump to doing the studio stuff full time. So far it’s been working out and I’ve been lucky to keep a good basis of projects, supplementing quiet periods with studio build stuff. It can be super stressful relying 100 percent on the music thing and it’s ultimately different strokes for diff folks. I’ve seen some people who get really burnt out taking music stuff that they don’t like to pay the bills and conversely I’ve seen people getting burnt out doing other stuff that’s not music getting effected in the same way. Ultimately whatever keeps ya happy and works for you is awesome, burn out is real.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1073332025743908925",
    "author": "Nomograph Mastering",
    "date": "2023-02-09",
    "content": "Thanks man. That playlist is very carefully curated for monitoring tells, every track on there reveals something about speaker/room performance. They’re not necessarily all cool, or a reflection of our taste",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1083839971175190568",
    "author": "kidcutler",
    "date": "2023-03-10",
    "content": "This was in an adjoining room, if it’s in the control room probably not so helpful, did sessions for an artist in a loft and they were watching a projector over my head and that fucking sucked/opposite of what you want",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1093067412322127995",
    "author": "jantrit",
    "date": "2023-04-04",
    "content": "Rod Gervais has a fairly simple breakdown in his studio build book. Covers a lot of stuff you’ll want to think about.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1095646017174655007",
    "author": "spectrummasters",
    "date": "2023-04-12",
    "content": "@Nomograph Mastering  You have a gift for concise summation man .  “ Putting an elevator on Everest “. .....”if the alchemists succeeded gold would be worthless “ .Super  concise and super precise . I’d appreciate a pocket sized book of ruairisms at this point . It would sit well alongside my thich nhat hanh pocket book I always carry : They  say a good teacher reveals to you what you already know and I seem to always get this sensation when considering your points ruairi. I’m currently enjoying your latest conversations pod and your reminder about adding value . Have to say I lol’d at “creativity is a pretty low energy concept at this point “ ! Anyhoo, don’t mean to sidetrack the thread here ...will return with some valuable reflections/questions  on your conversations pod if I may in coming days .have a great day all",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104742103604547675",
    "author": "cy (sigh)",
    "date": "2023-05-07",
    "content": "don't know the specific answer but this feels related \n\nfourier is likely to be the link you're looking for. it helps seperate diff musical instrument sounds into their sine/cosine waves  (harmonic spectrum) \n\nthe physics of instruments themselves and how theyre constructed is directly related to how sound pressure creates and multiplies  the fundamental frequencies that are being played /created. if you playa g on a horn, the space, shape and material of the horn determines the specifics of the reflections which will change the timbre of an instrument (including the amount and type of harmonics). one of the reasons there's so many diff type of the same instruments\n\nalso it's above me at this point (been a while since I had to use any of this) but you can use a harmonic equation to determine the sound an instrument will make to an extent - it's a convoluted equation if I remember correctly lol.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1115431174458834956",
    "author": "LAPhill",
    "date": "2023-06-05",
    "content": "I know you're joking, but what is the point of spatial audio? To immerse the listener in a world of music. To create a 3D experience. Why? We can go outside and listen to a band in a room and hear reflections all around us. But there is a chance to go deeper with spatial audio, to create something hyper-real, as much of record making has always been. Every new technology has the opportunity to enhance or detract from our experiences, and we have to meet them where they are. Maybe Atmos ain't it, but as someone who spends a lot of time in surround.. there is a feeling to immersing yourself in sound that isn't going to come from two speakers. So yes.. mixing in Atmos can very much be a part of steering the ship.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138623095083651293",
    "author": "LAPhill",
    "date": "2023-08-08",
    "content": "nah, arm rests introduce too many reflections",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1139537786999935046",
    "author": "spectrummasters",
    "date": "2023-08-11",
    "content": "Oh man I’d love to discuss it with you when you have had your own reflections on it . He’s really a great thinker",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1192304227461124116",
    "author": "Rob Domos",
    "date": "2024-01-03",
    "content": "That’s a great practice. I’ve been doing daily reflections of “what traps did I fall into today”. To foresee those traps and plan to avoid them before entering into a space seems like the perfect next step",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1195387141631512606",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-01-12",
    "content": "This is not about this song in isolation, but I feel like I see more big name singles recently that have had a single reference song the entire thing is built around. The \"Greedy\" song that's topping the charts is so close to 'Promiscuous' as well, we're in an era where we keep getting a lot of \"Old Hit 2.0\" and I wish there was a little more art going into it. These are some of my favorite producers doing it too (Max/Ilya, Tedder/Harris). \n\nMaybe I was just more oblivious previously but I don't remember it being this on the nose in the past with top tier releases",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1199538333999706242",
    "author": "Slow Hand",
    "date": "2024-01-23",
    "content": "That would not be a problem. We're currently in the middle of a three-room studio buildout.\nFeel free to DM or email me if you have questions:\nhttps://www.unfckprojects.com/",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1248691863515430923",
    "author": "joshbonanno",
    "date": "2024-06-07",
    "content": "most instances of the thin acoustic panels do a lot in most commercial restaurant spaces actually...its just trying to dull things a few dB...not make a perfect sonic environment. as for the price...yeah, its expensive, but most places don't care...its a restaurant. when you factor in the fact that the companies are providing a solution, are licensed to hang things above peoples heads in a commercial environment, have made sure the panels are fire rated...where they are hung pass code for sprinkler etc...you realize the cost is warranted.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1269695712862535690",
    "author": "Dereck Blackburn",
    "date": "2024-08-04",
    "content": "Having been through a home renovation and full studio build myself, I had a difficult but meaningful conversation about expectations haha. Happy Sunday.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1271847434175123519",
    "author": "chrissorem",
    "date": "2024-08-10",
    "content": "I agree I’d trade off some acoustic advantage to work in a place like this. I’d also probably make a decent control room in one of the rooms",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1275055279041413152",
    "author": "spectrummasters",
    "date": "2024-08-19",
    "content": "Good quote \n\nReminds me of “wisdom is the reflection of knowledge “",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1279588375736615006",
    "author": "David Fuller",
    "date": "2024-08-31",
    "content": "nature's acoustic treatement",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1297980158212571147",
    "author": "cian riordan",
    "date": "2024-10-21",
    "content": "The SE reflection filter?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1315317909878214707",
    "author": "Chase H",
    "date": "2024-12-08",
    "content": "@Nick Stetina wrapping up my bass trap building and will end up with some extra 2lb MLV, and 1lb MLV.  In the off chance you could use it, it’s yours for free you swing up through Milwaukee",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1378566756150284380",
    "author": "bobby k",
    "date": "2025-05-31",
    "content": "i just see it as a prompt for self reflection. maybe seems similar to zodiac, except the fact that you're choosing the \"personality type\" that you connect with and use it to explore your own brain. zodiac kinda silly to me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "811823537215635476",
    "author": "rae",
    "date": "2021-02-17",
    "content": "I’ve used studios with dimmers before and that’s all been okay, but I haven’t used ‘sensitive gear’ in the space so can’t confirm/deny on that... BUT coming from a visual arts background slanted and built in lights are best for the protection of sensitive stuff as they don’t harshly affect the object/area and they still offer enough illumination - this is a technique used in art galleries around the world to protect and illuminate priceless works but the same philosophy could be applied to studio design 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "817490777067225118",
    "author": "cian riordan",
    "date": "2021-03-05",
    "content": "I've always preferred it off because then you get good high end absorption as well. Depends how 'dead' your room already sounds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "817969415559446549",
    "author": "kevinm",
    "date": "2021-03-06",
    "content": "Try calling this number (916) 768-6271 (it’s the sales agent at Owens Corning for pipe insulation named Dan) and ask who stocks it in town",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "824032492972933120",
    "author": "kevinm",
    "date": "2021-03-23",
    "content": "Does anyone know where to buy Owens Corning 703 and 705 in the LA area?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "824033836777603103",
    "author": "cian riordan",
    "date": "2021-03-23",
    "content": "RBH Insulation in Hawthorne. They have lots of other acoustic-ey stuff like MLV and sealant. I just did a big studio build and the prices were very reasonable and will let you pick stuff up so you will save a ton on shipping vs. online places.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "827231187415597096",
    "author": "kidcutler",
    "date": "2021-04-01",
    "content": "Always going to be tough in that tight of a space. The reflection filter is usually unnecessary, cardioid patterns nulls are pretty specifically designed to pick up what is in front of it rather than behind, so more energy should be put into the space behind the vocalist",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "827236804242571346",
    "author": "Dodgy",
    "date": "2021-04-01",
    "content": "I put foam on the wall behind my monitors and the wall behlnd mixing setup to cut reflection, room is super dead not sure of thats good or not",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "827237237460303932",
    "author": "Dodgy",
    "date": "2021-04-01",
    "content": "Do you think there is anything I should change about the vocal area? I was thinking about removing that reflection filter already actually",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "827247663921496095",
    "author": "cian riordan",
    "date": "2021-04-01",
    "content": "In a space that small, as much absorption as you can have will help you. Do you have a bigger room to record in or do you need the isolation? You'll likely get better sonic results if you can find a room with some more volume... that will also allow you to play with position in front of the microphone. As far as the level you should record at, if you've got any half-decent mic pre than you can go into the computer pretty conservatively. Assuming you don't have a super noisy chain, there'll be plenty of headroom in a 24 bit recording to bring it up after the fact. If you're looking for numbers, I'd shoot to get things into your DAW at around -18 dBFS. Many of the plugins modeled after analog gear tend to be happier with that level (or less if you're unsure).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "832737179801354251",
    "author": "Slow Hand",
    "date": "2021-04-16",
    "content": "Has anyone had a good experience in a large studio where the control room and the live room are the same space? Something like Real World Studios' *A* room. Naturally it would have it's own logistical issues around isolation, but I'm intrigued by the idea and wonder what unexpected benefits someone may have experienced.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "832997311906578482",
    "author": "alecdibell2",
    "date": "2021-04-17",
    "content": "We just filmed in this really beautiful control room. Tight squeeze though with the console and racks lol",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "845805441141047346",
    "author": "kidcutler",
    "date": "2021-05-22",
    "content": "Anyone have Rockwool recommendations? Building panels soon, is safe and sound acceptable or should I try and find a specific variation?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "872932157151150090",
    "author": "Slow Hand",
    "date": "2021-08-05",
    "content": "Just wait until you find out about standing waves inside of microwaves.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "877617349811896391",
    "author": "peterlabberton",
    "date": "2021-08-18",
    "content": "Anyone have any thoughts/experience with heavy curtains used to kill reflections in a room and *maaaybe* reduce a tiny bit of bleed out of the room? I’m covering two smallish windows and a set of French doors. Wondering if I should just get something off the shelf at, like, Target, or go for something like this: https://www.saaria.com/Velvet-backdrops.html?gclid=CjwKCAjw3_KIBhA2EiwAaAAlivYE7DPlnZB_5V9ut0Um3KlowOFVOkt2FneBuHhRfNSz-qurOGdKaBoCGPYQAvD_BwE#slide17",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "884846755496210502",
    "author": "Jeremy Klein",
    "date": "2021-09-07",
    "content": "The room has basically no soundproofing from the other rooms in the building",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "884857216560156692",
    "author": "peterlabberton",
    "date": "2021-09-07",
    "content": "That sounds a *little* high for what sounds like a kinda crappy situation (NO sound isolation or treatment), but if we’re talking a somewhat treated room with some good isolation that sounds about right, if not a bit low depending on other factors. My old room was $1600/m and had a tiny ISO and a parking space, BUT that was a result of the room sitting unoccupied during covid. When I was looking I found a load of rooms in the $2500-$3500/m range.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "884887286523789322",
    "author": "Jeremy Klein",
    "date": "2021-09-07",
    "content": "I really like the owner and location of the place im looking at so as long as they are not ripping me off I think I'll probs just go with that. The room has some treatment in it, but the soundproofing is just not good. Thankfully the rooms are far enough away where I haven't heard it be a huge problem",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "885194565651419197",
    "author": "cian riordan",
    "date": "2021-09-08",
    "content": "I know some folks looking for rooms in LA -- this one just popped up as my buddy is moving out of town. It's in the building I used to work in, except its a bigger room with it's own ISO. The rooms are extremely soundproofed and very well treated. Only 2 other rooms in the complex so a tight knit little group. It's in Glassell Park, right next to Kingsize. It's $2200/mo all in. DM me if you're interested and I'll send you over to chat!",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "887797552425086986",
    "author": "Zakhiggins",
    "date": "2021-09-15",
    "content": "Unless you have a shit tonne of bass traps in a small room, your vocal will sound very muddy and will have a not nice low end. Especially if the singer is loud",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "887798995278233650",
    "author": "Zakhiggins",
    "date": "2021-09-15",
    "content": "Idk what your budget is, and there's definitely more professional ways of doing this, but if you want a quick fix for this without spending money then I'd reccomend just getting the most thick material thing you can find and just squashing loads of it into the corners, mattress/duvets/clothing etc will work great for this, I used to make wooden frames and stuff towels into them so they acted a bit like bass traps.. Fixed a lot of low end problems for me..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "887799754447261757",
    "author": "chrisyonge",
    "date": "2021-09-15",
    "content": "I don’t have a ton of bass trapping to be honest so I’m thinking of just making the corners super chunks to start",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "887819276122198016",
    "author": "cian riordan",
    "date": "2021-09-15",
    "content": "Always. Will never use a vocal booth unless the isolation is necessary... would much rather switch to headphones in the control room.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "899383891230601237",
    "author": "Slow Hand",
    "date": "2021-10-17",
    "content": "Perhaps. I don't see why he'd would lie about something so minor and uncalled for. It seemed curious, so I figured I'd poll the room.\n\nThat said, I know Tchad Blake, in his engineering days, would place large metal plates or tubes, or other resonant objects at an angle near a mic when tracking instruments to lend a certain reflection, phasi-ness, or resonance to a sound.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "942704367902003310",
    "author": "peterlabberton",
    "date": "2022-02-14",
    "content": "My studio has one door leading to the rest of the house, which is fine—for the most part. Unfortunately, my girlfriend is just about the loudest human on the planet when it comes to, for instance, coming home from work in the evening, or making dinner, etc.. When it’s just me working alone (which is the majority of the time), I don’t care and usually take a break when she gets home anyway. But, if I’ve got clients over when she gets home, and they aren’t good friends already, it’s pretty awkward/borderline impossible to be cutting a vocal while it sounds like she’s using a chainsaw upstairs to make dinner.\n\nAnyone have experience with replacing or soundproofing doors? The current door is flimsy and hollow-core, and my guess is replacing it with a solid wood door and sealing well around the edges will help a ton. (There’s a healthy gap at the bottom currently.) Alternately, somewhat curious about this thing: https://residential-acoustics.com/shop/soundproofing/acoustidoor/ … I have toyed with the idea of completely blocking off the door and just entering/exciting the studio through the exterior door, and one or two of these things could be a decent way to do that with an off the shelf product. (BTW, I’m in a rental.) 🤷🏻‍♂️ Any thoughts/recs greatly appreciated!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "942836625019375696",
    "author": "kidcutler",
    "date": "2022-02-14",
    "content": "Sounded like a good idea reviews seem like it’s not worth it https://www.amazon.com/Residential-Acoustics-Soundproof-Blackout-Curtains/product-reviews/B01AIIH6DW",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "942837748253990932",
    "author": "jantrit",
    "date": "2022-02-14",
    "content": "With isolation you’re only as good as the weakest part of your system, that is to say, is the door opening the place where you notice most sound leaking? By the sounds of it yes! First things first can you change it out to a solid core door and add weather stripping and some beefed up stops all the way around? You can get special door seal kits with a droppable bottom seal that seals tight to the floor when the door shuts, although these are like 200 bucks a pop and you can get similar if not better results making something yourself. You want to start by figuring out a rough mass per square foot for your wall assembly (include drywall, stud work, insulation etc) and then bring your door up to the same mass per square foot. Solid core door, good seals all the way around and then you can even add more mass to the door with drywall or plywood. Once your door is at least the same mass per square foot as your wall assembly you’ll have to look elsewhere to gain more isolation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "948278167267864607",
    "author": "itaylerner",
    "date": "2022-03-01",
    "content": "Couldn’t decide what channel to put this in so I’m putting it here haha. I’m helping a friend build some acoustic panels and we’re wondering if we could frame them out of pvc instead of wood 🤔 any thoughts? acoustic downsides? Thought it was an interesting idea, way lighter and way cheaper which would be a big help",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "960661095863947354",
    "author": "kylem",
    "date": "2022-04-04",
    "content": "There's a reflection that comes off the desk. If it was smaller it would be a little be easier to deal with. I have a thick throw blanket that goes across the middle for now that seems to help.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1057311348058497165",
    "author": "Ross Fortune",
    "date": "2022-12-27",
    "content": "Something something velocity based absorption",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079203036112638022",
    "author": "austenballard",
    "date": "2023-02-25",
    "content": "Wait this phrasing just made the whole thing click for me, I think\nI'm really big on mindfulness, self-reflection, metacognition, etc. but I was mentally approaching it from totally the wrong angle",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1080916389474353212",
    "author": "Jeremy Klein",
    "date": "2023-03-02",
    "content": "minimal treatment at first reflection points. should knock a couple milli off that price tag",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1086751569703354378",
    "author": "Slow Hand",
    "date": "2023-03-18",
    "content": "Yeah. These AI's are definitely *not* thinking and I think we'll hit the limit of what machine-learning tools are capable of talking about. They're good at mimicking existing things, but they don't do anything at all approximating cause and effect, self-reflection, or abstract thought. \n\nI get the impression that this model is fundamentally flawed and unable to be a true general intelligence. Which I'm happy about. Cause that would be a whole other can of worms to worry over.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1108842245630730350",
    "author": "spectrummasters",
    "date": "2023-05-18",
    "content": "I fully agree with you and feel that this is the essence within collaboration . I feel bad for folks working in isolation because how do you find your North Star without others input to help guide you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124763018102849576",
    "author": "crashout",
    "date": "2023-07-01",
    "content": "I tried treating first reflections with 2 mattresses I had laying around just to test how it sounds and its a huge improvement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1137509061911384104",
    "author": "Edward Rivera",
    "date": "2023-08-05",
    "content": "I'd say that goes for most of what we do, at least when there's a song presented in front of us and we're not looking for standing waves. We call it engineering, and it is, but there's a lot of right-brain stuff happening that is (not almost is) prior to the language which describes it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138621193948242000",
    "author": "Michelia x Alba 玉蘭花",
    "date": "2023-08-08",
    "content": "hey everyone im going to be doing a new studio build here over the next many months and going to be documenting the process want to make some resourceful content for the nexts gen peeps of our world wide community. if you have any cool gear thats exciting to you no matter how big or small reply to this with a link and ill check it out. lights, monitors, switches, chairs, doesnt matter we've got a good budget for this one so trying to really look into all the corners i can...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1138623509585731664",
    "author": "LAPhill",
    "date": "2023-08-08",
    "content": "Smart! If I were you, I'd look into some active bass trapping for your seat cushion, too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1153803267785117696",
    "author": "Ross Fortune",
    "date": "2023-09-19",
    "content": "If you like, I can share a template that has all the comms routing set up that I’ve used with good results.\n\nI’ve even had it with two talkback mics - one at the back of the control room for a director, all worked smoothly.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158214669576708137",
    "author": "Eric Martin",
    "date": "2023-10-01",
    "content": "but why build a control room upstairs if you’re building from foundation up?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165412241068261447",
    "author": "Nomograph Mastering",
    "date": "2023-10-21",
    "content": "But the same could be said about things we say if taken in isolation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1169740327129714850",
    "author": "frankieharper",
    "date": "2023-11-02",
    "content": "Alright guys! Room question… I’ve had some first reflection side panels  leaning against the walls for the longest time and now I’ve finally gotten around to mounting them on the wall I swear transients have gotten blurrier… (they’re quite big?)\n\nIt made me realise I don’t know much about how you control transients coming out of your speakers… Time domain / delay is presumably a big factor? Anyone got any general macro level tips / concepts they could share?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1199534916958957589",
    "author": "stefanmacc",
    "date": "2024-01-23",
    "content": "Anyone familiar with reputable LA based Studio builders / designers ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1224412399948533850",
    "author": "James Redfern",
    "date": "2024-04-01",
    "content": "Turns out you can see your own reflection pretty well in those Gold and Platinum Records 😉",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1225273669027106877",
    "author": "Josh Bowman",
    "date": "2024-04-03",
    "content": "I had to do a session with a piper and I could hear it in the control room which was upstairs and on the other side of a wall through 2 doors and a hallway.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1229182221877903440",
    "author": "Deleted User",
    "date": "2024-04-14",
    "content": "I think that the idea of universal appeal existing in something that is so personal is fucked up. While something that everyone can admit are good or well executed; that is something I feel is somewhat absolute - at least for the era/time being. \n\n That’s why I am kind of anti-pop culture. \n\nCulture needs decentralization and integration at the same time. Otherwise, a lot of people won’t be motivated to do a deep soul searching and reflection on who they are, therefore taking away the opportunity to fully be themselves. \n\nI think pop culture requires good majority to pay attention to the same thing in order for it to work. And I think it kills healthy individualism.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235223636206420088",
    "author": "NoahNeedleman",
    "date": "2024-05-01",
    "content": "Skip the room treatment?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1248686607675031694",
    "author": "SoundsLikeJoe",
    "date": "2024-06-07",
    "content": "Whatever company that sells these \"acoustic panels\" to restaurants should be brought up on criminal charges",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1248689314016133265",
    "author": "peterlabberton",
    "date": "2024-06-07",
    "content": "☝🏻 hell of a diffuser",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1261037586957209690",
    "author": "SoundsLikeJoe",
    "date": "2024-07-11",
    "content": "Doing an interview thing today with a guy from GIK Acoustics about their place in the market, the acoustics products industry in general, and other basic chatter.  If you had any Nerd level questions about GIK or acoustic panel design/usage...   please drop them here.  More questions and talking points could be useful for me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1262788823914647604",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-07-16",
    "content": "What’s with so many Super Bowl performances having the ambience/reflections of the vocal coming in before the actual vocal? Makes it sound like those backwards reverb voice effects used in horror movies",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1266443947132190794",
    "author": "Eric Martin",
    "date": "2024-07-26",
    "content": "control room is not even 1/2 finished, colors are changing and so are the lights, but I had to stop pushing work off to get this done so I’m working in there now and done with the home studio.\n\nI see “opening” officially by 8/12 which is my first non-artist project scheduled in the studio",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1271041031508590593",
    "author": "spectrummasters",
    "date": "2024-08-08",
    "content": "For music related : tbh it’s remarkable how much more info (and helpful self reflection on my own workflow/intention  changes etc ) can be picked up by leaving the LWMR Spotify episodes to tick through . The Phil Asher one is dope especially re being a producer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1278625908659326999",
    "author": "jonmatteson",
    "date": "2024-08-29",
    "content": "A lot of artists are wearing headphones right now as well as sitting while performing. They are mostly copying frank ocean live performances where he was using noise isolating headphones over his in ears to get more isolation from the pa but they just like the look and the studio on stage vibe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1278688992610619432",
    "author": "NoahNeedleman",
    "date": "2024-08-29",
    "content": "Plus IEMs have way more isolation than over ear headphones.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1297081601435500555",
    "author": "BatMeckley",
    "date": "2024-10-18",
    "content": "I’ve been trying to give you space to mentally and emotionally aggregate all the studio build\ninspo I constantly send your way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1297989096463007754",
    "author": "Rollmottle",
    "date": "2024-10-21",
    "content": "GIK has a portable vocal booth kind of thing. https://www.gikacoustics.com/product/pib-portable-isolation-vocal-booth/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1360476141080678481",
    "author": "jantrit",
    "date": "2025-04-11",
    "content": "Big fan of the channel “idea farm” with Robbie Moore. He’s been mainly focused on his studio build but there’s some old vids where he does re-records and now he’s getting back into doing that kinda stuff!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1393621434009653289",
    "author": "chrissorem",
    "date": "2025-07-12",
    "content": "Facts! Mine is working well but I added a split for the control room for the summer days when there are 20 people in the control room and when I’m there by myself just mixing. I’m cooling a 3000 sqft building when I only need the control room cooled",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1411847717013028875",
    "author": "Bryan DiMaio",
    "date": "2025-08-31",
    "content": "Is that one like the Unf*ck browser extension that turns all your tabs into absorption?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1428845417122103326",
    "author": "Ross Fortune",
    "date": "2025-10-17",
    "content": "Probably could’ve been achieved with PT bridge/blackhole direct from zoom on the same machine, but I sometimes had clients in the control room too so a separate zoom screen to my PT rig was nice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1453026606074302555",
    "author": "hyanrarvey",
    "date": "2025-12-23",
    "content": "Power is extremely important and pretty over looked in most of the home studio builds",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1458758773421375622",
    "author": "Sei046",
    "date": "2026-01-08",
    "content": "Guys does anyone know of a reasonably priced studio designer that does construction drawings etc. In an unfortunate turn of events I need to relocate my studio, essentially walking away from all the money I pumped into my current one.\n\nAlternatively are there any public designs? I will have a blank canvas where I’m going so could accommodate a lot.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1464696078153683118",
    "author": "Chase H",
    "date": "2026-01-24",
    "content": "New diffuser for the studio!?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  }
]