[
  {
    "id": "1017148253373988934",
    "author": "cian riordan",
    "date": "2022-09-07",
    "content": "Quick poll for the gang – how many of you are mainly listening with stereo as your default (= 🔊) and how many are mostly consuming Spatial/Atmos (= 🌐) when they can? Genuinely curious as it's been a year and change since the big Apple switchover.",
    "reactions": 32,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1175675497343090729",
    "author": "NoahNeedleman",
    "date": "2023-11-18",
    "content": "Ok Long Post alert, but touches on a few things we harp on around here. \n\nSo my little bro is in town- we made dinner for one of his oldest friends who just moved to town with his wife. He’s a fantastic mandolin player and his wife is a singer/songwriter. \n\nOf course I did the ol’ studio walk through, listening to all the tunes on the ear calibration playlist, then let them play some of their own favs. Of course they’re blown away and have never heard music like this etc. \n\nBut to drive the point home I show them a song @Rollmottle and I turned around in just over 24 hours. “The reason for the speakers & treatment etc is so we can make decisions quickly blah blah blah.”  I pull up the session and we listen through and they’re loving it- but I’m noticing it doesn’t have the 3D thing that all the other music we’ve been listening to has. \n\nThen I show them the mastered version. An mp3. It’s louder and better sounding and all, until the first BGV stack hits… then it’s IMMERSIVE. We listened to the whole thing again just to enjoy the magic and notice all the ways the master improved it. So far beyond zapping resonances and making it loud, @Rollmottle made it sound… important. Made *me* sound like a good mixer. \n\nIt was heavier lifting for him cause I didn’t have the benefit of time for fresh ears or to detail the vocal the way I normally would. Also had the good fortune of having @Ross Fortune on speed dial and on GMT to give it a listen at 5am PST. \n\nI’d you’re curious, or dubious, I’ll DM files so you can hear what I’m talking about. \n\nTL;DR: monitoring matters, fresh perspective matters. Don’t produce mix *and* master your own shit.",
    "reactions": 29,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033881092903673886",
    "author": "Nomograph Mastering",
    "date": "2022-10-23",
    "content": "Yep. Vinyl/Atmos - still a tie as to which is dumber in 2022",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345837087072587847",
    "author": "cian riordan",
    "date": "2025-03-02",
    "content": "Looks like a good chair for atmos",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017219460161097738",
    "author": "cian riordan",
    "date": "2022-09-07",
    "content": "(i have atmos talk muted)",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "958085132676386866",
    "author": "sethearnest",
    "date": "2022-03-28",
    "content": "Your comment about \"withholding the true situation\" is certainly exacerbated by the Instagram game. I'll see someone post a full ridiculously expensive atmos rig in some posh situation and I'm like, \"dang...that dude must have some serious credits\" and go looking for them and find nada. So some serious cash is coming from elsewhere (non-music gig, parents/trust fund/etc). Not judging anyone who has that opportunity AT ALL b/c myself and most of the rest of us would do the same, but it's always good to remember everyone has a situation that the rest of us won't be fully aware of.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1092908725997670550",
    "author": "oaklandmatt",
    "date": "2023-04-04",
    "content": "Probably the most useful public atmos discussion I've yet seen.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1107046480000319658",
    "author": "Nomograph Mastering",
    "date": "2023-05-13",
    "content": "This is literally the strongest argument I’ve heard for Atmos so far",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1244001523240009758",
    "author": "Nomograph Mastering",
    "date": "2024-05-25",
    "content": "Our love language was extraordinarily inappropriate IG chats and sharing of dumb reels, as well as me constantly shitting on Atmos and him trying to convince me it was the future of everything",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1418029353853259958",
    "author": "Nomograph Mastering",
    "date": "2025-09-17",
    "content": "Bet Atmos is sick tho, just like it always is!",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017213537485066350",
    "author": "Zack Hames",
    "date": "2022-09-07",
    "content": "Atmos people will make just enough money to pay off their rigs then they’ll all have to start mixing for VR experiences",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017225663670923307",
    "author": "Rollmottle",
    "date": "2022-09-07",
    "content": "i keep wanting to call it Shatmos",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1026994692547678278",
    "author": "Slow Hand",
    "date": "2022-10-04",
    "content": "Pretty damn frequently. Producers moreso than mixers.\n\nWhen I find a record that resonates with me I'm very full-immersion and I'll devour as much of their adjacent body of work as I can. I'll start scrutinizing the record credits and pulling on threads as I see them. I really try to fill in the context around the record by identifying all collaborators, timelines, interviews they gave around that time, published works, etc. I've got a huge appetite for that thing.\n\nI really love reading books written by producers. The more old school the better. Phil Ramone's *Making Records* is a great one. That guy is a class act. Quincy Jones has both an autobiography *and* a book specifically on producing. The latter is a great no-shortcuts look at what it takes to be great. I enjoyed Daniel Lanois' *Soul Mining*, since he's got a very thoughtful immersive way of making records and working with artists that I appreciate.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1155673246411272252",
    "author": "oaklandmatt",
    "date": "2023-09-24",
    "content": "Atmos often makes me real uncle grumpy",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1265502872754192508",
    "author": "Josh",
    "date": "2024-07-23",
    "content": "Nothing is more immersive than eating two edibles before you get to the airport and your flight gets delayed just long enough for them to hit in the terminal",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1316208009105379370",
    "author": "cian riordan",
    "date": "2024-12-10",
    "content": "Then finish the series at JFTR and listen to all the Atmos versions.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1329753157605265439",
    "author": "Iwan Morgan",
    "date": "2025-01-17",
    "content": "One of our Godheads @cian riordan gives a really good breakdown of the Atmos and Stereo mixing of the latest St Vincent record here: https://youtu.be/kWA7gfTm60M?si=VUCtXeC5zfAwwfAB",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1460835946399400160",
    "author": "cian riordan",
    "date": "2026-01-13",
    "content": "I guess I’m sorta asking for new users that aren’t paying attention. Leading to the bigger question of: is atmos dead in 2026?",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017161007002566656",
    "author": "peterlabberton",
    "date": "2022-09-07",
    "content": "Yeah… this is just me sharing my opinion, not trying to shit on anyone else’s: I am thoroughly uninterested in spatial/atmos. I’ve been able to listen in a few really swanky/certified rooms, to tracks that other more atmos-inclined folks were really pumped about, and I just thought it was gimmicky and—to my taste!—kinda lame. Not for any technical reason (though I have issues there as well), I just don’t care if a shaker sounds like it’s behind me and to the left or I’m *fully* enveloped in a reverb or whatever.\n\nIf I have to wrap my head around it to stay relevant, I’m fairly confident I can give my self a crash course—and if someone asked me to do an atmos mix and paid for the studio, then sure! But short of that… 🤷🏻‍♂️",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017181375260008491",
    "author": "BatMeckley",
    "date": "2022-09-07",
    "content": "I’ve been really trying to enjoy the atmos mixes because I love that my friends are getting work off it, and any excuse to have more Castelli and less Cian in the headphones… but I’m still voting stereo.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1453989047776186418",
    "author": "cian riordan",
    "date": "2025-12-25",
    "content": "Woah SFIL had an atmos room. Let’s see some pics…is he a real life unicorn atmos consumer?",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1454172319479107718",
    "author": "BatMeckley",
    "date": "2025-12-26",
    "content": "I’m going to get an atmos setup just so you can say your stepfather has an atmos room",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843859017315254272",
    "author": "mixedbywong_my",
    "date": "2021-05-17",
    "content": "https://www.theverge.com/2021/5/17/22440090/apple-music-lossless-audio-dolby-atmos-support-audio interesting . Heard that Spotify’s doing their hifi thing soon also 😊",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017157052415619223",
    "author": "Slow Hand",
    "date": "2022-09-07",
    "content": "Stereo. I tried out some Atmos headphone mixes at an Apple store kiosk a while ago because I was curious. I can't say that it had much of an effect on me. Maybe I need to live with them for longer and get used to it.\n\nLast week was the first time that I was able to sit in front of an Atmos setup that was meant for music (aka: not in a movie theater) and really get the full musical experience. In fact, I got to sit in front of *three* different Atmos rigs in three different (treated) rooms that evening and two of them were undoubtedly set up as good as they could have possibly been (One was a PMC showroom and the other built and tuned with their input). While the speakers themselves were impressive and very capable, the actual experience felt pretty disjointed. There was a pronounced feeling of phasi-ness that I didn't like.\n\nIt was great hearing these records on a rig that probably cost $250k, but my big takeaway was that they felt disjointed and odd. Even when sitting in the sweet spot.\n\nPerhaps my opinion will change with more exposure, but I'm not yet convinced that it's worth the time and effort. I will add, though, that half the mixes we heard were up-mixed from old stereo recordings with minimal track counts and only two of them were modern productions.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017216790776008775",
    "author": "1ggy",
    "date": "2022-09-07",
    "content": "I don’t understand why the labels don’t just get an atmos mix when they actually need it/have somewhere to use it.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1037418047331385424",
    "author": "chadwahlbrink",
    "date": "2022-11-02",
    "content": "The talks were great. I have listened to about half of them. Jack Antonoff's indifference/distaste for the atmos format was interesting. Jack gets a lot of hate, but I appreciated his talk. I loved Chris Gehringer’s openness on mastering and the levels he shoots for while mastering. I could listen to Tchad Blake forever. Also, I’m a stan for The National, so Peter Katis and Jon Low were great!",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1164639813647999026",
    "author": "Rollmottle",
    "date": "2023-10-19",
    "content": "we all switched to Atmos while you were away, bud",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1257087025279139921",
    "author": "Matt Huber",
    "date": "2024-06-30",
    "content": "Hahah. Just curious if I’m getting at least 1 play on my Atmos mixes.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "843996759898325022",
    "author": "cian riordan",
    "date": "2021-05-17",
    "content": "I think the real entry point into Atmos is going to be if cars start offering it. It's potentially the most perfect environment to have the scalable, controlled environment needed for decent playback. Once people hear music this way, it might have more of a shot at breaking into the pro-consumer market. It's a steep uphill battle against Google, Amazon, & Sonos soundboxes though.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017217476595023885",
    "author": "1ggy",
    "date": "2022-09-07",
    "content": "On second thought it’s more work and money for engineers so go ahead and atmos your whole fucking catalogue",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1030617509457563738",
    "author": "kylem",
    "date": "2022-10-14",
    "content": "With Atmos they'll usually ask for more than grouped, so I just do it assuming they are going to need it (unless I'm doing it). I don't really go track by track, but way more detailed than grouped.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1266906537918595174",
    "author": "Nomograph Mastering",
    "date": "2024-07-27",
    "content": "Man, this is a huge topic. And would be hard to address without touching on the political. My lunch break is over but again my intuition is to ask why this might be the case and I think a few factors might contribute \n\n- older generations grew up in a “keep your head down” world, whereas younger grew up with a more social “if you see something say something” atmosphere. Ostensibly a good thing …\n\n- Social media rewards performance value judgements … “Mr Y is a bad guy” \n\n- The internet and social media has made younger generations vulnerable to manipulation by interests who wish to control the narrative",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017215626500128828",
    "author": "gatewoodsensei",
    "date": "2022-09-07",
    "content": "I heard Rocket Man in atmos at Universal Recording in LA. Sounded incredible. Listened to that shit in my AirPods. Mane. Let me tell ya. It did NOT hit the same lol.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017220556254359562",
    "author": "1ggy",
    "date": "2022-09-07",
    "content": "You need an atmos keyboard to type in #🔊atmos-talk",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1078490148091740263",
    "author": "Adam Thein",
    "date": "2023-02-23",
    "content": "Damn.\n\nSo I just realized i've had Apple Music set to Dolby Atmos Automatic for god knows how long and it has been automatically detecting my audio interface as a multi-channel interface and turning on Atmos mixes for me that I've been listening to in stereo and they are 100% not the correct stereo mix.  Just turned Dolby Atmos to OFF and now I feel like a fool.\n\nThought I'd share here and encourage everyone to make sure they have that setting off if they aren't using Airpods or a legit Atmos setup.  I've been referencing some stuff that absolutely didn't sound right.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1097538776168939540",
    "author": "mixedbywong_my",
    "date": "2023-04-17",
    "content": "Atmos u say . 7.1.4 setup ? 😌",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1107040463820697812",
    "author": "Bryan DiMaio",
    "date": "2023-05-13",
    "content": "When I ordered the rest of my speakers for Atmos we had Laffy Taffy for over a month",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138641295045304351",
    "author": "LAPhill",
    "date": "2023-08-08",
    "content": "I’ve got all my money riding on reverse Atmos",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1191783990525444218",
    "author": "hyanrarvey",
    "date": "2024-01-02",
    "content": "Vinyls gonna outlive atmos",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1191784446479839292",
    "author": "Nomograph Mastering",
    "date": "2024-01-02",
    "content": "Duh, we’re gonna get vinyl Atmos. The needle(s) will look like a 7 pronged fork and each side will last 4 minutes",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1195409329839427667",
    "author": "spectrummasters",
    "date": "2024-01-12",
    "content": "Kerri chandler - atmospheric beats is the template for this or MK . They should have MK do the beat  actually if they gonna go this way for trends",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1322276642508509327",
    "author": "thecratefulhead",
    "date": "2024-12-27",
    "content": "oh shit i mixed this with Rob last year &  did I mixed the atmos",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1351608070853365842",
    "author": "Will Melones",
    "date": "2025-03-18",
    "content": "WHOA, I'm sure this has been discussed, but now iMessage defaults to spatial audio when you preview videos with AirPods, regardless of your global settings. Keep this in mind if you're messaging mixes to clients or something",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843997122768404480",
    "author": "cian riordan",
    "date": "2021-05-17",
    "content": "A record I recently mixed in stereo got re-mixed in Atmos and it sounded fun, but if the stereo fold-down was the end product 99 percent of people would hear, that would really bother me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843997832372551710",
    "author": "Slow Hand",
    "date": "2021-05-17",
    "content": "Atmos in a car would be great. I love the experience of a good car stereo. Years ago I bought The Flaming Lip's *Yoshimi Battles the Pink Robots* album in surround and the booklet had a warning to the effect of \"Do not listen to the surround sound record while driving because the entire soundstage rotates around the listener and would be potentially disorienting.\"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1060939889576771675",
    "author": "mixedbywong_my",
    "date": "2023-01-06",
    "content": "Had these for a bit while doing a lot of sound recording for audio post a few years back . https://3diosound.com/products/free-space-binaural-microphone for this price I think it’s ok for dabbling into binaural recordings. It was less than 400 dollars I’d say the more u pay the better the HRTF is. This one wasn’t a full head per say like the higher end dummy heads are.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1092585751901896754",
    "author": "Rollmottle",
    "date": "2023-04-03",
    "content": "Yeah, would love to hear Ruairi's thoughts on his Atmos experience with the new T-Swift single.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093081744627998760",
    "author": "popaganda.",
    "date": "2023-04-05",
    "content": "gotta compensate for that in the atmos field",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1101942709670912011",
    "author": "hyanrarvey",
    "date": "2023-04-29",
    "content": "Hardcore atmos mix just comes with a black eye",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101946049695846531",
    "author": "Nomograph Mastering",
    "date": "2023-04-29",
    "content": "JFC spare me - *\"I've had a slew of people sit in my chair and listen to Atmos mixes in my tuned room. Their heads dart around excitedly as the backing vocals of Elton John's \"Rocket Man (I think it’s going to be a long, long time)\" fly over their heads\"*",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102306750520119387",
    "author": "Bryan DiMaio",
    "date": "2023-04-30",
    "content": "Well he definitely would’ve mixed in Atmos 😂",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115440019579093114",
    "author": "LAPhill",
    "date": "2023-06-05",
    "content": "Phone numbers mixed in Atmos is a weird gig, but cool",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1123753972314951721",
    "author": "Bryan DiMaio",
    "date": "2023-06-28",
    "content": "I almost did a spit take when I saw the Barefoot Atmos room",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138860755958104156",
    "author": "Bryan DiMaio",
    "date": "2023-08-09",
    "content": "I'll mix it in atmos",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1145803500912136293",
    "author": "chrissorem",
    "date": "2023-08-28",
    "content": "Pan rich hard left and Chris hard right. Then we can do atmos notes later",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1180264395276820621",
    "author": "Bryan DiMaio",
    "date": "2023-12-01",
    "content": "I'll do an Atmos mix of this for free if it's getting uploaded to streamers. Gotta have the best playlisting reach possible right?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1257087333061103676",
    "author": "Matt Huber",
    "date": "2024-06-30",
    "content": "1 Atmos play might as well quality as a platinum record",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1461170771626819786",
    "author": "jantrit",
    "date": "2026-01-14",
    "content": "Had an engineer that did Atmos mixes for something I mixed mention that “you guys can just use the fold down for the stereo mix if you want” \nI didn’t slap him cause we’re mates but it was close. \n(Said in jest of course)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "867843162206240770",
    "author": "Deleted User",
    "date": "2021-07-22",
    "content": "I’m wondering how airpod max implements this. It looks like they are using hrtf type of filtering to do this, and I tested it out today at apple store. A lot of results were still a bit disappointing but some of the tracks that were mixed for atmos sounded pretty good. but still, on headphones- i preferred stereo mixes. It might have to do with the fact that they were louder too. But I would really love to have real atmos experience inside the speakers",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "914986587903885343",
    "author": "Felix Byrne",
    "date": "2021-11-29",
    "content": "anyone watching the scheps atmos panel? https://youtu.be/cnX4pVrxqq0",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "946105672045576214",
    "author": "jonmatteson",
    "date": "2022-02-23",
    "content": "Yeah I feel like this device could be the first “instrument” that kids ever touch in the future which would be exciting for the next generation of music creators! Much more exciting/useful than atmos IMO 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "972539316196737124",
    "author": "chadwahlbrink",
    "date": "2022-05-07",
    "content": "The atmos mix on the m1 MacBook Pro speakers for “as it was” was super impressive",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017234953655816213",
    "author": "peterlabberton",
    "date": "2022-09-07",
    "content": "I mean, atmos seems fantastic as an upgrade to old school surround sound, and a better place to build from for movies/tv/games… I just think it’s silly for music.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1060765671283249152",
    "author": "Nomograph Mastering",
    "date": "2023-01-05",
    "content": "Jecklin Disc is what he’s looking for. HRTF isn’t used in this way, it would just be referred to as binaural recording",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1068343581737242734",
    "author": "austenballard",
    "date": "2023-01-26",
    "content": "mfw running my reference playlist off Apple Music and losing my shit trying to figure out which part of the signal chain is broken because I'm hearing like 75% center\n\nSwapping cables feeding the monitors, swapping patch cables, switching cables coming out of the interface\n\n... it had detected more than 2 outs and automatically gone to Atmos mode",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1100999229448667136",
    "author": "Bryan DiMaio",
    "date": "2023-04-26",
    "content": "yea did the stereo mix\nthat's the only atmos mix I didn't do on the album since it was released like a week before all my speakers came in",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101942819733651506",
    "author": "David Fuller",
    "date": "2023-04-29",
    "content": "metal atmos mix smells like stale beer and sweat",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101944354484006963",
    "author": "Will Melones",
    "date": "2023-04-29",
    "content": "Still curious what full Atmos brings to the *music* experience that 5.1 can’t. Aside from the scalability. Helicopter hats?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115431174458834956",
    "author": "LAPhill",
    "date": "2023-06-05",
    "content": "I know you're joking, but what is the point of spatial audio? To immerse the listener in a world of music. To create a 3D experience. Why? We can go outside and listen to a band in a room and hear reflections all around us. But there is a chance to go deeper with spatial audio, to create something hyper-real, as much of record making has always been. Every new technology has the opportunity to enhance or detract from our experiences, and we have to meet them where they are. Maybe Atmos ain't it, but as someone who spends a lot of time in surround.. there is a feeling to immersing yourself in sound that isn't going to come from two speakers. So yes.. mixing in Atmos can very much be a part of steering the ship.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1172592065876611132",
    "author": "Bryan DiMaio",
    "date": "2023-11-10",
    "content": "I love that album. Got to do the Atmos mixes for it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240678751793316024",
    "author": "esquinalee",
    "date": "2024-05-16",
    "content": "One thing I’ve been peeved about with TIDAL is that whenever there’s an Atmos version of a song, there’s no option to play the stereo version (if there is someone please help me because some great records sound like ass in my car because of this)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1283415789315293287",
    "author": "Iwan Morgan",
    "date": "2024-09-11",
    "content": "Do you mean that headphones lack feel, so it’s difficult to get the emotion in the work while mixing? I think it’s a different kind of feel. I’ll look for the chest/bass check when listening on speakers but I want to be transported by the atmosphere and connection when listening on headphones. Some of the most formative experiences for me were listening via headphones and I try and remember those fomative feelings when checking on headphones - cassette dubs of Fabio and Grooverider on radio 1 back in the day, Spike’s mixes of Massive Attack and Mad Professor versions, my dad’s vinyl of Dark Side of the Moon etc etc",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1385668100220911626",
    "author": "Ross Fortune",
    "date": "2025-06-20",
    "content": "My bud Caesar Edmunds is one of Alan Moulder’s old assistants and does atmos. I can put you in touch if you like.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1418030514463309965",
    "author": "Rollmottle",
    "date": "2025-09-17",
    "content": "Living on the bleeding edge here on 16 pro with iOS 26. not sure if it’s hardware or the new OS. Now I can make my first Atmos record",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1432003946075132127",
    "author": "NoahNeedleman",
    "date": "2025-10-26",
    "content": "Feels too much like spam. If @Seth Drake wants to repost he can in Atmos",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1453987383535210577",
    "author": "bobby k",
    "date": "2025-12-25",
    "content": "Spent a good hour of the holiday blasting NIN with my gf’s step father in his atmos room",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1454181754276548618",
    "author": "bobby k",
    "date": "2025-12-26",
    "content": "Idk if NIN is even in atmos. Probably not. Bryan ferry’s boys & girls was a trip though (shoutout bob clearmountain)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1454191375041040384",
    "author": "spectrummasters",
    "date": "2025-12-26",
    "content": "And shout Bob clearmountain for Avalon as well . That ish sounds incredible . Clearmountain been doing “atmos “ in stereo for decades .",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1461038576811901022",
    "author": "Karim",
    "date": "2026-01-14",
    "content": "I believe still spatial by default. Friend switched to Apple Music in December and had Atmos automatically enabled in his settings.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1461065551261466899",
    "author": "SoundsLikeJoe",
    "date": "2026-01-14",
    "content": "Yes...  more figure of speech...  in memory of the previous industry attempts at consumer facing immersive music",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "843962972631859210",
    "author": "ALXCPH",
    "date": "2021-05-17",
    "content": "Does this mean atmos is gonna be a new standard deliverable?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843963128282742804",
    "author": "ALXCPH",
    "date": "2021-05-17",
    "content": "Good bye not atmos mix studios?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843963793952210965",
    "author": "ALXCPH",
    "date": "2021-05-17",
    "content": "How does everyone feel about this? …….Kuddos to Jon for being ahead of the heard on the whole atmos setup 😂💀",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843970857659662405",
    "author": "Slow Hand",
    "date": "2021-05-17",
    "content": "I wonder what the end goal for Apple is. I've got so many questions: Why is it important for Apple Music to support spatial audio? What does spatial audio within headphones do that stereo cannot? Does Dolby Atmos fold down to their spatial audio algorithm in a satisfying way? How many records are actually gonna be mixed for Atmos?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843971502545960990",
    "author": "Slow Hand",
    "date": "2021-05-17",
    "content": "I could see spatial audio being good for video games, but I guess I don't yet understand what it offers that you can't already do with stereo headphones and the listener's HRTF.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843973667628122142",
    "author": "Deleted User",
    "date": "2021-05-17",
    "content": "sounds like surround/atmos mixed down to binaural audio",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "843976491615125534",
    "author": "Rollmottle",
    "date": "2021-05-17",
    "content": "i can't imagine the penetration of Atmos systems in the home or wherever is very high. still going to be a niche delivery format IMO. the barrier to entry on the studio side is ultra high. i don't see it taking hold outside of film and gaming where there's a lot more money than in music.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843977821546348594",
    "author": "Slow Hand",
    "date": "2021-05-17",
    "content": "I agree. Atmos is such a high barrier to entry that it's unlikely to be any kind of standard outside of movie theaters and audio obsessives. For that reason I feel like Apple are more interested in the benefits that it must bring to their headphone experience. At least two of their Airpod models already support it. I just don't see the benefit yet.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "844017358246379571",
    "author": "Rollmottle",
    "date": "2021-05-17",
    "content": "Yeah good point. There are very few spaces that people actually need to be in that could realistically have the multi-speaker setup required for Atmos. Would be pretty tight.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "844144073295134740",
    "author": "ALXCPH",
    "date": "2021-05-18",
    "content": "I wonder if the Major labels(sometimes clueless on tech and could very well buy into the marketing aspect of it)are gonna expect atmos mixes from now on included in the normal mixing rate or if they Will accept it as an upcharge? Would they really increase mixing budget? I highly doubt it. I would hate it for mixers to either do much more work for the same Price or lose mixes for refusing the extra work for no more money…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "844188559145828382",
    "author": "Josh Bowman",
    "date": "2021-05-18",
    "content": "Have you guys tried spacial audio with the AirPod pros on the Apple TV app from the phone (the only place it works right now)? I thought the headphones weren’t on and the sound was coming out of my phone in the room the first time I tried it. Sounds crazy (pretty neat!). Not sure if it would make music more enjoyable but it seems Serban and Jon hanes have already been doing atmos versions of some of their major label releases for a while now… curious to see how it translates! I saw Josh gudwin built an atmos room too, and Greg wells was talking about it… so seems it’s already happened. I’d imagine the budget is higher/extra on those versions for the mix?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "852441507231039498",
    "author": "mixedbywong_my",
    "date": "2021-06-09",
    "content": "Anyone dabbled with mixing in headphones for Dolby Atmos music yet ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "852940618078224444",
    "author": "karlemilhald",
    "date": "2021-06-11",
    "content": "Hey everyone. What are Your impressions on the Dolby Atmos-spacial/headphone version on Apple Music? The mixes obviously vary in quality, but two main problems I notice in all the songs I've heard are 1) A roomy/chourusy sound, which is not a creative choise, but rather seems like an algorithm, which ruins 'in your face vocals' imh. 2) Missing the glue. - These songs may sound amazing on speakers, but from a consumer standpoint, I believe that the binaural Atmos for headphones is gonna be the way 99.9 people are gonna listen. Thoughts??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "852957958202589214",
    "author": "kylem",
    "date": "2021-06-11",
    "content": "agreed - just took a listen through a few songs on the hits in spatial audio playlist using my airpods. super inconsistent. some stuff sounds good, but in general it's just washy and strange. also felt like i was losing the intimacy for some songs. how many consumers are going to be properly setup to enjoy an atmos mix?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "852966279735148554",
    "author": "karlemilhald",
    "date": "2021-06-11",
    "content": "Exactly. There are a lot of songs that have a lot of problems. Bob Marley - Is This Love sounds beautiful to me, but that seems to be an exception (and it still gets at bit of that washy sound). i would imagine these mixes are mixed for a proper Atmos setup, but how many of people listening are really gonna have that? I believe in the Atmos format for headphones for that reason. But i think it would require mixing engineers to mix with headphones in mind if that washy/roomy sound should disappear",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "853062347438161960",
    "author": "cian riordan",
    "date": "2021-06-11",
    "content": "Honestly I think it's terrifying that if you have Airpods and Apple Music, the default is now set to listen in spatial audio. It's highly unlikely that 99% of artists invested as much time in the Atmos production (if even) than the stereo production.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "853069691760148501",
    "author": "Slow Hand",
    "date": "2021-06-11",
    "content": "Oh jeez. It defaults to Atmos? What is it claiming to add to the experience of stereo files? Is it just simulating crosstalk between speakers in some sort of acoustic space?\n\nIt may be time to take Apple up on that free trial and figure out what is going on.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "853074204375384084",
    "author": "Eric Martin",
    "date": "2021-06-11",
    "content": "there’s an ATMOS fold down to binaural ¯\\_(ツ)_/¯",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "857071781008113703",
    "author": "kylem",
    "date": "2021-06-22",
    "content": "Anybody have experience with deliverables for atmos? Just wrapped an album and the label is having someone else do the atmos mixes. First time having to deliver for this and trying to limit the back and forth. I asked if they could connect us directly so I could get some more details on what he might need and they said, \"just stems\" - ha. Normal delivery for labels I just bypass my limiter and group stuff, (drums, bass, guitars, etc..). I feel like he's going to want more separation though. Thoughts?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "867837474462236782",
    "author": "mixedbywong_my",
    "date": "2021-07-22",
    "content": "Ah . I wonder how it’s done . Surround ? Binaural ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "872815582913896489",
    "author": "chadwahlbrink",
    "date": "2021-08-05",
    "content": "I wonder if they will do the atmos mix in the middle of the stadium 🏟️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "885406409066446899",
    "author": "peterlabberton",
    "date": "2021-09-08",
    "content": "Yeah man, I love that part of town. And it’s certainly pretty wild how saturated those neighborhoods are with music folks! Super exciting to be immersed in all that every day. Covid/delta/etc. makes everything pretty uncertain to me but my plan is definitely to still hang in that part of LA pretty frequently. We shall see…\n\nI think my perspective of what I wanted shifted a bit when I subbed in for @cian riordan working for St. Vincent—Annie’s studio feels pretty secluded and I loved that atmosphere. I started looking for rentals in some of the canyons and found great stuff but nothing I felt like I could afford without having an absolute panic attack every month. And then I saw what is now my studio room pop up in a photo on Craigslist and here we are!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "972477422857502800",
    "author": "gagsmile",
    "date": "2022-05-07",
    "content": "damn im been listening to \"as it was\" on my airpod and yes the atmos is amazing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017149046651113603",
    "author": "ehutton21",
    "date": "2022-09-07",
    "content": "I feel like cause i crossover and listen to audio files from ppl and my own bounces to check playback, I opt for stereo cause I perceive some weirdness when I use spatial audio on a stereo source from files.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017150541383610499",
    "author": "ehutton21",
    "date": "2022-09-07",
    "content": "Makes sense. I was just saying that process makes me default to stereo. Even with that aspect aside, I’d still default to stereo there, for me at least. I hear some weird stuff in AirPods in tracks that are supposed to be “rendered for atmos” even when I triple check my own settings. Feel like there’s def mixers who know how to get things epic in spatial and then some of the other stuff I’ve heard sounds like people not quite knowing how to make things work, which is understandable but still disorienting. That happens for me most with hip hop projects",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017175433629941971",
    "author": "Zack Hames",
    "date": "2022-09-07",
    "content": "Thank you all for clearing the air on atmos. I was starting to feel crazy because it does nothing for me. Again, no offense to those who dig it. Maybe it’ll work out someday for me. But so far, nada. I also hate 3D movies so 🤷",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017207806610378813",
    "author": "Adam Thein",
    "date": "2022-09-07",
    "content": "Atmos on airpods just sounds like throwing the whole mix in a room reverb to me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017213130486591628",
    "author": "cian riordan",
    "date": "2022-09-07",
    "content": "So what's everyone's best guess on how long the major labels will continue to blitzkrieg these Atmos mixes out? Are they doing this math on who's listening to what?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017214668944711761",
    "author": "1ggy",
    "date": "2022-09-07",
    "content": "Remove blu-ray and insert atmos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017214798565490740",
    "author": "Adam Thein",
    "date": "2022-09-07",
    "content": "I'm all for 3d headphone mixes for video games and VR, I've just never felt like it makes music consumption any better to me.  I've yet to experience Atmos outside a movie theater though for music so maybe that's where the great experience is.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017218634910802030",
    "author": "1ggy",
    "date": "2022-09-07",
    "content": "This should all prob go to #🔊atmos-talk",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017232348602970125",
    "author": "BatMeckley",
    "date": "2022-09-07",
    "content": "I think this is a very real thing. While atmos as it stands is a bit of a gimmick, we’re clearly moving towards a VR dominated entertainment world and atmos will provide a decent scaffolding to build upon",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017358560344154163",
    "author": "Zakhiggins",
    "date": "2022-09-08",
    "content": "Unless we get *massive* headphones with like 4 speakers in each ear, atmos probably won't work in headphones",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1029427475245183117",
    "author": "hendrick",
    "date": "2022-10-11",
    "content": "brad pitt opened an atmos studio in france, maybe ur next destination @oaklandmatt ? https://www.miraval-studios.com/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060764368926670868",
    "author": "Rollmottle",
    "date": "2023-01-05",
    "content": "he confirmed he is looking for HRTF stuff...binaural like the Neumann head shit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1060764562812584106",
    "author": "Rollmottle",
    "date": "2023-01-05",
    "content": "researching ideas for a piano record he's got in March, thinking about a binaural recording.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1060816368955555900",
    "author": "jonmatteson",
    "date": "2023-01-05",
    "content": "Speaking of binaural recording, does anyone know a cheaper way to do this than the Neumann head?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060821449897680927",
    "author": "Nomograph Mastering",
    "date": "2023-01-05",
    "content": "I used to like XY a lot, binaural always sounds odd to me on speakers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1060843326980509736",
    "author": "jonmatteson",
    "date": "2023-01-06",
    "content": "I feel like binaural recording is a fun way to play with space especially in headphones. I’d like to get something that’s not 9k to do something similar since ortf doesn’t account for the skull in between.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1066406642591203388",
    "author": "KushKadett",
    "date": "2023-01-21",
    "content": "It also doesnt seem to play dolby atmos for available playback systems either since it should work on my macbook speakers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1069666763991695382",
    "author": "Zack Hames",
    "date": "2023-01-30",
    "content": "Do you care about the social atmosphere / culture?\n\nSome areas people are wicked friendly and can be off putting for some. Some areas are really cold and don’t give a fuck about you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1092584776214528132",
    "author": "PaulBennett",
    "date": "2023-04-03",
    "content": "We've heard a lot about Atmos in a lot of the other conversations, and for the sake of both sides of the argument, I wouldn't mind hearing more on his perspective",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1092907146997416049",
    "author": "Nomograph Mastering",
    "date": "2023-04-04",
    "content": "Did not expect to go there with Atmos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1092909591924318258",
    "author": "Nomograph Mastering",
    "date": "2023-04-04",
    "content": "There’s so much to say about it. But probably worth having a pro Atmos voice on too - Mike Miller, or Dale",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093081877507735554",
    "author": "Nomograph Mastering",
    "date": "2023-04-05",
    "content": "There’s a sheep/Atmos joke just waiting to be made",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093090649668071494",
    "author": "spectrummasters",
    "date": "2023-04-05",
    "content": "In nature birds go quiet when there are predators close . These are signals our auditory system evolved to pick up on . It’s core to our experience as animals to provide ourselves with these signals for example . So to hear you bring evolutionary biology into the discussions around atmos is so good man . People need to know this stuff it’s vital to our quality of life experience . In my kitchen I alternate smooth fm (70s/80s classics for the sonics ) or birdsong , for the stress relief . I cannot recommend leaving birdsong on for a few hours in your home enough",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093091678610530364",
    "author": "spectrummasters",
    "date": "2023-04-05",
    "content": "As I said before when we were discussing AI , I feel we seem hell bent on deconstructing our own natural experience of life , (which is to say imo the nourishing relationship  we are blessed to be born into , ie . Nature )…..and hearing you bring this sort of thing into the atmos conversation is actually a relief imo ruairi . Keep going man !!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093349961388789850",
    "author": "andrew_yv",
    "date": "2023-04-05",
    "content": "An interesting side note re: the psychoacoustic HRTF binaural sound localization discussion from yesterday’s live with @Nomograph Mastering :\n\nI can’t find my source right now but if/when I do I will link it, anyways… A study was conducted wherein moulds were cast of several people’s pinnae (outer ears), these were placed on dummy heads with microphones inside the ‘ear canals’ and recordings were made through each of sound coming from a variety of locations. Some of the subjects were audio professionals and some were lay people.\nWhen the subjects listened back to these recordings, there was significant variance in their ability to localize the sound sources. If I remember correctly, they were generally better at listening through their own pinnae than others were, and audio professionals were a bit better at sound localization in general, particularly in the traditional stereo field. However, the really interesting finding was that there were some pinnae that were universally better or worse. People actually had improved localization through someone else’s pinnae than their own, implying that although we are adapted to our own pinnae, there are material differences that make some better than others for localization of sound.\nThis is all from memory of reading something a few months ago, so I apologize if there are details that aren’t 100% accurate, but I assure you that the surprising bit is correct!\n\nHRTF-based binaural mixes are not exactly the same thing as dummy head recordings, but I wonder if, in the creation of the aforementioned “baller individual HRTF’s” there might be a place for some optimization beyond the exact copying of an individual’s unique acoustic properties.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1100999278433927238",
    "author": "Bryan DiMaio",
    "date": "2023-04-26",
    "content": "I scrambled to get everything set up so I could mix the rest in atmos lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101940633859522652",
    "author": "Bryan DiMaio",
    "date": "2023-04-29",
    "content": "I like Atmos as a way to create a future-proof new representation of the music that allows the listener to be enveloped in the music",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101942100293079090",
    "author": "Bryan DiMaio",
    "date": "2023-04-29",
    "content": "Let the recording/Atmos mix be its own thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101943011623051406",
    "author": "Bryan DiMaio",
    "date": "2023-04-29",
    "content": "Sonos full Atmos system is like 2400, not too bad and super easy to set up. No receiver required so it’s cheaper than some people’s existing HT setups",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101946174782591077",
    "author": "Nomograph Mastering",
    "date": "2023-04-29",
    "content": "I've listened to Rocket Man in 10 or so Atmos rooms and it's fucking dismal every single time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101947148238602270",
    "author": "Bryan DiMaio",
    "date": "2023-04-29",
    "content": "Some of these big budget Atmos records are an afterthought",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101947240643297331",
    "author": "Bryan DiMaio",
    "date": "2023-04-29",
    "content": "You know my favorite Atmos mix tho? Lil Yachty’s album",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101947258284548158",
    "author": "Rollmottle",
    "date": "2023-04-29",
    "content": "he said the legacy of recording engineers using rare and expensive gear is of a piece with Atmos...that's a dubious-ass conclusion to draw.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102309248077144085",
    "author": "Bryan DiMaio",
    "date": "2023-04-30",
    "content": "I showed my parents the Pink Floyd 50th anniversary in Atmos today, now they want a home theatre setup 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105264255948824576",
    "author": "cian riordan",
    "date": "2023-05-08",
    "content": "Yep. I also think atmos/spatial audio’s future will hinge on their implementation.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105489434016755824",
    "author": "simplersounds",
    "date": "2023-05-09",
    "content": "What is the consumer setup to listen to Atmos? When listening of my M1 MBP 2021 or older wired apple earbuds I don't like what it does to the stereo imaging, I often find the extra 'side' material distracting and ultimately feel that the atmos feature detracts from my musical experience. At this point I have it disabled on the settings in Apple Music. What are your suggestions, should I get a pair of AirPod Pro's or Max's?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1105560916394770642",
    "author": "Rollmottle",
    "date": "2023-05-09",
    "content": "average consumer setup probably the AirPod family, followed by Sonos. AirPod Maxes are great, but didn't deliver Atmos in any convincing way for me. great pieces of gear for average listening, zoom calls, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105707842448662669",
    "author": "jonmatteson",
    "date": "2023-05-09",
    "content": "wait can tesla’s stream atmos?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1105784541404221512",
    "author": "Josh",
    "date": "2023-05-10",
    "content": "Oops I dumb. They’re going to. They currently have this weird simulated spacial audio thing that really sucks. So not full atmos. But that and AirPods are I guess will be the closest. Plus Sonos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105883822928703599",
    "author": "Nomograph Mastering",
    "date": "2023-05-10",
    "content": "A very successful client (who you all know) bought the Atmos Mercedes flagship recently and hates it. Will literally be selling the car because the sound system sucks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105889019872682024",
    "author": "hyanrarvey",
    "date": "2023-05-10",
    "content": "I feel like you could say that about any atmos application in music",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120758957603029083",
    "author": "Bryan DiMaio",
    "date": "2023-06-20",
    "content": "No, folks mixing Atmos on VSX will send him off a cliff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124020590387400716",
    "author": "Josh",
    "date": "2023-06-29",
    "content": "Imagine mixing in mono in an atmos room but all the speakers are firing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124046692371660930",
    "author": "bobby k",
    "date": "2023-06-29",
    "content": "what if we RXd in full screen in the $100k barefoot atmos youtube studio",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138631213217746975",
    "author": "Deleted User",
    "date": "2023-08-08",
    "content": "this is the future of atmos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1145275212481429555",
    "author": "Edward Rivera",
    "date": "2023-08-27",
    "content": "(Here I go again) Apparently for the American Don Record...Steve was just a tad adamant that the e guitarist record himself as if he were playing live, but the guitarist wanted to do everything separately to create this beautiful immersive portrait. They obviously went with the latter but I guess Steve didn't want the extra work 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1155649394855661618",
    "author": "Josh",
    "date": "2023-09-24",
    "content": "Uncle grumpy coincidentally just got back from an atmos room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165311123256512623",
    "author": "Zack Hames",
    "date": "2023-10-21",
    "content": "Who’s gonna do the Atmos Mix for this band?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1171524875324751912",
    "author": "Gurley",
    "date": "2023-11-07",
    "content": "Top tier atmosphere and sounds",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1180274855967465472",
    "author": "Bryan DiMaio",
    "date": "2023-12-01",
    "content": "The best way this can exist is if an AI achieves the best master and there's an Atmos version. Otherwise you won't be grumpy enough about it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1192300851306442813",
    "author": "Nomograph Mastering",
    "date": "2024-01-03",
    "content": "So people who do atmos care less than me …",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1207807538406498354",
    "author": "Rollmottle",
    "date": "2024-02-15",
    "content": "The Roblox Lil Nas X concert was pretty hilarious. I thought it was great...whole new way of interacting with an artist and their music. My kid loved it. The future bodes well for immersive experiences.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1211777638264475758",
    "author": "Bryan DiMaio",
    "date": "2024-02-26",
    "content": "When I did my Atmos order I probably received three Halloween’s worth of Laffy Taffy lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1217694753672663111",
    "author": "Eric Martin",
    "date": "2024-03-13",
    "content": "Wow, I just dug my heals in hard into the 🤫 Dolby Atmos thing, and when you’re in the room with speakers it feels incredible to create with",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1220084724257652866",
    "author": "spectrummasters",
    "date": "2024-03-20",
    "content": "“we would do well to sidestep in favour of rendering present the atmosphere of a rarefied moment i suppose”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1222280388999778414",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-26",
    "content": "I find it really interesting that for instance in music streaming there are various streaming platforms that pretty much do exactly the same thing (provide all, or most of recorded music at a cost). There might be slight discrepancies (spotify not having Joni Mitchell/Neil Young catalogue until recently) but they offer essentially exactly the same product so they have to convince consumers from a different perspective („we pay artists more, we sound better, we have spatial audio etc.“) \nAnd on the other end of the spectrum you have the complete shitshow that is streaming movies/series on demand where you have to have like 5 different subscriptions bankrupting you just so you can watch your favourite movies. It‘s interesting how those two offer basically the same thing (access to entertainment on demand) but have developed drastically different",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230929189436260424",
    "author": "masteredbyjack",
    "date": "2024-04-19",
    "content": "Could be stereo/atmos or stereo/vinyl delineation as well maybe?\n\nBut @Nomograph Mastering is right, Sterling knows what’s up",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1232084736164233380",
    "author": "Bryan DiMaio",
    "date": "2024-04-22",
    "content": "Put Ruairi in an Amphion Atmos room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240730115542093906",
    "author": "thecoleyoung",
    "date": "2024-05-16",
    "content": "Still an issue for me over here. I think it’s something with specific distributors / labels. Sometimes there will be a new album release I’m looking forward to and then BAM, atmos only. That’s my only gripe with them though, everything else is stellar.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1257359130566459473",
    "author": "Bryan DiMaio",
    "date": "2024-07-01",
    "content": "book tickets for the casa batllo tour right now and do the immersive experience afterwards",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1265499926255763516",
    "author": "NoahNeedleman",
    "date": "2024-07-23",
    "content": "My dad had a dos computer and I played Zork on it. Was the most immersive experience I can recall until playing n64 stoned 10 years later",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1267624551186174025",
    "author": "Bryan DiMaio",
    "date": "2024-07-29",
    "content": "At AES when they were like \"oh we can totally calibrate an Atmos system\" they were just running Sphere lmao",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280903463882199122",
    "author": "Nomograph Mastering",
    "date": "2024-09-04",
    "content": "I think it will all be solved to an acceptable level as we move towards immersive",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1303556928223318048",
    "author": "Gerhard Westphalen",
    "date": "2024-11-05",
    "content": "Probably a bad cable. My whole atmos system runs on adat and I've never had an issue. I've had a couple of defective cables that just pulled out if you bumped it but I just throw those out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345837455504310393",
    "author": "chrissorem",
    "date": "2025-03-02",
    "content": "That’s because it is specifically designed for atmos Qcing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1385661253589930176",
    "author": "georget113",
    "date": "2025-06-20",
    "content": "Does anyone have studios they recommend in London for atmos.  Modestly priced but still have industry quality setups.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1385768002615509025",
    "author": "Ross Fortune",
    "date": "2025-06-20",
    "content": "Oh my bad, I was on the move and misread your original Q. \n\nThe only atmos room I’ve actually listened in is RAK 4, but that’d be on the spennier end. \n\nI think Miloco (studio management company) might’ve added atmos setups to a few of their rooms including the Bridge which would probably be at the more affordable end. Could be worth dropping them a line.\n\nI’ll hit Caesar tmw and see if that’s something he’d do.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1390012189473243166",
    "author": "hyanrarvey",
    "date": "2025-07-02",
    "content": "I believe in 360 way more than atmos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1390032566786199562",
    "author": "andrew_yv",
    "date": "2025-07-02",
    "content": "Sony set me up with it for Mike’s BH room in both stereo and atmos. It’s the first spatialization tech that has impressed me. Not sure how quickly I would reach for it in stereo, but I can confidently pre-mix things in atmos with it, and with some loss of detail, it really does sound like *those speakers in that room through my ears*\n\nProcess is pretty cool and elegant. They put electret mics in your ears, record IR sweeps of each speaker in your room through them, then put headphones on, record IR sweeps of those, then have some sort of sum/difference algo that translates it all.\n\nWhen you get measured, go for relatively high SPL sweeps. We tried it at a few different levels and at lower levels, the result was pretty unimpressive. You can also go too high and distort, but worth trying a couple times if they’re game, which I’m 100% sure they will be for you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1391781363417350305",
    "author": "georget113",
    "date": "2025-07-07",
    "content": "Looking to book for atmos mixing and demos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1397628678187253782",
    "author": "Dereck Blackburn",
    "date": "2025-07-23",
    "content": "Yeah, you could try Q Division their B room is an excellent place to listen to music and it is Atmos equipped.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1418029251927736501",
    "author": "Nomograph Mastering",
    "date": "2025-09-17",
    "content": "I'm on a 15 pro and there's no mention of Atmos - just Lossless/Compressed & Mono/Stereo but good to know",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1432002177567559871",
    "author": "Josh Bowman",
    "date": "2025-10-26",
    "content": "Wow that’s a lot of buzz words and very little actual explanation on the website. Where can we hear it? Should we move this to #🔊atmos-talk @NoahNeedleman ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1455985616926802113",
    "author": "hank01564",
    "date": "2025-12-31",
    "content": "I wasn’t a part of the back and forth and am only getting the clients perspective so not the best source here but to my limited understanding, there was a per song mixing rate that was expected. They sent a bunch of songs that were expected to be released, some weren’t and all got mixed. Manny charged for all, of course. Line items for each were that per song mixing rate, the studio fee which was per song, and atmos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1455986716237369471",
    "author": "hank01564",
    "date": "2025-12-31",
    "content": "I think it was more of a communication issue more than anything - client shouldn’t have sent songs until tracklist was finalized and for sure shouldn’t have allowed him to be the atmos mixer if their budget was already suffering. And I’m not sure if charging a “studio fee” is standard for the top dogs but that one caught them by surprise and it was pretty substantial hit",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1461078511472345331",
    "author": "Tristan",
    "date": "2026-01-14",
    "content": "Anecdotally speaking I’m still busy monthly with requests for atmos. Had two very recent meetings with A&R’s at imprints juggling whether or not to get one or two of their developing artist projects an atmos mix to help promote on Apple. So, no not DOA. Apple Music currently accounts for 30% of streaming in the US, it was about 10-15% about 5 years back. ASAF is also very much full steam ahead in development so who knows. tl;dr not DOA, perhaps plateaued.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1461082392814161961",
    "author": "georget113",
    "date": "2026-01-14",
    "content": "ASAF looks cool but so far looks far more geared towards immersive content that is not music related",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1461083642888454334",
    "author": "Rollmottle",
    "date": "2026-01-14",
    "content": "No doubt the industry at large is still requiring it because of the promotional levers it provides, but the question remains to be seen whether spatial audio for music provides any meaningful value proposition to music consumers. My sense is that it's not at all and in that regard, has seemed DOA from the jump.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1461099112706605206",
    "author": "georget113",
    "date": "2026-01-14",
    "content": "I think apples stockpiling content for there new immersive ecosystem",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1463793561664229518",
    "author": "Gerhard Westphalen",
    "date": "2026-01-21",
    "content": "(When calibrating speakers e.g. on an Atmos system you don’t use full range)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1466532490192883896",
    "author": "Gerhard Westphalen",
    "date": "2026-01-29",
    "content": "In my studio I have almost 10 kW of class D amps. Last I checked my entire studio idled at around 4 amps and with the system going full throttle with atmos it was hitting around 6 amps. That would be around 700 W. When I've had power outages I have had the breaker trip when power comes back on from everything trying to power on at the same time. No clue how much that would theoretically need but if you don't try to turn everything on at the same time, a 1800 W generator should be plenty for most set ups",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  }
]