[
  {
    "id": "1071152823535943792",
    "author": "Slow Hand",
    "date": "2023-02-03",
    "content": "I'd like to say thank you to @everyone here. It's no overstatement to say that you *are* this server and the reason for it's success.\n\nWe've got a very special community that's been built up over our short history and this place would fall apart if each and every one of us wasn't maintaining the level of excellence, understanding, kindness, and great discourse that this place is known for. We've got something special here.\n\nI love to see how welcoming you all are whenever we get someone new and how helpful we are at answering the questions of people at every stage of their journey. Hats off to the collective \"we\" and to the individuals who make this place great.\n\nAnd finally, thank you to @oaklandmatt for creating such a place. Thank you for everything that you've made here and for giving us a place to thrive and come to know one another.",
    "reactions": 91,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1172744309477482516",
    "author": "cian riordan",
    "date": "2023-11-10",
    "content": "Workshopping some good venn diagrams:",
    "reactions": 52,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1272668518780764240",
    "author": "oaklandmatt",
    "date": "2024-08-12",
    "content": "Bummer for him but honestly it's part of why I do it like that. People who really want to hunt to be great find us. And casual people won't ever recognize me as a \"podcaster\" (no disrespect of course, just not what I want). \n\nWe all win.",
    "reactions": 37,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1175675497343090729",
    "author": "NoahNeedleman",
    "date": "2023-11-18",
    "content": "Ok Long Post alert, but touches on a few things we harp on around here. \n\nSo my little bro is in town- we made dinner for one of his oldest friends who just moved to town with his wife. He’s a fantastic mandolin player and his wife is a singer/songwriter. \n\nOf course I did the ol’ studio walk through, listening to all the tunes on the ear calibration playlist, then let them play some of their own favs. Of course they’re blown away and have never heard music like this etc. \n\nBut to drive the point home I show them a song @Rollmottle and I turned around in just over 24 hours. “The reason for the speakers & treatment etc is so we can make decisions quickly blah blah blah.”  I pull up the session and we listen through and they’re loving it- but I’m noticing it doesn’t have the 3D thing that all the other music we’ve been listening to has. \n\nThen I show them the mastered version. An mp3. It’s louder and better sounding and all, until the first BGV stack hits… then it’s IMMERSIVE. We listened to the whole thing again just to enjoy the magic and notice all the ways the master improved it. So far beyond zapping resonances and making it loud, @Rollmottle made it sound… important. Made *me* sound like a good mixer. \n\nIt was heavier lifting for him cause I didn’t have the benefit of time for fresh ears or to detail the vocal the way I normally would. Also had the good fortune of having @Ross Fortune on speed dial and on GMT to give it a listen at 5am PST. \n\nI’d you’re curious, or dubious, I’ll DM files so you can hear what I’m talking about. \n\nTL;DR: monitoring matters, fresh perspective matters. Don’t produce mix *and* master your own shit.",
    "reactions": 29,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1319167571689476137",
    "author": "thegreatcarsoni",
    "date": "2024-12-18",
    "content": "Re; Brauer workshop\n\n-First 2 days were nothing technical, the 1st conversation he brought up was about TM and how meditation in general has helped him.\n-Everything is feel-based, most technical Q's for the first 2 and a half days got the same reply: \"It doesn't matter to me, i don't care what the thing is long as it feels good\". \n-MHB actually seems to leave the planet while he's mixing, it's wild how immediate he gets into that space. Seemed to go way past \"i love mixing and here's all the reasons i'm the shit\" and it was inspiring to see the ego leave the equation. His decades of experience are playing directly into his ability to access the story of the song and present it in a compelling, live-feeling way. He mixes from inside the song and performs. Well, he does discovery, then shapes the sounds, then performs just about everything on faders.\n-The biggest wake up call to me is that a lot of moves i've made on mixes did not have a good reason behind them. So continuing to ask \"why\" as I work is gonna be important, because I have to start catching myself and adjusting when the answer to \"why\" is \"because someone said this preset is cool\" or \"because this is what I do to a vocal/guitar/drums\". I feel music very deeply, it's why i got into this, but I feel like i've been poisoned against trusting that instinct and convinced that what we do is a technical job. I'm done being an observer of the art, i want to be bold.\n-It's critical to build trust with clients right away, you can't assume anything in what they understand about how you feel. Telling them you love the song and you're excited to mix it is important, and never blaming production/artist/anything else for the mix being less than what it should be. never okay to say \"i did my best\", because that gives you an out and implies somebody else could do it better\n-Therefore, you must believe when you sit down to mix that nobody is gonna interpret this song better than you.\n-Generally i'm skeptical to just take on someone else's \"method\" and start operating in that space just becuase of the success they've had with it. Putting this week into practice is going to mean using his template to get reps in, listening and feeling and interacting in a new way and letting my brain \"level up\", if you will, then zooming out and making it my own.\n\n\nI can distill this more and want to share about a couple other specifics, but I just realized I grabbed someone else's notebook by mistake when I left on the last day so I'll need to have them mail mine back to me.",
    "reactions": 26,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1413384027523776574",
    "author": "oaklandmatt",
    "date": "2025-09-04",
    "content": "Because I'm a huge Penn Jillette fan, I'll quote it from one of his books (which he has paraphrased many other times in essays and on podcasts):\n\n\"The big secret of magic is we are willing to work harder to accomplish something stupid than you can imagine. We'll practice things for years that you wouldn't consider investing an hour in. You can imagine spending half of your life under a bridge learning to play sax like Sonny Rollins, but you can't imagine spending five minutes learning to drop a palmed cell phone into a little pocket behind a cardboard cut out of Chris Angel while hanging across around its neck and talking a mile a minute without the slightest pause. I had to practice that a lot. A lot more than you can imagine. I had to practice it a lot more than you think it's worth. Our big secret is that it's worth more to us to do our tricks then you can even imagine. Our deep secret is simply misplaced priorities.\"",
    "reactions": 26,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1305643196180598784",
    "author": "Zach Hughes",
    "date": "2024-11-11",
    "content": "Hey folks, back from mix with the masters with Jon & Teezio. I wanted to share just a little bit in case anyone else here is considering attending a workshop in the future. I was initially on the fence, but am very glad I went. \n\nJon & Teezio were amazing together. I don't know how often MWTM does workshops with two engineers, but it really enriched the experience for me. It was actually comical how different their perspectives were on mixing, the business side, motivation for the work, lifestyle, etc... This created fascinating debate / conversation in the group. The Grammy nominations were announced while we were all together and we got to celebrate Jon & Teezio as a group for their I think combined 6 or 7 nominations. They brought in a bucket of champaign. All this after having gone through the sessions for said grammy nominated work earlier in the week. 10 / 10.\n\nRue Boyer studios is actually insane. Probably the best room I've been in.\n\nThere were attendees from all over the world. We ended up sharing mixes and receiving feedback from J&T. Hearing and sharing records in the same room with the people who made them with context provided from varying countries, cultures, genres, and scenes was as enlightening a music listening experience as I'm likely to have for the rest of my life.\n\nSo if anyone else here is on the fence in the future. Here's a tiny nudge.",
    "reactions": 25,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1381835030879535225",
    "author": "cian riordan",
    "date": "2025-06-09",
    "content": "Outside of the studio? This totally changed me. Seeing things through… start to finish. Caring about every step of the process. We’ve done so many home DIY projects… I’d be up late the night before planning, up early double checking. Staying afterward to make sure everything to put away and cleaned up. I care. Invaluable in building a home studio. I enjoy the results every day, even 5 years later I get a grin when I walk into that room.\n\nLearning to cook pizza? Figure out where you want be. I started doing this 2 years ago. I had no idea what I was doing. But I limited my variables, took things one step at a time. What kind of flour is best? Buy different ones. Try them. What hydration dough? Fuck if I know. Start with 60%… work up from there. How long to ferment? Etc Etc. I obsess over every step of this process. \n\nWhen I’m interested in something, I care about it. Nobody else has to, but I do. And I’ll go to bed at night, I’ll know that I’ve done the work to really know that it’s as good as it can be.",
    "reactions": 23,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1245951732626751550",
    "author": "LAPhill",
    "date": "2024-05-30",
    "content": "Gotta say, as someone who hasn't yet had need for Samply - the quick course correct after strong customer feedback is nice to see",
    "reactions": 21,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1212534041417355294",
    "author": "Nomograph Mastering",
    "date": "2024-02-28",
    "content": "Now imagine you keep going, slowly improving but over time you start paying more and more attention to your hands and not to the shadows they cast. You become enchanted with the clever contortions of your fingertips but stop really connecting with their effect in the world\n\nThis is what obsession with sound and tones can become. Mistaking the sounds we use to create feelings in our bodies, hearts and minds for an end goal unto themselves\n\nSo what does graduating look like? It doesn’t mean forgetting how to mic a kit or tune a vocal. It doesn’t necessarily  mean minimalism. It doesn’t really mean anything except focussing on what matters; how the sounds make you and hopefully your audience feel. This is the basis of my repeated hope for people to “Listen like a 15 year old girl”. She doesn’t care about sound, she cares how it makes her *feel* \n\nAn argument for feel is often viewed as an argument *against* great sound or *for* “phoning it in” which of course makes no sense. Many things can sound AND feel great, as long as you keep your eyes on the shadow on the wall, and not on your fingers….",
    "reactions": 19,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1431946264773267560",
    "author": "Ross Fortune",
    "date": "2025-10-26",
    "content": "Growing up in Ireland, without PP I wouldn’t have known that making records could be a legitimate career.\n\nIt showcased real life *professionals* working at a high level, and was my introduction to the discourse around the industry. Having only experienced studio work as a cottage industry up to that point, PP opened my eyes to avenues I could pursue that I wouldn’t have known even existed otherwise (recording engineer is different to mixing engineer is different to producer is different to songwriter??!). It all seems very rudimentary now, but I was starting from literally nothing in a place with few (if any?) visible role models.\n\nI learned so much from it on a technical level - from basic stuff like what a Pultec is and how people use it (connecting the dots between my cracked Waves bundle - Puigtec and who tf JJP was), what “a vocal chain” might look like and the purpose of each stage…\n\nTrue, the interviews did become unbearable, but there was a golden era between eps around 30-90 at a time when outside of working in the studio world, there weren’t many other sources of good information from people who were really doing it.\n\nHuge appreciation for Dave, and I hope he and his family get the support they need.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1053608949179502653",
    "author": "Ross Fortune",
    "date": "2022-12-17",
    "content": "I dreamt last night that Eric Valentine turned out to be a hacky, big on YouTube but where are his credits type character. \n\nHe'd leveraged the LWMR discord to sell 1,200 tickets to a 1 day masterclass type event, and had drawn all these people out to a field where he'd set up a huge marquee but no PA.\n\nWhen the session started, he had a projector showing his screen but it was too small, and nobody could hear what he was talking about, or what he was playing back from his laptop speakers. At the lunch break, a single intern was serving unidentifiable yellowish slop to a huge queue of people on cheap paper plates. The people in the queue were all disappointed but trying to remain positive.\n\nIn the queue, Eric walked past grinning, and when I asked how he was doing, he said \"can you believe it? I'm making $200 an hour today!!\". \n\nGiven everything I'd heard from @cian riordan and @oaklandmatt, I really expected more of Eric.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1259455818332377099",
    "author": "Ross Fortune",
    "date": "2024-07-07",
    "content": "Not sure where I got this list (quite possibly here), but I came across a note I'd made with a bunch of MWTM webinars:\n\n\n**MWTM Webinars**\n\nEddie Kramer - https://youtu.be/8Fr9CCUAabM\n\nGavin Lursson - https://youtu.be/lzG97zltG-s\n\nMotsy - https://youtu.be/qLOql8K4C3g\n\nAl Schmitt - https://youtu.be/QFU6kMjZ7iQ\n\nDave Kutch - https://youtu.be/RFV6ppC0ibU\n\nPhil Tan - https://youtu.be/LNQ2euD2Ezg\n\nGreg Wells - https://youtu.be/WUXJHkE87vM\n\nRich Costey - https://youtu.be/E1uUFBxa1YE\n\nBernie Grundman - https://youtu.be/2h7_yXA5ABI\n\nTchad Blake - https://youtu.be/b9z45sHmBkg\n\nKuk Harrell - https://youtu.be/lMpIoC2csaU\n\nBoi-1da - https://youtu.be/rCY65-Rnadw\n\nButch Vig - https://youtu.be/7xfH-DwgZ1g\n\nCLA - https://youtu.be/c2Z0nE-9PSA\n\nMichalis Micheal “MsM” - https://youtu.be/E0usUwMFLiU\n\nJaquire King - https://youtu.be/4tbJ0Jqw6ck\n\nStuart White - https://youtu.be/GUXWqgbjeGY\n\nRafa Sardina - https://youtu.be/aJUw3zFE5ts\n\nTony Visconti - https://youtu.be/MaCkIdi7xR0\n\nStargaze - https://youtu.be/Bfwki83uqFk\n\nIllangelo- https://youtu.be/S8Q51a1gEO4\n\nTom Lord-Alge - https://youtu.be/zY8ME1OPVWo\n\nDave Pensado - https://youtu.be/6b3V4iQEsUU\n\nBob Clearmountain - https://youtu.be/N1MwtKAi5K8\n\nNick Launay - https://youtu.be/D4sm0YMmBTY\n\nDavid Wrench - https://youtu.be/LQsGPkdgXDs\n\nShawn Everett - https://youtu.be/-bPY8-U9uwY\n\nJosh Gudwin - https://youtu.be/s8ujc75Bono\n\nSteve Albini - https://youtu.be/wnm8QR2kpa4",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1307534009084940329",
    "author": "cian riordan",
    "date": "2024-11-16",
    "content": "Rich Costey doing a Q&A on the gearspace forum right now and it's just amazing. On mixing the Rage Renegades album with Rick Rubin: \n\n\"Rick called me up after I worked on Fiona Apple \"When The Pawn..\". I learned a lot from him, primarily how to work from instinct instead of intellect. He would often make mix suggestions which I thought were bad ideas but I would of course do them because it's what he wanted, and they worked. He really did listen like a teenager, it was always simply whether or not he was getting off on something. If he wasn't, he'd make very clear suggestions on how to make something better. Sometimes he'd just say the mix sucked and to start over (only once). Sometimes the recording itself had issues and he would just deal with what's there. I think that turned into a serious strength of his- working with what's in front of him. We still keep in touch from time to time\"",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1318374170672894084",
    "author": "thegreatcarsoni",
    "date": "2024-12-16",
    "content": "Last day of this Brauer workshop in Paris is tomorrow and I’m not able to get to sleep. Just wanted to mention it’s been enlightening and fascinating to follow along with all the discussion in here lately about work and purpose and living in the moment *during* a workshop where we spent 2 days talking about life and feeling without ever touching a plugin or saying the words “mix bus”. Brauer is really tuned into the frequency I see reflected on here often and it’s leading me down a really freeing and passionate path that’s inspiring instinct and fun lead the way rather than thinking and obsessing. I have many thoughts from this week, happy to share whatever if anyone feels like that would be helpful. But I’m equally happy to just take all the lessons from here and there and move forward with a fucking awesome renewed excitement for this work. Ready to make some goddamn records and actually enjoy it",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1213530411637018765",
    "author": "Rob Domos",
    "date": "2024-03-02",
    "content": "Love the whole conversation above. \n\nOne thing to consider with the whole “people hire me for my taste” thing is that it’s important to have not only a refined palate, but also a broad enough one to be collaborating. \n\nI’ve worked with extremely talented people who don’t have the breadth to apply their skills to something even slightly outside of their *exact* preference, and I perceive that as being to their detriment. \n\nIf you want to be a professional chef and you make incredible arrabbiata but begrudgingly phone it in with alfredo, you’re going to have a pretty poor career telling Italian restaurants that you’re the right guy for arrabbiata and the wrong guy for alfredo. That’s niching down a little too hard a little too early.\n\nI think it’s our job to find the essence within something and maximally bring that essence out. Often these “taste mismatch” issues come across to me as missing that essence within the thing you’re working on and trying to make it something that it essentially isn’t. ie. A wannabe Max Martin working with a wannabe mitski and the producer complaining that the artist’s suggestions are making the production hashy and the artist complaining that the producer’s production choices don’t convey enough emotion. \n\nIt’s talking past each-other and not really collaborating. You aren’t learning to truly love what your partner loves, which IMO is frankly a big part of the job.",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1273850058751869069",
    "author": "Slow Hand",
    "date": "2024-08-15",
    "content": "Well, folks. Y’all are wonderful. It’s really the people here that make this place what it is.\n\nThe thing I’m most proud of is the level of thoughtful discourse and respect for one another that we’ve cultivated together over these last few years. It makes this server a jewel among untold acres of nonsense and dysfunction. Thank you for being excellent people to one another.\n\nAnd thank you all for keeping this place so classy. I appreciate every single one of you who continue to maintain our high standards and keep the heart of this place true. Y’all are essential.",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1014749304155557918",
    "author": "Slow Hand",
    "date": "2022-08-31",
    "content": "You come home late one night and the real Serban is waiting for you in your darkened living room. He reveals the existence of the Mixer Illuminati and explains that he is but one of many people throughout history playing the role of Serban Ghenea; a mythical figure who has steered the course of art and commerce from the shadows for millenia.\n\nRome, Tenochtitlan, Mesopotamia. Serban was there. The fingerprints of past Serbans can be found throughout all major historical events - mostly just to dial back the presence of 3kHz where they can, but they were *there* nonetheless!\n\nNow you must be the next in the lineage to carry the mantle of Serban. Tomorrow you begin your Mixer Illuminati training. Where you're going Grammys don't count for shit.\n\nAlso @BatMeckley is already a member for some reason, and you're never gonna hear the end of it.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1440890718867423263",
    "author": "David Fuller",
    "date": "2025-11-19",
    "content": "Going back and listening to my work before and after I spent some time on this server.\n\nIt's much, much better after. Y'all rule and this is by far the best audio community on the Internet. \n\nEspecially @Nomograph Mastering @NoahNeedleman @cian riordan @masteredbyjack and of course the man himself @oaklandmatt but honestly it's everybody together.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1143478560384876604",
    "author": "oaklandmatt",
    "date": "2023-08-22",
    "content": "Ok I'm gonna go in depth about this because I think it's FASCINATING.\n\nThe top three songs have an overlapping core fanbase that is largely unrepresented (or maligned) in popular culture: the white working class.\n\nBut none of them are really straightforward \"country.\" \n\nThe first song is a viral hit that seemingly comes from an authentic Appalachian kid talking about class. Despite his very explicit statements about hating political division, it has of course been wildly politicized because everything on the internet is these days.\n\nThe second song is a white male country singer covering a black lesbian female's iconic song ALSO about class. Talk about intersectionality...\n\nThe third song is the longest running solo male #1 song on the Hot 100 from the biggest star in country music (and really one of the biggest stars in the world... just, again, not covered by the current fashion of mainstream culture). It's a kinda-country-but-kinda-just-pop song co-written by the biggest country writer in history (Ashley Gorley) as well as once-rapper-and-Dr-luke-protege J Kash.\n\nThe rest of the chart is interesting too. #4 is a four year old taylor swift song that has gained traction online from her current tour so the label started pushing it as a single. \n\nThere are two Olivia Rodrigo songs, signaling a true new superstar.\n\nThere are two songs from the Barbie soundtrack. In a \"dying\" movie industry currently on strike, when is the last time two songs from a movie soundtrack have been in the top 10? I dunno.\n\nAnd lastly, there's only 1 trap song. The majority of these songs are people playing real instruments and writing more \"classic\" singer-songwriter songs. Rap music is really having a lull after a decade of dominance.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1229866268174319687",
    "author": "cian riordan",
    "date": "2024-04-16",
    "content": "\"Sorry about the late night duplicate file, I did this track after six other people because I'm rushing as a team player.   I delivered as promised up front as we are all in overtime now to make it great.  *CLIENT* is happy with your work and with mine and we are all working overtime together.   Apologies also, I know there were some annoying ticks in there with some of the revised files. Still not sure why this one session did that. \n\nOf course I don't listen to every single file, post rendering.   We render and send 500-1000 files a month with the revisions on the 200-300 monthly songs that I do.  Team players don't ask such things on CC.  I work usually 7 days a week for 40-50 people a month, and making them happy with great masters is job #1.  Perfectionism is not a part of that process.    Software makes mistake, and that's ok.    People make mistakes and that's ok.   Mixes and masters should never aim for perfect, they should aim to connect, aim for humanity.  \n\nPerfection is not the goal here, it's musicality and teamwork.  I'm sorry your ears suffered that horrible popping, but please, be cool. \"",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "842090097474011141",
    "author": "cian riordan",
    "date": "2021-05-12",
    "content": "Yo homie, these are cool videos but can we slow the pace of sharing here? The vibe of the discord is to engage in discussion about all aspects of record-making life, but just posting random recording tutorial videos doesn't really serve this dialog... in fact it disconnects the community and jams up the conversation. It's cool to share stuff, but perhaps at a slower pace with some sort of context and prompt for discussion. Thanks!",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1038600208663199816",
    "author": "Nomograph Mastering",
    "date": "2022-11-05",
    "content": "I’m curious about the idea of mini workshops to address complex questions in long form. So if someone asks something that requires depth and nuance, we agree a time and whoever wants to show up can",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1218694053588373524",
    "author": "Nomograph Mastering",
    "date": "2024-03-16",
    "content": "Ok gang, here’s something I’ve been pondering\n\nImagine 3 sliders that go from 0 to 10. Your goal is to set the sliders to maximize your wellbeing (in the broadest sense) and the wellbeing of those close to  you. The sliders are in effect zero sum, in that the closer you are to one end then less you have of the attribute on the other end. Let’s set the time horizon to 25 years and acknowledge the seemingly increasing pace of change in the world\n\nOk, the sliders …\n\n**#1 Classics vs Cutting Edge**\nOn this slider 0 represents maximum knowledge in a classical sense - literature, math, mythology, fundamental accepted basics in Biology/Chemistry/Physics etc etc. 10 represents complete literacy in the cutting edge of culture, science and technology - from memes and Reddit culture to AI to synthetic biology and Blockchain etc etc \n\n**#2 Specialist vs Generalist**\nHere 0 represents a very deep and specific knowledge of a chosen field (could be a doctor or a producer) vs 10 representing a modern Jack of all trades who knows a little bit about a lot of things \n\n**#3 Short Term vs Long Term**\nOn the slider 0 represents a disposition all about short term wins, fast plays that close out over a year vs 10 representing long investments in a given idea/field/belief system\n\nIt goes without saying that the zero sum aspect here is artificial, you can of course have some long term plays happening alongside some short term, but it’s just to get the juices flowing",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1343394333658841088",
    "author": "BatMeckley",
    "date": "2025-02-23",
    "content": "I think the line for me is “is this person someone  who makes records I care about, who also happens to make content?” Vs “does this person make content, and also happens to make records”. Both sides can have decent advice, but I’m far more likely to prioritize the information coming from the person I can verify has actually done music that I actually like and or respect. Just because someone talks loudly or with confidence, doesn’t mean their take has any value. (Online discourse 101)",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1039544857129127956",
    "author": "itaylerner",
    "date": "2022-11-08",
    "content": "This describes my girlfriend very well. An elementary music teacher, and honestly, by far the smartest, and wisest person I know. Could truly do anything she wants with her life, president, NASA, rockstar, you name it. She makes music for arts sake and single-handedly teaches music to 800+ 6-10 year-olds (yes your read that right).  Not to mention teaches me and everyone we know new things every day 🤓 with compassion and grace and elegance, of course.",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1326625245972398140",
    "author": "Nomograph Mastering",
    "date": "2025-01-08",
    "content": "Of course love helps!",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1073621645132054588",
    "author": "spectrummasters",
    "date": "2023-02-10",
    "content": "Lol I have v competitive friends (who I love ) . One day my pal asked to start coming. With me on my daily runs . Of course bro I said . He started getting his stamina up . It escalated into a Nike app facilitated monthly running comp . Now he runs marathons . I’m a lifelong swimmer also . He asked me to  give him some swim tips the other day . We laughed . Steel sharpens steel for sure and it’s best done with friends",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1224579280068022334",
    "author": "oaklandmatt",
    "date": "2024-04-01",
    "content": "I love this style of tutorial. Feels new and fun. And this guy has great insight, despite how simple the videos seem. I'm a big fan.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1071680222476374076",
    "author": "oaklandmatt",
    "date": "2023-02-04",
    "content": "Except for this of course https://www.youtube.com/watch?v=1ULQosh96BQ&t=1435s",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1157935206074949753",
    "author": "BatMeckley",
    "date": "2023-10-01",
    "content": "No matter where you’re at in the “making a record” chain, it’s probably a good idea to watch the YouTube of Chad Smith on Drumeo (the Dua Lipa one is good, but the 30 Seconds to Mars one is MINDBLOWING)\n\nOn the 30STM playthrough, he doesn’t know the song, and is only getting the track minus the drums. Watching him figure out in real time what the song’s about, what it needs, and executing it all while the track is playing is an absolute masterclass in understanding music. Dude just gets it. Structure. Tone. Makes it look effortless. Whether you’re a player or a producer, that kind of understanding really pays dividends.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1208501202979922061",
    "author": "Nomograph Mastering",
    "date": "2024-02-17",
    "content": "Of course I’m not arguing against have a portfolio, my better known clients attract me new clients. It does matter\n\nJust suggesting that the idea that it’s *the thing* that is holding you back is maybe misguided for some\n\nIn the lower tiers People get shots based on who they are and how they carry themselves. When someone like @cian riordan  says to me that he met a young engineer and he was impressed by her I am not checking the work, I wanna meet her and she what’s up",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1037415618263130154",
    "author": "chadwahlbrink",
    "date": "2022-11-02",
    "content": "https://www.dropbox.com/sh/bkotne3k34t739a/AACMZO4Kqomz9em0a3_mlC8Va?dl=0\n\nThis is a bit of a labor of love. \n\nAES NYC was a few weeks ago. I could attend in 2017, and the Mix With The Masters' talks were incredible at that conference (it was remarkable to see Al Schmitt in person before he passed). \n\nThis year, MWTM live-streamed all of the talks, but they were all during work hours. Therefore, I recorded the talks from Instagram into my sound devices field recorder and cut them into MP3s. I have been using the “Documents” app from Readle to listen back to these like podcasts. Sharing this here in case others are interested. Ignore the notifications during the talks 🫠 I didn't troubleshoot how to get Instagram to play audio without recording my phone's notifications. There are not too many, thankfully.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1077821096767799327",
    "author": "Nomograph Mastering",
    "date": "2023-02-21",
    "content": "\"Of course I didn't change my behavior, I just got a gate ... lol\"",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151355002711978026",
    "author": "cian riordan",
    "date": "2023-09-12",
    "content": "In defense of Peter, he and I operate in a VERY different world of vocal production than Beckley (and even yourself) do – with different sonic expectations, priorities, and goals. Beckley was part of the gang that forged new ground in modern pop vocal production... he's built a big part of his career on it, so of course we should listen to his insight. But there is another facet of the music industry that shoots for different outcomes (in Peter & I's case, that's records that don't sell and that nobody listens to).",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1218804358007754873",
    "author": "Nomograph Mastering",
    "date": "2024-03-16",
    "content": "Great thoughts all, and of course the intent was not “right answers” but rather to provoke a discussion about how we might orientate ourselves in this next moment",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230295961188696105",
    "author": "LAPhill",
    "date": "2024-04-17",
    "content": "If someone at the top of their game is posting tutorials, that doesn’t make me think less of them. It’s that the majority of people making tutorials are acting more like authorities than they are. Which then becomes a trust issue.\n\nSo I’m making a judgement based on their actual output, not simply that they do tutorials. Correlation without causation, perhaps",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1309182291330990180",
    "author": "thegreatcarsoni",
    "date": "2024-11-21",
    "content": "Just got accepted to the 4 day Michael Brauer workshop with MWTM next month- stoked!!",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1431713209496240239",
    "author": "hyanrarvey",
    "date": "2025-10-25",
    "content": "Man ya’ll ever think about how huge of an impact pensados place was",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1060694615184916582",
    "author": "Nomograph Mastering",
    "date": "2023-01-05",
    "content": "Apparently when you trash talk Pensado's Place it invokes a special clause where all your homies are guests on it the very next week",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1087122103473557624",
    "author": "Slow Hand",
    "date": "2023-03-19",
    "content": "Looks like we need a *Dap With the Masters* crash course the next time we have an LA Meetup.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1126974001051336895",
    "author": "BatMeckley",
    "date": "2023-07-07",
    "content": "I put on a streaky tutorial once as a joke when cian came over and my YouTube algo been fucked ever since.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263952180994510951",
    "author": "Skyler Young",
    "date": "2024-07-19",
    "content": "Pensados place I feel like isn’t given enough credit for how amazing of a resource it was at the time. Really the only place I could learn how the records I liked were made when I was young",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1165393507335278762",
    "author": "NoahNeedleman",
    "date": "2023-10-21",
    "content": "This is largely true of course, but having Michael Phelps as your swim teacher probably wouldn’t be the best move. \nMy dad was a decent guitarist- probably coulda been in skynyrd but not much else- but he was a world class educator cause I had to work to learn everything he did. \nTo make it in music requires a lot of talent and great taste in addition to the work and luck etc… I just don’t know if we can require success as a prerequisite for strong education content creators.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1167180930138513609",
    "author": "peterlabberton",
    "date": "2023-10-26",
    "content": "I was heading in to the studio before the band I was working with one day—was going to start a mix or edit drums or something. Was running late but decided to stop by my fav bougie bagel spot on the way in. Of COURSE I walk in the door and the band is sitting at the first table. They kindly told me they’d bring me whatever I wanted from the shop and that I should be on my way. 🙂",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1292575386357731429",
    "author": "BatMeckley",
    "date": "2024-10-06",
    "content": "Excuse me sir, we don’t do “context” in modern discourse.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1441129382705106975",
    "author": "oaklandmatt",
    "date": "2025-11-20",
    "content": "I love this.\n\nI worked with a young artist recently. I asked him if he'd done his vocal warm-ups before he came in to cut vocals. He said \"oh I forgot to do them.\" I asked him if he does them every day and he said \"oh sometimes I forget.\"\n\nI said \"do you think professional athletes forget to stretch and warm-up?\"\n\nI told him if he thinks of it like homework, he won't be successful. But if he wakes up every day and says \"I am a singer, this is who I am, of course this is what I do every day,\" then he's got a shot.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "809195791402270731",
    "author": "Eric Martin",
    "date": "2021-02-10",
    "content": "I put this up in the LWMR stream yesterday but I want to say it again. These streams are more valuable than the two years of Mix With The Masters that I had.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "895799026044248074",
    "author": "cian riordan",
    "date": "2021-10-07",
    "content": "If I'm hired as a mixer? Of course. It's a service industry. You do your best work up front, make your case, etc... but sometimes they want something different and it's your job to deliver it. Now, if this happens on the first mix of an entire album you're slated to work on... it might behoove the question of \"should we proceed?\". But I find these instances few and far between.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017161007002566656",
    "author": "peterlabberton",
    "date": "2022-09-07",
    "content": "Yeah… this is just me sharing my opinion, not trying to shit on anyone else’s: I am thoroughly uninterested in spatial/atmos. I’ve been able to listen in a few really swanky/certified rooms, to tracks that other more atmos-inclined folks were really pumped about, and I just thought it was gimmicky and—to my taste!—kinda lame. Not for any technical reason (though I have issues there as well), I just don’t care if a shaker sounds like it’s behind me and to the left or I’m *fully* enveloped in a reverb or whatever.\n\nIf I have to wrap my head around it to stay relevant, I’m fairly confident I can give my self a crash course—and if someone asked me to do an atmos mix and paid for the studio, then sure! But short of that… 🤷🏻‍♂️",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1027850965405159485",
    "author": "Nomograph Mastering",
    "date": "2022-10-07",
    "content": "One thing I will never ever ever do In mastering is send options. Never! In mastering it always breeds doubt, and seems to leave people wondering if they chose  the right one. Of course there is a “choice” between V1 and V2, but I’ll never send two different levels or two different eqs at once. I’m always presenting the current V as the definitive “now we have it” version",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124899644837728286",
    "author": "masteredbyjack",
    "date": "2023-07-01",
    "content": "@spectrummasters \n\nNo surprise Ross with an extremely thoughtful post and approach, and you always with a very thoughtful initial question.\n\nGonna keep this as short as possible since it’s late, and I guess I’d sorta like to ruffle a few feathers lovingly. \n\nBut from the freelance/work for hire side that I’m on, and most of us here are, I have to say, most people out here doing the thing are getting paid their ACTUAL value. \n\nYet everyone thinks they are worth more. Why? Who cares that we work hard? Not the market. We make art that is totally non-essential to how society operates…for most of the projects we touch there is almost no demand and they will make very little money. Of course this doesn’t mean they are not important, I deeply think they are, but we are talking financial value here.\n\nWe need to either provide people with an amazing experience (in many ways) that they find valuable or help them earn more money. Ideally both\n\nIf you are undeniable and continue helping people earn more, feel more, be more, create more…the money cannot help but follow. And the market will tell you your value whether you like it or not\n\nI don’t say this with the experience that others do, I have a long long way to go. so know that and of course take into account my perspective. This is all from a very loving place!",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1201241213878157442",
    "author": "NoahNeedleman",
    "date": "2024-01-28",
    "content": "I do think we’re most of us overly aware of our self-perceived weakness, but, there are different ways to clothe them. \n\nThere’s reps, of course, finding the proper gurus, of course, but for me, a lot of the solutions for my weaknesses are found in community. I’m not great at A but I know 3 people who are. I’m decent at B but have no interest in it, however I know 2 other people who love it *and* are great at it. \n\nSo my self-perceived weaknesses  ultimately led me to one of my actual strengths- culture & community building.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1203762692200857600",
    "author": "Jonathan Jetter",
    "date": "2024-02-04",
    "content": "Each person's mileage will vary of course, but I've absolutely had instances where I subjectively preferred less oversampling and more aliasing.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1311445699895754762",
    "author": "bobby k",
    "date": "2024-11-27",
    "content": "@michaeljmorgan echoing jack's sentiment - we're often caught up in people's highlight reels when the lows are just as common, if not more (as Michael explored a bit also in the T-giving blog).  the other cool point was around building instinct, noticing how people are learning their craft by watching & copying but that may be counterintuitive. perhaps a better route for growth than drowning in tutorials would be to listen to a ton of music to build your taste, then trying to reverse engineer what you like about those records in your own projects. I also liked what he had to say on the information he's unintentionally prescribed in past live videos and the Peter Attia quote -- many times i've wondered if a new engineer hears \"I don't compress\" wihtout any context and goes ok, compression is cancelled, but really that was a thing specific to Jon's brain at that time. though yea, a lot of people could get away with compressing *less* lol",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1317568717907038278",
    "author": "Nomograph Mastering",
    "date": "2024-12-14",
    "content": "So many people believe that they are “smooth high end”, “tight low end”, “1 dB of LUFS” away from winning. And it’s not true, but of course the aggregate of all of those things and so much more matters",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1336223921661284425",
    "author": "franc.castillejos",
    "date": "2025-02-03",
    "content": "Absolutely obsessed since I was a kid. Talents and desires have changed a lot over the years of course. Music is the thing I’ll always make no matter what. I guess I am hungry for more (which sometimes can make me feel selfish or something like it) learning, Better income, etc. but yeah I turn 40 this year and I feel a wall in front of me. Thanks so much for such a thoughtful response. Already a lot to learn there…",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1406084407550414858",
    "author": "Slow Hand",
    "date": "2025-08-15",
    "content": "This title *and* this thumbnail might be peak internet nonsense and a sign that I need to get off of Youtube. I'm giving it demerits for invoking both toxicity and narcissism in the same breath when it's probably inappropriate. \n\nI need to get away from internet discourse. I'm tired of getting exposed to people's wack ass takes.",
    "reactions": 6,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1464009817759809599",
    "author": "bobby k",
    "date": "2026-01-22",
    "content": "Those of you been doing this pro for a decade or more, how often do you think about quitting, switching careers and going back to doing music as a hobby? Asking for a friend of course",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "819426918582845490",
    "author": "rae",
    "date": "2021-03-10",
    "content": "Glad it was helpful! The bad experiences I’ve had have been all female perspective stuff - male producers/engineers being dickheads and talking down to me like I’m a child or over complicating things so I can’t keep up. \nFrom those experiences, I’ve educated myself (currently studying music production at university), I empathise with musicians when I’m producing - currently working on my first production project with an artist and her band and she has no knowledge of anything production but she wants to know what I’m doing so I explain it in smaller bites so it doesn’t freak her out as I know what it’s like to be freaked out by it 😂 \nOpen communication is the BEST BEST thing for me! Most people I’ve found can take constructive criticism pretty well provided you have a solution and your not just having a go at them of course",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1002342694003163156",
    "author": "Slow Hand",
    "date": "2022-07-28",
    "content": "“It’s kinda like *Pensado’s Place*, but less ads and mumbling.”",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1061743690739093614",
    "author": "Rollmottle",
    "date": "2023-01-08",
    "content": "I don't think most people suffer intentionally. They just know what they know. Takes a bunch of work to recognize your non-productive, self-sabotaging behaviors and many people attribute their creative fuel to these obstacles...however misattributed that may be. There's a lot of fear in addressing these things because, where will my creative fuel go? Better to recognize and acknowledge and try to course correct than suffer through adaptations that may not be doing you any favors. This is not easy of course.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1070111492344655882",
    "author": "Slow Hand",
    "date": "2023-01-31",
    "content": "Came across a stimulating quote recently that I thought was illuminating. The person said the following (paraphrasing):\n\n> \"The definition of a nerd is someone who thinks conversation is for peer-reviewing ideas. What do non-nerds think it's for? Negotiating alignment.\"\n\nSimply based on the way I've framed this question, it's probably pretty clear that I belong to the \"peer-reviewing ideas\" school of thought (mostly). I love to throw stuff out there, even if I don't believe it. I want to stress test it.\n\nI can certainly appreciate conversation as a tool for aligning people on a belief or course of action, but it's got me wondering about how many of us are playing completely different games when we're having a conversation, and what other games are there? Do y'all think differently?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1074336085624225903",
    "author": "hyanrarvey",
    "date": "2023-02-12",
    "content": "A good assistant should be more aware than the engineer and double checking everything the engineer is doing and learning to anticipate needs and then the goal is eventually to become a clone with a few extra features of the engineer",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101038709886943302",
    "author": "BatMeckley",
    "date": "2023-04-26",
    "content": "Years ago, a buddy of mine was DESPERATE for John Field’s snare sample. And i tried to explain to him it was more about arrangement and how the instruments around the snare work. And he was like “yeah I GET IT, but can I have the snare”. And this was a guy with good ears that plays guitar for STADIUMS.\n\nSo I say of course, come on by and I’ll give you the sample. And he without prompting goes “I’ll give you all my samples for that one”. I assure him that’s unnecessary but he insists. He comes by my place, plugs his drive in, and the very first sample he gives me is the John Fields snare sample.\n\nI can’t help but think people are chasing proficiency in the wrong areas.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1127539011641155656",
    "author": "spectrummasters",
    "date": "2023-07-09",
    "content": "It feels like a bit of an honour when someone’s paying me for anything musical i do. I defo dont do it for the money, never have. When i was at uni i used to run the rehearsal rooms attached to a pro recording studio (claim to fame ...wet wet wet’s all around me lol)...so i could just sit in on the studio sessions once I’d booked in the practice bands in the other part of the building. . After uni I’d do stage management/engineer assisting  at local venues in bristol volunterrring just to get experience......i did the wailers, ozomatli, pharcyde.....tons of two tone ska....while volunteering in dj workshops for local kids.....and up to today i always do some free stuff for rappers and singers in my area...because (and this is where i think mainstream often misunderstand rap lyrics).....it helps youngers express themselves and get shit off their chest....and off the streets.....and focuses their minds on ambition and change. In this way i think music is about grace....and as you said @BatMeckley  ...magic. What it brings into peoples lives and how it affects lives. The money i can take it or leave it....but the music i have to have. The most enriching musical experiences i can look back on have nothing to do with how much money was transacted",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1139431858355056660",
    "author": "AJ",
    "date": "2023-08-10",
    "content": "I didn't believe in hope for a while. For a while I stopped believing that a future was possible for me. Honestly... my immediate family brought me out of that mindset. They fought for my life when I couldn't. \n\nMy newfound hope comes from evaluating what truly makes me happy in life. And a big part of that came from learning to be more process oriented. But the more I became results oriented, the less hope I had.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1209359151914811412",
    "author": "Nomograph Mastering",
    "date": "2024-02-19",
    "content": "Seriously though, of course what you are saying is true. And the converse is also true, some of the highest IQ people I know can be tough to talk to and connect with. The goal is always just to meet people where they are as much as possible",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1313255054173802567",
    "author": "chrissorem",
    "date": "2024-12-02",
    "content": "So true! It reminds me of a child learning to speak. Or a child in general. It’s amazing to see the things they do to prepare themselves to walk, talk, to protect themselves. It happens over the course of time and suddenly they are grown up and arguing about politics",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1340778459391197225",
    "author": "Berlin",
    "date": "2025-02-16",
    "content": "of course. these are advanced ideas. these are ideas that most folks do not have the discipline or education or means to deal with.. \n\nmany times over, we all have had friends who have overextended themselves with credit cards and debt for gear.. payments outrunning their income. \n\nso plain and simple, don’t buy gear that you can’t afford with debt. i think that’s all i have to say about it.\n\nif we want to discuss setting up brokerage accounts and entering the market and leveraging assets, that’s so dope.. but very simply my point is, in regard to the original topic, which was looking for a good deal on used speakers..\n\ndon’t go into debt 4 gear.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1345167050800369707",
    "author": "masteredbyjack",
    "date": "2025-02-28",
    "content": "As a former (what I would call pretty high level) athlete, I actually think about this thing very intently with regards to working on records and draw from things from the past life. Mine is more focused on how I want to hear (or rather deeply understand how I'm hearing) every day as close to consistent as possible, given we are human of course.\n\nMy 2 cents (which of course is just my experience): \n\nSome sort of routine before you work. Mine is that I wake up almost exactly at the same time every day, will work out at similar times (if possible), literally eat the same thing basically every day before during the work day, coffee at similar times, have  the same routine when I sit down to start work. Not all of that is possible or useful for everyone, but I think we can all find something that would focus us in a way that's useful and ablet to be put into practice for us.\n\nTruly I find it helps a lot. We are physical beings, how our systems and bodies interact can definitely matter, especially in our ability to be available to the music.\n\nThat said, sometimes things happen and you gotta go. You will be tired, stressed, whatever. You have to do excellent work under those conditions too, it might be the most important skill if we are being honest about making a career of this. So training specifically for when you feel rough is definitely something I personally find important.  Which is where physically training helps, it's a way to force yourself into (fake) adversity and train response\n\n@Slow Hand I know you know all this, just my experience",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1378791679984664586",
    "author": "chrissorem",
    "date": "2025-06-01",
    "content": "I think if you beginning it’s more important for ear training  and generally you have more time to explore these things. As your skills become more defined and your time is more limited, it’s important to learn new tools but generally new tools are entering out of a void. Im less interested in new flavors but always interested in new ways of doing things. I’d also I’m much faster at deciding what I like or don’t like",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394435945553596508",
    "author": "Rollmottle",
    "date": "2025-07-14",
    "content": "The point isn't to tamp anybody's curiosity, it's to keep young record makers from wasting time on things that don't actually matter to the art of making records. A young record maker's bottleneck isn't their DAW choice. The discourse out there would have you believe your DAW choice, your plugins, the guitar bridge material, etc. are why you're not good enough yetl. Jon's mixes are incredible because of who he is, not because of the DAW he uses or what he believes about them. The kind of clip MWTM chose to highlight here simply feeds into the conflation of tools with results and are doing the broader community a disservice by leaning into it.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067885306482798612",
    "author": "BatMeckley",
    "date": "2023-01-25",
    "content": "I also think natural small endorsements work better than an hour long you tube tutorial. Like I’m more likely to use a pedal if I happen to see it on someone I admires pedalboard than if I see a 15minite YouTube review.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1080892524895420548",
    "author": "Josh",
    "date": "2023-03-02",
    "content": "*Ohio is hell*\n\nOf course the OK and NE guy has this take",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1139580668637093930",
    "author": "masteredbyjack",
    "date": "2023-08-11",
    "content": "I really think hope is essential to throwing yourself into something entirely. And that, more than anything, seems like its a huge key to success. Of course the world is so complicated it is impossible to generalize, but I've never seen a human throw themselves 1000% at something with hope and great intentions and not be \"successful\". It almost never looks like what you think at the outset, perhaps wildy different, but doors almost magically seem to open when the commitment is made to continue, if you are willing to see them",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1145108425982873720",
    "author": "masteredbyjack",
    "date": "2023-08-26",
    "content": "Love this discussion. All great points — my gut says there is a distinction between the producer/engineer role here and the artist. The learn grammar, be able to adjust and deliver on a vision/etc all lend themselves to being amazing technically and doing the reps to have those skills. Very useful on the service side\n\nBut some artists just have it like that. It’s irrelevant, they just crush stuff and have a vision. Pure talent. And probably the rarest ones have both sides and are aware of it. Then you’re truly dangerous\n\nHave seen this with some football guys I’ve played with — I was one of the ones who studied the game deeply and could improve. But other guys showed up on day one, knew absolutely nothing but could just ball. Their knowledge of the game didn’t even matter, they could just ball on instinct. Of course they worked hard, but there was a different level of talent there. And look at them now, cashing checks in the NFL",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147548936521912430",
    "author": "popaganda.",
    "date": "2023-09-02",
    "content": "Man, this was hard to get through. The writer’s smug attitude and lack of respect or reverence for the greats, because he assumes his perception of the world is correct on every level and anyone who differs is an idiot, kept me cringing. And of course hip hop is going to evolve. Everything does. I bet Bird-loving Jazz critics despised sellouts like Ramsey Lewis or youth-panderers like Herbie….it’s speaking to a different generation now in ways that are hard for older folks to understand. It’s fine. This is all expression. There are certainly things to lament about some of the turns hip hop has taken, but the dude’s tone is just coming from a holier-than-thou cynical condescending place",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1191801300581613638",
    "author": "bobby k",
    "date": "2024-01-02",
    "content": "love it. I think looking back on my time spent in school, I would recommend to myself to try to do fewer things, but do them better. i was drawing so many little circles for myself -- full course work, trying to do the producer/writer thing, had a band, tried mixing or mastering for other people, accompaniment for recitals, even had a stint building stage design for a local band's show. i wish i could have told myself -- hey there is nothing wrong with wanting a taste of everything that interests you, but maybe don't do it *all at the same time*. I wonder if I would have picked one thing at a time and said, this is the one thing i'm spending all my free time on and going deep with *for now*. i'm just reflecting out loud, but I hope this can be something to think about if you happen to be anything like me haha",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1234218339891544246",
    "author": "Slow Hand",
    "date": "2024-04-28",
    "content": "More and more I'm beginning to appreciate that there is a gap between people living their lives in meatspace and the perpetually online. There's an entire strata of online discourse that's completely invisible to a lot of people, and they're probably better off for it.\n\nIt's odd how disconnected we can be from each other when we don't share the same media spaces. \n\nDespite the shortcomings of the old media models there were unifying benefits when people were all tuned into a small number of media outlets. I don't expect that will ever come back, but I wonder if there's a way to reduce the complexity of the fractured niche narratives that people are tuned into.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1238562968510398485",
    "author": "spectrummasters",
    "date": "2024-05-10",
    "content": "I agree so deeply on that . Part of my part time work life was life guarding . We had special evening sessions for child swimmers  with level 3 autism . The devotion and love the activity relied on from the parents to support their children in learning to swim was always profoundly moving . Every week . Humans are ultimately compassionate kind and caring . These parents demonstrated our greatest humanity imho man",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1239661821988966611",
    "author": "NoahNeedleman",
    "date": "2024-05-13",
    "content": "Beckley & Cian are of course right on the money. \n\nI’ll add that it’s often really tough not to take “notes” personally. Especially in mix world. Currently getting notes from a producer who wanted the mix gig but whose mix was not even close to pro sounding. \nHe’s a sweetheart, but I still feel like all he should be saying is “thank you for making me sound like a good producer.” ¯\\_(ツ)_/¯ \n\nAll that’s to say, you’re not alone. It never changes. And when we I say “don’t take it personally” it’s a do as I say not as I do type situation. \n\nAnd then, always, respond with enthusiasm and execute the note. 🤪",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1248749285571563700",
    "author": "cian riordan",
    "date": "2024-06-07",
    "content": "On a tangent: I had an older client in my pre-LA days that would hire us to record an EP in a weekend — our team would play and record all the instruments but the catch was that he also had us purchase a big sack of cocaine for him and insisted that we do it with him over the course of the weekend. While those were some fun sessions, the work was uh. Not good.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1374401789285236852",
    "author": "Jasper Boogaard",
    "date": "2025-05-20",
    "content": "Something specifically I have learned about emotionally charged release days: \n\nif you are able to, the best way to spend these is doing something fun and distracting. Of course you do all the promo things you need to, but after that just have a good time, maybe go celebrate with the people you made the music with. But staying on your phone waiting for all the likes / streams to roll in is a bad time in my experience, even if people love it!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1389259942728437916",
    "author": "chrissorem",
    "date": "2025-06-30",
    "content": "@Adam Thein  who were you playing with?  I mixed the pyramid stage years ago and as you know it’s typically a mud fest , the artist I was working for forgot his normal shoes so we traded and I wore his knee high Batman rain boots and of course it ended up being a beautiful day and all the tech lads were having a good laugh at my boots when I got to FOH",
    "reactions": 4,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "990849472546373632",
    "author": "sukhuno",
    "date": "2022-06-26",
    "content": "I would say most songs I’ve produced/written have taken about a week total time (30-50 hours) from inception to mixing/mastering. This kind of timing comes with repetition and developing your focus to be able to work clearly and with intention. I used to work on songs to make progress but now I work on songs to finish them - that was an important mindset change that I needed to make to get stuff done and finished. Also learning to not be so precious with every song has also helped a ton with writing and finishing more tracks",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1016154260708282369",
    "author": "BatMeckley",
    "date": "2022-09-04",
    "content": "The internets dirty secret is just how much songwriting and arranging knowledge Justin Hawkins is dropping on his YouTube channel every day. There’s a lot of silliness, but the way he talks about melody, structure and intent is just a MasterClass in how to make songs that people want to listen to",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058297465046061126",
    "author": "Nomograph Mastering",
    "date": "2022-12-30",
    "content": "Of course not, believe me I suffer from toxic humility Irish style",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063177024438542336",
    "author": "ALXCPH",
    "date": "2023-01-12",
    "content": "Ima start a Channel and just tell everyone the only way to win a Grammy, is with a perfect 26hz. Just use Cian as my source. I already see the sponsorships rolling in. Can’t wait to sell my course, how to get 26hz like the pro’s.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1094378063195811941",
    "author": "Deleted User",
    "date": "2023-04-08",
    "content": "the reason why I put quote unquote is because people who interpolated the art may have done it out of appreciation of the culture without intention to take credit for it, but the course those events took in the history in relation to disparities in public receptions isn’t something I’m fond of\n\nIt still happens today in all disciplines of arts",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1104429597120020530",
    "author": "Rollmottle",
    "date": "2023-05-06",
    "content": "i can recommend the tool Figma if you really want to get into designing and visualizing how you want your site to be. it's free and simple and specifically built for designing digital interfaces. you can chuck all your screenshots and ideas on the canvas alongside your wireframes and actual design. you can even prototype it if you want. the learning curve is not high. i use it professionally daily for what it was made for, but i also use it for tons of other things like visualizing signal flow or gear layouts in the studio, mood-boarding, designing non-digital things like rooms and furniture layout, making memes 😂 , etc.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115428377487224924",
    "author": "LAPhill",
    "date": "2023-06-05",
    "content": "Us as music folk have the opportunity, if not the responsibility, to ask these questions and be aware that we are actively contributing to culture in some way. And, in that way, we have some power (albeit limited) to steer the course.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134144603872829520",
    "author": "masteredbyjack",
    "date": "2023-07-27",
    "content": "Gonna sound stupid and simple but just pure discipline!\n\nOf course this does not mean it is easy, it is in fact terribly difficult to do in actuality \n\nThere’s something almost meditative about being able to control your mind in such a way (I am still very very much working on this, and don’t think there’s ever really an end point)",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1140688878886465576",
    "author": "Slow Hand",
    "date": "2023-08-14",
    "content": "Know that you're not alone. Notation software is insanely complex. Both to design and to use. I used Finale for years and it makes me rage at my computer with the fire of a thousand suns.\n\nIf you want a laugh this guy Tantacrul is a UX designer and composer. His entire Youtube channel is him reviewing (and dunking on) the design choices of all the major notation software tools. It's well-reasoned and very entertaining. https://www.youtube.com/watch?v=S-3wEC6Fj_8",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147625614250102894",
    "author": "spectrummasters",
    "date": "2023-09-02",
    "content": "great convo all, thanks for the interesting discourse....i love this community here. v v dope",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151168610455265414",
    "author": "masteredbyjack",
    "date": "2023-09-12",
    "content": "You Against Yourself - Ruel (masterclass in loudness and still keeping the feel), and Dear Seventeen by Gretta Ray -- love the midrange density and how I connect to the vocal, right on the edge in spots\n\nAll the things on the playlist are there to sorta act as \"boundaries\"...right on the edge of too much low end (Dale)...mid density (Nathan)...etc. Not that they do that all the time or anything…just those songs in particular for me make a \"box\" that fits the edges of my taste. And all records that move me, and maybe do things I never would have done naturally so I can learn from them",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1173293969061458052",
    "author": "chrissorem",
    "date": "2023-11-12",
    "content": "Next on mix with the masters, how to mic a direct bass.\nMaterials used 3 mics",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182049709016240229",
    "author": "Nomograph Mastering",
    "date": "2023-12-06",
    "content": "Of course I’m atypical, and you’ll get engagement for gear centric stuff. But I wonder about the place it delivers you to…. You may find Colt got there first",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1191835460285255851",
    "author": "Josh",
    "date": "2024-01-02",
    "content": "Let us know when the Nomograph Course ™️ is dropping 😂",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1192290923816681532",
    "author": "peterlabberton",
    "date": "2024-01-03",
    "content": "Also—and this is probably at the core when I am adamant about, for instance, not getting hung up on converters—one of the most difficult things I think is figuring out *where* to focus your attention, what to care about. You can’t possibly care about every single detail on even a simple, otherwise straightforward song. Learning to focus in on the important bits and actually not care about the irrelevant stuff is, I think, one of the main things you gain with experience.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230263714926821459",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "I'm trying to think of any instance where I saw someone give an IG style short tutorial and thought more of them as player/writer/producer/engineer/masterer afterwards",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230299551488020613",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-17",
    "content": "If Louis Bell’s 600 hour tutorial on studio.com was posted as shorts I might actually eventually finish it",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1275140610269122591",
    "author": "Iwan Morgan",
    "date": "2024-08-19",
    "content": "Absolutely @Nomograph Mastering i’ve got some perspective on this as I teach production and engineering as a visiting lecturer. The worst lectures (when I started) were just dense information with very little active element for the students. They had the info presented to them so that was learning, right? Of course, that was the wrong approach, and the more i’ve just provided broad themes to the group - i.e. make the sounds in front of you “angry, happy, distant, close” or “we will record/mix/master an EP within the next few weeks” the better the sessions go, and the more inquistive the students are to uncover the “learning” as they are doing.  I find making a fool of myself (“entertainment”) helps with this as it’s a useful tool to disarm the groups and build rapport. The more you can encourage students to learn from each other, and share the learning - prompted by me, the better the outcome is for everyone.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1300512546004008991",
    "author": "Slow Hand",
    "date": "2024-10-28",
    "content": "Quite a bit.\n\nMy learning is less music-focused these days, but I budget a lot of time for self-development and continued study.\n\nSometimes it's  20 min a day in a technical book that I'm reading. I move slowly and make sure I understand before I move on. It may take two months to complete, but I'm steady with it and I do a little bit most days. It's common for me to transcribe notes from high-density talks that I want to learn from and revisit them often over the span of a week. I'm constantly printing out my notes and reading material so that they're easy to revisit throughout the week.\n\nI'm currently taking a project management course through MIT, which has been great. It's uncommon for me to do formal schooling these days, but this is work related and a direct application to my future capabilities that we thought would be beneficial for the company.\n\nWhen I buy a new plugin (rare) I set aside time to go through it and turn every knob and try each feature to see what it's capable of. Learning a tool on the spot is a good way to kill the creative flow, so I do the exploration up-front when possible.\n\nOften I'll have ideas for novel ways to use a tool (layering distortion, for example) and I'll set aside two hours to explore it and see what I find.\n\nThat said, I think my day-to-day may be quite different from a lot of folks here. My eggs aren't all in the business and pressures of record production, and so I rarely find myself buried in such commitments. I tend to keep \"normal\" business hours these days and keep a hard separation between my commitments and my leisure.\n\nIn fact I'd say that I'm actively structuring my life so that I can retain my leisure and don't find myself overwhelmed with commitments. That's a whole other story, though.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1334344891270168596",
    "author": "Slow Hand",
    "date": "2025-01-29",
    "content": "Of course, SXSW is gonna take that quality and crank it up to 10 when every coffee shop and open lot becomes a venue with a full PA. For better or worse. After ten days of SXSW you will *pray* for a quiet moment.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1387491506822316083",
    "author": "masteredbyjack",
    "date": "2025-06-25",
    "content": "Honestly? I'd tell the producer that the artist wants it that way -- send him the updated master so he can hear (off CC) and tell him what's up. Not his song. We work for the artists.\n\nWould sending producer the new master cause him to get into it with the artist? Feels like something they should resolve, not you (for the good of their relationship and the project).\n\nDo it all nicely of course (saying that for others reading) but you know how to do that",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1431387077567709345",
    "author": "onanisland",
    "date": "2025-10-24",
    "content": "@Julia Borelli congrats on your masterclass at ADE!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1431765249845100725",
    "author": "sinaigimenez",
    "date": "2025-10-25",
    "content": "I got really sad when I saw this. It probably hits harder because my dad is around the same age and has Parkinson’s it's not the same but… \n Dave always seemed like a genuinely good person, and I’m grateful for how he tried to spread knowledge.\n\nI’m with Cian on the interview quality — a lot of them were just awkward (the Justin Meldal-Johnsen one is a perfect example), and the absolute worst part was Herb. In the end, his stupid ego kinda killed the show. It was really annoying how he kept interrupting all the time and talking way more than Dave or the guest, about random shit that had nothing to do with the conversation. Fucking terrible.\n\nBUT I can’t forget that back in the day, Pensado’s Place was one of the very few places where you could actually see your mixing heroes talk about making records. Even when the interviews were pretty bad like 85% of the time, I still had great moments watching Eric Valentine, Tchad Blake, JMJ, Ken Andrews, etc… and I learned some useful stuff too.\n\nI’m from a small village in Northwest Spain (BTW, I heard Pensado has family roots here), and I had zero access to any info about how real records were made. So when I discovered Pensado’s Place, it was huge for me. Big thanks to Dave!! And I wish him nothing but the best in this sad new chapter. Good people and love for this art will always win for me, no matter the flaws. ❤️",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1439335630449410178",
    "author": "chrissorem",
    "date": "2025-11-15",
    "content": "I completely understand,  you pour your heart into something and of course you wanted to see the daylight but people have all sorts of reasons of why they do the things they do just try to be supportive. Give them your honest opinion and the rest is up to them.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1469789087442669893",
    "author": "Circul & Eas",
    "date": "2026-02-07",
    "content": "I’m just a learner here, but I bet you’ll be happy to know that finding the Live with Matt Rad podcast and spending time in this forum allowed me to basically fully quit watching YouTube tutorials. So much better to just check in with the solid experienced folks around here.\n\nThanks for the way out y’all!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1471572529821908993",
    "author": "spectrummasters",
    "date": "2026-02-12",
    "content": "As a concept , I think “truth “ is a tricky thing to pin down . It can’t really exist without its relationship to time . Truth changes with time . Imho. \n\nThat said , I fully believe music contains archetypes , sacred geometries and of course waves themselves ,…..that are essentially the cosmos breathing and manifesting . That maths , physics and music all relate to each other , that natures forms , in patterns like the golden ratio to be found in a fern , or an excellent arrangement of a song , that sound and light energy all share phenomena ….these things , the patterns , the scales , the ratios and then the ancestral mind and genetic memory , the ancient truths , instincts , symbolic folklore and intuitions ….as Blake called it …..our imaginations being the direct experience of nature itself ….\n\nWhen someone taps into that and writes something that speaks from and aligns those realms …..\n\nWhatever the message is , that’s what hits ….its an undeniable connection that we share as humans and brought into communion by the music . \nFor good and bad \n\nThat shout example s a good one Ruairi\n\nAnd also everybody wants to rule the world . \n\nThe arpeggio signals something universal as much as the lyrics \n\nIt’s a timeless voice that music unlocks inside us all . \n\nThat’s my take on “truth “ in a song . And like Cian said , it gives me a profound feeling. It’s so exciting and thank goodness for music . It’s such a magic gift",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "810230169373245461",
    "author": "oaklandmatt",
    "date": "2021-02-13",
    "content": "agree w @1ggy. it's probably a good idea to make it to a music hub at some point, but w covid and things locked down, LA and London both lack the usual networking possibilities. i'd stay put for now, save money or upgrade your system if it will really level you up. you def don't want to \"wait\" in the sense of not doing anything. of course you should work and get better and do all you can there, but making a big move to a big city is not nearly going to be as fruitful as it was pre covid. hopefully that changes soon!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "832721448136736788",
    "author": "Josh",
    "date": "2021-04-16",
    "content": "It bums me out how many spots are dark. I find natural wood, natural light (if possible of course), and lighter earth tones are so refreshing and help me not want to take a nap.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "851632515675848724",
    "author": "cian riordan",
    "date": "2021-06-07",
    "content": "Most times when I’m using it... I’m mixing, so distorting someone’s low end just doesn’t typically work in my favor, if anything, I’m trying to preserve it so it can cut through. But if I’m in production mode and it sounds cool — of course. But that’s just rarely the case.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "907377284082720769",
    "author": "Tyler Graham",
    "date": "2021-11-08",
    "content": "@Bainz_ ‘s pensado’s place is up on YT rn, check it out",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "943970204218712144",
    "author": "Adam Thein",
    "date": "2022-02-17",
    "content": "My main tip for using Live live is try and replace as many third party plugins as you possibly can with stock, freeze as much as you can, and most of the latency you experience is going to be coming from internal delay compensation vs I/O latency.  If you are able to optimize your sets as much as possible, you can probably get away with running everything without offloading DSP to a UAD system.  If you are already in that ecosystem by all means!\n\nI built a live set similar to what you have going based off of Daniel Mintseris Lynda (now LinkedIn Learning) videos that were amazingly helpful.  Also in my case I made samplers whenever possible of 3rd party synths if the patch didn't have a ton of modulation internally.  But yeah bottom line is keep an eye on your total device latency on groups (hovering over a group will display the total delay compensation/latency calculation in the Status Bar).\n\nIf you have any other questions for me feel free to DM!\n\nEdit: we used a rackmount X32 for in ears that also served double duty as the audio interface running 16 i/o at 48khz and were able to do it on a 2015 macbook with minimal latency",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1022236007405461574",
    "author": "sukhuno",
    "date": "2022-09-21",
    "content": "Does anyone have any recommendations for how to learn an instrument coming from a computer-producer centric background? I understand harmony and music theory - I can play guitar okay but nothing special. I feel like I’m not coming up with any especially cool melodic/harmonic ideas and my inability to express myself on an instrument is becoming a bottleneck. This would be for guitar btw. Really just looking for a roadmap from better players than myself on what I should learn and what should be priority so that when I’m in the studio working on tracks or collabing with others - it’s easier to come up with new ideas and improvise more.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1022252012336848907",
    "author": "ALXCPH",
    "date": "2022-09-21",
    "content": "Yes. The same way you do anything in life you want to get good at. Spend a shit load of time doing that thing. There really are no hacks or work arounds if you want to actually get good. An easy free way to do it is just learn as many songs as you can. If you want to really be proficient in the musical language I would recommend learning stuff by ear. It takes a lot longer than looking up tutorials or sheet music. But I promise you will develop your ears infinitely more. Specially in the beginning. Music is a language. Every human being learns to speak and converse before they learn how to spell and know the rules of grammar. Learning theory will only let you put names to sounds so that you can convey musical ideas to their people. Contrary to what a lot of people think, there are no rules, but there are a lot of conventions and traditions, but they keep changing and have lots of exceptions. Learning a shit ton of songs on whatever instrument you choose, will teach you what those conventions are and how to use them. \n\nIn the beginning it’s good to just learn every song you like as well as you can, because it will help keep you motivated as you like the music. Then after a while you will probably want to branch out and try stuff you’ve never listened to or enjoyed before just to challenge yourself. \n\nThe most musical people I know, are the people who wouldn’t know what to do with a Caugmented#9 but can listen to a song once and play it nearly perfectly, because their ears and musical language is so developed from playing a fuck lot of music and not spending time reading about it or watching endless tutorials.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1027618566167605348",
    "author": "Will Melones",
    "date": "2022-10-06",
    "content": "Of course mixers and mastering engineers hope the producers did their job and the notes are like “can the whole vibe be 13% more spongey” and “let’s purple out the prechoruses all the way”",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1037550233720201356",
    "author": "sethearnest",
    "date": "2022-11-02",
    "content": "That Laura Marling album ❤️ . Greg Koller, the silent genius. Can't find a thing about that guy anywhere except that everything I hear that he has touched is an absolute masterclass.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1042837213840416768",
    "author": "popaganda.",
    "date": "2022-11-17",
    "content": "There are some classical etudes that are good for that….Villa Lobos etude 1, Brouwer etude 6. Idk if u read but if not there are probably tabs or tutorials around. That could be a nice change if you’re used to doing more boring repetitive stuff.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1052620009005924414",
    "author": "Nomograph Mastering",
    "date": "2022-12-14",
    "content": "That makes me so happy to read Chris. Going back to our first workshop about building your community",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063178424534958141",
    "author": "Zakhiggins",
    "date": "2023-01-12",
    "content": "I think most people that do these videos don't do it to REALLY help people, it's more that they want to make a second income (or main income) off social media or selling courses etc",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1069314740599390208",
    "author": "Slow Hand",
    "date": "2023-01-29",
    "content": "It's a very powerful tool, but it also has a massive learning curve, FYI. I had to set aside an entire weekend to really wrap my head around it. So definitely ask yourself what you hope to get out of it before you go in, because there may be another app that can serve that purpose with only 1/4 of the complexity.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1072553114596556832",
    "author": "1ggy",
    "date": "2023-02-07",
    "content": "Cian, Jon, Tyler, Bainz, Peter, Teezio, and of course Matt Beckley, have either won or been nominated.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1075821344433909830",
    "author": "jantrit",
    "date": "2023-02-16",
    "content": "@austenballard  On a similar thread I try to frame those situations like this. There’s no point worrying about something because if you can’t change it why worry and if you can, change it so you don’t have too. A huge simplification but something I find helpful with dealing with tough times in a studio. \n\nYou can get that weird moment in a session when something goes wrong  usually the best course of action is to be a positive and hopeful force for the band or artist to rely on. \n\n“Let’s get this sorted as quickly as possible and get back to work”\nDeep down I don’t think anyone really thinks you’re responsible for what ever happened, they’re just looking for a solution. Except of course Trevor, Trevor knows you did it and he’s mad. \n\nLol but really sessions are emotionally intense situations and places and sometimes that can boil up in interesting ways.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1076101070788505661",
    "author": "Barbara",
    "date": "2023-02-17",
    "content": "Loved reading all of this, I didn't catch the convo you had, but I'm glad you posted this @Ross Fortune . Having started as an intern, becoming an assistant after a few sessions and only later into engineering new projects and running my own sessions at the studio I work at nowadays, it's really clear to me that is you succeed at being a good assistant, people will trust you and you will be blessed with an opportunity to learn and evolve in a totally different and better way... I still assist some of the my colleague senior engineers and engineers that come to the studio for their own sessions, and I'm always eager to be on that spot... If you're that good and keep your mouth shut, you can only win - either by knowing the coolest people in the industry, by learning the craft, by learning how different people do their thing, different mindsets... And you REALLY learn what it takes for a session to run smoothly and for people to be comfortable in the studio, which will probably be the best skill you'll ever develop in this career... \n\nBeing an assistant is great, and all the assistants I know are usually the coolest people to hang with (and yes, I'm including myself, of course 😎😂)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1076105880011018310",
    "author": "Barbara",
    "date": "2023-02-17",
    "content": "Of course not! Go ahead, glad I can contribute!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1080529254887993447",
    "author": "hyanrarvey",
    "date": "2023-03-01",
    "content": "@Gerhard Westphalen your course came up on my ig! The algo is working!",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101893078085812245",
    "author": "Bryan DiMaio",
    "date": "2023-04-29",
    "content": "I think when I lived in LA, I went to the beach 1-2 times. Over the course of 5 years 😂",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121302220365910096",
    "author": "David Fuller",
    "date": "2023-06-21",
    "content": "A relatively easy circuit to understand is the Pultec EQP-1A. This is of course a passive EQ; any \"boosts\" are actually cuts with a gain stage afterwards, i.e. a low boost is actually a high cut with makeup gain.",
    "reactions": 2,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1123735110135582812",
    "author": "Josh",
    "date": "2023-06-28",
    "content": "I found this cool YouTube channel where this dude tours home studios and y’all ruined me. The amount of times I say “oh that’s super sick wait why does he have A- 😷 ad- 🤢 Adams 🤮”",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1126371517173862430",
    "author": "spectrummasters",
    "date": "2023-07-05",
    "content": "The winston brothers amen , James brown funky drummer , Lyn Collins think and the incredible bongo band apache .....all have the drum breaks that can be looped easily but of course also chopped ......soul heaven right there. Al greens “ I’m glad you’re mine “......tons of Barry whites stuf.....lol I’ll stop now, I could go on forever",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1128955967871127552",
    "author": "jantrit",
    "date": "2023-07-13",
    "content": "Of course! There’s no simpler pleasure then hanging with people on the same wavelength. It’ll be 7 years in September",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1154842900052578334",
    "author": "spectrummasters",
    "date": "2023-09-22",
    "content": "Having been on a bit of a deep dive of the rise of populism and isolationism over the last 20 years (and there I’ll finish  the political aspect of this ) ……it keeps occurring to me that what matt achieved in the. Global pandemic with the lives and catalysing a community like this discord ……I’d a profoundly beautiful  inspiring testament to our humanity and that in the face of the unknown , the abyss …….as it looked then …..music served us all again and brought us together in community and discourse . Thanks matt and thanks music . And LWMR . I be missing ya !",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165366662015500293",
    "author": "Nomograph Mastering",
    "date": "2023-10-21",
    "content": "Clear break point in the above is people who are busy and making a good living giving back, as opposed to someone for whom the YouTube channel is their job",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1168486119063703552",
    "author": "masteredbyjack",
    "date": "2023-10-30",
    "content": "Anyone @NoahNeedleman listed is going to be great IMO. All people who would do justice to your art and care about the project deeply! You can't go wrong. I'll shoot you a DM but my personal opinion if you haven't heard mastering before is go all in and get @Nomograph Mastering to do it -- of course budget could be a factor but just to understand what the highest level of mastering can and should be",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1187530486994718781",
    "author": "Zakhiggins",
    "date": "2023-12-21",
    "content": "Speaking of which, I’ve been going through @Gerhard Westphalen course last few days, very good",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1191796506903191592",
    "author": "Deleted User",
    "date": "2024-01-02",
    "content": "I would be stoked for that culture to come back. I’m with you on that being the most exciting part. Of course no one is required or would have any reason to buy modern records as physical copies, but the culture of treasure hunt coming back sounds really nice and exciting. If youth and younger generations can appreciate things beyond the current times, it would be very enriching culturally. \n\ncool thing about vinyls are what comes with it too, sometimes they come with pictures and scores of horn arrangements- even though those are probably accessible online too, it’s just a different experience. it’s like having a poster vs computer wall paper",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1194176584366698517",
    "author": "spectrummasters",
    "date": "2024-01-08",
    "content": "“ Beautiful skin for audio engineers “ ….a new BBC masterclass from Pharell",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230275785147809924",
    "author": "JakeTB",
    "date": "2024-04-17",
    "content": "Late to the conversation here but I wonder about devaluing the artist’s brand as well. when their new single becomes a YouTube tutorial they look a lot less like stars.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230365261350174773",
    "author": "Rollmottle",
    "date": "2024-04-17",
    "content": "Most of this shit doesn't translate to anything material without doing it on your own and putting in reps. You're getting bread crumbs anyways, not an instructional manual...the value of which is arguable per Ruairi's point above. You're arguably in a better spot without tutorialing than you are with.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1239437104665198653",
    "author": "cian riordan",
    "date": "2024-05-12",
    "content": "I mean, sure. If you have people to drive you around… then of course it’s going to be cheaper. But there’s no world where relying on Uber exclusively is cheaper than renting a car + gas (assuming you’re not renting a McLaren or something).",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240776624207564871",
    "author": "Berlin",
    "date": "2024-05-16",
    "content": "Haha, for sure. \n\nBack when I cutting all the time there were a few projects that had vinyl crackle embedded and of course, I would freak out mid cut trying to make sure my lacquer wasn't dirty or there wasn't some hair or whatever in the cut. - Because of course we are trying to cut as silent of a groove as possible.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266931770100813966",
    "author": "Dereck Blackburn",
    "date": "2024-07-27",
    "content": "The only thing I have to contribute is I work with folks in the 23 - 35 age range regularly (Im 44) and younger people who are HUNGRY to move up and ahead in their career get easily frustrated that things don't just happen for them when they're feeling like they're sacrificing a lot for very little recognition. There is also a lot of pushing and pulling the artists to fit their expectations instead of serving the art and letting nature take its course. Specifically theres a lot of \"I can't wait to help you realize the full expression of your music and art when we work together!!!!!!!!\" kind of vibe which is great internally but puts off older artists a little bit. I've seen it a lot over the last couple years with young producers and engineers and I wonder if its because of the pandemic, honestly. The whole \"check list to success\" thing is another good point. Some things are not easily repeatable or scalable with the expectation of the same result every time.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1319182958208221187",
    "author": "thegreatcarsoni",
    "date": "2024-12-18",
    "content": "For as much as everyone talks about the “Brauerize method” and his gear and everything, I really get the feeling his career was made on all the times he *didn’t* use that stuff and just made a great decision for the song. Heard lots of stories about how that was the case with Mayer, Coldplay, etc… The tools are just tools, and that’s why he’s gotten so many legendary people to participate in the MWTM platform. None of them need the money of course, but equipping the next generation with the right mindset and tools but enforcing that it’s their own creativity that will make or break a record? Man that’s undeniable to me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1336540726611410966",
    "author": "franc.castillejos",
    "date": "2025-02-04",
    "content": "That’s a great question, and honestly, it’s a long story that mostly comes down to life logistics, plans with my partner, family members who depend on my support, finances, and, of course, visas.  That’s actually part of why I’m working toward better gigs. Having a stronger career makes it much easier to get an artist visa down the line. As for music hubs in Central America, there isn’t really a Nashville equivalent, but there are growing scenes in places like San José, Costa Rica, and Mexico City (though not technically Central America, it’s a major Latin American music hub)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1346923682672672840",
    "author": "Felix Byrne",
    "date": "2025-03-05",
    "content": "its not ur grandfather's online mixing course",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1351775570366824460",
    "author": "Oli J",
    "date": "2025-03-18",
    "content": "There is degradation of course, but you get to preview it first. I find m4a sounds really good - more than enough for most people to give mix feedback",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1362675733096431628",
    "author": "spectrummasters",
    "date": "2025-04-17",
    "content": "interesting...and in the spirit of good debate\n\ni really like the energy and the message ... i defo f with it....and think its helpful to think this way. Imho this vid would serve as a handy bedfellow to ruairis (fantastically eloquent) \"moving to LA piece\".  \nand yetttt, otoh for me....the need for people to consider grabbing attention and making a world for people to discover ....which he puts at 60% of the mission, is questionable. Questionable with regards to how we currently define art vs/and success.\nI think we're maybe in a chapter where our phone lenses offer us a portal to a global connection on the positive side, yet also a massive distraction from living life in the first person ....if my approach when im thinking about art is that once ive finished the creation, i now have to give the majority of my effort to making it grab peoples' attention.....i feel like that risks changing the intent.\nThis intent of course would be shaped by how one defines art vs/and success. \nIf the success of art is defined by its popularity (drake) i think this fellow's advice must be the MO....if the success is defined by a different metric , im not so sure its the right move to place so much weight on one's relationship with the external (the phone lens, the social media) and id weight it more on one's relationship with oneself , in spite of the world.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1378823039617339515",
    "author": "Slow Hand",
    "date": "2025-06-01",
    "content": "One of my composition teachers once told me that whenever he's commissioned for a piece he budgets the first 1/3 of his allotted writing time to exploration of new ideas and concepts. Once that time is up it's time for him to commit to a course of action and execute. \n\nA similar approach might be helpful. Maybe not in the same proportion, but in deliberate budgeting of time for exploration. Of course, there's a distinction to be made between deliberate experimentation and mindless/unconscious procrastination.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1431714702521667625",
    "author": "hyanrarvey",
    "date": "2025-10-25",
    "content": "People used to hide their settings before pensados place completely revolutionized how audio information was shared online",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1461170771626819786",
    "author": "jantrit",
    "date": "2026-01-14",
    "content": "Had an engineer that did Atmos mixes for something I mixed mention that “you guys can just use the fold down for the stereo mix if you want” \nI didn’t slap him cause we’re mates but it was close. \n(Said in jest of course)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "825804562514051124",
    "author": "Slow Hand",
    "date": "2021-03-28",
    "content": "Of course, there will always be cases where you will wish to take on a project no matter what the compensation, because you want to see it succeed and be involved. That's for you to decide.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "841405532803170334",
    "author": "Rollmottle",
    "date": "2021-05-10",
    "content": "I think I've posted this before, but I got fucking roached by the 2nd Pfizer shot. Felt like garbage for fourteen days. Took 24-30 hours to kick in...felt BLEH. 4 days after the shot I woke up feeling like DEATH: nausea, fever, chills, headache, etc. That went away that afternoon but I had a low fever and a general malaise until the 2nd Sunday after I got the shot (I got the shot on a Saturday). YMMV of course. 😷",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "873058046404861962",
    "author": "absflores",
    "date": "2021-08-05",
    "content": "It’s limitations and boundaries man. It’s knowing your tools best and able to squeeze the best of the least you have in your hands. Of course Kanye took it to a whole other level but the philosophy still applies.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "984544241726419045",
    "author": "ALXCPH",
    "date": "2022-06-09",
    "content": "Oh good i can already see all the youtube tutorials! 🤣 the pros dont what you to know this! But ALWAYS filter the root out of your bass 😝",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "997990121615921153",
    "author": "Jeremy Klein",
    "date": "2022-07-16",
    "content": "psa: if you have a Mix With The Masters account, you get a ton of amazing plugins for free, for example the Arousor.\n\nYesterday they just added a huge IK Multimedia bundle which includes Amplitude and the entire T-Racks collection of plugins.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1022708365538906172",
    "author": "Jodonny",
    "date": "2022-09-22",
    "content": "Well I guess everyone I’ve ever worked with in Nashville is a novice then because I’ve never heard anyone casually talk about changing the “polarity” outside of nerdy speaker conversations, or a Belmont audio engineering course, haha.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1023654328021565520",
    "author": "chadwahlbrink",
    "date": "2022-09-25",
    "content": "When I switched from logic to pro tools in 2017, puremix really helped make sense of pro tools for my brain.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1027290817192280105",
    "author": "Rollmottle",
    "date": "2022-10-05",
    "content": "I would only let a known quantity into my space, not randos off the street. They have to earn that status by building an ongoing relationship first. It's all fuzzy of course, but somebody who I have no direct or indirect connection with wouldn't get the pass.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1028436207803310131",
    "author": "Nomograph Mastering",
    "date": "2022-10-08",
    "content": "We enable art, support it, shape it etc but an engineer does originate art. Unless of course they are a modern multi hat wearer, in which case they ARE an artist",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1046888531198476418",
    "author": "Deleted User",
    "date": "2022-11-28",
    "content": "From my experience of going to music school and taking a whole bunch of courses that are all over the place in terms of lane of focus- school can offer almost too much. It helps to take some time to digest the information, I had this issue when I was in college and had a chat with some of the graduates and they said it took them years after graduating to decompose information that was learned. If you have doubts on if you should continue it may be useful to take some time off and spend on doing what you wanted to do, continuing to connect with people, or even just take breaks altogether to take a breeze of fresh air, live in outside world. Being in school kind of made me live in a bubble and getting out of that was really precious to me. \n\nDegree is just a piece of paper but academic settings can widen horizons of what you can access on your own in the future without having to rely on someone to feed the knowledge/information. It was very chaotic when I took a whole bunch of unrelated courses in college but they all offered me wide insights on what I could dig deeper into in the future. Did I transform as much as others that focused on one lane (eg. engineering) - then I would say no but I created my own program to gain things that would take me more than a decade to have access to. I wasn’t able to retain everything but it unlocked the ways so I can go there when I need to. \n\nIt always sucked having no time to work on my own stuff, but I saw it as a training period  of my life rather than practical period of life. \n\nMy case is slightly different than yours because I went to college straight without having much real world experience. But TLDR; I think semester or a year off would give you what you need without aborting any of the options!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060720226985050203",
    "author": "Rollmottle",
    "date": "2023-01-05",
    "content": "This Pensado's Place smells like a commercial, more than a discussion ngl...maybe that's every episode. Certainly not my bag.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1074422737516380230",
    "author": "Ross Fortune",
    "date": "2023-02-12",
    "content": "Not an answer to your question, but reminded me of a dynamic that I observed in my time assisting at major London studios:\n\nThere was a noticeable number of US clients (artists + their entourages, certain producers, and especially writers - usually in pop or hip hop) who treated assistants like “the help” / waiting staff / taxi drivers / some menial worker they felt was beneath them. The first few times it happened, it was kind of shocking, and very off-putting.\n\nOf course there are going to be bell ends from every country (and there were plenty of exceptions - I've had many incredible sessions with North American clients, and some gross sessions with UK clients too), but it happened enough to wonder whether maybe it's a cultural thing?\n\nDoes this hold water with you US folks’ experience? FWIW, I can’t imagine anyone in this Discord treating anyone like that, let alone their colleagues. And of course, my personal experience is probably weighted 80/20 UK/international.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1074442968112570409",
    "author": "Ross Fortune",
    "date": "2023-02-12",
    "content": "That’s another thing I would’ve killed for starting out. All of my Googling and Pensado’s place (!) binging only led me to a few scraps (essentially to do the opposite of what @popaganda. listed)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078130965706182678",
    "author": "ehutton21",
    "date": "2023-02-22",
    "content": "Piggy backing on a lot of the great thoughts in here and recalling my own musical education, I would say dividing the curriculum into a “listening” component and a “creating” component would be critical. In hindsight, it was incredibly formative for me that ear training practice and actual theoretical/sheet music knowledge always came alongside the practical element of sitting at keys and performing the pieces I was assigned that week.\n\nI like the idea of breaking down modern pop structure, I like the idea of covering signal flow a lot. I think you can teach and test signal flow in theory while allowing someone to practice their recording technique by mimicking the song structure of their favorite pop song. I’m not proposing that as an actual coursework suggestion (I doubt most would be ready for that week one) but just as a thought for course organization",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078664703691206798",
    "author": "owengineered",
    "date": "2023-02-24",
    "content": "Of course, I've done it myself in the past and seen other people do it enough to know when is a good time to chip in and when its better to keep it to myself.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1078805641944117328",
    "author": "ALXCPH",
    "date": "2023-02-24",
    "content": "Make a YouTube channel intentionally spreading bad advice lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1087125398288085104",
    "author": "ehutton21",
    "date": "2023-03-19",
    "content": "Honestly it was the most brilliant part of the course. So many people don’t get those kind of social experiences that are so important and teachable, for a myriad of reasons.\n\nBut literally, you’d hand in your test and to get all three points you had to initiate with confidence, firm hand, confidently say “Professor Primesburger, I’ll see you Monday” and hold it there for just a split second. It was actually somewhat brilliant.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104803654659215391",
    "author": "Nomograph Mastering",
    "date": "2023-05-07",
    "content": "Kidding of course, I think you would have a blast with it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115435807055032471",
    "author": "LAPhill",
    "date": "2023-06-05",
    "content": "Fascinating line of thinking. Of course, we’re already seeing the flip side of this from people that don’t have much, or any, social media presence. Lack of visibility causing a hit to amount of work, dating opportunities, etc.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115641765718925402",
    "author": "NoahNeedleman",
    "date": "2023-06-06",
    "content": "Just had a moment where I was going to respond to @Nomograph Mastering, but decided to read further to see if @LAPhill covered it. And of course he did. \n\nWe as music creators have to stay current on tech because we’re collaborating with people of all ages.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1128783385213554952",
    "author": "jantrit",
    "date": "2023-07-12",
    "content": "Brit living and working now in America, it feels like some of the English records that I love tend to have a bit of a more rough and ready/ ballsy sound going on. Some more aggressive choices but that’s also a huge generalisation of course. Even just thinking now to some of the earlier travis records that I love, they were mixed by tchad Blake so that goes right out the window 😆\n\nI will always milk the accent to get work 😂 only half joking",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1129613992357277786",
    "author": "shaunobi",
    "date": "2023-07-14",
    "content": "I schedule for 11 folks and I have to say… if I overbook, we made a mistake. You should know as you’re saying “yes” what it means for your schedule. But I still do it of course. Overtime is a thing if you’ve got a client you love and they’re in a bind.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1130194815246667777",
    "author": "spectrummasters",
    "date": "2023-07-16",
    "content": "@BatMeckley  I was just typing to ask what would be one major difference you’d think we would do well to bear  in mind as we move forwards and then your post above explained it . Thank you for sharing your experience it’s v illuminating . Fwiw , I think scheduling is something I’m still learning to do well but I do find the emotional diplomacy of dealing with artists perhaps the most challenging aspect of mixing , far more than the technical or creative dimensions . It seems to demand a lot of emotional intelligence imo . Not sure if others feel it that way , but at times I defo do . Anyways sorry to digress  great convo here , am enjoying muchly !",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1132343533462880296",
    "author": "Josh",
    "date": "2023-07-22",
    "content": "Every time I watch a horror movie I’m hoping those whispers are just Serj informing me about the political discourse I was too young to understand when I first listened to toxicity",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1142708466700529695",
    "author": "NoahNeedleman",
    "date": "2023-08-19",
    "content": "I was bowling with the fam and they were playing music videos from the 00s. A few real iconic moments and a few real of the time ones. Foo Fighters & Chili Peppers back to back got me thinking about it. \n\nBut the conversation is more important than any agreement of course. Enjoyed all the contributions.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1144301779085950986",
    "author": "Deleted User",
    "date": "2023-08-24",
    "content": "This can be controversial, but to execute C no matter what artist says or wants to do and present it. That way they can at least have a tangible result to compare it with. Instead of explaining, it’s better to do it and show it.\n\nMy humble take: our job is not necessarily doing what we’re told. it is to take their vision, and take it to a place where they could say “wow- I didn’t know this is what I wanted but this is what I want now”. Which I think is the taste and perspective factor. \n\nIt is case by case of course and some artists could come in with A to Z manual of what they want, which can be cool- or not. I personally find those boring, unless I really admire their vision and it just feel like an honor to be a part of it. I think being a yes man can be a quick way to become dispensable. But someone who is willing to serve by giving you some friction that can turn into some heat 🔥 can be someone they find trustworthy and interesting. It’s case by case dependent, some people need perfect aerodynamics to accelerate their vision, and I don’t think that’s necessarily being a yes man- but rather about just being the right fit for the project and being someone who is fully on board to do what they are asking. \n\nBut I think more importantly- it’s okay to miss. If they don’t like it - then scrap it or give it another go. And it’s also fine if you end up not being the one for the project",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1146120619033899139",
    "author": "CK",
    "date": "2023-08-29",
    "content": "I finally got around to watching the Castelli mixes Kaien Cruz JFTR.  That mix is an incredible lesson in so many ways.  When Castelli convinces them to try and remove the mix bus and let it breathe, it was just amazing.  The whole track came to life. I have spent so much time obsessing over my mix buss, to now just delete everything on there.  No more \"safety net\".  Time to step up.\nI have also been obsessed with the new Kimbra album.  The mixes are INSANE.  And then of course I finally look and see.....Castelli did it.  And now that I understand his current view on letting the dynamics breathe, I get why it has that sound.  At least a major factor as to why.\nWhen they described it as feeling \"dangerous\", I realized how I often use my Mix Buss to feel \"safe\".",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1182057134800769035",
    "author": "Jonathan Jetter",
    "date": "2023-12-06",
    "content": "Many records (though of course not all) have a deep, meaningful purpose. Much peripheral \"content\" doesn't (though, of course, some can). \n\nIf the content is meant to be educational....I also think effective teaching in our field is really quite difficult. Speaking from longtime personal experience on that one. There are days where I'm pretty sure I've sort of figured out how to do it (teaching, not content. I'm useless at content), and other days where trying to do it well still kicks my ass.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1191824634811777105",
    "author": "Nomograph Mastering",
    "date": "2024-01-02",
    "content": "Of course you can’t just choose and go all in on some discipline without understanding it. But I’m saying too few people take the opportunity to watch someone do their chosen curiosity at a high level - early on",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1197243001471242342",
    "author": "shaunobi",
    "date": "2024-01-17",
    "content": "In that case you’d love my basement workshop",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1203355959490256926",
    "author": "Adam Thein",
    "date": "2024-02-03",
    "content": "I’m slowly learning to appreciate the things Pro Tools excels at.  I’ve been trying a new workflow lately of printing all my mix alts in one pass by using a few stereo pairs of loopback in Totalmix and then re aligning back in ProTools.  \n\nI had a bit of an impulse purchase of a Streamdeck yesterday and I’m looking forward to digging into that with PT and RX.  Trying to channel @masteredbyjack and automate a lot of my repetitive tasks in Finder also.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1209216395523526698",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-02-19",
    "content": "Question for those of you who feel this - where are you observing this lack of nuance? Artists you work with, friends, online discourse? Young mainly, or old people as well?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1220053679500169327",
    "author": "spectrummasters",
    "date": "2024-03-20",
    "content": "I think we tend to talk a lot about creating , capturing and reproducing / articulating moments in recorded music  .  I wonder if the pursuit for perfection (as evidenced in our gulfosses and soothes etc ) and our all in one plugins and copycat tutorials …..is leading us away from the actual truth of the moments we really created and captured at the start of the creative process , and so perfection as we are striving for , is really an abstraction , a false truth",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1222273904702132375",
    "author": "SoundsLikeJoe",
    "date": "2024-03-26",
    "content": "It's the monopoly growth factor of capitalism.  Eventually they will be selling NFTs, and concert tickets, and trying to buy a video streaming service and etc... Anything to encroach on adjacent markets and hoover more cash.  Education just fits their primary consumer demographic...  school age humans listen to more music than any other age group, and they are also consuming \"courses\"  ...  natural growth into adjacent market of core demographic",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230262723757998134",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "Thesis - Tutorial girl / guy devalues your brand if the goal is to actual sell yout services and not sell tutorials for your full income",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230273637496389762",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-17",
    "content": "Yea can’t argue.\n\nAt the end of the day, I don’t care (as someone who hires people for music occasionally) if they do tutorials, the only thing that matters at all is how their work sounds, and if it consistently sounds good",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230274461538975754",
    "author": "hyanrarvey",
    "date": "2024-04-17",
    "content": "Tutorials are so hard to make fwiw but also jealous of those people who are working full time in music industry while able to make content just with them selves. The discipline is nuts",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230353479743176724",
    "author": "Ingmar Carlson",
    "date": "2024-04-17",
    "content": "If we’re being literal  there’s probably some overlap here. Plenty of legit producers out there looking at things, trying to at least stay up on new plugins, etc. But I’m not sure this is the crucial dichotomy?\n\nWhat I wonder is, within the category of “people who hire mixers/MEs,” is there any overlap between “people whose tutorials they watch” and “people they actually dream of hiring”?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1238489586553065522",
    "author": "Chase H",
    "date": "2024-05-10",
    "content": "Of course haha my bad, thank you",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1242168089425088573",
    "author": "spectrummasters",
    "date": "2024-05-20",
    "content": "I’m all good with programmed / overdubbed material but learning to mix bands properly has been a graft , and this doc ….its so throughly helpful man",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1258864905143058433",
    "author": "NoahNeedleman",
    "date": "2024-07-05",
    "content": "Unless, of course, you’re getting paid your rate.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1265625729266225164",
    "author": "SoundsLikeJoe",
    "date": "2024-07-24",
    "content": "Seriously though....  this was inspired by a pop track string/winds  arrangement.  You'd think \"well of course all the sample libraries I bought can do that just as well\"  but not imxp....  its that the sample libraries can do \"an adequate\" job and satisfythe need.  But once you hire world-class players and play it live into mics....  for me it was instantly \"we could've bought every sample library and programmed for days but never gotten this quality\" in the tiny details.  The bow sounds. The players breathing together. Their adaptation to dynamics. The aleatoric sections where advanced techniques were improvised. Samples can be amazing and do things humans can't...  but the inverse is also true.  There are many context where it's got to be live players, or else your track is just \"adequate\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1268463415249342504",
    "author": "Barbara",
    "date": "2024-08-01",
    "content": "Of course there are so many factors that do influence what's actually happening during the back and forth with clients (in mixing, at least, but I believe this to be true in every stage of the process) that it might be easier to just fall into this rabbit hole of \"how could I be wrong doing MY job and someone who is not doing my job is telling me to do it in a different way / is not absolutely amazed by how incredibly cool this snare sounds?!?\". But again, ego, ego, ego.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1272243170310361150",
    "author": "Barbara",
    "date": "2024-08-11",
    "content": "Of course! If you come up north, let me know!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1287530266230915163",
    "author": "Will Pragnell",
    "date": "2024-09-22",
    "content": "I have not! It's been on my reading list for literally years but I've never quite gotten to it. Will bump it closer to the top!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1297906997131481179",
    "author": "Iwan Morgan",
    "date": "2024-10-21",
    "content": "If you are on a mac there is definitely a way to use the ipad asa second screen built into macos and just park your meters on it. I don’t use it but the app Decibel, which comes with Puremix is designed to be used this way I think?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1300225056403623977",
    "author": "Nomograph Mastering",
    "date": "2024-10-27",
    "content": "(of course this is completely separate to the intrinsic value of learning and growth, but the post did say \"mostly for the pay bump\")",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1300230363905523808",
    "author": "peterlabberton",
    "date": "2024-10-27",
    "content": "Hey Annie! Just one more thought (of course in NO WAY directed at you as I don’t know you!): my girlfriend has often complained about how the music and art teachers she has often aren’t great *teachers*—they are musicians and artists who also teach. So I’d think if I put myself in her shoes as the person potentially hiring a music teacher, again maybe seeing an education degree as opposed to a straight up music degree might give a leg up in the school environment.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1319411577526419497",
    "author": "Will Pragnell",
    "date": "2024-12-19",
    "content": "some other software companies / small manufacturers i care about have nice little discourse instances that double as community run knowledge bases. i dig that model, feels like it might be a good fit for Samply maybe?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1329474154860253358",
    "author": "markmaclure",
    "date": "2025-01-16",
    "content": "And yes the actual answer to these questions is of course “it depends”\n\nI would say my main strength as a producer is inspiring artists and and executing on their visions. I’m good at being  a chameleon. Lately though, with some of my more close clients I’ve been pushing back a little more with some good results. I agree it needs to be the right relationship. The more familiar and comfortable the artist the more I can challenge them in a good way",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1334666140651360346",
    "author": "Slow Hand",
    "date": "2025-01-30",
    "content": "Been watching this all day. Dann seems to have such good character about everything. It's inspiring to see him play with so much care and attention to feel.\n\nI loved hearing him talk about Mutt Lange's approach and how patient Mutt was with every part. Making the players play again and again while waiting for the right confluence of feel to come together before moving on. There's so much care for the moment. That pace is antithetical to the way things are often done today. Understandably so.\n\nOf course, Dann also expresses the feelings of doubt that anyone would go through in his position; wondering what it was about him that wasn't good enough for the take. So I think it's good that Mutt was up-front with the players about how they were going to approach it, which could allow the players to stop thinking about their abilities and sink into the right headspace for such a long endeavor as Mutt explored.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1339640963592884234",
    "author": "NoahNeedleman",
    "date": "2025-02-13",
    "content": "Sing for real, practice the part a lot. \n\nNo matter how detailed you get in the recording, singing is always a moment to moment performance. So locking in exact timing for onset, releases, breaths, little runs which change your mouth shape, etc…  to do it convincingly is, like I said, nigh impossible. \n\nBut one of the things to make it more or less believable is to have the mic in the same general place in the video as you do the recording. A close mic’s performance and a wide angle video is easier to disbelieve \n\nAnd of course in a music video nobody actually expects that kind of perfection so it’s more about the visual energy.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1343249684411453490",
    "author": "Edward Rivera",
    "date": "2025-02-23",
    "content": "If you wanna know more, sign up for my free newsletter and buy my course",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1344365702085349436",
    "author": "Chase H",
    "date": "2025-02-26",
    "content": "Words obviously depend on context and intent but in philosophy the definition of  “Agency” is just the ability to deliberate and make different decisions to influence things based on your will.\n\nIf that’s the definition used in the OG post I think it’s pretty on point. Agency would of course intermingle with intelligence because what you deliberate choosing to do and whether those things are wise or not would depend on your intelligence.\nI don’t think more agency has any direct implication of selfishness or selflessness",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1346547172576858302",
    "author": "bobby k",
    "date": "2025-03-04",
    "content": "Anybody ever get an email from a guy at mix with the masters inviting you to one of their events in France? Just got invited out of the blue to rich costey’s masterclass..I’m like - I’m so down, yall paying though? 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1384528872825032714",
    "author": "Erdinç",
    "date": "2025-06-17",
    "content": "Hi everyone!\nI'm a musician trying to learn production and mixing by myself. Promoting our own music is not allowed on this channel, but I'd love to get your feedback to improve myself. Is there a section to do this?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407829176521719809",
    "author": "shaunobi",
    "date": "2025-08-20",
    "content": "Anyhow, I know engineers get your gigs through discogs, but the offer stands: if anyone thinks someone will find them through ChatGPT or Gemini or whatever, hit me up and I’ll show you what I’m doing. Totally free of course, just a thank you to the community for all I’ve learned here. \n\nNote that it’s usually much easier to do if you’re an established brand. Though “mid-visible” is a sweet spot tbh since you’ve already got a brand to pump, but you don’t already dominate the online AI search convo.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407990174268526592",
    "author": "Iwan Morgan",
    "date": "2025-08-21",
    "content": "Charles Dye hyped it a lot in his ITB mixing course around 2004. When I go back to what I was doing then I can hear how unabashed I was pushing DUY’s DAD Valve, and their Maximiser Max DUY had a cool sound. Nothing that can’t be done these days but for pure nostalgia it would be cool to use it again.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1425935993898533097",
    "author": "Rob Domos",
    "date": "2025-10-09",
    "content": "Wt have recently stated that they’ve course corrected on IP. How long that continues to be the case or how earnest it is is free to question but per their most recent statements it seems like a non issue now",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1433672589271633961",
    "author": "Slow Hand",
    "date": "2025-10-30",
    "content": "I can understand the trepidation here. Now that Canva own Affinity, it's not yet clear what their strategy is. My guess is that there are a few reasons for this play:\n\n1. Affinity Studio is now a loss leader for Canva's other offerings, like their (just announced) supplemental AI tool set or their enterprise plans, which I suspect are a big portion of their income compared to their Affinity suite licenses.\n\n2. It eats into Adobe's market share. Making a very competitive alternative to Adobe's flagship software and then offering it for free encourages adoption by users who are ready to jump ship from their Adobe subscriptions or who need software like this and are fine without Adobe's cutting-edge tools (like me).\n\nThere are some positive examples of high-level *free* software that is continues to thrive with no sign of being abandoned, or compromised. Like DaVinci Resolve or Reaper (which is effectively free). There are also some great examples of open source software getting a new lease on life by their steward companies. Namely Musescore and Audacity's recent revamps. \n\nNow Affinity isn't open source, but Musegroup have a large full-time development team that seem to be getting by just fine developing what is effectively free software. If they can do it, then Affinity likely can.\n\nHere's hoping Canva have done the math right before setting out on this course.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1436146904860987523",
    "author": "Will Trotman",
    "date": "2025-11-06",
    "content": "So cool. Also dope that y’all had a hand in such a special project (but not a shock of course). I knew the LUFs felt just right 😈. Just gets me excited to see artists keep coming in ways we don’t expect.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "806968356863082497",
    "author": "dimiterganchev",
    "date": "2021-02-04",
    "content": "Dude is spectacular. I was at his mix with the masters seminar back 2014 - and we opened a sessionfrom one of the guys and he turned it to a SMASH in 30min",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "807059395422715925",
    "author": "hendrick",
    "date": "2021-02-04",
    "content": "it was nice to get back to them for a bit for this course",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "811672169788604476",
    "author": "Zakhiggins",
    "date": "2021-02-17",
    "content": "I'm about to dive in to Eric Valentines Youtube channel, any suggestions on what's a good epidode?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "811839416682676294",
    "author": "rae",
    "date": "2021-02-17",
    "content": "Haven’t tried tidal but I only use streaming (Spotify) for when I’m out and about. I buy CDs and Vinyl records which of course have album credits and imo better sound quality than streaming  from a $50 pair of Apple earbuds and I can always just plug my headphones into my turntable or CD player to really dig into a track. I don’t know too much about tidal except for that it’s better payment rates for those involved in the tracks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "812149742091370506",
    "author": "Slow Hand",
    "date": "2021-02-18",
    "content": "Anyone ever built monitor stands from stacking cinder blocks? I just purchased a bunch from the hardware store down the street. The problem I’m now facing is that the blocks are too rough and the cumulative wobble from four of them stacked on top of each other is significant. Of course, wobble is what I *dont* want.\n\nHas anyone been down this road before and come up with a satisfactory solution to mitigate wobble?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "820720949929705492",
    "author": "chris_donlin",
    "date": "2021-03-14",
    "content": "It’s basically a website where anyone can post a service they need, be it production, mixing, mastering, male/female vocal, guitarist, etc. People like us, would be able to offer those services. But of course everyone’s rates are different so that’s often a determining factor for people looking to work with you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "822590428305162240",
    "author": "peterlabberton",
    "date": "2021-03-19",
    "content": "110% if it sounds good it is good! Just curious if there are better ways as technology/how people listen/etc continues to change! Also of course curious to hear how others are approaching this.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "827262912745701386",
    "author": "Dodgy",
    "date": "2021-04-01",
    "content": "Totally, ive been 100% making music artist mode with close to no technical understanding so I'm trying to crash course since i really feel like I have a chance to reach a small audience",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "829239631970697228",
    "author": "oaklandmatt",
    "date": "2021-04-06",
    "content": "(that setup with the screen is my studio here in LA only of course, i don't travel like that)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "829363002682769430",
    "author": "Zakhiggins",
    "date": "2021-04-07",
    "content": "On the topic of finding mix/mastering engineers, how do you guys go about finding one and building a relationship/sound with one?\nI consider myself mostly a producer/musician by default but I find myself mixing and mastering 90% of the stuff I produce, mostly because I haven't found a mixer yet that I like who I can actually afford.\nOf course there are some unbelievable mixers out there but sometimes I'm just not sure it's worth the investment vs what I can do myself for free.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "837769116651618409",
    "author": "Slow Hand",
    "date": "2021-04-30",
    "content": "Not to rag on Waves too bad, but has anybody noticed how they've perpetually been \"On Sale\" for the last 13 months? It's makes me chuckle every time I stop by their website and they're promoting a \"rare low price\" or a \"limited offer\" when in reality they're just shining the spotlight on a different group of plugins whose prices haven't changed. Of course this is sales psychology 101, but the duration that they've been keeping this strategy up makes me laugh.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "838232512975208498",
    "author": "Josh",
    "date": "2021-05-01",
    "content": "Is anyone else in here taking the Louis Bell monthly course?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "839169557108621373",
    "author": "i am willie",
    "date": "2021-05-04",
    "content": "gonna still be doing music and stuff of course",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "843631627925454889",
    "author": "Deleted User",
    "date": "2021-05-16",
    "content": "Any recommended youtube channels for learning handy skills? I never really got to learn handy skills growing up so I’m looking for something structured that starts from the fundamentals.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "847136855149379625",
    "author": "Rollmottle",
    "date": "2021-05-26",
    "content": "The way I look at is that there are too many variables to try and control for and I try not to boil the ocean. I deliver the files. Playback and referencing is up to you. I look at metadata the same way. DSP's usually strip all that stuff out and/or overwrite it with their own set of data so ultimately it's up to the client or their label to manage all that. Many times I'm working with working song titles anyway. When asked, I'll do it differently of course, but 99% of the time it's fine.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "853084550473449502",
    "author": "David Fuller",
    "date": "2021-06-11",
    "content": "This has been over the course of the album I'm mixing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "855095725541163058",
    "author": "ALXCPH",
    "date": "2021-06-17",
    "content": "Is it wide? Haven’t noticed. Only heard it in my car so far a few times. I wonder if it’s just the upper bass or also the subs. Guess I’ll have to analyse it when I get back into the studio! I actually remember Pensado talking about widening subs on a parallel track just slightly for some size. Guess I’ll have to try it right 😇  but I’m really not into the clap thing. And it doesn’t really sound intentional. I don’t understand why you wouldn’t want transients on the backbeat in a hip hop context. Doesn’t sound intentional but I also wonder how it would have been missed. So maby it is and my taste just doesn’t align 🐸",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "859856844368904204",
    "author": "oaklandmatt",
    "date": "2021-06-30",
    "content": "@peterlabberton i don't know that this is true about lumbar support. the article you sent seems to say that people need lumbar support because they have weak back muscles and then compensate by hunching. i've read/ heard/ felt that having strong back muscles and having a backless chair is great if you have adequate strength. this is why people talk about exercise balls being so great.\n\nperhaps the key is getting your core/ posterior chain strong? there are tons of ways to do this but i love kettlebell swings myself. \n\ni use a drum throne now rather than the herman miller. a solid workout routine and stretching, combined with drum throne has reduced my back and neck pain tremendously.\n\nof course i don't know what of that is chair, posture, strength, flexibility, and mindfulness... and i'm definitely not a doctor!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "861955713408303125",
    "author": "chadwahlbrink",
    "date": "2021-07-06",
    "content": "> “Dorothea Lange, the Depression-era American photojournalist, used to say that a camera is a tool for learning to see without a camera. Well, a recorder is a tool for learning to listen without a recorder.”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "863198703916679188",
    "author": "oaklandmatt",
    "date": "2021-07-09",
    "content": "love or money? love, of course",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "876654272530501632",
    "author": "Josh",
    "date": "2021-08-15",
    "content": "Tryna do a hyperpop cover of Tommy Lee to get caverin some traction and I’m doing post’s verse and I was already bad at pronouncing words legibly in my songs and I feel like I just took a course on how to be the world’s most unintelligible singer of all time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "879897377840984105",
    "author": "hendrick",
    "date": "2021-08-24",
    "content": "I talked a lot about this stuff with my teacher jonathan wyner who is an OG mastering engineer so it's not only coming from me. he also gets into this conversation on his episode on pensados place for those who wanna get some of his insight on things",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "906888871004995604",
    "author": "hendrick",
    "date": "2021-11-07",
    "content": "it’s her berklee online course!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "907742901679833119",
    "author": "oaklandmatt",
    "date": "2021-11-09",
    "content": "I had no idea Jon would bring up the topic of doing a masterclass or event type thing and we'd talk about it for 40 minutes 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "917667105090986024",
    "author": "absflores",
    "date": "2021-12-06",
    "content": "So I have a client that expects his record to sound great, when the vocals were recorded poorly. He suggests that the mix should go in this 2005 song reference direction that actually is sonically harsh. I mean part of me is willing to respect the vision of their record of course, but like it 2021 and records have to compete right? How do you negotiate a compromise between what you do and what their unrealistic expectations are? Maybe I’m reading the situation wrong?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "926953232574603294",
    "author": "Slow Hand",
    "date": "2022-01-01",
    "content": "I would limit the scope of disciplines that I was involved in (performing, engineering, producing, arranging, etc). Pick a road and stick with it and establish myself in one domain before branching off into more than I can reasonably develop. Have one strong skill that I can build a career off of and leverage that.\n\nOf course the hard part is knowing which road is the one for you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "933903559840391248",
    "author": "oaklandmatt",
    "date": "2022-01-20",
    "content": "That introductory article about GPT3 really fucked me up at the end when, of course, it is revealed that the article was written by GPT3",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "935472272347631627",
    "author": "Georgios",
    "date": "2022-01-25",
    "content": "Hello guys! I need some guidance. Same as a musician would practice scales as an everyday routine, what are you doing everyday to become a better engineer, especially in the recording aspect? Of course I mean, while you are not actually recording. Something you do maybe everyday at home. All I can think of is to really practice the key commands.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "944711938460487711",
    "author": "Maxim",
    "date": "2022-02-19",
    "content": "I run at least 6 Acustica plugins a session (usually because I have the same plugin chain for vocals but I duplicate them for each section). Ruby, El Rey & sometimes I’ll enable Pensado EQ & Gainstation on Drums.\n\nAlso for some reason Low End focus from Ozone 9 is a CPU monster.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "946083816294998076",
    "author": "samvalentine",
    "date": "2022-02-23",
    "content": "I used one a few weeks ago. It's pretty cool! Does an awesome job of splitting a song into stems - much better than I thought it would. There's definitely a bit of a learning curve to get nice with it. But I feel like you could run a whole DJ set off of it once you get the hang of it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "955559843186475030",
    "author": "louisvie",
    "date": "2022-03-21",
    "content": "who wants to share a Mix with the Masters subscription ? Or anybody has a login they would infinitely kindly share ? xoxo",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "979589557316100096",
    "author": "Slow Hand",
    "date": "2022-05-26",
    "content": "If we're talking home recording setups then I suppose a Renter's Insurance policy would be a good (and relatively affordable) safety net in the event of some manner of theft or damage to the home.\n\nOf course, that's not a preventative measure. It's only a way to make a bad moment sting less.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "992835708026884276",
    "author": "oaklandmatt",
    "date": "2022-07-02",
    "content": "if @Jodonny @1ggy wanna set it up i'm down. ill start it with a loop or something and we can pass it around. i kinda feel like we should just add one track at a time and let it just take its course. but whatever parameters y'all want is good with me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "998602342091980800",
    "author": "NoahNeedleman",
    "date": "2022-07-18",
    "content": "😑 of course. Was still funny.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1002485215660355634",
    "author": "Slow Hand",
    "date": "2022-07-29",
    "content": "Does anyone have a recommendation for a good Youtube channel that goes in depth on piano technique? I'm mostly self-taught on piano and I'd like to find someone who really breaks down the finer point of technique so that I can refine my playing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1002717002315595777",
    "author": "ehutton21",
    "date": "2022-07-29",
    "content": "I don’t know about his videos as it pertains to specific technique tutorials, I’d be happy to vet more people once im off the clock, but this guy popped up enough times in my page and seemed fairly solid in terms of jazz piano knowledge.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1004947744798023700",
    "author": "NoahNeedleman",
    "date": "2022-08-04",
    "content": "Had a songwriter buddy ask me if he should get the full UAD suite for $1100 with his new Apollo today. He’s new to production and just wants to make his own demos,  so I told him “of course not. You only need like 5 plugins all in to make demos sound good…” \nThen I started thinking, if that’s true- what are the 5?\n\nOk My Friends:\nYou only get 5 plug-ins to make your shit sound awesome. WHAT ARE THEY?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1004957299124748318",
    "author": "NoahNeedleman",
    "date": "2022-08-04",
    "content": "The Culture Vulture is a strong choice. I of course love the RMX and use the Galaxy allllll the time. I also like the philosophy of creative fx and using stock for the stock necessities.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1007411273354453003",
    "author": "shamash",
    "date": "2022-08-11",
    "content": "U got a link for a good hackintosh tutorial?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1016066066289541224",
    "author": "Jeremy Klein",
    "date": "2022-09-04",
    "content": "The one point on a mix... whats the end goal here? Is the hope that you win the lottery and the song goes number 1 and you get 10k(?), 100k(?) from it? Or is it that over the course of 10 years of mixing you stack up enough points that its a sizable amount of passive income?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1023577164525883412",
    "author": "Iwan Morgan",
    "date": "2022-09-25",
    "content": "Has anyone subscribed to Puremix? I don’t really want another subscription but am really intrigued by the new Michael Brauer series detailing his ITB setup - 4 hours long.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1023982423840673803",
    "author": "BillyC",
    "date": "2022-09-26",
    "content": "Of course not, I’m just laughing at the absurdity of someone who makes music having a stroke attempting to relate to a show about music. Of course the show itself is a cheese fest, but American Idol is only McDonalds in the context of Ryan Seacrest. I can enjoy watching truly amazing singers do their thing literally anywhere. And @cian riordan you’re doing it wrong if you’re not making a McGangbang",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1027557741608312832",
    "author": "mixedbywong_my",
    "date": "2022-10-06",
    "content": "I use something similar made by the ppl at Puremix , it’s called mixup.audio. Streams the mixes and clients can leave comments and notes on diff timecodes of the mixes . Great for tracking the mix notes . \nNot great is when the band wants to comment and 5 different people giving 5 totally different notes. Every individual wants their part louder . 🤷🏻‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1033914175673606194",
    "author": "Will Melones",
    "date": "2022-10-23",
    "content": "Of course. Lex seems to really hit his stride with challenging his arguments too, which is always exciting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1034296095578275841",
    "author": "Slow Hand",
    "date": "2022-10-24",
    "content": "It all started for me when I saw how blind people use computers by having the contents of every screen read to them. Of course that's tedious as hell, so they crank up the playback speed of the speech synthesizer to ludicrous speeds (4x).\n\nI saw this and said \"Hey, if they can do that so can I.\"\n\nJump to 0:40 for an example of the playback:\nhttps://youtube.com/shorts/wdFG-UXDmX4?feature=share",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1034296968366796859",
    "author": "Slow Hand",
    "date": "2022-10-24",
    "content": "Of course I'll slow down on difficult topics when I feel my comprehension is taking a hit. But some videos are so redundant and poorly scripted that you've just got to blow through all of the dead air and pauses.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1044619744021590127",
    "author": "ALXCPH",
    "date": "2022-11-22",
    "content": "I'm sorry to hear that, Ryan. To the extent of how unavoidable experiencing death close to you is, and how little you can do about it, fucking sucks. Having lost someone myself, i can tell you there are no, good advice or anything people can tell you to make it better. Only thing that helps you live with the reality is time, and not removing yourself from the sadness or thoughts that comes from the situation. Feel your feelings, let them take their course, so you can get through the different feelings and eventually be able to feel different feelings.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058303872466173952",
    "author": "Nomograph Mastering",
    "date": "2022-12-30",
    "content": "Masterclasses every day",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1061594805970423928",
    "author": "Ross Fortune",
    "date": "2023-01-08",
    "content": "**Keyboard players (and songwriters) of LWMR:** I need to seriously up my keyboard chops this year. \n\nI’ve been keyboard catting my way through life up to now - mashing out left hand root notes and RH triad shapes to get the rhythm and feel down, then fixing the notes / adding removing midi.  Fine by myself, but infuriating for anyone else in the room. \n \nI’m going to be in some (mostly writing) situations where that’s not going to cut it - I need to be much more fluent.\n\nWhat are some efficient ways to get there? I’ve tried putting myself through the school of YouTube, but I haven’t found a course prescriptive enough to keep me focused and on track - just loads of disparate technique tutorials, and I don’t know what order to take them in. Also took some lessons, but cost and scheduling were unsustainable.\n\nIf it helps, my theory and reading were at one point strong and can probably be dredged back up if needed.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063175430191980696",
    "author": "georget113",
    "date": "2023-01-12",
    "content": "He would do like actually tutorials",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1063176390272364556",
    "author": "hyanrarvey",
    "date": "2023-01-12",
    "content": "I never made youtube tutorials because who the fuck am i lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063199314324770866",
    "author": "Deleted User",
    "date": "2023-01-12",
    "content": "Does MO have a down payment assistance program? My uncle bought a house from down payment assistance program (MassDream) and basically paid no money out of pocket for down payment. Of course he has to pay it back, but might be something worth keeping tabs on. Some of these programs only run for limited amount of time and goes out quickly",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1063948396722913340",
    "author": "Zakhiggins",
    "date": "2023-01-14",
    "content": "Well yeah of course, and that is what I do, but this convo is just exploring other possibilities of if we can have the best of both worlds.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1064376640689405952",
    "author": "Gerhard Westphalen",
    "date": "2023-01-15",
    "content": "When I was trying to learn acoustics and struggling I found out the concepts I needed to learn are only taught in quantum mechanics courses at which point I gave up. Explains why I understood none of it…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1064604407859269733",
    "author": "popaganda.",
    "date": "2023-01-16",
    "content": "I’m gonna dip from this convo and get on with my day but I want to make the point that undeniable doesn’t have to be this rare thing…it’s a big tent. And I think the common denominator is like potency, presence, honesty. So of course slayer belongs, of course Paramore belongs. Of course Drake belongs, maybe in a different way than the others. But it’s not a “what do I like” convo. It’s about what’s “potent”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1067877348483010730",
    "author": "Adam Thein",
    "date": "2023-01-25",
    "content": "Dave Pensado is thirsty for the plugins",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069764940673601606",
    "author": "austenballard",
    "date": "2023-01-30",
    "content": "Yeah, that would be interesting to know. My intuition says, \"He's Kendrick, of course he did\" but then that is a kind of surprisingly low number on publishing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1071132218442920076",
    "author": "popaganda.",
    "date": "2023-02-03",
    "content": "Didn’t mean to come across so negative, mostly it just seems like there’s no discourse, mostly unanswered questions",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1071229054251962459",
    "author": "ehutton21",
    "date": "2023-02-03",
    "content": "Hate the learning curve rn",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1071886087787663481",
    "author": "spectrummasters",
    "date": "2023-02-05",
    "content": "@oaklandmatt @BatMeckley ..thank you both for offering some perspective on it. I really appreciate it. To your point @BatMeckley , for where im at in my humble level of the hierarchy, the demo-itis thing has been a real handicap already with regard to what i wanted for a mix/production (its usually mostly with reverb on the vocals for me....I want it drier they want it soaked )  but then i watched Bainz on your live matt , post the Punk album release and he looked like he had PTSD for demoitis , so i figured its par for the course. Overall, i love recording so its not a chore, but sometimes it seems like the artist is getting in their own (and my \"producers's) way)   and  so again, I really appreciate you both sharing your strategies for handling these moments.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1076445138429169724",
    "author": "Nomograph Mastering",
    "date": "2023-02-18",
    "content": "I’m very uncomfortable with this description. But of course Yoda would be too",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1077824367783858176",
    "author": "Slow Hand",
    "date": "2023-02-21",
    "content": "Of course. Gotta deep fry that sincerity in irreverence.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078069162745802824",
    "author": "austenballard",
    "date": "2023-02-22",
    "content": "The listening approach is good. The course we were advising on had being in orchestra/band/choir as a prereq so these kids were already pretty musically aware, but if we're talking students starting from scratch, what you described AND some music fundamentals will be key.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078654693967925368",
    "author": "owengineered",
    "date": "2023-02-24",
    "content": "Hey, does anyone have any resources to recommend to train singing technique ? I'm interested as a recording/mixing engineer rather than as an artist, I'd like to be able to give melody ideas to artists and sometimes add backing vocals. Are there any good youtube channels / books / exercises to train every day with you guys know of ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1078659844464193686",
    "author": "ALXCPH",
    "date": "2023-02-24",
    "content": "at your level i wouldnt worry about singing teachers. What i would worry about is connecting your vocal chords to your ears and brain. technique and breathing isn't something to worry about just yet. A teacher/mentor can be great for guidance. But they can be expensive. A few lessons could def put you in a direction. I would start with ear training learning to hear melodies. Usually when people are unable to hit a note it has less to do with technique and more to do with their ability to decern pitch and notes. \n\nStarting out is always tough, but start by singing everyday, sing along to your favourite songs. also try and pull up a piano and press a key and then sing the note, then press another key and sing that note, this will teach you to actively target notes with your voice/ears. Learn to sing simple songs on your own without any backing tracks or music. Nursery rhymes are great, they are simple and a lot of people have them internalised. When you get some more confidance, try and have a static chord or note, and sing different notes on top of it and see how the different notes feel / sound and really internalise that.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078660507931787324",
    "author": "ALXCPH",
    "date": "2023-02-24",
    "content": "if you learn piano at the same time as learning to sing it could help you visualise some of what your are learning(if you are a visual learner) and youll still be training your ears and pitch understanding and musicality",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078804343270146149",
    "author": "ALXCPH",
    "date": "2023-02-24",
    "content": "It’s learning to speak, it’s not really learning knowledge per se",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1081055391888183358",
    "author": "ehutton21",
    "date": "2023-03-02",
    "content": "Slate vs UAD spark is interesting because UAD just unveiled like a ton of new native products available for perpetual licensing that is separate from the spark subscription (the perpetual line costs $350, IIRC) from what I saw. Both the native and UAD spark subscription remove the console element, so it shouldn’t be a massive CPU weight but I’m not exactly loading it up every track. \n\nI don’t have many complaints about UAD spark’s CPU, esp compared to Slate, but maybe that’s me. I think some of this discourse depends on how extensively or intensively do you use slate",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1082402930029760532",
    "author": "hyanrarvey",
    "date": "2023-03-06",
    "content": "The super super wide dave pensado shelf trick is great for that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1082759284753961003",
    "author": "cian riordan",
    "date": "2023-03-07",
    "content": "Insight gives you A LOT of visual information that isn't really useful unless you know what you're looking for. I have two visual meters while I mix... a janky old Goldline RTA analyzer and a TC Electronics Clarity. The RTA is useful for quick visual cues of kick to snare balance, how subby something really is, or when I'm working out phase relationships between drum mics... I can quickly glance to help aid with decision making. It's not necessary for me to mix, but I've had it for 15 years and it helps me make certain technical decisions quicker. The Clarity is very useful for the loudness radar. I basically set a guide LUFS (in my case, I'm usually shooting for -9) and you get a great visual representation of where you're at over the course of the song. Its especially useful to avoid fader creep... where I might nail the dynamics and loudness in the earlier parts of the song, but might overlook the last chorus being significantly louder, and in some cases, more squashed than it needs to be. I'm also an LCR panning guy, and it has a 'balance-o-meter' feature that has a cool weighted algorithm for determining if your mix is leaning left or right.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1086751569703354378",
    "author": "Slow Hand",
    "date": "2023-03-18",
    "content": "Yeah. These AI's are definitely *not* thinking and I think we'll hit the limit of what machine-learning tools are capable of talking about. They're good at mimicking existing things, but they don't do anything at all approximating cause and effect, self-reflection, or abstract thought. \n\nI get the impression that this model is fundamentally flawed and unable to be a true general intelligence. Which I'm happy about. Cause that would be a whole other can of worms to worry over.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1087125496967462953",
    "author": "ehutton21",
    "date": "2023-03-19",
    "content": "That course and the job interview extra curricular course are the most useful things I ever took in college",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1090124966395117568",
    "author": "ehutton21",
    "date": "2023-03-27",
    "content": "I’m real close to the university system in both age and in terms of the people I collaborate with and I have friends who are still pursuing additional degrees, and the AI discourse within universities is a bit wide-sweeping. There’s way too much nuance to consider across so many disciplines to objectively state that AI is going to influence academic performance in a performing arts degree the same way it would influence or aid a literary studies degree or the same way it would aid or undermine a finance degree or even a science/engineering degree.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1090753416365613278",
    "author": "LAPhill",
    "date": "2023-03-29",
    "content": "I'm still formulating my thoughts, but my initial impression was that it felt more lifeless than I expected. Watching it spit out words one by one, felt like I was having a conversation with a dial up modem. Really, it felt like a more intuitive search engine, and less like it was feeding me anything I couldn't attain in other ways (through more effort).\n\nI asked it some questions about where to find information about programming languages and it turned up some helpful resources. I spent awhile asking it to code some things for me and it did so impressively, while leaving bits in the code that explained what it was doing. I can see that being massively useful for bug-hunting, but also as a learning tool. I was fascinated when I asked it to code me a GUI for this fake program and it complied. But when I asked it to show me what that would actually look like, it linked to an IMGUR image that didn't exist.\n\nIf I walked away with one feeling, it was curiosity, instead of anything negative.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1094344275489210489",
    "author": "spectrummasters",
    "date": "2023-04-08",
    "content": "As well of course , as the folk traditions of the European migrants",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1095846078366105712",
    "author": "gagsmile",
    "date": "2023-04-12",
    "content": "im half joking of course but its just so bizarre to me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1098657777523621968",
    "author": "spectrummasters",
    "date": "2023-04-20",
    "content": "For anyone who is just generally obsessed with all things music here (everyone ?) …..just watched this and found it v good for a half hour entertainment . Imo a real pleasure to listen to some really cool original songwriting and the fun of listening to a songwriting vet articulating precisely and immediately the unlocked potential he is hearing in a song . I’m not buying his course but defo digging his ability to discuss a song . https://youtu.be/0ciQMa-F_8c",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1100488021020786768",
    "author": "Adam Thein",
    "date": "2023-04-25",
    "content": "Logic and Ableton both have IR Makers with built in sweep/capture tools, really easy to use.  Hainbach has a good YT tutorial on the Ableton version.  I think you can select your sweep time.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101946416672297061",
    "author": "Nomograph Mastering",
    "date": "2023-04-29",
    "content": "And this doozy - *\"Of course, we must acknowledge that it's a massive privilege to have the means to create multichannel music\"*",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104460493848068116",
    "author": "youngteam",
    "date": "2023-05-06",
    "content": "meme making tutorial when?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1104734351259873330",
    "author": "spectrummasters",
    "date": "2023-05-07",
    "content": "Any other electricians in here? ive been discussing at work about harmonics in electrical circuits (caused by inductive loads usually) and how these are bad in electrical circuits.....but have become fascinated by the fact that harmonics in electrical circuits behave / form just as those in music (doubles of the fundamental frequency) . We obviously use transformers in electrical science and in analogue music and we talk about phase shift in both electrical science and audio engineering. I was speaking with my firm's supervisor about all this and the common terminology and he was pointing out that as audio engineers we use all the same terms because of course, audio engineering was founded from electrical engineering . What im very curious about is that in analogue circuits we transform sound pressure levels into electrcial circuits and voltages....which then become affected by these electrcial phenomena ......that often create pleasing artefacts once reconverted back to sound waves at the speaker (via overloading voltages and transformers and valves )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1108847366473252996",
    "author": "Slow Hand",
    "date": "2023-05-18",
    "content": "Maybe just shoot me a DM or pick up the convo in #📚book-talk so that we don't steer the greater convo too far off course.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1110953678489268365",
    "author": "masteredbyjack",
    "date": "2023-05-24",
    "content": "Looking into this on my end...but texts.com seems maybe really good for this. All messages in one place and you can pin things to the top of the board (it sorta operates like iMessage)...including email. Maybe a big lift to integrate, but I'm doing so much stuff over text/DM/whatsapp that I really would love everything in a single window (including email) that I could label and pin and track over the course of projects\n\nImagine all current projects pinned to the top, categorized, etc. and can reply to everything from one window and arrange the most important stuff at the top. And you avoid the issue of having to have anyone use some other form of communication than they already are (signing up for something, etc)\n\nNot as great as I'm making it seem probably. But on my end it would be a big improvement. Stupidly you need another user to invite you at the moment\n\nDiscord idea for Nomograph very interesting as well!\n\nUPDATE: Apparently you can get a free trial now if you sign up to pay after its over (can cancel during the 30 days). Will report back!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1111747918945341450",
    "author": "Slow Hand",
    "date": "2023-05-26",
    "content": "I should clarify that this will most likely be a very simple one-off screen capture. \n\nI looked into OBS and it seems like it's got a lot of setup and configuration that needs to be completed as well as a steep learning curve. So it's not ideal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1112843546190413916",
    "author": "Nomograph Mastering",
    "date": "2023-05-29",
    "content": "The level of discourse online is lacking",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115781064506482789",
    "author": "Edward Rivera",
    "date": "2023-06-06",
    "content": "My guess is that there is already a system of redundancy built into the work drive. For example, my project folders always have the folder of multitracks I was sent, despite being copied in the PT audio files folder. And of course the several incremental PT session files. So all that just gets cloned",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119717832859590746",
    "author": "shaunobi",
    "date": "2023-06-17",
    "content": "I mean it’s based on MOTH WINGS of course it will",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1120205770626187396",
    "author": "Deleted User",
    "date": "2023-06-18",
    "content": "Of course not, but I think being aligned is a pretty great goal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1121153589298073640",
    "author": "peterlabberton",
    "date": "2023-06-21",
    "content": "Totally agree, projects and bands and collaborations run their course. This, to be frank, seems like a pretty weak reason to bail, though.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124997764837814272",
    "author": "spectrummasters",
    "date": "2023-07-02",
    "content": "Im personally aware (my partner is a copyright lawyer at one of the uk's biggest music firms) how much take home pay the suits in music are getting. Ive not yet heard of any studio personnel picking up these amounts that are par for the course for tose on the business side...(not to mention the benefits) . They’wouldn’t get out of bed for anywhere near the pay or the benefits (lack of ) that the engineers who facilitate their industry do .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1125013438402400256",
    "author": "Maxim",
    "date": "2023-07-02",
    "content": "I felt more underpaid managing artists and working on the business side of things than whatever production/mixing work I do now (some projects can of course also be long winded).",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125124781092655224",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "of course! But I’m talking more about the structural unsustainability or unsustainable profit model. \n\nFilm industry is probably also unsustainable but maybe not as much or maybe worse. I don’t know lol 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125127620674212012",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "how our clients come up with money to pay us is important in order to stay sustainable. because we’re technically in a business of helping another business (artists or labels) make money. \n\nhuge part of our values are tied to our ability to make them money. so of course it matters. \n\nAnd our ability to make them money isn’t directly parallel to how good we are at what we do. If they made money, it’s probably because everyone in the team nailed it. But if it’s not making money- that’s not because we sucked at our job. \n\nWhich is why I started getting more involved in artist branding, I wish I could offer enough insights in building a fan base and marketing side of things. Because then I can really be more in control of the situation. \n\nbut even then- there’s not enough money in the market. there’s a long and steep valley of despair between climbing from bottom to top. I do think if there was more money in the pool, the valley of despair wouldn’t be that bad. and in order to pull more money in, crowdfunding could be one of the ways. I wish I can come up with more solutions…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125132824698171513",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "of course. but the thing is those that have brand on IG are charging $100 a mix",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125136299934896289",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "I might be biased as a producer but there’s also not much value put into this kind of relationship as much anymore. Or more so the expectation of what the job entails is in smaller scope. Expectations of what producers do these days are often arrangers with computer skills that can make things sound good. \n\nAnd I think a lot of music nowadays don’t really hit you in the heart for that reason…\n\nOf course this is still how people make music in the higher level. I’m talking more as a person starting out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125158180276674700",
    "author": "Maxim",
    "date": "2023-07-02",
    "content": "How many years total have you focused on making a living from music exclusively?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125159637579202561",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "I can definitely see it that way. But I do really think I’m priced fairly. Yeah of course, I’m not the one paying - and it is one of those things were you could respond saying “that is what you think”. \n\nMy point when I say there’s not enough money in the market is that regardless of what my worth is, it doesn’t justify artists paying me when there is no ROI. They almost always tell me the same “I’d definitely pay you that if I’m more established and making money doing tours. But I’m not”. 100% a fair point. Which is why I don’t blame them. There’s really no one to blame, because the reality is that there is not enough money in record industry. Which is why I said that problem is in more macro level. \n\nAnd who knows. they could be saying that just to be polite, but I don’t think they’re lying given the current state of the industry.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125161900423000124",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "Definitely something I’ve considered over and over. I mean, if I am too expensive then it really is the reason. I’m hearing this from those whom I’ve worked with before. \n\nBut as you mentioned, you work in an industry that is more profitable as far as my knowledge (games). There isn’t much reason for them to question ROI. I don’t say this to invalidate your point, I think we’re just in a different playing field with different rules. \n\nIf I lowered my price to $300 a song, I’d have no problem getting work. But I’d be making less. And of course maybe that’s what I need to do to get to the point I want to be, but I’d rather do it for no money and have more freedom in controlling my portfolio and having more potential long term returns. \n\nAll of your points are valid points though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125174131659382904",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "No, but I took a home buyer’s course haha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125248021920227399",
    "author": "Andy Lawson",
    "date": "2023-07-02",
    "content": "of course, but living in a small community we always try and hook each other up. for me saying shoot blaa blaa a dm is easy and allows me to get on with the task's at hand.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125272029034184784",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "I think today was pretty cool- getting connected with a few people I could talk to is really nice. \n\nI don’t spend time thinking about this when I’m making records. I’m in that mode when I am, and when I’m not- this is all I can think of and it’s not by choice. I can’t even think about moving because of it. Not sure what I’m getting at… but yeah it’s not really something I’m choosing to do. All of this is what is on my mind 24/7 when I’m not making records. \n\nI’m also cold calling more people since talking to you. I’m putting in efforts where I can, I really am. Of course I could be doing more, make contents and post myself making music- but those things bring me existential dread.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125310992897814538",
    "author": "spectrummasters",
    "date": "2023-07-02",
    "content": "I’ve quickly scanned the convo while on my way to work . The  convo moves onto the value of engineers at 57 ,45 . For context , the platform has been set up by an ex JJ assistant Maddox . I’ve not looked into their vid tutorials but have enjoyed their discussions https://www.youtube.com/live/QxHkA7vw5Ks?feature=share",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1126320798412583033",
    "author": "Josh",
    "date": "2023-07-05",
    "content": "Just find an EDM tutorial on synthesizing drums and go from there!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1126967966471307374",
    "author": "spectrummasters",
    "date": "2023-07-07",
    "content": "For my sins I know a YouTube vid that explains it quickly . “Mix trick for SMOOTH airy vocals “ for those who are interested . Again apologies lol . I couldn’t bring myself to link a yt tutorial here in present company I blame my  yt feed for showing me this (good tip tho lol)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1128501937592074430",
    "author": "masteredbyjack",
    "date": "2023-07-11",
    "content": "I’m sorta sad about my generation to be honest, I hear it a bunch too (to each their own of course no judgement) but enough to make me notice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1128672361089073212",
    "author": "spectrummasters",
    "date": "2023-07-12",
    "content": "Interesting! I thought it sounded dope . 🤷🏼‍♂️ either way it triggered me to nod off last night listening to a seminar where he explained his moving to America and learning how to then engineer the “American “ sound . Those are defo aspirations for a few of us English engineers . I’d be interested in peeps views on what (if anything ) differentiates beteeen the American and the British / Irish sound /aesthetic   . I wonder ruari did you ever consciously change your approach for the American market once you moved ? (Open question to all of course )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1128727983578939485",
    "author": "sethearnest",
    "date": "2023-07-12",
    "content": "Most of the time yes, I recognize a difference. (Speaking in broad generalities so of course there'll be many examples of the opposite), American mixers *tend* to feel sonically cleaner/more averaged tonality-wise/more bottom, and British mixers *tend* to feel emotionally more raw and, as @Andy Lawson and others similarly mentioned, feel more like they're making bolder decisions throughout the whole process from soup to nuts. \n\n(Then there are guys like Nathan Boddy who're doing both sides beautifully and blowing my mind.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1128939613780713553",
    "author": "Edward Rivera",
    "date": "2023-07-12",
    "content": "Opposite story for me aha. Was so bored with the USA...visited Europe as a teenager and it spoke to me. The food, the old buildings, the cigarettes, tiny cars, and of course the music (and if I may admit, at the time, the opposite sex) Everything was different, but the same, just a bit different.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1129507356330446858",
    "author": "masteredbyjack",
    "date": "2023-07-14",
    "content": "Not sure it quite applies to my situation, sorta can alwasy come through on a single song for a master...albums different of course. I sometimes intentionally do it to put myself under pressure and see how I respond. If the work isn't up to par I will just let the client know \"hey I want to sleep on it, hit you tomorrow\" but I've found I almost always rise to occaision and the pressure is great, it brings something out of me. \n\nBut what's causing the overbooking? In your situation I'm sure that doesn't apply",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1129852294662467604",
    "author": "Deleted User",
    "date": "2023-07-15",
    "content": "on this topic: how long does it take for you to do tasks such as vocal tuning, drum edits, editing the whole song, mixing, and producing?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1129915957838631062",
    "author": "shaunobi",
    "date": "2023-07-15",
    "content": "Interesting convo. I think approaching music with more structure works for me, but I’m doing this part time and the dynamic is different. Most of the above sounds like project management issues, boring as that is. Not having a process to get paid? I mean - I’ve not gotten paid too. Have $250k we’re about to write off (and we’re not big enough for that not to hurt bad). Commit to something you end up not being able to deliver on? Having to tell clients “sorry” a lot? All sound like PM issues. And no, you can’t “solve” them, but with clear process and communication you can nudge a project towards more repeatability. I try to be up front and just very clearly and kindly lay out what I have seen before and consider “normal” (I mean, for me, I’m Portland of course). I find people like it when I bring the PM structure to the project… all depends on framing but I have good luck. And even some basic checklists I follow in initial meetings.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1130188453330559077",
    "author": "Nomograph Mastering",
    "date": "2023-07-16",
    "content": "Of course that comment is from you 😀",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1130282017074974831",
    "author": "Josh",
    "date": "2023-07-16",
    "content": "Can we make a collective YouTube channel for production walkthroughs.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1131045822050611210",
    "author": "OJ",
    "date": "2023-07-18",
    "content": "I do some video editing, graphic design stuff now and then... \n\nI got a huge passion for creating clothing but it of course costs to do and need to then sell em lol but this would be my ideal job once I've created enough income to support this passion",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1134153892444250286",
    "author": "cy (sigh)",
    "date": "2023-07-27",
    "content": "making lists down to the step for me.\n\nI do a lot of breath work stuff too. equal breathing quite literally helps your brain focus. \nHuberman Podcast has an episode on it I think is a solid way of getting into and learning to use it to help you. \n\ntrying to set up a specific days/hours for specific tasks  - I mostly clean / edit sessions on Tuesdays for example. I schedule one or two days a week to specifically just play around and do what I want and experiment. helps me get to things faster when the time comes. \n\nIm not greatest  with discipline tbh but I'm working on it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1135669572180123799",
    "author": "spectrummasters",
    "date": "2023-07-31",
    "content": "@Nomograph Mastering . I was discussing with my partners father on the weekend about the discussions I’ve listened to you have both here and on JFTR and LWMR with regards to success and consistency , commitment and gratitude ……and of course what dale said about not becoming a victim to your workload . My partners father emigrated from Sierra Leone to England as a young boy and built a good life here . He agreed v much with the sentiments I’d said I picked up from your discussions and views you’ve shared and he told me about a quote his father would always mention to him ….you may already know it ….but I wanted to pass it on to you for sure “The heights by great men reached and kept were not attained by sudden flight, but they, while their companions slept, were toiling upward in the night”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138547145000095844",
    "author": "spectrummasters",
    "date": "2023-08-08",
    "content": "I just learnt about the mcgurk effect on a bit of an ear training deep dive , crazy !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138564658580701264",
    "author": "spectrummasters",
    "date": "2023-08-08",
    "content": "It’s astounding ! Pretty much first thought was , well I bet unf@cked  know all about this of course",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138592793825128478",
    "author": "Deleted User",
    "date": "2023-08-08",
    "content": "for mixing, in my experience \n\nreference as a learning tool > reference as a reference",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1138600809207177257",
    "author": "Nomograph Mastering",
    "date": "2023-08-08",
    "content": "And of course it must be said that outboard can be the thing sometimes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138630940348907525",
    "author": "Deleted User",
    "date": "2023-08-08",
    "content": "of course. grammy winners always on completely different dimension. that’s how the dimensions and depth are achieved in a mix",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1139269019749318786",
    "author": "Rollmottle",
    "date": "2023-08-10",
    "content": "there's definitely a real problem in credits not making their way to the appropriate data sources. and little to no recourse for us small fries.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1139412642776240178",
    "author": "Deleted User",
    "date": "2023-08-10",
    "content": "Absolutely. I did not understand the concept of hope until this year, and that is because I have a father duty now… of course it is possible to understand hope even if you are not a parent, but I probably wouldn’t have",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1139578740213567558",
    "author": "Nomograph Mastering",
    "date": "2023-08-11",
    "content": "(Which of course has kept many a human alive too)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1139798734406959195",
    "author": "Rollmottle",
    "date": "2023-08-11",
    "content": "Love and hate that, of course, he has the first comment on it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1139919216682733598",
    "author": "spectrummasters",
    "date": "2023-08-12",
    "content": "🤷🏼‍♂️horses for courses and all that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1140828038590910606",
    "author": "Nomograph Mastering",
    "date": "2023-08-14",
    "content": "Did you ever watch his Masterclass? (On the Masterclass app)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1141863907829497999",
    "author": "Rollmottle",
    "date": "2023-08-17",
    "content": "Which, of course, they don't tell you.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1141894474784591872",
    "author": "Deleted User",
    "date": "2023-08-17",
    "content": "Another caveat on New cars right now, it’s either you buy what’s in the lot, get on waitlist and you’ll get what the manufacturer made, or you wait months to get the car of spec somewhat close to what you wanted. \n\nOf course it depends on the manufacturer but a lot of manufacturers can’t build to order at the moment\n\nIf you’re willing to buy what they have in their inventory then New car may be cheaper.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1141895336286240810",
    "author": "Deleted User",
    "date": "2023-08-17",
    "content": "And of course- the basic research on KBB and MSRP is all crucial (as you may know already)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1142129398988947536",
    "author": "Edward Rivera",
    "date": "2023-08-18",
    "content": "Also, since when did everyone online become a fucking teacher. All I'm getting in my ad feed is bloody courses. Weren't these called scams back in the day ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1142718947846787195",
    "author": "spectrummasters",
    "date": "2023-08-20",
    "content": "To your point re “ I’m deep “ One thing I think plays a bit differently between london and la is , in England we ll give each other a compliment / big up as a standard conversational respectful device ….a bit like the Buddhist namaste ..(the god in me sees the god in you ) . Do this with some LA folks and they don’t get the reciprocal point of this way of speaking (this does of course happen everywhere but I sensed it more commonly in the La circle I was in )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1144007005896446002",
    "author": "Rollmottle",
    "date": "2023-08-23",
    "content": "Ruairi's new Youtube channel just dropped",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1145608067485024287",
    "author": "Deleted User",
    "date": "2023-08-27",
    "content": "Late to the discussion, but I do think the word ‘talent’ is reductive and oversimplification of one’s complex combinations of innate character/traits. A lot of little things coming together is what makes up the ‘innate talent’. Things that give certain people a head start on different crafts can probably be analyzed into different components. While “either you have it or you don’t” can lead to defeatist thinking, I believe seeing them as a make up of different components can really bring out individuals’ best self. \n\nwe all have our fortes, but not everyone is able to break them down and integrate the different strengths to create synergy. And the “talented” individuals are the ones who has integrated the different strengths, whether it was through deliberate discoveries or something that was given to them circumstantially. I believe rephrasing ‘innate talent’ to something like ‘natural qualities/traits’ can lead to more freedom and more useful perspective than “I could never be like X” - because of course you can’t, you are not X. \n\nWhich brings back to what you were saying about the value of  journey over the prize",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1145710151131746314",
    "author": "Will Melones",
    "date": "2023-08-28",
    "content": "Shouldn’t they care to know? I’ve heard so many people in my family say they have no musical talent or they’re terrible at piano, but they’ve never practiced for 15 minutes. What’s the measurable difference between Yo-Yo Ma and your uncle?\n\nMy gut feeling is that most of talent comes down to commitment/focus (interest in the craft) and learning styles, and then culture and early exposure mold that into an affinity.\n\nSome people will suck at an art form, put in the work, and then not suck anymore. Some will be born with a brain that’s wired to seeing shapes, and find it easy to visualize patterns on a guitar neck. Some will be auditory learners and may find it easier to learn to identify intervals by ear.\n\nAnd then some people will grow up singing or playing in church, and those people get the cheat codes from a *very* young age while their brains are still spongey, learning things like their first language. Of course they weren’t born playing the organ, but it can look that way from the outside.\n\nIt seems both mystical and defeatist when people who don’t think they have talent talk about people who do—almost like an excuse. And maybe that’s intentional, and exactly the point you’re making.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1146125500092264549",
    "author": "Nomograph Mastering",
    "date": "2023-08-29",
    "content": "I did the interview and loved it, but I’ll never do a mix with the masters style watch me work thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147969524688236574",
    "author": "Josh",
    "date": "2023-09-03",
    "content": "Exactly. Of course there’s always those instances of “this produver layered this sample on every song because it just hit right” and we all have those 95% of the time things we do. But it’s easy to fall into that default mode of “it needs strings” but that patch could fit the song a bit better",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1148291183773225081",
    "author": "LAPhill",
    "date": "2023-09-04",
    "content": "Kidding, of course.. get him in here!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151329422545260564",
    "author": "BatMeckley",
    "date": "2023-09-12",
    "content": "Annnnndddd I think it sounds better? Different algorithm. And for me it’s easier to line up doubles and harmonies etc. Its a bit like the smart tool, people usually take a step backwards when they first get away from it, but ultimately find they’re faster after they get the work flow dial in. If you’ve ever learned to juggle, you’ve taken this step as you try to go from two items to three. \n\nAt the same time, whatever works best for you and gets you the results, that’s what you should go with. No rules. A great vocal producer friend of mine has basically (secretly) punted on Antares entirely. Horses for courses.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151415674325958656",
    "author": "austenballard",
    "date": "2023-09-13",
    "content": "oh while we're at it since I just got caught up with the conversations\n\npeople talk about learning to tune so it sounds good going into another layer of tuning with AT\n\nyou can use Rogue Amoeba apps like Audio Hijack to put an instance of AT after Melodyne standalone so you can hear what that sounds like while you're working outside a DAW. \n\nyou can also load a whole vocal chain like this if you want to hear your tuning with some compression and EQ on it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151789709354344478",
    "author": "Ross Fortune",
    "date": "2023-09-14",
    "content": "On that exact note, a lawyer pal was telling me recently how Renaissance dropped on a particular hell night trawling through contracts til 5am. B got her through the night - on loop five times straight through.\n\nAnd in that James Blake interview I linked in #🏯livesound-talk, he makes a lovely point about how when you truly connect with music you’re making, that song can truly connect with a listener and could change the course of their day, and maybe how they go home and treat someone. The butterfly effects are myriad.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1155646655400509480",
    "author": "Josh",
    "date": "2023-09-24",
    "content": "Of course you wrote a kids book",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1156036395287187518",
    "author": "masteredbyjack",
    "date": "2023-09-25",
    "content": "Finally circling back here, seems like the texts.com thing just added IG DM today (I haven’t linked it because I just saw when I was wrapping up for the day). \n\nIf it works, totally baller solution, I’ve been using it for a few months now and it’s awesome at the rest. all points of contact in one place in an app that is like iMessage\n\nIt does send email through to it, but you’d still want to reply on actual GMail — but you can see at a glance what’s going on (at least in my world where a lot of stuff goes down outside of email)\n\nOf course it won’t solve all the issues you describe but you can pin chats to top, group them, color code them, etc. seems like maybe useful especially with an assistant to keep track of things (with me not knowing the day to day workflow you have with them!)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158210647570534471",
    "author": "Eric Martin",
    "date": "2023-10-01",
    "content": "Why do you hear it sounding good and loud, oh, it’s peak limited, yeah, of course you like it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158406852443381780",
    "author": "Adam Thein",
    "date": "2023-10-02",
    "content": "He’s got a video up with a drum mixing tutorial if you want to see in real time how the magic happens",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1159410228081729566",
    "author": "Ross Fortune",
    "date": "2023-10-05",
    "content": "Post mixers, is there a heavy learning curve to mixing and delivering for commercials? I see acronyms like OMV…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1160706700999938148",
    "author": "bobby k",
    "date": "2023-10-08",
    "content": "I think one time Dave pensado said “I learn more about mixing from producers than from mixers” and I really liked that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1160726461087502397",
    "author": "Nomograph Mastering",
    "date": "2023-10-08",
    "content": "Of course, I’m not critiquing him, he knows me and shouted me out when I got there. Just saying, it’s not for me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1160742821444202547",
    "author": "Josh",
    "date": "2023-10-08",
    "content": "On purpose of course. But I think that achieves more of what people want than like what you’re saying",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165346035913203825",
    "author": "Josh",
    "date": "2023-10-21",
    "content": "Seawell Studios is the only gear YouTube channel I’ll check out. Dudes super mellow and doesn’t even really voice opinions but shows great comparisons between units.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165396826799751220",
    "author": "Nomograph Mastering",
    "date": "2023-10-21",
    "content": "Zooming out enough the question to ask is - Is a young Engineer/Producer/Musician better or worse off if she gets a bellyful of Colt/streaky/produce like a pro",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165401129312583862",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-10-21",
    "content": "That is true but a lot of audio content is very clickbaity and very often - purposefully or not - spreading misinformation or half truths that could hurt beginners‘ progress more than help it. Also a lot of the course sellers really only can make money bc there are ppl inexperienced or gullible enough to buy their material",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1165406683846156328",
    "author": "Nomograph Mastering",
    "date": "2023-10-21",
    "content": "Of course. An impressive skillset that i in some ways envy, I just value different things more",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1169859504582692936",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-02",
    "content": "ie there's more \"pop\" of course but it's so fused with other stuff I find it indisctinct in comparison",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1170967349243953162",
    "author": "spectrummasters",
    "date": "2023-11-05",
    "content": "Good looking out  thanks . I’ll have a listen to that west barn episode for sure . It was interesting listening to the engineer talking about managing bleed . Transitioning from mixing mostly sample - based / isolated instrument mixes to band mixes …..managing bleed while manipulating the stems has been  ……errrrr, fun/a learning curve /pain in the ass etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1173317316742750208",
    "author": "chrissorem",
    "date": "2023-11-12",
    "content": "Mix with the masters Allen myerson",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182049898380656771",
    "author": "austenballard",
    "date": "2023-12-06",
    "content": "one thing i'll add to this as well is are you aiming to be just another producerfluencer channel or are you guys trying to add to the discourse at large",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182050686263890091",
    "author": "austenballard",
    "date": "2023-12-06",
    "content": "like @hyanrarvey i'll be straight with you the mix with rick thing... like cool bro, MWTM, Puremix, Warren etc. are already there. \n\nwhat are you guys doing that are uniquely valuable to the record making community",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182056582381568101",
    "author": "austenballard",
    "date": "2023-12-06",
    "content": "look, like\nI'm so inexpressibly grateful for this community, for its very existence, and for the knowledge I have personally gained from it\n\nAll I want to do is make sure I'm giving back in as equal measure as I can. Whether it's the community profile articles or a podcast or whatever, if it helps platform the really cool people we've got here and spread good knowledge and discourse on record making, I will do it out of a sense of obligation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182078774712479844",
    "author": "austenballard",
    "date": "2023-12-06",
    "content": "I feel you on this but I really believe that being in the room with someone is so much more ... well, real ... than doing it over the internet. I've been consuming a LOT of podcast content lately and I really like the dynamic that guys like Lex Fridman or Chris Williamson/Modern Wisdom manage to achieve just by being in the room together with their guests. To say nothing of Rogan, of course. \n\nThis is currently a pipedream fantasy brainstorm, but if I do end up doing it I'm going whole hog. Call it naïveté, call it over-optimism, but I don't want to do a disservice to anyone I talk to, much less anyone watching/listening by having a less than stellar product",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182078952504840275",
    "author": "austenballard",
    "date": "2023-12-06",
    "content": "This is of course not to knock what Matt Rad pulled off just by going live on IG, or any of the other podcasts that are done over Zoom, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1192552579998154872",
    "author": "Zach Hughes",
    "date": "2024-01-04",
    "content": "I will say one of the people offering this advice is coming from a place of their own lived experience and since starting fresh has been very successful. Of course could be hindsight bias or any number of things. I am skeptical of the idea that a fresh start would inherently provide such a marketing benefit irregardless of the work",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1196410975633559633",
    "author": "spectrummasters",
    "date": "2024-01-15",
    "content": "You know , you’re not wrong . Something to do with the licensing must have been funky , the version up now on Apple Music is different and contains no sample . The YouTube video version from back in the day still does though. Wyclef of course famously didn’t clear the Enya sample for ready or not either back in the day . Doh !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1203666251701026858",
    "author": "Josh",
    "date": "2024-02-04",
    "content": "Of course, what I’m saying is you can’t program macros for things in track menus only.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1208498476992958475",
    "author": "Nomograph Mastering",
    "date": "2024-02-17",
    "content": "Not sure where to put this so we’ll start here and maybe we can migrate it if it lands in any way\n\nHad a great call last week with @Josh. We talked about a bunch of stuff but one of the themes we explored was the idea that one needs a “portfolio” of slick & great sounding work to get hired\n\nOnce you’ve decided that then it becomes the focus, and changes the way things feel and the way decisions about time, who you work with etc get made. Concepts like “I’ll suck it up and work for free but *then* I will have a singular “good track” for my portfolio”. Of course there are exceptions but it feels to me that there’s something very constricting and materialist about this way of being in the world. There can be a tension between what the artist wants or what the song wants to be and what makes you look “good” in your portfolio - they want mono and grimy but you want wide/lush/impressive\n\nIn our jam I proposed a kind of thought experiment, an end of the line or extreme of the “need portfolio” way of thinking…\n\nSo let’s say you are here, a young writer, producer, mixer. You’ve been doing it 3 or 4 years. You feel that one of the reasons you are not getting hired, getting shots or getting paid well is that there isn’t a body of work for a potential client to judge you by. Ok, here’s comes the magic trick. I’m going to grant you a genie wish portfolio! 5 killer tracks with  great collaborators. Not hot 100 #1 but the kind of work that you really feel would represent you best in the world. Boom. There it is…\n\nSo now what? You get some DMs and sessions start happening. But you’re not ready. You’re not fit for game day. You’re in over your head, and don’t have the fluency, the experience, the reps and the humblings that build a great music business pro. In short you’re not ready for the opportunities the genie wish portfolio granted you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": true,
    "is_expert": true
  },
  {
    "id": "1208508626336088114",
    "author": "Ingmar Carlson",
    "date": "2024-02-17",
    "content": "Something I'm still working on always, of course. Sometimes it's projecting a degree of confidence and certainty – this is what it is. Sometimes it's making space for anxious, pedantic tinkering and intellectualizing, and not trying to quash it or stop it in its tracks with engineer-brain certainty.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1212526470342115398",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-02-28",
    "content": "I rly liked his tutorials when he was a smaller creator and his solo content wasn’t “modern pop music sucks” his what makes this song great series taught me so much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1212554886605049966",
    "author": "Deleted User",
    "date": "2024-02-28",
    "content": "This is similar thing I learned from my journey so far, but from a different angle. \n\nLearning to care less, and practicing the emotional aspect of executing “fuck it, let’s move on” because I have more important things to care about. Practicing emotional aspect of this is really important. \n\nYou can know things, but not be able to do it. Just like how I might know checking your mix past 8pm is a bad idea but still do it anyways because I (care) didn’t train myself emotionally to see it through, and refrain myself from it - because I care. \n\nI haven’t done this in a year or two but I did it recently a week ago and… regretted it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1212564707014221945",
    "author": "Deleted User",
    "date": "2024-02-28",
    "content": "Usually the things that don’t necessarily need to be touched- only a personal experience; YMMV of course",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1213681357394546809",
    "author": "cian riordan",
    "date": "2024-03-02",
    "content": "But of course… harbingers and purveyors of un-fuckwithable, great taste, take no note! Keep calm and carry on. For the rest of us, keep being open to the idea of being wrong.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1216794468867510363",
    "author": "David Fuller",
    "date": "2024-03-11",
    "content": "Of course I live in Boston which is horrifically expensive",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221225243880853544",
    "author": "Ingmar Carlson",
    "date": "2024-03-23",
    "content": "From Tidal of course. With Spotify and Apple Music I’m only interested in having normalization on to inhabit the consumer’s world, as @Nomograph Mastering said above.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222321532572008600",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-26",
    "content": "if my favorite artists post tutorials that I can access easilt via their artist pages this seems like a big win all around to me. As long as the spotify cut isn't like 40% or whatever",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1225547124259688498",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-04-04",
    "content": "Of course it's possible but some of it I find rather hard to believe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1225864867869622385",
    "author": "Josh",
    "date": "2024-04-05",
    "content": "Personally I haven’t seen a video of his but I do find the discourse funny",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1226087933388394496",
    "author": "spectrummasters",
    "date": "2024-04-06",
    "content": "….theres a very old Pensados place , with CLA . It’s the old show format where there’s an extended viewers questions section . None other than a early years colt himself submits the question on how to make it , so that another thing to thank Cla for",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1227768538131861504",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-04-10",
    "content": "best case scenario here is people just stop making stuff that already exists. Which isn't a bad thing. If that's all that's gonna happens remains to be seen of course",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1227773735436681287",
    "author": "LAPhill",
    "date": "2024-04-10",
    "content": "There's a bill in congress now that would require companies to disclose what their software is trained on, and a watered-down version that would stipulate they must disclose if they used copyrighted material. Of course, the genie is out of the bottle and I don't know if that would even be possible for most AI out there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1228169233397973042",
    "author": "Deleted User",
    "date": "2024-04-11",
    "content": "I feel like AI music world is going to die pretty soon, and it’s probably going to establish itself as its own thing separated from any sort of music/record industry. The whole thing about music is the process that goes from making music. \n\nAnd then there may be waves of musicians taking it upon themselves to learn more about machine learning to create the tools they’ve been longing for\n\n… is my guess",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1229146577277419610",
    "author": "Nomograph Mastering",
    "date": "2024-04-14",
    "content": "Sorry, was not clear. Of course his humanity is coming through in his art, but outside of it he’s quite guarded. Which keeps him outside the walled garden of modern icons like a Billie",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1229827223629070391",
    "author": "masteredbyjack",
    "date": "2024-04-16",
    "content": "responding to @SoundsLikeJoe  as well -- \n\nThis exactly. I want to solve problems. Of course if there is something that is very noticeable that can't be resolved convincingly, I will absolutely flag it. Truly, I want the art to be the best it can and almost every single person I've worked with agrees.\n\nBUT -- why wouldn't you just want me to remove a click, attenuate an s, etc? Even did one today where I was removing some high end on just a few clap hits, easy in RX.  Attenuating down the volume of a breath, whatever. Easy. Almost always the result is indistinguishable from you removing it on your end. Then you don't have to reprint, etc etc, the artist gets it faster, everyone wins.\n\nThen there is also the issue of where the click or artifact is actually coming from. Lead vocal? Backgrounds? One of 15 of the background stacks? So much easier for me to just zap the issue on my end from the stereo file. Again, with all this being that the result is equal (and oftentimes better I'd argue)\n\nObviously if the edit is in the way of connection to the song or it genuinely would sound better as an edit in the mix, we do that. But even something like bridging a bad edit that has a space in an s, etc can be done well with spectral repair replace!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1229843227872464937",
    "author": "SoundsLikeJoe",
    "date": "2024-04-16",
    "content": "Not suggesting a kickback for everything...  Just a question on \"process\" for what I've experienced while hiring MEs.  The one's I like the most are those who help defend the project, and would willingly have a conversation with me to help make the best possible thing.  Clicks and pops?  Of course!  Knock it out.  I wouldn't read too much into the  comments as a request to send back to mix for tiny things that are easily fixed.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1229847224268357773",
    "author": "masteredbyjack",
    "date": "2024-04-16",
    "content": "Totally! I was genuinely asking! Makes sense. To echo @Berlin (who of course has much more experience than me and whose thoughts should be weighted higher), definitely depends on the team and situation for stuff like that. And DEFINITELY under the radar. Something @Nomograph Mastering mentions is creating and keeping a feeling like everyone is on the same team moving toward the same goal, very important",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230154603979473020",
    "author": "hyanrarvey",
    "date": "2024-04-17",
    "content": "Know your audience and it’ll help you nail the mix",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230207973440360551",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "Had a full day tutorial (him teaching me) with Zedd about this when we built his room",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230244900168269824",
    "author": "Iwan Morgan",
    "date": "2024-04-17",
    "content": "Yeah, to an extent I agree. I’m not setting this up as a cause I was more interested in how people think about this on a conceptual level. I firmly understand that some small niche mixing video tutorial is bot a big deal, it just baffles me when we work in supposedly one of the most liberal working environments that some forma of behaviour get glossed over. I’m all for rehabilitation in general terms it just seems like a baffling decision.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230265635867721839",
    "author": "LAPhill",
    "date": "2024-04-17",
    "content": "Actually, while not quite \"tutorial,\" I never felt that way from the LWMR episodes. About Matt, Jon, or even Beckley",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230269031618052216",
    "author": "Rollmottle",
    "date": "2024-04-17",
    "content": "guess it depends who their customers and audience are. generally, if you create content, does your audience think about you as somebody they're going to hire to do the thing you're tutorialing? i'd wager no. but like you, i am also old.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230269288695336970",
    "author": "Josh Bowman",
    "date": "2024-04-17",
    "content": "Disagree here. I think if the content is interesting it doesn’t change my opinion of them as a professional. For some people it can make me like them more if their love or passion for the art comes across in the tutorial/content. You are likely not their target customer also for what it’s worth.\n\nEdit to say: I also know engineers who do this and it is cringe and it’s for sure loosing them work, but they don’t realize it comes off that way. Or maybe it’s just not for me and I’m missing something??  🤷‍♂️",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230272972544151684",
    "author": "LAPhill",
    "date": "2024-04-17",
    "content": "There are exceptions. A woman I know runs a fairly popular youtube channel for composers, and she's gotten noticed by productions and hired because of it. There are people who can create a brand for themselves through social media and attract clients through their charisma, knowledge, whatever it may be.\n\nThat said, many (most?) of the short IG tutorial landscape is by people who are still trying to build their brand. Everyone struggles in the beginning to get their name out their and attract clientele. I can't fault it if it works, but those with more experience are going to eye-roll when they call themselves \"professionals\" or whatever.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230273165490520148",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-17",
    "content": "Coming up through tutorials seems a bit antithetical",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230273171127537744",
    "author": "AJ",
    "date": "2024-04-17",
    "content": "As an artist who's hiring a producer who makes tutorials on the side, I'm going to agree  with this. Definitely feel more comfortable trusting him with this project than trying to get over the hurdle myself.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230274121535852564",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "Good point, that's a difference - tutorials may reflect poorly in one market, but elevate perceptions in another",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230275905872728216",
    "author": "hyanrarvey",
    "date": "2024-04-17",
    "content": "Depends I know artist that have blown up from tutorials",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230276176279244833",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-17",
    "content": "Yeah, I don’t understand why people recommend artists in particular do tutorials, at least technical ones. Story behind the song and broad/fun is fine, EQ moves is another audience",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230287588019929128",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "1) I have 46 podcast episodes online, I have done it. (Spine to be memory holed) I have counselled close friends to stop posting. I'm not just doing drive by reviews of people's reels. I'm thinking \"does this benefit them they way they think it does? When my daughter asks me whether she should do IG tutorials will I say yes or no?\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230289352261636206",
    "author": "joshbonanno",
    "date": "2024-04-17",
    "content": "for what it is worth...i am not disagreeing with you. everything you put online communicates something, and i agree that most of the tutorial level stuff isnt driving in the direction that most THINK they desire to go (longer conversation here about how most dont even really know where it is they want to go and some really do just want to be famous and make content) howeverrrr, it is 2024 and most people only know/have social media as a baseline for a social life and way of connecting and communicating with people...and with that as a foundation...they really dont know any other option other than posting tutorials as a way to gain traction and attention.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230290056212774983",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "Long form has a place and value I think, short form tutorials I’m not really being swayed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230296215795666974",
    "author": "gatewoodsensei",
    "date": "2024-04-17",
    "content": "Apologies if this is already been said but i have two perspectives. \n\n1. I think the type and angle of the tutorial differentiates the artist from strictly tutorial person. For example. Instead of “this is how you do x” it’d be “this is how and why I did x for this song”. \n\n2. What about the mothership format for content? Like you post one long form thing maybe like an hour or more where you talk at length (so the running analogy in this case), and you take that and clip that up for shorts (different destinations amongst the run), that leads people back to the long form piece? Idk just shooting while I’m feeding the kiddo.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230303013844029440",
    "author": "Zach Hughes",
    "date": "2024-04-17",
    "content": "The only thing crazier than trying content marketing / tutorials in 2024 is not to try content marketing / tutorials.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230351520910934077",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-17",
    "content": "i was just thinking about what the venn diagram between people who watch mastering/mixing tutorials and people who hire mastering/mixing engineers looks like. What's a guess?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230352450515632179",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "It’s really the heart of my question today - is influencing/tutorials to attract low quality clients that will leave you for someone cool as soon as they can a better career strategy than just going dark, woodshedding, maybe investing in a few key relationships and doing the work?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230360634156388393",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-17",
    "content": "Agreed! Interesting to hear yall flesh it out. I wonder, if the work showcased in tutorials was good enough, would that change things? \n\nI'm always intrigued by verticals that are considered uncool/unsexy - there's usually some kind of dormant potential there",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230361023324753931",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "Engineering is not uncool though, there are audio schools full and online tutorials a plenty becuase people want in",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230364292516286555",
    "author": "hyanrarvey",
    "date": "2024-04-17",
    "content": "I really like nail the mix when they did some of my favorite metal records broken down + you get the files to mix along. Made me feel like a kid again so fun. Not all of em though \n\n\n\nContent is interesting to say the least",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230368137078378620",
    "author": "Rollmottle",
    "date": "2024-04-17",
    "content": "Don't disagree there. There's definitely value in seeing other's approaches. But, one tutorial leads to another tutorial leads to another and the next thing you know you've spent 7 hours on Youtube \"learning.\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230370339490369597",
    "author": "hyanrarvey",
    "date": "2024-04-17",
    "content": "But then I’d be watching you tube tutorials on how to mix and paying dudes like mastering.com",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1231274057790525513",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-20",
    "content": "I think decoupling name recognition overall (producers too) is the most interesting thought experiment. Flawed of course, but interesting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1231704302159007775",
    "author": "spectrummasters",
    "date": "2024-04-21",
    "content": "Ya , for me my intuition is ….i have a number of. Elements interplaying in a stereo field ….ive carefully curated their dynamics and balance (tonal and loudness ) and I want them to speak to each other (dual mono )  not compel each other (linked comp ) …..in my head this is how I think of it and then of course I’ve built a mix into it so …..flipping into linked mode would not be an honest comparison at that stage",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1231713975209824346",
    "author": "spectrummasters",
    "date": "2024-04-21",
    "content": "I get you , this is v important to understand . I’ve picked up from here that I have a natural tendency to want to explode every sound when I get to mixing and this is not the thing . It comes from producing . Learning to curate the sounds and respect them and stop trying to “improve “ everything has been a massive learning lesson",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1233232991850070017",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-25",
    "content": "put this on my reading list. Anything stand out to you?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1238594727906119780",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-05-10",
    "content": "I will add that Goodhart's law is often thrown around as some universal truth, when it's merely a statement on monetary policy that has been broadened in scope. Robust enough measures can arguably be designed to anticipate and resist manipulation. But if the measures are bad (ie \"how diverse does this photo look\") of course it will fall apart",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1246970776519835731",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-06-02",
    "content": "I'm fairly tolerant about artist's stance on politics (mostly concerning on whether or not they choose to engage in political discourse on their social media). Unless you're doing/saying Chris Brown or Tom MacDonald type shit, I'm fine with you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1248630148849336432",
    "author": "Josh",
    "date": "2024-06-07",
    "content": "You’ll have all you need to start an audio guy YouTube channel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1248642210568732722",
    "author": "Eric Martin",
    "date": "2024-06-07",
    "content": "I felt like the learning curve was steep, and sometimes still can’t figure out how to do something that is simple in other DAW’s",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1249961099437281374",
    "author": "spectrummasters",
    "date": "2024-06-10",
    "content": "The impact of the suns em radiation can of course be felt during solar storms",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1249962169550901328",
    "author": "spectrummasters",
    "date": "2024-06-10",
    "content": "This of course might not serve the profit reports of some rather large mnc s. ✌🏼",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256407138734047306",
    "author": "Adam Thein",
    "date": "2024-06-28",
    "content": "WHY MUSIC SUX FIX IT WITH MY NEW COURSE",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1258988540314779678",
    "author": "David Fuller",
    "date": "2024-07-05",
    "content": "Online discourse also got totally subsumed by Facebook et al, but that's a story for another day",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263896166517444779",
    "author": "rawssx",
    "date": "2024-07-19",
    "content": "I am joking ofcourse, how am i gonna put my music out if there is no tech omg….. its fucked",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1263952757036023880",
    "author": "Edsel Holden",
    "date": "2024-07-19",
    "content": "it was the only place for a long time, Pensado is such a legend.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1263954021161631893",
    "author": "Robin.Z.V",
    "date": "2024-07-19",
    "content": "The Pensado Fb group was awesome back in the early 2010’s. Met some current day homies in there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1265885060096200725",
    "author": "spectrummasters",
    "date": "2024-07-24",
    "content": "The history of recording prior to that was about capturing performances , which of course was a number of musicians playing together , which of course is about …….the interplay , resting on the connection between the players . That’s the rub",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266885866622681158",
    "author": "Nomograph Mastering",
    "date": "2024-07-27",
    "content": "Of course each generation is far from a monolith but there are definitely trends IMO",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266900784159653909",
    "author": "Nomograph Mastering",
    "date": "2024-07-27",
    "content": "Which of course is stripped of context and maybe utility when they convey that “fact” to a younger person",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268451068707213353",
    "author": "Nomograph Mastering",
    "date": "2024-07-31",
    "content": "But the move was to stay the course, the band get to express their vision and he carries on mastering a Buncha great records",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1272649120204718221",
    "author": "Rollmottle",
    "date": "2024-08-12",
    "content": "perfect guy to start a youtube channel",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1281615807704600678",
    "author": "Josh",
    "date": "2024-09-06",
    "content": "Literally learning to walk again, their drummer figuring out how to play with half of a leg, half of the dudes broke their backs. That was a powerful moment I’ll remember forever.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1287438636681400371",
    "author": "spectrummasters",
    "date": "2024-09-22",
    "content": "This is the essence of it I agree . Interested to hear what you come back with . I’ve been mulling it over all day . What springs to mind for me is one of my childhood friends dad . He is a vintage classic car restorer , but the highest spec classic cars . Seminal cars . Ground breaking Bugattis, Ferraris , auto unions (Porsches first Grand Prix cars ) ….his clients are folks like Ralph Lauren , private clients who cherish these cars and their history and ship them from the states to my pals dads workshop . Everytime I’d hang with my pal (we grew up together ) we d have a peep at the staff working on these legendary cars and it was always silent but peaceful . Like a church . The diligence and passion of the craftsmen and women there is what ruairis post is reminding me of",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1287790608160657562",
    "author": "Rollmottle",
    "date": "2024-09-23",
    "content": "I don’t agree at all and I think that takes a very narrow view of the tool, but horses for courses. The beauty is that there is no one way to use it. I would submit to you that “creative rut” and “I don’t know what to write about” seems like a distinction without a difference.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1300211472684679213",
    "author": "Slow Hand",
    "date": "2024-10-27",
    "content": "Interesting question. As someone with a diploma from a music program I don't know that it was the best investment in the long run. \n\nDon't get me wrong, I learned a *lot* and got a great education, but it was a lot of money to spend for learning to make records, and I'm not sure - with hindsight - that I'd do it the same way. There are other programs/paths that could give great results, so I would advise others to heavily consider if it's the best use of their money.\n\nThat said, it sounds like the formal qualification (the diploma) is a big motivator here. Is that correct?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1300505825915310161",
    "author": "Chad Rodgers",
    "date": "2024-10-28",
    "content": "Speaking of education, and as a bit of an aside, how much time is everyone dedicating to learning new things and personal development?\n\nI mean things like watching MWTM /PureMix videos, experimenting with gear and approaches outside of client work, playing guitar etc etc. Basically the stuff you don't get paid for. I find the more busy I am with client work, the less time I'm able to dedicate to this stuff and I'm feeling like I might benefit from putting aside 2-3 hours a week to get in the zone with it. I learn a hell of a lot on here from the discussions everyone's having, but some quiet solo development time would be a good thing and I'm interested in hearing how you folks approach it (if at all)...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1301114429274062920",
    "author": "bookchild",
    "date": "2024-10-30",
    "content": "I was at an event in an Irish University lately and I let someone try to talk me into doing a Masters online (not music-related - actually not anything in particular). She was selling microcreds.ie but I’m sure every college in every country is doing similar. Within limits, you can build your own course. Basically 60-120 ECTS (standard European college credits) equals a Masters and apart from that all you have to do is get someone in a university to agree that the modules you choose make sense together. People in Universities are in the business of selling qualifications to you, so they will probably want to help. If the piece of paper is the most important thing, it might be an option.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1306153182229037057",
    "author": "Slow Hand",
    "date": "2024-11-12",
    "content": "Man, that's great and exactly what I was wondering. If it's all handled client-side then (thankfully) there's not a lot of recourse from Youtube here. Unless maybe someone is using Chrome where Google/YT could impose more control.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1312950040939204709",
    "author": "Pio",
    "date": "2024-12-01",
    "content": "I once heard someone talk about a person learning to paint, and it’s always stuck with me. A person starts painting a bowl of fruit. At first, they suck. It’s really bad. You could say it looks basically nothing like the fruit bowl. But - if that person keeps painting, every day, same fruit bowl - and a week passes, a month, a year. If they want to perfectly recreate the fruit bowl - even 5000 years probably wouldn’t be enough, it’s still not the same as the real thing. The painting would still be short of a total ‘understanding’ of the fruit bowl, you might even say - what about the atoms after all? Or the flavour?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1316073193756295299",
    "author": "Zeuswayn3",
    "date": "2024-12-10",
    "content": "Idk man I’m all for people chasing the mkgee tone. Mkgee is special and it’s more than his guitar tone that makes him unique.\n\nThat being said- I have a baritone jaguar with a vg8 and of course it sounds like mkgee but there are ways to make it original",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1317566268055879681",
    "author": "Nomograph Mastering",
    "date": "2024-12-14",
    "content": "I think the Everyday Astronaut interviews with Elon (and Bezos) are masterclasses",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1318007682061565983",
    "author": "Rollmottle",
    "date": "2024-12-15",
    "content": "Shoot for the next dove? Why stop? I like to think my commitment and bar for greatness is constant. Reality often forces us to make trade-offs, of course...but never being satisfied, even when something is great, is what keeps me going for the next one.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1319030843930447944",
    "author": "Nomograph Mastering",
    "date": "2024-12-18",
    "content": "Of course, that’s just my corrective stuff",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1328567659238789231",
    "author": "Zakhiggins",
    "date": "2025-01-13",
    "content": "I was recently inspired after going to the cinema to see *A Complete Unkown*, the movie memoir about Bob Dylan; partially by Bob's story, but also by Timothy Chalomee's performance as Bob. All of the shots of him performing in the movie were fully live - which is an impressive feat by itself - but even more impressive that he apparently wasn't much of a musician before making the movie. I didnt know much about Timothy before this, so I watched his interview with Zane Lowe on Apple Music's YouTube channel. One thing I found really interesting was how available he made himself to learning the role. For example, he didn't turn his phone on for 3 months straight. Got me thinking about how much I can get distracted during the day, and how these distractions can get in the way of me actually giving 100% to the art that I'm working on. I'm sure you all can imagine how the distractions in your own life can effect your work. Might be TikTok videos, might be discord, might be lusting over getting new converters or monitors or guitars, etc, you get the idea. So I guess what I'm saying here is that if I want to compete with the best, maybe I have to understand how to impliment systems in my life that allows me to be more available to the things that I am working on. I want it to be like lifiting a heavy weight at the gym - at the bottom of a heavy squat, you've no choice but to focus on pushing the bar back up with good form, cos that think will break you otherwise. There's a certain thing that happens in your brain when you're forced to only think about one thing for a prolonged, or even short period. It's something akin to meditating. \n\nI guess what I'm asking is if anyone has ever given this subject any thought before, and if anyone has ever done anything to get better at these things? I'm still not sure if all this only makes sense inside my own head.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1329463000960335873",
    "author": "markmaclure",
    "date": "2025-01-16",
    "content": "I think Rick Rubin producing “Under The Bridge” was a masterclass in what I’m trying to understand. Maybe? I think he understood the point of view of RHCP better than they themselves did. He found a little piece of magic and somehow got the band to let go of their prior conceptions of their identify and record the song. Some Jedi shit for real. \n\nHow do I do that? Should I do that? How should we as producers think about point of view when creating for/with artists? To what extent should we be involved in crafting the point of view? What should we do when an artist has potential but is lacking a distinct point of view? What is even is point of view?\n\nAny thoughts would be welcome.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1333815554926182471",
    "author": "Chase H",
    "date": "2025-01-28",
    "content": "What are some of y’all’s  favorite Mix with the Masters series?\n\nI gravitate towards the things that are more overtly in my comfort zone genre wise and I’m sure there is some great stuff in the MWTM videos I normally wouldn’t think to watch",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1343256471592243312",
    "author": "bobby k",
    "date": "2025-02-23",
    "content": "Well shifting the subject I scored myself a free copy of Jeff ellis’s  course he’s been promoting “mixer brain” (which is like 500 bucks normally lol) so I’m just curious to see what it’s about",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1343291505028104253",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-02-23",
    "content": "Now, if Matt and Jon have plugins/mics/courses they have a financial stake in and talk about/recommend, they'd fully be influencers.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1343673887816155136",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-02-24",
    "content": "but yeah, there's of course exceptions to any broad rule you want to set",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1344119616984584312",
    "author": "Zach Hughes",
    "date": "2025-02-25",
    "content": "If you don't mind sharing what was the last time you read that and changed course? Curious how you use that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1344517230431567923",
    "author": "Deleted User",
    "date": "2025-02-26",
    "content": "Thank you all for chiming in on this, it really got me thinking! I took some time to dig deeper into my uncomfort with this topic and I think it’s really just about the concept of a “personality trait”. Maybe we can jam a little on it.\n\nI had this example in mind:\nLet’s say we meet someone for the first time and while we’re interacting I gather that this person seems like a “happy person”, they’re smiling, giving off warm vibes and are kind. We keep on meeting this person and the experience repeats itself. So the more we meet, the more our idea that this person must be a “happy person” solidifies. We know of course that this is an abstraction and that the person is probably going to be sad, angry, etc. at times. \n\nNow let’s say we think, man I really liked this person they are so easy to deal with, I enjoyed every bit of our interaction. I wish more people would be like that! And there you go. Now you are set to figure out all the details about happiness, the factors that make a “happy person” a “happy person”. The warmness, the kindness etc. and help people be more happy. \n\nNow you’re really digging into it, you start making videos, writing blogs going out to teach happiness. People are really digging it and you feel like you’re doing good for the world. So the concept is in everyone’s mind happiness is what we should strive for and whoever is not happy enough yet just needs to try harder. Suddenly you’re watching the news and you hear more and more people are getting symptoms of depression, stress and anxiety. And you think to yourself wow how did that happen? I thought I was making   the world a better place. \n\nAnd I think that’s what’s happening with a lot of these concepts that once they get institutionalized or gain popularity they somewhat lose their initial intent and can even have a rebounding effect. I mean we can see it going that way with a lot of different trends like mindfulness, health awareness, the work life balance etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1344521619439353888",
    "author": "Deleted User",
    "date": "2025-02-26",
    "content": "No I definitely want you to talk about agency, it’s hugely valuable. What I’m rather trying to think about is if there’s a way to discuss all of this without the construction of norms that bog down on people. I don’t want to cancel discourse in any way, I know I’m treading territory that might feel like that. I’m just trying to see if there’s other possibilities",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1344538244850778142",
    "author": "Deleted User",
    "date": "2025-02-26",
    "content": "Ok one last thing Imma say, cause I see that that’s still getting confused. I’m not talking about agency here, you can swap out the word for everything else I mentioned in my example. It was rather aimed on the og post as an example of the possible formation of cultural norms in public discourse",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1346576512433782907",
    "author": "Zach Hughes",
    "date": "2025-03-04",
    "content": "I'm staying a little longer than the workshop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1346922552647225445",
    "author": "Deleted User",
    "date": "2025-03-05",
    "content": "Watched the first couple of chapters, goofy in style and good advice for focusing on the right things til now. Speaker setup, what really matters about loudness, the emotional core of  music, macro and micro balancing. I skipped some of it, cause there were some concept’s he already talked about in other free videos I watched already, but it makes sense to have them there in the context of the course aswell",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1351184817600860160",
    "author": "masteredbyjack",
    "date": "2025-03-17",
    "content": "Could still be the case of course that some plugs only have dongle auth of course",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1352299926897561722",
    "author": "bobby k",
    "date": "2025-03-20",
    "content": "something i've been thinking about.. few weeks back, we talked in mixing chat about time boundaries with partners. we've heard from people with partners/families who set strict hours, and of course those of us who are single have the liberty of working whatever hours they want. but what about those of us who *do* have the partner/family but *don't* have any \"set hours\" in place? what's that like? what is your partner/family's perspective on your work & time management?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1357856531433001151",
    "author": "Brian Reynolds",
    "date": "2025-04-04",
    "content": "How frequently Mix With The Masters auto signs me out can F right off doe",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1358188798135242954",
    "author": "hyanrarvey",
    "date": "2025-04-05",
    "content": "Man there used to be a dude who made Logic tutorials while sounding like Joe dirt and made it very funny white trash hillbilly themed and no one can recall them but I fondly remember them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1371861500754526258",
    "author": "David Fuller",
    "date": "2025-05-13",
    "content": "So a long ton is 2,240lbs. A short ton is of course 2,000 pounds, which is 20x 100 pounds. We use the short tons in the US because long tons are stupid.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1372668573516038336",
    "author": "hyanrarvey",
    "date": "2025-05-15",
    "content": "Just tools you’re the craftsman, in all regards! Resources are recourses for a reason",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1391813054970335302",
    "author": "James Cronier",
    "date": "2025-07-07",
    "content": "Nah man, there’s a few other aspects to this title such as dubious involvement in any credits they do claim, super annoying short form video content, and websites that offer “one day only” discounts for mixing and courses that seem to last in perpetuity.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1394439139826602119",
    "author": "David Fuller",
    "date": "2025-07-14",
    "content": "of course things get squirrely with floating point, but plenty of people a *lot* smarter than me have put in the time effort and money to mitigate FP errors, and for our purposes doesn't cause any problems. At any rate, it wouldn't make one DAW sound different from another.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1397634520127377510",
    "author": "Will Melones",
    "date": "2025-07-23",
    "content": "The students can barely book those rooms to finish their coursework, but maybe they can squeeze you into the 4am slot",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1397634720904515684",
    "author": "Bryan DiMaio",
    "date": "2025-07-23",
    "content": "Actually the Mastering suite is wide open this semester since that course only happens in the fall and spring lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1397776549658230875",
    "author": "oaklandmatt",
    "date": "2025-07-23",
    "content": "Does anybody know who does the sound for the musical performances on Howard Stern's YouTube channel? They're so good and consistent.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1400138592667435078",
    "author": "Dalliance",
    "date": "2025-07-30",
    "content": "Also it’s pretty hard to find those people since there is no tool (that I know of) to filter through the inputs (musician, stream count, language, etc…). It’s easy to find mainstream artists of course but those are way above my shooting range",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1406040224672256163",
    "author": "chrissorem",
    "date": "2025-08-15",
    "content": "Funny you should bring this up I’m teaching a work ethic workshop I the near future stay tuned",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407811206370164826",
    "author": "oaklandmatt",
    "date": "2025-08-20",
    "content": "I just opened an old old pro tools session and it of course it was missing and I had 35 instances of it 😭😭😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1431826827176968333",
    "author": "Slow Hand",
    "date": "2025-10-25",
    "content": "Oh, of course! Big fan.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1438308268635062393",
    "author": "Rollmottle",
    "date": "2025-11-12",
    "content": "Fine. I'd rather have nothing and hear it full response of course, but I'm there to feel it in my body and not lose my hearing more than have some kind of hifi experience. Hasn't gotten in the way enjoying the live sound experience.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1450179518232006727",
    "author": "Pio",
    "date": "2025-12-15",
    "content": "They’re so good. I used one earlier this year when I wanted to lock in on some writing work for a bit and go fairly heftily cold turkey offline, for a few weeks - I let my brother come and visit me and hide the Brick somewhere in my house where I couldn’t find it. \n\nI would have had to call him, and ask him to come visit me, if I wanted to unlock it… and… it worked 😂\n\nOf course most of the time I use it a bit more reasonably 😅 but it’s amazing the difference it makes doing something simple like putting it in another room so you’ll have to go all the way over there to get back online\n\nDefinitely been a game changer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1455985616926802113",
    "author": "hank01564",
    "date": "2025-12-31",
    "content": "I wasn’t a part of the back and forth and am only getting the clients perspective so not the best source here but to my limited understanding, there was a per song mixing rate that was expected. They sent a bunch of songs that were expected to be released, some weren’t and all got mixed. Manny charged for all, of course. Line items for each were that per song mixing rate, the studio fee which was per song, and atmos",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1460368672777437446",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-12",
    "content": "Haha I'm thinking of a couple of the biggest ego ones when I think back on those times. \n\nThere were high and low of course, but we were young and the most confident larger than life characters impacted the social culture there the most",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1462642057448394841",
    "author": "Nomograph Mastering",
    "date": "2026-01-18",
    "content": "Hallie is great but I think that while objectivity is a really important ingredient, she’s perhaps overweighted it here. Most mastering engineers operating rn do have objectivity, and despite that most mastering (imo of course) is very sub par",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1471872447820337163",
    "author": "NoahNeedleman",
    "date": "2026-02-13",
    "content": "I of course, know you to be one of the most joyful people in my life.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  }
]