[
  {
    "id": "1384554202176421918",
    "author": "hyanrarvey",
    "date": "2025-06-17",
    "content": "Absolutely nothing can console this pain I am feeling from having a close friend pass last night, I am just so angry and hurt and just upset, I put on a song and my hair stands up and I feel this overwhelming wave of peace and serenity pass through my body.\n\n\nMusic IS A language that is universal and heals.",
    "reactions": 31,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1277694094742781983",
    "author": "BatMeckley",
    "date": "2024-08-26",
    "content": "Without going too therapist couch on the details, I was the only kid that had to lie to my parents in highschool and tell them I was going to parties (which were ok) and then went to work playing shows on the sunset strip (which was banned). Moving to Australia to join a band in my early 20s got me excommunicated from half of my family, some of whom I didn’t get to talk to for nearly a decade. Some had credible experience in the industry, others just in life, but truthfully, if you care about someone’s quality of life and ability to provide for themselves and hopefully a family, you don’t steer them towards a career in music. \n\nBut, I wouldn’t be told no, and every time I was pushed away from something I wanted to do (I couldn’t go to school in LA because it was too close to the industry) I ended up somewhere that actually furthered my career (I ended up in San Diego, where I became friends with the Switchfoot guys which really helped launch me). It’s why I have such little patience for the “oh the studio manager was short with me while I was an assistant” crowd… if you want it bad enough, you figure out a way to make it work. And if you don’t want it bad enough, there’s a hundred more guys like me that do, that are willing to sacrifice their time/health/money/etc to the cause. I don’t say that to frame it as admirable or healthy or anything positive, it’s just the truth of how things are. \n\nSo, that person that’s going to quit because a studio manager was challenging, or a teacher didn’t like their song? They’re going to get devoured by the people that really dedicate their lives to this, and it feels cruel to tell them otherwise.",
    "reactions": 28,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1305643196180598784",
    "author": "Zach Hughes",
    "date": "2024-11-11",
    "content": "Hey folks, back from mix with the masters with Jon & Teezio. I wanted to share just a little bit in case anyone else here is considering attending a workshop in the future. I was initially on the fence, but am very glad I went. \n\nJon & Teezio were amazing together. I don't know how often MWTM does workshops with two engineers, but it really enriched the experience for me. It was actually comical how different their perspectives were on mixing, the business side, motivation for the work, lifestyle, etc... This created fascinating debate / conversation in the group. The Grammy nominations were announced while we were all together and we got to celebrate Jon & Teezio as a group for their I think combined 6 or 7 nominations. They brought in a bucket of champaign. All this after having gone through the sessions for said grammy nominated work earlier in the week. 10 / 10.\n\nRue Boyer studios is actually insane. Probably the best room I've been in.\n\nThere were attendees from all over the world. We ended up sharing mixes and receiving feedback from J&T. Hearing and sharing records in the same room with the people who made them with context provided from varying countries, cultures, genres, and scenes was as enlightening a music listening experience as I'm likely to have for the rest of my life.\n\nSo if anyone else here is on the fence in the future. Here's a tiny nudge.",
    "reactions": 25,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1364382567679262811",
    "author": "bobby k",
    "date": "2025-04-22",
    "content": "sort of related, but i've been reflecting a lot on how precious it is to maintain a listener's perspective on a work in progress, and what things we can be doing as the producer/mixer/etc to grant that privilege to the artist first and foremost. the simple stuff includes saving the nitty gritty work for your own time, delivering the best mix of the record no matter the stage it's in, focusing any time spent together on how you can make their voice and contributions and ideas the best they can be. some artists love mixing and editing and getting into the weeds, but i'm realizing quite often how much of a duty it is to be the artist, and how record making is only a single slice of that pie. For us it is more or less the whole pie. and a big responsibility we carry (perhaps without realizing?) is that it is our job to protect the artist from getting  stressed out by the process. and this extends to processing and managing our own stress about the work should it exist, as stress is a contagious energy.",
    "reactions": 24,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1468639259992002641",
    "author": "Bryan DiMaio",
    "date": "2026-02-04",
    "content": "there are plenty of engineers all over Tiktok or YouTube who have no imposter syndrome whatsoever and will be happy to sell you their mastering presets",
    "reactions": 23,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1191473963935727806",
    "author": "popaganda.",
    "date": "2024-01-01",
    "content": "Wishing you all big breakthroughs this year, a deeper love of the craft, that we all might remember why we do this every day….that first spark, that we may all make records from the heart, from inspiration, that we don’t get mired in comparison but grow in our ability to perceive and honor what’s beautiful and unique about this song….this artist….this production. All the best in 2024!",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1352343088500314175",
    "author": "kieronmenzies",
    "date": "2025-03-20",
    "content": "On the topic of communication, I know it goes without saying (pretty sure we're all guilty of this) but it's always worth mentioning in case there are any younger impressionable minds reading this. Older unimpressionable minds may as well read it too. Don't forget to communicate with yourself. Week in and week out, I don't know how many times I plug my ears and go \"lalala I'm not listening\" when my body starts throwing terms at me like fatigue, exhaustion, dehydrated, hungry, getting sick, underslept, stressed, depressed, fully sick, too much coffee, etc. At this point, maybe it's time to listen and do yourself a favor because in the long run, every favor done for you is also a favor to your family, your community and your clients.",
    "reactions": 20,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1085198773589917708",
    "author": "popaganda.",
    "date": "2023-03-14",
    "content": "Also remember/understand that the fear of not making it can quickly switch to the overwhelming weight of being expected to be excellent all the time. At the end of the day we need to take care of ourselves and each other, no matter where we are in the game.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1123381683694088264",
    "author": "austenballard",
    "date": "2023-06-27",
    "content": "W is that my DMs are full of people who want me to work for them after a weekend of stressing about having no work\n\nL is they all want me to work for them for free or close to it 🙃",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1304854268188033056",
    "author": "BatMeckley",
    "date": "2024-11-09",
    "content": "I wish I had the same anxiety about a 12 year old Grammy I’ve never known about just  randomly showing up on my doorstep and saying it’s mine.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1405972347529461871",
    "author": "cian riordan",
    "date": "2025-08-15",
    "content": "For pushing down and concealing panic, anxiety, anger (& literally any other mental issue) -- there is no better receptacle than the Irish human form.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1238853531776323626",
    "author": "oaklandmatt",
    "date": "2024-05-11",
    "content": "Spotify is the company trying most aggressively to pay people the least. I'm deeply frustrated by this.\n\nI'm going to start using Apple Music to listen and send links and I encourage others to do the same. \n\nIs Apple some charitable organization? No. But at the moment they're not constantly fighting to pay people less.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1262605590446735370",
    "author": "bobby k",
    "date": "2024-07-15",
    "content": "In the midst of a kinda unique side quest at the moment - label pulls me in at an hourly rate with an artist (and good friend) that I’ve mixed for many times because the production sessions were such a mess that they felt like they couldn’t even finish the records until some light mixing and organization took place. Songs spread out between multiple project files, DAWs, laptops…vocals tracked to mp3s with the ~50ms delay thing…Some of these producers templates…brilliant stuff. Saw one vocal travel through maybe 7 or 8 auxes and hit probably 4 different rvox’s along the way. It was like a labyrinth of signal flow that was nearly impossible to follow (and once I deleted half the auxes and waves plugins, it started to come back to life). In short they’re having me un-mix it, hand it back for some more production, then do the final mixes later this year. A true testament to the importance of organization and more importantly minimalist, straight forward session files. I wonder how often this need comes up and how feasible it is to be involved ahead of the handoff as a mixer these days. And before you frown at me for griping, this is an absolutely incredible project, many insanely talented musicians I respect. Very right brained, free flowing group. So it felt cool to be able to play more of a part on the project as the more left brained participant and see the stress relief happen in real time.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1382075608653107244",
    "author": "Slow Hand",
    "date": "2025-06-10",
    "content": "Don't forget; post traumatic stress disorder is now \"spicy déjà vu\".",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1064392580449706004",
    "author": "NoahNeedleman",
    "date": "2023-01-15",
    "content": "We all want our work to be undeniable, but the only way for most of us to get there is to slog through it. \n\nThe music industry has an uncanny ability to burn out the chaff- passing vanity and a belief that somehow you’re special is just not enough to keep you going in the dark times. And most of the times are dark, my friends. \n\nBut the upshot is, most of the folks I came up with that stuck with it are doing really cool shit now. A lot of my heroes have become friends. I’ve done a lot of cool bucket list type shit. And truly it’s not cause I myself am undeniable, it’s cause I slogged through.",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1024771385400234115",
    "author": "Slow Hand",
    "date": "2022-09-28",
    "content": "Hey @everyone. A quick PSA about form on this server: \n\nAs this server becomes more populated the quantity of daily/hourly posts are increasing. This is a great development and we love to see lively, thoughtful conversations. \n\nWith this increase in posting comes a lot of information that can sometimes be overwhelming to manage and parse. Especially when a channel has two different conversations happening on top of each other. I think we've all casually opened the app at one point and seen \"40+ unread messages\" and been taken aback by the sheer amount of convo that we now have to catch up on.\n\nMoving forward I ask the following from everyone:\n\n*1. If you see a conversation starting to ramp up use Discord’s **Create Thread** feature to fork off the conversation into a self-contained thread. (see attached pic)\n2. Give the thread a descriptive name.\n3. Continue all follow-up posts within the new thread.*",
    "reactions": 15,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1046857219918012436",
    "author": "cian riordan",
    "date": "2022-11-28",
    "content": "After spending a week out of town with family celebrating the holiday with family, airports, planes, loud dinners, etc -- it's incredible what a relief it is to come back to a quiet space. I think I take for granted how much of my mental health can be attributed to having the option of real silence on a day to day basis.",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1224023445306605660",
    "author": "cian riordan",
    "date": "2024-03-31",
    "content": "(Only 10-15 yrs of therapy to overcome that one)",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1468639940933062825",
    "author": "hyanrarvey",
    "date": "2026-02-04",
    "content": "When imposter syndrome is telling you that u suck but you can’t hear it CUZ UR BOOKED",
    "reactions": 15,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079224655275106394",
    "author": "BatMeckley",
    "date": "2023-02-25",
    "content": "I feel like virtually all of us are dealing with mental health issues in one way or the other. For me, getting out of my own way is not over analyzing every step I take and re-litigating every mix decision to the point where I end up only releasing a handful of songs every few years.  At some point, no matter what our individual issues are, we have to log off the internet and actually make music instead of constantly talking about all of the individual reasons why we can’t. Sometimes, at least in my case, we get analysis paralysis because it’s easier than actually hitting record and just doing the damn thing. There was this meme going around last week that was something along the line of “oh hey task that only took me 15 minutes but I’ve been putting off for 5 months”. I think we can all get caught up in bathing in the 58 reasons why we can’t do something instead of just locking on to the few reasons we can, because it’s safer to live in our potential than our actual.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1229866268174319687",
    "author": "cian riordan",
    "date": "2024-04-16",
    "content": "\"Sorry about the late night duplicate file, I did this track after six other people because I'm rushing as a team player.   I delivered as promised up front as we are all in overtime now to make it great.  *CLIENT* is happy with your work and with mine and we are all working overtime together.   Apologies also, I know there were some annoying ticks in there with some of the revised files. Still not sure why this one session did that. \n\nOf course I don't listen to every single file, post rendering.   We render and send 500-1000 files a month with the revisions on the 200-300 monthly songs that I do.  Team players don't ask such things on CC.  I work usually 7 days a week for 40-50 people a month, and making them happy with great masters is job #1.  Perfectionism is not a part of that process.    Software makes mistake, and that's ok.    People make mistakes and that's ok.   Mixes and masters should never aim for perfect, they should aim to connect, aim for humanity.  \n\nPerfection is not the goal here, it's musicality and teamwork.  I'm sorry your ears suffered that horrible popping, but please, be cool. \"",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1468658306938831012",
    "author": "oaklandmatt",
    "date": "2026-02-04",
    "content": "Imposter syndrome is normal and good. \n\nJust accept it and realize that some anxiety about your abilities will continue to push you to do better work.\n\nFind mental health strategies so it doesn't drive you insane.\n\nPeople who always think they're great or have it all figured out never improve and generally start to make shitty work quickly.",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1468708885253587139",
    "author": "bobby k",
    "date": "2026-02-04",
    "content": "You just need to be worse at something and channel the imposter syndrome there. Kudos to you on picking up chess",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1343267774172102698",
    "author": "cian riordan",
    "date": "2025-02-23",
    "content": "If I didn’t see colt capperune plant the seeds of self care by not drinking 20 mountain dews and eating a double heart attack burger everyday, how would I know how to start taking care of myself?",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1343394333658841088",
    "author": "BatMeckley",
    "date": "2025-02-23",
    "content": "I think the line for me is “is this person someone  who makes records I care about, who also happens to make content?” Vs “does this person make content, and also happens to make records”. Both sides can have decent advice, but I’m far more likely to prioritize the information coming from the person I can verify has actually done music that I actually like and or respect. Just because someone talks loudly or with confidence, doesn’t mean their take has any value. (Online discourse 101)",
    "reactions": 13,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1123385592701526066",
    "author": "Adam Thein",
    "date": "2023-06-27",
    "content": "This work feels like a constant bounce between being stressed about not having enough work to be stressed about having too much work",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063372520687947826",
    "author": "Ross Fortune",
    "date": "2023-01-13",
    "content": "I happily worked from home for two solid years, very focused and disciplined. I was doing maybe 2-7 days a month engineering in commercial studios as well, so that kept my *being in the room with people and making shit happen in the moment* side satisfied.\n\nIn terms of getting work done, home was great, I had more time to use exercising and cooking. Moving to a mix room away from home turned out to have a much greater positive effect on my mental health than I thought though, and now I don’t know if I could go back. It’s really helped me separate work from life (even though I still routinely wake up thinking about work), and I much prefer co-writing there as it’s a real sanctuary.\n\nFinance-wise, it’s certainly taking a chunk. The dream longer term is to have an amazing, amazing shed in a back garden, within commutable distance to London/major music hub… just like everyone else in their 30s here.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1209215455030677514",
    "author": "Slow Hand",
    "date": "2024-02-19",
    "content": "Thank you. It took me a long time to have the confidence to feel assured of my aspirations. In some sense, that aspiration is to be among old men who sit outside a cafe with their friends every day and savor the world. There are so many cultural signals pressuring us to be something more than that. Everything is telling us we're not there yet, but in the last few years my attention is focused on being happy with the things that I have before me. Because those things are enough and they are endlessly fascinating if you take the time to savor them.",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1428115482879197396",
    "author": "NoahNeedleman",
    "date": "2025-10-15",
    "content": "Judging by my close friends (and spouse) you’d think mine was General Anxiety",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063944165441941594",
    "author": "BatMeckley",
    "date": "2023-01-14",
    "content": "The danger is it ends up like every other gearspace or thegearpage where all the guys that actually do the thing leave because of all the dentists going “DISTRESSORS SUCK” because they couldn’t get a song they liked out of one.\n\nI legitimately don’t know how to strike that balance, because the whole point of a place like this is the proliferation of good ideas and accurate information, and that can come from anyone regardless of their experience.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079204238338568283",
    "author": "oaklandmatt",
    "date": "2023-02-25",
    "content": "Your brain has all these wonderful ways of avoiding difficult things. This is because if you dealt with them all at once, it would overwhelm you. So the brain builds all these mechanisms and habits to help you survive. Therapy, meditation, self reflection, but most importantly *other people that you trust and can be vulnerable around* can help you get through barriers that your own brain has created",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1201277622617899068",
    "author": "chrissorem",
    "date": "2024-01-28",
    "content": "Possibly, I’ve encountered far more people that make the record making process about them. “My process” is a cringe word for me.  When your skill set gets to a certain level  people will let you know by either continuing to hire you or physically tell you what your strengths are. And your strengths are probably what you are most passionate about and what you put the most care towards. I’m not sure I see any benefit in sitting around and thinking about what yours strengths are. Rather be present pay attention  and learn how to be proactive and supportive to the artist you are working with. The combination will lead you working more. And your strengths will grow with time. I do understand some people lack confidence and for me I’ve become more confident with experience and success",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1213625987154317402",
    "author": "cian riordan",
    "date": "2024-03-02",
    "content": "I guess the point I’m trying to make is that it takes a long time to have the experience and confidence to “know” something is a bad idea. You’ve got reps and the plaques to back it up. But my message to my 22-yr-old, know-it-all, I’m-better-than-everyone self is: you don’t know yet. Take the ride. Take a chance. Be open to things you “know” are bad. It’ll get you to a 58 yr old Matt Beckley’s confidence and skill set faster.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1381834997132038145",
    "author": "cian riordan",
    "date": "2025-06-09",
    "content": "In the studio, this was like getting a golden ticket. It turns out, there’s no shortcut to greatness. You have to put in the work. Want to get a great drum sound? Do the work. Pick out the right drums. Spend time tuning them. Put them in the right place in the room. Try different places in the room. Try different drums. Setup some microphones. Listen. Adjust. Move the microphones. Maybe change the drums. Maybe change the microphones. Maybe they don't sound good because the part isn’t right? Maybe it's something else in the arrangement? Take it out. Try it. \n\nThis takes quite a bit of motivation to get this deep in the weeds. But the results? Well, they were always unquestionably great. Could it have been fine with less work? Maybe. But you’d never know. And nobody is going to care about this record more than you are.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "958061872140148826",
    "author": "Rollmottle",
    "date": "2022-03-28",
    "content": "I have a career-level day job and have always viewed myself as an outsider as it relates to the industry. I have a deep passion and commitment to music and my day job allows me to pursue it the way I’ve always envisioned it. I am not in a position life-wise to financially struggle through finding my footing in the industry as a full-time pursuit, but I take it as seriously as if I had to. The practice of mastering, the way I envision it, is fucking expensive and my day job allows me to do it the way I see it. And like others, it allows me to choose the projects I wish to engage with and put out a quality product that aligns with my values. \n\nI struggle with imposter syndrome being an “outsider” but that’s never not been a thing for me as a creative. Just comes with the territory.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033179104876437624",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "I meet a lot of young kids who think music is a way to gain status and if that’s your motivation you are mostly in for a bad time",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1292591020504252446",
    "author": "BatMeckley",
    "date": "2024-10-06",
    "content": "It’s tricky, it’s a bit how I was saying the old head front of house guy was probably underselling his knowledge. \n\nThere is a friend of mine that’s\nworked on some massive records, and they did a bunch of interviews and tik toks about all of the work and automation and plugins and processing that it took to make the record sound great, and while they work a ton, it always struck me that if I was the artist I would be hesitant to work with such a “look how responsible _I_ am for the end product” producer. \n\nI’ve always tried to come from the perspective of whenever I’m asked about a record I’ve worked on with “man, the artist just sounds like that in the room, I was just lucky to be there and try and capture the magic” \n\nIt’s not an apples to apples comparison with Rubin, but benefit of the doubt style MAYBE there’s a bit of that in there? I’ve always thought the kids just want to believe the person on the poster is the genius. They don’t need to know an 40 yo married couple wrote Sk8r Boi.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1317589147401064518",
    "author": "BatMeckley",
    "date": "2024-12-14",
    "content": "Couple ways I see this:\n1) art is never completed, merely abandoned.\n\n2) no one is actually a perfectionist, as evidence by nothing they have done is perfect. Guaranteed.\n\n3) I think it is far more comforting to judge our work by the potential, vs the actual. When you actually release a piece of work it is now out there to be consumed, enjoyed, criticized, evaluated. It’s so much easier to just have this amorphous concept of an in progress piece of work, because it can be as grand and as loved as you can imagine in your head.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "870396269888167996",
    "author": "Zakhiggins",
    "date": "2021-07-29",
    "content": "Found a cheap flight and went to Morocco on a whim for the last 2 weeks. Didn't bring anything music related, not even headphones. Came back home and spotted exactly the problems that I was stressing over with some songs I was working on.\nFeel really inspired to make music. \nMoral of the story is breaks can be really good lol",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1063194707431276586",
    "author": "cian riordan",
    "date": "2023-01-12",
    "content": "Buying a house has been the best financial decision we've ever made. We've parlayed our first house purchase into our latest home and the amount of equity we have is crazy. That being said, I found the mortgage process more anxiety inducing than the house. If you can, get your pre-approval underwritten so then your offer is basically as good as cash.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1116857960786833480",
    "author": "Deleted User",
    "date": "2023-06-09",
    "content": "what are some things that you’ve been wanting to do outside of work life? \n\nI feel like the idea of “break” can look and feel different to many people, and I think the key is to find what version of those variations give you the most peace of mind and self acceptance. \n\nPersonally, I have a few tendencies and mindsets around break that self-sabotages. things I listed below help me fight the self-sabotaging\n\n1) going armadillo- when in extreme overwhelming state, you gotta find a way to get out of that. I get overwhelmed very easily, so I find that this is often needed. BUT, if you’re gonna go armadillo, then you wanna really commit to it until you feel a bit calmer and collected. Which leads to the next point \n\n2) sometimes I lie to myself that I’m taking a break but do a few spurts of work because I feel useless not doing work. I’ve learned that this needs to be avoided or else the “break” will be extended into a longer period of time, and I’d be doing little work here and there but also not get anything done properly. It takes a bit of commitment to take a proper break, and in order  to be able to commit to it - recognizing it as a part of maintenance routine to stay well functioning is really important in my experience. I am pretty bad at pacing myself and managing my own mental and physical wellness, so I am working towards being able to put the brake on early enough so that I don’t crash or skid away into a crash 😂\n\n3) to deal with that feeling of feeling useless, I found that doing things that I wanted to do can help once I have gotten calmer by being in armadillo state for a bit. Getting straight back to work from here for me is extremely difficult, so I start with the combination of taking care of chores that got backed up from busy life and doing what I desire outside of work life. Could be trying a new restaurant, picking up a new hobby or getting back to the hobby that gone on hold due to work life",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125306737885462558",
    "author": "Andy Lawson",
    "date": "2023-07-02",
    "content": "just taking a break from a mix.. i missed a lot.. the only thing i know is the harder i have worked, the better the industry has been to me.. i started with nothing,  zero $$$$ in my bank account (i did have a photocopied version of the pro tools manual),zero skills, zero training (apart from listening to every song i could)living in a tiny share house room with no windows. but i've slogged and slogged. i've always wanted to be the best at what i do and i carry that with me daily. am i the best, absolutely not. but everyday i go into battle and try to believe i am or want to kick someone else's ass.. it's got me to the point where i bought a house and support my family. i think without that mindset i would have given up on this job years ago. The industry does not play fair and never will, but i firmly believe you can play fair. i've never tried to steal a job from a friend, sneak my way into something. i've just tried to be open and honest with my clients and peers. that's my word vommit on reading above.. lol.... Workhard, Think big, Enjoy! that's all we've got",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1145079151292854303",
    "author": "Nomograph Mastering",
    "date": "2023-08-26",
    "content": "Gallagher has the paradox of making music on lock - we need a reverence for it, and a fuck it  attitude at the same time. We need profound self confidence and deep lads at the pub level pisstake humility at the same time. We need technical excellence and freedom from it at the same time…",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293252692432650241",
    "author": "BatMeckley",
    "date": "2024-10-08",
    "content": "If anything, I appreciate the confidence with which this take is delivered.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1374408617910079608",
    "author": "Nomograph Mastering",
    "date": "2025-05-20",
    "content": "Perfectionism lives right next to caring a *lot*",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1457148160299368754",
    "author": "Zakhiggins",
    "date": "2026-01-03",
    "content": "- Staying the fuck away from people who complain too much\n\n- Reminding myself daily why what i do matters\n\n- Reminding myself daily the consequences of giving up",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1457860082795679988",
    "author": "Berlin",
    "date": "2026-01-05",
    "content": "I found last year really focusing on a morning routine for myself (self care, if you will) helped me to stay positive. At least I am taking care of myself first and that is all something I can control. Then I can take on the variables and unknowns of the day. Makes for a late start for me now (to which, I'm still adjusting)... but I feel fully ready to face the day every day. Nothing in the back of my mind lingering, letting myself down.. \n\nAdditionally I have let my self imposed work hours go, just freeing myself to be open to the art life as it comes, any hours of the day. Trying to bottle everything into a 9-5 was difficult for me.. why are artists calling me at 9pm? Well.. that's when they are off from their day job and can talk. I took that boundary away for myself and felt some self imposed frustration melt away. Grateful for the calls, emails, texts, DMs.. any hours. Bring it on. \n\nBoth of these changes have helped my attitude and optimism AND HOPE of a future in music and art.. Continuing this on into 2026.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "958058087854538842",
    "author": "Slow Hand",
    "date": "2022-03-28",
    "content": "After a decade of performing, touring, and doing production work (and stressing about financial insecurity through much of it) I started an unrelated business with a partner four years ago.\n\nThis has turned out to be the right choice for me because it relieves the financial stresses and insecurities and (much like @kidcutler) it allows me to cherry pick the gigs that I want to do.\n\nFor a while, making a living on music was a point of pride (or shame when it was not going well). I've always felt a tension between the work that I wanted to create and it's commercial viability. So finding an alternate path to support myself has taken a huge cognitive load off of me and given me the independence to relax and (consequently) better fund my music ventures and enjoy the process again.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1197455369081995264",
    "author": "Zack Hames",
    "date": "2024-01-18",
    "content": "Taking a break is part of the work.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1273908289671008256",
    "author": "Chad Rodgers",
    "date": "2024-08-16",
    "content": "Still feel relatively new having only joined at the back end of 2023 but it’s fucking NUTS how much I feel like I’ve progressed since being here.\n\nThe generosity of time and spirit from so many of you is what makes it so distinct as a community. No barriers, no snobbery, just openness, a love for exploring new things and a feverish spirit to make the best shit possible. I’ve already made some good buds on here too which makes it even better. \n\nThank you @oaklandmatt, mods and all the other contributors for all of it including those who are in my DMs with wisdom and advice.\n\nPS I’m going full-time in 2 weeks with my music work and a large part of my confidence in doing so has come from the crew on here. Big love to all of you and long may it continue.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1309183007051223123",
    "author": "montrose recording",
    "date": "2024-11-21",
    "content": "public thanking to this discord / @cian riordan for hipping me to teamviewer.  the joy and lack of stress of hitting some minor revisions on this family trip is hard to put into words.  🙏🏻 🙏🏻 🙏🏻",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407263982758395986",
    "author": "itaylerner",
    "date": "2025-08-19",
    "content": "Been with my partner for 9 years and ….yes. lol. This resonates a lot and there’s So much to unpack! Here’s my experience- user experience will vary. The biggest unlocks for me have been not seeing her frustration or lack of enthusiasm as an inconvenient issue that I have to deal with, but rather as a valid fear and a hurt that someone I love is asking for support with. When I get busy and she gets mad, it’s because, historically, my business and fun big opportunities have meant she was going to have a lot of domestic labor and an overwhelming amount of loneliness to deal with. So now when I have a busy time coming up, I meal prep beforehand, I clean the house beforehand, I acknowledge that it’s hard for her, I express tons of gratitude, and I always plan to block out some dedicated alone time for us afterwards. Anything to show that I understand the concessions that she’s making and make my own big efforts to foresee what that means from her and minimize the negative consequences it could have. Maybe even make it something we can both look forward to. Not sure if that’s relevant at all for your circumstances but that’s some of the stuff that’s helped my home life become much more peaceful.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1463271785494478911",
    "author": "oaklandmatt",
    "date": "2026-01-20",
    "content": "Talk to your therapist and learn to accept love?",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1464501046910124255",
    "author": "jantrit",
    "date": "2026-01-23",
    "content": "Never, I did almost every session for the first two/three years, as I was figuring it out. Always thinking “you’re a shitty engineer why did you think you can do this” and then something clicked. \n\nI always go back to the “if my 12 year old self could see me now” school of thought and he would be stoked, I fucking made it, I’m living the dream. \n\nYeah days are hard, hours are long and sometimes that makes it’s tough, burn out is a real thing. Feels like I’m just in a position to start finding a work life balance. \nAt the end of the day a bad day in the studio is better than a good day most other places.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1468085894597837044",
    "author": "Berlin",
    "date": "2026-02-02",
    "content": "really frustrated by megaupload guys any thoughts",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "926989637363302451",
    "author": "oaklandmatt",
    "date": "2022-01-01",
    "content": "relax more. stress less. realize most of the things that i'm anxious about won't happen. focus more on making things that i really enjoy",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1092599467456339968",
    "author": "masteredbyjack",
    "date": "2023-04-03",
    "content": "I’d like to know why Ruairi thinks people come to him. Taste, sure. But I also think he has a very interesting, not center of bell curve ear and it seems to be winning. But he has mentioned many setbacks before, how he leverages that and his unique experiences.\n\nSeems to be paying off, and it’s awesome. But I think a lot of people could use someone’a advice on how to double down, and specifically what to do to recognize what to double down on (which takes a lot of self awareness and confidence). Just wonder where he’s at with it all, if he thinks actively about that, and what his conclusions are. Feels like he’s hit another level here recently!",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1108792322516340756",
    "author": "spectrummasters",
    "date": "2023-05-18",
    "content": "@Rollmottle went deep . 🔥 i d look for the core of their motivation to be built in knowing success isn’t arriving at the pot at the end of the rainbow 🌈 it’s enjoying the mission to find it . The pot is only a possible bonus . Ie , we define our own success and it’s not for others to tell us when we have succeeded . If you love your art/ craft and it keeps you on a good path in life , bringing goodness into others lives …..that’s success . Monetising it then just becomes a strategy . Work hard , love the shit out of it and be proud of your work or get the hell out the kitchen",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1129561442539032726",
    "author": "NoahNeedleman",
    "date": "2023-07-14",
    "content": "Also being busy let’s your clients know that you’re in demand. But communicating that with joy instead of stress is key. When something high profile gets dropped on me and I have to push a project back, telling the clients about what i’m working on often makes them feel more special, not less.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1173313769812803594",
    "author": "Nomograph Mastering",
    "date": "2023-11-12",
    "content": "Even my multimeter is feeling the stress guys, modern life is a lot",
    "reactions": 6,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1269149351989477428",
    "author": "oaklandmatt",
    "date": "2024-08-02",
    "content": "Yeah it's no stress. Like I said, I deleted mine too. There's probably a few from earlier today that could be deleted.\n\nWe're all in this together, trying figure it out! ❤️",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1344357232552312903",
    "author": "BatMeckley",
    "date": "2025-02-26",
    "content": "I love this perspective, but to me it shifts the topic from how we feel about ourselves (which is in our control)  to what other people feel about us (which is not).\n\nSure, someone might have been dealt a poor hand. But is the answer to then just give up, because people will understand? There’s a saying in therapy that goes “it’s not my fault, but it is my responsibility”. I’d rather work to change my poor situation than feel the satisfaction of someone justifying it.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "882624389756096532",
    "author": "Josh",
    "date": "2021-09-01",
    "content": "*anxiety resurfaces*",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "998598940373024799",
    "author": "Eric Martin",
    "date": "2022-07-18",
    "content": "I agree that they respond VERY similarly, but I can sell my two used Distressor’s for at least $2K, good luck evening finding someone to buy your license of the software for a quarter of what you paid.\n\nI consider software consumable, it has almost zero resale value.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1007162950898962533",
    "author": "Slow Hand",
    "date": "2022-08-10",
    "content": "**Opinion: **Online record reviews without an embedded copy of the song or album to play should be heavily discouraged.\n\n9/10 times I'm not interested in what the writer has to say until I listen. I just want to hear the record that they thought was worth writing 1,000 words about.\n\nWhywhywhywhywhy in this modern age can't we hear the record that's being promoted? Is it a rights thing?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1065547853830828062",
    "author": "Barbara",
    "date": "2023-01-19",
    "content": "I have to let you know my first experience with this. Been working on an album that I recorded one year ago. Recording took us 7 days and they still needed to add synths and bass fot some of the songs after that (side note: the production wasn't finished by the time we tracked, so I edited everything I had - 10 songs, none of them with less than 5 minutes. It was the band's first time in the studio, also, and had to edit lots of drums and bass stuff). After doing a first pass, I sent them the multitracks they asked for, to track the rest of their stuff with their producer (a colleague of mine). The next 8 months were spent waiting on their files to start mixing (this was supposed to last 1/2 months, max). When I finally got the files, you have no ideia how messy the project turned out (track names, bounce mistakes, ultrapocessed tracks with artifacts - even the ones we've tracked at the studio before, audible edit points,... all you can imagine going wrong at this point), so it took me a bunch of time to organize everything in a way that I could work with what I've got (going back and forth asking the producer for some files that didn't even get to me or asking if there was the possibility to get some of the tracks dry, without processing or fx - keep this in mind).\n\nNeedless to say, when I was ready to start mixing, I was already overwhelmed and tired of it, and I knew I still had a long way to go...\n\nFirst version took me probably too long to get right (2 months, approx., working on other projects that got scheduled on those 8 months) and I've sent it before I went on a few days vacation.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1070111492344655882",
    "author": "Slow Hand",
    "date": "2023-01-31",
    "content": "Came across a stimulating quote recently that I thought was illuminating. The person said the following (paraphrasing):\n\n> \"The definition of a nerd is someone who thinks conversation is for peer-reviewing ideas. What do non-nerds think it's for? Negotiating alignment.\"\n\nSimply based on the way I've framed this question, it's probably pretty clear that I belong to the \"peer-reviewing ideas\" school of thought (mostly). I love to throw stuff out there, even if I don't believe it. I want to stress test it.\n\nI can certainly appreciate conversation as a tool for aligning people on a belief or course of action, but it's got me wondering about how many of us are playing completely different games when we're having a conversation, and what other games are there? Do y'all think differently?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1074444246884556852",
    "author": "LAPhill",
    "date": "2023-02-12",
    "content": "I’ve tried hiring an assistant for myself, but it’s been a challenge to find someone who understands that things like typos on file names or a bad fade are an indication that they’re not ready for more responsibility. And that those things = eroded trust and confidence. And without those, they’re not making life easier and therefor there is no reason to keep them around.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1075780340175613982",
    "author": "hyanrarvey",
    "date": "2023-02-16",
    "content": "Austen your posts give me slightl anxiety",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079131260372402186",
    "author": "BatMeckley",
    "date": "2023-02-25",
    "content": "Thank you for the kind words, genuinely, but I would hope you would read it as “no matter how far we’ve come, there’s always room to learn and improve, and that actually puts us all in the same boat.” EVERYONE has imposter syndrome and/or questions their work, so don’t beat yourself up too bad when you’re not satisfied with what you’re working on. \n\nAlso, that record was mixed on those jbl room correcting speakers (with that nonsense turned off) in an old apartment dining room. But… through one of the first apogee symphonies 😂 balancing it all out. \n\nAlso, im pretty sure I was running mixes out one channel at a time through my TG channel and printing them back in lightly touching the eq cause I thought they sounded better that way.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1125236349868462080",
    "author": "LAPhill",
    "date": "2023-07-02",
    "content": "It’s no longer enough to do any job, at least in the music industry, and expect to be paid anything at all. We get paid not for the job being done, but for problem solving, psychotherapy, vibe, perspective and taste. And what that’s worth is dependent equally on what you have to offer and what someone else resonates with.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1130192912697806878",
    "author": "BatMeckley",
    "date": "2023-07-16",
    "content": "It’s just an entirely different product, and entirely different type of people on the spectrum that make it.\n\nI don’t want to assume too much about any particular software business but I assume you’re building software to solve a problem. There’s a right and a wrong way to do it, and a price to come in at. (These rivets will hold up under this amount of stress up against this material so your plane doesn’t fall out of the sky). With music and production, the goal is a lot more amorphous, especially outside of pure radio pop production (I’ve already beaten that horse dead here.) The concepts of done and value are much harder to define because it’s in the eye of the beholder. \n\nThen, there’s the specific people. Most people that are in software or data management didn’t grow up going “I WANNA BE IN DATA MANAGEMENT”. They fell in to the field because they had an aptitude for it, were good at numbers, and it was a good way to make money so they can pursue their passion outside their job. With musicians, they specifically ran from that kind of life, the music IS the passion. A guy like cian or Noah could make a factor of 10 time more money in another field, but the emotional value they get from their work supersedes that.\n\nIt’s just chalk and cheese.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1150541917394837574",
    "author": "chrissorem",
    "date": "2023-09-10",
    "content": "I’m assuming you got that tree removed? I’m actually taking a break from interns. Any idea what they’d like to do? Produce, enginner mix ? All of the above ?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1191803865234935949",
    "author": "Josh",
    "date": "2024-01-02",
    "content": "What does winning look like, I’ve talked about this a lot with fiancé this year as we’re both sort of in the same spots in our careers, where we finally know what it takes to compete, and we have to figure out where to go next and continue to grow. And winning in my book is mostly having a home where we can create freely and not have to stress (as much) over income.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1208515407078625362",
    "author": "jonmatteson",
    "date": "2024-02-17",
    "content": "This is great and reassuring to hear. I am in exactly this situation and after years of trying to build a portfolio I am now focusing more time on developing my sound and style and letting more things happen naturally as a result. I also recently got a therapist for the first time who is helping work through things in my past that have held me back in creative situations which has been immensely helpful so far. We have to have something to attract other collaborators more than just a portfolio. Thanks for the reminder!",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1225552271606022215",
    "author": "BatMeckley",
    "date": "2024-04-04",
    "content": "Jess is an example of one of those drummers that just gets it. She’s super musical, hits with the force of 10 Cians, is rock solid in the pocket and never overplays, not because she doesn’t have the chops but because she DOES have the taste.\n\nAs a guitar player certain drummers are just really confidence inspiring to stand in front of and she’s near the top of my list of people I’ve gotten to play with. Big fan.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268462637583306828",
    "author": "Nomograph Mastering",
    "date": "2024-07-31",
    "content": "Again so much of that blame/anxiety/fear etc comes from attachment to the outcome. “If the high end sounds like this what will people think?”",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1277311270391124040",
    "author": "sethearnest",
    "date": "2024-08-25",
    "content": "Does a balance need to be struck? Tell the truth of the situation -- a given person's motivation/confidence being or not being undermined will persist either direction over time. They'll soon enough meet the wall of Reality into which every one of us is continually smashed. And their intrinsic level of motivation/confidence will handle it or it won't. \n\nYou tell a 12yo talented niece she can't be a professional singer, and she'll internally respond with either, \"Oh...that's sad...I would've loved to do that,\" or she'll respond with some variation of \"Efffffff that...I'm gonna' change the world,\" and then she might. 99% won't, but that attitude is table stakes for that 1% that we're all shooting for here. \n\nThe latter response will happen no matter *what* is told to a given person with a high level of self-motivation. Giving the truth of the difficulties seems to only help by giving the motivated person more navigational wisdom.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1344385734429380708",
    "author": "kieronmenzies",
    "date": "2025-02-26",
    "content": "Hey this has been a fun discussion to read through. Just to add one more angle to the mix: most of you have been referring to agency as some kind of positive trait that you either have or you don’t have it — almost commodifying it. What if we think of agency, or the qualities of having agency no matter what term we use, as the norm? As in EVERYONE has it. And whether or not we are able to fulfill those qualities and/or desires is due to limiting factors, whether they are external forces (class system, institutional racism, gender discrimination, war, peer pressure, financial hardship, lack of resources, etc) or internal struggles (fear, self-doubt, depression, addiction, laziness, inner saboteur, etc) or any combination thereof. I know it’s totally idealistic but maybe if we’re able to think of everyone as being just as capable as the next -- instead of an “either-you-got-it-or-you-don’t” kind of way, especially in terms of “agency” which sounds like a corporate buzzword du jour -- then we’d be able to focus on and address the aspects of our societal constructs and daily lives that restrict our opportunities to succeed/work/create/thrive/survive/exist.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1345167050800369707",
    "author": "masteredbyjack",
    "date": "2025-02-28",
    "content": "As a former (what I would call pretty high level) athlete, I actually think about this thing very intently with regards to working on records and draw from things from the past life. Mine is more focused on how I want to hear (or rather deeply understand how I'm hearing) every day as close to consistent as possible, given we are human of course.\n\nMy 2 cents (which of course is just my experience): \n\nSome sort of routine before you work. Mine is that I wake up almost exactly at the same time every day, will work out at similar times (if possible), literally eat the same thing basically every day before during the work day, coffee at similar times, have  the same routine when I sit down to start work. Not all of that is possible or useful for everyone, but I think we can all find something that would focus us in a way that's useful and ablet to be put into practice for us.\n\nTruly I find it helps a lot. We are physical beings, how our systems and bodies interact can definitely matter, especially in our ability to be available to the music.\n\nThat said, sometimes things happen and you gotta go. You will be tired, stressed, whatever. You have to do excellent work under those conditions too, it might be the most important skill if we are being honest about making a career of this. So training specifically for when you feel rough is definitely something I personally find important.  Which is where physically training helps, it's a way to force yourself into (fake) adversity and train response\n\n@Slow Hand I know you know all this, just my experience",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1369332280719441970",
    "author": "chrissorem",
    "date": "2025-05-06",
    "content": "I struggled to find a pen as my nerves overwhelmed me in the moment of getting a call from such greatness. Luckily with the power of a super joint I was able to retain all this information to pass on to the Cord!",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1395240319083221003",
    "author": "Gabriel Tyranny",
    "date": "2025-07-16",
    "content": "Awhile ago I posted about financial stresses, and I wanted to follow up saying thank you to everyone that gave kind words, and the deal went through so everything has been financially taken care of and I’m good to focus on my album during Q3.\n\nFor real, thank you so much to everyone who talked me through that low point, and I appreciate this space.\n\n❤️",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407755445527117854",
    "author": "hyanrarvey",
    "date": "2025-08-20",
    "content": "Yo speaking on what @Nomograph Mastering said a few days about staying cool…we have a producer in and so the whole room is a giant mess (like most studios are when they are locked out) and we sold an amp and we wanted to make profiles/name of it before it went out the door \n\nSo the patchbay is a huge mess and I hooked up all the routing and wasn’t getting signal and I started to lose my cool and got super frustrated, Rick calmed me down and we worked out what problem was (I forgot I was feeding the the amp from the di multed on the patchbay instead of feeding it from the converter to run tones..) and after I got cooled down it clicked on why I wasnmt getting signal.\n\n\n\nIt’s extremely difficult to not get frustrated when trouble shooting and not get overwhelmed by a full patchbay but if you just take a second and breathe/calm down and start reversing your signal flow you’ll find the culprit and move on\n\n\n\n\nLong story short as an engineer you gotta be the calmest one in the room",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "819736860799926313",
    "author": "Slow Hand",
    "date": "2021-03-11",
    "content": "Oh yeah. I co-own and manage a general contracting company. At this point I probably work 12 hours a week and spend the rest of the time doing production and writing with others. For years I gigged, toured, and was constantly stressed out about making ends meet, so I saw an opportunity and decided to move laterally and start a business with my partner where I could manage and still focus on music. It's been a positive move for me. I'm making a decent living and I no longer have that stress hanging over me. At this point I mostly do whatever I want to.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843241269764292628",
    "author": "Zakhiggins",
    "date": "2021-05-15",
    "content": "Setting an achievable long term exercise goal and making a plan on how you'll get there is a major key for getting into and keeping you exercising. And doing stuff that isn't boring too.\nI've always found doing a little often is way more valuable than doing 1 really intense workout here and there. (this is relevant for progression in any kind of physical activity too, and progression matters because its what will keep you interested long term)\nEating well and sleeping enough is also a major key. I know this is really simple stuff but If you make a habit of these things and stay consistent, you'll notice drastic improvements in physical and mental health, and you won't ever feel like exercise is a chore.\n\nIf there's one topic that I actually know a lot about, even down to a deep scientific level, it'd be this sorta stuff, so feel free to hmu with any qs whenever lol",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "908352306838401054",
    "author": "oaklandmatt",
    "date": "2021-11-11",
    "content": "@Slow Hand i never hide and i turn it off on any studio computer that has hiding enabled 😂. i think there's something about my brain that doesn't want to see animation when my cursor is flying around. i prefer things to be static. i never notice the icons at the bottom of the screen. i guess i'm giving up a tiny amount of space, but also because i'm often flipping between programs it's nice to see what'a active.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1023998177373851829",
    "author": "ALXCPH",
    "date": "2022-09-26",
    "content": "I Think people lift their noses at shows like these, not to look Down on contestants. But more so the premis of the show.  The over production, the false reactions, the comments from the hosts/judges. The whole over-dramatisation that a lot of us can see right through. Also the fact that it is a contest because of “music ain’t a contest dude, it’s art✌️”. \n\nI think that the comparison to McDonalds is good, not because it is fast food or “low quality” or whatever, but because it’s not a food business. It’s a real estate business that uses food as a by-product(you know what I mean). These programs are just “reality” shows using music as a by product.\n\nSure there are some good meals, but I’m sure some chefs would up their nose at people who think McDonald’s defines the culinary experience as a whole. The same way a lot of Music people May feel misinterpreted by people who’s only intake of music is through these programs. \n\n\nSorry rant over, was just a long stream of thought that came as I wrote it 😅 \n\nMy fave to come out of one of those programs is probably Harry Styles. He keeps impressing the further he goes in his career! 😇",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1031760944864428034",
    "author": "Slow Hand",
    "date": "2022-10-17",
    "content": "It's funny how often old aphorisms get turned around and stripped of their original meaning.\n\nThe saying \"You can't have your cake and eat it too\" always frustrated me because it doesn't make any sense. So one day I looked it up and it turns out that the original saying is actually \"You can't *eat* your cake and have it too.\" which is far more coherent.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1061644119677612042",
    "author": "Ross Fortune",
    "date": "2023-01-08",
    "content": "I don’t think anything of anyone else, but looking back I see that I myself used a degree of chaos as a means to avoid confronting mental health issues and their causes.\n\nUltimately it did nothing positive for me at that time. But it did build to a huge wake up that very dramatically sharpened my focus coming out of my 20s and going into my 30s.\n\nI’ve gotten a lot done since that mindset change, so from my experience, I’d say best avoided if you want good things to happen.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063945404154122301",
    "author": "BatMeckley",
    "date": "2023-01-14",
    "content": "💯, and I’ve already learned so much from here, and made friends for life I probably wouldn’t have met otherwise. And nobody knows what they don’t know, myself included. \n\nBut we also have the case where someone just said they argued with me all day yesterday because they were convinced I had said something I literally had never said (in fact i consistently stressed the opposite), and that conversation takes up the same amount of space as “valuable” information. \n\nThe internet is a wild fucking place man. 😂",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079164884262060144",
    "author": "austenballard",
    "date": "2023-02-25",
    "content": "In most therapy systems, the therapist's role is not to *help* patients as much as provoke the patient to help themselves. You restate, rephrase, reframe, ask questions, but you can't ever fix someone who doesn't want to be fixed. But importantly, you also don't need to be 'fixed' to 'fix' someone else. You just have to be present in the right way.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1097618828818665582",
    "author": "Nomograph Mastering",
    "date": "2023-04-17",
    "content": "I really get the spirit of this but having been up close a lot I can say that if Adele gave 100 people back stage her full self, connected, listened and engaged etc she would be shorting the 40000 people who have paid to see her. Or she would burn out in a week. That level of output is intense, and being “on” for staff and crew is just not an option",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120091105455784077",
    "author": "Rollmottle",
    "date": "2023-06-18",
    "content": "I can say with confidence, once you get the money shored up, something else will come along and worry you. Such is life. As @NoahNeedleman said, best to focus on what matters and try not to let <worry of the day> bog you down.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1123386770231402686",
    "author": "Bryan DiMaio",
    "date": "2023-06-27",
    "content": "Don’t forget the stress of having work so you feel stressed about not doing said work while taking breaks",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1129837861462626305",
    "author": "peterlabberton",
    "date": "2023-07-15",
    "content": "Ok good, I’m glad to hear we’re all equally stressed out 🙂",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1216789301455622214",
    "author": "Rollmottle",
    "date": "2024-03-11",
    "content": "i'd hold onto it at the low interest rate personally. free wealth building, especially with a renter in there. you've described it as a hassle and a source of stress. say more about why?",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1233527922485235712",
    "author": "Edward Rivera",
    "date": "2024-04-26",
    "content": "But I’m not one for “best/better” comparisons. I’m so glad they both have blessed us with beats",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1273806504889290753",
    "author": "cy (sigh)",
    "date": "2024-08-15",
    "content": "this place has been an incredible  soundboard for me. I have a lot of anxiety issues (all diagnosed) and self doubt can be extremely crippling for me. especially trying to find my balance between visual and audio arts. \n\nI've been so much more sure of my decisions both from a sonic standpoint but also when it comes to approachkng the business and the people side of things \n\ny'all have really made me so much more confident in what I do and that I'm actually not wrong for keeping it going - which also spills over to my photo/illus stuff. \n\nthank y'all.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1275036743934017548",
    "author": "Iwan Morgan",
    "date": "2024-08-19",
    "content": "These ideas are useful as a motivational guide and relies solely on self motivation and will suit the auto didactic. However it doesn’t take into account different learning personalities and how people actually learn. I will happily sit and be patient by learning through doing, making notes etc but many, many others do not have that patience and will find different methods to get to the end result.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1301924657582178394",
    "author": "Bryan DiMaio",
    "date": "2024-11-01",
    "content": "I think there’s a free promo on PhaseMistress too!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1358343482653016144",
    "author": "thegreatcarsoni",
    "date": "2025-04-06",
    "content": "Re; notes conversation, got a bunch of notes back on 3 songs I had really strong feelings about during the mix, really invested in it.  and definitely dealt with the instinctive gut anxiety from reading through them. Then I checked discord and MAN did that help my state of mind. Really working on seeing the intention of the notes and being open to achieving that vision rather than taking each note as a critical reflection of my ability and taste haha.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1397692034680098859",
    "author": "peterlabberton",
    "date": "2025-07-23",
    "content": "I’ll bite—I’d been grinding through a patch of not connecting with music, being stressed out, questioning purpose, etc etc.. But took some time away, saw friends and family, came back last week and am psyched to be mixing a nice little EP and doing some revisions on an album before heading out on another (shorter) trip out of town coming up soon. Music and making records is good stuff!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "808503838843338762",
    "author": "Zack Hames",
    "date": "2021-02-08",
    "content": "If the alternative is to back home, I’ll try to offer some advice from personal experience. I moved to Richmond, VA for a year, got a job at a hotel doing audio visual. I quit my first commercial/post production gig doing ads full time. It was the worst but I was determined to keep working in music, and try to get integrated in the scene/studio world. It was a serious low for my mental health, the job was terrible, I was struggling and scraping by without any pay off. To make a long story short, I applied for a job back home at a big corporate company with a full time composition/post production gig, on a whim - I didn’t think it would get me anywhere. 3 months later I got the job and went back home after a year. I was out of the music scene back home at this point, and it took another year of reconnecting and working hard on my craft with friends who were willing to let me record their bands for the price  of drums heads and guitar strings, and honestly, those two things combined with some luck put me in a very secure and creative place, now making records for bands again that are paying decently well to boot. I don’t know how far you are in your career/journey, but I’m barely anything and have been recording for 15 years. It took me 5 years out of school to get barely a living wage and working lots of different types of audio jobs while making records, to get to a comfortable place emotionally, creatively, and financially. I’d bet almost anybody in this discord has a very similar story. It takes a long time and like others have said, there’s no one way to get there. Just keep doing you and trying to work on things that you enjoy.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "819803395333423154",
    "author": "Rollmottle",
    "date": "2021-03-11",
    "content": "I've been a software designer for almost 25 years and still do it. Been running a label, making/releasing music and doing mixing and mastering for that whole time as well. About 3 years ago it clicked that mastering is my thing and decided to spend the last few years dialing in my rig and room around mastering. The job has been able to subsidize what has turned into a parallel career. I have designs on having this be my full time gig at some point, but I'm taking it slow, honing my craft and building my client base and studio while the steady paycheck is there. It's nice to be able to do that without grinding to make ends meet. I realize that is a privileged position to be in so I am grateful. With COVID, I can also crank out masters while I WFH when there's downtime or I need a work break. Some weeks are harder than others from a workload standpoint, but mastering is part of my brain-therapy so I'm happy to take it all on.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "831294535186907176",
    "author": "peterlabberton",
    "date": "2021-04-12",
    "content": "In my experience, the real grind is the many years long road to a sustainable place in your career. So the short-term, super exhausting work all hours of every day and burn out in a year thing is 100% the wrong way to go.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "958512722088165478",
    "author": "Deleted User",
    "date": "2022-03-29",
    "content": "In the Bay Area here and have worked another job since Covid. It’s honestly a dream gig when it comes to production and music. It’s completely remote, no set hours, salary/insurance, and I use Pro Tools for the gig so it’s not completely foreign territory. Every remote gig is different and I realize this situation is a lot of luck and circumstance. Don’t be discouraged to take another gig. I was able to pay off high interest cards and can comfortably afford gear when I want it. I was full time in the studio from age 14-31 no other job. It was a transition, but one I’m glad I made. I’m still working mixing full time as well. I do production if I’m stoked on the project. I work with rock bands for context. Just do dope work try not to compare. Remember there are some people with mountains of gear and dope setups they own. much respect to that. Others have rich parents, high interest credit debt, or both. I told myself if I wasn’t rolling in it with a Grammy at 30 I would stop which is a super dumb mindset. I love making records more than anything and getting another gig allows me to keep doing it. Rant over best of luck to everyone 🤙🏽",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1026558596424667137",
    "author": "BatMeckley",
    "date": "2022-10-03",
    "content": "Yeah I played one of their 335’s that just had the most absurdly good fretwork I’ve ever seen. I think theoretically one of the things you’re supposed to get with the more expensive brands is a consistency… anyone can make a one off great. One of my best strats is a made in Mexico cheapy, but I had to literally play all 14 the store had and one was clearly better. I’ve had new Taylors shipped out on the road to me and they’ve always been sea worthy right out of the box. None have ever been quite as magic as my old man’s mahogany Martin, but none have been as awful as my Martin. That’s kinda what I meant by the prs comparison. You can order one sight unseen and I can almost guarantee it’ll do what it’s supposed to do. Almost never a 10, but never a 6 either. Always right around 7-9 if that makes any sense.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033171988623134740",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "Remember why you make music, and don’t feel ashamed to admit that getting people to the music is important to you (if there’s another thing humans are awful at, it’s not only accepting our ego but reminding ourselves that it’s okay to look out for yours) Just be humble enough to remember (1) that takes tons of time and resources, all of which should be acquired and planned for with great care and time and (2) that the number of people who hear the art you make or even love the art you made won’t ever replace the internal motivation you have for creating it in the first place. If you can remember that, you’ll find a group and a niche where you feel like you exist and you can grow (and we’re really bad at remembering where we started from, we’re programmed to think in the now).",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1042204918641086564",
    "author": "Deleted User",
    "date": "2022-11-15",
    "content": "If you are after money then you are going to end up with a lot of uninspiring gigs because you have to say yes to any and everything. which can lead to burnout and being unhappy of your portfolio",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1058306849591541790",
    "author": "Zack Hames",
    "date": "2022-12-30",
    "content": "This hits close to home, and I’d assume that’s the case for everyone in this discord. A tough balance of imposter syndrome and fake it til you make it, constantly at odds with each other",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1061598324274245683",
    "author": "ALXCPH",
    "date": "2023-01-08",
    "content": "For the kind of chops that your description seems to hint at, i would say it is all about tieing technique to your ears. (Assuming, you can already hum a melody on the spot and are not tone deaf) \n\nI wouldnt worry too much about theory and super correct technique. \n\nThe best Way to get anywhere on an instrument is by Playing it, and doing in consistently. Set some realistic goals and just get going, vocabulary and technique Will come naturally if you just keep Playing. \n\nFuck Playing scales and inversions and all that for now. \nJust go learn a metric ton of songs and melodies and learn to play them together. Do it by Ear. It Will be tough in the beginning, but you Will get very decent quickly if you just do the most important Thing, which is being consistent.\n\nI would reccomend setting a low minimum to do everyday to keep a realistic goal that you can keep, rather than a higher on you miss every now and then. You can always add more practice but it sucks to miss out on it.\n\nStart with song you want to Sound like and then you can slowly branch out when the style become second Nature for you. \n\nSadly there are no tricks or hacks or whatever youtube wants you to beleive to get their clicks. Its all about muscle memory and developing your ears together. And not to Sound like 4 bar loop, but consistency, and do it a lot. I cannot stress that enough. ❤️",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1064639944959721613",
    "author": "youngteam",
    "date": "2023-01-16",
    "content": "taking a break from it. feeling \"uninvited to the party\" lately",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1071874270034149457",
    "author": "spectrummasters",
    "date": "2023-02-05",
    "content": "I suppose some of the remasters are artist/band led though , years later looking back and thinking oh we never mixed that record right that day because roger was fighting with dave and the engineer was miserable with all the stress........so probs a bit of that ? .",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079164121892782171",
    "author": "Deleted User",
    "date": "2023-02-25",
    "content": "That makes me feel less imposter syndrome @Nomograph Mastering @ehutton21 @ALXCPH",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1079207779773984839",
    "author": "Josh",
    "date": "2023-02-25",
    "content": "Like my example isn’t “how do I get out of my own way” meaning my anxiety and ADHD. \n\n“My own way” is referring to me coping by scrolling on social media and not getting out of bed for hours because it’s all too much. And instead doing something else to take control of that self destructive urge.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1088707530471002112",
    "author": "Nomograph Mastering",
    "date": "2023-03-23",
    "content": "Any pro knows we make our critical mastering comparisons on Tik Tok",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1094335144216760330",
    "author": "Slow Hand",
    "date": "2023-04-08",
    "content": "Man. It really fucks me up sometimes when I find out a song I loved was built off the back of another song or was a really seamless sample. At first it feels like having the rug pulled out from beneath me. Then I adjust and I'm back where I started. It's funny cause I don't have any objection to the practice. I think my confidence in the artist is just diminished as in \"Oh, they're not as brilliant as I gave them credit for.\"",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1094420461955330078",
    "author": "Deleted User",
    "date": "2023-04-08",
    "content": "It was a life changing experience, I used to break dance when I was 8 but I’ve never danced after that and eventually developed walls with dancing. But this experience got me in touch with how connected music and dance are. I always had trouble with percussion parts to fill the groove when I’m arranging- I no longer have that problem.\n\nbut not really being a dancer myself- I still feel short of making people move with groove. \n\nHaving communal experience like that weekly was so great for my mental health, and being in servitude playing same rhythm for 30 mins each for people to dance on was a great meditative practice and ego-dropping experience. Also allowed me to discover how much great things can happen within repetition of 1 bar rhythm.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1115698161860739182",
    "author": "LAPhill",
    "date": "2023-06-06",
    "content": "Also, I have been constantly overworked, schedule filled months ahead of time, and complaining about mental health, but I'm still always looking for the next gig. Freelance is a helluva drug.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115784132610502677",
    "author": "BatMeckley",
    "date": "2023-06-06",
    "content": "As someone who’s had their studio robbed, I can’t stress enough how important offsite backup is. (They stole all the computers, and ALL the drives, including the backup system. Left the guitars). A very similar situation happened to my friend last month, where the thieves stole all the hard drives in the house, and then jewelry, watches, AND the safe… and in this case one of my guitars.). Anyway, off-site backup clutch if you can figure it out.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1125018984639631411",
    "author": "Andy Lawson",
    "date": "2023-07-02",
    "content": "It’s a challenging industry full stop. Really doesn’t matter what your role. But ultimately we have the control and choice. Do I jump when the record company say we need those stems in 1 hour, when the artist wants that 8th revision urgently. The choice for me is always “yes”. Does my mental health suffer sometime? Yes. Do my family lose me to a project I can’t stop thinking/working on? Yes. But what is the alternative? I could go and get a stable job that pays more money but I would be a miserable f*ck. Mental health would go to pot, I would be with my family more but a sad sack. For me this is not an option. I have a job where I get to live in a wonderland of thought and creativity. Maybe you just need to be built for it and it isn’t for everybody? The slog at the start are some of my fondest memories. It was so exciting!I think I did this job for 5/6 years living off next to nothing. I just didn’t care (if I had to go do a shift at a bar, I did it!whatever it took). I’m not really sure what my point here is…. It’s a passion job",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1128499601335406652",
    "author": "LAPhill",
    "date": "2023-07-11",
    "content": "I started typing something about the misplaced motivation of resentment towards those born into more wealth/privelage, but life's too short and so am I",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1129850963537178745",
    "author": "chrissorem",
    "date": "2023-07-15",
    "content": "Yes thank god for weed!  Also most deadlines are fake and I stopped caring about them and now just make people wait until I’m happy with the work. The amount of times I stressed over a deadline and then the record came out a year later. The world has waited this long for your special music they can’t wait two more days and I’ll enjoy my life a bit more",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147614430507565301",
    "author": "spectrummasters",
    "date": "2023-09-02",
    "content": "......maaannnn, i appreciate you so much man for real. THIS is the most important part of it all.....you nailed it as always.....i love that you care deeply enough to arrive here ....as i feel just the same....very often when im recording someone . ive said it before here, but it often feels like its a therapy session and im enabling the psychological release.......when someones in a room next to you talking about the pain of missing their father ......it pisses me off that some smart ass would write a smug article saying that the artform that allows these young men and women to talk about this.....is dead",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147664907786002564",
    "author": "cy (sigh)",
    "date": "2023-09-02",
    "content": "this was a timely read /convo for me. I'd been planning on doing some studio visits this month to get some irl face time with the folks there and anxiety was kicking my ass. reading this was a good push in the right direction",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1216204736525504572",
    "author": "Andy Lawson",
    "date": "2024-03-09",
    "content": "When I was searching for something to make my clients life easier and less stressful, I didn’t realize how positive that was for me also.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230285955378839575",
    "author": "Edsel Holden",
    "date": "2024-04-17",
    "content": "I like that example @Nomograph Mastering for many reasons, but in particular - the dude posting every day will have a cheer squad, sponsorships, probably be interviewed about his prep, etc.. and the dude running every day won't get those same things, and may question their own path bc of the comparison game. But just keep running dudes. We winning.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1239608915356942356",
    "author": "Rollmottle",
    "date": "2024-05-13",
    "content": "But for real, yeah you're gonna have to be band therapist and mediate this one to keep the project going.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1239631810984415232",
    "author": "BatMeckley",
    "date": "2024-05-13",
    "content": "I mean, Rob Cavallo always says in interviews that about 80% of the gig IS being the band therapist. I don’t think I’ve had a single band record I’ve worked on where having to navigate some degree of inter-band issue isn’t part of the deal.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1239639251910524978",
    "author": "spectrummasters",
    "date": "2024-05-13",
    "content": "….the balance between stoicism and self care is so present here . Ed and matt you are both right imho",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1248742834211913739",
    "author": "Ingmar Carlson",
    "date": "2024-06-07",
    "content": "This is an indicator of good mental health 👨🏻‍⚕️",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1274119286343864372",
    "author": "NoahNeedleman",
    "date": "2024-08-16",
    "content": "The thought of even trying to join another server gives me anxiety",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1277382466122027059",
    "author": "Zach Hughes",
    "date": "2024-08-25",
    "content": "That's a great question. Does a balance need to be struck? I think it comes down to what we believe about our role in relation to the people we are working with. To someone who doesn't work much with other people to whom success is largely predicated on their lone creative genius maybe the question of balance is neither here nor there.\n\nHowever, if you are on a team, are a leader, teacher, or coach suddenly you are on the hook with others and the performance of the group matters. The highest achievement, future funding, drawing in more talent, etc... might all come down to the performance of the group. Would it then be wise to be so laissez-faire about undermining the intrinsic motivation / confidence of others? What if an unintended consequence of that attitude is less actual human connection?\n\nLast thought I had is how do we know the truth of someone else's potential? Fwiw I don't know the answers but this is what's kicking around my head.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1279714410008678452",
    "author": "itaylerner",
    "date": "2024-09-01",
    "content": "Totally! I was inspired by your perspective, I’m trying to take more initiative myself nowadays. I’m learning that confidence and shooting your shot is crucial, AND timing and tact can be the difference in whether you get the gig or not.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1291124930322239498",
    "author": "matthewrederburg",
    "date": "2024-10-02",
    "content": "Thank you for letting your stress be a lesson for all of us. I’ve been feeling similar feelings as a big contract gig of 3+ years comes to a close. Your discussion here helped me put things into context and I’m so glad you experienced a pivot on your end.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1299111449796284416",
    "author": "BatMeckley",
    "date": "2024-10-24",
    "content": "Everyone’s body responds differently, but I’ve been lucky enough to come out fairly unscathed with my hearing and mobility. \n\nAs I understand it, it’s less about motion than it is repetitive motion. I was also playing guitar professionally so it kinda mixed up the muscles between that and the trackball. I got hurt when I was doing NOTHING but trackball 110+ hours a week for a few months. We were really burning the candle at both ends for a bit. The interesting thing to me is most people burn out their carpal tunnel) which is pointer finger, but mine was medial (I think) tunnel, which was the pinky, from all the chording on the expert trackball. The overuse inflames the tendon which causes it to rub which causes it to get inflamed which causes it to rub which… the steroid shots, some rest, and a lot of ibuprofen over the next few weeks helped.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1300512546004008991",
    "author": "Slow Hand",
    "date": "2024-10-28",
    "content": "Quite a bit.\n\nMy learning is less music-focused these days, but I budget a lot of time for self-development and continued study.\n\nSometimes it's  20 min a day in a technical book that I'm reading. I move slowly and make sure I understand before I move on. It may take two months to complete, but I'm steady with it and I do a little bit most days. It's common for me to transcribe notes from high-density talks that I want to learn from and revisit them often over the span of a week. I'm constantly printing out my notes and reading material so that they're easy to revisit throughout the week.\n\nI'm currently taking a project management course through MIT, which has been great. It's uncommon for me to do formal schooling these days, but this is work related and a direct application to my future capabilities that we thought would be beneficial for the company.\n\nWhen I buy a new plugin (rare) I set aside time to go through it and turn every knob and try each feature to see what it's capable of. Learning a tool on the spot is a good way to kill the creative flow, so I do the exploration up-front when possible.\n\nOften I'll have ideas for novel ways to use a tool (layering distortion, for example) and I'll set aside two hours to explore it and see what I find.\n\nThat said, I think my day-to-day may be quite different from a lot of folks here. My eggs aren't all in the business and pressures of record production, and so I rarely find myself buried in such commitments. I tend to keep \"normal\" business hours these days and keep a hard separation between my commitments and my leisure.\n\nIn fact I'd say that I'm actively structuring my life so that I can retain my leisure and don't find myself overwhelmed with commitments. That's a whole other story, though.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1364389139021172796",
    "author": "Brian Reynolds",
    "date": "2025-04-22",
    "content": "I love this, I apply this same strategies in my own sessions. Even one today with a new to me, song 1 artist. I like to think about it as making sure they're having fun, are engaged with me and the process. As opposed to avoiding stressors. You said everyone's optimal version or depth of engagement will be different. I like what the OG poster said above about taking time to get to know the artist on a human level. The first 30 mins or hour of a session. I'll just talk about life, stories, and passions. Anything other than the specific music we're there to write. I find this time allows everyone time to acclimate to each other. This time gives me a sense of their personality and how to best assist them to give the best performace they can. And with returning artists time to figure what mood they're in. And how to best direct that. And always ready to adapt my approach as I learn the artist and the song on a deeper level.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1382006956796940320",
    "author": "cian riordan",
    "date": "2025-06-10",
    "content": "I was literally have anxiety attacks about this same kind of thing 15 years ago when I was first working in LA. Like Ruairi said, you can still care while doing things at your own clip. Your job is to figure out how you want your records to sound and make a plan to get there. Nobody will care about how or why, they’ll just associate you with the good work you’re doing.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407379406732656690",
    "author": "bobby k",
    "date": "2025-08-19",
    "content": "We talked more about it and it sounds like the moments she gets frustrated about are when she can see I’m being a people pleasing yes man and spreading myself too thin, because to her that indicates a lack of self respect",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1438444691564531874",
    "author": "Ross Fortune",
    "date": "2025-11-13",
    "content": "100% agree on all counts, except the last - your ear canals slowly change shape and the recommendation from ACS is to get new moulds every 5 years. I’ve found this to be true - you don’t notice the slow change, but when you get new moulds made after 5 years, the old ones suddenly feel like they belong to someone else in comparison.\n\nIn the UK at least, moulds and a set of customs cost around £150. There’s a scheme for music professionals that reduces the cost to £50.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "825794968139726879",
    "author": "Eric Martin",
    "date": "2021-03-28",
    "content": "charge more, for me, the stress of not working generally came from not being able to make ends meet with the income I was getting, upping my rates actually started at tracking more work that made it more sustainable for me to take time off.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "942451325860478996",
    "author": "josephmossbridge",
    "date": "2022-02-13",
    "content": "So we all know that demoitus is a thing but I also think exportitus should also be a thing. Exportitus (x-port-it-us) noticing every tiny flaw with a song after it has been rendered and exported, and stressing out about them",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "958197318706946098",
    "author": "Deleted User",
    "date": "2022-03-28",
    "content": "10% of my income comes from my day job 90% comes from music/audio. But 50% of my music income are gigs that I’m taking to pay the bills, the rest are projects that I feel somewhat passionate, or very passionate about. \n\nThe living expenses have increased due to inflation and I’m also trying to save up money to get a car, so I am thinking about quitting my current day job to get another day job that will give me more hours. \n\nOn months that I couldn’t make my ends meet, I did little things like snow shoveling for neighbors’ houses. I have not done lawn mowing but any one time gig with no schedule commitment can be a good option. The reason why I had to do this is because my day job wouldn’t give me any more hours. \n\nMy issue lately has been the fact that I live in a very expensive city (Boston, MA), and I am barely making it work. More than 50% of the work I do heavily relies on being on-site (recording, live sound, and some parts of the production process).  If I moved further out from the city- the rent would not get cheaper enough to justify getting a car for the commute. And if I moved out of state to somewhere like Albany, NY or Rhode Island- I will be giving up huge part of my clientele and half of my income. So I thought a better option would be to get another day job that will help me stay where I’m at right now.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1033178047437885521",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "For me it’s a way of getting at motivation",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058258754161872976",
    "author": "Zack Hames",
    "date": "2022-12-29",
    "content": "My paycheck is pretty good motivation. And not having to fucking worry about when my next job will be.\n\nI would be horrible at freelancing for ads because I don’t love it. I am happy to freelance making records (like I do) because it gives me life and I care about it deeply and want to help people make their records.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1062214120205721692",
    "author": "hyanrarvey",
    "date": "2023-01-09",
    "content": "well nothing is perfect, but if the job of the record was to give you an anxiety attack, my job is done",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1062916062041096242",
    "author": "hyanrarvey",
    "date": "2023-01-11",
    "content": "I am about to hit a burn out ugh lol",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063167348527345785",
    "author": "hyanrarvey",
    "date": "2023-01-12",
    "content": "It legit stresses me out",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069071273398898790",
    "author": "ehutton21",
    "date": "2023-01-28",
    "content": "I was gonna post about this, it’s a bit sidebar to the discussion at hand, but I’ve just done a very interesting experiment. \n\nMy ADHD is horrid so it took some time to do, but I’ve got a routine where I catalog my “best practices/new ideas/important tidbits” notes from the discord, and I keep two brief shorthand form journals: one for while I work on a project and another for reflection after it’s over. It helps me stop thinking about the work when I want to wind down. \n\nIts crazy too see how over the last 3-5 months of working, my mental clarity and work flow confidence improved as I had started to build a lot of the consensus tips/habits/ideas from the discord. I’ve also recorded that people seem much more pleased with my work to date.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078672224132812820",
    "author": "NoahNeedleman",
    "date": "2023-02-24",
    "content": "YES. My fav vocal coach in college spent 90% our time being my therapist.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1086933465011847188",
    "author": "spectrummasters",
    "date": "2023-03-19",
    "content": "I think the current interface between the scientific and tech communities and the lay persons of society is broken. As IMO , we saw during the pandemic...science and tech has been placed where \"God\" once sat....in the realm of the divine. Theres a lot happening in those communities that is having a huge impact on the spiritual and mental health of people across the planet......and as we find new ways to not be in the room with each other....or bring back to life the dead for our own entertainment......or find new ways of not having to compose the speech we are not having in person with people.......imo we continue to ignore the spiritual and ethical ramifications this post modern lifestule is clearly IMO having on peoples dharma. I think perhaps there has never been a tme on earth where humans have been so sure we know more than we ever did.....this is never good. A wise man/woman knows they nothing at all. I feel science and tech needs to be checked a little ....to paraphrase a couple of solid thinkers",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1088258947602989148",
    "author": "Slow Hand",
    "date": "2023-03-22",
    "content": "Dear God. I really could've used this 3 hrs ago in my therapy session. 😄",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1097623689379463279",
    "author": "cian riordan",
    "date": "2023-04-17",
    "content": "I feel similarly with the caveat that I have no time for over the top dickhead-ery on stage or during the performance. Backstage, personal life — it’s all a bit overwhelming to be everything to everyone and I have a lot of understanding. Kindness where possible, sure. But it’s impossible and insane to be ‘on’ all the time.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120381249970765995",
    "author": "shaunobi",
    "date": "2023-06-19",
    "content": "100% on this btw - my wife manages a team of people doing related work (not processing claims but reviewing and accepting / denying edge cases). We walk every day and have spent hundreds of hours talking about each others jobs. And honestly... it's complicated, a human DOES need to be in the loop, and it's a legit job. I don't mind people thinking it's a drone job, but... it's not a drone job. It's actually life and death in a way I've come realize that programming projects and music isn't. She's a nurse and it's interesting and stressful and creative and actually important.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1138591447902339253",
    "author": "Nomograph Mastering",
    "date": "2023-08-08",
    "content": "Comparison is the thief of joy",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1149433205544464485",
    "author": "LAPhill",
    "date": "2023-09-07",
    "content": "It's far and away the simplest question to ask and hardest to answer. But trying to survive the lifelong headfuck of monetizing art, and dealing with all of the associated people and problems, is going to be brutal without a burning internal desire that's fueling you. There are many motivations that can propel you forward, but anything less that full conviction will likely end in heartbreak.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1152393589020704809",
    "author": "matthewrederburg",
    "date": "2023-09-15",
    "content": "I think about the artistry of house music a lot when I work my small FOH gigs. It’s the question of “when the comparison between this canned music and the live performance is made, what do I want the results to be”\n\nOne solution that I love is choosing very benign music. Instrumental jazz, what you might call “wallpaper” music. Great music in it’s own right but chosen because:\n\n1. it’s usually different in genre than the acts on stage. A local band in a small venue shouldn’t have to compete with the sound of the biggest records of the genre, even if everyone in attendance would dig the vibe.\n\n2. Less attention grabbing than the acts on stage. Makes the live music seem big and provides a polite tapering down of energy at the end of the night. Sends the message of “the night isn’t over, but wasn’t the band you came to see the hightlight? Let’s simmer in those good feelings.”\n\nJust a few thoughts about one approach. Not always the move.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1201248799427940483",
    "author": "spectrummasters",
    "date": "2024-01-28",
    "content": "@Deleted User ….your question sure got us all thinking . I’ll take the dive on weaknesses . My weakness is , imposter syndrome , from the level of responsibility I feel for others safety  when building families homes and their electrical network supply.  With repetition tho my work process has now become ritualised  and this has become my tool to success, and potentially a strength",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1209213559330832425",
    "author": "Slow Hand",
    "date": "2024-02-19",
    "content": "I believe that's partly a choice of how we choose to design our lives. I budget a lot of time to unpack and explore the stuff that interests me and that means sacrificing other things that I want. We all have external pressures and commitments to fulfill, but we also have to guard our free time with a shotgun.\n\nAlternately, it's okay to slow down too. It takes a certain kind of confidence to let these things pass us by and I think a lot of people feel unease over that. Sometimes I think we could all use role-models in this regard that can demonstrate that it's okay not to do everything and instead savor what's before us.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1229803187192598618",
    "author": "Will Melones",
    "date": "2024-04-16",
    "content": "Fear of causing friction, losing confidence, and losing the client?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1239608490859954247",
    "author": "hyanrarvey",
    "date": "2024-05-13",
    "content": "I think you’re gonna have to play band therapist or fire your self",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1265884034333020160",
    "author": "spectrummasters",
    "date": "2024-07-24",
    "content": "The feeling that you get listening to a great composition being played and conducted well by that many people synchronous in the moment is actually overwhelming (as it’s meant to be )",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266931770100813966",
    "author": "Dereck Blackburn",
    "date": "2024-07-27",
    "content": "The only thing I have to contribute is I work with folks in the 23 - 35 age range regularly (Im 44) and younger people who are HUNGRY to move up and ahead in their career get easily frustrated that things don't just happen for them when they're feeling like they're sacrificing a lot for very little recognition. There is also a lot of pushing and pulling the artists to fit their expectations instead of serving the art and letting nature take its course. Specifically theres a lot of \"I can't wait to help you realize the full expression of your music and art when we work together!!!!!!!!\" kind of vibe which is great internally but puts off older artists a little bit. I've seen it a lot over the last couple years with young producers and engineers and I wonder if its because of the pandemic, honestly. The whole \"check list to success\" thing is another good point. Some things are not easily repeatable or scalable with the expectation of the same result every time.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1268489967106134100",
    "author": "Ingmar Carlson",
    "date": "2024-08-01",
    "content": "Funny thought when you take a step back from it. Ideally, nobody’s really thinking about the “high end,” good or bad. The anxiety is real tho",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1274129080874438741",
    "author": "Slow Hand",
    "date": "2024-08-16",
    "content": "Yeah. Med to large-scale Discords can be a bit of a circus. The defining quality for me is how well they're moderated, if at all. \n\nI step into a lot of servers and am immediately faced with the overwhelming sensation that God built the world and then peaced-out, leaving the children behind to make sense of it 😄.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1279936942712160297",
    "author": "cy (sigh)",
    "date": "2024-09-01",
    "content": "I would co spider a lot of my producer friends rivals. but it's not a rivalry with the end goal of finding out who is better. \nit feels more like motivation. \n\"oh shit, when did they get this good? can't get left behind \"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1286706327015522364",
    "author": "Andy Lawson",
    "date": "2024-09-20",
    "content": "arguably almost as iconic? based on what? the groove is good don't get me wrong, but the groove of the song pales in comparison to the vocal. those verse's are just on another planet imho",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1317554473333424148",
    "author": "Nomograph Mastering",
    "date": "2024-12-14",
    "content": "Years for some people with illness, depression etc",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1339620248219025490",
    "author": "Spencer Broschard",
    "date": "2025-02-13",
    "content": "My wife and I have been making duet cover videos on YouTube for 10 years and we’ve always been pretty adamant about doing them live and not correcting anything. It is so much harder and more stressful to get a great take especially with two singers lol but IMO it’s worth it and our audience really appreciates it…other than a few trolls who confuse using reverb with autotune. Could we have a bigger audience by now if we just decided to produce the best most clickable content? Probably. Maybe I’m turning into a crotchety middle aged man but I do think there’s something to be said for musicians actually being able to play and singers actually being able to sing without help from computers. I think it’s a huge reason why legacy acts are still being discovered and connected with by gen z.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1358193854930751699",
    "author": "Nomograph Mastering",
    "date": "2025-04-05",
    "content": "Agree, I read it as confidence when someone can tell me what they are doing without resorting to fancy language",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1374433582688243712",
    "author": "nachomaquieira",
    "date": "2025-05-20",
    "content": "It totally makes sense to hope a new release does well cause it can feel like a big boost for motivation and your everyday life. But putting too much pressure or expectation on it can be really tough later on mental health. Most of the time, music/realeses doesn’t drastically change our lives; it’s more about the connection with the people we create it with and staying in the flow of doing what we love.\n\nOver the years, I’ve learned to ease up on the *what could happen* side of \"big projects\", and instead focus more on truly connecting with the music and the artist in the most genuine, loving, and positive way I can. That’s what brings out our best work and, in turn, leads to better opportunities in the future: musically, financially, and in terms of personal and professional growth.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1381968210735271996",
    "author": "bobby k",
    "date": "2025-06-10",
    "content": "What I’ve been changing the past few years (therapy helped kickstart this) is to pause to ask myself why i would feel this way. There’s basically two options - (1) i care about the song (2) i care about impressing or proving myself. Option one elicits feelings of excitement, confidence, the stuff that’s contagious. The stuff you can lead people with. Option two elicits stress, nerves, uncertainty, things that made me an irritable mess. Sucks the energy out of the room.\n\nOur brains can only really believe one thing at a time and I think we know which one of those options EV’s brain believes.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1387498909705830631",
    "author": "kylem",
    "date": "2025-06-25",
    "content": "I'm going to reveal at the end of this that I'm actually a therapist and have trained the last 3 years for this exact situation. Even built a studio, with real producers and artists.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1392527448914133063",
    "author": "masteredbyjack",
    "date": "2025-07-09",
    "content": "Constantly hammering this (kindly) towards the younger generation I work with often. It's a very real problem, the comparison game",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1395568838279430165",
    "author": "Edsel Holden",
    "date": "2025-07-17",
    "content": "I’ve had similar conversations for a couple of years now and it’ll only increase. \n\nI have a great friend who I mastered their first release, then AI did the next 2-3 projects. \n\nJust this past week they called me for the next one - apparently they listened to their music on some system and never want to use an AI master again after the comparison. \n\nSo mileage is still varying. But status check normal , especially with younger peeps.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1398326876501708934",
    "author": "Edsel Holden",
    "date": "2025-07-25",
    "content": "\"friendwriterhelpertherapistproducermixertunerengineermixermaster_ED\"",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1458992152691605556",
    "author": "Zach Hughes",
    "date": "2026-01-08",
    "content": "Correct me if I’m wrong but this sounds like a combo of you doubting your abilities and / or imposter syndrome. Man if you’re getting enthusiastic approval then job well done sir.\n\nI heard someone say once that he decides what projects to take on by whether they meet one or all of the following criteria: 1) learn a new skill or something valuable 2) meet interesting / high quality people and 3) make good money or create asymmetric optionality later. Stuck with me.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "819730461089071154",
    "author": "Josh",
    "date": "2021-03-11",
    "content": "Only reason it’s this bad is because I went back to the dude I used to work for and started up the department with him. So it’s been hella stressful but I’m also making 2.5x more than the average salary is for this sort of job since it’s typically viewed as basically entry level. So I can’t complain too much. Should be bringing more people on board within the next month or two so as soon as they’re trained I’m gonna convince them to give me two weeks off so I can go somewhere and write",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "819773211599831040",
    "author": "Eric Martin",
    "date": "2021-03-11",
    "content": "Worked retail for 15 years, spent 10 at Apple and finally got all the debt out of the way and confidence to finally take the leap into production in May 2019, the band I’m in kept me busy for almost 150 shows a year for the last 7 years of working full time at retail so it was time to take control of my time. Currently Mixing/Mastering/Tracking remotely for anyone that’s needs it in my community.\n\nMy wife is a talented violinist and we track her from home daily for indie bands that want real strings on their records and want someone who can arrange and perform the parts.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "820070293611610145",
    "author": "Zack Hames",
    "date": "2021-03-12",
    "content": "This may be weird advice, but sometimes I just say “sure!” (Or completely disregard depending on context) To certain ideas or mix notes and choose not to address them again. It doesn’t always work but sometimes people just say stuff to say stuff, and they may listen to the mix several times again and get used to how it is and not even want the change later or remember they said anything. I know that may sound insulting but I just dealt with this exact thing, and that did save me a few times. If they brought it up again I tried to meet in the middle. I started experimenting with this once I realized being super honest/straight forward/transparent can actually slow down the process without any benefit. This may apply to more commercial productions where people don’t really want a “no” or a “why not” they just want a yes man and a person to get the job done. I hope that makes sense, I feel like some of the other options you’ve definitely already came up with. Sometimes making your case with the utmost confidence can also work! (Not something I do often but it absolutely can work)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "820070997604040769",
    "author": "Zack Hames",
    "date": "2021-03-12",
    "content": "To elaborate @Eric Martin  , I think keeping a positive vibe and confident presence can let them relax about what they want at all and simply trust and not get super worried or hung up. Sometimes if start explaining “well X, Y and Z because then...” they start to get anxious or overwhelmed or even MORE focused / lack confidence on the thing.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "820089258006020096",
    "author": "Eric Martin",
    "date": "2021-03-12",
    "content": "@peterlabberton @Zack Hames thanks for the response these both help my imposter syndrome, I think I’m ready to do what I usually do which is say, “sure” and do the work they’re asking for and write down what I’ve done in follow up to the notes when I send it. the revision.\n\nDoes anyone else send detailed notes on the things they changed to make the note work?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "823699201447690260",
    "author": "Slow Hand",
    "date": "2021-03-22",
    "content": "Yeah. It's a difficult topic to talk about without a concrete example for context. It really comes down to the artist in question and *aaalll* of their various motivations and circumstance.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "825783598640660530",
    "author": "Josh",
    "date": "2021-03-28",
    "content": "Does anyone else experience guilt and anxiety when they’re not working? I had a lot to get done this weekend and decided Friday night I’d take the time to just hang out for once. Then yesterday I went to watch the UFC fight since I’ve been avoiding my friends for way too long. Ended up having a full blown panic attack. Like when I’m working I feel bad that I’m not spending time with the people I care about and then when I finally do it I’m straight up not having a good time because I’m worried about work lmao.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "841398708426899476",
    "author": "Slow Hand",
    "date": "2021-05-10",
    "content": "For example Clubhouse has been a hot new thing, but now Facebook and Twitter are developing their own answers to Clubhouse in order to claim their share of that new market space. Does Clubhouse have any competitive advantage that will prevent FB and Twitter from poaching their idea and eventually overwhelming their lead in this new space?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "849765451235065887",
    "author": "Rollmottle",
    "date": "2021-06-02",
    "content": "there's an ever so slight texture on it which is really nice. in comparison to the standard GIK fabric, I prefer it.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "895055904247013386",
    "author": "Zack Hames",
    "date": "2021-10-05",
    "content": "Not to mention, to piggyback off of what @cian riordan said, it can instill confidence in potential clients. Whether that's from connections you have, people having the opportunity to easily hear your work, or how cool or exciting your posts may seem. Cian didn't need to post pics of him recording at United, but it looks fucking badass and that MAY get more people to hit him up! If people see you working, somehow they seem more inclined to work with you because if you're busy you \"must be good\". If you are empty handed, you seem less desirable. it's kind of fucked up but true in my experience.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "927040325309050881",
    "author": "Josh Bowman",
    "date": "2022-01-01",
    "content": "💯This! 90% of the time upcoming gigs or situations I stresss about the most fell apart and new stuff happened, or there was no reason to stress in the first place.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "958134389684965456",
    "author": "jantrit",
    "date": "2022-03-28",
    "content": "I worked in kitchens for a long time, it allowed me to make some cash and live but also have flexibility to take music and studio jobs when they would come around. After moving to the states I found more restaurant work but kept it to only fri/sat/sun and tried to focus the rest of the week to build contacts and do studio stuff. I got super lucky with my boss who was also in the music thing and very understanding about calling out. It eventually got to the stage where I had to call out like 3 weekends in a row so I made the jump to doing the studio stuff full time. So far it’s been working out and I’ve been lucky to keep a good basis of projects, supplementing quiet periods with studio build stuff. It can be super stressful relying 100 percent on the music thing and it’s ultimately different strokes for diff folks. I’ve seen some people who get really burnt out taking music stuff that they don’t like to pay the bills and conversely I’ve seen people getting burnt out doing other stuff that’s not music getting effected in the same way. Ultimately whatever keeps ya happy and works for you is awesome, burn out is real.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "991036922946257017",
    "author": "Zakhiggins",
    "date": "2022-06-27",
    "content": "I've a slightly different perspective on this than the others, but the way I see it is that someone with a smaller portfolio of great songs, is infinitely more valuable than someone with a huge portfolio of mid songs - clearly you put time and effort into your music and probably get good results for it (not to be confused with perfectionism) - I wouldn't worry too much about churning out a huge volume of music if you think youll sacrafice quality. Just stay consistently making music and trust the process, would be my best advice",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1029243303851479100",
    "author": "oaklandmatt",
    "date": "2022-10-10",
    "content": "nsfw and this was sent to you in confidence",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058260038516473887",
    "author": "Deleted User",
    "date": "2022-12-29",
    "content": "Yeah. Sync has been fucking with me because it doesn’t give me eithr of those. No guarantees for money, not really all that fun. It’s still fun cause it’s still music but kind of a paradoxical motivation I must say",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1060708040996818994",
    "author": "Nomograph Mastering",
    "date": "2023-01-05",
    "content": "It’s only net positive if it actually provides a useful result. Spend time with someone with very serious depression or anxiety issues, or someone who is overwhelmed and unraveling might be the last thing they need",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1062883870736920736",
    "author": "ehutton21",
    "date": "2023-01-11",
    "content": "Yeah an “all gas, no brakes” kind of ego/confidence probably gets grating when it comes to the day to day an hour by hour",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069088037834870897",
    "author": "Slow Hand",
    "date": "2023-01-28",
    "content": "Yes, for my needs it absolutely is. Though I can totally understand how it can become a time suck for people who enjoy the feeling of being busy. There's a *lot* of productivity porn out there.\n\nI've been managing a small business for the last 5 years and it's a lot of information to keep track of. Notes, thoughts, ideas, receipts, photos, payroll, reminders, plans, parts, etc. Often I need to recall stuff that happened 8 months ago and that requires me to be meticulous in my organization.\n\nOn top of that, I'm ramping up into work with a second company that has the potential to draw on every single skill set and interest that I have. Having the tools to draw disparate connections between my past knowledge and the new ventures with this company could be a huge multiplier for what I can do. It's currently helping me to map out the idea space for this company and really get a big picture of everything that's going on.\n\nI'm a big believer that human memory is fallible and prone to unwitting revisions and mis-recollections that distort events. Even in ways that are benign. Every read is a write. So it's important to unload the important stuff in a place where it won't spoil and distort with time. You could say I'm big on long-term memory and a bit weak on short-term memory.\n\nI'm also a glutton for information, and offloading things and storing them \"externally\" allows me to unburden myself and not get overwhelmed by it all. I consider a lot of what I do to be trading in information and drawing connections. Some of my long-term personal projects revolve around topics like slow, imperceptible, change and there's simply no way to begin to observe that stuff unless I have rock-solid documentation and data that I can call on twenty years from now.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1075653983907094648",
    "author": "Rollmottle",
    "date": "2023-02-15",
    "content": "this is right. definitely don't lead with \"I can't do this on my own.\" try solving to the best of your ability first before reaching that conclusion. you want to inspire confidence at the moment of failure, and not cause more doubt.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079208300509413416",
    "author": "ehutton21",
    "date": "2023-02-25",
    "content": "To be fair, I think there’s leeway here and I speak as someone who is bipolar. There are things out of our control, but there are things within our control too. Accountability for mental health gets blurry when loved ones are involved gets messy, because we walk a fine line of being powerless to our disposition while also being able to control many of the extenuating circumstances that worsen our conditions",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1087116764455911554",
    "author": "spectrummasters",
    "date": "2023-03-19",
    "content": "Ha ha, this is so true...navigating handshake culture anxiety is real",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1087124621683331235",
    "author": "Slow Hand",
    "date": "2023-03-19",
    "content": "It's worth doing right, if only to appease the people who actually give a damn. Hell, *King of the Hill* had an entire episode where Hank received such a weak handshake at his meet-and-greet with George W. Bush that it completely rattled his confidence in the President.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1087125398288085104",
    "author": "ehutton21",
    "date": "2023-03-19",
    "content": "Honestly it was the most brilliant part of the course. So many people don’t get those kind of social experiences that are so important and teachable, for a myriad of reasons.\n\nBut literally, you’d hand in your test and to get all three points you had to initiate with confidence, firm hand, confidently say “Professor Primesburger, I’ll see you Monday” and hold it there for just a split second. It was actually somewhat brilliant.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102299432130719824",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "Maybe I'm not being as careful with my words as I like. I came across a song that was clearly trying to be like Linkin Park, which made me go back and listen to LP...but this new band, it was wider, louder, had more bottom...everything was *more* but it wasn't necessarily better. Going back to the old mixes, they did feel a bit dated by comparison, but by no means worse",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1116838190880391212",
    "author": "Josh Bowman",
    "date": "2023-06-09",
    "content": "If your just overworked and tired, try and take a few mins for yourself when you can, maybe a vacation with family or friends and say no to some work if you can to make time for you. If it’s full on burn out, try and rediscover why you are doing what you are doing, why it’s important to you. I’ve been going through some burnout the last year and vacations didn’t fix it. I realized I kinda lost my big picture “why” in my career, so currently working on falling in love with music again. She’s playing hard to get but I’m making progress 😂.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1119996917691199591",
    "author": "Bryan DiMaio",
    "date": "2023-06-18",
    "content": "That’s the problem with doing what you love in the creative fields. It’s often tough to set boundaries and then at the end of the day after having worked on someone else’s music you just feel like doing anything but music. \nSelf-care and work/life balance are tough to achieve starting out, though it is possible eventually",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120088227706064936",
    "author": "Deleted User",
    "date": "2023-06-18",
    "content": "I actually didn’t have anything against him or what he said. He gave us a good time, got everyone lit and had a hard time keeping up with us youngins. He was out by 9pm hahaha\n\nBut it just got me thinking about where I’m at right now. As @Nomograph Mastering I gotta be kinder to myself, but the anxiety of current phase is crippling",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1120093238490042389",
    "author": "Deleted User",
    "date": "2023-06-18",
    "content": "100%- if anything what he is saying supports what I want to do. I was not offended by it, I did see more positives in what he said. It just happened to light up my brain towards the direction of anxiety triggering.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1120193478190710836",
    "author": "Josh",
    "date": "2023-06-18",
    "content": "I’m very late to the convo but this is facts. My brother one day called me during his lunch break at Walmart and he was almost crying because he was so frustrated he couldn’t get enough sales to not work there and he said something along the lines of “I can’t believe people are fine with working here”. And I literally said “Bro, you should be JEALOUS. Imagine how much easier your life would be if you were perfectly content with putting the Mayo in the bag.” \n\nHe hung up on me. \n\nThe next day he goes “Hey man. You’re right. I’m jealous of the people who can Mayo in the bag”. \n\nAnd that’s just facts. \n\nI knew a dude who worked at a really great restaurant as a chef. Not the big chef but one of the chefs. During covid he said “eh I have this crazy passion for cooking but never cook for myself. Why don’t I go sell cars?” And he fucking did it and ended up being the only dude I knew who could make $20k a month selling Toyotas without ever having stimulant dependency in his life. This man was leagues happier after the change mostly because he could finally have Sundays off to watch football.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1125043094069456897",
    "author": "Adam Thein",
    "date": "2023-07-02",
    "content": "One other thing I’ll point out is that $20 billion worldwide for music industry sounds like a huge number til you compare it to other entertainment like movies, video games, and sports.  It’s dwarfed in comparison largely because of how the average consumer values (or doesn’t value) music.  It’s ubiquitous now and the barrier to entry in the market is so low that $20bn is emcompassing a tremendous number of artists, labels, etc.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1131073959752896685",
    "author": "NoahNeedleman",
    "date": "2023-07-18",
    "content": "That sounds awful. Start with your friends and artists you know. Work cheap and well, see what sticks. \n\nI’ve been doing photography, like just headshots for professional type people, contract signings, stuff like that. Low stress low commitment not much money, but $150 for an hours worth of work isn’t so bad. The camera’s paid for itself anyway, and really I just wanna take pics of my animals and food ¯\\_(ツ)_/¯",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133061388433113198",
    "author": "Edward Rivera",
    "date": "2023-07-24",
    "content": "Sounds a bit grim at the start, but i like to imagine a scenario that would make me wish I was back in my chair during my \"shit\" day\n\nI'm not on a somber phone call with a doctor about my partner's health...\n\nI'm not currently wondering how the hell im going to pay the next months rent, with the landlord breathing down my back...\n\nI'm not dead, I've still got skin in the game...\n\nThese things are a bit easier to imagine and realize that there can be real situations I can find myself  in where I'd *pray* to come back to dealing with a bullshit client, or having a bout of imposter syndrome, or if the depression is really having a go at me today",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1139363898772967444",
    "author": "Rollmottle",
    "date": "2023-08-10",
    "content": "i'm sure Serban needed the confidence boost",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1141514480845594624",
    "author": "LAPhill",
    "date": "2023-08-16",
    "content": "Honestly, I'd figure out a way to not schlep everything yourself. The stress isn't worth it, unless the POD shipping costs are astronomical.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1145091469158396116",
    "author": "spectrummasters",
    "date": "2023-08-26",
    "content": "Imho Noel and his bro are classic working class characters......I get to work with a site full of people like this everyday . Not with the guitars no ,  but with the  same swagger of  pure confidence and simultaneous hilarity of self effacing banter . I love it . It’s charming and a nuanced personality the posh folks don’t understand. This is England",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1145238706119245854",
    "author": "spectrummasters",
    "date": "2023-08-26",
    "content": "My friend (who I told you attended the mcgilchrist lecture ) and I were debating “equality “on Friday evening , instead of actually mixing his record . Anyhoo , he is v bright ….and currently railing against our societies demand for everything to be equal . I’m still building my understanding of his view , but essentially he was arguing that for things to be said to be equal , they must be quantifiable . And so much of what we are seeking to apply our own perceptions of equality to , ie the human experience and comparisons  between our experiences individually ……are so unquantifiable that the notion of guaranteeing equality is a farce",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147611813010231346",
    "author": "spectrummasters",
    "date": "2023-09-02",
    "content": "v v interesting.....and presses closer to the nexus of it all than that article i reckon. For some reason, i think a lot about the hypocritical critiques that come from all angles towards \"hip-hop\" . I know that my friends and artists would be targets of theperspective that todays hip-hop is obsessed with materialism and sexual lyrics......but when you are young and struggling to find opportunities in a city like mine (London) and theres real violence all around you.....the love of a man/woman and a fancy car really can make you feel like youve finally got some control over something in your life in a otherwise hostile environment.......and the same folka doing the criticisng , from where i look at it....they like a bmw/merc/tesla just the same as the rappers they criticise do.......and keep their true feelings close in order to not upset their bosses at the firm in the city.......to get that bag. So a lot of the \"theyre all about the money/women ......i dont buy into it. Its a denial of ones own desirous motivations ....remove the plank from your own eye before pointin to the speck in another's ....sort of thing )",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147612892288524448",
    "author": "Nomograph Mastering",
    "date": "2023-09-02",
    "content": "I think the motivation you describe to get the car, the girl and the bag is entirely understandable (a very intoxicating combo of dreams of escape and of self determination)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151257790212489307",
    "author": "peterlabberton",
    "date": "2023-09-12",
    "content": "I feel all this big time. I’ve been really loose with my work schedule recently on projects with no hard deadline—not sending anything off until I’m super psyched about it, work on something for an hour or two and jump to something else when I’m out of ideas or annoyed. But it’s also driving me crazy cuz it feels like I’m behind on *everything* all the time. In reality my clients seem perfectly happy but it’s stressing me out, and I have run up close to some deadlines as a result. I used to try and do a song every day or two but now it’s very nebulous. Trying to learn to cope—or change tactics if needed.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165413019422048256",
    "author": "Nomograph Mastering",
    "date": "2023-10-21",
    "content": "Oh wait … this isn’t therapy?! I guess I should take my “I’m weird and the world doesn’t fit me” schtick elsewhere 😂",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1175196231341977630",
    "author": "Nomograph Mastering",
    "date": "2023-11-17",
    "content": "I’m overwhelmed with things I want to read and never do",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1189944693044289617",
    "author": "Josh Bowman",
    "date": "2023-12-28",
    "content": "Drink less (possibly cut out alcohol), get better at keeping a routine, cook more, say no if something isn’t a good fit work-wise and don’t stress about it as much as I have in the past!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1191854372569759755",
    "author": "Josh",
    "date": "2024-01-02",
    "content": "Moist is weak in comparison to damp",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1192361913317855244",
    "author": "Deleted User",
    "date": "2024-01-03",
    "content": "I forget to take time to breathe in stressful situations sometimes",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1203287444326195290",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2024-02-03",
    "content": "But the internal Latency in Ableton and my Potato Laptop is giving up on me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1208501780569137195",
    "author": "Nomograph Mastering",
    "date": "2024-02-17",
    "content": "I’m not vetting by playlist, but rather disposition. Not even “fitness” but just the will and motivation to show up",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1217626564003627119",
    "author": "oaklandmatt",
    "date": "2024-03-13",
    "content": "That's why I don't get stressed when people get upset about kids listening only to snippets or speeding songs up or whatever.\n\nT Pain went double platinum off ringtones and artists are blowing up off sped up versions on TikTok. Meanwhile, Radiohead been done fine the whole time without any of that shit. \n\nIt's fine if you like Radiohead type artists only. I just also like T Pain type artists",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1234908278744678450",
    "author": "spectrummasters",
    "date": "2024-04-30",
    "content": "Going against Kendrick and future would be two I’d stay well away from if I wanted to be able to visit LA and ATL without major anxiety",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235091027195461642",
    "author": "spectrummasters",
    "date": "2024-04-30",
    "content": "….ps , anything that stops you from being frustrated in the process is well worth it . (For me Logic Remote app was a massive win for self tracking )",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1238591285808599060",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-10",
    "content": "I feel b? Bc it‘s more radical in the idea that the normalisation has already taken place even though it might have not? It reminds me of the post gay wave in cinema where lgbt characters are just treated as normal characters with their goals and motivation lying elsewhere without their lgbt identity being a big deal",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1248745577542582293",
    "author": "NoahNeedleman",
    "date": "2024-06-07",
    "content": "I mean, I have friends who manage their anxiety & adhd with weed instead of Xanax & Ritalin, friends that manage stress with red wine… I’m still rocking my disposable vapes like a high schooler. So maybe drugs are required? Idk",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1256049765301358743",
    "author": "hyanrarvey",
    "date": "2024-06-27",
    "content": "I’ve uploaded to Veva before it stresses me out",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1261135254043758664",
    "author": "NoahNeedleman",
    "date": "2024-07-11",
    "content": "Thinking of it from the producers perspective, I bet he was trying to be helpful, save him time and stress, and present the best version possible. \n\nThe irony is that his behavior elicited the opposite of the intended effect.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1274132981556187340",
    "author": "lystell",
    "date": "2024-08-16",
    "content": "When a member of a Rock n Roll band says \"As long as we stick together as a band - we can not fail\" \nMade me think of when my wife said. \"If we only start buying Christmas presents early this year - it wont be any stress\"",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1279955481183387728",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-01",
    "content": "I’m like to keep a few bullies, shitty exes etc living rent free in my head to motivate me. Not enemies per se but people I want to prove wrong you know?\n\nSpeaking of motivation, going into a really intense work period starting tomorrow. Any fellow workaholics got tips for how to optimize energy etc during a one-month “work is literally the only thing that matters” stint?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1282466195601232014",
    "author": "conor // wbotm",
    "date": "2024-09-08",
    "content": "ah yeah blame it on us, no for real that's some deal, and i guess goes to show the confidence in quality",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1287456741226840105",
    "author": "Nomograph Mastering",
    "date": "2024-09-22",
    "content": "My mom was a seamstress for many years, the sound of a sewing machine chattering is heaven for me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1287805539832696853",
    "author": "Nomograph Mastering",
    "date": "2024-09-23",
    "content": "The glare, or stress caused by just slapping it on everything is really hard to get past",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1328532911024115783",
    "author": "NoahNeedleman",
    "date": "2025-01-13",
    "content": "Or better yet, close the hitch. Better stability, even if it stresses the suspension a little",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1329471680837451856",
    "author": "cy (sigh)",
    "date": "2025-01-16",
    "content": "1st thing I'd recommend is listening to the Tape Notes podcast. they interview the artists and producers to break down the processes and stories behind the tracks. \n\nI got quite a bit of confidence in that respect from listening to those . especially ppl  that come back multiple times. I don't even necessarily listen to everyone's music, I'm often more intwrested in their personal approaches - especially since lost are folk who we'd consider \"established\"  and what I found to be true for most of them is they split into 2 main camps with most of us dancing between them. \n\na) have 0 clue wtf they're going for a lot of the time. kind of going with the flow of whatever is happening /they're feeling in the moment. very similarly to people starting out or me. the approach can vary wildly and a whole concept can be born of something seemingly unimportant at any given moment. \n\nb) there's an outline that comes to mind early and might give some direction. whether that's thematically or sonically. how tightly they stick to this can vary a lot depending on the artist. \n\nI think there are many factors that come into play - how good and ready the team they have is might be one of the most important imo. that's both for the creative side and admin side. \n\nas far answering  your questions as a producer, it depends. \nsome artist I work with will literally dream up the whole production and I'm kind of facilitating and bringing it into the real world. others will come with loose ideas and others will show up with absolutely nothing and go off the feeling in the moment. some are more involved than others in the production\n\nyour relationship with them is probably the biggest factor in knowing how far you can push their creatively bounderies. \nsame artist that dreams up their production usually gives me free range to try whatever I want when the session is over and I've overhauled whole songs.  recently a post-punk ish artist picked up a video game ost /jazz fusion prod I was sketching",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1343676883492933745",
    "author": "Brian Reynolds",
    "date": "2025-02-24",
    "content": "I've got a term paper my mind wants to dump on the topic of change. And how art it perceived in the moment vs how that perception alters over centuries of time. And how recorded music is still is in its infancy in comparison to visual or written word art.  But I don't have the time, back to work",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1348776705363279923",
    "author": "Berlin",
    "date": "2025-03-10",
    "content": "that being said, the tiny window in my studio (which was plugged for a few years) has healed my mental health since opening it and letting the sun shine in.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1378833608478818394",
    "author": "oaklandmatt",
    "date": "2025-06-01",
    "content": "Everyone's different I suppose. This format feels a little overwhelming to my brain, but to each their own!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1378858828686164129",
    "author": "Jasper Boogaard",
    "date": "2025-06-01",
    "content": "Absolutely - last year I had my record produced by someone who was so attentive to the demo’s, lyrics, what I had to say about the theme of the album. He read things in the lyrics in a way I always hoped others would. It gave me so much confidence in both the music and in him taking on that role that the collaboration became so fruitful",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1395242986396324065",
    "author": "SAM",
    "date": "2025-07-16",
    "content": "the financial stress is real and community can be so so helpful to have in times like that.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407383572238827632",
    "author": "Bryan DiMaio",
    "date": "2025-08-19",
    "content": "That was me in like 2019, I said yes to *everything* before that and eventually for my own mental health I had to make a decision about what my priorities were. I ended up choosing to value self care and family availability higher and it turned out that my clients understood.\nI've had to turn things down, but as long as everything is communicated well I think things end up working out for the better for all involved.\n\nThis industry has a lot of double edged swords though, I think if I had made that decision earlier in my career I wouldn't have had as many opportunities so everything is tradeoffs",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1468662122278944914",
    "author": "Zack Hames",
    "date": "2026-02-04",
    "content": "Def a fine line between confidence and imposter syndrome. Both can destroy you and ultimately a balance or push+pull is normal and probably the most helpful",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1468699874177585273",
    "author": "chrissorem",
    "date": "2026-02-04",
    "content": "I’d distinguish between healthy selfdoubt and imposter syndrome. Selfdoubt can be useful but imposter syndrome often isn’t. You can be confident, humble, and still pushing to grow. If you feel imposter syndrome, it’s worth asking why,  are you actually not delivering yet, or is it just a feeling that you’re not good enough despite the results?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1471704365676105939",
    "author": "andrew_yv",
    "date": "2026-02-12",
    "content": "Do you folks ever have that process where you fall in love with a repertory piece and then go on a mad dive looking for a recorded version of it that feels “true” only to be constantly frustrated?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "806967808483262535",
    "author": "oaklandmatt",
    "date": "2021-02-04",
    "content": "this image is stressful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "808472631661166672",
    "author": "chriswheeler",
    "date": "2021-02-08",
    "content": "hey all, i’m struggling with a career decision of mine and i would really appreciate some other musicians advice! basically i’m pursuing a production career (primarily specializing in mixing) and i decided to take this semester off from music school. i wasn’t making a lot of connections at school so i’m living with a friend in Tempe AZ to meet connections, but the living arrangement really isn’t working out and my mental health is kinda going to shit. i’m not sure if it’s a better idea to power through and stay in AZ or go home and focus on improving my craft. i guess it’s connections and experience against skills and mental peace. i’m really conflicted about prioritizing myself or potentially my career. Matt gave me a great response and i’m infinitely grateful but i thought maybe some other people might have some other advice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "808478700739887144",
    "author": "Josh",
    "date": "2021-02-08",
    "content": "I think the best thing you can do is put your mental health first. Music school is great, but it’s also not going to guarantee you or qualify you for a career in music. I’m sort of in a similar situation as I’m doing something I hate in a place I hate and my girlfriend and I just came to the conclusion that it’s pointless to kill ourselves just existing in a place we hate, so we’re gonna move to Nashville and kill ourselves getting by in a place we actually want to be.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "810027069824172033",
    "author": "dimiterganchev",
    "date": "2021-02-12",
    "content": "Lwmr have like 40+ episodes indepth talk with the same person and that haleps a lot understanding theb philosophy behind a lot of things. As mwmt you only have like 2hrs video out of blue and it takes a lot more to really get what they are saying. But it’s incredible place to hear from a lot of people, to hear lot of pov and then do your homework. Mwtm seninars are a life changers. Once you’ve been there and spent a week with one of these guys everything is different. Then all videos are easy to understand cuz you know what they mean. Can’t stress enough how those seminars (2 for me) changed my life. And then it’s like the Matric - you start to see the code 🥸",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "823645345757921360",
    "author": "Slow Hand",
    "date": "2021-03-22",
    "content": "It's hard to comment on the motivations and incentives of record companies, though. They've become pretty adept at diversifying their income streams and finding money to recoup outside of record sales. It feels like for some companies a merely passable record (although not ideal) is fine since the song or album is more of a vehicle for touring, cross promotion, merchandising tie-ins, sync, etc. Not everything needs to be a masterpiece under this approach to business.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "825791046909952017",
    "author": "peterlabberton",
    "date": "2021-03-28",
    "content": "Guilt not so much, but anxiety—around money—absolutely. I’ve been freelancing full time as an engineer/producer/mixer/drummer for 9 years now, 6 in the Bay Area and now 3 in LA. Easily the first half of my time in the bay was just constant anxiety about how I’ll pay rent/will I work/blah blah. Then things got more solid and I could take my foot off the gas a bit. Was able to relax and feel confident I could make ends meet. Then I blew it all up and moved to LA to start over again! Ha. Not *really* start over again 100% since I had a lot more experience and a tiny bit of a track record, but I’m only now beginning to feel that corner turning again, just a bit. I definitely feel that for me, those feelings correlate to how comfortable I am on, I guess you’d say, the business side and how it’s working out. Creatively I feel like taking time away is always helpful.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "825865179211366471",
    "author": "rae",
    "date": "2021-03-28",
    "content": "Late to the convo but I used to feel guilty about hanging out with people over working and I too get panic attacks (mainly from stress) so I’m sorry to hear about that and I’m happy to recommend some strategies if you need as I’ve kept mine at bay for almost a year now 🙂 \n\nGoing back to the first topic, I use notebooks and diaries to structure my days so I don’t feel guilty when I’m not working. For example, if I’ve agreed to go out with friends on Saturday night and I want to prioritise that, then I’ll figure out how much work I’ll realistically have to do in the day and either set timers for myself to stick to schedule or just follow what I outlined for myself. I find once I’ve achieved something it’s like hanging out with my mates is a reward now for the hard work I put in earlier - and it’s easier to disconnect from the work for a bit and have a good time - hope this helps!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "829454036230078464",
    "author": "peterlabberton",
    "date": "2021-04-07",
    "content": "But I’ve also only relatively recently gotten to the point—after working on records for a decade—to where I feel I am... “qualified” to make that sort of call w h confidence",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "831264031167217725",
    "author": "Deleted User",
    "date": "2021-04-12",
    "content": "Grind and Hard work vs Too Much work - How do I grind and not burn out? I try to take care of myself to avoid burning out and I don’t see myself grinding anymore because I’m trying really hard to keep myself from burning out. But I’m only starting out so it is really time for me to grind and I would like to work hard. I’m very passionate I love music but I feel like I lack the drive to push forward sometimes. Does anyone have thoughts on this?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "836345877420703754",
    "author": "Zakhiggins",
    "date": "2021-04-26",
    "content": "Haha I don't know why I laughed so much at the white bread comparison",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "837795746202910760",
    "author": "alecdibell2",
    "date": "2021-04-30",
    "content": "@cian riordan omg...the $2500-$297 jump is insane to me. I’m the same way with if my investment paid off then I don’t care so much about what I paid in comparison to current price. But wow that’s a huge difference",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "839582283706400796",
    "author": "skinnybreakfast",
    "date": "2021-05-05",
    "content": "Sorry for the book incoming. But this is plaguing my mind. Has there been an in-depth discussion on live or in discord yet about musicians on tiktok? \n\nIt's a crazy scene of selling your creative soul for 1 minute of attempting to go viral. and then if you do get a popular video, whatever that one was - that is now your thing... singing into a trash can doing RHCP covers... ok, now do another 100 of those.  I see so much talent on there, genuine talent and artists who have worked hard on their craft getting 10 views due to the algo... once the algo has tried your vid on a few people and it didn't stick the vid is dead... so it's totally hit and miss based on your first small sample of viewers.\n\nI see this having a huge impact in many ways. On the plus - you are getting exposure to incredible new ideas, skills, trends, methods for being creative... on the negative it's demotivating to the nth degree, and cheapening the creative process, in my opinion.\n\nMatt and Jon recently talked about track lengths getting shorter and shorter, now 2 minutes is the normal. Partly due to the attention span of people... well what is this going to do... 1 minute pop tracks incoming? Just gimme the hook in 30 seconds and let's move on please. :p. How can we get young people to lay on the floor and listen to 10 minute vinyl tracks again? In my opinion humanity NEEDS this :)) \n\nI also swear I've heard the influence of trending memes from tiktok coming through in music in the charts, but cannot really back this up.\n\nWhat's everyone else's thoughts? I have a friend in LA who says everyone has gone crazy there for tiktok fame? 😛",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "843196066911354900",
    "author": "Zack Hames",
    "date": "2021-05-15",
    "content": "Yoga every morning on YouTube (yoga with Adriene), or 15-30 minute walk outside a day. Keeps me energized throughout the day. Super low stress and easy to commit to, but I’m obviously not getting abs anytime soon.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "860576759207690270",
    "author": "chris_donlin",
    "date": "2021-07-02",
    "content": "Dang well I’ve been needing some motivation to be better about general health since I’m not going to the gym. This definitely sounds amazing. Good weight to start with?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "861955713408303125",
    "author": "chadwahlbrink",
    "date": "2021-07-06",
    "content": "> “Dorothea Lange, the Depression-era American photojournalist, used to say that a camera is a tool for learning to see without a camera. Well, a recorder is a tool for learning to listen without a recorder.”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "911071734982131752",
    "author": "Deleted User",
    "date": "2021-11-18",
    "content": "Has anyone gone through a day job dilemma? More hours at day job = probably more money and steady income. But less time to spend on my music career… On top of that, I have a child on the way so it’s not the easiest decision to make right now. This has been stressing me out so much. To explain where I’m at in my career (as a producer) I’m really starting. I have 3 released song under my belt. I want to do way more and gain more experiences but reality is I have to spend time taking care of other need in the house on top of now having to watch the baby to relieve my wife from childcare when I’m back from work. Other than production, I do recording side gigs which I earn from 400-600 USD a month. I’m targeting earning at least 3000 USD a month to be able to pay bills and have some emergency fund saved up. I would be willing to be a stay at home dad, but given our finances situation that wouldn’t be easy… Has anyone been in a similar situation?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "942491189725265970",
    "author": "BillyC",
    "date": "2022-02-13",
    "content": "I figured that, but why not commit to the laptop then? As a frustrated desktop user myself I am beginning to think that immobile computers are kind of ridiculous in the year 2022",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "944712453097422890",
    "author": "Adam Thein",
    "date": "2022-02-19",
    "content": "the 16 is pretty hefty in comparison",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "945435559092957254",
    "author": "Maxim",
    "date": "2022-02-21",
    "content": "Yeah I remember being so frustrated trying to test some other plugins that they advertised as compatible but then it was glitch mania. Trials are different plugins.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "970354585145344132",
    "author": "blanco",
    "date": "2022-05-01",
    "content": "yea that’s my issue with it. people can exploit that stress point to sneak into someone’s inbox. not a fan",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "979577473090064415",
    "author": "ehutton21",
    "date": "2022-05-26",
    "content": "was thinking about this in a different sense. I know it’s been touched on a bit in the discord but I’m keen to hear fresh takes. For those of you with your recording setups at home, what way do you guys go about securing your gear? might by the good ol’ anxiety disorder, but being in LA does have me a tad worried about some of my equipment getting stolen. never lived in such a high traffic area before.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "984169224899547136",
    "author": "ehutton21",
    "date": "2022-06-08",
    "content": "i don’t think they wanted me to explain it fully but oddly enough it was for a role with spectrasonics lmao. pretty sure the goal of the questions was to make you overwhelmed and then see how you respond to being in a high paced environment but it was wild.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "984189285425119252",
    "author": "ehutton21",
    "date": "2022-06-08",
    "content": "twas much more stressful than their GUI makes you think they would be 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "992476606083907584",
    "author": "Josh",
    "date": "2022-07-01",
    "content": "Yeah I was gonna say a live event would be cool. Seems relatively low stress and nothing super extravagant, right?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "998399376831561878",
    "author": "Will Melones",
    "date": "2022-07-17",
    "content": "Yeah I think the least he can do is buy @Jeremy Klein a Distressor",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1008941987543666719",
    "author": "Felix Byrne",
    "date": "2022-08-15",
    "content": "a godsend for downloading stems and shit\njust makes things that *tiny* bit smoother, takes away a lot of stress lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1024869337011605594",
    "author": "Slow Hand",
    "date": "2022-09-28",
    "content": "They just introduced a *Forum* feature 2 weeks ago. We can always experiment with that. That may turn out to be just what’s needed.\n\nI’m thinking lets try *Threads* for a bit and see what does/doesnt work out. I dont wanna overwhelm everyone with every feature all at once.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1026198572569481217",
    "author": "ehutton21",
    "date": "2022-10-02",
    "content": "Smoking them got the CBD to me fastest for pain mitigation and anxiety support. Would use again, although admittedly might try a bong with cbd flower for my lungs if I did inhale",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1026199900045713468",
    "author": "ehutton21",
    "date": "2022-10-02",
    "content": "The mental and nervous effects of THC are just not compatible with any anxiety disorder whatsoever and no matter what I’ve done, when it comes to THC I just have never liked the way it inhibits my brain",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1026200570635227147",
    "author": "ALXCPH",
    "date": "2022-10-02",
    "content": "I used to be able to smoke green and I would chill and function normally. But these days I get too much in my head, so I don’t like to do it anymore. So CBD is a great alternative to still get all the benefits without the social anxiety. For me at least 😇",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1028500820813160480",
    "author": "cian riordan",
    "date": "2022-10-08",
    "content": "I'm happy to relive my Fireman adjacent crisis of confidence if you need fodder",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033181493599666246",
    "author": "ehutton21",
    "date": "2022-10-21",
    "content": "It’s so silly. I had a good friend get invested into music (time wise, not monetarily) and she wanted to be super big about releasing songs and she always loved the praise she got from her friends for her singing. And she asked me what it was like to even drop a song or two on a small scale and try to get people to hear it and my answer was “if you’re doing this to find validation, save the money, maybe look into therapy or something or find ways to feel better in your own world”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1042214064870400070",
    "author": "ALXCPH",
    "date": "2022-11-15",
    "content": "Getting in the hours is great for honing your skills. For sure! And there is no wrong way to do it. But getting those 10,000 hours in is a lot more fun if you are enjoying what you are doing, and not hating every second of it. You don’t have to love the music, but if you hate every project you work on, I think burn out will be inevitable. I like the fact that you spun into a challenge and made it fun by using it as a way to learn even more. But let’s say you wanna be a mix engineer and work on hip hop. If you spend 10,000 hours only mixing country because it’s what pays. You’ll probably never end up where you wanted to go",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1042215282917244928",
    "author": "DAREZ",
    "date": "2022-11-15",
    "content": "I did much of the same and saw it in a similar manner although I think it is important to maintain awareness of burnout and find the right balance for you!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1043268683046330378",
    "author": "ehutton21",
    "date": "2022-11-18",
    "content": "I know mixing is about using your ears but these plug-in makers gotta know (1) I have anxiety (2) sometimes it’s okay to tell me how your tools work 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1043268898402869258",
    "author": "Will Melones",
    "date": "2022-11-18",
    "content": "Hahah anxiety is the key word",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1062213643074293851",
    "author": "hyanrarvey",
    "date": "2023-01-09",
    "content": "So was mixing that crazy jazz record and it gave me an anxiety attack. Needless to say i think its perfect now lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063159798348132475",
    "author": "hyanrarvey",
    "date": "2023-01-12",
    "content": "Content makes me wana off my self, huge part of this burn out i am navigating",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063168703325278319",
    "author": "Chris Doms",
    "date": "2023-01-12",
    "content": "For me content stressed me out like it was this looming pressure\n\nOh, I HAVE to make this stuff as a young music maker or I’m not going to have chances in this industry.\n\nIt seems like you’re past that though",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1063168997098520717",
    "author": "hyanrarvey",
    "date": "2023-01-12",
    "content": "Yeah dude its way to much stress",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1064039351660576818",
    "author": "ehutton21",
    "date": "2023-01-14",
    "content": "@Nomograph Mastering and @BatMeckley are two really respected minds with a lot to say and the discord has a beautiful way of bringing its own lens, and I just think if you joined recently and saw that it was probably a bit overwhelming",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1065550760835821590",
    "author": "Barbara",
    "date": "2023-01-19",
    "content": "They came back with 10 PAGES of comments, with stuff regarding other takes we might had (I forgot to mention, but it was a deal that once I've sent the files for them to continue production, every take and edit was correct and accepted by all of them, in order to commit and make decisions... specially, because it was an edit nightmare, but mostly because I knew they weren't experient and it would be hard to finish anything if we kept having too many options to chose from - which we hadn't. That was indeed the most polished takes and performance they had, and it still needed A LOT of care), a list of reference tracks that wasn't even close in anything to what we had or could ever have, and me wanting not to jump in again on all of that. And during this, I had other people hearing my mix (colleagues) that were harsh on the way they gave feedback - not criticising, I knew it was shite, but I think it was the right thing at the wrong time for me.\n\nAt this point, I was struggling so bad with imposter syndrome, I was seriously considering quitting and getting the blues about the process, not happy with the result but not sure how I could do any better. And yes, I was working on other stuff, but this project was sucking all my energy and mood.\nFeeling like a fraud and a failure. There is no sugar coating it.\nBut most of all, I wanted to make it work for the band. I wanted to give them my best, and wanted really hard that my best could be the best for them. So I kept going, and entered into it. \n\nVersion 2... 7 pages of comments, all on different stuff that I thought we already nailed on the first version, since there was absolutely no comment on those things before... \n\nOh, by the way, by this time, I was still waiting on some dry tracks from the producer, to make moves that the band asked for on the first version review.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1067968650394468353",
    "author": "ehutton21",
    "date": "2023-01-25",
    "content": "I though desktop UAD vs desktop apogee was the more apt comparison",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1067969722819285102",
    "author": "ALXCPH",
    "date": "2023-01-25",
    "content": "That’s a good comparison actually",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069658627318743081",
    "author": "austenballard",
    "date": "2023-01-30",
    "content": "Speaking as someone who moved to the US, there are a lot of things that will make you miss Europe sorely. Mainly quality of life things, especially if you're moving to Texas (although ATX is not so bad)\n\nFirst, as people have mentioned, this country is massive. Everything is disproportionately large and far away. You will drive everywhere, which as a German you might not have an issue with, but it gets annoying when you want to pop over to the corner store to grab something and then you remember that doesn't exist, and then you're driving 30 minutes on the highway to the supermarket just to get two things. Normal errands will take you ridiculous amounts of time if you're not in a dense city, particularly east coast cities (NYC ftw)\n\nNext, there's the increasingly Kafkaesque nature of every commercial interaction in the US. People are generally not paid enough relative to their cost of living and are constantly stressed by student debt, credit card debt, auto debt, mortgage debt (if they're lucky enough), etc. As a result, those in many public-facing service jobs do not do their jobs very well. Sorting out a minor problem can easily involve hours of slogging through telephone menus and talking to service reps who can't really help you. An example is it recently took me over a month and 20+ calls to 4 different places to switch my health insurance, which is supposed to take a week at most through an internet portal (Healthcare.gov)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069665738832478329",
    "author": "Zack Hames",
    "date": "2023-01-30",
    "content": "Anyway…America has some amazing aspects, genuinely. It seems Europeans might be as misinformed about it as Americans are of the rest of the world. (Generalization).\n\nMy wife lived in Leeds for half a year, travelled all over Italy, Spain, France, etc, and loved it. she’s got lots of interesting stories and comparisons about the US to those places. I’ve never been but I hope to go as soon as I can. Seems like you’ve got to get out of the US to appreciate the history, architecture, food, culture, etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069802647877599303",
    "author": "Deleted User",
    "date": "2023-01-30",
    "content": "I was just coming from a perspective of how charts limit people’s explorations of music sometimes. I do believe that different people have different amount of motivations for search for new music, or varying degrees of appreciation for music. But I’ve met many people who just go to charts and that’s all they listen to",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1071526448579485777",
    "author": "popaganda.",
    "date": "2023-02-04",
    "content": "It’s got some aromatherapy thing goin on",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1074412022789308516",
    "author": "David Fuller",
    "date": "2023-02-12",
    "content": "a lot of that overconfidence is gone",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1075807290336219205",
    "author": "austenballard",
    "date": "2023-02-16",
    "content": "oh damn, I'm sorry dude, it's probably my insane anxiety bleeding through the messages. I'll try to tone it down",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078663932929122376",
    "author": "ALXCPH",
    "date": "2023-02-24",
    "content": "Let the man sing if he wants to! 🤠 I’d argue that having some musical experience/intuition is 10/10 times not a bad thing. No matter what your job is in the music making process. \n\nSure it’s not the engineers job to give advice. But if an artist asks when they are stuck with something being able to communicate at the same language is never a vibe breaker. I’d even argue it could enhance “vibes” or confidence, as long as what is being said makes contextual sense. \n\nIt might be different where you are or at your level. But where I am (lower level 😂) who ever is in the room is involved. And if the process is being respected. I’ve been in so many sessions where I’ve recorded an artist and they ask for a harmony advice, or even if we are vocal producing, being able to quickly sing a line to quickly reference a point in the song is so much. Faster then having to look for it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079154753327595585",
    "author": "Deleted User",
    "date": "2023-02-25",
    "content": "But this - I often feel like I'm a therapist with his own issues trying to help patients. I try to learn how to make myself available emotionally as I help artists through with making themselves available. \n\nWhile I can help them get closer, I can't really seem to help myself as much as I would like to. They can do it way faster than me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1079160995064315924",
    "author": "Nomograph Mastering",
    "date": "2023-02-25",
    "content": "*\"But this - I often feel like I'm a therapist with his own issues trying to help patients. I try to learn how to make myself available emotionally as I help artists through with making themselves available. \n\nWhile I can help them get closer, I can't really seem to help myself as much as I would like to. They can do it way faster than me.\"*",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079162586836254840",
    "author": "ehutton21",
    "date": "2023-02-25",
    "content": "Idk how much weight it holds but @Deleted User, just as a friend who’s connected with you throughout, it’s like i said earlier. And in connecting to @Nomograph Mastering’s point (and ironically, the whole comparison game idea that was the genesis of this point), we’re all guilty of feeling like we struggle with the very things we’re so good at bringing out of other people",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079168051083227258",
    "author": "Deleted User",
    "date": "2023-02-25",
    "content": "I guess it depends on the way you look at it. Restating, rephrasing, reframing, and asking questions are a huge help for me. But I think as you said, healing is up to the individual.\n\nI am growing doubt on the utility of talk therapy or CBT as a way of healing. It is certainly useful as a tool of problem solving mindsets, but I think healing is a not quite the same as problem solving.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1079201329441939466",
    "author": "Rollmottle",
    "date": "2023-02-25",
    "content": "do you go to therapy?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079204191819542640",
    "author": "ehutton21",
    "date": "2023-02-25",
    "content": "It’s usually the time for brutal self honesty too, and if you can’t get there, then maybe therapy is what you need",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079205640712491108",
    "author": "Josh",
    "date": "2023-02-25",
    "content": "I have ADHD and unhinged anxiety. So I have all of these little things I do to make sure I don’t implode on a daily basis. \n\nBut the problem is when I’m really bad it feels impossible to even do those little things. \n\nSo my way of getting out of my way is taking a Xanax and working out and eating healthy so I can feel comfortable enough to get some shit done without freaking out.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079211365312503928",
    "author": "ehutton21",
    "date": "2023-02-25",
    "content": "To @Rollmottle’s point, maybe I can bridge this gap here, but from the perspective of someone dealing with mental health issues, it’s a fine line between empowerment and complete lack of accountability. There are ways of accommodating people that empower them, and that’s important. Part of that accommodation looks like recognizing that when someone has a really bad go, they’re going to struggle to assimilate themselves into the rest of society some days. But on the flip side, people with mental health issues are people. My bipolar ass can drive a car—doesn’t mean I get to drive off the road and cause collisions whenever I’d like, and even at my worst I’m capable of knowing that. \n\nAnxiety is difficult in that you often border on delusions—panic attacks are delusions about experiencing serious medical issues for a huge swath of people, and while that can make it difficult to do things like eat on a regular basis, I have to be mindful that having a stringent routine that keeps my triggers at bay is critical.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079216415460036638",
    "author": "ehutton21",
    "date": "2023-02-25",
    "content": "The adderall imposter syndrome",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079822052208410725",
    "author": "spectrummasters",
    "date": "2023-02-27",
    "content": "Thank you gents  @LAPhill  and @David Fuller for those additions ....defo will check them out . @hyanrarvey  the killswitch one is defo impressive and impactful . The guitar sound reminds me of Kirk Hammett and the rest a bit slipknot ? Lol apologies if this some sacrilegious outsider to the genre comparison . I like the mix , it’s super controlled....the Alice in chains one has the rawer rougher dirt I need",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1082402912606625813",
    "author": "ehutton21",
    "date": "2023-03-06",
    "content": "I like RX for editing before processing but you might find yourself getting into an overwhelming wormhole trying to RX all of the high end out, especially if it’s a continuous thing throughout the takes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1086781481776590920",
    "author": "hyanrarvey",
    "date": "2023-03-18",
    "content": "Un released but dead doesn’t stress me out as much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1087367127540965547",
    "author": "austenballard",
    "date": "2023-03-20",
    "content": "Thanks for the morning motivation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1088124040293650494",
    "author": "Zakhiggins",
    "date": "2023-03-22",
    "content": "What are people using to organise their schedules? Feeling overwhelmed with all that I have coming up/on at the minute and need to get my act together with organising and planning. I would like some sort of app that I can look at, but haven't found anything that I like yet.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1089967382811918336",
    "author": "Slow Hand",
    "date": "2023-03-27",
    "content": "Well, I'm no Mozart/Rossini where the music flows out effortlessly. Bad ideas and false-starts are part of the work for us musical mortals. \n\nI don't see being discouraged by a bad AI generation to be that much different than being discouraged by a bad first-draft that I hand-wrote myself. Just go back to the drawing board and keep hacking at it. At least the AI render would probably take less time to execute before I can try again.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1090659089069113494",
    "author": "LAPhill",
    "date": "2023-03-29",
    "content": "Yep, the overwhelming sentiment I was seeing was people wanting the choice of perpetual licenses. Especially makes sense for those that only use a couple of plug-ins. Subscriptions are seemingly the way forward for companies, but most of them still offer an ability to pay more for a perpetual license if you want.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1092634885446971413",
    "author": "esquinalee",
    "date": "2023-04-03",
    "content": "stressful! I maybe worry unreasonably about possibility of power surges or other unlikely misfortunes but I both shut down and completely unplug my setup from the grid each night😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1093090452204441661",
    "author": "spectrummasters",
    "date": "2023-04-05",
    "content": "This external factor selecting grouping in animals is the foundation of why animals developed cue signals and calls and in humans why we developed language . Vigilance is corr to our experience of life . So , in the absence of the natural environmental signals we evolved alongside our nervous systems can become stressed without us knowing . A primary signal with respect to a vigilance cue for humans and most animals is birdsong .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093090649668071494",
    "author": "spectrummasters",
    "date": "2023-04-05",
    "content": "In nature birds go quiet when there are predators close . These are signals our auditory system evolved to pick up on . It’s core to our experience as animals to provide ourselves with these signals for example . So to hear you bring evolutionary biology into the discussions around atmos is so good man . People need to know this stuff it’s vital to our quality of life experience . In my kitchen I alternate smooth fm (70s/80s classics for the sonics ) or birdsong , for the stress relief . I cannot recommend leaving birdsong on for a few hours in your home enough",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093092930840952854",
    "author": "spectrummasters",
    "date": "2023-04-05",
    "content": "Andrew schepps gave a v interesting lecture about his theories on how the way we listen to music now is causing us enormous stress , I see overlap here",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1095110029486604438",
    "author": "Jeremy Klein",
    "date": "2023-04-10",
    "content": "hahaha more of a light hearted \"frustrated\" 🙂 \n\nIm the kind of guy that knows every mixer in the game and what they did, but my friend who probably doesnt know who Manny is could likely out mix me in a ton of different contexts",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1095501383530192908",
    "author": "gagsmile",
    "date": "2023-04-11",
    "content": "I've learned recently that there's endless inspiration and motivation out there, just as there's the opposite. It's all about focusing our attention in the right direction. :r_heartdrip:",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1097625159952777337",
    "author": "spectrummasters",
    "date": "2023-04-17",
    "content": "For the record, @Nomograph Mastering  And @cian riordan  I totally agree with you both sincerely and admire the forgiving energy . The world needs more of it. The particulars of the brits thing I couldn’t divulge without breaching people’s professional confidences so was silly to bring up here, but it wasn’t about a being nice to fans / staff thing ....anyhoo, let he who casts the first stone and all that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1099016001225494538",
    "author": "hendrick",
    "date": "2023-04-21",
    "content": "it’s drug addiction and i feel frustrated because it’s the first time i experience this and don’t know how to move about it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1100289135400456212",
    "author": "stefanmacc",
    "date": "2023-04-24",
    "content": "100 percent confidence follows",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1101896610708988026",
    "author": "Edward Rivera",
    "date": "2023-04-29",
    "content": "LA makes transport unnecessarily difficult. The amount of effort it takes to get to the beach kills any motivation for doing so",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101897261832749117",
    "author": "Bryan DiMaio",
    "date": "2023-04-29",
    "content": "Santa Monica gave me so much stress",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1104426895996624998",
    "author": "youngteam",
    "date": "2023-05-06",
    "content": "totally. I'm a complete noob in this dept beyond looking at sites and seeing what I liked and didn't, this makes it way less overwhelming",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1105148769344946226",
    "author": "Deleted User",
    "date": "2023-05-08",
    "content": "hmm this is the video I referenced for M1vsM2 comparison \n\nhttps://www.youtube.com/watch?v=srnXkD5gIOk\n\nit does a benchmark test on logic at around 11:25",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1108812622297583726",
    "author": "shaunobi",
    "date": "2023-05-18",
    "content": "Good point about being present. I've been going to therapy for awhile now, and we practice \"mirroring\" in session (which is actually DAMN HARD as it turns out), and also being able to put yourself in the other person's shoes and, without saying you agreeing with everything, picking something to say \"that really makes sense to me when you said ___\".",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1108848843958796420",
    "author": "shaunobi",
    "date": "2023-05-18",
    "content": "Great conversation. My experience with active listening is that it's best learned from a person. There's a lot of pitfalls to fall into, and you really need someone to correct you in real-time so you get the \"feel\" of the emotional response. (Much as I love books and have absolutely read books on the topic, my personal experience is that a trained therapist was what actually changed my behavior here.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1112862145357566014",
    "author": "cian riordan",
    "date": "2023-05-29",
    "content": "That’s a fucking ear massage in comparison.",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115435250366034080",
    "author": "peterlabberton",
    "date": "2023-06-05",
    "content": "Trying to add to things and make a broader point without stepping in shit… I think I probably often come off as a Luddite, but I am truly not at all. I’ve always been a tech geek at heart. But I do deeply feel a resistance to tech that feels foisted on us, the general public, as it so often is just money making wrapped in the veneer of “progress” (or connection or whatever). Not said in this context with a political motivation, but, in capitalism we just have these things popping up all the time with no regard to whether we *want* them or whether they will make our lives *actually better*. And no, I don’t think an app that streamlines you getting your dog groomed or whatever is actually a substantive improvement in human life. So much stuff we have now actually makes us *less* happy and fulfilled, and so I always want to push back on the next new thing having had the hindsight of how these products have played out over the last two decades. (Thus ends a half-baked tech screed—sorry y’all.)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1115688497681023047",
    "author": "sarawls",
    "date": "2023-06-06",
    "content": "My mix mentor has never had a social media presence of any kind, no website, doesn't have a cell phone, and is constantly booked out months in advance and totally overworked and complaining about needing to set boundaries for his mental health.  And his career began in the age of social media.  He pulled a rabbit out of a hat.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1115807159029092382",
    "author": "Bryan DiMaio",
    "date": "2023-06-06",
    "content": "One time when I lived in Burbank, my garage got broken into. I had a rackmount Apollo and some microphones set up to record drums but they took my practice guitar amp, which was barely worth anything in comparison 😂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1116776249453449471",
    "author": "ryount",
    "date": "2023-06-09",
    "content": "How are we dealing with burnout around here? Hitting so many walls lately and feels like there’s not much end in sight.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1116778649476149278",
    "author": "jantrit",
    "date": "2023-06-09",
    "content": "Spend time outside, eat well, stay hydrated, take frequent breaks, sleep well. Take time to step back and look at what you’re doing, see the parts of the process that are causing stress and how best to alleviate that stress",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1116841926142984353",
    "author": "shaunobi",
    "date": "2023-06-09",
    "content": "I resonate with what Jos says above. I've experienced two things over time, both of which I called \"burnout\". The first is just emotional / creative exhaustion. I pushed it too hard and didn't take care of myself. Things that used to bring me joy hadn't changed, I changed, and I didn't want to look at them at the time anymore. Working out, taking time off, spending time with people you like / love that recharge you, hiking, this sort of thing can fix it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1117167805134012426",
    "author": "popaganda.",
    "date": "2023-06-10",
    "content": "Besides breaks and resets and all that, what can you do to shake it up and find enthusiasm again? Maybe there’s a new genre you can try to get into, or a new skill-set or role that feels more alive? My antidote to studio burnout is usually to play out more or dig in on an instrument. If you’re mostly mixing I guess you need to keep it flowing but maybe there’s a way to just flip everything on it’s head so it feels fresh again? Trying to maintain and rediscover enthusiasm is the most important thing we can do in music I think.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1119992733579358329",
    "author": "bobby k",
    "date": "2023-06-18",
    "content": "i guess i should clarify for anyone who cares that i’m not too bogged down by comparing myself to peers or family. it’s more a question of how do we strategically field these nosy conversations to actually be productive or interesting. more of a concern of energy and time than self esteem",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119993961080172585",
    "author": "austenballard",
    "date": "2023-06-18",
    "content": "I think you can die in regret no matter what you do, not sure this is the accurate comparison",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120075660405256214",
    "author": "Deleted User",
    "date": "2023-06-18",
    "content": "I had a similar but different experience yesterday. My partner and I went to her friend/co-worker’s birthday party, and the friend’s father was hella  faded and put his hands on my shoulders and said “This is not just Hennessy talking, but you’re young. Make sure you do something you’re passionate about and make damn sure you get paid for it”. He doesn’t know me nor does have any idea what I do. It was a random thing that he just said. And during the whole rest of the time my partner asked my “why is your head so warm?” - I realized that got me thinking about my life and how little money I’m making right now. It was getting me stressed and anxious",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1120089431127371817",
    "author": "Deleted User",
    "date": "2023-06-18",
    "content": "Right off the bat, lack of money immediately limited options for my whole family and the most apparent thing was housing. The most basic need of all. I may be 24, but I became a dad young- so I do have to worry about it. Maybe not as much as other young parents around my age because I have a family to lean to in the time of need. But the lack of options with housing was what repeatedly frustrated me from my late teens and until now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1120091936565510235",
    "author": "spectrummasters",
    "date": "2023-06-18",
    "content": "I’m with you re your anxiety",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121156455421198537",
    "author": "Nomograph Mastering",
    "date": "2023-06-21",
    "content": "Spoken as someone who has been on the hook of perfectionism for many years",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121547195062169741",
    "author": "louisvie",
    "date": "2023-06-22",
    "content": "Reading everyone's thoughts for the fitht time today and feeling reaallyyyy freakin grateful for all the feedback and caring. In 24 hours I went from frustrated teen to actually considering the whole picture and what the best choice is for me in the long run.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1123755259832057970",
    "author": "Josh",
    "date": "2023-06-28",
    "content": "Therapist: the BareMos room can’t hurt you. It doesn’t exist \n\nYouTube: Yooooo check this out",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124751420642574459",
    "author": "spectrummasters",
    "date": "2023-07-01",
    "content": "Yeah man I hear you fully , well said . I think what I’m poking at and certainly what the discussion was demanding was that , the engineers are the ones now who are the most pivotal people in a billion dollar grossing industry ….. the work is skilled , it’s vital to the industry , it’s long long hours , on 24/7 call , engineers often encounter burnouts …..like shit needs to change because all though it’s in an artistic field it is an actual job",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1125254643061116958",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "I’m okay with the saltiness- yeah, sometimes it hurts but that’s how truth feels sometimes. But “be better and wait to be better, keep working hard” isn’t really an actionable advice, which is why I don’t really find it helpful. I know it’s coming from a place of care, and maybe hating seeing a young man waste his time stressing out about this - but without an action plan, it’s just running with destination in mind but no direction.\n\nNot like I’m avoiding trying to be better or more valuable either… I put in time and reps, today just happens to be my off day and I chose to riff on it and brainstorm about this all day. Since last discussion I tried my best to think of how can I be more valuable- and I came up with a few things, and this was one of them. \n\nI’ve reached out to musicians and mixers so I have them on dial when I need them, that was one thing I could think of. \n\nBut that was pretty much it besides the obvious part of putting the reps in. Did you have anything else in mind on how I can be more valuable as a producer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125258144566759535",
    "author": "Bryan DiMaio",
    "date": "2023-07-02",
    "content": "That’s something a therapist could probably help with more than we can. I don’t mean that in a “not our problem” way, just a “not something we’re qualified to help with” way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1125258772386943029",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "Well, therapist can’t offer me help on “what can I do to succeed in music business”. But helps me digest how I feel about not doing well.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1128515264145797131",
    "author": "AJ",
    "date": "2023-07-11",
    "content": "What was your initial motivation to have kids? Is it something that you've always known you wanted?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1128570508372349030",
    "author": "AJ",
    "date": "2023-07-11",
    "content": "While I don't necessarily agree with this perspective, I appreciate it. My mom has expressed a similar sentiment. She uses the example of how the overwhelming love and protection I have for my younger sisters . \"It's significantly amplified when you have a kid. Why wouldn't you want that?\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1128580541462102026",
    "author": "cian riordan",
    "date": "2023-07-11",
    "content": "Neither do I. But if we’re going to compare things, let’s make them relative comparisons.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1129804861412745387",
    "author": "peterlabberton",
    "date": "2023-07-15",
    "content": "Managing time has been a bit tricky as I’ve moved further into mixing primarily. Scheduling was easy when I was mainly tracking or touring—now I’m 9/10 times on my own schedule and just balancing which projects to work on by when they need to be done, the clients’ sense of urgency, if they’re paying full rate or not, if I’m excited by it, if I’m frustrated by it… etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1130188976146362468",
    "author": "Nomograph Mastering",
    "date": "2023-07-16",
    "content": "Let’s just say I needed a therapist way more than I needed a new calendar app",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1131045193236357191",
    "author": "OJ",
    "date": "2023-07-18",
    "content": "Same! It's OK pay but recently been feeling a bit stressed like, having to push creating in hopes to get good streams or a placement etc to pay bills",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1138591416449249300",
    "author": "Nomograph Mastering",
    "date": "2023-08-08",
    "content": "Listen widely and deeply, but direct comparison relentlessly is brutal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138714584748929064",
    "author": "spectrummasters",
    "date": "2023-08-08",
    "content": "“Comparison is the thief of joy “ ……woiiiii. When audio discussions transcend into the ethereal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1138873668697591930",
    "author": "lystell",
    "date": "2023-08-09",
    "content": "That's actually really cool. I have definitely been (sometimes still is) that island guy, surrounded by the big ocean of - this is how you should do, he and she do this aka GS. Referencing is a great example. -You should have these speakers and reference this and that way.  I couldn't describe it better than you did *Comparison is the thief of joy*. It might work for someone but not for me. It can be hard to trust your gut/heart/ears.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1139351305928843354",
    "author": "hyanrarvey",
    "date": "2023-08-10",
    "content": "It was like goood god imposter syndrome kicks in hahaha",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1141511648138506403",
    "author": "Deleted User",
    "date": "2023-08-16",
    "content": "I wish I could rent Penske and call it a day, it would really relieve a lot of anxiety",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1141840588371661002",
    "author": "Deleted User",
    "date": "2023-08-17",
    "content": "Nope - so I put in my contact info on 2 moves and they transfered me to a bunch of companys and now i'm getting overwhelming amount of calls. They just started asking me questions when I was about to ask them what the name of their company is\n\nAlso most of them turned out to be brokers, meaning they subcontract transportation- and that’s a no go",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1142141024379084950",
    "author": "Josh",
    "date": "2023-08-18",
    "content": "The beginning of this year was super hard for me so I just disappeared online to focus on my mental health.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1144275381621379222",
    "author": "Luke DeJaynes",
    "date": "2023-08-24",
    "content": "There's also something to be said for the rare cases when you can humbly, and kindly say \"I might not be the collaborator to get the results that will please everyone on this\".   That conversation ALWAYS sucks and stings a bit, but sometimes shows a confidence and maturity in what you do.  I've had to do this a couple of times, and though it feels like a bit of a failure, it's just acknowledging the reality of the entire situation, and perhaps saving a relationship.  But it's hard to know when to take that approach.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1145114050196422677",
    "author": "Nomograph Mastering",
    "date": "2023-08-26",
    "content": "I understand that people like Godin try to downplay innate talent because they (rightly?) feel that it undermines motivation - the classic “I’m not as talented as EVH so I’m going to give up now”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147972069070471178",
    "author": "Edward Rivera",
    "date": "2023-09-03",
    "content": "This is so on point and can't be stressed enough. It's the same lost in the sauce with a different flavor",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1149432741113385000",
    "author": "Zach Hughes",
    "date": "2023-09-07",
    "content": "Little nugget of motivation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1156626691746189322",
    "author": "Nomograph Mastering",
    "date": "2023-09-27",
    "content": "Spider was baffled or even frustrated why I wouldn’t call out certain things and to me it was all about likelihood of change being possible. So if for example we knew that someone was gonna be stuck on Amphions for another few years then aside from saying something “there’s low hanging fruit there when you can make a move” I would focus on things we *could* change - flip the layout, delete Sonarworks etc etc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1156628992435175504",
    "author": "Nomograph Mastering",
    "date": "2023-09-27",
    "content": "Sending people out the door with confidence in their record IS my whole job so I think about this a lot",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1165346035913203825",
    "author": "Josh",
    "date": "2023-10-21",
    "content": "Seawell Studios is the only gear YouTube channel I’ll check out. Dudes super mellow and doesn’t even really voice opinions but shows great comparisons between units.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1169859504582692936",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-02",
    "content": "ie there's more \"pop\" of course but it's so fused with other stuff I find it indisctinct in comparison",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1175227836160819250",
    "author": "NoahNeedleman",
    "date": "2023-11-17",
    "content": "@austenballard, don’t be discouraged by all the audio nerds asking for a podcast. Focus on the thing that brings you joy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1183263627592085584",
    "author": "Ingmar Carlson",
    "date": "2023-12-09",
    "content": "That said, I had a dream last night that I was looking through Serban’s template. Why am I even paying for therapy?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1184225018880720927",
    "author": "SujalMixes",
    "date": "2023-12-12",
    "content": "Hey guys I hope you're doing great\nI just want to know how you guys levelled up your Mixing Game(I mean skills)\nI know Mixing is like the more you do the more you learn and Improve, totally agree because I know that I'm improving every day but i lack in some sections\nI can Make elements to not fight with each other, basically i unmask them but still I lack how to get that Clarity and Glue like Top Tier guys (Serban,Josh,Jaycen,Mike)\nProduction definitely matters I'm aware about that but Still I want to know how to improve.\n\nJust sharing my doubt with you as I'm \nSuffering from Imposter Syndrome from the last few days.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1187150182853394494",
    "author": "cian riordan",
    "date": "2023-12-20",
    "content": "Get this app for the watch, leave your phone at home -- cutting down on the weight might help your range anxiety a bit. https://apps.apple.com/us/app/watch-app-for-tesla/id1512108917",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1187709830849363988",
    "author": "spectrummasters",
    "date": "2023-12-22",
    "content": "Thanks marv ……the only dongle I have on the iMac is for EL’s distressor so hopefully that means all the key files and their locations would be transferable intact ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1189979198945759342",
    "author": "ehutton21",
    "date": "2023-12-28",
    "content": "I’m not saying everyone make a spontaneous jump to LA, but if you have a feeling in your gut that you’re not satisfied with things in your life and maybe that looks like being really frustrated with people or things with very little justification, maybe you gotta start doing something for yourself. For me, I saw the cost of living (more emotional than literal, but the literal cost was a good wake up call) and said “wtf am I still doing here at 24, why am I forking up this much just to feel like I should be elsewhere”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1192277934942208104",
    "author": "Bryan DiMaio",
    "date": "2024-01-03",
    "content": "I feel like that’s imposter syndrome talking. I’m sure you have compelling music",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1199420868682580058",
    "author": "Will Melones",
    "date": "2024-01-23",
    "content": "As someone who works in the basement with ceilings I can taste from my chair, I get it.\n\nOk, hear me out. This thing is a lot more affordable and sometimes tricks me into feeling like there's a window in my periphery.\n\nhttps://www.taotronics.com/products/tt-cl011-light-therapy-lamp?_pos=5&_sid=2d52178c5&_ss=r\n\nNow, if we could just fashion a couple hundred of these into a diffuse cloud (pardon the pun), it just might come under budget.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1200691670916808774",
    "author": "spectrummasters",
    "date": "2024-01-26",
    "content": "Apparently this genre causes depression",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1201304735865655438",
    "author": "NoahNeedleman",
    "date": "2024-01-28",
    "content": "His excitement is childlike in the best way.  He’s 16 and 60 in the same body and it’s wild. \n\nBut Beckley’s super power is his understanding of why he thinks & feels what he does, and how he uses story to communicate that. He moves fast but can also stop and unpack deep thoughts along the way. My sessions with him were half marathon & half therapy sessions for the artist.  \n\nBut his energy is boundless, so 14 hours goes by real quick.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1208508626336088114",
    "author": "Ingmar Carlson",
    "date": "2024-02-17",
    "content": "Something I'm still working on always, of course. Sometimes it's projecting a degree of confidence and certainty – this is what it is. Sometimes it's making space for anxious, pedantic tinkering and intellectualizing, and not trying to quash it or stop it in its tracks with engineer-brain certainty.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1209219324083183676",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-02-19",
    "content": "Just mentioning as a counterpoint - I have a lot of people in my friendship circle and feed discussing the words on the outer layer of Slow Hand's pic - especially the ones pertaining to mental health and anxiety, which seem to have been nuanced and de-stigmatized massively since my childhood",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1209248167535575040",
    "author": "Deleted User",
    "date": "2024-02-19",
    "content": "when we think of how language and words get created out of necessity, we can also use that to work our way back and analyze why certain words become popular or lost its use over time. especially with internet, language started driving a good part of pop culture. we don’t want the words to limit our expressions, we want words to enable more articulate expressions and thinking -> both are happening from what I see. \n\nWhy does the new generation feel the need to minimize and maximize everything? Why can’t we spend our effort into exploring everything in between? \n\nDo everything in between come with labels or do they become lengthy sentences and paragraphs? \n\nI think the answer to all of this is complexity of life that us humans brought onto ourselves. That is the cycle of “why older generation can’t understand newer generations”\n\nolder generations make the world “better” - (technologies and advancement of civilization & cultural understanding ) for the new generation. But what this “better” comes with many times though, is complicated soup of mess. This causes overload in young people’s minds trying to make sense of this world. Many or most don’t have the patience to keep on trying to explore the nuances in between. Or can’t afford to take the time / invest the energy to do so. I believe the lack of dimensions in the new generation’s language is a product of this. \n\n@NoahNeedleman said older, less nuanced in opinion & younger, less nuanced in language. I believe both are true for both younger and older people *if they ended up giving up trying to dig deeper to explore and ponder on “everything in between”*. I don’t think age has anything to do with it. It’s just that the disparities between those who had the patience for nuance vs those who gave up trying become more apparent as people get older.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1209356533188526190",
    "author": "Deleted User",
    "date": "2024-02-19",
    "content": "I also want to mention something I learned about recently, and that is borderline intellectual functioning. People with IQ between 71-84 are not categorized as disabled and you won’t notice them in everyday life, but it can be as common as 1 out of 7 people. They won’t be able to get a disability check, but will have harder time living than others with average or higher intelligence. \n\nIt gave me a new perspective on why I can’t seem to communicate with or understand certain people, and that it needs to be approached with empathy whenever possible. \n\n+ poverty can affect people’s brain development. not only from the lack of education but the stress that goes on in the household due to poverty can affect children’s brain development. Truly unfortunate viscous cycle…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1212547756355362836",
    "author": "Nomograph Mastering",
    "date": "2024-02-28",
    "content": "A combo of technical brain, fear, perfectionism, insecurity",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1212832297619824710",
    "author": "NoahNeedleman",
    "date": "2024-02-29",
    "content": "This whole thing resonates with me enough that I’m not even curious for details. Are you feeling frustrated by it though? Or just noticing it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1213674933431832616",
    "author": "Slow Hand",
    "date": "2024-03-02",
    "content": "I find the largest thing I struggle with these days is having the confidence to commit to the path I’m on. One that’s rooted in deep questioning and continual renewal of everything that I know.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1213675081604014183",
    "author": "BatMeckley",
    "date": "2024-03-02",
    "content": "Weird to me how people can’t differentiate “confidence in your taste” with “know it all”. These are very different things…",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1216787893759119540",
    "author": "Jeremy Klein",
    "date": "2024-03-11",
    "content": "wanted to take the gangs temperature on home ownership.  How are we feeling about it lol? I've owned a home in Portland since 2017 (low interest rate locked in) that i now just rent out, and honestly, its making me sick how much _more_ money i would have made if i had just left my money in stocks instead of used it on the down payment. \n\nIts such a huge hassle and source of stress, so im considering selling it. But idk... diversification and all that jazz.\n\nSo, does anyone have strong feelings on home ownership?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1216974710257094818",
    "author": "Deleted User",
    "date": "2024-03-11",
    "content": "Whether that was the best use of the money at the time is probably a different question than whether you made a good investment. \n\nComparing real estate and stock is probably apples to oranges. Yes, you get some amount of volatility that could potentially generate more returns in a shorter period of time - but that also means more risk.\n\nI don’t know if you already own/trade stocks, but I would say it’s likely going to be more stressful than owning a home… Stock market isn’t for everyone. I certainly don’t think it is for me with the way my mind works. I know a few people whom their overall lives would be better off if they just invested in MMF, index funds and bonds rather than stock. Just because how anxiety inducing it is and there’s so much to keep up with at all times… If you’re not doing that or have the stock managed by someone who does that, it’s not really much different from gambling. \n\nAnother thing, there’s probably always another investment that could have made more money- but there’s always another investment that could have made more loss. It’s not worth dwelling on because there is no end to it. So don’t beat yourself up about this. As others have said, if you have tenants paying rent then you are still building equity over time",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219755368859701319",
    "author": "Zach Hughes",
    "date": "2024-03-19",
    "content": "Late to the party. I do like this question. \n\nFor me #1 would probably be a 5. Something special about dancing with an idea that's been around for centuries or millennia even, but also very exciting to explore the cutting edge. Hard for me to pick one over the other.\n\n#2 I'd go with a 7 maybe. If I knew more than anyone else about one thing I'm not sure that would maximize my wellbing / happiness. One of my great joys in life is to pursue the myriad of curiosities that bubble up in me. I would hate to neglect them. Besides there's a lot of cool shit out there.\n\n#3 My default here is a 10. As much as that has been a gift and helped me navigate my career I'm not sure it's best for my wellbeing. My gf is probably closer to a 0 here and she is generally happier than I am and very successful in her career. Perhaps there's a more emotionally regulated way to view the long-term but I see risk, upside, downside.. If I'm not careful it can induce a lot of stress. I think I'd rather crank the slider closer to zero the older I get.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1220793579862229113",
    "author": "peterlabberton",
    "date": "2024-03-22",
    "content": "I just don’t understand the motivation behind it, on a deep level. Not that I doubt lots of people essentially think that—it’s just *so* counter to what I value and how I see things.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1224399265976291389",
    "author": "hyanrarvey",
    "date": "2024-04-01",
    "content": "today is always so damn stressfull",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1225818856648347648",
    "author": "Charlie Deane \"Hypn0.iRL\"",
    "date": "2024-04-05",
    "content": "have you seen the colt capperune monitor stands comparison? the on-stage stands or gator stands style trounce cinderblocks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1228143837411541033",
    "author": "cian riordan",
    "date": "2024-04-11",
    "content": "\"Here's a song that speaks directly to that one shitty, lived experience you went through 20 years ago and still haven't sorted out in therapy\" kinda shit.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1228146168714891304",
    "author": "LAPhill",
    "date": "2024-04-11",
    "content": "@David Fuller I think that this technology is overwhelmingly here to replace stock photorgaphy and production music. \"Content\" that just needs some sound effects, endlessly custom thumbnails for videos, what have you. I worry more for the decimation of the training ground on which many people get their start, or pay their bills. There's a lot more money in \"I dont need to license music for every 30 second youtube ad anymore\" than \"Let me try to write a hit song that has an incredibly small chance of hitting\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1229945410802417714",
    "author": "Nomograph Mastering",
    "date": "2024-04-16",
    "content": "Your therapist will tell you that when Nomo is mean to you about Nerd stuff it’s really his own issues with nerdiness",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230307310098972684",
    "author": "Matt Huber",
    "date": "2024-04-17",
    "content": "So, first of all, thanks to the buds here who appreciate what I’ve posted in the past.\n\nSecond of all, my thoughts on this:\n \nI have a personal rule that I will NOT post anything that feels like EFFORT or out of a motivation to game the algo. If I’m “making content” and notice that I’m doing so out of a place that is less than genuine, I will just delete and move on. \n\nFor me, the “mix tips” thing came out of a sincere place of excitement and passion. I would, as a growing mix engineer, stumble upon something that excited me, and I would find myself wanting to turn around to the people in the room to share…well, there’s almost never anyone in the room with me. So, I channeled that passion and excitement in a genuine way to share with the small community of mixers, mastering engineers and producers that I knew on IG. \n\nAt the beginning of my career on to the middle of my career, that became a very fruitful source of business for me - people who followed me on IG, who enjoyed my posts, and began to view me as someone who MIGHT know a thing or two about mixing. \n\nAs my career has developed and my clientele has growing, that has become less important, but it was absolutely pivotal in helping me build a deep bench of great clients, both indie and signed. \n\nBut…I NEVER did it for that reason. It was always (and continues to be) a genuine result of my passion for what I do.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1231704302159007775",
    "author": "spectrummasters",
    "date": "2024-04-21",
    "content": "Ya , for me my intuition is ….i have a number of. Elements interplaying in a stereo field ….ive carefully curated their dynamics and balance (tonal and loudness ) and I want them to speak to each other (dual mono )  not compel each other (linked comp ) …..in my head this is how I think of it and then of course I’ve built a mix into it so …..flipping into linked mode would not be an honest comparison at that stage",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1231710745516052481",
    "author": "Nomograph Mastering",
    "date": "2024-04-21",
    "content": "So with any of those big moments on the record it was careful comparison to the ref to make sure it didn’t shift in a negative way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1231997105065824276",
    "author": "cian riordan",
    "date": "2024-04-22",
    "content": "(I joke. Comparing them is stupid. But it is a funny comparison)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1232694978421985280",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-04-24",
    "content": "So you‘d go through the verse, pre, chorus, bridge one step at a time? I do the same otherwise I feel like it gets overwhelming",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1239613425416667268",
    "author": "Edward Rivera",
    "date": "2024-05-13",
    "content": "Was never interested in playing band therapist. You can resume work once they’ve come to you with their shit together",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1244826927534182480",
    "author": "Jonathan Jetter",
    "date": "2024-05-27",
    "content": "e.g a $4k/month LA house where you can also have a mix room sounds like an absolute bargain in comparison.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1244853737088880731",
    "author": "AJ",
    "date": "2024-05-27",
    "content": "I've only visited a few times, and it was a while ago. But how much of a concern is this compared to Southern California or the bay area? I spent most of my life in the former, and my university is in the latter. The cost of living is insane here too, but I admittedly don't know the comparison.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1246168986538741930",
    "author": "bobby k",
    "date": "2024-05-31",
    "content": "feeling a little stressed from a massive end of week to-do list i'm plugging through. needed to come in here and let out a little steam",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1248749532536246465",
    "author": "cian riordan",
    "date": "2024-06-07",
    "content": "Now if I have a glass of wine, my motivation for working plummets through the floor boards.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1249960900232876132",
    "author": "spectrummasters",
    "date": "2024-06-10",
    "content": "The earths magnetic 🧲 pole is shifting and sea life and bird migrations are potentially being disrupted by changes in our emf , which is in flux with the overwhelming emf from the sun ☀️ (far greater than our own on 🌍 )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1266891002963296257",
    "author": "Ed Sokolowski",
    "date": "2024-07-27",
    "content": "oh I absolutely think social media has had a massive influence - I think they’re very aware of their online persona and how they present themselves, and I think there’s a certain anxiety/insecurity tied to it if they are caught off guard. I think younger generations in the UK are more likely to be in the gym or nando’s than getting smashed off their tits in a pub.\n\nI remember a few years ago noticing on some party islands how when I first went, I’d never seen people so drunk. By the last visits when I was admittedly too old for that shit, the kids were more into laughing gas and staying in control of themselves.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1268647090037461002",
    "author": "spectrummasters",
    "date": "2024-08-01",
    "content": "It’s all engineering baby 👶 Understanding the principles / phenomena of what I’m working with , gaining skills and knowledge of my tools and the experience of the consequence  of using different tools for the same and different problems …….ie. Gaining competency , then confidence in my ability to choose from a selection of the right tools …..and processes , to get me to the required result in accordance with the principles …..and finally being consistent under pressure  . Electrical work/ audio work…..exactly the same . My construction work does really inspire my audio work .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1268982213182226492",
    "author": "spectrummasters",
    "date": "2024-08-02",
    "content": "Are you saying this from a place that you’re frustrated with an idea of hard work leading to success because you think there’s a different more helpful approach that isn’t being broadcast as much to people ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1270169719068033059",
    "author": "Eric Martin",
    "date": "2024-08-05",
    "content": "I put it in one of the too many boxes I’ve kept of all the gear I have, my attic is overwhelmed with empty boxes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1275940292880633929",
    "author": "hyanrarvey",
    "date": "2024-08-21",
    "content": "But it’s super stressfull",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1277294666039037982",
    "author": "Zach Hughes",
    "date": "2024-08-25",
    "content": "This video brought to mind a highlight from a recent read: \"When you’re invested in a goal, being doubted by experts is a threat. They may be credible, but since they don’t recognize your potential, they’re not coaches who will help you improve. Their disbelief quickly becomes your insecurity. It shatters your confidence and stifles your growth. That’s a self-fulfilling prophecy. But the research suggests that when they come from an uninformed audience, low expectations can become a self-negating prophecy. You’re motivated to shatter their confidence that you won’t succeed. Samir calls it the underdog effect.\" - Adam Grant, *Hidden Potential*\n\nAlso related are the concepts of the Pygmalion and the Golem effect in social psychology. Where low / high expectations for students / beginners can become self fulfilling prophecies. Begs the question how do you find the balance between being honest / truthful with folks just starting out without significantly undermining their intrinsic motivation and confidence?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1277659732693221436",
    "author": "Zach Hughes",
    "date": "2024-08-26",
    "content": "If you don't mind me asking, were the people who told you you were going to fail experts / higher-ups in the industry / had credibility to you or more laymen / outside the industry / non-credible folks? I'm not asking to be specific here or name names or anything. I'm just curious if they all had equal weight in forming the 'fuck you' attitude and motivation; all like fuel for the same fire.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1278381668389884039",
    "author": "Chad Rodgers",
    "date": "2024-08-28",
    "content": "Justin Vernon does it now as standard pretty much. Not sure what I think of it. I’d find it quite isolating personally, but if it combats stage anxiety or something for the artist and results in a better performance, then I’m all for it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1280175975052873826",
    "author": "Dereck Blackburn",
    "date": "2024-09-02",
    "content": "Without telling the story about two years ago I had my first “bad” client. They were in the middle of building a house (unknown to me) and decided this would be a great time to manage that project but also make a record with me. Because I was under the impression that studios were financially out of reach for this person, I worked at half my usual rate and allowed them to give me a small deposit to start working together. MY MISTAKE.  Every time they came to the studio they were stressed out and unfocused. I did my best to make their home recordings sound great but there was very little good communication and it ended up that when I sent a mix over, I got a 8 paragraph dump about how nothing is working out, the mix was nothing they would ever release, then proceeded to call me a bunch of names - just taking out all their frustration on me. I zipped up all the work I had done so far and sent it over saying I think it’s best if we went our separate ways, you can do what you like with what we’ve done so far - I don’t want any credits at all. Since then it’s motivated me to make sure that I am following my process and OVERcommunicating every step of the way to be sure there’s no confusion about the work I do with clients. I learned that this former client bad mouthed me to a few artists and I lost some work because of it. Eventually work got back to normal and it’s been steady rocking ever since. The memory of how I felt motivated me everyday to be better than the day before, no joke - I know there’s going to be bad days here and there but I’ll be damned if I ever let someone take advantage of me like that again.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1287308733856223232",
    "author": "Nomograph Mastering",
    "date": "2024-09-22",
    "content": "And I should clarify when I say sustainable I mean, businesses that last rather than peak and burnout",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1291753518536851486",
    "author": "spectrummasters",
    "date": "2024-10-04",
    "content": "You’re right to hunt down the source though . Noise is stressful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293283191490215937",
    "author": "youngteam",
    "date": "2024-10-08",
    "content": "I wasn't aware of seqtrak, I can see the comparison.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1293325416139849760",
    "author": "Will Pragnell",
    "date": "2024-10-08",
    "content": "i think it really depends on your workflow and use case. for me, it kinda ticks all the boxes. i'm struggling to see the comparison with the mobile app (which i deleted pretty fast)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1299719273903689788",
    "author": "centonomic",
    "date": "2024-10-26",
    "content": "Physical therapist got me dead hanging from the bar recently. I’m only a month and a half in but  having similar experience to @masteredbyjack",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1300212465149411398",
    "author": "Nomograph Mastering",
    "date": "2024-10-27",
    "content": "What is the confidence level that there is still an entity (of any form) that will pay more for a Music Related Masters qualified candidate in 10 years?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1300214041406607482",
    "author": "Spencer Broschard",
    "date": "2024-10-27",
    "content": "I’d say music therapy would still be a viable career path in a decade. Honestly can’t think of much else that won’t or at least couldn’t be taken by AI",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1303404609569820723",
    "author": "SoundsLikeJoe",
    "date": "2024-11-05",
    "content": "Yes...  that I got.   It's more the subtext that I was thinking of....  feels very \"It was our problem.  Now it's your problem. Get to work bot.\"   \nTheir system was under stress.  They used the power position to encourage labor by their suppliers without any change to compensation and (likely) with threat of negative consequences if the problems are not engaged by the supplier. It's disguised as a good thing but all the subtext is negative. The Oligarchy has a problem.  Fix it for them, or else.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1317590866537480337",
    "author": "Nomograph Mastering",
    "date": "2024-12-14",
    "content": "2) so much can be said on the perfectionism thing, but a question that gets to the heart of much of it is “what is this piece of work for?”. Is it about your ego, insulating you from criticism, effecting change?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1340194834186502244",
    "author": "itaylerner",
    "date": "2025-02-14",
    "content": "Can’t speak on the LA part but I’ve had both a home studio and spaces I’ve leased and I really love getting work out of my house. I’m way more productive, it’s a lot better for my mental health, helps me be more present at work and at home. So many benefits tbh, I just take myself more seriously that way, and others do too. I just make sure I have enough of a rig at home that I can do simple prep work, revisions, alts etc at home.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1340823978129752146",
    "author": "samvalentine",
    "date": "2025-02-16",
    "content": "Have been thinking a lot about this as some friends are buying their first homes. Owning seems so stressful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1342267082972332203",
    "author": "bobby k",
    "date": "2025-02-20",
    "content": "if you need more tips let me know! the last thing you'd want is a nice expensive gift to create stress for the recipient",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1344084552099827833",
    "author": "SoundsLikeJoe",
    "date": "2025-02-25",
    "content": "Seems like it would be the opposite.  That's it's possible to possess intelligence but not the drive/motivation of agency, but acting with agency would be a sign of strong intelligence beyond subject matter.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1344517230431567923",
    "author": "Deleted User",
    "date": "2025-02-26",
    "content": "Thank you all for chiming in on this, it really got me thinking! I took some time to dig deeper into my uncomfort with this topic and I think it’s really just about the concept of a “personality trait”. Maybe we can jam a little on it.\n\nI had this example in mind:\nLet’s say we meet someone for the first time and while we’re interacting I gather that this person seems like a “happy person”, they’re smiling, giving off warm vibes and are kind. We keep on meeting this person and the experience repeats itself. So the more we meet, the more our idea that this person must be a “happy person” solidifies. We know of course that this is an abstraction and that the person is probably going to be sad, angry, etc. at times. \n\nNow let’s say we think, man I really liked this person they are so easy to deal with, I enjoyed every bit of our interaction. I wish more people would be like that! And there you go. Now you are set to figure out all the details about happiness, the factors that make a “happy person” a “happy person”. The warmness, the kindness etc. and help people be more happy. \n\nNow you’re really digging into it, you start making videos, writing blogs going out to teach happiness. People are really digging it and you feel like you’re doing good for the world. So the concept is in everyone’s mind happiness is what we should strive for and whoever is not happy enough yet just needs to try harder. Suddenly you’re watching the news and you hear more and more people are getting symptoms of depression, stress and anxiety. And you think to yourself wow how did that happen? I thought I was making   the world a better place. \n\nAnd I think that’s what’s happening with a lot of these concepts that once they get institutionalized or gain popularity they somewhat lose their initial intent and can even have a rebounding effect. I mean we can see it going that way with a lot of different trends like mindfulness, health awareness, the work life balance etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1345198631451627520",
    "author": "Adam Thein",
    "date": "2025-02-28",
    "content": "Same experience here @Slow Hand - my strategy is just being aware that my brain is the issue.  Caffeine, stress, anxiety all contribute to this for me but I’ve just come to peace with it.  I’ve especially noticed this when playing live recently again, everything feels so slow on stage and then hearing back recordings I realize it was always the correct tempo.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1350954035229884461",
    "author": "Felix Byrne",
    "date": "2025-03-16",
    "content": "its like no money in comparison to the weeks/days lost",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1374383943528353812",
    "author": "Brian Reynolds",
    "date": "2025-05-20",
    "content": "The anxiety and fear of failure has been very intense lately. Anyone have any memorable stories of people finding success after a long period of time, or later in life?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1374403195698286747",
    "author": "LAPhill",
    "date": "2025-05-20",
    "content": "I mean, as someone whose fanbase is overwhelmingly ~15 year olds, I feel almost a sense of responsibility for helping them find their way to meaningful music and connecting with the artform that I love",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1374408493418807407",
    "author": "Nomograph Mastering",
    "date": "2025-05-20",
    "content": "Important to note that we are a collection of such habits and motivations and patterns. The goal is not to delete but to integrate - for example empathy/sensitivity to the listeners experience is awfully close to the negative I described above",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1378567300571201537",
    "author": "bobby k",
    "date": "2025-05-31",
    "content": "it seems to be more of a loose system that's useful in therapy than an actual spiritual/superstitious practice like zodiac might be (no offense)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1378568352821416007",
    "author": "bobby k",
    "date": "2025-05-31",
    "content": "yall can laugh but i did a professional \"typing\" with my partner as part of couple's therapy some years ago. we landed on 3 for me, and i learned that a lot of the professional musicians she worked with also fell in that category. 3 is the achiever, 4 is the individualist. i've since noticed that a lot of people assume someone working in music would be more of a 4, which usually leads to questions like ~ \"how much of my time and energy as an engineer is going towards self expression? vs. getting the work done the best you can, competing with your past self or others?\" stuff like that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1378600914931154994",
    "author": "wcalebparker",
    "date": "2025-05-31",
    "content": "Also, ive heard good things about reading the type descriptions and see what you resonate with. Go into it with a perspective of “what my motivation.” Everybody has some of everything! \n\nTest should point you in the right direction. If it’s inconclusive or if you don’t agree, see if there’s one that feels right to ya.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1378832643919052840",
    "author": "Gabriel Tyranny",
    "date": "2025-06-01",
    "content": "It helps my brain not feel overwhelmed by blocks of texts to organize it how I find it easy to visually process as I’m reading it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1382078092234981516",
    "author": "Josh",
    "date": "2025-06-10",
    "content": "Anxiety is just the bad excitement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1389394278593204358",
    "author": "Gabriel Tyranny",
    "date": "2025-06-30",
    "content": "So many great responses to this.\n\nI feel like every time I’m overwhelmed and take a deep breath to ground myself, Imm embracing some sort of letting go.\n\nIn any given moment I feel something in my mind that draws me towards holding it at the forefront. Every time I let go and allow myself to experience the present, it’s a process of surrendering in itself.\n\nPerhaps like curling a dumbell, the more you let go in all those micromoments, the bigger the ‘present’ muscle in your brain strengthens.\n\nBig moments of surrender are a fantastic way of resetting into yourself, and the micro moments of surrender are how one prolongs that return to self, even when in the crashing waves of life as it ebbs and flows.\n\nThat’s my experience^ So I’d say - Trying to embrace surrender all together has been a must for me to get to a place to start really living life in the now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1393612320617529384",
    "author": "hyanrarvey",
    "date": "2025-07-12",
    "content": "@chrissorem can you give me ai gym motivation rn",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394581599076745286",
    "author": "spectrummasters",
    "date": "2025-07-15",
    "content": "For sure , I completely agree with you that weight should be given to the apparent findings of rigorous work . Absolutely. I also think it is a disservice to all of us if people are discouraged to approach unpopular ideas and ask questions about them for fear of mockery . Or that newcomers simply accept dogma of the day . That is anti science . Our greatest scientific discoveries usually shatter the pre existing concencus view (for the benefit of all ) Newtonian physics gives way to relativity, classic physics to quantum etc . \nAs you will know Cian , science is not about proving  things with absolute certainty it deals in probabilities . \nScience works to bring us to a place where we can say p< 0.05 . So imho we shouldn’t loosely  present science as absolute and unchanging truths in service of quietening and/ or deriding people and/or their ideas . \nImho what is being missed in so doing is that it is those who dare to challenge dogma,  who challenge and constantly review empirical evidence that bring us the new discoveries . My point is less about discrediting null tests and more about celebrating people who dare to challenge dogma . And that science is also in support of those people . If young people / newcomers are to chase a few rabbit holes and cul de sacs for the will of exploration and finding things out for themselves , who would deny them that ? Those who probably did much the same thing themselves at the start of their journey into audio ? It certainly appears to be true that under observation and current technology the daws sum. Yet we are also at a moment in science where mathematicians are suggesting our reality may only be an avatar and time as a concept is outdated . In mind of these leading edges of scientific thought someone as clever as Jon challenging a consensus on nulling may or may not be genius . But laughing at or dismissing his and Aaron’s and many others sense on it …..doesn’t serve any of us imho .",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1394740331487952988",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-07-15",
    "content": "From my understanding, this is more aggressive than even most social media ToS - and this is in the context of a simple file sharing tool. I'm with you that people often underestimate what rights they're giving up, but this is definitely quite out there.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407811010710081628",
    "author": "oaklandmatt",
    "date": "2025-08-20",
    "content": "Did anyone ever remake this plugin? This was the Abbey Road EMI TG12413 2005 compressor/ limiter and it was my favorite dynamics plugin but then they stopped making it for some reason. I think someone made a version after this version was discontinued, but it sounded very different. This was like 10 years ago.\n\nAnyone ever use this and find a substitute? It had such a great sound that had the extreme of a distressor or a devilloc, but it didn't sound choked like both of those do at extreme settings.\n\ncc @cian riordan",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1408112556513693787",
    "author": "Bryan DiMaio",
    "date": "2025-08-21",
    "content": "Yeah that's my thought as well, but I wanted to point out that they have no motivation to point folks to a tool other than their own",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1409648067510141008",
    "author": "Rob Domos",
    "date": "2025-08-25",
    "content": "I mean can anyone really be frustrated? 99% of people were like “it’s insane if they fulfill this”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1438975701285077075",
    "author": "cian riordan",
    "date": "2025-11-14",
    "content": "During a banner rain weekend in LA as well. I love the stress test.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1439008772382130323",
    "author": "jantrit",
    "date": "2025-11-14",
    "content": "Absolutely, moulded plugs are a real life changer, couldn’t agree with the mattress comparison more.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1455638296435757137",
    "author": "SawyerM",
    "date": "2025-12-30",
    "content": "Yeah, this year has been both the most stressful and rewarding year I've had. Going into 2026 with clarity, it's a new feeling and it feels nice",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1457750030139002992",
    "author": "sinaigimenez",
    "date": "2026-01-05",
    "content": "It’s crazy how important living in the present moment is for feeling optimistic and grateful. You made a really important point here.\nIf I look at my own situation today, I could totally make your words my own. My family is doing well, and I’m about to finish a mix of a reasonably good song. Still, I can’t help thinking about the future and feeling kind of depressed and worried. Will the phone ring? Will I get to work on music that really resonates with me? Will I be able to provide for and take care of my family? How can I improve my skills? I feel like my work isn’t good enough, etc.\nMusic can be really tough on mental health, and not living in the present—constantly anticipating dark scenarios—is probably the worst enemy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1458871938402222170",
    "author": "thegreatcarsoni",
    "date": "2026-01-08",
    "content": "Hey guys, so I wear a lot of different hats in my day to day, as I'm sure a lot of you do. Does anyone else experience a kind of uncertainty/mild anxiety about their work that might derive from the fact that you're not really specialized in a certain area? I feel like I'm not always as excited or confident about getting into a certain task not only because I know i'm not very good at it yet (which i know is all relative, I could still be exactly what someone else needs for something), but also because I know others are out there, sometimes in my personal circle, who are much better? For a little added detail, my fulltime career is as a voice actor, but I love mixing, and sometimes I produce some baby artists, engineer ADR and video game/commercial voiceover. This week i was asked to dialog edit an animated film, I have to comp vocals for someone's song, and there's always a litany of othere stuff, none of which I ever feel prepared to do so the work usually takes longer than I know it should. Maybe the answer is simply to stop trying to be everything to everyone, but honestly I'm terrified to put all my eggs into the voiceover basket even though it's what I've got the most momentum with.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1458876553915273458",
    "author": "thegreatcarsoni",
    "date": "2026-01-08",
    "content": "Also, i don't want to air out a therapy session in general talk here hahaha so I'll try to keep this focused on a discussion that could be helpful for everyone.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1464088475350335711",
    "author": "kylem",
    "date": "2026-01-22",
    "content": "I think it’s totally normal to feel these things at any level. An incredible manager will separate you as much as possible from the bullshit. A good business manager will help keep the financial stress to a minimum. But at the end of the day, it’s all a business and a job. You can love your job and also sometimes want to leave it all behind",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1468636689793552434",
    "author": "Ryan L",
    "date": "2026-02-04",
    "content": "engineers who have been in the biz for a while, when does the impostor syndrome go away",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1468639287653306540",
    "author": "chris_donlin",
    "date": "2026-02-04",
    "content": "The older i get the more i learn how imposter syndrome seeps into nearly every job out there - nurses, parents, sales people, you name it. it's just a thing people deal with but yeah you learn to ignore it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1471555984492331203",
    "author": "Bryan DiMaio",
    "date": "2026-02-12",
    "content": "well I think of it more that there's just so much more music being made now and it may be a similar number of total \"true\" records but more rare in comparison with total volume of stuff being releaed",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  }
]