[
  {
    "id": "1241510689697300490",
    "author": "Rob Domos",
    "date": "2024-05-18",
    "content": "Huge congrats to @popaganda. on getting married! \n\nRight now I’m blasting this record he and his now wife made (Ruairi mastered). Highly encourage y’all to listen:\n\nhttps://tidal.com/album/277242515",
    "reactions": 38,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1304575708105937046",
    "author": "bobby k",
    "date": "2024-11-08",
    "content": "CONGRATULATIONS TO MYSELF FOR ENGINEERING AND MIXING PROMOTIONAL RADIO DIALOG RELATING TO THE TWISTERS SOUNDTRACK WHICH WAS NOMINATED FOR BEST COMPILATION SOUNDTRACK FOR VISUAL MEDIA!!!!! IF YOU LISTENED TO THE HIGHWAY XM, PANDORA, OR AMAZON MUSIC RADIO DURING THE MONTH OF JULY, 2024 AND HEARD AN AD SPOT FROM AN ARTIST NAMED NOLAN TAYLOR, YOU GOT THE PLEASURE OF HEARING MY 251, PRO-Q3 AND RVOX PUTTING IN SOME SERIOUS WORK!!!!!!!!!!!!!!!! EVERYBODY SAY CONGRATULATIONS BOBBYY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "reactions": 33,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1175675497343090729",
    "author": "NoahNeedleman",
    "date": "2023-11-18",
    "content": "Ok Long Post alert, but touches on a few things we harp on around here. \n\nSo my little bro is in town- we made dinner for one of his oldest friends who just moved to town with his wife. He’s a fantastic mandolin player and his wife is a singer/songwriter. \n\nOf course I did the ol’ studio walk through, listening to all the tunes on the ear calibration playlist, then let them play some of their own favs. Of course they’re blown away and have never heard music like this etc. \n\nBut to drive the point home I show them a song @Rollmottle and I turned around in just over 24 hours. “The reason for the speakers & treatment etc is so we can make decisions quickly blah blah blah.”  I pull up the session and we listen through and they’re loving it- but I’m noticing it doesn’t have the 3D thing that all the other music we’ve been listening to has. \n\nThen I show them the mastered version. An mp3. It’s louder and better sounding and all, until the first BGV stack hits… then it’s IMMERSIVE. We listened to the whole thing again just to enjoy the magic and notice all the ways the master improved it. So far beyond zapping resonances and making it loud, @Rollmottle made it sound… important. Made *me* sound like a good mixer. \n\nIt was heavier lifting for him cause I didn’t have the benefit of time for fresh ears or to detail the vocal the way I normally would. Also had the good fortune of having @Ross Fortune on speed dial and on GMT to give it a listen at 5am PST. \n\nI’d you’re curious, or dubious, I’ll DM files so you can hear what I’m talking about. \n\nTL;DR: monitoring matters, fresh perspective matters. Don’t produce mix *and* master your own shit.",
    "reactions": 29,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1048047746747215892",
    "author": "BatMeckley",
    "date": "2022-12-01",
    "content": "Ah Christ… my dad’s most listened to artist this year on Spotify? St. Vincent. \n\nI am very very upset.",
    "reactions": 27,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1176266585548263444",
    "author": "austenballard",
    "date": "2023-11-20",
    "content": "As requested by @Nomograph Mastering and others, the audio version of LWMR Community Profile no. 1 featuring @Slow Hand.\n\nhttps://soundcloud.com/lwmr-community-profiles/sets/lwmr-community-profiles\n\nRead and recorded by myself, edited and mixed by @Deleted User.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1338703119164379178",
    "author": "NoahNeedleman",
    "date": "2025-02-10",
    "content": "So most of you know by now my wife is in Publishing here in Nashville. She reps some heavies, and works for the largest independant publisher in Nash. I told her tonight I need to update my website. Her response: \"Hear me when I say this: your website doesn't matter. Your Spotify playlist does.\" Seemed like good info to share.",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1433554887169409056",
    "author": "bobby k",
    "date": "2025-10-30",
    "content": "My first pinned message, let’s go. While I got y’all’s attention be sure to follow my band The Kitten Milk Replacement Committee on Spotify, Bandcamp and Pandora. You can also donate to my grandma’s go fund me at the link below (she’s not sick or anything but just needs some extra cash for cigs and beers)",
    "reactions": 18,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1238853531776323626",
    "author": "oaklandmatt",
    "date": "2024-05-11",
    "content": "Spotify is the company trying most aggressively to pay people the least. I'm deeply frustrated by this.\n\nI'm going to start using Apple Music to listen and send links and I encourage others to do the same. \n\nIs Apple some charitable organization? No. But at the moment they're not constantly fighting to pay people less.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1439649073853370479",
    "author": "bobby k",
    "date": "2025-11-16",
    "content": "Most of my years in music have felt like groundwork-laying years. Just because your credits playlist isn’t looking the way you’d like doesn’t mean that growth wasn’t happening. I would challenge you to reflect on where you started 2025 and where you are now and take inventory of what growth or lessons you experienced. \n\nThe most rewarding bits of this year for me wouldn’t make sense to post about. Paid off my first business loan. Improved the efficiency of signal flow in my studio. Learned to fix some gear. Stood up for myself in a hard conversation with some assholes trying to rip me off. Got out of the UAD ecosystem. \n\nNone of that I’m posting about or adding to a playlist, but it feels just as essential (or more) to my business than the songs that got released.",
    "reactions": 17,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1448331208907030590",
    "author": "bobby k",
    "date": "2025-12-10",
    "content": "Thinking about how we can fight back against Spotify’s garbage royalty rates and had a brilliant idea - upload a separate master that has ad spots in the middle of the song. Before the second chorus hits you’re gonna hear about Toyotathon. Don’t like it?  To listen ad free switch over to Tidal or Napster",
    "reactions": 16,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1153439781901054112",
    "author": "Rollmottle",
    "date": "2023-09-18",
    "content": "Apple Music added credits in IOS 17. 👍🏽",
    "reactions": 15,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1454178937256284314",
    "author": "bobby k",
    "date": "2025-12-26",
    "content": "Yes it’s a small home theater but occasionally we pull up Apple Music and take our shirts off",
    "reactions": 15,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1035721971494821959",
    "author": "oaklandmatt",
    "date": "2022-10-28",
    "content": "@everyone i appreciate y'all so much! I'm about to take a ferry to an art museum in Hobart Tasmania, listening to my Spotify playlist on shuffle. \nhttps://open.spotify.com/playlist/0aTUiNxT5TSNJuCT4wEEyf?si=pDQFL5ShQ86geTGiS3Nj1Q",
    "reactions": 14,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1410168106734719016",
    "author": "Iwan Morgan",
    "date": "2025-08-27",
    "content": "If you thought of ditching Spotify for Apple Music this should make it easier: https://pitchfork.com/news/apple-music-now-lets-you-import-playlists-from-spotify-and-other-streaming-services/",
    "reactions": 12,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1457057348060319904",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2026-01-03",
    "content": "Having a deeply held belief that you yourself, with your grit and talents, eventually can overcome anything is the most sustainable positivity hack I see in other people and feel in myself. \n\nThat way it's less about the state of whatever industry (ie Spotify/AI doomer stuff) and more about the fire you've cultivated and keep cultivating every day, that you can harness how you see fit.\n\nWhen I see musicians who are really ~doing it~, like so many in this discord, I see people who could easily be successful in a wide array of fields, and I hope y'all feel how extraordinary that type of dedication and drive is",
    "reactions": 11,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1027822801685581844",
    "author": "Nomograph Mastering",
    "date": "2022-10-06",
    "content": "So right on this, to a T. It applies to emails and communication too. @cian riordan  and I had a convo about this recently. I used to sign off master emails with “I’ll wait for your notes/let me know if you need anything” or some variant.  Creating exactly the situation @Rollmottle describes. Now I sign off with “let me know how it feels”. I use Samply for streaming masters and have every single feedback and waveform option disabled. The goal is to make it as much like streaming on Spotify or Tidal as possible. I do artwork or an artist pic, i do proper song titles and not file names etc",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1451280545525796864",
    "author": "EliHeathMusic",
    "date": "2025-12-18",
    "content": "Recently switched from Spotify to Tidal and I had the same reaction. I also can't overstate how nice it is to be able to easily access extended credits AND ALSO not know how many times something has been streamed. I hadn't realized this as much in the years that I used Spotify, but as soon as I switched off of it, it became immediately apparent how much seeing the streaming metrics as the first thing had been shaping my impression of every artist or song I listened to before I even pressed play. I think the fact that Spotify hides most credits and highlights stream counts is a subtle but very real reflection of the way that the company has been turning music from an art into a commodity.",
    "reactions": 10,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1037498097300951101",
    "author": "cian riordan",
    "date": "2022-11-02",
    "content": "These are all different types of references for different styles. I'm usually using them at the beginning of a session in a new room to figure out what I'm hearing through the speakers... and sometimes I'm dragging them into sessions that I'm mixing to look for particular clues in the low end, loudness, width, etc: https://open.spotify.com/playlist/27VrsFUydxRRuio4fSVfMF?si=fe5d5ca82f454892",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1120018400249389308",
    "author": "Rollmottle",
    "date": "2023-06-18",
    "content": "Great discussion. Learning not to give a fuck about what people think is a necessary and valuable skill in life, no matter what your pursuit. Most people have zero idea what goes into any part of the music business (technically or monetarily) other than what they hear coming off a playlist, and it’s been my experience that it’s mostly idle curiosity and I’m happy to oblige because I like yakking about shit I’m passionate about. \n\nBut also, you owe nobody anything. This is where trying not to care too much about what people think of you especially comes into play. Breaking the social contract, telling somebody they’re making you uncomfortable, refusing to engage in the conversation on their terms, etc are all cards you have every right to play. I’ve found a lot of power in vocalizing my honest feelings in situations like this. It is extremely disarming for people and can make things uncomfortable (real life Larry David moments), but being able to sit with and own your voice in those situations can be powerful (like Neo in the matrix).",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1439508939023843389",
    "author": "BatMeckley",
    "date": "2025-11-15",
    "content": "I’ve got a good one of these: a girl I worked with came by to record a feature on a DJ Duo’s song. We spend a day or two recording it, and it’s AMAZING. I bring by everyone I know by the studio to play it for them, because I KNOW it’s a hit, and i want to be the guy who called his shot. I’ve got points on it, and possibly even a piece of the publishing. \n\nA few months later my little brother calls me and says “hey, I just heard *artist B* singing that song you played me that had *artist A* on it.\n\nThat song became one of the most played songs of that year, now nearing 3.5 billion streams on Spotify alone. My cut would have easily been in the hundreds of thousands of dollars, if not breaking a million.\n\n¯\\_(ツ)_/¯ \n\nSometimes the stuff we do pans out. Sometimes it doesn’t. We kick Cian in the ribs and we move on.",
    "reactions": 9,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "882253828970393711",
    "author": "1ggy",
    "date": "2021-08-31",
    "content": "Halsey on what Trent Reznor told her (GEM): \"‘So you could not do this with us and put it out.’ He’s like, ​‘Or, the way a lot of modern music is right now is it informs the listener not to pay attention. It says, this song is safe. You can put it on a playlist. You can listen to it in a car. You can play it on a party, and it’s not going to fuck up the vibe. It blends in with everything else. It’s a mood. It’s chill. But it informs you not to pay attention.’\"",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1058498535655481346",
    "author": "hebakadry",
    "date": "2022-12-30",
    "content": "Now if we are talking about some Disney musical on LP…that’s a different story. Who is even buying those records?  And why?\nAlso worth noting that not every single type of music should go to LP. But some people do not want to have that convo.\n\nThe vinyl world is the last hold out with a community in my opinion.  Just the act of going to a record store like Academy or Other Music (RIP), being recommended records by their extremely tasteful staff, listening to it, looking at the artwork.  Talking about it with friends.  You just don’t get that elsewhere.  Maybe Bandcamp.  I absolutely worship Bandcamp.",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1068184190027317308",
    "author": "Adam Thein",
    "date": "2023-01-26",
    "content": "This might be old news to people here but I found this app this morning called SongShift that lets you translate playlists from one streaming service to another.  I haven't had a Spotify sub for a couple years and have been on Apple Music, and when people send references/playlists to check out I usually have to one-to-one the songs to Apple Music, but this app automates that process for you.  Just made my day!",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1085317803994792016",
    "author": "hyanrarvey",
    "date": "2023-03-14",
    "content": "@🗽🍕😼 dude congrats on the apple music playiist",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1234909545495662653",
    "author": "Slow Hand",
    "date": "2024-04-30",
    "content": "So you’re just gonna pretend like this doesn’t exist? \nhttps://open.spotify.com/track/6ZgigeSB0XUMqc0jjzaq6d?si=tUa1HVSORUCXYle4z_Rkiw",
    "reactions": 8,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1389367698961731734",
    "author": "Will Melones",
    "date": "2025-06-30",
    "content": "They just put Tidal on autopilot for 6 months?",
    "reactions": 8,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058791321369837673",
    "author": "Will Melones",
    "date": "2022-12-31",
    "content": "I buy vinyl from my friends for way too much money and then keep it sealed and stream the thing on Spotify. It’s all about the dope collectible and supporting the craft, but I can’t be bothered to dust off my turntable.\n\nPart of the magic is still the heavy black (or fancier) disc, though. I like the idea of big art. Bundle a ‘poster’ with a t-shirt, a download card/streaming link with exclusive bonus tracks, and an NFT (are those out of style already?) or whatever. Then the fan can own the keepsake and still listen to the music their way.\n\nAnd to add to that, why in the age of 4k everything can we not zoom in on the tiny little album thumbnail on Spotify? I have a computer monitor the size of most garages and I’m looking at what might as well be an AIM buddy icon, which the artist uploaded at multiple times hi res to distrokid.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1061351484928831528",
    "author": "Nomograph Mastering",
    "date": "2023-01-07",
    "content": "Also I’m sick of these non specific playlist titles “happy.playlist”, I’ve explained that it needs to be “mixed on ATC”, “mixed on Neumann” etc",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1162295911590940712",
    "author": "Nomograph Mastering",
    "date": "2023-10-13",
    "content": "Spotify alone uses 3 different compression algorithms and different bit rates depending on bandwidth and platform - AAC, MP3 and OGG Vorbis. All sound subtly different. We should make and approve the best master we can and let the compression algorithms do what they do",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1176971502944518285",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-11-22",
    "content": "Guys! Meet  @SujalMixes \nHe's one of the best mixers from India who has credits on tracks released by Warner Music Group and recently mixed a Spotify India Top 50 charting track and a Lovely person!",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1179491247342239826",
    "author": "Rollmottle",
    "date": "2023-11-29",
    "content": "i don't even subscribe to Spotify",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1200350182181711912",
    "author": "Slow Hand",
    "date": "2024-01-26",
    "content": "Man, I feel the same way. Jazz isn’t gonna be for everyone but sometimes it feels like a lot of people who hate brussel sprouts because they grew up with parents who can’t cook for shit and have never known how good they can taste.\n\nThere’s some terrible, lazy, uninspired stuff out there but then there’s shit like this that oozes with soul and passion: \nhttps://open.spotify.com/track/3rFzc8CLVDZ7OOtFa2jPYP?si=xsxGocg5QNeTd43-HwvV7g",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230957941277065266",
    "author": "BatMeckley",
    "date": "2024-04-19",
    "content": "Tin foil hat: so much of Spotify streaming numbers calculations are absolute bullshit (that I’ve admittedly benefitted from) that they have to pretend they’re doing something about. They won’t take down the Selena Gomezes but by doing bullshit take downs they’ll get enough press and message board bitching to make it look like they’re actually trying to do something about it. \n\nInflating numbers is good for their business.",
    "reactions": 7,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1346543933198438662",
    "author": "Will Melones",
    "date": "2025-03-04",
    "content": "Today I learned Spotify has advanced search. It's like Discord, but the features are a secret.\nhttps://support.spotify.com/us/article/search/",
    "reactions": 7,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "850084646233702403",
    "author": "Josh",
    "date": "2021-06-03",
    "content": "I was helping this dude out with some mixes and he kept saying to make it sound like his demo. Told him to email me notes and he literally linked me to SoundCloud links of his demos and said “study this mix and make it sound just like this” so I told the dude, why don’t you just release the demos since you want me to copy them? And he hasn’t replied since. Just be honest LOL",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1026991158674599986",
    "author": "BatMeckley",
    "date": "2022-10-04",
    "content": "Quite often actually, and when you do often I find that someone has beat me to it. Tchad Blake has multiple user curated playlists of his work on Spotify that I’ve found pretty rut busting. On a more modern bend I’ve found Zakk Cervini doing really consistent super polished modern rock/pop punk/ etc mixes that can provide some guidance.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1037562563149430795",
    "author": "Rollmottle",
    "date": "2022-11-02",
    "content": "I love how everybody has at least one *Sea Change* song on their playlist.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069776109056577548",
    "author": "Rollmottle",
    "date": "2023-01-30",
    "content": "36 songs = 36 chances for a playlist vs. 10.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1134687543699443792",
    "author": "NoahNeedleman",
    "date": "2023-07-28",
    "content": "Nah. I did a bunch of covers getting a project going a few years back. The one that sucked the most has over 20M spins on Spotify, and I get stories all the time about first dances at weddings and the like. Sucks is subjective, as is music.",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230654909355917363",
    "author": "Slow Hand",
    "date": "2024-04-18",
    "content": "Now I'm curious. How do y'all normally use Spotify? I've got a few modes:\n\n1. I know exactly what I want to hear. I search it and start listening.\n\n2. If I'm less picky I choose an album from an artist and listen through it entirely.\n\n3. I put my *Liked Songs* playlist (roughly 2k songs, anything goes) on shuffle and let it rip.\n\n4. Thurs at 9p I listen to my *Release Radar* playlist for the new releases from artists I follow.\n\n5. Monday morning I listen to my *Discover Weekly* playlist and listen to the 30 songs it's recommending me.\n\nThose are the main ways that I engage with the app. Is anyone here doing something significantly different? Radio stations maybe? Specific playlists?",
    "reactions": 6,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843859017315254272",
    "author": "mixedbywong_my",
    "date": "2021-05-17",
    "content": "https://www.theverge.com/2021/5/17/22440090/apple-music-lossless-audio-dolby-atmos-support-audio interesting . Heard that Spotify’s doing their hifi thing soon also 😊",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "846968561992859649",
    "author": "cian riordan",
    "date": "2021-05-25",
    "content": "I like to put it through a couple of generations of Soundcloud's algorithm. Then I'll fedex them a DVD-RW with the transcoded WAV files.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1006591474105864262",
    "author": "Jeremy Klein",
    "date": "2022-08-09",
    "content": "I moved here 2 years ago with a bunch of savings and making very little money in music. It took me about a year to pull in enough income from mixing and spotify streams where I could stop living off savings and only on music income. \n\nBut, It IS so expensive to live here, and I like to do things. typical night out is like $80 after drinks and ubers. Gas is $80. An egg sandwich is $16 lol. The constant worrying of if i was going to make enough that month got to me, so of a couple months ago, I returned to a freelance software engineering gig 3 days a week. Never been happier. A _lot_ of people in LA are doing the same: _side hustles are your friend_ . \n\nAnother thing i'd add is when you first move here, try to combine your studio and living expenses. Studio spots here start at like $1800 a month and go up from there. I live in a beautiful house in silverlake with roommates where I have a room, my own bathroom, _and my own studio_ in the furnished garage for $1300. Try to get something like that.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1033152914463662240",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "Labels own a good chunk of Spotify",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1061350080453554237",
    "author": "cian riordan",
    "date": "2023-01-07",
    "content": "What’s her take on LUFS and how Spotify handles loudness?",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1084189520133636106",
    "author": "cian riordan",
    "date": "2023-03-11",
    "content": "Holy fuckin wow. This is the best $3 I’ve spent in a long time. Was really yearning for something to give me detailed credits from my Spotify library. Thank you for sharing!",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1145274324639559771",
    "author": "Ross Fortune",
    "date": "2023-08-27",
    "content": "Yooo, so rad to come across a Don Cab mention in the wild! Damon Che was a huge influence on me as a drummer.\n\nOn the subject of playlists, I caused my own first bad mushroom trip by switching out Pink Floyd in a room full of tripping 16 year olds for Don Cabellero 3, the first song on What Burns Never Returns. There’s a 1/16 note snare roll with nothing else going on that genuinely lasts a full half minute. Times that by eternity when the walls were breathing and everyone was pinned to their chairs with eyes popping out their heads trying to figure out what the fuck was going on 😂\n\nI still have the poster from their gig in Dublin in 2008 ❤️",
    "reactions": 5,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219818718431805572",
    "author": "BatMeckley",
    "date": "2024-03-19",
    "content": "That’s what’s going on here. I know a very successful producer/writer out here that was stacking songs on Spotify with some sort of side deal under fake names. They were getting preferential treatment. \n\nMy guess is that because Spotify’s royalties are based proportionately, they probably have some side deal with certain artists to disproportionately fill up the playlists and algorithms. Their streaming numbers go up, but they essentially end up having to pay less money to artists not under their own umbrella, if that makes any sense. It’s why no one will talk about it",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221217324779180172",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "The fastest way to hear this is take your mix and export from RX at OGG 256k. Then you can compare mix and a pseudo Spotify (almost worst case)",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1226088537724817520",
    "author": "spectrummasters",
    "date": "2024-04-06",
    "content": "…just flew out the rat race of london to the remote countryside of Portugal 🇵🇹. Was just getting on the plane and “jumping on a jet “ actually came on from my playlist . Instantly looped it for about half an hour marvelling over and over at just how fantastic Seth firkins taste  was imho",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1402444210019500122",
    "author": "youngteam",
    "date": "2025-08-05",
    "content": "jazz-adjacent land has plenty of that. for more \"standards\" approach to jazz start here \n\nhttps://tidal.com/browse/album/1397602?u",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1455302549342257284",
    "author": "Josh",
    "date": "2025-12-29",
    "content": "I like to put on the country playlists every Friday and see how many times I make it to the second verse.",
    "reactions": 5,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "809875141852135504",
    "author": "Rollmottle",
    "date": "2021-02-12",
    "content": "I played some synths on Poolside's remix of Billy Idol's \"Eyes Without a Face\" which dropped today. Pretty cool for me as the first \"major\" thing I've been involved with. Pretty stoked! https://music.youtube.com/playlist?list=OLAK5uy_l7_TIhuFIsEJlJpJFeB2Sqst2AFNnZgI0",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1012527784372998196",
    "author": "cian riordan",
    "date": "2022-08-25",
    "content": "It streams at higher quality and has very detailed credits for albums/tracks… if those are valuable to you, then yes. I pay for both Spotify and tidal and use Spotify 99% of the time because playlists and other people linking me to it.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1022562378136694945",
    "author": "NoahNeedleman",
    "date": "2022-09-22",
    "content": "*gen z googling names, then going to Spotify to listen to bands for the first time*",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1052344021873332274",
    "author": "frankieharper",
    "date": "2022-12-13",
    "content": "Thought for the end of the day… UK time \n\nOur arrangements and our mixes leap into existence from the womb of the metaphysical into a world rich in strict guidelines and predetermined boundaries. It’s drill, it NEEDS that thump… it’s lofi, it neeeeeds that blur, I want to get onto New Music Friday, it needs to be LoUd. \n\nGenre and playlists seem to rule with an iron fist… I often think that when an artist asks for a ‘brighter’ mix or an even MORE colossal 808. Not always… but often. \n\nSurely the overall and final sonic characteristic of our various musical expressions should be treated with as much emotional sensibility as our lyric or our narrative? \n\nPerhaps a dark lyric cries out for a dark mix… New Music Friday or otherwise?\n\nOr is that built in?\n *wild generalisation hat firmly secured* \nWould it be too much of a reach to say that modern pop music is bright and loud because in recent history, pop music is high energy and bright in tone? Or is jazz historically observed from the back of a smoky leather bound room and so dark and dynamic just sits comfortably (whisky in hand) … I guess my question is… at risk of sounding a little Orwellian, do we control genre or does genre control us? Probably both? Asking for a friend.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1084162571185176636",
    "author": "jonmatteson",
    "date": "2023-03-11",
    "content": "I would love to search a songwriter or producer on Apple Music and see all of the songs they’ve worked on.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1086781992584101910",
    "author": "Nomograph Mastering",
    "date": "2023-03-18",
    "content": "https://open.spotify.com/track/5TZZ1FqSZhWpLjUapdpG35?si=BoTlS87HRQ2VEUD8yPEOAw",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1186712425278472332",
    "author": "Edward Rivera",
    "date": "2023-12-19",
    "content": "https://open.spotify.com/episode/67avHKmnYBK2HfDrf3AW1U?si=tXfaBvowR1idPEl4Q-DO6Q",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221217000429457588",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "Spotify is a long way from what the mixes/masters actually sound like - rounder, blurrier, smearier, softer. If you aim to match that tonality on your mix then it will get Spotify’d when released and be extra blurry ( @cian riordan knows this / speaking to beginners)",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221217900145278976",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "Said another way - Spotify is fine for musical vibe checks, inspirations etc but once you get into “do I need another half dB at 16k on my mix bus EQ?” It will lead you astray",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221251015530250352",
    "author": "NoahNeedleman",
    "date": "2024-03-23",
    "content": "How & why we reference differs depending on a lot of things. I’m generally for referencing but not for spending too much time on it.\n\nLike matt said, checking general brightness or low end, vocal levels or just making sure one track can live on the same playlist as another. \n\nMore than that I start to lose the plot.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230504226166407278",
    "author": "Josh",
    "date": "2024-04-18",
    "content": "Also Spotify allowing artists to run ads when I pay to not have ads is so sick. I love being bombarded with advertisements every waking moment of my day.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1237837208313139220",
    "author": "BatMeckley",
    "date": "2024-05-08",
    "content": "https://open.spotify.com/album/0dkprEfOxxeMfObeEtdpcQ?si=hyhzolzUSImXvlSZQ8dhTg",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1301267575908335676",
    "author": "cian riordan",
    "date": "2024-10-30",
    "content": "This chorus slays https://open.spotify.com/track/2O99aywAVBhaPrsiJ6zbSS?si=4a8c74bbef4b45e2",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1360633787616333905",
    "author": "Matt Huber",
    "date": "2025-04-12",
    "content": "I wish they would. Big win for Tidal on that front",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1360672319969689820",
    "author": "Felix Byrne",
    "date": "2025-04-12",
    "content": "which was like 90% of the reason i switched to tidal lol - go thru people's engineering or production credits and find new music",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1374401789285236852",
    "author": "Jasper Boogaard",
    "date": "2025-05-20",
    "content": "Something specifically I have learned about emotionally charged release days: \n\nif you are able to, the best way to spend these is doing something fun and distracting. Of course you do all the promo things you need to, but after that just have a good time, maybe go celebrate with the people you made the music with. But staying on your phone waiting for all the likes / streams to roll in is a bad time in my experience, even if people love it!",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1462848517822218251",
    "author": "Zach Hughes",
    "date": "2026-01-19",
    "content": "I had an experience recently that left me a wee bit uncomfy. A song called “Into the Blue” by an “artist” named Sienna Rose came on in my gf’s car and I consciously thought she’s got a great voice and that’s a great chorus. Had her text it to me and I liked it on Spotify. Later found out it’s suspected to be AI. Most of the AI music I’ve heard has been sort of mechanically impressive but simultaneously some level of dog shit. This song actually got me out in the wild and I liked it. Most convincing AI dupe I’ve heard. If it is in fact AI. Even the social media seems fabricated but it’s still pretty convincing. Apparently some celebrity used it in a post too and it’s having a viral moment. That artist profile has over 3 million monthly listeners.",
    "reactions": 4,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "811834063903260723",
    "author": "cian riordan",
    "date": "2021-02-17",
    "content": "Fun/not-fun new topic: I just switched to Tidal from Spotify and I'm really pleased. I mostly listen from my computer in my studio and so far, the various hi-fi options & being able to force access to your converter, skipping core audio just seems like a real benefit. I know Spotify is king and it makes sense to listen to what everyone else is listening to, but I'm enjoying the sonics of this so far. I also appreciate their very thorough credits section. It's so rad to be able to get in-depth info on who was involved on specific songs/recordings. What say ye?",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "815027867943305247",
    "author": "cian riordan",
    "date": "2021-02-26",
    "content": "In this case just try and find someway to thread the vocal together through the album as that seems to be the common element. But also keep in mind, it doesn't really matter! The EP & LP are dying and people are mostly dancing around between songs on playlists, so after if you've done everything in your power to make each song sound a great as humanely possible, and you have some cycles to spare to try and string songs together, great!",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843921206344024075",
    "author": "David Fuller",
    "date": "2021-05-17",
    "content": "Okay am I crazy or is spotify like *way* darker sounding than Tidal",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1022946012370829333",
    "author": "oaklandmatt",
    "date": "2022-09-23",
    "content": "https://open.spotify.com/track/25j0Sape7qZbq6ZPLFefTT?si=RKBuwasHTjqwEuAp5iN-mA",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1037500268503379968",
    "author": "Rollmottle",
    "date": "2022-11-02",
    "content": "https://music.youtube.com/playlist?list=PLBKb1G8jdITdcURdl0bLygKsqY8DNa9KX&feature=share",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1050650137304772618",
    "author": "mixedbywong_my",
    "date": "2022-12-08",
    "content": "https://www.apple.com/newsroom/2022/12/apple-introduces-apple-music-sing/ 🤔 Apple Music Sing includes:\nAdjustable vocals: Users now have control over a song’s vocal levels. They can sing with the original artist vocals, take the lead, or mix it up on millions of songs in the Apple Music catalog.\nReal-time lyrics: Users can sing along to their favorite songs with animated lyrics that dance to the rhythm of the vocals.\nBackground vocals: Vocal lines sung simultaneously can animate independently from the main vocals to make it easier for users to follow.\nDuet view: Multiple vocalists show on opposite sides of the screen to make duets or multi-singer tracks easy to sing along to.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1068072070191251477",
    "author": "Nomograph Mastering",
    "date": "2023-01-25",
    "content": "I want it to feel like Spotify",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1076577937203150944",
    "author": "BatMeckley",
    "date": "2023-02-18",
    "content": "I brought what I thought was a nice bottle and they were cracking open bottles with price tags that more resembled Matt’s streaming numbers. \n\nFWIW it’s worth I think the wine was incredible but I’m not in a place to make a judgement outside of that.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1078490148091740263",
    "author": "Adam Thein",
    "date": "2023-02-23",
    "content": "Damn.\n\nSo I just realized i've had Apple Music set to Dolby Atmos Automatic for god knows how long and it has been automatically detecting my audio interface as a multi-channel interface and turning on Atmos mixes for me that I've been listening to in stereo and they are 100% not the correct stereo mix.  Just turned Dolby Atmos to OFF and now I feel like a fool.\n\nThought I'd share here and encourage everyone to make sure they have that setting off if they aren't using Airpods or a legit Atmos setup.  I've been referencing some stuff that absolutely didn't sound right.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1083481171339509891",
    "author": "Slow Hand",
    "date": "2023-03-09",
    "content": "Also, this. I'm so tired of progress for progress sake. I know this thread started off talking about Apple Classical, but I'm more galled by Spotify's implementation of this quasi Tik-Tok feature set. I just want a music player. I don't want social media-like features injected into it.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1084185722661109852",
    "author": "chadwahlbrink",
    "date": "2023-03-11",
    "content": "@jonmatteson https://apps.apple.com/us/app/musicsmart-liner-notes/id1512195368\n\nThis app is extremely cool for credits on Apple Music and Spotify",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1137395023013482636",
    "author": "chrissorem",
    "date": "2023-08-05",
    "content": "I was on a tour in Europe for a month and I swear every restaurant we went to  had the same bossa nova covers playlist going.  I couldn’t handle it anymore and one restaurant I could see the Spotify laptop and I walked over and changed that shit.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151168610455265414",
    "author": "masteredbyjack",
    "date": "2023-09-12",
    "content": "You Against Yourself - Ruel (masterclass in loudness and still keeping the feel), and Dear Seventeen by Gretta Ray -- love the midrange density and how I connect to the vocal, right on the edge in spots\n\nAll the things on the playlist are there to sorta act as \"boundaries\"...right on the edge of too much low end (Dale)...mid density (Nathan)...etc. Not that they do that all the time or anything…just those songs in particular for me make a \"box\" that fits the edges of my taste. And all records that move me, and maybe do things I never would have done naturally so I can learn from them",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1157697432247869563",
    "author": "conor // wbotm",
    "date": "2023-09-30",
    "content": "Made the switch to TIDAL start of this year and honestly have been liking it a lot. Didn't think I'd care too much about the high quality streaming but once you go back to Spotify you can feel the difference immediately. Occasionally some annoying road blocks with the search engine not acting as predictably as spotify... and some small artists have profiles merged with others of the same name. But the recommendations are really strong, and the lack of stats and that has actually really helped me just listen to music and not get carried away thinking bout the business.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1158488115665702952",
    "author": "peterlabberton",
    "date": "2023-10-02",
    "content": "It definitely feels a bit outdated but I’m not sure there’s been a definitive replacement. I look on tidal and jaxsta first when I’m curious of a record’s credits, but in general the whole thing is a mess.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1218592299139727461",
    "author": "NoahNeedleman",
    "date": "2024-03-16",
    "content": "https://open.spotify.com/track/42SH5nYzBO5BUeiMWiLrhg?si=OkuPdi8dT1GCVdiB0hHvJA",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230240665670254785",
    "author": "LAPhill",
    "date": "2024-04-17",
    "content": "Let's think about this from an activism point of view - are you actually trying to affect change, or is this personal? In the case of MWTM, if you write to them and say \"Hey, I disagree with this and will be cancelling my subscription,\" they might notice. If 500 users do it, they certainly will. If they lose 5000 subscribers, maybe they'd rethink it.\n\nIf their user base isn't passionate about the issue, MWTM doesn't have any financial incentive to change what they're doing. Spotify and the other streamers have Chris Brown, and I can't imagine the amount of pushback they would need before pulling his catalog from their services.\n\nAs Noah said, everyone can vote with their wallet and decide where to focus their attention on a personal level.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240655413695746068",
    "author": "Ross Fortune",
    "date": "2024-05-16",
    "content": "Referencing has ruined my algorithm. I spent so much time listening to J and K Pop last month I got this email from Spotify",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240657550286917662",
    "author": "Ross Fortune",
    "date": "2024-05-16",
    "content": "This exactly. But sorry, the point of all of this was to say that as if there weren’t enough reasons to ditch Spotify already, this has to be the final straw. Pour the gasoline on the old account, drop a Zippo and pretend like that AoT never happened",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1280294260587102209",
    "author": "Ross Fortune",
    "date": "2024-09-02",
    "content": "I went down the Nile hole a few years back but somehow missed this one until recently @chrissorem https://open.spotify.com/track/6Wux9SSXcUdgwG7TItGTJz?si=GIC2joXrROeANjJ7cKBwyQ",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1286095694939029504",
    "author": "cian riordan",
    "date": "2024-09-18",
    "content": "FWIW I've been doing more books on tape lately... Spotify making it very easy. I can't listen to any more audio podcasts.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1360634206207737857",
    "author": "Skyler Young",
    "date": "2025-04-12",
    "content": "Yeah seriously insane I have to open my phone to see the credits in Apple Music",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1389425242388041779",
    "author": "earwormfarmer",
    "date": "2025-06-30",
    "content": "I made the switch to Qobuz a little while back. There’s actually a few free ish/cheap services that help you transfer over your library so that part was actually a breeze. Overall I really like it. Occasionally there’s music I can’t find on there. Smaller releases sometime take a little longer to show up. But I really like how they’re more focused on highlighting new releases than pushing playlists. Coming from Spotify, something about Qobuz feels slightly more like looking through stuff at a record store.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1436131326959812819",
    "author": "Will Trotman",
    "date": "2025-11-06",
    "content": "Not sure if anyone else had this experience, but I had literally never heard of Joshua Slone until the other day when everyone was posting about his album release. First of all, great record / artist. I checked out his Spotify and saw that he had no music out before this album. Correct me if I’m wrong but my understanding is that he got some tik tok traction then went on the road with Zach Bryan before any of his stuff was out? Was so stoked to see the amount of excitement around an artist’s first release (which is so sick that his first release was an album as well). This might be a hot take, but I think I’m a pretty big fan of the way tik tok has impacted music discovery. Obviously it’s not perfect or going to satisfy everyone, but it’s pretty awesome that all the doors are wide open. And I feel like I’ve noticed a bigger interest in songs, writing, lyrics, etc. From what I’ve heard, it sounds like people got to know some of these Joshua Slone songs well enough to be singing along at his live shows, and I would dare to attribute that to the fact that his lyrics are literally on the screen in his videos. Who knows, maybe that’s all bull shit lol, but wanted to throw it out there. Would love to hear y’all’s thoughts.",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1436141149457748099",
    "author": "Rob Domos",
    "date": "2025-11-06",
    "content": "Big agree. Ruairi mastered this one and when I was setting it up for him I went looking for his Spotify page and it literally didn’t exist yet, but there were all of these pictures of him playing stadiums and I had this whole discovery process in real time of just going down the rabbit hole of all of these TikTok’s of him just playing and singing to his phone camera. No gimmicks, no social hook, no hot pictures, just a dude with a guitar directly connecting to you",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1440900563448369323",
    "author": "Will Trotman",
    "date": "2025-11-19",
    "content": "Only looked on my phone so far. But it’s been laid out like that. Been waiting for that on Spotify for so long so I’m stoked to see it",
    "reactions": 3,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1451269345958433019",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2025-12-18",
    "content": "Just switched to Tidal, can't believe how fast and easy it was to import all my Spotify playlists. Zero friction",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1457052879675195573",
    "author": "Nomograph Mastering",
    "date": "2026-01-03",
    "content": "Simple stuff like when I meet you in person do you tell me doomer Spotify shit or tell me about a record that excited you this week. That is a choice",
    "reactions": 3,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "820729725387145226",
    "author": "Zakhiggins",
    "date": "2021-03-14",
    "content": "@oaklandmatt the website was also bought by Spotify recently so it's marketed to up and coming artists as a way of working with \"real industry pros\", there are some people who've worked with some big names on it but it's mostly bedroom guys like me playing fake it till you make it 😅",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "828876933885591552",
    "author": "peterlabberton",
    "date": "2021-04-05",
    "content": "Took this 100% from @cian riordan, but: separate output path for references! I send the mix out 1-2, references out 3-4, and any old mix passes/rough mixes out 5-6. They are all level matched and I can switch between them on my monitor controller. The level matching and real time switching right in front of me is key, to me. I resisted this for ages out of some misplaced sense of pride, but, dude, if you don’t have a good system for references... do it! I also have the outputs of my computer audio routed to record into the ref track via a pair of virtual channels in UAD Console, so I can pull something up on Tidal (!) and record it in directly.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "882346768711438346",
    "author": "Rob Domos",
    "date": "2021-08-31",
    "content": "Tbh I’ve actually been striving to make music this easy to listen to lately. I remember having this realization like 8 years ago when someone was like “hey rob, you’re the music guy. You make the playlist for the party!” And I was like “uhhhh I don’t know any music that that’s good to talk over. Everything I listen to forces attention” and they looked at me like I was crazy. Ever since I’ve been trying to figure out how to make the best wallpaper music. Music that improves the mood of people around but doesn’t distract them. Forcing attention is v cool too, and I think learning both arts and learning the cost and benefits of each and trying to get the most out of the benefits of both and the least out of the costs of both is often the way to go for me",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "915348785729794068",
    "author": "Tyler Graham",
    "date": "2021-11-30",
    "content": "https://open.spotify.com/playlist/2kfLh20uq4eI2VIbWHmWXH?si=7ad6f50372884251",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "999403023795224616",
    "author": "Josh Bowman",
    "date": "2022-07-20",
    "content": "I have had several clients call me when checking a master on their phone saying it’s blowing up, and that other songs aren’t… every time after I get them to turn off normalization on Spotify so it’s actually playing the ref tracks full volume, they are like, oh Nevermind everything sounds like that lol. So not just you! I find everything unlistenable from my iPhone speaker at full volume so never noticed till people started complaining.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1012556658662199309",
    "author": "cian riordan",
    "date": "2022-08-25",
    "content": "I believe Tidal is the only Hi-Fi option, allowing 88.1/24 or 96k/24 masters to stream if you pay for it. I stopped using Apple after the Spatial debacle.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1012768999764918333",
    "author": "chriswheeler",
    "date": "2022-08-26",
    "content": "so I work for Spotify, my current project is working on song credits",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1012809466057592944",
    "author": "chriswheeler",
    "date": "2022-08-26",
    "content": "i think helping people get credit is a bit above my pay grade haha, my job is to confirm/double check Spotify’s credits for high tier artists.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1033096063319539763",
    "author": "peterlabberton",
    "date": "2022-10-21",
    "content": "Totally—definitely not wanting to go back to the bad old days, exactly. Theoretically we could build something better! On a day to day basis I’m definitely zoomed in on my little world, trying to do the best I can in my small corner of the madness. But I have a handful of zoom out, what the *fuck* moments each year, and this is one. 🙂 It feels quixotic, but we need to (as a broader music-making community) protect the art we’re making, and the means to support it, from the Spotifys/TikToks/etc. of the world, and it’s hard to feel that way and simultaneously feel powerless against them.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033151978521505894",
    "author": "Slow Hand",
    "date": "2022-10-21",
    "content": "Mmhm. At first glance the obvious move seems to be that Spotify could double its subscription rate to $20/month and kick a larger margin towards the artist. I think unlimited music is certainly worth that. Setting aside, for the moment, all of the other complexities around market pricing, we also need to remember that Spotify's largest streaming competitors are Apple and Amazon.\n\nThese are companies with massive war-chests derived from the success of their non-streaming companies. Even if Spotify *wanted* to raise the cost of their service, companies like Apple and Amazon can afford to keep the price of streaming services depressed and sustain a loss on their streaming services for far longer than Spotify ever could. To my eyes, Spotify doesn't have a whole lot of wiggle-room to adjust their pricing and therefore their payout models.\n\nI say as much, because in casual discussions around streaming payouts, there doesn't seem to be much awareness of the larger business ecosystem that a company like Spotify finds itself in.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1052376491175976980",
    "author": "NoahNeedleman",
    "date": "2022-12-13",
    "content": "Man I’ve given this thing a lot of thought in my lifetime. Honestly over the last few years I’ve realized my biggest limitation is my taste. I can learn anything, or hire a person who already knows how to, but I have to have the vision. The hardest part is to think to do it. \n\nSo we’re all informed by our taste, and we’re all chasing the sounds we love, and we’re all trying to make a living by finding where our tastes overlap with a broader audience. \n\nIt’s not that we’re driven by dark playlist overlords, is that the search of overlap in our tastes finds us all in that domain. Does that make sense?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1063948468181291078",
    "author": "Adam Thein",
    "date": "2023-01-14",
    "content": "I do think threads are a good place for really specific things - I’ve been in a few for specific questions I had that are still searchable for people in the future but don’t blow up a whole channel for a conversation between 2-3 people.\n\nI think the Spotify convo over the last few days is a good example of something worth getting notified about, and it had a higher than average participation.\n\nI think @Slow Hand has been doing a great job gently reminding people of the feature when it feels appropriate",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1071867290343190670",
    "author": "spectrummasters",
    "date": "2023-02-05",
    "content": "So, Lil Yachtys album and some rock tracks ive been getting have got me deep diving a lot of 70s records this weekend....records i grew up with from my dad playing via cassettes,vinyls and CD's which ive kept ...and ive been diving into Pink FLoyds stuff listening to drum balances .....and boyyyy, these re-masters on Apple Music feel so different. To your point on here ruari, about spoiling the feel in pursuit of the sonics, Pink Floyds remastered stuff feels like a completely different vibe. Theres a real lesson happening for me here about ruining a mix by being too clever.... before i dive into mixing some bits ove got to do....in many moments the drums' scrappier sound (IMO) of Yachty's el seminole feel better than the floyd remastered stuff (particularly Wish You Were Here / The Wall) . Thankfully my fav floyd album (Animals ) has still got an unremastered version up but overall i think these remasters are making your point for you ruari",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1072976844388827176",
    "author": "Zach Hughes",
    "date": "2023-02-08",
    "content": "Harkening back to the question of grammy wins for music discovery. An artist I like, Madison Cunningham, won best folk album. She's not a megastar or super famous or anything. Out of curiosity I went and peaked at her streams / listeners on Spotify for Artists and she did see a big spike on Monday (highest in the last 28 days). I would guess the impact is greater for smaller artists and more negligible for mega pop stars of the world in terms of exposure from winning.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1076578170733592727",
    "author": "LAPhill",
    "date": "2023-02-18",
    "content": "For a second I thought you were referring to yourself in the third person. Dude gets some impressive streaming numbers and goes off the deep end.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079147112278786108",
    "author": "Nomograph Mastering",
    "date": "2023-02-25",
    "content": "i love this sentiment so much. I've been meditating on an idea - what if we made space for and captured moments that were so undeniable that they were bad mix proof. bad master proof. Spotify proof. Noisy culture proof",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1083466709182193756",
    "author": "Jeremy Klein",
    "date": "2023-03-09",
    "content": "hahahaha what is going on with this ad for the redesigned Spotify TikTok thing?! The main vocal sample is completely in the wrong key https://twitter.com/eldsjal/status/1633551228859985921?s=20",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1083469708101169213",
    "author": "oaklandmatt",
    "date": "2023-03-09",
    "content": "More evidence than spotify doesn't give a fuck about music or music creators",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1123949112811859968",
    "author": "Edward Rivera",
    "date": "2023-06-29",
    "content": "https://open.spotify.com/episode/0lxeXZs0uXzXyBQhP92Bpn?si=C2oVVxX8TSe74jimGrNS3A\n\nJust finished. Love Rosalia's energy. Love that the whole interview was half castellano/english. Love her enthusiasm throughout. I didn't really get it until her 3rd record, but I can see now she's a genius.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1144648496213921892",
    "author": "NoahNeedleman",
    "date": "2023-08-25",
    "content": "So we got married in our backyard 20 people all in. Now we’re having a party for like 200 people to celebrate it. Call it a reception, we’re calling it The Soirée. I’m building a playlist of all the songs that are fun and mean something to us. (We’re both in music so there’s a lot.) \n\nMakes me curious, y’all have “songs” with your SOs?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1145060672711962735",
    "author": "cian riordan",
    "date": "2023-08-26",
    "content": "This is my don caballero, battles, and black midi playlist. Really pump people up.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1152336164657844245",
    "author": "Slow Hand",
    "date": "2023-09-15",
    "content": "What about that moment at the end of a great set when the band has finished and the FOH person kills the afterglow by immediately playing a tone-deaf choice of song from their Spotify playlist.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1157711667992465478",
    "author": "conor // wbotm",
    "date": "2023-09-30",
    "content": "Obviously very subjective, but it feels very human to me. Oh you just added a couple of city pop tracks to your playlist? Here's 3 more bangers in the same genre you might not have heard",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1163311358184521898",
    "author": "NoahNeedleman",
    "date": "2023-10-15",
    "content": "Whenever I have people over who aren’t recording professionals, I bring up my own playlist to talk ‘em through what they’re listening for.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1169819905210716212",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-02",
    "content": "Doing research on the acts with the most monthly listeners on Spotify - Somewhere in the ballpark of ~20 are highly interconnected reggaeton artists, which I thought was fascinating. Also, the average age is quite high from what you'd expect (most seem to be in their 30s, a good amount are older than that). Enjoying how a lot of the data felt counter-intuitive, filled in a lot of knowledge gaps for me",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1180264395276820621",
    "author": "Bryan DiMaio",
    "date": "2023-12-01",
    "content": "I'll do an Atmos mix of this for free if it's getting uploaded to streamers. Gotta have the best playlisting reach possible right?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1195426971690209481",
    "author": "spectrummasters",
    "date": "2024-01-12",
    "content": "I could talk about all this all day bro , I’ll defo do you a playlist or two",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1195456768172642514",
    "author": "Sam Segarra",
    "date": "2024-01-12",
    "content": "I def need that playlist as well! The Kerri Chandler track is a total jam",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1200353541185884241",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-01-26",
    "content": "This recording of moaning by the mingus big band is one of my fav things ever https://open.spotify.com/track/3Vqbj9yPHBTIRhTDJHPQMq?si=7n-DSvX7S4e0-qzxEeZrFA",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1210142092408660018",
    "author": "Deleted User",
    "date": "2024-02-22",
    "content": "Spotify was not even supposed to be a paid service… their model and vision was never having to pay for music again; and letting THAT be high quality experience as if you are playing records you bought. They did indeed do that, and I don’t think it will go back. \n\nIt was decentralization they were after. the record industry was already beyond rescue (to go back to its heyday) so they wanted a better piratesbay where people can hear the music right away, and not the messed up mp3 that has been converted to different codecs multiple times. The platforms opening up to everybody is why someone like myself or my clients can upload any kind of music. \n\nI mention all of this to say… I think that’s what they wanted. But I think they were hoping more people would use the free version so they can juice more profit out of the ads. I don’t think they were expecting this many people to go premium, which lowers the value of each ads… (because they won’t be listened to as much)",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1218667272399229088",
    "author": "Slow Hand",
    "date": "2024-03-16",
    "content": "For my money this is the best *Hello*: \nhttps://open.spotify.com/track/1rqduvolf1CVHSzY519bPp?si=G4zs1L_eSQWhF469hXDw_Q",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219684650591719485",
    "author": "Slow Hand",
    "date": "2024-03-19",
    "content": "Ethan Gruska has nice felt piano tones going on. \nNils Frahm would be a great reference for this stuff too, but with a much more hi-fi and spacious approach: \nhttps://open.spotify.com/track/0YBApL73BbXpxEJKREFOUF?si=2caa9afc051844dd",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219773632189038653",
    "author": "SoundsLikeJoe",
    "date": "2024-03-19",
    "content": "Player got game. #HackTheWorld\n\nhttps://www.musicbusinessworldwide.com/this-secret-composer-is-behind-650-fake-artists-on-spotify-his-music-has-been-streamed-15bn-times-on-the-platform-report/",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222914905976475719",
    "author": "conor // wbotm",
    "date": "2024-03-28",
    "content": "tidal have just introduced a new feature where when you share a song via link it leads to a landing page where you can choose your streaming service. both a lovely customer first thing and simultaneously a brilliant admitance of defeat 😆",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222968068272160838",
    "author": "Rob Domos",
    "date": "2024-03-28",
    "content": "I was on Amazon music for a while. Actually liked it",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1228184994304757761",
    "author": "Slow Hand",
    "date": "2024-04-11",
    "content": "Mark my words it's gonna be in my Spotify Wrapped come December.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1232971462579847199",
    "author": "Ross Fortune",
    "date": "2024-04-25",
    "content": "Not necessarily a rec, but someone on Reddit was lamenting that this is beginning to fall into disrepair following a round of Spotify layoffs. I saw it and immediately thought of ol’ Wonderbread https://everynoise.com/engenremap-rap.html",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235434309402497074",
    "author": "cian riordan",
    "date": "2024-05-01",
    "content": "Damn. Honored to have a mention your mix ref playlist. 🙏",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1238765979266191402",
    "author": "Ross Fortune",
    "date": "2024-05-11",
    "content": "Were you a NOFX guy? Dumb jokes against tracks that rip still does it for me https://open.spotify.com/track/6J7uwMBpnrrPmoVAqLEWQz?si=K3YQqCLFTXCh0Ox_CQ1C0Q",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1250847018616750181",
    "author": "spectrummasters",
    "date": "2024-06-13",
    "content": "Mayyyynnnn , I’m enjoying listening back to the LWMR episodes from the start , I’m obvs v late to the Spotify stream having just discovered it (I’m Apple Music)   Listening to these convos while i wire up some panel in a cupboard on a building site is an actual pleasure . Matt you spoke about u wanting to create a resource for people . Going back over these episodes from the start is priceless . Jon’s episode on compression is brilliantly awks / funny ….w/matt gallantly trying to offer the olive branch over and over for offending Jons sensibility whenever he suggests any sort of “appreciated characteristics “of a compressor ….of any sort , any how ….ever , lol and Jon just not having it at all . Matt trying so hard to find a middle ground lol Classic",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1272207079146262561",
    "author": "Edward Rivera",
    "date": "2024-08-11",
    "content": "Can’t talk about movies and music without mentioning this banger\n\nhttps://open.spotify.com/album/2E1q8eohZZ1BUQ7Bq5WUIY?si=h3gm1QToT9-KOWxKxSPFXQ",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1303398763641176185",
    "author": "SoundsLikeJoe",
    "date": "2024-11-05",
    "content": "This feels like self-checkout.  Are they literally asking artists to narc playlists on suspicion, and then spend uncompensated labor time reporting it back to Spotify?  \nDystopia is wild.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1306661856420827137",
    "author": "thegreatcarsoni",
    "date": "2024-11-14",
    "content": "It might create more work down the line depending on what they send back in terms of edits and stuff, but wouldn’t it take 10 seconds to open all playlists, select all the clips, consolidate so they all start at the beginning, and Cmd+Shift+K?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1314301221921751040",
    "author": "Zach Hughes",
    "date": "2024-12-05",
    "content": "He appeared on the Tim Ferris podcast recently and that was also a great listen. https://open.spotify.com/episode/2m8D8RxyTyZuDOFFT1zFss?si=7d4051ea406744aa",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1320079476092305438",
    "author": "Nomograph Mastering",
    "date": "2024-12-21",
    "content": "If it’s Spotify only then the native sample rate is 44.1 kHz 16 bit WAV",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1365031915668766912",
    "author": "tim adamson 🇦🇺",
    "date": "2025-04-24",
    "content": "100% dig into Rowland s Howard \n\nhttps://open.spotify.com/album/0jATJDnHAtUjrVICxLIuTM?si=_LdcNctwTzOpXK1nzfadYQ",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1402444429159043135",
    "author": "chrissorem",
    "date": "2025-08-05",
    "content": "https://tidal.com/browse/album/306077830?u",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407463203625242744",
    "author": "Jasper Boogaard",
    "date": "2025-08-19",
    "content": "https://pwelverumandsun.bandcamp.com/track/i-want-wind-to-blow \n\nThis meant everything to 17 year old me and I still get that visceral reaction when the drums come in 10 years later",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1408596025718870047",
    "author": "Gabriel Tyranny",
    "date": "2025-08-22",
    "content": "Here’s the mostlyJazz playlist I made out of suggestions from people in this server - Can check them all out in one place 🎉 \n\nhttps://open.spotify.com/playlist/10xqfK80g4wr2PqJnBRFby?si=6W-kiqdCTL2QR8f0U9yPMw&pi=mq5wFGCbSSuk-",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1461063334584516785",
    "author": "cian riordan",
    "date": "2026-01-14",
    "content": "I mean, if it’s still the default on Apple Music, a requirement to get playlisted, and a required deliverable for labels — then DOA might be a stretch?",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1462569570106605810",
    "author": "Slow Hand",
    "date": "2026-01-18",
    "content": "That fracturing is also why you can watch a movie on HBO one month and then it leaves HBO and becomes exclusive to Netflix a few months later. \n\nIf you're the license holder you can generate more value for your properties by limiting the licensing window and then re-licensing to another streaming provider for a more favorable rate. It would be frustrating to sign up for Spotify cause you love Led Zeppelin only to find that they've re-licensed with Tidal a few months later.",
    "reactions": 2,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "811861717726134303",
    "author": "hendrick",
    "date": "2021-02-17",
    "content": "tidal is so good!!! their library isn’t as big as apple or spotify but the audio quality is amazing and seeing the credits makes it worth it for me",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "818228975171928074",
    "author": "cian riordan",
    "date": "2021-03-07",
    "content": "Looks interesting. I will say, Tidal seems to have it pretty well covered compared to Spotify with regards to crediting. It's pretty in-depth in some cases.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "818565587273646121",
    "author": "cian riordan",
    "date": "2021-03-08",
    "content": "Yeah, thats tough. If its not even on the physical copy then its unlikely you'll find it online. If you could reach out to the artist they might have info... sometimes bandcamp is a good resource for this as well.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "843923409200873504",
    "author": "Josh Bowman",
    "date": "2021-05-17",
    "content": "You are not crazy! It’s more obvious on some songs than others… gonna try and dig up one that a client sent me as a ref on spotify, the chorus top end is totallly different on tidal when I went to check it at the studio",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "843925351976927253",
    "author": "David Fuller",
    "date": "2021-05-17",
    "content": "okay, comparing the 3... Tidal lossless and CD sound the same, Spotify at very high quality is like 2dB darker",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "885979288006983711",
    "author": "isaac joel",
    "date": "2021-09-10",
    "content": "Sad to hear about the closing of Inner Ear in Arlington, was fortunate enough to record a short 2-day session there in my old band and the amount of history in that place is unreal. Ironically it's getting torn down so the county can build an \"arts district\" smfh 😧 https://daily.bandcamp.com/lists/inner-ear-studio-label-profile?utm_source=footer",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "927241626437419089",
    "author": "Adam Thein",
    "date": "2022-01-02",
    "content": "I use https://freetousesounds.bandcamp.com/ stuff, I'd recommend!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "963501513827827763",
    "author": "Adam Thein",
    "date": "2022-04-12",
    "content": "then you can pay $499/month to get private lessons, rent a 2i2 with behringer mics, all your plugins, unlimited distribution per year direct to Spotify",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "977676037934702652",
    "author": "Nateonthetrack",
    "date": "2022-05-21",
    "content": "@ehutton21 lift 3 on drum bus https://open.spotify.com/track/2t8yVaLvJ0RenpXUIAC52d?si=8acccbdd5e814005",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "990019013004378182",
    "author": "Slow Hand",
    "date": "2022-06-24",
    "content": "Mind you, this is coming from someone whose set *this* song as their ringtone. There’s few sounds that are worse to wake up to 🙂: https://open.spotify.com/track/358yoS26oeAeOspVMJtEZU?si=AO6mTChmTOmOWVD_4Qh1IA",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017149356584996957",
    "author": "cian riordan",
    "date": "2022-09-07",
    "content": "I see this less pertaining to 'bounces' and more to your consumables via Apple Music/Tidal/Etc. Like stuff actually mixed for Spatial (not the spatial-ized)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1032616260502040626",
    "author": "chadwahlbrink",
    "date": "2022-10-20",
    "content": "I feel you. I made a free account and haven’t paid for anything on vox, but it is still trying to do more than I need. I mainly use it because it annoys me that I can't see how much time is left on a song when I'm listening in Apple Music (without moving my mouse over the playback area) 🙃\n\nThe sad truth is that Apple Music is still the “best” manager of mp3s on Mac - which hasn’t created much of a hole for other developers to step in. I currently still manage my library there. \n\nIf metadata management is your primary goal, you may explore something like Soundminer or other library tools for sound effects. They aren’t going to give you the playback controls like vox or iTunes, but they could be an option.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1037550463828099102",
    "author": "Zack Hames",
    "date": "2022-11-02",
    "content": "https://open.spotify.com/playlist/1vk6Fo4g9vbruVw7Gg5o7O?si=qDg_pbvMSTuB-tVcxB16IA\n\nWelp just a bunch of EV mixes and Phoenix",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1037552188307800164",
    "author": "Eric Martin",
    "date": "2022-11-02",
    "content": "I realize that it’s actually more of a producers playlist than a mixers, but ¯\\_(ツ)_/¯ that’s just where I’m at",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1037555813549604966",
    "author": "Eric Martin",
    "date": "2022-11-02",
    "content": "I love seeing how many people have Show Me How To Live in their playlist, that song and mix slay",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1068343581737242734",
    "author": "austenballard",
    "date": "2023-01-26",
    "content": "mfw running my reference playlist off Apple Music and losing my shit trying to figure out which part of the signal chain is broken because I'm hearing like 75% center\n\nSwapping cables feeding the monitors, swapping patch cables, switching cables coming out of the interface\n\n... it had detected more than 2 outs and automatically gone to Atmos mode",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1073332025743908925",
    "author": "Nomograph Mastering",
    "date": "2023-02-09",
    "content": "Thanks man. That playlist is very carefully curated for monitoring tells, every track on there reveals something about speaker/room performance. They’re not necessarily all cool, or a reflection of our taste",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1097574023736606751",
    "author": "edrichwang",
    "date": "2023-04-17",
    "content": "We just use some calming waves track on Spotify. I used one of my old mobile devices going to an old klipsch speaker chucked under her bed. She's been sleeping through the night since she was 6mths old. I think it helps me sleep too 🤣.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1097920865376673943",
    "author": "Jeremy Klein",
    "date": "2023-04-18",
    "content": "the track hit close to a million plays yesterday on the kid's (previously non-existent) spotify before all the major streaming services took it down",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1098951150096621568",
    "author": "OJ",
    "date": "2023-04-21",
    "content": "Soundclouds still good!",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1102278480084881438",
    "author": "chrissorem",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/0JX23XA8E7aN1Chj32kgVn?si=qG3YKIB3SZCFpzHLmbM5XA",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102610241876656258",
    "author": "chrissorem",
    "date": "2023-05-01",
    "content": "https://open.spotify.com/album/5hwedPhYvZBIlqxc5wWw8A?si=wlf5O1kYSLaOdgL8r377XA check Louis’s first record out. Great songwriting on it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1116141619964551168",
    "author": "peterlabberton",
    "date": "2023-06-07",
    "content": "Is tidal fucking up for anyone else?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1119021639464665139",
    "author": "Ross Fortune",
    "date": "2023-06-15",
    "content": "This was my first round with it, so I read the manual… as far as the little blue box that says what to point the learn function at. Then I tried presets (one was called “gentle vocal deverb” or something. That didn’t do the biz, so I went back to default then ran a few passes at varying reduction levels and put them on playlists in PT and comped from there",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1128706967427362926",
    "author": "spectrummasters",
    "date": "2023-07-12",
    "content": "Oh and gonna send that playlist tonight  bro  apologies, got home from work and ate and literally immediately slept 🛌",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1142142092894814329",
    "author": "Nomograph Mastering",
    "date": "2023-08-18",
    "content": "If I suspect something I’ll listen to the unfuck playlist but generally I’ll know",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1144653299279220887",
    "author": "ALXCPH",
    "date": "2023-08-25",
    "content": "Found this album in a Car we borrowed and it was the only Music we had for 5 hours. \n\nThe album Will always hold a special place in my heart, because we were turnt up for 5 hours with this thing on repeat. \n\nhttps://open.spotify.com/album/7xoe4eRlHwaW2lyWV4g4oG?si=EwBWwO3hSSOy5gEAkCrCxw",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1145057771767726140",
    "author": "Edward Rivera",
    "date": "2023-08-26",
    "content": "I made a playlist called \"wedding dj\" specifically for this scenario. Can just let it run and nobody gets hurt",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1146932141679202384",
    "author": "Skyler Young",
    "date": "2023-08-31",
    "content": "I think Apple Music does most of this. I have a similar size collection (mostly from wav files of project bounces) that I can access anywhere. It does cost though",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1151310779950317670",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-12",
    "content": "Would you guys agree there’s been inflation in music with great sonics to the point of diminishing returns? \n\n10 or even 5 years ago, I’d often save music to playlists for the sound alone. Now great sounding sonics are absolutely everywhere to the point I’m more excited when something sounds a little wack",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1157466862435708948",
    "author": "Rollmottle",
    "date": "2023-09-29",
    "content": "Just noticed this feature in Apple Music. Pretty interesting.",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1157677203434262629",
    "author": "Will Melones",
    "date": "2023-09-30",
    "content": "I’m getting sick of the Spotify experience getting worse with every app and desktop update and considering making the switch to Tidal or Apple. Family subscriptions are all the same price. Is it lonely over there?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1157678788122001458",
    "author": "Bryan DiMaio",
    "date": "2023-09-30",
    "content": "Apple Music works with Alexa, I even have an Era 300 set up with Alexa as the voice assistant",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1157722414646571118",
    "author": "Will Melones",
    "date": "2023-09-30",
    "content": "Interesting! I think I’ve experienced that with Tidal just finding links for my portfolio. That’s one place Spotify seems to have improved over the years. In the beginning their search was unforgiving",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158497396783845486",
    "author": "Nomograph Mastering",
    "date": "2023-10-02",
    "content": "I had a mastering engineer friend who made a promo playlist with every song he had ever mastered. Every song. Not sure I can conceive of something less useful",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1158844468707999786",
    "author": "bobby k",
    "date": "2023-10-03",
    "content": "the thread from a day or two ago really inspired me to clean up my showcase playlist. i used to be insecure that i had only put 10-20 things on there.. now i'm trying to get it back to that (or less!)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1195423286809591940",
    "author": "spectrummasters",
    "date": "2024-01-12",
    "content": "Oh for real bro no probs . Happy to reciprocate . As I said to ya cherone stays on my playlist . Conclusion is on my most played 2023 Apple Music playlist",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1200155499891544144",
    "author": "Zach Hughes",
    "date": "2024-01-25",
    "content": "Dang not surprising. I'm so deep in spotify world. Idk what everyone else is doing",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1200657155917885501",
    "author": "Will Melones",
    "date": "2024-01-26",
    "content": "I’m kidding. I agree with you mostly. Spotify just makes up genres. Pick a noun. It’s a genre.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1208501780569137195",
    "author": "Nomograph Mastering",
    "date": "2024-02-17",
    "content": "I’m not vetting by playlist, but rather disposition. Not even “fitness” but just the will and motivation to show up",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1208503463164776489",
    "author": "Ingmar Carlson",
    "date": "2024-02-17",
    "content": "Right! Thinking especially of label people here. They're not sitting down for a listening sesh, per se, not trying to ascertain how slick/wide/deep my mixes tend to be. They just wanna see who's on that playlist. And if they see things they already know that had them feeling some kinda way when they heard it, so much the better.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1210197984118046830",
    "author": "spectrummasters",
    "date": "2024-02-22",
    "content": "Details of the names I referred to but was rushing to work Ludvig Strigeus who created uTorrent and was joined there briefly by Daniel ek. They went on to found Spotify . Ex explained “ you can never legislate away from piracy. Laws can definitely help, but it doesn't take away the problem. The only way to solve the problem was to create a service that was better than piracy and at the same time compensates the music industry – that gave us Spotify.”",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1218671301787517038",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-16",
    "content": "https://open.spotify.com/track/2MshmOFHiwHYud8DvsPFzA?si=nyioDhswSdagEalhLNjVag does this count?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219687472775168050",
    "author": "cian riordan",
    "date": "2024-03-19",
    "content": "A desert island record: https://open.spotify.com/album/3oz8kworUyU7oXjaEVhDsZ?si=tBQfFYmTSTae2lqLlxdVkw",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219730282102652960",
    "author": "conor // wbotm",
    "date": "2024-03-19",
    "content": "https://open.spotify.com/track/4SdbAQKOR7dn4LyG0gzLNV?si=46fde96c60ed4457",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219781076881506314",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-19",
    "content": "the only thing that can make this story interesting is if there's something wack with how he gets onto editorial playlists. Not sure what a 'fake artist' is supposed to be",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219783442489671792",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-19",
    "content": "Tbh it's not at all surprising if Overloud and Spotify have close ties, and that these songs make it onto more editorial mood playlists. It's a bit naive to think Spotify's editorial playlists are a meritocracy",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219787271536906321",
    "author": "SoundsLikeJoe",
    "date": "2024-03-19",
    "content": "I think \"fake artist\" is just clickbait for the general public.  He's got a lot of pen names and hacked the playlist system imo, and that's genius. \n\nI know another Swedish producer with 50-100 albums of basically stock music, and he's getting insane streams thanks to seeding playlists.  Fair play imo.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219796844524339340",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-19",
    "content": "Yeah. I just read the original Swedish article the MBW one is based on - it sounds like it's likely there's a special deal between spotify and Overtone/Epidemic none of them are willing to comment on (probably NDA). A little bit more fishy than it came across in the MBW article. DN is is one of Sweden's most prestigious newspapers, so it's not like it's some random internet outlet trying to get an interview/statement",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219849751118217267",
    "author": "AJ",
    "date": "2024-03-19",
    "content": "There was pushback when smaller artists said they didn't have the audience to pull a move like that off. To me though, that's a valid criticism. Considering how coveted Spotify metrics are, shouldn't you want more organic reach on that platform? And wouldn't prioritizing that platform give you the best opportunity to improve those metrics?",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219852605560455208",
    "author": "AJ",
    "date": "2024-03-19",
    "content": "Yeah I don't know why it would need to be on an artist website when Bandcamp already exists. I approached the conversation more as a release strategy.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1221211159810543788",
    "author": "cian riordan",
    "date": "2024-03-23",
    "content": "A big reason I like the Grace M905 grabbing my computer output digitally as well as the output of my PT converters digitally. That way, things are showing up at 0dBFS from both sources, while also feeding my metering through the same path (Clarity M + spectrum analyzer). With Spotify you need normalization off and volume at full — ideally you’d have Tidal and force control over the DAC and bypass core audio, but I’ve got no gripes with Spotify at this moment.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221236297449083060",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "Tidal is very close to the master, close enough that it doesn’t matter",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1222523552801230858",
    "author": "Adam Thein",
    "date": "2024-03-27",
    "content": "I can definitely relate with streaming video apps - if something I enjoy gets removed from an app I subscribe to it's a bit of a bummer and I may not want to immediately run out and buy the 10 disc box set for the TV show or subscribe to another service to just replace that one thing.\n\nAnd when it comes to video services what I have access to absolutely dictates what I'm watching on the regular.\n\nNot a great 1:1 with music streaming services since most of them have most of everything, but I think the average person probably only subscribes to one music streaming service (likely Spotify).",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230649371205308556",
    "author": "Slow Hand",
    "date": "2024-04-18",
    "content": "I don’t get it. What’s the big change here? By default Spotify already plays music continuously until you pause it.\n\nWhat’s so significant about a menu that scrolls forever? It’s not as if it’s gonna make us consume significantly more music.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1238856175760703580",
    "author": "jordanmcleod_io",
    "date": "2024-05-11",
    "content": "I use one called Playlisty",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1238882799029714975",
    "author": "Rollmottle",
    "date": "2024-05-11",
    "content": "Looked through all of these services. I'm not really a playlist guy, but what I would like to do is replicate my extensive Youtube Music library in Apple Music. The API's on YT don't read Albums and \"Artists\" in the API are only people I've followed on YT. The Apple Music API's don't allow writing Artists back to it anyways. Living in the future is great and also sometimes dumb.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240655594969370726",
    "author": "Josh",
    "date": "2024-05-16",
    "content": "Spotify was just giving me the same streak of songs. It was kind of annoying. Apple seems to be different",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240678751793316024",
    "author": "esquinalee",
    "date": "2024-05-16",
    "content": "One thing I’ve been peeved about with TIDAL is that whenever there’s an Atmos version of a song, there’s no option to play the stereo version (if there is someone please help me because some great records sound like ass in my car because of this)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1243837895568003115",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-25",
    "content": "yeah, that's only for spotify (and Itunes)",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1243950091056975942",
    "author": "jordanmcleod_io",
    "date": "2024-05-25",
    "content": "Ah, yeah their pre-save stuff can be a pain with needing specific links. Are you using the free tier of Push.FM? I would suggest looking into Hypeddit to do your links. I have found them to be the best bang for buck. They can scan for your song by UPC or ISRC number. They also take URI, which I believe once your song is ingested into Spotify, you can email Spotify For Artists and ask for it. But Hypeddit's free tier can do the scan, the paid tier ($9/month) has more features like pixel tracking and custom domain, branding stuff, etc.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1258873286457294868",
    "author": "🗽🍕😼",
    "date": "2024-07-05",
    "content": "Looking at their Spotify monthly listeners is a gauge too.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1270528519826444389",
    "author": "gatewoodsensei",
    "date": "2024-08-06",
    "content": "Playlisting and comping",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1286420998802898945",
    "author": "Edward Rivera",
    "date": "2024-09-19",
    "content": "This one stands out to me\n\nhttps://open.spotify.com/track/6AfLmKXzhEZjwiVPs5jhdV?si=W_fJuatbRvKsCPuU0_fKPg",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1290199376953741342",
    "author": "Nomograph Mastering",
    "date": "2024-09-29",
    "content": "Was talking with Graham Cruser at Cian's just the other night, every single one of those huge dynamic moments is in the mix. My job was just to make sure they could make it to Spotify",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1299119492042981437",
    "author": "BatMeckley",
    "date": "2024-10-24",
    "content": "https://open.spotify.com/track/2kRFrWaLWiKq48YYVdGcm8?si=PhpsqS99ToGVZ-Lgn0ZI1w",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1301274636385783829",
    "author": "Berlin",
    "date": "2024-10-30",
    "content": "https://tidal.com/browse/track/47696792?u",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1311660818193977365",
    "author": "Ross Fortune",
    "date": "2024-11-28",
    "content": "@Iwan Morgan @spectrummasters Thanks both. I'm looking for something that can play through a set of files like iTunes used to, with skip, pause, playlists etc - I think I might've found the solution with VLC. \n\nSlightly convoluted, but video here demonstrates it: https://www.youtube.com/watch?v=8KJoFOnQ6ZA",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1319028889028263956",
    "author": "Slow Hand",
    "date": "2024-12-18",
    "content": "Got to ask a band (Frog Eyes) once why their record sounded so cool. Turns out they really liked the sound of Minidisc compression, so they printed the entire thing to Minidisc during mastering 😄.\n\nhttps://open.spotify.com/track/7vP4yb1eKcKKtcpVHw8oCM?si=c9a2d00125b041d7",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1337132164512219217",
    "author": "Rollmottle",
    "date": "2025-02-06",
    "content": "or VLC or just something else. Apple Music is a mess for local stuff",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1337153876465553418",
    "author": "Nomograph Mastering",
    "date": "2025-02-06",
    "content": "As someone said above Apple Music for local playback is gross, and slow",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1360672792722280470",
    "author": "sethearnest",
    "date": "2025-04-12",
    "content": "Here was their disappointingly vague response: “Thank you for sharing your feedback. Your input helps us improve the overall TIDAL experience for our subscribers, and we sincerely appreciate your time and effort.\n \nAt this moment, we don't have any further information to provide; we appreciate your understanding. Should you require further assistance, don't hesitate to reach out.\n \nBest Regards, “",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1360722157210173540",
    "author": "sethearnest",
    "date": "2025-04-12",
    "content": "Maybe Tidal’s  just going for [dumb] parity with Apple",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1380555287462805635",
    "author": "Nick Stetina",
    "date": "2025-06-06",
    "content": "Turnstile at the #2 spot on Spotify’s New Music Friday is wild",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1389427282761879654",
    "author": "chrissorem",
    "date": "2025-06-30",
    "content": "That’s good to know my wife is still pissed I switched her from Spotify to Apple Music, because she lost her playlist. Going to look into it.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1389721402680148059",
    "author": "Rob Domos",
    "date": "2025-07-01",
    "content": "I think the cheapest tier of Spotify should be like $30/month. I think if the US regulated the internet strictly enough (china does, it’s possible, not here to start a debate about pros and cons) that the market would totally bare it",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1401757532732653769",
    "author": "Slow Hand",
    "date": "2025-08-03",
    "content": "My ideal program would be just like this and allow integration of your preferred streaming service (Spotify, Tidal, Apple, etc). Maybe even multiple services. Kind of like how IDEs can call different LLM models with a click of a button.\n\nIdeally, it would also allow you to host your music collection on a server and stream your library from a phone app.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1404620397999030363",
    "author": "CamSoss",
    "date": "2025-08-11",
    "content": "Soliciting for music recommendations for little ones!\n\nWe've been keeping track of songs that our now 9 month old jives to. These are his favorites so far: https://open.spotify.com/playlist/0LzDd2KkcRIyxYxCo0mdjF?si=24af8d2584724cec",
    "reactions": 1,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1404773853015707689",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-08-12",
    "content": "Taylor just released a playlist consiting only of Max Martin/Shellback produced songs alongside her album announce \n\nHere‘s hoping they return for the new record",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1415359643663990874",
    "author": "bobby k",
    "date": "2025-09-10",
    "content": "it's basically just fast bounce? cheaper, offline/background, \"faster\"... reading between the lines claims to have more features than fast bounce, like something to do with alternate plugin presets or alternate playlists. I can't really see a reason for any of this.. i'd just duplicate the track if i needed an alternate version of a track and continue to use fast bounce lol",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1440906394403606690",
    "author": "Will Trotman",
    "date": "2025-11-19",
    "content": "Assuming staggered rollout. Don’t believe I’m paying for lossless. But just found this from today https://artists.spotify.com/en/blog/spotlighting-the-people-connections-and-stories-behind-your-music",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1441490473188327555",
    "author": "Josh",
    "date": "2025-11-21",
    "content": "Yoooo Spotify just dropped the A&R in the credits  update",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1461038576811901022",
    "author": "Karim",
    "date": "2026-01-14",
    "content": "I believe still spatial by default. Friend switched to Apple Music in December and had Atmos automatically enabled in his settings.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1462576270767296543",
    "author": "Slow Hand",
    "date": "2026-01-18",
    "content": "I do both! Every Monday morning I throw on Spotify's *Discover Weekly,* which strikes out sometimes but has a > 50% hit rate for my taste. And I'm a picky bastard. On Friday mornings the *Release Radar* cues up new releases from every artist I follow in an easy-to-digest playlist. It's extremely useful.\n\nMeanwhile I augment with suggestions and recs that come in from friends, research, and #🎵fav-music-talk. That's usually enough to keep me sated for the week.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1462578234502676635",
    "author": "Slow Hand",
    "date": "2026-01-18",
    "content": "Does Bandcamp do any sort of streaming/discovery? There’s so many amazing releases that only exist there. I need to look into that again.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1462592660475871388",
    "author": "Will Trotman",
    "date": "2026-01-18",
    "content": "The point you’re making about the curation not being 100% fulfilling is interesting and I was wondering recently if Spotify is gonna shoot themselves in the foot with the amount of AI music they’re pumping into their playlists. I feel like Spotify’s curation was the one leg up they had on other platforms and if it really sets in with people that the curation is tanking, maybe that creates an opportunity for a solution elsewhere.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1462596008046362797",
    "author": "Slow Hand",
    "date": "2026-01-18",
    "content": "Two years ago I was experiencing AI slop on Spotify. Not often, but occasional records that made me stop and say \"what the hell is this shit?\" \n\nBut, the thing I encountered the most were songs recommended to me that were low-effort songs attributed to well known artists (Billie Eilish, Nick Hakim, etc). These were clearly plays to imitate big artists and siphon off some streams from them for profit.\n\nI'm happy to report that I haven't seen *anything* like this in over a year. Spotify seems to have successfully clamped down on this, in my experience. In fact, I'd forgotten about them completely until you mentioned the possibility of AI music on Spotify just now. The only AI music I encounter is \"deliberate\" AI artists like Obscurest Vinyl, who I follow.",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1464458557893247119",
    "author": "Will Trotman",
    "date": "2026-01-23",
    "content": "She switched from Distrokid to Too Lost. I checked on spotify and Apple music",
    "reactions": 1,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "808866856772435998",
    "author": "Seanhmusic",
    "date": "2021-02-09",
    "content": "Yeah... But RADIO PAYS. Haha.\n\nStreaming 1000 times on Spotify and streaming 1000 times on radio ain't the same game. \n\nLots more money in radio to the best of my experience and knowledge.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "809531072865894462",
    "author": "Rollmottle",
    "date": "2021-02-11",
    "content": "🙏  https://www.youtube.com/playlist?list=OLAK5uy_nembk5kjOJF5iADyGHHLTzhRD8CZvrjBA",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "811836931645898772",
    "author": "paulCournoyer",
    "date": "2021-02-17",
    "content": "I recently switched over to Tidal and it's been nice on my end as well!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "811839416682676294",
    "author": "rae",
    "date": "2021-02-17",
    "content": "Haven’t tried tidal but I only use streaming (Spotify) for when I’m out and about. I buy CDs and Vinyl records which of course have album credits and imo better sound quality than streaming  from a $50 pair of Apple earbuds and I can always just plug my headphones into my turntable or CD player to really dig into a track. I don’t know too much about tidal except for that it’s better payment rates for those involved in the tracks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "818249695980814406",
    "author": "rae",
    "date": "2021-03-07",
    "content": "I have a record that doesn’t have any credits anywhere (not inside the vinyl sleeve, on tidal or even Wikipedia) - would this be a record label thing? Itching to find out who worked on the record but can’t find anything anywhere :((",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "824056867369386044",
    "author": "Zack Hames",
    "date": "2021-03-23",
    "content": "When you’re comparing loudness between your mix / anything released, how do you make sure the reference sources are actually at “unity”? Like playing off of Spotify (with normalization off) or importing a an MP3 or WAV from a CD or digital download Into the session? I find often when I do that the mixes are clipping pro tools, and if I go between Dropbox for my mix and Spotify on my phone, it never seems to match up no matter how loud I make a mix. Is there a best practice?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828619505911332985",
    "author": "David Fuller",
    "date": "2021-04-05",
    "content": "I find the playlist system easier",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828870876735733761",
    "author": "dylannash",
    "date": "2021-04-05",
    "content": "What are some of your favourite elements of your prod/mix templates? I currently have a separate production/writing template and then another for mixing but I’m trying to hybridise and streamline them a little more to get faster results and hopefully focus on the song. Also, most of the songs I mix tend to be one’s I’ve written and produced as well, so hoping to cut down on session set-up time.\n\nSome of mine are an instant “duck bus”, which I picked up from Ian Kirkpatrick. It’s a pre-loaded aux with something like LFO Tool or shaper box on it, so you can quickly route and uniformly make things side chain.\n\nAnother quick workflow thing I love is having Pro Tools audio playlists with a bunch of reverse sweeps, impacts and other transition fx/ear candy hidden and ready to go in the session, so you can quickly try out a bunch. \n\nI also have the trim plugin added as the first and last plugin on every new track preset, as I use them to quickly manage the gain in and out of each track and so I don’t have to search for them constantly.\n\nOzone Spectral shaper on some music busses and as a replacement for Soothe on the mix bus has also been a real win (thanks Jon!) Although these sorta things aren’t turned on whilst writing as they have a ton of latency.\n\nKeen to hear what you all find useful!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "828971198402527302",
    "author": "Eric Martin",
    "date": "2021-04-06",
    "content": "I route my mix bus to a print bus and can use this as a ref A/B by toggling the input, then if I have a ruff mix or a ref I can choose the playlist of which one then I never process on a master, always mix bus process and print to the print bus, that way I can hear and SEE my mix getting printed in real-time as a check to make sure everything “looks” right as it sounds right",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "828972812307660870",
    "author": "GEORGE NFTEAPARTY 🥃",
    "date": "2021-04-06",
    "content": "Is there a go-to place anyone uses for seeing mixing credits on a song? Frustrating that Spotify only does production and writing.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "828981563747598346",
    "author": "sethearnest",
    "date": "2021-04-06",
    "content": "https://listen.tidal.com/ - you don't need an account to view songs and credits. A lot of songs have the credits of performers, musicians, engineers, etc listed there. Allmusic is another good source, but I've noticed Allmusic gets less info from a lot of independent releases.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "843926141625434133",
    "author": "Josh Bowman",
    "date": "2021-05-17",
    "content": "Thanks for confirming! I was assuming tidal sounded “correct” vs spotify but realized I just assumed and never actually checked 🙏",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "843970857659662405",
    "author": "Slow Hand",
    "date": "2021-05-17",
    "content": "I wonder what the end goal for Apple is. I've got so many questions: Why is it important for Apple Music to support spatial audio? What does spatial audio within headphones do that stereo cannot? Does Dolby Atmos fold down to their spatial audio algorithm in a satisfying way? How many records are actually gonna be mixed for Atmos?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "846971075681845248",
    "author": "peterlabberton",
    "date": "2021-05-25",
    "content": "We'll need to get someone to put the soundcloud algorithm in a plugin",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "846972953412501505",
    "author": "peterlabberton",
    "date": "2021-05-25",
    "content": "In 20 years we'll all be going for the soundcloud sound. Or AI will be making all the records. 😭",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "846973286461997057",
    "author": "peterlabberton",
    "date": "2021-05-25",
    "content": "Actually I suppose lots of people are going for the soundcloud sound right now, huh? I used to be cool.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "846973588200488971",
    "author": "David Fuller",
    "date": "2021-05-25",
    "content": "I've had people send me mixes to crit on soundcloud",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "846973700779409458",
    "author": "David Fuller",
    "date": "2021-05-25",
    "content": "I have to tell them that I literally can only give broad stroke level things because of how bad soundcloud mangles audio",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "847647610894417930",
    "author": "Eric Martin",
    "date": "2021-05-27",
    "content": "all I know is it’s been around a lot longer and feels more accurate, AND Spotify/Apple/most normalization is RMS not LUFS, Apple has been normalizing since before LUFS was a thing and they use basically the same algorithms to do they’re normaling today that they used in 2001",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "847660503392321586",
    "author": "Zack Hames",
    "date": "2021-05-27",
    "content": "I’m pretty sure Spotify main normalization is set to -14 LUFS. \n\nIn my experience with Broadcast, streaming, Advertisement audio, the LUFS standards have proven incredibly useful and quite reliable. Every project to do for “web” is mastered to -14LUFS, North American broadcast is -24, and Euro -23. Hulu, Roku, YouTube, etc all have their own little specifications for loudness. \n\nLUFS takes into account perceived loudness whereas RMS does not. It also does not measure or add to the loudness for passages of audio that fall below a certain level of loudness. So if something is far quieter, it doesn’t get factored into the average loudness.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "852940618078224444",
    "author": "karlemilhald",
    "date": "2021-06-11",
    "content": "Hey everyone. What are Your impressions on the Dolby Atmos-spacial/headphone version on Apple Music? The mixes obviously vary in quality, but two main problems I notice in all the songs I've heard are 1) A roomy/chourusy sound, which is not a creative choise, but rather seems like an algorithm, which ruins 'in your face vocals' imh. 2) Missing the glue. - These songs may sound amazing on speakers, but from a consumer standpoint, I believe that the binaural Atmos for headphones is gonna be the way 99.9 people are gonna listen. Thoughts??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "852957958202589214",
    "author": "kylem",
    "date": "2021-06-11",
    "content": "agreed - just took a listen through a few songs on the hits in spatial audio playlist using my airpods. super inconsistent. some stuff sounds good, but in general it's just washy and strange. also felt like i was losing the intimacy for some songs. how many consumers are going to be properly setup to enjoy an atmos mix?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "853062347438161960",
    "author": "cian riordan",
    "date": "2021-06-11",
    "content": "Honestly I think it's terrifying that if you have Airpods and Apple Music, the default is now set to listen in spatial audio. It's highly unlikely that 99% of artists invested as much time in the Atmos production (if even) than the stereo production.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "866314052137517087",
    "author": "Eric Martin",
    "date": "2021-07-18",
    "content": "https://open.spotify.com/track/27L8FnjBjOuGrAHeWthYj8?si=Ak87nsslQFSC2jxTR8_E_Q&context=spotify%3Aplaylist%3A37i9dQZF1DX30gKInBBe5k&dl_branch=1",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "866731938622341140",
    "author": "Eric Martin",
    "date": "2021-07-19",
    "content": "I think because I have normalization turned off and my older version of iTunes can’t play the lossless version I was hearing the compressed file clipping, the full res I downloaded from bandcamp sounds incredible",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "872814992427212801",
    "author": "chadwahlbrink",
    "date": "2021-08-05",
    "content": "Kanye has a live stream of him “finishing the album” running on Apple music. Audio is muted.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "873251798557790288",
    "author": "frankieharper",
    "date": "2021-08-06",
    "content": "Anyone got any ideas as to what’s going on with the vocals in this chorus? The ambience / reverb / wtf is SO sick. Is that some M7-ness???\n\nSounds like a pretty big stack of doubles?  Probably helps🧐\n\nhttps://open.spotify.com/track/09PGubKAMryhOWv1LHpCYz?si=Q9-GrmsmRIWzF6uDP2-k8Q&dl_branch=1",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "878699997502246912",
    "author": "jadynviolet",
    "date": "2021-08-21",
    "content": "https://soundcloud.app.goo.gl/FA35SX5KJVppRzer6",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "882378398834495519",
    "author": "Slow Hand",
    "date": "2021-08-31",
    "content": "I can't help but think about all of the Youtube playlists of \"chill study music\" that are constantly recommended to me on Youtube. It's really become it's own genre in the last few years, hasn't it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "882379302342103041",
    "author": "Slow Hand",
    "date": "2021-08-31",
    "content": "I habitually tell the Youtube algorithm to stop showing me channels that have study music playlists and the like. But they just keep coming. They must be really profitable for somebody if people keep releasing them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "885972367275348009",
    "author": "Slow Hand",
    "date": "2021-09-10",
    "content": "When did Spotify start defaulting to the \"clean\" version of tracks? I'm listening to this Baby Keem/Kendrick track right now and it's ruining it for me.\n\nI recently re-listened to 'Blacks Reconstruction' by The Roots and it's completely unlistenable now that it has a good 80 edits in it, despite being labeled as the \"Album Version\": https://open.spotify.com/track/6cq1D3ZaL8SrrHkgHB8nwl?si=6720c9125a9e40b8\n\nIt's not as if records like this ever stood a chance of pop appeal and required an edited version to reach an audience. It's so dense with profanity that it'll never be played in public anyway. Now because of this censorship not only does it fail at being acceptable to a broad audience it's also rendered unlistenable to it's intended mature audience.\n\nIf I didn't already love this record and didn't already own an uncensored copy I almost certainly would never give it a fair listen and come to appreciate it. I can't help but wonder if a lot of great music today is being rejected out of hand and not discovered by new listeners because of the censorship.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "885984210450542622",
    "author": "Josh",
    "date": "2021-09-10",
    "content": "I think Spotify just knows I’m a sinner.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "907042727240290375",
    "author": "Konstantine",
    "date": "2021-11-07",
    "content": "for promoting my music around campus, cool graphic + spotify code",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "917934959036100678",
    "author": "Slow Hand",
    "date": "2021-12-07",
    "content": "Does anyone else keep opening Apple Music by accident while they're typing? I probably do it 3 times a day and I cannot for the life of me figure out which key command keeps opening that program. Does anyone know how I can disable it?\n\nIt seems to be an addition to the recent OS's. I've checked all of the keyboard shortcuts in my prefs and nothing suggests how to turn it off. Google searches aren't helping either. I'm only getting shortcuts for key commands *within* Apple Music.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "934204872226668575",
    "author": "Eric Martin",
    "date": "2022-01-21",
    "content": "@Zack Hames I’m the same, mostly friends music and people that I really want to support, buying vinyl when I want it, but I even buy on bandcamp if I can, I don’t really care about owning the files, but it’s getting the $$$ directly into the hands of the artist",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "950842747781275658",
    "author": "Felix Byrne",
    "date": "2022-03-08",
    "content": "yep same w spotify and apparently wikipedia",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "990010545627340840",
    "author": "Slow Hand",
    "date": "2022-06-24",
    "content": "I am pulling my hair out because there is a key command in Mac OS that opens Apple Music and I have no idea what buttons I keep pressing that opens it up when I'm in the middle of typing something. It is infuriating, but there are days when I probably open that app 5 times by accident.\n\nHas anyone else experienced this? Does anyone know how I can turn it off? Google searches have been unhelpful and, as it turns out, MacOS won't even let me delete the Apple Music app.\n\nIf someone can help me solve this problem I would be eternally grateful.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "990018629494009856",
    "author": "Slow Hand",
    "date": "2022-06-24",
    "content": "That would be particularly upsetting, because I happen to strongly dislike that song.\n\nMaybe I should upload a single 3  second Napalm Death song as the only entry in my music library so that it stands a high chance of startling the shit out of me every time I open Apple Music.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "999397060514156605",
    "author": "ehutton21",
    "date": "2022-07-20",
    "content": "Doubling back on the new iPhone speakers: does anyone else find that the audio sucks when volume is maxed? I just played a finished mix-master to check at max volume, sounded like shit, then played “golden” off spotify, which also sounded like shit at max volume and then I was like “oh hey maybe I’m not going crazy”. Is this a common experience for anyone else?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1012512461464805386",
    "author": "JNinothemc",
    "date": "2022-08-25",
    "content": "Yoo gang. Is tidal the best streaming service for audio engineers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1012556255736385598",
    "author": "NoahNeedleman",
    "date": "2022-08-25",
    "content": "Isn’t Apple lossless now? Still better quality on tidal?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1012586423779606588",
    "author": "Eric Martin",
    "date": "2022-08-25",
    "content": "I wouldn’t be surprised is Tidal was using AWS",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1012590705375449108",
    "author": "ehutton21",
    "date": "2022-08-25",
    "content": "Used to work in tech (soooo brief, makes the music industry look easy). Everyone is using AWS. I’m pretty sure Samsung (old affiliation with tidal) has something with AWS, so I’m sure tidal has used it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1012653885971759104",
    "author": "Barbara",
    "date": "2022-08-26",
    "content": "I wish every streaming service would have credits for albums/songs. I used Tidal for this very reason for a long time. Now I've switched to apple music, not only because it's also high res but also because it's easier to share. And I've noticed this more often, new releases (not the major label ones, ofc) are harder to find on Tidal... Specially where I'm from, since it's not a platform that most people use or even know about",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1012768042536665128",
    "author": "Jeremy Klein",
    "date": "2022-08-26",
    "content": "i still don’t understand why tidal has credits that others don’t. \n\nyou’ll see a track on tidal from 20 years ago and the credits will say “Assistant A&R’d by: “",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1012768134035415092",
    "author": "Jeremy Klein",
    "date": "2022-08-26",
    "content": "_where are they getting that from and why can’t spotify just pull from the same source?!_",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1012782326146674698",
    "author": "chriswheeler",
    "date": "2022-08-26",
    "content": "it's not Spotify's fault lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1012783083675725854",
    "author": "Barbara",
    "date": "2022-08-26",
    "content": "how is this different from Tidal's? (honestly, I know nothing about this! 😅 )",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1012810346915967006",
    "author": "Jeremy Klein",
    "date": "2022-08-26",
    "content": "Hey great to have you here! So what is Tidal using that's different?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017228599016824883",
    "author": "peterlabberton",
    "date": "2022-09-07",
    "content": "Another 1-2 years of aggressive promotion by Apple thru Apple Music/Dolby/whatever, and then a slow un-announced fade out into obscurity, with labels following suit?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1017839936877109248",
    "author": "Jodonny",
    "date": "2022-09-09",
    "content": "Best quality audio library for sending catalog? I know zipping WAV files is good practice for sending the best quality mixes, BUT it's not always convenient when showing people your full catalog of released and unreleased work. Some people in my area of the industry use Songspace, but I want the best quality I can get and they have no info on their site about what quality they stream. Soundcloud and Dropbox all suck. Any thoughts?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017847163398668432",
    "author": "Calvin Lauber",
    "date": "2022-09-09",
    "content": "Yeah disco is really great. It’s getting used a lot now by labels and artists in my little pocket of indie/alternative bands. It’s asthetically pleasing, feels higher res than most streaming options, and I like that it plays straight through your playlist.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1017862088980451338",
    "author": "Jodonny",
    "date": "2022-09-09",
    "content": "much better than the 128 MP3 from Dropbox or the 64 Opus from Soundcloud",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1032467800863809556",
    "author": "Slow Hand",
    "date": "2022-10-19",
    "content": "Does anyone have recommendations for a good piece of (mac compatible) software that will allow me to manage a digital music library?\n\nI've used iTunes for years, but every time I want to transfer my library to iTunes from an external drive it's a bit of a nightmare. When I open iTunes (now Apple Music) I barely recognize the app. \n\nFAQs online now suggest that I need to log into an Apple Music account to import my library, which seems absurd and unnecessary for such a local process.\n\nSo I wonder, is there an affordable and simple piece of software that will allow me to import an iTunes library of 500gb and manage the library without all of the bloated features of Apple Music? All I want is a list that will help me to navigate my library easily and consistently.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033108978999251005",
    "author": "itaylerner",
    "date": "2022-10-21",
    "content": "I think community is the keyword there. Every song by every person ever is everywhere all of the time, which is insanity. I think fragmentation is inevitable. Spotify/TiKTok etc are reactionary. Contrary to popular belief, they don’t actually drive culture. They’re just the vehicle.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1033145682254639125",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "Spotify’s payment per stream is very small and they are still loss making. Ok, double the monthly fee, more for artist and profit for Spotify. Privacy rears it’s head again. The digital cat is out of the bag",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033148764589932554",
    "author": "peterlabberton",
    "date": "2022-10-21",
    "content": "If Spotify isn’t even profitable with its predatory royalties, fuck em. Let them fail and some new yung Zuck should come in and innovate something better, isn’t that the market at work?!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033149361019965441",
    "author": "ALXCPH",
    "date": "2022-10-21",
    "content": "This is so true! Spotify is what brought money back into music",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033149770811834408",
    "author": "Nomograph Mastering",
    "date": "2022-10-21",
    "content": "I pay about $60 a month for apple, Qobuz, tidal, Spotify and Amazon rn",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1033152782905114665",
    "author": "peterlabberton",
    "date": "2022-10-21",
    "content": "I don’t think the following has any real chance of happening (at all), but: imagine labels en masse pulled their catalogs and the whole industry switched to a more Bandcamp oriented model. Wouldn’t the labels and artists all make more money?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1034271699954307072",
    "author": "1ggy",
    "date": "2022-10-24",
    "content": "Bless the person who thought of 1.5x and 1.8x etc speed listening on Spotify. Makes consumption of podcasts much more efficient. Although, 3.5x speed should just be called “everyone on coke”",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1034532613983060029",
    "author": "Nomograph Mastering",
    "date": "2022-10-25",
    "content": "Wining Spotify playlist games is a whole different business, and sonics and impact matter. But I think it’s worth being mindful that it’s an adjacent but fundamentally different goal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1036393776626806854",
    "author": "Zach Hughes",
    "date": "2022-10-30",
    "content": "There also, in casual discussions around streaming payouts, does not seem to be much of an understanding of how the value of a stream is derived and the affect of choices made by non-music interests on that derivation.\n\nChoices such as using a pro-rata payout model vs a user centric payout model. Spotify has said they would adopt a user centric model if the general music community called for it. This would probably be better for most of us.\n\nOr even nuance surrounding what the definition of a stream is and consideration for the type of record being streamed relative to the payout amount. A stream of a record of complete silence is worth the same as a stream of the largest scale commercial release.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1036395948550660136",
    "author": "Eric Martin",
    "date": "2022-10-30",
    "content": "I think that was true before Spotify went public and it was used to leverage them with a catalog, but when Spotify went public the labels all sold their shares and cashed in, now it’s primarily held by the two founders, a couple holding/trading companies and Tencent a Chinese entertainment platform",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1037540792224460891",
    "author": "Eric Martin",
    "date": "2022-11-02",
    "content": "https://music.apple.com/us/playlist/reference/pl.u-d2PyjTMBpYJy",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1037555203626504233",
    "author": "Eric Martin",
    "date": "2022-11-02",
    "content": "sometimes I end up putting the entire albums on, this playlist sends me in a tailspin EASY.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1044435787833421864",
    "author": "sukhuno",
    "date": "2022-11-21",
    "content": "@Slow Hand I recall you and someone else on here looking for something to replace your iTunes library on Mac. Check out Swinsian https://swinsian.com/ I’m rocking the trial right now and it does pretty much everything I used iTunes for. It has tagging, playlists, copies new tracks to folder structure, etc. also a reasonable license price of $25",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1050681611596869662",
    "author": "Ross Fortune",
    "date": "2022-12-08",
    "content": "Would guess that processing would be done on upload/transcoding or whatever they do to suck it into Apple Music? They’d have to QC it a bit, surely?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1058491882742759535",
    "author": "Zack Hames",
    "date": "2022-12-30",
    "content": "Sure. But more people buy vinyl than buy digital on bandcamp. You can also sell vinyl on bandcamp",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1066406528300613693",
    "author": "KushKadett",
    "date": "2023-01-21",
    "content": "Does tidal actually stream masters with more than 44khz? Hard to find any answer. I’m not even sure what master means",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1069779590651842632",
    "author": "Rollmottle",
    "date": "2023-01-30",
    "content": "playlists are fleeting",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069784723523637298",
    "author": "austenballard",
    "date": "2023-01-30",
    "content": "Probably not, there will always be a need for good singles to draw people to the album. Then the album just goes on in the background while you go about your day, just like any other playlist or what have you",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1069785111094108271",
    "author": "Deleted User",
    "date": "2023-01-30",
    "content": "it keeps coming back down to spotify thing. for an artist, a BIG one to need to release that many songs to generate meaningful amount of royalties says a lot",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1069785323543994460",
    "author": "austenballard",
    "date": "2023-01-30",
    "content": "It's not about generating meaningful amounts of royalties. The big 3 own most of Spotify, they can demand whatever royalty payments they want and they'll get it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1072390982110289980",
    "author": "popaganda.",
    "date": "2023-02-06",
    "content": "This will probably happen again, and as hard as it is, try your best to not give people disclaimers about how your new unreleased stuff is so much better than the old stuff on Spotify.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1073330859135995966",
    "author": "spectrummasters",
    "date": "2023-02-09",
    "content": "Oh wow lovely , I bet that studio sounds crispy !    Btw , I enjoy your unf^ck playlist btw , very eclectic and It has one of my fav Eva mixes by Jon (I think ) on there 👌🏼 . Good selection of different sonics and vibes. It’s a good ear refresher",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1077410943186771968",
    "author": "JNinothemc",
    "date": "2023-02-20",
    "content": "Hey guys so I just watched an episode where Jon talked about Tidal being the most true sounding. I wanted to know what that meant",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1077412898940395550",
    "author": "Nomograph Mastering",
    "date": "2023-02-20",
    "content": "It’s been discussed here, just recently. Search for tidal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1077412955295059990",
    "author": "Nomograph Mastering",
    "date": "2023-02-20",
    "content": "Tidal is not king anymore",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1079804665086103572",
    "author": "spectrummasters",
    "date": "2023-02-27",
    "content": "Great , that’s exactly the area i really want to master now....pulling up Apple Music now to check out thes two tracks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1082708852392341675",
    "author": "Jesse Ray",
    "date": "2023-03-07",
    "content": "@Nomograph Mastering Can you explain the significance of \"Nemo Egg\" and how it wound up on the unfu*k playlist? I hear some intense high frequency machine noise that cuts in and out, so I'm assuming this is a tweeter check for rigs/rooms? Super fascinating",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1083471486762889216",
    "author": "popaganda.",
    "date": "2023-03-09",
    "content": "But still, fuck Spotify.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1084185775140261968",
    "author": "chadwahlbrink",
    "date": "2023-03-11",
    "content": "I just use it via the share sheet from Apple Music",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1086929457350180914",
    "author": "spectrummasters",
    "date": "2023-03-19",
    "content": "Simultaneously to this AI discussion starting here yesterday, i was having my once a week listen to Apples hip-hop playlist , critically listening to the productions/mixes and masters of our contemporaries. A \"new\" pop smoke song came on as a collabo with one of the bigger London artists of this moment....and immediately imo the record felt cynical , pointless and macabre to me. Having arrived home i then read the really interesting and informative discussion on here about the details and angles of AI completing works, creating avatars etc.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1088887209333117009",
    "author": "austenballard",
    "date": "2023-03-24",
    "content": "Can't wait til it can listen to my mix, check it against the reference playlist and make eq adjustments and write automation for me",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1093271105088782366",
    "author": "Felix Byrne",
    "date": "2023-04-05",
    "content": "https://open.spotify.com/track/6efkcs2aUBMFKxl0cl2JWQ?si=7244c52cdd3c4ae2",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1094990787357462710",
    "author": "Ross Fortune",
    "date": "2023-04-10",
    "content": "This pod has a really fascinating discussion on vocal models, including the reincarnation of Bob Marley to sing on adverts (listened a while back but I think that legal case has already come up?) https://open.spotify.com/episode/6IGW6MWK7VJuE4sHWkyy7H?si=63ce96f452ae48db",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1095465731786809494",
    "author": "Ross Fortune",
    "date": "2023-04-11",
    "content": "Sheesh, the more you know. I never should’ve left Spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1095465927417548821",
    "author": "Nomograph Mastering",
    "date": "2023-04-11",
    "content": "You definitely should have left Spotify!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1101142242439204905",
    "author": "ALXCPH",
    "date": "2023-04-27",
    "content": "https://open.spotify.com/track/1K0urJwRWgKsdufGEdkXP7?si=f5ac6d797adb4a2a",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102266613543207026",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "Do the drums need to be real-ish ? Because I make playlists i add to every week but real drums are hard to find unless the group is rock focused",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102266691574046772",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "the playlists are specifically for referencing tho !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102267427762479255",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/5DKcc3WxMwE7JB1IxCrdrs?si=5cb7384be0104f6f",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102267642204663958",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/5jcih933VV9IAx2EbadFXQ?si=ebdd1c49af264bf3",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102267782168592476",
    "author": "Zack Hames",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/5ECxiK4Vigo1yRRmAoZc1f?si=PaeLlI_1TcyWdVSxCNBOKw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102267873759604958",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/0Ni50H8KZDx9WVaKHId38j?si=f3a5234c519446f2",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102268280607084707",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/2YiQL9Aa4PmGF8oMFADzzA?si=1239cf9fbe4a4293",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102268467287171133",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/6rydH51WZy57dxUBdHyUU1?si=9e31791c52f845ad \n\na little less pop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102268654785134692",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/6duh2S2a8bVSzoFXJoJUFR?si=fa6a9ca9aa58427a\n\n*way* more pop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102268868426219732",
    "author": "hyanrarvey",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/4uxvvYZZ1mIQnLw1DPrmKS?si=BUK4nsOES1KU2SMIZYhI_Q",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102269437316448327",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/6GwnFEbZstFLKZq7HCVH8T?si=cd3f540a71824159",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102269873863794808",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/7tC2jMkaFZxfRfWg6to38q?si=16bc4798e157499b",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102269985537134663",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/0KmC4jFH8axcJqKvOTBXeX?si=d2704551ce8d4be6",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102270243092562030",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "https://open.spotify.com/track/6eMPkhwJpkBPagyC54s8wo?si=a35e2b8b2b314de3\n\nLast one, and I personally love the production of this track",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102273326057005056",
    "author": "Edward Rivera",
    "date": "2023-04-30",
    "content": "ok lied about the last one\n\nhttps://open.spotify.com/track/6IaOyzYlT5809ASyUKzDPq?si=51a6aa9f64c943b7",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1102276091424542842",
    "author": "Josh Bowman",
    "date": "2023-04-30",
    "content": "RIP Chat i wish i made this a thread. Adding all these to a playlist!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1102278318927134832",
    "author": "chrissorem",
    "date": "2023-04-30",
    "content": "https://tidal.com/track/228045955 I love this track and mix. Everett slays again!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105240129293000904",
    "author": "Will Melones",
    "date": "2023-05-08",
    "content": "Wow, Spotify has managed yet again to make the desktop GUI *even worse*? What are they doin’ over there?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1105244550395605073",
    "author": "conor // wbotm",
    "date": "2023-05-08",
    "content": "just when i was ready to jump ship back to spotify and everything",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1105245229373730838",
    "author": "Zach Hughes",
    "date": "2023-05-08",
    "content": "i am not a fan of the stories. don't tiktok my spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1105262398908158012",
    "author": "Deleted User",
    "date": "2023-05-08",
    "content": "I don’t know, I think spotify is doing what it’s supposed to do. I don’t use spotify for personal listening (I use apple), but spotify is great for browsing for new music and where culture’s heading. I think spotify is doing exactly that",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1105489434016755824",
    "author": "simplersounds",
    "date": "2023-05-09",
    "content": "What is the consumer setup to listen to Atmos? When listening of my M1 MBP 2021 or older wired apple earbuds I don't like what it does to the stereo imaging, I often find the extra 'side' material distracting and ultimately feel that the atmos feature detracts from my musical experience. At this point I have it disabled on the settings in Apple Music. What are your suggestions, should I get a pair of AirPod Pro's or Max's?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1115730854245834762",
    "author": "Edward Rivera",
    "date": "2023-06-06",
    "content": "https://open.spotify.com/show/3sPdUfVr0re9C2ks0A7cAX?si=h3Y5tOOaRQGGzYJUDNWO_g\n\nHighly recommend this podcast. Gets a little over my head sometimes but it does remind me to be diligent",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1121326615432011776",
    "author": "Rob Domos",
    "date": "2023-06-21",
    "content": "So the claim in this video is that all algorithmic EQ’s are actually convolutions?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1124380689073184950",
    "author": "cy (sigh)",
    "date": "2023-06-30",
    "content": "yeah. I have research /study time built into my schedule. I bookmark things /playlist songs I like or want to study and go in on more dedicated days.\nalso have prod. admin days where I save presets and sounds I really like and organize them in a way that makes sense. \n\nalso literally taking a class on sampling/ found sounds that one of my friends gives out every few months",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125076207633973320",
    "author": "Andy Lawson",
    "date": "2023-07-02",
    "content": "$4140 per song? What for the artist/record company/Spotify? Who",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125083623930994829",
    "author": "spectrummasters",
    "date": "2023-07-02",
    "content": "Ok I’ve pulled some numbers that might be ballpark  , Spotify pays . 00437 $ per stream",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1125086336408363041",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "then it should have made 7.37 million on spotify alone. but I believe that’s not what actually happens- I don’t think spotify actually pays out that much",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125095759579189379",
    "author": "Deleted User",
    "date": "2023-07-02",
    "content": "I only agree halfway. \n\nWhat does more value mean in art? How can you be more valuable than to make better music? All of that is vague. \nWe all are working on being better, but not all of us are good. \n\nThose who aren’t good won’t make money- but I think those who are decent should make at least good part time income. \n\nHow good you are is only quantifiable with stream counts. One stream count isn’t more valuable than the other. There isn’t really a straight parallel in what it means to be valuable. \n\nA song that saved someone’s life from suicide is a one stream count, a song that you didn’t know was playing while the phone was muted is also one stream count. they are both worth $.00437. I’m not saying a song that saved life should make more money. But was that more valuable than a song streamed while the phone was muted? Clearly it is",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125227273654640640",
    "author": "shaunobi",
    "date": "2023-07-02",
    "content": "Ughh. That is sad. Spotify… by the big three, for the big three",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1125227665046110250",
    "author": "David Fuller",
    "date": "2023-07-02",
    "content": "I think what most musicians had in mind was Bandcamp, not spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1128071039365165106",
    "author": "Jeremy Klein",
    "date": "2023-07-10",
    "content": "My gf's tiktok is 90% Taylor Swift related content. And something that's going around right now in that world is that Spotify's Audio Normalization is making the new Taylor Swift album's mixes sound really bad. \n\nhttps://www.tiktok.com/@thecurvebecameasphere1/video/7253321975114992942?is_from_webapp=1&sender_device=pc&web_id=7134081823424251434",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1128074862527791164",
    "author": "Rollmottle",
    "date": "2023-07-10",
    "content": "oh so that's where the $.12 from Spotify came from!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1129388375539982496",
    "author": "oaklandmatt",
    "date": "2023-07-14",
    "content": "https://open.spotify.com/episode/5cn5hzZpKCTJJrurlJrHEM?si=w_hrUYFISjWkEpohIPXdew",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1130413894402326669",
    "author": "Ross Fortune",
    "date": "2023-07-17",
    "content": "Very down for this. I’m building study/practise into my routine (learning songs on instruments, and remaking sounds/productions are top of the list atm).\n\nMaybe we make a thread within #🎹production-talk and add links there as a resource and/or construct a shared playlist in the same thread?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1131094561230434375",
    "author": "OJ",
    "date": "2023-07-18",
    "content": "Asking questions tonight but, does anyone know companies that help make merch for artists on their Spotify? Seems to be able to only use Shopify..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1131100260471685190",
    "author": "OJ",
    "date": "2023-07-18",
    "content": "but spotify only takes shopify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1131101498265309235",
    "author": "Will Melones",
    "date": "2023-07-18",
    "content": "Shopify is so prohibitively expensive to use as a merch platform. Thanks for making merch sales suuuper accessible to indie artists, Spotify! 🖕",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1131608416784236695",
    "author": "Will Melones",
    "date": "2023-07-20",
    "content": "I guess it depends heavily on scale. $40 a month just to keep the doors open sounds steep for an artist who isn't already selling merch at a consistent rate. I haven't looked at Shopify's print on demand pricing, but in general POD is much higher cost than bulk screen printing t-shirts (for example). So if you're a band selling at the scale where $40/mo. on a slow month isn't your *entire* profit margin, it seems like investing in a run of merch would pay for itself.\n\nNow this is completely different if you look at it from the perspective of a clothing brand, where the goal is to have a diversity of designs available at all times, without the need for warehousing and a huge startup cost, and to consistently push sales to a customer base that's devoted to *the merch*. I can't imagine the vast majority of DistroKid artists are going that hard on ecommerce, but they could sure benefit from having their POD merch visible on their Spotify profile. The small artists I work with would probably be better off putting $40 into Instagram ads every month.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133470153959559248",
    "author": "Edward Rivera",
    "date": "2023-07-25",
    "content": "https://open.spotify.com/track/5bVOX6eyHsML2sB4aMlZEi?si=FedE7rl1RCWMxbVdWb_qPw\n\nNot my go to example, but was just listening to it. Listen to the transition from verse to chorus, and to verse again. \n\nListen to the bass when it does \"fills\" \n\nThere's hundreds of rides in this one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1133471617482235924",
    "author": "Edward Rivera",
    "date": "2023-07-25",
    "content": "I know you do electronic music, where these things are more deliberate than corrective, here's one with a shit ton of rides\n\nhttps://open.spotify.com/track/2eGHyarZyRvUgFI4d3G8GN?si=sznNczaJR8GSmUIBjlQODQ",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1141963393629163620",
    "author": "Rollmottle",
    "date": "2023-08-17",
    "content": "nothing custom, but you can embed a Soundcloud or a Youtube playlist pretty well.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1142106278068494416",
    "author": "Zack Hames",
    "date": "2023-08-18",
    "content": "This is super true, I’d love to know what everyone thinks is helpful for people who don’t have big names attached to their work. Is it more about having a Spotify playlist of your work?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1142124198584647832",
    "author": "Rollmottle",
    "date": "2023-08-18",
    "content": "putting my usability and product designer hat on for a moment: a grid allows somebody to see breadth and allows them to quickly find something that may be close to what they're looking for without faffing around on a Spotify playlist. my grid links out to Spotify or Bandcamp or whatever. i'm a proponent of grid.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1142686041069858877",
    "author": "Slow Hand",
    "date": "2023-08-19",
    "content": "When’s the last time someone dropped a record that was challenging existentially? That forces them to confront who they are and what they’re doing. That feels dangerous to me and sorely needed.\n\nThe last record that comes to mind is Kendrick’s *N95* which begins by literally stripping everyone of their pretensions: \n\nhttps://open.spotify.com/track/0fX4oNGBWO3dSGUZcVdVV2?si=rdX8uqpmQ6eN6jmh2U24UA",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1143228991675842700",
    "author": "spectrummasters",
    "date": "2023-08-21",
    "content": "Yes I defo get that and I agree with you . Moaning isn’t very rock star , smashing some shit on the other hand lol \n\nIm still undecided about the arguement that  streaming saved the industry from piracy that  Napster personnel made later (I need to check back on their names ) when one of them went on to be involved with Spotify I think  …..but I know there’s many arguements to be made in all directions . I enjoyed @oaklandmatt ‘s lwmr about the business side for a contemporary take on all This . My spicy take is streaming didn’t save the industry from collapse by piracy  …..the pirates maybe just captured the industry and held it to ransom to create streaming subscriptions",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1143566730975793226",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-08-22",
    "content": "https://open.spotify.com/track/4Q9zJZBVJRGkiOWaZbEFIK?si=q-wP5MbUSz-n60BpLvZ_0Q i mean cmon",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1146874782273503342",
    "author": "Slow Hand",
    "date": "2023-08-31",
    "content": "Does anyone here host their personal music collection in the cloud? I've got a massive collection that could get more love, so I figure I should look into a solution for engaging with it more often.\n\nWhat I'm seeking is:\n1) My entire 500gb collection hosted in the cloud\n2) The ability to organize and catalog everything meticulously.\n3) A desktop and phone app that will allow me to stream any of it at will. Like using Spotify on your phone.\n4) Requires very little in the way of ongoing subscription costs.\n5) (Edit) Ideally it would be open-sourced or robust enough that if the developer closes the tools will still function.\n\nDoes anyone know of any options that satisfy most of those needs?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1147917251303964753",
    "author": "OJ",
    "date": "2023-09-03",
    "content": "I'm just comparing the song I have in Ableton right now vs songs I'm listening to in spotify for reference, and I love the quality of mine and think if it's just turned up say 2DB its on par with volume on spotify tracks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1151166674863673475",
    "author": "masteredbyjack",
    "date": "2023-09-12",
    "content": "Nathan is a legend! It’s been really beneficial for me (I have 2 of Nathan’s masters on the playlist, a couple of Dale’s and Ruairi’s)\n\nIMO @Nomograph Mastering midrange is untouched, transcendent",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1151246022580908042",
    "author": "Maxim",
    "date": "2023-09-12",
    "content": "Would be really curious to hear which tracks are on the \"edge of too much low end\" in that playlist",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1152342407841587240",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-09-15",
    "content": "Relatedly, yall ever experienced a \"brainwashing playlist\"? \nAt a One Direction concert I went to 5 Seconds of Summer opened for them, and someone had struck a deal to play only \"She Looks So Perfect\" and one other 5SOS song on repeat before the opener, after the opener, and after the 1D set. \n\n\nI still really like that song, unsure if it's in spite of or because of that night",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1152697324611588116",
    "author": "Slow Hand",
    "date": "2023-09-16",
    "content": "Often. I like it a lot.\n\nI never use algorithmic verbs (like VVV). Instead I’ll use a convolution verb like Seventh Heaven because it feels most natural. I really enjoy the sense of glue it can give me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1153258533941420053",
    "author": "Edward Rivera",
    "date": "2023-09-18",
    "content": "https://spotify.link/XHH7F3DRbDb",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1155111646440730717",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-09-23",
    "content": "Guys! I have a Query\nI wanted to remove all the track from my Spotify account for a fresh start so I opted to remove all the tracks from streaming platforms from my aggregator dashboard account. It's already says that the tracks has been removed but my Spotify still shows all the Tracks.\nI tried to mail them about it and they responded that they'll fix this but they haven't yet\nThe Aggregator is Ditto \nI'm also planning to change my aggregator as well to an Indian aggregator \nDo I have any other option to remove all the tracks of mine from streaming platforms other then waiting on Ditto?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1156367234420179065",
    "author": "Reedy",
    "date": "2023-09-26",
    "content": "canvas in spotify could be a solution?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1156402586728009800",
    "author": "rae",
    "date": "2023-09-26",
    "content": "You could do a canvas in Spotify, tiktok vids and reels on ig and even YouTube vids for each song. Is the project a set of visualisers to music or music videos to music? You can always cut up the best bits for short form content and then direct everyone over to YouTube for the full length content if they dig it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1157480794424606811",
    "author": "Deleted User",
    "date": "2023-09-29",
    "content": "I also recently found out about autoplay. Now I can use it like spotify but slightly better recommendations",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1157678603002191922",
    "author": "Will Melones",
    "date": "2023-09-30",
    "content": "Ohhh good point. Occasionally I do use Spotify on an Amazon echo, so that’s a compatibility think to check",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1157712854372319292",
    "author": "Bryan DiMaio",
    "date": "2023-09-30",
    "content": "I’ve found a ton of stuff on Apple Music through auto play after forgetting to turn on album loop lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1157719507788382228",
    "author": "Josh Bowman",
    "date": "2023-09-30",
    "content": "Have had all three! Agree spotify keeps getting worse. Apple is my favorite alternative, tidal I unsubscribed because the search is really annoying and didn’t work well in many situations for me/wouldn’t come up with the result I was looking for when Apple or Spotify would show what I was looking for pretty  quick using the same search terms.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1158483457454915776",
    "author": "🗽🍕😼",
    "date": "2023-10-02",
    "content": "That’s what I’ve noticed. I don’t have a single credit on there. At least in the last few years but have a ton listed on Tidal.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1158522356835303504",
    "author": "Josh Bowman",
    "date": "2023-10-02",
    "content": "Loving this conversation btw! As someone who doesnt have any big name credits outside of old assistant gigs, my thought process was always to pile on any songs i think sound good i've done to my spotify reel, and then hopefully when people in my local scene go through it, they recognize some buddies or artists they know in there and can reach out to ask about me- BUT as i start to bark up the label tree and try and find more work in that realm, i've become pretty self concious about the volume of unknowns on there and have been thinking about taking a new approach to pairing it down to only things with some following/accolades (even if its just local/canadian awards or noms), and/or songs i LOVE and not just things i think \"sound good\". Curious if anyone has any thoughts?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1160756329326063696",
    "author": "NoahNeedleman",
    "date": "2023-10-08",
    "content": "When I first started listening to the LWMR pods, Jon was going deep on his no-compression journey. I was fully shitcanning him in my brain over it, but his argument was backed up by a Joy Oladuken track that sounded absolutely stunning to me, and is still on my tuning playlist. So it got me asking *how* I could forgo using compression, which ultimately taught me a lot more about compression as a tool and expanded my philosophy quite a bit because of it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1160756914355982346",
    "author": "Nomograph Mastering",
    "date": "2023-10-08",
    "content": "People wanna win, they could give a fuck if Serban was kicking dogs as long as they get that big old streaming number, it’s a status thing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1164141744309403688",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-10-18",
    "content": "Rip trout mask replica on spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1165413621715701831",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-10-21",
    "content": "On another topic, I enjoyed this rough, self-produced, heavily-quantized-piano song that is the #6 most played on Spotify right now. Just a good vocal and vibe,  lacking in a lot of areas but I enjoy that we live in a world where this got 35M plays in the last last week. https://open.spotify.com/track/2HafqoJbgXdtjwCOvNEF14?si=6bd611e747e24e98",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1173134490135171173",
    "author": "Nomograph Mastering",
    "date": "2023-11-11",
    "content": "The only streaming service that makes their streaming data public is Spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1173134942859960351",
    "author": "alexstein",
    "date": "2023-11-11",
    "content": "Oh yeah and to clarify I wasn’t wanting the stream count that muso ai has because I agree with you very much. My friends will always go to genius first to check for credits which seems weird when I think about it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1173768872835436616",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-13",
    "content": "https://open.spotify.com/track/30raivfq7rSt5nKltiHfzG?si=UkuJOtYNRvi0RhCyE__wKw always loved this tune",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1173786240034803813",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2023-11-13",
    "content": "Loving the hot takes today  🔥  \n\nThere's an interpolation of Uptown Funk in the #2 song on Spotify rn, Jung Kooks \"Standing Next To You\". The horn/drum break at 2:57 is so close it made me laugh. If there's an older source for that exact rhythm/instrumentation I'd love to hear it, fascinating\nhttps://open.spotify.com/track/2KslE17cAJNHTsI2MI0jb2?si=51fa45927d7b4a12",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1177601866746581132",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2023-11-24",
    "content": "Cant wait for spotify wrapped to see all our unhinged tastes",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1179483349077721160",
    "author": "Gazing Wrmth | Mixes & Masters",
    "date": "2023-11-29",
    "content": "Guys! Can we have a channel where everyone in the server can post their Spotify Wrapped?\nWhat do you think guys?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1181058450663424051",
    "author": "Nomograph Mastering",
    "date": "2023-12-03",
    "content": "Lots of records, you can google to see, or use Tidal or Jaxsta to see a list",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1182780902057709608",
    "author": "conor // wbotm",
    "date": "2023-12-08",
    "content": "hmmm heads up that when i updated TIDAL on my desktop it toggled back to normalise volume 😠",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1184853944191692921",
    "author": "masteredbyjack",
    "date": "2023-12-14",
    "content": "Monterey...but I'm using a vitural input, it is some 3rd party thing (I think inject I/O?) I had installed when I set up my machine, I had used to get a handle on what levels streaming was playing back at (recording in the waveform from Apple, Spotify, etc) to study translation of masters. For the life of me can't remember how I set it up, just to say that it can work.\n\nQuicktime --> New Screen Recording --> Shift + Command + 5 gives you the options on the screen, select the virtual input that is getting your computer internal audio and roll. Quality *seems* worse on the recording to my ear, but I could be wrong",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1191787325345255425",
    "author": "Deleted User",
    "date": "2024-01-02",
    "content": "Interesting. I think young people might be starting to miss or crave the intimate experience of record shopping and having that kind of relationship with music. Even though we get all the music out there on spotify, it won’t really give that same experience of looking through store’s collection like it’s a treasure hunt. So perhaps it’s not too much of a hipster thing anymore",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1192549527010418769",
    "author": "Zach Hughes",
    "date": "2024-01-04",
    "content": "Another consideration let's say an artist's most popular track is from 2016 and deeply algorithmically favored compared to the newer work. The 2016 track is the first thing people will see.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1192549587869777991",
    "author": "Zach Hughes",
    "date": "2024-01-04",
    "content": "On a spotify profile for example",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1195122259464032306",
    "author": "noahc",
    "date": "2024-01-11",
    "content": "I’ve been having audio dropouts on Mac m1 Ventura even while just listening to Spotify, and some deep digging shows me that Sonoma update has fixed these issues of stabilizing the cores and connection.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1195423041400885308",
    "author": "popaganda.",
    "date": "2024-01-12",
    "content": "im gonna hit you up for a playlist",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1196410975633559633",
    "author": "spectrummasters",
    "date": "2024-01-15",
    "content": "You know , you’re not wrong . Something to do with the licensing must have been funky , the version up now on Apple Music is different and contains no sample . The YouTube video version from back in the day still does though. Wyclef of course famously didn’t clear the Enya sample for ready or not either back in the day . Doh !",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1200151588069703761",
    "author": "Zach Hughes",
    "date": "2024-01-25",
    "content": "Maybe this has been around for minute but first time I've seen it. Spotify I guess is beta testing a new feature for having 'upcoming albums' show up with unreleased tracks grayed out, singles available in album order, and big 'ole countdown timer. One of the few new features on Spotify that I actually think is cool. I assume this isn't available to everyone yet. Anyone know?",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1200166574804439090",
    "author": "Zakhiggins",
    "date": "2024-01-25",
    "content": "@Gazing Wrmth | Mixes & Masters These young lads are making it popular again back home, I like this song:\nhttps://tidal.com/track/276580371",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1200169717214748744",
    "author": "masteredbyjack",
    "date": "2024-01-25",
    "content": "Very cool (like Ruairi said Apple has had it for years), and I think there is actually a lot of amazing stuff Spotify could do if they leaned slightly more into the lane of social media, being a hub for listeners to connect with artists. I get why they wouldn't want to do that, but even something like the simple pre-save button there is nice, rather than having to do the 3rd party pre-save thing, which is always a headache from my experience!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1200174569684746280",
    "author": "Slow Hand",
    "date": "2024-01-25",
    "content": "I'm pretty sure my Liked Songs playlist has something like ten different versions of The Auld Triangle. I've been looking for the platonic ideal performance of that song for years and they all offer something different.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1200350555910983790",
    "author": "Slow Hand",
    "date": "2024-01-26",
    "content": "https://open.spotify.com/track/6DH9qxj2GJi0lU2Y5FDHky?si=dc058bb48ca248de",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1200358239628435527",
    "author": "Slow Hand",
    "date": "2024-01-26",
    "content": "https://open.spotify.com/track/3bXv1lhx723X4TCDRgxmgN?si=a0ca572fcf544c5d",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1200559151529599077",
    "author": "! Andy !",
    "date": "2024-01-26",
    "content": "I mean this pretty goated as far as free jazz goes https://open.spotify.com/album/34KLU47PjzsivJmvYJCAPM?si=udWlV4m3RKas5hrSSPBG5w",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1207494975055601724",
    "author": "Rollmottle",
    "date": "2024-02-14",
    "content": "These are insanely targeted scams...end game being, stealing your IP to put up on Spotify themselves??? Blackmail? Really nuts.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1208502115237105664",
    "author": "Ingmar Carlson",
    "date": "2024-02-17",
    "content": "In all honesty I'm not sure how often my spotify portfolio playlist is actually *listened* to, even when it's requested.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1209992680969347142",
    "author": "Zach Hughes",
    "date": "2024-02-21",
    "content": "Came across this stat today and thought is was interesting: Only 19.16% of artists on Spotify had over a thousand monthly listeners in 2023 (from Chartmetric)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1210026141734281237",
    "author": "SoundsLikeJoe",
    "date": "2024-02-21",
    "content": "Article reference on same data...\n\nhttps://www.musicbusinessworldwide.com/only-19-of-artists-on-spotify-had-over-1000-monthly-listeners-in-20231/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1210109054605860905",
    "author": "Zack Hames",
    "date": "2024-02-21",
    "content": "@spectrummasters obviously Spotify’s point of existence was to make music available anywhere all the time, and to make money off of that convenience. But when you open your platform to ANYONE to be able to upload to it, what did they expect? That’s on them.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1210117399139983380",
    "author": "spectrummasters",
    "date": "2024-02-21",
    "content": "The last time I deep dive convo’d Spotify it wasn’t yet making a profit . I dunno if it is now ? But …sooner or later these huge investments being made at global corporations that entice other enormous investments have to be able to demonstrate ROI to keep the whole ponzi going . I forget his name but the founder of Napster and spotify many years ago effectively held the record industry to ransom in the face of the music piracy they enabled . Record labels were refusing to engage with the streaming tech , effectively the pirates said do or die . My quick idea is that lucian grainge is muscling control back and turning streaming into something more like old school record distributors whom the major labels controlled . A recent convo here was about the price of peoples music back catalogue",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1218669735902707963",
    "author": "BatMeckley",
    "date": "2024-03-16",
    "content": "https://open.spotify.com/track/0Cm9d2aok2ZCffdmcjf6c0?si=M3EJ_K6tSNa8YTej0TvMHw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219682709731938425",
    "author": "Nomograph Mastering",
    "date": "2024-03-19",
    "content": "https://open.spotify.com/album/4tYokQ6vjGVHC0wEBMbeY0?si=3phglW0vQ0-BRJ8GW8G0Cw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219685654254977245",
    "author": "Slow Hand",
    "date": "2024-03-19",
    "content": "On the opposite end of the spectrum the tack piano on this Fiery Furnaces record is extremely hard and cutting: https://open.spotify.com/track/5vPqmXTWSASC7LSn8zHSvY?si=f27309d03657403e",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219695360658898964",
    "author": "NoahNeedleman",
    "date": "2024-03-19",
    "content": "https://open.spotify.com/track/0UJ6GekGDmtP2as2NxVTru?si=rEMIEQfxSUqWo7A_ICqe8w\n\nPay no attention to the de essing but I love this whole production",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219695515143508020",
    "author": "NoahNeedleman",
    "date": "2024-03-19",
    "content": "And this\n\nhttps://open.spotify.com/track/4G92yYrUs0cvY7G41YRI0z?si=UQ95zWLLSdq0dsh1R8Ly-Q",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219697521304273036",
    "author": "James Redfern",
    "date": "2024-03-19",
    "content": "https://open.spotify.com/track/1YBkXyn1nlp2SdCdsNkGtS?si=TTu-VvLAQheedSxghmwb3Q  Queen was definitely the most played band in my home growing up, so this classic bright Steinway is one of the “sounds in my head” for piano.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219697529264799864",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-19",
    "content": "https://open.spotify.com/track/44aTAUBF0g6sMkMNE8I5kd?si=Q4g-cHaNRKOkmjKCf_NiDg",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219697643626696827",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-19",
    "content": "https://open.spotify.com/track/3tmeua6TKrQAEyniklh9D9?si=wyW8pBqcQtqtCakSRB-FVw",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219697730973073418",
    "author": "James Redfern",
    "date": "2024-03-19",
    "content": "https://open.spotify.com/track/0WttB2xYS66VopJmwD1UzF?si=-GdN5okLSjOyDUBH6DwU9w  And for modern soul pop, I like how tucked, almost part of the sample/loop this is",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219697732768366734",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-19",
    "content": "https://open.spotify.com/track/7pqgMEKsDMOHUdFQ7n0N9K?si=KXuH1mRoT3i6WvwG6Vij1Q \nBeen loving this lately",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219754028402217072",
    "author": "! Andy !",
    "date": "2024-03-19",
    "content": "https://open.spotify.com/track/0T1EaGm6b9eM7xBf4F1hlc?si=910c7d0bd1a14e42",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219754542195933343",
    "author": "! Andy !",
    "date": "2024-03-19",
    "content": "https://open.spotify.com/track/6SpPoBsqSat43RGHHeUuMr?si=19154dc7c22e4741",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219780907247079555",
    "author": "Slow Hand",
    "date": "2024-03-19",
    "content": "Reading that article it's not clear where the (implied) abuse of Spotify is. The way this person's actions are described in the article they're a hyper-prolific songwriter who is releasing under 650 different pseudonyms.\n\nSo what's the deal? Are the songs AI generated trash? Are they impersonating real artists? Is Spotify being de-frauded somehow? Is it the same record being re-posted as multiple artists?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219789586956292106",
    "author": "Slow Hand",
    "date": "2024-03-19",
    "content": "I guess the question then is, what’s the advantage of multiple pseudonyms on such a large scale? Ten pseudonyms for ten different genres/playlists/markets, sure. But 650?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219790045054238822",
    "author": "SoundsLikeJoe",
    "date": "2024-03-19",
    "content": "Playlist curators will only populate a few tracks from a single artist in a genre list.  Wanna hit \"Soft Piano\" with 10 albums, then more pseudonyms can likely land more placements.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219797877115715594",
    "author": "SoundsLikeJoe",
    "date": "2024-03-19",
    "content": "The national connection is real for playlist placement. My friend (who will remain unnamed) has landed on all the TOP playlists for instrumental music...  and it's largely a networking byproduct...  and he's closer to the source.  So WIN for him. That's life",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219798228254593034",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-19",
    "content": "I did some rough math and based on his revenue estimates compared to the spotify average, he's possibly earning 1/10th of what he would under the normal rate. Spotify might have different deal for the \"focus hub\" music worked out with specific labels/composers",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219844440315920515",
    "author": "AJ",
    "date": "2024-03-19",
    "content": "Today someone asked about releasing a full album on an artist website as a digital product. The caveat is that singles are released once a month for streaming (full thing on streaming platforms at the end of the year, so the example had 12 singles).  After seeing some good discussion about the idea, I'm curious as to what y'all think about it? \n\nThe main points I've heard in favor of the move:\n- 1 person buying the album for 10 bucks cancels out so many no's\n- Prioritizes real fans over casual listeners\n- Incentivizes an artist to make the album, because it's batching content for a year. \n- Forces the artist to view music as a business, but doesn't fully leave the Spotify ecosystem.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219848317916286996",
    "author": "Zack Hames",
    "date": "2024-03-19",
    "content": "@AJ cool idea. But this is my main issue:\n\n1How will the consumer enjoy the full album regularly? If it’s not as convenient as Spotify, I don’t believe it will take off. The days of iTunes library and iPods are over.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219848808457048146",
    "author": "AJ",
    "date": "2024-03-19",
    "content": "Yeah that's my biggest issue with the idea too. The main reply to that was \"they can download the album on their phone or computer, and even bring it into Spotify like any other song.\"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1219849292777525320",
    "author": "Zack Hames",
    "date": "2024-03-19",
    "content": "I had this convo with a diy band with a lot of conviction about using bandcamp and not using streaming services, and that’s cool and all I get it, punk rock, but accessibility is more punk than exclusivity",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1219852300269523065",
    "author": "Zack Hames",
    "date": "2024-03-19",
    "content": "Also this is basically bandcamp",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1220471181816369182",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-21",
    "content": "this is insane. It's also insane that Spotify doesn't have better copyright ID systems in place",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1221208582054477834",
    "author": "oaklandmatt",
    "date": "2024-03-23",
    "content": "Not sure where best to ask this, so I'll ask here:\n\nWhat's the best way (or what are y'all doing) to make Spotify play back at the same level as your daw? \n\nI'm using an apollo for everything and I'd love to A/B things from a streaming service as I'm working on PT or Ableton. \n\nSpotify says turning its default to \"loud\" volume can compromise the sound quality, though I couldn't immediately find out what that means.\n\nWill another streaming service do it? Do I need some extra interface or software? Why isn't this easy?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221208767895441539",
    "author": "oaklandmatt",
    "date": "2024-03-23",
    "content": "Spotify, normalized, does not play to 0dB. I sure wish it would 💔",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221209940006273077",
    "author": "Jonathan Jetter",
    "date": "2024-03-23",
    "content": "Is Tidal an option? Pretty sure max volume in-app, normalization off = unity gain. Never tested Spotify.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221212610444136609",
    "author": "NoahNeedleman",
    "date": "2024-03-23",
    "content": "Apollo over here, I have to have Apple Music volume down a touch or two to get levels right. It’s an infinitely variable slider so it’s inexact, but it’s mostly worked for me. \n\nAm I missing something important?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221213665886470194",
    "author": "Jonathan Jetter",
    "date": "2024-03-23",
    "content": "I do it that way, Tidal set to use Audiobridge. Works great.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221216571112947732",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "I keep my Spotify and Apple Music normalized, to live in the world most listeners do. And then Qobuz and Tidal are not normalized if a serious reference is required. Turning on and off in one app is likely to confuse IME",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221218515105878177",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "Also remember that Spotify itself is a moving target - it can supply 3 different levels of normalization, 3 different file types (OGG/MP3/AAC) and multiple bit rates depending on settings/cellular bandwidth/mobile vs desktop vs embedded (car/smart tv)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221225243880853544",
    "author": "Ingmar Carlson",
    "date": "2024-03-23",
    "content": "From Tidal of course. With Spotify and Apple Music I’m only interested in having normalization on to inhabit the consumer’s world, as @Nomograph Mastering said above.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1221228068195274762",
    "author": "Calvin Lauber",
    "date": "2024-03-23",
    "content": "If you print your mix to a final stereo track, I will change the input of that track from whatever master bus output , to “MON L/R “ - which is the direct feed output of the Apollo. Then I mute that track and hit play on Apple Music (normalization off!) to print. I just record reference tracks straight in as part of the playlists of final mixes, that way when I’m in input mode I’m listening to my mix, and when I take it out I hear the reference. Instant A/B",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1221236480479989811",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "But here’s the thing, and everyone should do this. Take a master, play in your DAW and then listen to it on Spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221236689591337070",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "Again, vibe checks, inspiration then Spotify all day. But for detailed mix/master referencing I think it leads people astray",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221237147722453185",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "For many years I was Spotify level normed for playlist surfing/zeitgeist check and then Tidal in HiFi for actual like for like level and tone referencing. Clear delineation",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221238350766149632",
    "author": "Ingmar Carlson",
    "date": "2024-03-23",
    "content": "Honestly even Tidal referencing has led me astray often enough 😅",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1221239367989858364",
    "author": "oaklandmatt",
    "date": "2024-03-23",
    "content": "Sounds like tidal is the way",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221239369961181296",
    "author": "Nomograph Mastering",
    "date": "2024-03-23",
    "content": "Tidal or Apple Music set correctly are the easiest",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1221650640145743913",
    "author": "Andy Lawson",
    "date": "2024-03-24",
    "content": "i have in the last few weeks figured a system that works for me.. as i'm setting up/cleaning my mix session i stream the refs we have spoke about from tidal (through pro tools audio bridge) on max no normalization.. they sit under my print and i quickly flick to them to see if things are in the ball park.. at first i was using spotify then once i tried Tidal hifi couldnt go back..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222280388999778414",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-03-26",
    "content": "I find it really interesting that for instance in music streaming there are various streaming platforms that pretty much do exactly the same thing (provide all, or most of recorded music at a cost). There might be slight discrepancies (spotify not having Joni Mitchell/Neil Young catalogue until recently) but they offer essentially exactly the same product so they have to convince consumers from a different perspective („we pay artists more, we sound better, we have spatial audio etc.“) \nAnd on the other end of the spectrum you have the complete shitshow that is streaming movies/series on demand where you have to have like 5 different subscriptions bankrupting you just so you can watch your favourite movies. It‘s interesting how those two offer basically the same thing (access to entertainment on demand) but have developed drastically different",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222321532572008600",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-03-26",
    "content": "if my favorite artists post tutorials that I can access easilt via their artist pages this seems like a big win all around to me. As long as the spotify cut isn't like 40% or whatever",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222511470957563985",
    "author": "SoundsLikeJoe",
    "date": "2024-03-27",
    "content": "As a ancestor human still living in previous eras, aka: one who doesn't use Spotify:  I am very curious. Can we unpack this?...   like,  you loved the album but once removed from the app you stopped listening to it? So..  the platform usage is your primary mode of operation, and what music happens to be there, or not, is what is what guides your listening? Do you use other apps or just one?  \n\nFeel free to ignore...  but the psychology of this is incredible to me. I'd love to know how you felt and acted once a music you loved isn't on platform. (Anyone with similar xp, please chime in)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222599321695031476",
    "author": "jet",
    "date": "2024-03-27",
    "content": "But that also means no including Blue in playlists or getting it randomly played on spotify radio",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1222923610478350356",
    "author": "Adam Thein",
    "date": "2024-03-28",
    "content": "Gonna drop another plug here for Songshift: https://www.songshift.com/\n\nTransfer playlists between services, pretty smooth",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1228047330138259467",
    "author": "Ross Fortune",
    "date": "2024-04-11",
    "content": "Is there any utility/app/service that’ll find “tracks *like* this”? \n\nNot Spotify style “if you like this, then try this” - more “here’s a bunch of songs with similar tempo, sounds…”?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1228080020698828860",
    "author": "SoundsLikeJoe",
    "date": "2024-04-11",
    "content": "Just read a section of David Byrnes book that talks about the difference in algorithm recommendations.  Pandora (apparently) had a more \"elemental cross-reference\" system called Pandora Genome, and it would use tags and metadata to pull tracks with similar elements vs Spotify \"Discover Weekly\" which (originally) only used click/trend/demographic metrics.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1229506662667128984",
    "author": "Adam Thein",
    "date": "2024-04-15",
    "content": "https://open.spotify.com/track/0IEZI57xAMEdWkCkxOVxST?si=0ee6ae5e26944362",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1229691031528673370",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-04-16",
    "content": "Several klicks in the pre chorus of Katy Perrys Firework. Might be intentional but I doubt it \n\nhttps://open.spotify.com/track/4lCv7b86sLynZbXhfScfm2?si=PNBRE4JLRC-QH0sFNF4H_g\nThere‘s one shortly after 0:40, one slightly before 0:43, one slighlty after 0:47, one between 0:48 and 0:49 \nMaybe they just wanted to make it sound like fire crackling but to me it just sounds like some clicks produced by bad editing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1229787091810910252",
    "author": "David Fuller",
    "date": "2024-04-16",
    "content": "Anyway, reason this came up:\n\nWelcome To Earth (Pollywog) by Sturgill Simpson, there's a flubbed edit at about 31 seconds - the second note of the piano \"flams\" for lack of a better term.\n\nhttps://tidal.com/browse/track/59119901?u",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1229856558335397918",
    "author": "Deleted User",
    "date": "2024-04-16",
    "content": "Never use swipe comps. That’s also my pet peeve. They are terrible. I use track alternatives instead, which is more like Protools Playlist\n\nIt’s easy to fix though, there is an option to convert the swipe comp into spliced audio clips instead",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230411981870202940",
    "author": "Nomograph Mastering",
    "date": "2024-04-17",
    "content": "Is there a discussion here about Spotify’s new vertical scrolling feed?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230503572307972186",
    "author": "David Fuller",
    "date": "2024-04-18",
    "content": "I barely ever open spotify so idk",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230509662458347572",
    "author": "Josh Bowman",
    "date": "2024-04-18",
    "content": "Just gave it a whirl. Interesting way to go through a playlist!!\n\nDoom-scrolling through playlists for the first time....  I'll likely discover some new music i never would have otherwise. I will also miss some beautiful songs because i'm judging them within 2 seconds and moving on.\n\nLoudness with normalization on in iOS app seems pretty even across the 25 songs i checked. Couple outliers but with the visual attached TBH i care and notice a lot less if there is a major volume discrepancy than audio only.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230513862520868894",
    "author": "Josh Bowman",
    "date": "2024-04-18",
    "content": "Its not obvious- little button below the playlist runtime (or saves), or below the artists monthly listener count",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230542889314943056",
    "author": "bookchild",
    "date": "2024-04-18",
    "content": "So, I could pay Spotify to serve ads \nTo people who pay Spotify to listen to them\nAnd those ads could promote songs\nThat the writer won’t get paid for, even if anyone does actually listen\nBut really they’re not songs, they’re short-format content\nThat will guide listeners through the artist’s Funnel\nTo buy tickets or merch or lessons or perfume\nBut then they, the listeners, will realise that someone cooler \nWho doesn’t even have short-format content\nI mean songs\nIs who they should give their money to\n\nAnd I’m still looking for the ’Subscribe Now’ button",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230552927848890470",
    "author": "Nomograph Mastering",
    "date": "2024-04-18",
    "content": "Like it or not this it seems to me that will outcompete old school playlist listening for discovery",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230640068939481210",
    "author": "hyanrarvey",
    "date": "2024-04-18",
    "content": "man doom scrolling music playlists feels so wrong but i really like it?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230645402185895946",
    "author": "hyanrarvey",
    "date": "2024-04-18",
    "content": "oh i was on the new music release playlist that came out today",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230650091229151415",
    "author": "Edsel Holden",
    "date": "2024-04-18",
    "content": "They \"youtubed shorted\" spotify. Youtube changed a lot (you tell me @Joel \"Roomie\" Berghult) after the shorts came into play from consumer perspective. Spotfy has now been \"Tik Tokkked\". \n\nthere will be some consequnces certianly but IDK what",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230650520780410920",
    "author": "Slow Hand",
    "date": "2024-04-18",
    "content": "If so, seems fine to me. If I don’t know what I’d like to listen to I already put Spotify on random and skip till I hit something I want to listen to.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230655735097065544",
    "author": "Josh Bowman",
    "date": "2024-04-18",
    "content": "I often search for a time period and/or genre specific playlist of whatever I’m in the mood for.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230655900927266876",
    "author": "Edsel Holden",
    "date": "2024-04-18",
    "content": "For me, really only number 1. I follow all my fav artists on socials and go looking for a song when they drop it. I'll check NMF every week or two. I use Tidal Daily Discovery to find things I wouldn't otherwise.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230661903362031666",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-18",
    "content": "Yeah it hasn’t been great for YouTube, but they made it up by YouTube now dominating TV screens too (more people watch yt than Netflix on TVs).\n\nMy feeling is Spotify is gonna be fine, because it’s passive listening consumers err towards longer. I’ll check out the specifics of this change later",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230662220510138368",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-04-18",
    "content": "I curate playlists and shuffle them, once I’m through the playlist it auto-plays good suggestions that I often add to that playlist to expand it",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230895002268471428",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-04-19",
    "content": "Thinking about making a Dessner only playlist of this record lol",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230913808805920880",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-04-19",
    "content": "Where does that start? Only have the spotify track listing",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230915652274094180",
    "author": "hyanrarvey",
    "date": "2024-04-19",
    "content": "https://www.musicradar.com/news/spotify-sped-up-songs-remixing?utm_medium=social&utm_campaign=socialflow&utm_source=facebook.com&utm_content=computer-music&fbclid=IwZXh0bgNhZW0CMTEAAR0_muT5qa1keGS1og3_bvW6g_ebHjxxZUhzws-NL4MzzxrrjICc5dY5ad4_aem_AdnLmrDo8DmngcJtBRvihi5ZtcvxutwT987lNUKB7rxKoRO_AKBOy0AM0RC58qzsOnzRjlJtkRSteKynb-jtm0iB",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230925696960827444",
    "author": "LAPhill",
    "date": "2024-04-19",
    "content": "Anyone here have experience with Spotify flagging a track for artificial streams? A soundtrack of mine, released through Distrokid, has one track that Spotify has deemed 93% artificial streams. Neither I nor the studio have engaged in anything that would've caused that, but Distrokid has pulled the track from Spotify.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1230929268146700330",
    "author": "sethearnest",
    "date": "2024-04-19",
    "content": "A company I mix for has been seeing an uptick of artificial streams flagging lately, as well. \n\nThe frustrating part is the relative black-box-unhelpfulness from Spotify and distros.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230932067903344711",
    "author": "sethearnest",
    "date": "2024-04-19",
    "content": "She already got back w/me: \"so far it’s just a black box of 🤷‍♀️ I think Spotify has advanced their “artificial streaming” detector (or whatever) and that’s why we’re getting notices so often. BUT there’s really nothing we can do. Revelator [distributor] said we can notify our artists “not to use artificial streaming” to cover our asses but that’s really all we can do. We haven’t had anything taken down yet 🤞 \"",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1230986607461535754",
    "author": "Will Melones",
    "date": "2024-04-19",
    "content": "If Spotify is thinking about expanding credits, this seems like a bizarre way to go about it",
    "reactions": 0,
    "attachments": 1,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1231275688464617492",
    "author": "Adam Thein",
    "date": "2024-04-20",
    "content": "I had my mind blown looking at the Spotify Charts today - all 16 tracks on the standard LP took the top 16 spots for the day yesterday and the album got ~232 million streams on the platform in the first 24 hours, absolutely unreal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1232103189675905066",
    "author": "andrew_yv",
    "date": "2024-04-22",
    "content": "I know we’re all desperate to get back into the Taylor of it all, so here’s my take as someone who has only heard a few songs off the album and is neither fan nor hater:\n\nIn an era where albums are getting shorter and shorter and listening habits are heavily single and playlist-focused, Taylor got a mainstream audience to engage with a 31-song, 2-hour project.\n\nWhen you’re as big as her, there start to be fewer things you can do that are actually interesting and I think this is one of the most interesting things she could have done with her power, even if I don’t find the songs I’ve heard so far very interesting of in their own right",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1232363842277736501",
    "author": "Charlie Deane \"Hypn0.iRL\"",
    "date": "2024-04-23",
    "content": "yeah the soundcloud was deleted",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1232834885698191420",
    "author": "Slow Hand",
    "date": "2024-04-24",
    "content": "Is anyone here a Pandora user? If so, what do you enjoy about it?\n\nI’m looking for alternate music discovery resources and my recollection is that their algorithms feel much different from Spotify, which is a big plus for me..",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1233457392973254748",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-04-26",
    "content": "also, Trout Mask is off spotify again?? wth",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1235431967483494410",
    "author": "Zack Hames",
    "date": "2024-05-01",
    "content": "https://spotify.link/sH6qyDEdgJb\n\nA lot of mine are stolen from @cian riordan and the UnFuck playlist.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1235432223382048798",
    "author": "Zack Hames",
    "date": "2024-05-01",
    "content": "The other thing I did a long time ago was just make a playlist of as many Eric Valentine records and Listen to it constantly to sort of calibrate my ears:\n\nhttps://spotify.link/HG0NoUHdgJb",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1238852857353080864",
    "author": "oaklandmatt",
    "date": "2024-05-11",
    "content": "https://www.billboard.com/business/streaming/spotify-songwriters-less-mechanical-royalties-audiobooks-bundle-1235673829/",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1238855221518536785",
    "author": "Edward Rivera",
    "date": "2024-05-11",
    "content": "Is there any foolproof way to transfer playlists over from Spotify to Apple Music ?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240647947591618600",
    "author": "Josh",
    "date": "2024-05-16",
    "content": "I feel like Apple Music is recommending music that’s more relevant to my taste than Spotify.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240655608189816915",
    "author": "Ross Fortune",
    "date": "2024-05-16",
    "content": "Another reason to bail on Spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240656322798551192",
    "author": "Josh",
    "date": "2024-05-16",
    "content": "Spotify is just trying to show you real music, dude. Embrace it.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240667473687347270",
    "author": "Will Melones",
    "date": "2024-05-16",
    "content": "I would switch to Tidal, but all jokes aside, their J-pop/rock and Anime themes catalog is lacking",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240684089212665896",
    "author": "Slow Hand",
    "date": "2024-05-16",
    "content": "Oh man, really? I was considering a Tidal subscription, but this is making me pause.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1240692151596220437",
    "author": "esquinalee",
    "date": "2024-05-16",
    "content": "As far as I can tell there’s no way to toggle between. I live mixed Madison McFerrin last month and wanted to listen to her recent  record on the car ride to the venue and was really disappointed at how good it didn’t sound until I realized the issue. Played the same record on Apple Music and it was night & day. Again, if someone can show me I’m wrong it’ll make me happy.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1240736871596818604",
    "author": "Ross Fortune",
    "date": "2024-05-16",
    "content": "Alright, you asked for it @Josh https://open.spotify.com/track/5G4sC9sxc4PC9mld96KHBy?si=bXIq0uptRWKnCAE0ba6iTA",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1243835345162735637",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-05-25",
    "content": "has anyone recently had a release through distrokid and can tell me where to get all my pre-save links? They only offer one for spotify and their support is incredibly unhelpful",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1254844127275782235",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-06-24",
    "content": "I was in Stockholm for it yeah, but it wasn't the Spotify one",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1257065050615713924",
    "author": "SoundsLikeJoe",
    "date": "2024-06-30",
    "content": "Samply question....   can't find the answer online (yet) \n\nI would like to send the client a link to a player and insure they can easily see all versions in a stack. Currently share links send client to the project playlist, but the link only displays Take 1 of each song.\n\nIf I go into the stack and share a link of that, the player only displays the v01 in stack.\n\nIs it possible for clients to receive a track link and see all versions in the stack?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1264012782177878037",
    "author": "tim adamson 🇦🇺",
    "date": "2024-07-19",
    "content": "@hyanrarvey Congrats on release day and a happy birthday to Rick!!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1269680612189405225",
    "author": "SoundsLikeJoe",
    "date": "2024-08-04",
    "content": "There are smarter people writing about this all over the internet and there are services to help artists clear samples...   it's really easier than ever, so I'd probably be more serious about the work and clear the samples before release. Not to mention it pays homage to the person YOU OWE for creating the source you're using to make your own statement. From the brotherhood of artist...  it's just good karma as well as good business. \n\nhttps://artists.spotify.com/en/blog/the-dos-and-donts-of-sample-clearances",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1271041031508590593",
    "author": "spectrummasters",
    "date": "2024-08-08",
    "content": "For music related : tbh it’s remarkable how much more info (and helpful self reflection on my own workflow/intention  changes etc ) can be picked up by leaving the LWMR Spotify episodes to tick through . The Phil Asher one is dope especially re being a producer",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1272308252927066213",
    "author": "chrissorem",
    "date": "2024-08-11",
    "content": "That doesn’t count. It has to be on tidal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1273272221602939005",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-08-14",
    "content": "Does anyone have a list/playlist of all the interpolation songs David Guetta has done in the last few years? \n\nSo far I'm counting *I'm Blue, When We Were Young, Baby Don't Hurt Me, Satisfaction and I Don't Wanna Wait* as songs where he used interpolations of other songs. \n\nAnything come to mind I might have missed?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1280902266429378652",
    "author": "Nomograph Mastering",
    "date": "2024-09-04",
    "content": "The only thing anyone ever notes about Glenn is that he works on headphones\n\nHis work may be great but in the thousands of times I’ve gone “wow that sounds great” and checked the tidal credits it’s never once led to his name. Randy, Chris, Ted, Athens etc many times over\n\n(But again as I always say he could I’m sure legitimately say the same thing about me. So I’m not trying to project status, just observing that he’s often held up as an example of why we *can* work on headphones but no one seems to know his actual work)",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1286421688497602622",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-09-19",
    "content": "I always think of this one lol https://open.spotify.com/track/3Ngl8Fn5UtCl2K7UD7EF9e?si=31ec033ae78948cc",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1286423571555422338",
    "author": "Will Pragnell",
    "date": "2024-09-19",
    "content": "If we're doing iconic opening drums: https://open.spotify.com/track/67Hna13dNDkZvBpTXRIaOJ",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1286424244733083800",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-09-19",
    "content": "lol is it *LWMR playlist* time again?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1286446219362570292",
    "author": "Ross Fortune",
    "date": "2024-09-19",
    "content": "For the playlist: FYC https://open.spotify.com/track/4d6eqRtpDX7tydHJGDZUBQ?si=g88fyZBgRFCkqQMps4fbwA\n\nAnd INXS https://open.spotify.com/track/3h04eZTnmFLRMjZajbrp2R?si=Ai5e8kwTRIuT5Qxu0BsI_Q",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1291028806647156766",
    "author": "Josh",
    "date": "2024-10-02",
    "content": "Likewise chief. Sorry again about not having Spotify. If you could just run all of them through GP and shoot them over to my email I’ll take a listen today.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1293071775080382496",
    "author": "thegreatcarsoni",
    "date": "2024-10-07",
    "content": "You can also change the Audio MIDI Setup (on mac) output for the Apollo to a virtual channel pair that will pass system audio out without needing to change the UA routing. Then I like to set the output of my DAW to another virtual pair so I'm not always changing levels between spotify/youtube/whatever and Pro Tools.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1311666438326452295",
    "author": "Iwan Morgan",
    "date": "2024-11-28",
    "content": "Ah ok @Ross Fortune I still use apple music playlists for this and pay the annual fee to sync my playlists to the cloud so I can listen on my devices.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1311691227938291722",
    "author": "Ross Fortune",
    "date": "2024-11-28",
    "content": "Ah cool. So you can have non-apple music files in there (unreleased records, obscure stuff that’s not on the store), and have them be available offline on your phone?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1311704814253641800",
    "author": "Iwan Morgan",
    "date": "2024-11-28",
    "content": "Also neater than wading through the Apple Music bloat",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1313913250609369178",
    "author": "gatewoodsensei",
    "date": "2024-12-04",
    "content": "*cries in Apple Music*",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1319682907584991314",
    "author": "Joel \"Roomie\" Berghult",
    "date": "2024-12-20",
    "content": "anyone else having a bug where lossless playback in Apple Music always glitches a few seconds into the start of a song after clicking play? Drives me nuts when I'm trying to record reference tracks",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1319974854312722513",
    "author": "T1NGA",
    "date": "2024-12-21",
    "content": "Hey what’s poppin? Just wanted to ask you guys your opinion on go-to sample rate and bit depth when the song is destined to be streamed on spotify?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1320944356831662141",
    "author": "Berlin",
    "date": "2024-12-23",
    "content": "https://tidal.com/browse/album/37925353?u",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1327720658922242201",
    "author": "Zach Hughes",
    "date": "2025-01-11",
    "content": "A few extra caveats to add to the credits convo from yesterday. I just checked with my distributor and they do not allow for the delineation between 'producer' and 'co-producer' or 'additional production'. 'Producer' is the only option and multiple producers can be listed. I also checked Spotify and it is the same there too. 'Producer' is shown but no field for 'additional production'.\n\nI agree with what others were alluding to in that it's worth considering how asking for revised credits impacts the relationship and that caution and being respectful towards and honoring the artist's story is valuable.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1328567659238789231",
    "author": "Zakhiggins",
    "date": "2025-01-13",
    "content": "I was recently inspired after going to the cinema to see *A Complete Unkown*, the movie memoir about Bob Dylan; partially by Bob's story, but also by Timothy Chalomee's performance as Bob. All of the shots of him performing in the movie were fully live - which is an impressive feat by itself - but even more impressive that he apparently wasn't much of a musician before making the movie. I didnt know much about Timothy before this, so I watched his interview with Zane Lowe on Apple Music's YouTube channel. One thing I found really interesting was how available he made himself to learning the role. For example, he didn't turn his phone on for 3 months straight. Got me thinking about how much I can get distracted during the day, and how these distractions can get in the way of me actually giving 100% to the art that I'm working on. I'm sure you all can imagine how the distractions in your own life can effect your work. Might be TikTok videos, might be discord, might be lusting over getting new converters or monitors or guitars, etc, you get the idea. So I guess what I'm saying here is that if I want to compete with the best, maybe I have to understand how to impliment systems in my life that allows me to be more available to the things that I am working on. I want it to be like lifiting a heavy weight at the gym - at the bottom of a heavy squat, you've no choice but to focus on pushing the bar back up with good form, cos that think will break you otherwise. There's a certain thing that happens in your brain when you're forced to only think about one thing for a prolonged, or even short period. It's something akin to meditating. \n\nI guess what I'm asking is if anyone has ever given this subject any thought before, and if anyone has ever done anything to get better at these things? I'm still not sure if all this only makes sense inside my own head.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1337155055870017696",
    "author": "Berlin",
    "date": "2025-02-06",
    "content": "Apple music is not for creators, tbh.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1337168820883951667",
    "author": "Slow Hand",
    "date": "2025-02-06",
    "content": "Apple Music is barely for listeners. Last time I checked I couldn’t even use it like iTunes to organize my extensive digital music collection. I forget exactly why that was.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1338276737103958127",
    "author": "Nomograph Mastering",
    "date": "2025-02-09",
    "content": "Where are people streaming the halftime show? I thought it was gonna be on Apple Music but seems not",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1360566229747630131",
    "author": "Iwan Morgan",
    "date": "2025-04-12",
    "content": "Has anyone found a way to view credits in Apple Music on Mac OS? It’s so easy on the iOS app by just clicking the three dots but it doesn’t seem possible on Mac OS even though some people online say it is available.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1360634057729507479",
    "author": "Iwan Morgan",
    "date": "2025-04-12",
    "content": "It sucks when you are so used to iOS Apple Music and then go back to the big brother version on Mac OS and its worse in pretty much every respect.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1360716038299455599",
    "author": "kidcutler",
    "date": "2025-04-12",
    "content": "I thought it was a browser issue, might have to drop Tidal",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1360721856411205652",
    "author": "Rollmottle",
    "date": "2025-04-12",
    "content": "~~Yes, it's there but not in the desktop app.~~ oh, tidal, not Apple Music",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1360721857073910024",
    "author": "sethearnest",
    "date": "2025-04-12",
    "content": "Yeah I just noticed that. Works how it always has on my phone. But I haven’t updated my Tidal app in a while. And I definitely won’t now.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1360982716073644322",
    "author": "Will Melones",
    "date": "2025-04-13",
    "content": "What competition do they have? It’s probably significant upkeep that they don’t see improving their bottom line as they struggle to compete with Spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1366155116746510386",
    "author": "Will Melones",
    "date": "2025-04-27",
    "content": "There used to be a terminal command or a playlist file to edit that would make these notifications go away. I'm sure you'll find it with a quick Google",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1380583824110653551",
    "author": "David Fuller",
    "date": "2025-06-06",
    "content": "https://tidal.com/browse/track/440090689?u",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1381007548877901896",
    "author": "oaklandmatt",
    "date": "2025-06-07",
    "content": "I've been meaning to talk to my old school music attorney about all of this. It will be interesting to see who fights in what direction for any number of things related to AI and music. Will publishers band together and fight tech companies? Will major record labels and their streaming service partners capitalize on quick music generation to flood their playlists and cut out human artists? Will there be a cultural rebellion against companies who try and market AI artists? There are so many ways this can go in so many different configurations",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1383904966338674920",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-06-15",
    "content": "His interviews are pretty much always top notch\n\nHis spotify top 10 videos can get a bit annoying but are generally not as bad as their clickbaity thumbnails might suggest",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1389396110727975024",
    "author": "conor // wbotm",
    "date": "2025-06-30",
    "content": "i'm gonna hang on to tidal for a while longer... have been recommended Qobuz by friends, obviously the quality is great, apparently the feature set is well rounded out by now, and the catalogue is to the point you're finding what you're looking for almost everytime.\n\nas much as i'd love to have a catch all solution, i'm in deep enough (obviously) to not mind being an intentional consumer when it comes to streaming music. having done 3 years on tidal i don't think i'd wanna go back to spotify encoding anyway!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1389430932913782928",
    "author": "earwormfarmer",
    "date": "2025-06-30",
    "content": "I believe the transfer service I used was Soundiiz. Cost maybe $3 to move over all my playlists and everything!",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1389463063475781735",
    "author": "jonmatteson",
    "date": "2025-06-30",
    "content": "SongShift is a great app for converting playlists",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1392650857748758549",
    "author": "Slow Hand",
    "date": "2025-07-09",
    "content": "Glad to see live coding for music picking up speed. Just this week Renoise dropped a major update that puts live coding capabilities with LUA/Tidal Cycles right in the DAW.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1392890339114881034",
    "author": "Zach Hughes",
    "date": "2025-07-10",
    "content": "I'm pretty ignorant on most of this stuff. Same buddy was telling me how text based coding for music will be much better suited for LLMs. Some interesting implications there. I haven't heard of Renoise or LUA / Tidal Cycles",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1397988429907759156",
    "author": "Edward Rivera",
    "date": "2025-07-24",
    "content": "Let’s pour one out for Chuck Mangione \n\nhttps://open.spotify.com/track/6C2nRgaujO84uuHZkaXcZQ?si=-tGIbe16TUeUQAqsJuMzjw&context=spotify%3Aartist%3A2MMaIlHd8UvDW0mVRAncD6",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1400138592667435078",
    "author": "Dalliance",
    "date": "2025-07-30",
    "content": "Also it’s pretty hard to find those people since there is no tool (that I know of) to filter through the inputs (musician, stream count, language, etc…). It’s easy to find mainstream artists of course but those are way above my shooting range",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1400141493179646033",
    "author": "Dalliance",
    "date": "2025-07-30",
    "content": "Oh thank you. I could have collabs in my region but I didn’t want to base my initial success on riding somebody else’s fanbase. And my plan was never to keep within my region. \n\nNo,  nothing English is out, only a few Spanish songs. But I wrote in a few songwriting camps, so language isn’t the barrier. It’s tough to breakthrough in here (anywhere tbh) in English without the help of a label (which I do not want), so imo joining forces and fan bases on an EP could work nicely since playlisting can help. A friend of mine, not a very good EDM producer manages to get to great numbers with submithub and hypeeddit, which only make sense in widely spread languages and Czech isn’t one of them",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1400182379708022814",
    "author": "Dalliance",
    "date": "2025-07-30",
    "content": "Great perspective, love all of it. I'm coming from the idea that work isn't appreciated until it is actually heard, and playlisting is still a viable option to make that happen and English is a crucial element of that (public curator type of playlisting). Combined with another artist gives out higher chances.  \nI'll definitely start swiping through socials and write down people I resonate with.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1401930871854076007",
    "author": "Bryan DiMaio",
    "date": "2025-08-04",
    "content": "https://help.roonlabs.com/portal/en/kb/articles/starting-with-roon-server\nhttps://help.roonlabs.com/portal/en/kb/articles/tidal\nhttps://roon.app/en/how-roon-works\n\nSeems like Roon is your answer?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1401931144848478350",
    "author": "Bryan DiMaio",
    "date": "2025-08-04",
    "content": "I don't think it works with Apple Music though, which is my preferred service",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1402442697935163422",
    "author": "Gabriel Tyranny",
    "date": "2025-08-05",
    "content": "Made a playlist with those along with Julian Lage and gonna give it a listen when I got time to sit with it.\n\nThank you for the suggestions. 🙂",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1404773878395437119",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2025-08-12",
    "content": "https://open.spotify.com/playlist/65uAjFTt4N8sEJeonhNOBL?si=GaGq34JtQPm5sxIRtgf9hA&pi=9aioJSx3Twu5W",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1407412970861891726",
    "author": "hyanrarvey",
    "date": "2025-08-19",
    "content": "https://open.spotify.com/track/1n6dtMbymNxxboigETUwnP?si=wm-Rhs-8RsWj6V3Aga0acw&context=spotify%3Aalbum%3A0dHQH04nSGugSUSQOHOUpF this shit is hillariously aggressive in a whole different aesthetic",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407413289503428649",
    "author": "hyanrarvey",
    "date": "2025-08-19",
    "content": "https://open.spotify.com/track/50Rr3aPZNinnaTIbR7e3AG?si=e8LH_aF8SpeQD_2Yw4BuAA but this one and that st Vincent all born screaming album has some of the best drums I’ve ever heard",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1407437548313120950",
    "author": "oaklandmatt",
    "date": "2025-08-19",
    "content": "https://open.spotify.com/track/1Qdnvn4XlmZANCVy3XjrQo?si=tDoEMk-0RJaTDGsEzfCnxw\n\nthis is a bullseye for acoustic drum excitement",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1408571137021186069",
    "author": "Gabriel Tyranny",
    "date": "2025-08-22",
    "content": "Ngl tomorrow’s gonna be one of the best Saturday I’ve had since WB Cartoons for my inner child - So excited to check out all the Jazz and @cian riordan ‘s recommended album.\n\nhttps://open.spotify.com/album/66jaBISCH3VnqQkHrtgo54?si=aoouSjMTQ1KdoSQ-p2SHag",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1408650840981504103",
    "author": "hyanrarvey",
    "date": "2025-08-22",
    "content": "https://open.spotify.com/track/5LsEf9TRDz5iPiobZ0Rnhq?si=TKhsgkjWQ_G0fqFEQ1zT_A&context=spotify%3Aalbum%3A2nU5t7MkLCpkq07YkJv6vf this song was one my favorites I’ve heard him do",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1410314188483596378",
    "author": "Dalliance",
    "date": "2025-08-27",
    "content": "There was an app for that. Paid, but it consolidated all of the music platfroms playlists you had and uploaded it onto AM. I moved to AM myself because it pays artists better and well... it isn't spotify, but boy can they do something with the UI, the playlist saves and general algo-based music recommendation?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1415359839668015165",
    "author": "bobby k",
    "date": "2025-09-10",
    "content": "I imagine the playlist feature is good if I tracked a bunch of takes of a band and was sending it to a producer but wanted to preserve the working mix, however...that's a very specific case...",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1430743189995917373",
    "author": "chris_donlin",
    "date": "2025-10-22",
    "content": "https://open.spotify.com/episode/6sRi80R1nMnjJFCW7ZbDV5?si=85406585a3854b4a",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1431467581008642058",
    "author": "AJ",
    "date": "2025-10-24",
    "content": "Does anyone have experience with YouTube Music? I'm finally looking into potential Spotify alternatives, and the benefit of not having ads for videos is making me look into it. Apple Music was so glitchy for me that it was unusable, but I'm open to hearing about other alternatives too.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1436121086780510340",
    "author": "diamndsdancin",
    "date": "2025-11-06",
    "content": "https://x.com/godslove2104/status/1986152342723465610\n\nI wonder what this multi million deal for this AI artist + going on the Billboard charts means for the industry?\n\nSurely there is a loop hole they could create just creating AI artists/music, put them in playlists on spotify, billboard charts, rotate etc and just profit without everything that normally comes with it\n\nThe AI artist already shat out a couple albums in the past few months like it's nothing. Couple prompts and some clicks. Artwork also just AI slop",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1440876709078372462",
    "author": "Will Trotman",
    "date": "2025-11-19",
    "content": "Yo when did Spotify update their credits??",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1440896920770973767",
    "author": "Slow Hand",
    "date": "2025-11-19",
    "content": "Looks like my Spotify is up to date, too. So maybe they're staggering the rollout.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1441536233791557694",
    "author": "Rob Domos",
    "date": "2025-11-21",
    "content": "Last night I was looking at some credits on Tidal and saw the entire marketing team in the credits",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1451287762669146255",
    "author": "Brian Reynolds",
    "date": "2025-12-18",
    "content": "I switched to Tidal a few months back. I listen to less music because the app introuduces a ton of friction in navigating it. So many artist have incomplete and inaccurate landing pages. Whole albums missing or entire another artists tracks also linked. But I don't like supporting podcasts I don't listen to or corporate overlords either.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1451326228907819199",
    "author": "andrew_yv",
    "date": "2025-12-18",
    "content": "I just started the Qobuz trial. Liking it so far, haven’t dug that deep. They also *just* introduced a similar feature to Spotify Connect, which was the only thing other than searchable user playlists I ever liked about Spotify compared to others",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1460825230850396326",
    "author": "cian riordan",
    "date": "2026-01-13",
    "content": "Apple Music users, does it still default to Spatial with compatible devices? I just heard rumor they reverted it back to stereo but can’t check",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1461078511472345331",
    "author": "Tristan",
    "date": "2026-01-14",
    "content": "Anecdotally speaking I’m still busy monthly with requests for atmos. Had two very recent meetings with A&R’s at imprints juggling whether or not to get one or two of their developing artist projects an atmos mix to help promote on Apple. So, no not DOA. Apple Music currently accounts for 30% of streaming in the US, it was about 10-15% about 5 years back. ASAF is also very much full steam ahead in development so who knows. tl;dr not DOA, perhaps plateaued.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1462567289739022427",
    "author": "Jasper Boogaard",
    "date": "2026-01-18",
    "content": "This is what Tidal tried when it launched and it didn’t seem to stick",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1462568064104140982",
    "author": "bobby k",
    "date": "2026-01-18",
    "content": "Tidal tried changing the model which is too impossible for one service to tackle, but this would just be adding to the model",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1462575463422496829",
    "author": "SawyerM",
    "date": "2026-01-18",
    "content": "This has always been my problem with DSP, at this point I just use blogs and #🎵fav-music-talk to discover music. I will always prefer curated lists than an auto generated playlist that didn't even hear the songs it recommended",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1462593367845109833",
    "author": "Will Trotman",
    "date": "2026-01-18",
    "content": "But @Slow Hand you did just say you have a pretty positive experience with the Spotify algorithmic playlists, so maybe no one feels that way. I’ve never been a huge fan of what I get on there but that’s just me.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1462603511178203379",
    "author": "Will Trotman",
    "date": "2026-01-18",
    "content": "Interesting, that’s good to hear it’s gotten better, I was assuming it had gone the other way. \n\nI just wonder what kind of disruption could be large enough to cause a shift away from Spotify, since they’re pretty firmly on top. It seems like streaming is about as easy as it’s going to get, and I don’t really hear any Spotify users with qualms about their experience.\n\nI do wonder if artists will become less partial to Spotify over time though. It seems like there are so many different metrics of success now (Spotify streams, instagram followers, tik tok followers are the main ones I think of) that aren’t always mutually inclusive of each other. And I wonder if that takes a little weight off of streaming numbers being the only metric that legitimizes an artist. And I hear people like Ryan Tedder talk about the importance of “world building” for artists now - I wonder if fans of artists will care more about being part of that artist’s ecosystem than the artist’s music being a part of their music library. I think of how K Pop bands sell crazy numbers of physical copies as an example. They can still stream the music but it seems like there are more variables now.\n\nThinking out loud a little bit, I might have just said absolutely nothing with a lot of words lol.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1462606503834816542",
    "author": "bobby k",
    "date": "2026-01-18",
    "content": "I think we're getting closer here with the DJ stream thought. NTS.live is a great site that sits somewhere close to what I was getting at; if they were to drop an actual app that felt more like spotify than XM radio, but with their same curation model,  it would crush.",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  },
  {
    "id": "1462857998270730405",
    "author": "SawyerM",
    "date": "2026-01-19",
    "content": "If google images can do it why can't Spotify",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": false
  },
  {
    "id": "1464359896622567570",
    "author": "masteredbyjack",
    "date": "2026-01-23",
    "content": "Assuming it's much more than the normal blurring of mp3/OGG codec on playback from Spotify or something?",
    "reactions": 0,
    "attachments": 0,
    "is_pinned": false,
    "is_expert": true
  }
]