[
  {
    "id": "1253142942143742105",
    "author": "Josh",
    "date": "2024-06-19",
    "content": "50 laugh reacts and I’ll do an acapella cover of Brat by Charli like that dude that did damn",
    "reactions": 186,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1262110493544284281",
    "author": "oaklandmatt",
    "date": "2024-07-14",
    "content": "@everyone I just wanted to express gratitude to you all. This is the only place many of us have – on the internet or otherwise – that is a healthy, supportive, *non-political* community. We're nearly 2000 people and I fucking love browsing the depth and breadth of conversation on here. There's real love for music and creativity and camaraderie, and it brings me immense joy.\n\nSo to the newbies and experts, the casual lurkers and Grammy-winning essayists, from the bottom of my heart, thank you all. ❤️",
    "reactions": 171,
    "categories": [
      "career_advice",
      "community_events",
      "industry_insights"
    ],
    "is_expert": true
  },
  {
    "id": "1293336024784834610",
    "author": "bobby k",
    "date": "2024-10-08",
    "content": "ANOTHER DAD JUST JOINED THE DISCORD!!!!! Major congratulations @NoahNeedleman ❤️❤️❤️❤️❤️",
    "reactions": 147,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1469752505729679433",
    "author": "oaklandmatt",
    "date": "2026-02-07",
    "content": "@everyone from my journal five years ago yesterday:\n\n\"I’ve been working with Hendrick and Iggy getting the discord server up, and just sent out a bunch of invites. It’s cool to see the beginnings of a community happen. I’m getting all these creative ideas just thinking about what’s possible. It’s also a testament to just DOING things. Even if there isn’t a solid goal in mind. When you do things, you learn things.\"\n\nBig love to @hendrick and @1ggy who were the first ones involved to help make this place happen. I'm so proud of all of you for helping keep this community thriving. You all put kindness and curiosity and patience first, and THAT is what makes this place special. An island in the sea of fuckery that is the internet. I appreciate you all, my friends!",
    "reactions": 143,
    "categories": [
      "career_advice",
      "community_events"
    ],
    "is_expert": true
  },
  {
    "id": "1292083683242676285",
    "author": "oaklandmatt",
    "date": "2024-10-05",
    "content": "@everyone this makes me very happy. We've all worked hard to keep this place a positive community, where we're trying to uplift each other. It shows! ❤️❤️❤️",
    "reactions": 131,
    "categories": [
      "community_events"
    ],
    "is_expert": true
  },
  {
    "id": "1321239547681439744",
    "author": "BatMeckley",
    "date": "2024-12-24",
    "content": "Wishing everyone a happy happy holidays, no matter whether you have a Grammy, whether you give great advice or objectively bad takes, whether you’re tall, short, or in between, whether you’re Irish, or from somewhere better, no matter which holiday you celebrate, whether you post here or just lurk to soak up the great information, whether you’re Matt Rad who put this all together or Cian who tries to burn it all down, I love you all and wish health, happiness, and prosperity for you and your families. 💙🎄",
    "reactions": 117,
    "categories": [
      "recording_general",
      "industry_insights",
      "off_topic_fun",
      "creative_philosophy",
      "matt_rad_references"
    ],
    "is_expert": true
  },
  {
    "id": "1335773683049828402",
    "author": "cian riordan",
    "date": "2025-02-02",
    "content": "Cheers team! This one’s for the ‘cord!",
    "reactions": 102,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1366818935391129710",
    "author": "Nomograph Mastering",
    "date": "2025-04-29",
    "content": "Hey @everyone \n\nPlease post your questions publicly on the Discord rather than DMing people privately\n\n I get the same questions over and over on DM here, on IG, even on Gearslutz. Which speakers? How should I treat my room? What limiter etc? If I were to answer each one individually it would \n\nA) Be a huge time suck\nB) Deny everyone else that response if it was useful (including future members searching the archive)\nC) Deny other contributors of the ability to build on that info, co-sign or even disagree so we can make our ideas better \n\nThe working pros here give their time so they can have the maximum impact for younger players, asking for custom one off responses to your specific issue on a private channel undermines that\n\nThanks!",
    "reactions": 100,
    "categories": [
      "mastering_general"
    ],
    "is_expert": true
  },
  {
    "id": "1273803475314020363",
    "author": "oaklandmatt",
    "date": "2024-08-15",
    "content": "@everyone we hit 2000 people on the discord! I appreciate all of you so much for helping to create such a beautiful and rich community. \n\nI would love it if people want to share a small thought or anecdote about what they've gotten from this space. I know I've learned a huge amount from reading other people discuss and debate things about audio. But I've also learned a ton about nurturing and creating parameters for an online community that continues to be useful and supportive, despite growing to more than two thousand people 😧. \n\nThis place is so special! Thank you all!",
    "reactions": 93,
    "categories": [
      "community_events"
    ],
    "is_expert": true
  },
  {
    "id": "924423245774610472",
    "author": "oaklandmatt",
    "date": "2021-12-25",
    "content": "@everyone Merry Christmas/ Happy Holidays everyone! I appreciate all of you so much. This community has become such a force of positivity in this world. Thank you all! ❤️",
    "reactions": 92,
    "categories": [
      "community_events",
      "off_topic_fun"
    ],
    "is_expert": true
  },
  {
    "id": "1160341881494982767",
    "author": "bobby k",
    "date": "2023-10-07",
    "content": "throw some fucking emojis down if you love saturdays",
    "reactions": 92,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1071152823535943792",
    "author": "Slow Hand",
    "date": "2023-02-03",
    "content": "I'd like to say thank you to @everyone here. It's no overstatement to say that you *are* this server and the reason for it's success.\n\nWe've got a very special community that's been built up over our short history and this place would fall apart if each and every one of us wasn't maintaining the level of excellence, understanding, kindness, and great discourse that this place is known for. We've got something special here.\n\nI love to see how welcoming you all are whenever we get someone new and how helpful we are at answering the questions of people at every stage of their journey. Hats off to the collective \"we\" and to the individuals who make this place great.\n\nAnd finally, thank you to @oaklandmatt for creating such a place. Thank you for everything that you've made here and for giving us a place to thrive and come to know one another.",
    "reactions": 91,
    "categories": [
      "gear_hardware",
      "learning_education",
      "community_events",
      "matt_rad_references"
    ],
    "is_expert": true
  },
  {
    "id": "1059028437492306021",
    "author": "cian riordan",
    "date": "2023-01-01",
    "content": "@everyone HNY, nerds. This is a cool space with some great people & I’m thankful for you all. Set some goals and follow through… we all have your back. Happy 2023!",
    "reactions": 90,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1326624403047452741",
    "author": "Nomograph Mastering",
    "date": "2025-01-08",
    "content": "The first house the camera pans to in this video is ours (was)",
    "reactions": 81,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1361357421590614331",
    "author": "NoahNeedleman",
    "date": "2025-04-14",
    "content": "About to send an EP off to @Rollmottle to master. \n\n@Josh assisted on production setup. \n\n@Bryan DiMaio did 4 out 5 vocal sessions with the artist out in Boston. \n\n@BatMeckley connected me with America’s drummer to play on it. \n\nUsed Plugins I wouldn’t have had, of even known about, from @hyanrarvey @Skyler Young \n\nGot super helpful notes along the way from @chrissorem  @Matt Huber @cian riordan @Ross Fortune & @Jack . \n\nThis place just keeps on giving.",
    "reactions": 74,
    "categories": [
      "production_general",
      "daw_software",
      "plugin_discussion"
    ],
    "is_expert": true
  },
  {
    "id": "1144424741319495750",
    "author": "bobby k",
    "date": "2023-08-24",
    "content": "A major congratulations from this community is in order to our friend @masteredbyjack who just became a father yesterday. you’re gonna make a amazing dad!!!",
    "reactions": 70,
    "categories": [
      "mastering_general",
      "community_events"
    ],
    "is_expert": true
  },
  {
    "id": "1321581637200248853",
    "author": "Nomograph Mastering",
    "date": "2024-12-25",
    "content": "Hey all, the holidays can be tough for some people. Anyone struggling today hit me in the DMs",
    "reactions": 68,
    "categories": [
      "off_topic_fun"
    ],
    "is_expert": true
  },
  {
    "id": "1326623846819958864",
    "author": "Nomograph Mastering",
    "date": "2025-01-08",
    "content": "I know all the friends will be sending me good vibes, we are in a hotel and safe and have everything we need. We’re gonna be fine",
    "reactions": 62,
    "categories": [
      "creative_philosophy"
    ],
    "is_expert": true
  },
  {
    "id": "1175148397322326016",
    "author": "austenballard",
    "date": "2023-11-17",
    "content": "as we say around these parts, \n\nHello my friends! \n\nI'm so stoked to share with you the VERY FIRST edition of ***Live With Matt Rad Community Profiles***, a new article series in which I will be writing pieces on members of our community. And who better to begin with than our esteemed Discord Admin, Mr. Bradley Will?\n\nhttps://lwmrblog.carrd.co/\n\nI hope you enjoy this and future pieces to come. Thanks very much to @Slow Hand and @oaklandmatt for letting me take this project on and share it with you all.",
    "reactions": 61,
    "categories": [
      "recording_general",
      "community_events",
      "matt_rad_references"
    ],
    "is_expert": true
  },
  {
    "id": "1370180173789396992",
    "author": "cian riordan",
    "date": "2025-05-08",
    "content": "Solid FedEx haul today.",
    "reactions": 60,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1338964505778061456",
    "author": "cian riordan",
    "date": "2025-02-11",
    "content": "This conversation is likely seriously bending the political rules here on the discord, I think we should probably start winding it down.",
    "reactions": 59,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1223053869605720164",
    "author": "JakeTB",
    "date": "2024-03-28",
    "content": "Hey all. Just wanted to say how much I appreciate this community and attest to the quality of conversation here.\n\nI put in my resignation notice at the day job today, and will be transitioning to music full-time in May. I genuinely don’t believe I could have done it without this place. You all challenge me in the best ways, and have helped me grow tremendously as a person and a professional.\n\nI still don’t have it all sorted out, and I’m still fervently pursuing mentorship in any form I can find, but for now the work is paying the bills; something I thought I’d never be able to say.\n\nThank you all for being generous with your hard-earned wisdom. It really does make a difference.\n\n(Sorry, got a bit sappy there 😅)",
    "reactions": 58,
    "categories": [
      "gear_hardware",
      "career_advice",
      "community_events",
      "networking_relationships"
    ],
    "is_expert": false
  },
  {
    "id": "1327434794878894103",
    "author": "Nomograph Mastering",
    "date": "2025-01-10",
    "content": "People of Discord - just a thank you for the endless love and support",
    "reactions": 58,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1335749682290229288",
    "author": "oaklandmatt",
    "date": "2025-02-02",
    "content": "IMHO one of the great signs of success in our line of work is when your records win awards, the artist goes on stage and thanks you profusely.\n\nSeeing Annie thank @cian riordan over and over (and over) today is so cool and beautiful. Hell yes Cian!",
    "reactions": 57,
    "categories": [
      "industry_insights"
    ],
    "is_expert": true
  },
  {
    "id": "1036673604915572816",
    "author": "BatMeckley",
    "date": "2022-10-31",
    "content": "Just a general Happy Halloween to @everyone even Cian.  Hope your day is filled with magic and your night with candy that you don’t want to return.",
    "reactions": 56,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1084869622639099955",
    "author": "mixedbywong_my",
    "date": "2023-03-13",
    "content": "havent been on the discord since last tuesday , my first child ,my son came out on wednesday 8th of March. He's 6th days old now.\nWow , never had this feeling of wanting to protect and care for someone as much as i do for him. (ok my wife as much too.)\nProbably gonna be the biggest mix/master i'll ever going to be in charged of . Any helpful tips to raise a kid while being an audio professional , i'd highly appreciate it . Other than being completely exhausted, i feel complete and very excited about the future . \n:chefkiss:",
    "reactions": 56,
    "categories": [
      "gear_hardware",
      "career_advice"
    ],
    "is_expert": false
  },
  {
    "id": "1339058899675906172",
    "author": "Nomograph Mastering",
    "date": "2025-02-11",
    "content": "Shoutout to G-Man @Gerhard Westphalen for his first Juno Nomination!",
    "reactions": 56,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1393522549220048957",
    "author": "oaklandmatt",
    "date": "2025-07-12",
    "content": "@everyone a reminder that two very strict rules we have here are \"no self-promotion\" and \"no politics.\" It keeps this place focused on helping each other make better records. The mods make exceptions for things that are part of an existing, productive conversation. \n\nIf you want to discuss politics, promote your music, or explain to strangers how technology oppresses people, please go do that at a place called EVERYWHERE ELSE ON THE INTERNET.\n\nLove to you all. ❤️",
    "reactions": 56,
    "categories": [
      "career_advice",
      "artist_development"
    ],
    "is_expert": true
  },
  {
    "id": "1122646320260317194",
    "author": "Nomograph Mastering",
    "date": "2023-06-25",
    "content": "Hey everyone - I’m about to take a little Discord break. If you see someone tag me let them know I’ll  be back in a few weeks, maybe a month",
    "reactions": 53,
    "categories": [
      "recording_general"
    ],
    "is_expert": true
  },
  {
    "id": "1379546723344584726",
    "author": "Nomograph Mastering",
    "date": "2025-06-03",
    "content": "https://www.youtube.com/watch?v=04Xw1qm-QMY",
    "reactions": 53,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1386010254419955743",
    "author": "chrissorem",
    "date": "2025-06-21",
    "content": "Lube up those faders and wipe the sweat off those fingers, the judges are coming in hot",
    "reactions": 53,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1172744309477482516",
    "author": "cian riordan",
    "date": "2023-11-10",
    "content": "Workshopping some good venn diagrams:",
    "reactions": 52,
    "categories": [
      "learning_education"
    ],
    "is_expert": true
  },
  {
    "id": "1239670126786252960",
    "author": "oaklandmatt",
    "date": "2024-05-13",
    "content": "@everyone going live with @cian riordan tomorrow at noon LA time!\n\nHoller with questions.",
    "reactions": 50,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1335755413655650335",
    "author": "Nomograph Mastering",
    "date": "2025-02-02",
    "content": "@Oli J for Best Engineered on Peter Gabriel",
    "reactions": 50,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1450661483519279224",
    "author": "NoahNeedleman",
    "date": "2025-12-16",
    "content": "I’ve been trying to keep a lid on this, but I couldn’t. \n\nHappy Birthday, @Nomograph Mastering. You’ve made the lives of 2000 lurkers here at least marginally better, and you actually changed the lives of a good deal of us. Thank you for your generosity, your curiosity, your consistency, and most importantly, your sense of wonder. \n\nHappy fucken birthday old man.",
    "reactions": 50,
    "categories": [
      "mastering_general"
    ],
    "is_expert": true
  },
  {
    "id": "1035685914405511191",
    "author": "cian riordan",
    "date": "2022-10-28",
    "content": "FYI @everyone -- tomorrow is @oaklandmatt's bday -- but he's in Australia, so it *might* be today? Well either way, HBD you old goat! Here's an oldie of you taking me over a surdo drum:",
    "reactions": 48,
    "categories": [
      "matt_rad_references"
    ],
    "is_expert": true
  },
  {
    "id": "1273815646265806858",
    "author": "oaklandmatt",
    "date": "2024-08-15",
    "content": "@everyone I also want to give a big special thank you and shoutout to the moderators: \n\n@slow.hand , who in addition to the incredible show notes for every conversation, puts more thought and time into the workings of this discord and the live streams than anyone.\n\n@hendrick & @1ggy, who were instrumental in the creation of this space, and continue to be huge contributors behind the scenes. \n\n@Nomograph Mastering, our own Master Splinter/ Master Oogway, who has contributed more deep, consistent, thoughtful knowledge than anyone.\n\n@cian riordan & @BatMeckley, our Mick and Keith, our Jay Z and Beyoncé, our Caligula and his horse. Two incredible record makers (with one Grammy between them!) who consistently make us laugh and think.\n\n@Rollmottle & @NoahNeedleman, who were such beautiful and consistent parts of the community that they earned the responsibility of becoming our most recent moderators. \n\nAnd @Davi Juno, who doesn't post much here, but has done all the editing and formatting for the YouTube versions of the Instagram streams, as well as all the clips.\n\nAll of these people are hugely responsible for this space!",
    "reactions": 48,
    "categories": [
      "mastering_general",
      "music_theory",
      "community_events",
      "artist_development",
      "industry_insights",
      "health_hearing"
    ],
    "is_expert": true
  },
  {
    "id": "877582578629103646",
    "author": "Slow Hand",
    "date": "2021-08-18",
    "content": "Hey @everyone. Our resident mixer and engineer @cian riordan made a badass post on Friday about his approach to mixing live drums. He even shared his template; great guy that he is. Did you catch it?\n\nIf not, which channel did he post it in? The hell if *I* know! Luckily we no longer have to trawl the Discord logs to locate it. His entire essay is now being hosted on the newly minted *Resources* section of the LWMR website.\n\nIn the coming weeks we’ll be filling this section in with some of the very best posts and nuggets of wisdom that have come through the LWMR server so far. No more brilliant posts lost forever in the torrent of people talking about Topping DACs or asking for a collab channel. Today we’re laying the foundations so that future generations might someday know how to make their 808s go *brrrrrrr*.\n\nhttps://www.livewithmattrad.com/resources",
    "reactions": 47,
    "categories": [
      "mixing_general",
      "community_events",
      "off_topic_fun"
    ],
    "is_expert": true
  },
  {
    "id": "1085040832488419431",
    "author": "Nomograph Mastering",
    "date": "2023-03-13",
    "content": "Stay available to the music people , it’s where all the healing is",
    "reactions": 46,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1419727400555511808",
    "author": "cian riordan",
    "date": "2025-09-22",
    "content": "https://youtu.be/dlz1ZjYaW8s?si=6k5sHGRe9FZgyIaI \nLet’s go @Nomograph Mastering",
    "reactions": 46,
    "categories": [
      "mastering_general"
    ],
    "is_expert": true
  },
  {
    "id": "1147190721741344798",
    "author": "Josh",
    "date": "2023-09-01",
    "content": "Well chat, my girlfriend became my fiancé today 🫡",
    "reactions": 45,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1325642862821507073",
    "author": "NoahNeedleman",
    "date": "2025-01-05",
    "content": "So at the urging of Cian & Rauirí and a few other good friends, I took a full 3 months off when my daughter was born. During my paternity leave, my creative outlets were cooking, and photography. \n\nPhotos are great cause you can snag a moment and then come back to it later to edit, cooking more difficult cause it takes time you might not always have. \n\nWell in typical captial C Creative fashion, i dug deep into it. I did a LOT of research and made some purchases and practiced a lot. Got some beautiful photos and captured some important memories. Really grateful for it. \n\nAll that’s just backstory to say- everywhere else on the internet SUCKS. \n\nReddit, Facebook, anywhere there are communities of people who are “trying to help,” it’s just full of tone deaf assholes with little info and a lot of bullshit to spew. And even the smart ones are 99% of the time tactless. \n\nGuys & girls, thank you for still being here. Best water cooler in the world: LWMR. \n\nAlso I wish we had a photography channel.",
    "reactions": 45,
    "categories": [
      "recording_general",
      "career_advice"
    ],
    "is_expert": true
  },
  {
    "id": "1416090361109024794",
    "author": "Rollmottle",
    "date": "2025-09-12",
    "content": "Yesterday morning, I was on a flight where the left engine loudly and noticeably blew on initial ascent and we had to make an emergecy landing after some very harrowing time in the air. Thought it was curtains, folks. I'm still here.",
    "reactions": 45,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1154983584961134662",
    "author": "Nomograph Mastering",
    "date": "2023-09-22",
    "content": "Also, 20 years married today so time for a glass of wine",
    "reactions": 44,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1436471638555103333",
    "author": "Nomograph Mastering",
    "date": "2025-11-07",
    "content": "Yes, Greg Calbi has retired and I’ve joined as a Senior Mastering Engineer. Staying in LA, staying in my room, the whole facility is becoming Sterling LA",
    "reactions": 44,
    "categories": [
      "mastering_general"
    ],
    "is_expert": true
  },
  {
    "id": "1458653018571542610",
    "author": "Nomograph Mastering",
    "date": "2026-01-07",
    "content": "@Rob Domos just gave me the best Christmas gift",
    "reactions": 43,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "958021509891383346",
    "author": "h3x",
    "date": "2022-03-28",
    "content": "Hey guys. Just been going thru some anxious times w my finances recently and would love some insight on peoples work situations (as long as they’re comfortable). So i wanna take a poll\n\nIf you are currently making a living/supporting urself solely off of music, react with this emoji 💯\n\nIf you are currently making a living/supporting urself with music AND a day/side job, react with this emoji 💻\n\nIf you are currently making a living/supporting urself with only a day job and music is just a passion for u, react with this emoji ❤️\n\nIll react with all three to make it easy, but i currently am looking to be in the 💻 scenario because of the need for the money. Its honestly hitting my ego a bit needing to do that, but wanted to see whos in what boat so i dont feel alone 😂 thank u guys ❤️",
    "reactions": 42,
    "categories": [
      "recording_general",
      "career_advice"
    ],
    "is_expert": false
  },
  {
    "id": "1352424374040399994",
    "author": "Eric Martin",
    "date": "2025-03-20",
    "content": "If you haven’t talked to a parent in a while, call them.\n\nLost my step-dad yesterday and thought about calling him last week but I didn’t. Don’t do that.",
    "reactions": 42,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1436471374779781292",
    "author": "Nomograph Mastering",
    "date": "2025-11-07",
    "content": "The cat is out of the bag!",
    "reactions": 42,
    "categories": [
      "off_topic_fun"
    ],
    "is_expert": true
  },
  {
    "id": "1046226359468445757",
    "author": "Slow Hand",
    "date": "2022-11-26",
    "content": "Ok, let me throw out one more question that I love to ask people:\n\nWhen you count silently from 1 to 10 in your head (1, 2, 3, 4, ... 10) how do you experience the numbers that are being counted?\n\nClick 👂if you hear a voice speaking the numbers out loud.\n\nClick 👁 if you see visual representation's of the numbers in your mind's eye. Like a numeric counter or numerals on a piece of paper.\n\nClick 👤 if you feel a pulse or a sensation in your body with each number.\n\nClick ❓if you experience something not mentioned. And please share.",
    "reactions": 41,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1326628572407926864",
    "author": "Nomograph Mastering",
    "date": "2025-01-08",
    "content": "Might be going to the Grammys in sweatpants fellas",
    "reactions": 41,
    "categories": [
      "industry_insights"
    ],
    "is_expert": true
  },
  {
    "id": "1172576011636965387",
    "author": "cian riordan",
    "date": "2023-11-10",
    "content": "Congrats to @Nomograph Mastering on his Grammy nom this morning! Remember, trophies for art are very important and a real indication of one’s success - especially @BatMeckley’s.",
    "reactions": 40,
    "categories": [
      "mastering_general",
      "industry_insights",
      "off_topic_fun"
    ],
    "is_expert": true
  },
  {
    "id": "1172739660234096660",
    "author": "cian riordan",
    "date": "2023-11-10",
    "content": "@everyone DM me if you’re up for a Grammy or Grammy adjacent (look up the rules) — this server is badass and we should document our dominance on the trophy game this year. ❤️",
    "reactions": 40,
    "categories": [
      "industry_insights",
      "off_topic_fun"
    ],
    "is_expert": true
  },
  {
    "id": "1203838803714777098",
    "author": "cian riordan",
    "date": "2024-02-04",
    "content": "Shoutout to our boy @chrissorem for scooping another trophy today!",
    "reactions": 40,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1364232647903154298",
    "author": "sinaigimenez",
    "date": "2025-04-22",
    "content": "Today I got a reminder of how important love and care are in what we do. Just wanna give a shoutout to @Nomograph Mastering for all the wisdom shared here on that topic.\n\nLong story short — I agreed to mix a track for an American rapper who had already been turned down by some A-list mixers, even though the guy had a decent budget. The reason was kinda obvious: he’s got a personality that leans toward OCD, with everything that comes with that — defensive tone in convos, super long mix notes, and weird stuff like thinking a file sounds different just because it was renamed. (I forgot to label one file as “ref. limited” like the previous versions, and even though it was literally the exact same file, he swore the “non-limited” one had a different top end.)\n\nStuff like that made me seriously consider walking away from the project like the others did — I could just feel the back-and-forth drama coming. But after my first instinct, I remembered a lot of what’s been talked about here: love, care, and being open to the music and the art. So I decided to try empathy instead of just being a jerk out of frustration.\n\nAnd honestly? It worked. After taking a bit of time to really talk to him and show I genuinely wanted to help — not just as a mixer, but as a human — I learned he’s totally burnt out and running on fumes 'cause he just became a dad. And I totally get that, since my first kid was born a month ago too. That connection shifted the whole vibe. The next round of notes actually made sense, and we ended up approving the first mix by version 4 — which isn’t bad at all. Happy client, job done.\n\nNot saying you should hang onto toxic clients, but it was a solid reminder: don’t always go with your first reaction. Sometimes just showing a little care  about the person on the other side can change everything. It did for me this time. And tbh, I don’t think I would’ve handled it this way if I hadn’t read some of the stuff shared here. So thanks, y’all. This place is gold.",
    "reactions": 40,
    "categories": [
      "mixing_general",
      "mastering_general",
      "troubleshooting",
      "career_advice",
      "creative_philosophy",
      "health_hearing"
    ],
    "is_expert": false
  },
  {
    "id": "1237983923309514772",
    "author": "cian riordan",
    "date": "2024-05-08",
    "content": "Surreal to be recording rock music at this level, in this caliber room today… of all days. I had two real guiding lights in my engineering journey, Eric V was one of them, and it was life changing  to work under him. Steve was the other. Unfuckwithable engineering prowess paired with the sharpest, most searing wit and intelligence. RIP to one of the greatest of our time. I wouldn’t be doing this if it wasn’t for his influence.",
    "reactions": 39,
    "categories": [
      "recording_general"
    ],
    "is_expert": true
  },
  {
    "id": "1263636671526736012",
    "author": "bobby k",
    "date": "2024-07-18",
    "content": "High thought from last night",
    "reactions": 39,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1372666833475473488",
    "author": "bobby k",
    "date": "2025-05-15",
    "content": "just a quick moment of gratitude for this place. i abuse yall for notes on records that are important to me and it consistently leads to noticeable growth in my perspective on my own work. and just better results in the final records. every damn time. we all know it's not the easiest to mix your own productions, especially when an artist is so chill and trusting with whatever you do. this proves how essential it is to have that healthy back n forth of getting honest critique and notes. criticism to me is a sign of respect. anyways you all know this shit already nothing golden here just yapping the same old truths. major shout in particular to Noah, Cian, Edsel, both Joshes, Bradley, Kyle, Justin, I'm not even tagging you guys cuz I've already blown your phones up enough. also a major shoutout to rick and ryan from make believe who've taught me so much about their incredible plugins as I'm now using them on everything. just some thursday gratitude is all. thanks!!",
    "reactions": 39,
    "categories": [
      "production_general",
      "daw_software",
      "plugin_discussion"
    ],
    "is_expert": true
  },
  {
    "id": "1162620327805857832",
    "author": "Nomograph Mastering",
    "date": "2023-10-13",
    "content": "Mastering a project that a fellow discorder mixed and I’m really struck tonight by the talent here",
    "reactions": 38,
    "categories": [
      "mastering_general"
    ],
    "is_expert": true
  },
  {
    "id": "1172614095372025896",
    "author": "Nomograph Mastering",
    "date": "2023-11-10",
    "content": "My message to Laura Sisk today who is the reason I’m on this record",
    "reactions": 38,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1241510689697300490",
    "author": "Rob Domos",
    "date": "2024-05-18",
    "content": "Huge congrats to @popaganda. on getting married! \n\nRight now I’m blasting this record he and his now wife made (Ruairi mastered). Highly encourage y’all to listen:\n\nhttps://tidal.com/album/277242515",
    "reactions": 38,
    "categories": [
      "mastering_general",
      "streaming_platforms"
    ],
    "is_expert": true
  },
  {
    "id": "1076587343651291346",
    "author": "oaklandmatt",
    "date": "2023-02-18",
    "content": "@everyone wish a big Happy Birthday to the great @cian riordan :ciangrammy: :cici: :smileflip:",
    "reactions": 37,
    "categories": [
      "industry_insights"
    ],
    "is_expert": true
  },
  {
    "id": "1092579797294665820",
    "author": "oaklandmatt",
    "date": "2023-04-03",
    "content": "@everyone I'm going live with @Nomograph Mastering tomorrow for round 2. I think we may just kinda wing it, but curious if there are topics people would like us to cover.",
    "reactions": 37,
    "categories": [
      "mastering_general"
    ],
    "is_expert": true
  },
  {
    "id": "1188691457515716709",
    "author": "David Fuller",
    "date": "2023-12-24",
    "content": "Hey guys I want to wish you all a merry Christmas. Discord is full of copypasted christmas messages, that people don’t even read and just forward to other servers. I don’t like that. I like to write what i deeply wish and what comes from my heart. Our friendships, from the most deep ones to the most virtual ones are very important and will never be represented by a simple message copied from elsewhere. This being said I would like to thank all of you. You are the best competitive basket weaving  discord I've ever been part of.",
    "reactions": 37,
    "categories": [
      "gear_hardware"
    ],
    "is_expert": true
  },
  {
    "id": "1208682175667372052",
    "author": "BatMeckley",
    "date": "2024-02-17",
    "content": "Look, its 15 minutes to midnight, so I’m going to get this out of the way early:\n\nHappy birthday Cian Riordan. I had to be friends with Matt Rad for YEARS and was convinced that nothing good was ever going to come from it. And then, because of that friendship, and that unspeakable endurance, I got to meet you. And then I no longer had any doubts: no, nothing good is going to come from that friendship. \n\nHappy 49th my dude. You’re a giant in my eyes.",
    "reactions": 37,
    "categories": [
      "matt_rad_references"
    ],
    "is_expert": true
  },
  {
    "id": "1272668518780764240",
    "author": "oaklandmatt",
    "date": "2024-08-12",
    "content": "Bummer for him but honestly it's part of why I do it like that. People who really want to hunt to be great find us. And casual people won't ever recognize me as a \"podcaster\" (no disrespect of course, just not what I want). \n\nWe all win.",
    "reactions": 37,
    "categories": [
      "learning_education"
    ],
    "is_expert": true
  },
  {
    "id": "1330337023051169854",
    "author": "Nomograph Mastering",
    "date": "2025-01-18",
    "content": "In a season of extraordinary complexity life suddenly seems very simple",
    "reactions": 37,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1452696309512540160",
    "author": "bobby k",
    "date": "2025-12-22",
    "content": "Who’s gonna take some time off this week?",
    "reactions": 37,
    "categories": [
      "recording_general"
    ],
    "is_expert": true
  },
  {
    "id": "1093297142141030471",
    "author": "NoahNeedleman",
    "date": "2023-04-05",
    "content": "My man’s a hopeless romantic ain’t he? \n\nWhen Steve Martin is asked how to succeed in Hollywood, his answer is “Be so good they can’t ignore you.” \n\nIf I were you, I’d focus more on becoming the most complete person you can. Then watch how the world responds to you.",
    "reactions": 36,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1182407964477358170",
    "author": "BatMeckley",
    "date": "2023-12-07",
    "content": "Friendly reminder that this is a season of kindness, and forgiveness. Have a little grace for our perceived enemies, give a bit more understanding to our collaborators, put in a little extra effort to not just do good in the world, but try to do it with kindness as well.",
    "reactions": 36,
    "categories": [
      "community_events"
    ],
    "is_expert": true
  },
  {
    "id": "1276954075564474559",
    "author": "LAPhill",
    "date": "2024-08-24",
    "content": "@Nomograph Mastering without wading into the unspeakable, luck and privilege shouldn’t be confused.. regardless, we all know that you have worked your ass off to get here, and we celebrate when talent gets recognized. No matter how hard your Irishness doesn’t want to accept it!",
    "reactions": 36,
    "categories": [
      "mastering_general"
    ],
    "is_expert": true
  },
  {
    "id": "1303146368117772330",
    "author": "BatMeckley",
    "date": "2024-11-04",
    "content": "Been working on this MPC Studio all day today, and was struck by how lucky I am to be a part of this server. Last night I had a question about an audio routing program and multiple people that are not on my payroll, they do not work for me or owe me anything, responded not just same day but within minutes with information that helped me get to where I was trying to go.\n\nSo many producers/writers/engineers/music makers/ dreamers are going to be better off, and way further along their paths, because of the wealth of knowledge and the generosity of the people on this discord, from the most seasoned mods to the newest noobs. And it’s entirely free. \n\nThanks @oaklandmatt for putting this thing together. There’s always something new to learn and this is a rad place to learn it.",
    "reactions": 36,
    "categories": [
      "production_general",
      "signal_flow",
      "matt_rad_references"
    ],
    "is_expert": true
  },
  {
    "id": "1326629566793515018",
    "author": "cian riordan",
    "date": "2025-01-08",
    "content": "Thanks for all the love guys. Team Riordan is safe and our house is safe for now.",
    "reactions": 36,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1441048005649240176",
    "author": "James Cronier",
    "date": "2025-11-20",
    "content": "I woke up to this today 😭",
    "reactions": 36,
    "categories": [],
    "is_expert": false
  },
  {
    "id": "887069412627202048",
    "author": "cian riordan",
    "date": "2021-09-13",
    "content": "@everyone yes, accidentally left them in the key basket.",
    "reactions": 35,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "944356783370158141",
    "author": "Zack Hames",
    "date": "2022-02-18",
    "content": "Just want to say it's been so cool to get to know so many of ya'll on this channel and hear work you've done and chat in depth, there's SO much talent and amazing perspectives on this channel and it's made a huge difference in my life since it's existed. thanks @oaklandmatt for making this community happen.",
    "reactions": 35,
    "categories": [
      "community_events",
      "matt_rad_references"
    ],
    "is_expert": true
  },
  {
    "id": "853995556765564928",
    "author": "Zakhiggins",
    "date": "2021-06-14",
    "content": "Just walked into a shop and a song I produced was on the radio hahahaha first time that's happened",
    "reactions": 34,
    "categories": [],
    "is_expert": false
  },
  {
    "id": "1046181558748459028",
    "author": "Slow Hand",
    "date": "2022-11-26",
    "content": "Sooooo.... It's come to my attention that not everyone has an internal monologue. A voice in their head. This is kind of wild to me. Supposedly as many as 50% of people don't have an inner monologue. \n\nIt never occurred to me that people wouldn't, but I guess I shouldn't be surprised. My mind's eye is pretty lo-res, while some of my friends have the ability to visualize very detailed imagery in their heads.\n\nNow I'm curious. Who here has an internal monologue and who does not?\n\nGimme a 👍 if you do have an internal monologue.\nGimme a 👎 if you don't have one.",
    "reactions": 34,
    "categories": [
      "gear_hardware",
      "career_advice",
      "artist_development"
    ],
    "is_expert": true
  },
  {
    "id": "1079227343131914260",
    "author": "BatMeckley",
    "date": "2023-02-25",
    "content": "I’m going to get absolutely hammered for this, but, you can’t be afraid to suck. It’s ok to suck. Stop spending all your time analyzing how not to suck and just go out and suck. And then suck again. And then suck again, but a little bit less. And just bake into the equation that you’ll suck for probably 50-100 songs. Because every success is built on a ton of previous sucking. Even Michael Jordan got cut from his highschool basketball team cause he sucked. But no one got worse at something the more they did it. You’re not supposed to be good at something right away. You’re supposed to suck, until you finally don’t. But you get to the suck less phase by actually sucking lots.",
    "reactions": 34,
    "categories": [
      "off_topic_fun"
    ],
    "is_expert": true
  },
  {
    "id": "1302913712302325882",
    "author": "Matthew The Cooke🎄🎅🏻",
    "date": "2024-11-04",
    "content": "https://www.theguardian.com/music/2024/nov/04/quincy-jones-musician-michael-jackson-producer-dies damn",
    "reactions": 34,
    "categories": [
      "production_general"
    ],
    "is_expert": false
  },
  {
    "id": "1327434984340062241",
    "author": "Nomograph Mastering",
    "date": "2025-01-10",
    "content": "Your messages and reposts of the GFM have been thoughtful and kind",
    "reactions": 34,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1059570176783298712",
    "author": "oaklandmatt",
    "date": "2023-01-02",
    "content": "@everyone I'm having Tyler Johnson on for the second time tomorrow. He's an amazing producer and songwriter and nerd who has become a good friend in the last year. He's been in the game for a long time, he's deeply knowledgeable and thoughtful, and he's coming off a huge year being nominated for five Grammys for the Harry Styles album he co-wrote and co-produced. \n\nHit us with questions and topics!",
    "reactions": 33,
    "categories": [
      "production_general",
      "songwriting",
      "industry_insights",
      "off_topic_fun"
    ],
    "is_expert": true
  },
  {
    "id": "1127375344157069323",
    "author": "BatMeckley",
    "date": "2023-07-08",
    "content": "Here’s the public service announcement that it is 110% ok to just produce or mix music as a hobby and not as your primary source of income. You can still find it incredibly fulfilling and not even be particularly good at it. Just because it’s not paying your bills does not mean it’s not a worth while pursuit. Music is magic. It’s supposed to be fun.",
    "reactions": 33,
    "categories": [
      "career_advice"
    ],
    "is_expert": true
  },
  {
    "id": "1257808107678203905",
    "author": "Rollmottle",
    "date": "2024-07-02",
    "content": "Hey folks, here's a little context on why that channel is no longer visible to certain members. The @moderators have had a long-running discussion about the risk of a scam happening in the sales channel. As the server continues to scale, it’s only a matter of time and is the last thing we want to have happen. \n\nWe’ve decided to restrict the sales channel to members who have been here 3 months or more and have been regularly active on the server. New members will no longer see the channel and will have to request access from one of the mods once they’ve been here longer than 3 months and have established themselves on the server. We’ve been looking for a bot that will help us automate this, but out of an abundance of caution, this was the simplest (free-est) solution for now.",
    "reactions": 33,
    "categories": [
      "music_theory"
    ],
    "is_expert": true
  },
  {
    "id": "1279089338293944332",
    "author": "Luke DeJaynes",
    "date": "2024-08-30",
    "content": "Wanted to shout out @Gerhard Westphalen for recently re designing my control room.  I’d been in there 11 years and it sounds way better than ever.",
    "reactions": 33,
    "categories": [
      "acoustics_studio"
    ],
    "is_expert": false
  },
  {
    "id": "1283900642045329418",
    "author": "Nomograph Mastering",
    "date": "2024-09-12",
    "content": "Hannie was colorful and often served but occasionally her brother (I think he was?) would take over, and he was almost blind. So he determined how full your glass was by keeping a finger in it as he filled it!",
    "reactions": 33,
    "categories": [
      "recording_general",
      "troubleshooting"
    ],
    "is_expert": true
  },
  {
    "id": "1291020663800332299",
    "author": "bobby k",
    "date": "2024-10-02",
    "content": "About a week ago I was in here moping about how I had like one thing on the calendar for the entire month and it was freaking me out. you guys had really great feedback, and @Josh Bowman compared it to walking on an invisible path in Mario which is so spot on. It ended up being a major positive because I was able to say yes to several things that came up since (which included two of the coolest opportunities I’ve had all year, one with producing for a new fav artist of mine and the other with a band I listened to a ton as a kid). And everyone was so glad I was able to be as flexible as I was and make things happen with full dedication at short notice. \n\nAll in all, hitting those scary moments where you’re broke and unbooked can be a rock solid motivator, and somehow yet again the universe is looking out for me. Didn’t even need to finish my soundbetter profile 😂",
    "reactions": 33,
    "categories": [
      "production_general",
      "songwriting",
      "off_topic_fun"
    ],
    "is_expert": true
  },
  {
    "id": "1304575708105937046",
    "author": "bobby k",
    "date": "2024-11-08",
    "content": "CONGRATULATIONS TO MYSELF FOR ENGINEERING AND MIXING PROMOTIONAL RADIO DIALOG RELATING TO THE TWISTERS SOUNDTRACK WHICH WAS NOMINATED FOR BEST COMPILATION SOUNDTRACK FOR VISUAL MEDIA!!!!! IF YOU LISTENED TO THE HIGHWAY XM, PANDORA, OR AMAZON MUSIC RADIO DURING THE MONTH OF JULY, 2024 AND HEARD AN AD SPOT FROM AN ARTIST NAMED NOLAN TAYLOR, YOU GOT THE PLEASURE OF HEARING MY 251, PRO-Q3 AND RVOX PUTTING IN SOME SERIOUS WORK!!!!!!!!!!!!!!!! EVERYBODY SAY CONGRATULATIONS BOBBYY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
    "reactions": 33,
    "categories": [
      "mixing_general",
      "streaming_platforms",
      "health_hearing"
    ],
    "is_expert": true
  },
  {
    "id": "1369325851501662218",
    "author": "chrissorem",
    "date": "2025-05-06",
    "content": "Story time:  yesterday I received a text from a manager I supposedly know. He Said I have an artist that has a jazz album that needs mixed. He asked me can you text him? I thought to myself that’s not normally how this goes but sure..  so I texted and within an instant, he called me. He said.” did you look me up?” I said no I just texted you like I was asked. He said.” you should look me up.” he proceeded to tell me  he’s been signed to major label  for 25 years. Supposedly Warner brothers and followed with they gave him $600 to mix this album which then I said I’m sorry but I can’t help you.. he said “send me a number of someone who can mix a jazz album.” I sent him to a friend who I know it was hurting for work.. then he text me back about five minutes later and said this guy never mixed a jazz album before. Send me  somebody who mixed a jazz album preferably over 40. I sent him Al Schmitt’s contact and he responded to me. “All has  been dead for several years get with it man.”\n\nthere’s nothing to be learned here.",
    "reactions": 33,
    "categories": [
      "gear_hardware",
      "industry_insights"
    ],
    "is_expert": true
  },
  {
    "id": "1448331341140721745",
    "author": "bobby k",
    "date": "2025-12-10",
    "content": "I have lots of ideas. Most are shit. This one is gold. Drop a FW if you’re down to start this movement with me.",
    "reactions": 33,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "986394646538231820",
    "author": "cian riordan",
    "date": "2022-06-14",
    "content": "Got this handy new box to send files to clients in.",
    "reactions": 32,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1017148253373988934",
    "author": "cian riordan",
    "date": "2022-09-07",
    "content": "Quick poll for the gang – how many of you are mainly listening with stereo as your default (= 🔊) and how many are mostly consuming Spatial/Atmos (= 🌐) when they can? Genuinely curious as it's been a year and change since the big Apple switchover.",
    "reactions": 32,
    "categories": [
      "atmos_immersive"
    ],
    "is_expert": true
  },
  {
    "id": "1073612896610812005",
    "author": "NoahNeedleman",
    "date": "2023-02-10",
    "content": "I know @oaklandmatt and Castelli said this a lot on the pod. \nMake friends. Make art. Make each other better. 🙌🏻",
    "reactions": 32,
    "categories": [
      "matt_rad_references"
    ],
    "is_expert": true
  },
  {
    "id": "1076746467907215360",
    "author": "cian riordan",
    "date": "2023-02-18",
    "content": "Thanks gang! Feeling very loved on this spin around the earth. All I ask for my birthday is to try going from 61.2% mix to 0% on your next go around. Trust your instincts and be yourselves. I love y’all.",
    "reactions": 32,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1239288926779211869",
    "author": "BatMeckley",
    "date": "2024-05-12",
    "content": "Happy Mother’s Day to all the mothers on the discord… especially, well, ya know.",
    "reactions": 32,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1239650488874700952",
    "author": "cian riordan",
    "date": "2024-05-13",
    "content": "Half my job as a mixer is trying to make things sound good. The other half is eating shit on notes that I don't fully agree with. The other half is being psychologist. The other half is trying to get paid. And the other half is trying to learn math.",
    "reactions": 32,
    "categories": [
      "career_advice"
    ],
    "is_expert": true
  },
  {
    "id": "1330335977201205279",
    "author": "Nomograph Mastering",
    "date": "2025-01-18",
    "content": "It’s something like being a believer all your life, having faith but then having it verified beyond doubt by witnessing a miracle firsthand",
    "reactions": 32,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1340833544133545994",
    "author": "Edward Rivera",
    "date": "2025-02-16",
    "content": "Found 2 handsome dudes walkin’ around paris",
    "reactions": 32,
    "categories": [],
    "is_expert": true
  },
  {
    "id": "1383175059639767311",
    "author": "Nomograph Mastering",
    "date": "2025-06-13",
    "content": "...completely unrelated to anything  but on my mind this morning\n\nSomething I've said here (maybe too) often is that approaching the work in a loving way is a real unlock. Love being a quaity of a attention, a way of meeting things. It might not be obvious but it can start small and grow out embracing many more aspects of what we do\n\nI mastered an album a few months back for a phenomenal indie artist, @Rob Domos and I both absolutely loved the music and the overall experience. The artist's team came back this week with a last minute request to remaster what was probably my favorite track with an added feature from a legacy artist. It's kind of mind bending how much better it is\n\nRob and I spent some time yesterday just appreciating that someone (the artist, manager, A&R?) actually thought up the idea of this feature and made it happen. I was so content with what it was but someone somewhere was like *\"you know what would be sick ...\"* and made it real. And now the world gets to receive something beyond what we could have imagined, something we didn't even know we needed\n\nJust focussing our attention on that for 2 mins in the hall yesterday made the day better and put some gas in the tank. There are so many challenges in what we do, it really helps to take time to focus attention on the jewels strewn everywhere too. They are not always immediately obvious",
    "reactions": 32,
    "categories": [
      "mastering_general",
      "recording_general",
      "community_events",
      "industry_insights"
    ],
    "is_expert": true
  },
  {
    "id": "1398687134013194290",
    "author": "NoahNeedleman",
    "date": "2025-07-26",
    "content": "My little bro just told me “expertise isn’t necessarily knowing how to do it right; expertise is knowing what’s wrong.”\n\nChewing on that.",
    "reactions": 32,
    "categories": [],
    "is_expert": true
  }
]